{
    "Job ID": "1297928",
    "Description": "الوظيفة: أمين مستودع\n (يجيد استخدام برنامج (Microsoft Dynamic ERP – AX)\n\nالهدف والغرض من الوظيفة:\nتنفيذ الخطط وتنظيم كل الأمور المتعلقة بالمخازن (خامات، منتج نهائي، منتج تحت التشغيل، والمساحات التخزينية) ورفع تقرير لمدير المخازن بالاحتياجات المطلوبة وتنظيم دخول وخروج المخزون طبقاً للإجراءات المعتمدة.\n\nالمهام والمسؤوليات الرئيسية لأمين المستودع:\nاستلام المواد المختلفة التي ترد إلى المستودع ومطابقة كمياتها ومواصفاتها وتخزينها حفظها بما يتوافق مع السياسات والإجراءات المنظمة.\nاستلام وتخزين البضائع الواردة للمستودع والصرف منها وفق النظم والقواعد المتبعة.\nينفذ القواعد الواردة في دليل سياسات وإجراءات المستودعات ومراقبة المخزون المعتمد في الشركة فيما يتعلق باستلام وصرف المواد وتخزينها.\nيشرف على استقبال البضائع الواردة للمستودع ويفحصها ويطابق مواصفاتها مع المستندات والفواتير المرفقة. - يستلم ويخزن ويرتب المواد الواردة وفق قواعد التخزين المعتمدة.\nيشرف على إعداد مستندات الإدخال والإخراج وتسجيلها في سجلات المستودع.\nيحتفظ بسجلات يدوية أو آلية محدثة عن المستلم والمنصرف والمخزون في المستودع وفق النظم المتبعة في الشركة.\nيشرف على إعداد التقارير الإحصائية الدورية عن المستلم والمنصرف والمخزون ويرفعها إلى رئيسه المباشر.\n يبلغ رئيسه المباشر عند الوصول لنقطة إعادة الطلب.\nيبلغ رئيسه المباشر عن المواد الراكدة أو التالفة ويوصي بالإجراءات اللازمة حيالها.\nيساعد لجان الجرد في جرد الأعيان الموجودة في المستودع.\nيتأكد من تطبيق ضوابط الأمن والسلامة في المستودع.\nيعد تقارير تقييم الأداء للعاملين في المستودع ويقترح التدريب المناسب لهم.\nيتأكد من تحديث قواعد بيانات المستودع.\nيرفع تقارير دورية وسنوية عن نشاطات وإنجازات المستودع إلى رئيسه المباشر.\nيقوم بأية أعمال أخرى يكلفه بها رئيسه المباشر وتقع ضمن طبيعة عمل الوظيفة.\nصرف الطلبات الواردة من الجهات المختصة وتجهيزها وشحنها.\nإعداد مذكرات استلام المعدات والأجهزة الفنية من قبل الشركات المختصة.\nصرف الطلبات الواردة من الجهات المختصة بموجب المستندات النظامية والعمل تجهيزها وشحن الأجهزة والمعدات والمواد إلى الجهات التي تطلبها.\nمسئول عن تنفيذ الخطط والبرامج التنفيذية الخاصة بالمخازن والتي تصب في النهاية لتحقيق الأهداف الرئيسية للمؤسسة.\nتنفيذ أذون الصرف والارتجاع والإضافة.\nمسئول عن تنظيم الوحدات التخزينية والأرفف وسلامة المخزونات وفقاً لتعليمات التخزين.\nالإشراف على العمال أثناء عمليات إضافة المخزونات وترتيبها وتنظيمها بالشكل الصحيح وفقاً للتعليمات.\nاقتراح الإجراءات التحسينية والعلاجية والوقائية التي من شأنها تحسين أداء العمل بإدارته.\nتنفيذ جميع المهام التي يطلبها مدير المخازن ومنسق المخازن في حدود العمل بإدارة المخازن.\nرفع تقرير أسبوعي إلى مدير المخازن ومنسق المخازن لبيان ما تم إنجازه وما تم تأجيله مع بيان السبب.\nجميع ما سبق ذكره يجب أن يتم طبقاً للإجراء الرسمي المعتمد لإدارة المخازن\nمسؤول عن حفظ جميع سجلات نماذج الجودة الخاصة بإجراء إدارة المخازن وجميع أعماله تخضع للمراجعة الداخلية.\nإعداد وتقديم تقارير العمل وتوثيقها وحفظها.Skills",
    "Skills": [
        "المؤهلات والخبرات:\nالخبرات:\nلا تقل عن (5) سنوات في نفس المجال..\nأالمؤهلات :\nبكالريوس إدارة الأعمال أو أي تخصص آخر مناسب.\n\n    يجيد استخدام برنامج (Microsoft Dynamic ERP – AX)\nالقدرة على التعامل مع أجهزة المراقبة وأجهزة الكمبيوتر وغيرها.\nإمكانية التواصل بشكل جيد مع الآخرين كتابياً وشفهياً.\nيجب أن يكون على علم تام بكافة اللوائح والقواعد الخاصة بالشركة التي يعمل بها.\nالقدرة على تحمل ضغط العمل."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Warehousing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}