{
    "Job ID": "3762632",
    "Description": "الوصف الوظيفي لنائب الرئيس\nاالمهام والمسؤوليات والأهداف المطلوب تحقيقها\n1) الهدف والغرض من الوظيفة:\nالمشاركة في صياغة الأهداف ووضع الخطط والسياسات العامة والمسئولية عن إعداد البرامج التنفيذية للخطط والسياسات المعتمدة وتفعيل وتنفيذ قرارات الرئيس التنفيذي بأعلى قدر ممكن من الكفاءة والمسئولية.\n2) المهام والواجبات الرئيسية:\n1. المساعدة في إدارة الشركة بما يتوافق مع السياسة والرؤية المحددة وتحقيق أعلى إيراد وإنجاز الأهداف المطلوبة.\n2. المشاركة في رسم الخطط ووضع الأهداف الرئيسية للشركة والمشاركة في صياغتها وتقسيمها إلى أهداف فرعية لكل إدارة بالتعاون مع الرئيس التنفيذي بشكل يحقق الوصول إلى تحقيق الأهداف الرئيسية للشركة.\n3. المساهمة في رسم السياسات العامة والإستراتيجيات والخطط للشركة تهيئة لإقرارها ومن ثم العمل على تنفيذها ومتابعتها.\n4. الإشراف على إعداد خطط العمل التفصيلية والبرامج التنفيذية في مجال اختصاصه ومراجعتها والتحقق منها وكذلك ميزانيات التنفيذ قبل اعتمادها من الرئيس التنفيذي.\n5. مراجعة ومناقشة الحسابات الختامية والميزانية التقديرية للشركة ورفعها للرئيس التنفيذي تهيئة لإقرارها.\n6. اتخاذ القرارات المنظمة لسير العمل في مجال اختصاصه ومتابعة تنفيذ القرارات الصادرة من الرئيس التنفيذي والقيام بالجولات الميدانية التي تسهم في تحقيق ذلك.\n7. الإشراف على نشاطات الإدارات التابعة له والتأكد من أن أسلوب عملها يتماشى وتحقيق الأهداف المرسومة واتخاذ القرارات اللازمة بشأنها.\n8. متابعة إعداد ومناقشة وتقييم نتائج أعمال السنة مع مدراء الإدارات التي تقع تحت اختصاصه ورفعها إلى الرئيس التنفيذي لاتخاذ اللازم بشأنها.\n9. اقتراح السياسات والبرامج الخاصة بتطوير وتوسيع أنشطة الشركة تهيئة لمناقشتها وإقرارها من قبل الرئيس التنفيذي.\n10. مناقشة جميع الاتفاقيات والعقود التي تتعلق بأعمال الشركة مع المستشار القانوني للشركة واتخاذ الإجراءات اللازمة لاعتمادها من قبل الرئيس التنفيذي.\n11. العمل على تنمية العلاقات الجيدة مع المؤسسات والهيئات الخارجية ذات الصلة بمجال اختصاصه لما فيه مصلحة الشركة والقيام بالزيارات التي تعمل على تحقيق ذلك.\n12. مناقشة إمكانية الائتمان والتمويل والاقتراض مع الجهات المالية والبنوك بما يمكن الشركة من الاستفادة من الفرص التمويلية لهذه الجهات وفقاً للصيغ الإسلامية المعتمدة والمتعارف عليها.\n13. الاجتماع الدوري بمدراء الإدارات التابعة له والعمل على حل ما يعترض سير العمل من مشاكل ومتابعة تطور العمل بهذه الإدارات.\n14. تنظيم العلاقات بين الأقسام وآليات التخاطب حسب الهرم الوظيفي والحد من تداخل المهام والصلاحيات ووضع الشخص المناسب في المكان المناسب.\n15. التعاون مع الرئيس التنفيذي في صياغة وتقنين التوصيات والقرارات الصادرة من مجلس الإدارة ووضع الخطط المناسبة لتنفيذ هذه التوصيات والقرارات.\n16. المراجعة النهائية للترقيات والتسكين الوظيفي والمرتبات في نهاية كل عام قبل العرض على الرئيس التنفيذي.\n17. تمثيل الشركة أمام الغير وكذلك في المناسبات والحفلات والمقابلات الرسمية بتفويض من الرئيس التنفيذي.\n18. اتخاذ جميع القرارات اللازمة التي تمكن الرئيس التنفيذي من تنفيذ التكليفات والخطط المكلف بها.\n19. بنوب عن الرئيس التنفيذي في حالة عدم تواجده.\n20. القيام بأي أعمال أخرى يكلفه بها الرئيس التنفيذي وتكون ضمن طبيعة عمله.\n3) المسئوليات الرئيسية:\n1. ضمان حسن الإدارة والقيام بأعمال الإدارة من تخطيط وتنظيم وتوجيه وتوظيف وسعوده وتقييم وتحفيز العاملين ومتابعة وتطوير أدائهم ورفع إنتاجيتهم وخفض التكاليف ... الخ .\n2. مسئول عن متابعة سير العمل بجميع لإدارت بالشركة والمحافظة على حسن أدائها وتطوير العمل بها والتأكد من جودة التنفيذ ضمن البرامج المحددة.\n3. تطوير العمل الإداري والمالي بالشركة بما يتناسب مع إمكانيات وخبرات الشركة والأعمال الحالية ولا يتعارض معها. \n4. التأكد من تسديد الشركة ما عليها من التزامات وتحصيل ما لها من ديون.\n5. متابعة تنفيذ القرارات الصادرة من الرئيس التنفيذي والإجراءات الإدارية والمالية وتقييم فاعلية أداء الوحدات الإدارية المختلفة.\n6. العمل على المحافظة على أصول الشركة وممتلكاتها ووضع الإجراءات والترتيبات اللازمة التي تحمي هذه الأصول من الحريق والسرقة ... الخ بالتنسيق مع مسئول الصيانة بالمبنى.\n4) – الأهداف المطلوب تحقيقها:\n1. تحقيق مبدأ الإدارة الرشيدة بخفض التكاليف وزيادة الإيرادات وتحقيق أهداف الشركة المالية والإدارية المطلوبة.\n2. تنظيم وتطوير وتفعيل العمل بجميع الادارات بالشركة وأقسامها ووضع السياسات والأليات والإجراءات اللآزمة التي تنظم متابعة وإدارة السيارات وكذلك التي تضبط شراء المواد المطلوبة للمشاريع ووصولها للجهة الطالبة لهذه المواد واستخدامها في الأغراض التي طلبت وعدم هدرها أو تسربها لأي جهة أخرى سوى أكان ذلك بقصد أو بغير قصد.\n3. متابعة تقارير الحضور والغياب والتزام الموظفين من خلال إدارة الموارد البشرية وتوقيع الخصومات والجزارات اللآزمة وفقاً لسياسة الشركة.\n4. رفع التقرير نصف الشهرية والشهرية والنصف سنوية والسنوية للرئيس التنفيذي ومناقشة هذه التقارير في الاجتماعات الدورية.\n5) – السلطات الخاصة بنائب الرئيس للشئون الادارية والمالية:\n• سلطة صناعة القرار:\n1- يملك نائب الرئيس سلطة صناعة واتخاذ القرارات فيما يتعلق بالأمور التي تكون على مستوى وحدود اختصاصاته وما هو مفوض فيه وما تعدى ذلك يتم رفعه لسعادة / الرئيس التنفيذي باعتباره جهة الاختصاص والرئيس المباشر له.\n2- يملك نائب الرئيس الحق والسلطة المطلقة في محاسبة ومراجعة أعمال الموظفين وإصدار التوصيات الخاصة بتوقيع الجزاءات الإدارية والفصل والإحالة إلى التحقيق لجميع الموظفين والمسئولين بالشركة بعد موافقة الرئيس التنفيذي.\n3- يملك نائب الرئيس الحق في إجراء المقابلات وتعين الموظفين غير القياديين من خلال لجنة التوظيف ورفعهم للرئيس التنفيذي للشركة بغرض اعتمادهم.\n4- يملك نائب الرئيس الحق المطلق في سؤال جميع العاملين والمسئولين في حدود اختصاصه عن أحوال العمل والمشاكل التي تواجههم وذلك في أي وقت.\n5- يملك نائب الرئيس الحق في طلب أي بيانات أوتقارير من أي جهة في حدود اختصاصه فيما يخص المواضيع التي يرى معالجتها وضرورة تفعيلها.\n• السلطات المالية:\nيملك نائب الرئيس سلطة مالية في حدود ما يتم إقراره من قبل الرئيس التنفيذي وما تعدى ذلك يتم رفعه لسعادة الرئيس التنفيذي باعتباره جهة الاختصاص والرئيس المباشر.\n\n6) – نطاق المسئوليات الإشرافية:\n نائب الرئيس مسئول مسئولية كاملة عن آداء العاملين في مجال اختصاصه وعن حسن إدارته وعن كل القرارات التي يوقع عليها وعن سلامة أي مستند يقوم باعتماده أو مراجعته.\n نائب الرئيس مسئول عن كل أخطاء إدارية أو مالية تصدر عن موظفيه ومتابعة سير العمل بإداراتهم وتحقيق الأهداف والإنجازات المطلوبة منهم من حيث الكفاءة والجودة والمدة الزمنية.\n7) – الهيكل التنظيمي:\n نائب الرئيس للشئون مسئول مباشرةً أمام الرئيس التنفيذي للشركة.\n المسميات الوظيفية المسئولة مباشرةً أمام نائب الرئيس هي: جميع الادارات بالشركة.Skills",
    "Skills": [
        "1- الإلمام بالجوانب المالية.\n2- يجيد أساليب وأدوات التخطيط والتحليل والحلول.\n3- معرفة بإستخدام الكمبيوتر.\n4- يفضل من له معرفة بإستخدام ال (ERP Microsot Dynamic 365)"
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}