{
    "Job ID": "3801802",
    "Description": "• Opens customer accounts by recording account information.• Maintains customer records by updating account information.• Resolves service problems by clarifying the customer's complaint; determining the cause of the problem; selecting and explaining the best solution to solve the problem; expediting correction or adjustment; following up to ensure resolution.• Effectively manage large amounts of incoming calls and emails• Identify and assess customers’ needs to achieve satisfaction• Build sustainable relationships of trust through open and interactive communication• Provide accurate, valid and complete information by using the right methods/tools• Handle complaints, provide appropriate solutions and alternatives within the time limits and follow up to ensure resolution• Keep records of customer interactions, process customer accounts and file documents• Follow communication procedures, guidelines and policies• Take the extra mile to engage customers’ requirementsSkills",
    "Skills": [
        "• It must possess well sound customer service and problem-resolution skills.",
        "• It must be able to perform at high levels of pressure and be flexible with timings and working hours.",
        "• Well organized and English proficiency is a must.",
        "• Polite and confident with a great deal of patience",
        "• Ability in multitasking and time-management",
        "• Aptitude in resolving issues with a customer-focused orientation"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}