{
    "Job ID": "3836830",
    "Description": "We are expecting the Head Pastry Chef to oversee products for our 3 brands and can perform the following duties (among others):The Head Pastry Chef is expected to consistently produce top quality dishes while delegating tasks to other cooks and assistants.\nOversee a team of 5+ pastry chefs\nManage pastry and dessert products for 3 brands\nPrepare daily mixtures and other necessary preparations before opening.\nEnsure readiness for service during regular and peak hours.\nBe in charge of new product development.\nCosting recipes.\nImplement Quality Control procedures.\nMonitor and control stock levels daily, weekly and monthly.\nEnsure that the preparation as well as storage of food meets company and statutory health and safety requirements.\nImplement and ensure the company Health & Safety and Food Hygiene requirements are met at all times. Ensure temperature records and food labeling are maintained and up-to-date.Skills",
    "Skills": [
        "Minimum 3-5 years experience as Head Pastry Chef in a successful restaurant or bakery\nStrong pastry and baking skills\nEnthusiasm to work in the food industry\nStrong communication skills\nStrong leadership skills\nTeamwork and ability to manage a team of 5+ chefs\nA strong understanding of produce and ingredients\nExcellent in English (written and verbal)\nKnowledge of POS software and restaurant management software\nFundamental knowledge and use of Microsoft Excel and Word.\nKnowledge of catering preparation and procedures\nHave an active and creative interest in food - especially pastry and dessert."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}