{
    "Job ID": "3859667",
    "Description": "• Deal directly with customers either by telephone, electronically or face-to-face.• Directs customers to online resources.• Updates customer records in the system, including notes about interactions.• Respond promptly to customer inquiries.• Handle and resolve customer complaints.• Organize workflow to meet customer timeframes.• Update and maintain customer database.• Communicate and coordinate with internal departments.• Provide feedback on the efficiency of the customer service process.• Manage large amounts of incoming calls.• Generate sales leads.• Identify and assess customers’ needs to achieve satisfaction.• Track record of over-achieving quota.• Build sustainable relationships and trust with customer accounts through open and interactive communication.• Provide accurate, valid and complete information by using the right methods/tools.• Meet personal/customer service team sales targets and call handling quotas.• Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution.• Keep records of customer interactions, process customer accounts and file documents.• Follow communication procedures, guidelines and policies.• Take the extra mile to engage customers.• Managing digital marketing tools and social media sources (Facebook, Twitter, Instagram, etc.) to ensure Company exposure and interaction with prospective clients and existing tenants.• Managing existing Webpage and arrange events via on-line calendar postings.Skills",
    "Skills": [
        "• Proven customer support experience or experience as a client service representative.",
        "• Strong phone contact handling skills and active listening.",
        "• Familiarity with CRM systems and practices.",
        "• Customer orientation and ability to adapt/respond to different types of characters.",
        "• Excellent communication and presentation skills.",
        "• Ability to multi-task, prioritize, and manage time effectively."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Qatar",
        "Gender": "Male",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}