{
    "Job ID": "3885580",
    "Description": "To define, develop and maintain the enterprise architecture artifact and govern the use and implementation of technology to ensure the alignment of technology in delivering the business capabilities required by the organization now and in the future. Ability to develop and provide guidance on solution architecture views and viewpoints (logical and physical): Application, Infrastructure, Data, Integration, and Security\nUnderstand how emerging technologies can enable new business capabilities and be able to develop conceptual, logical and physical architecture blueprints to develop the initiatives required to achieve the target state.\nUtilize and maintain enterprise architecture methodologies and techniques, including standards and guidelines for enterprise\nwide use in systems development processes.\nFollow the IT strategies, the enterprise architecture road map, and the related blueprints.\nCoach and mentor junior resources\nAssociates and Senior Associates\nDesign and lead architecture engagements aligned to a client's business need and the defined enterprise architecture road map.\nPropose a change in the defined enterprise architecture road map when there is a new business initiative, a change in business strategy, a foreseen increase in business value or a better alignment to business strategies.\nManage client expectations, resolve issues and effectively manage scope changes.\nLead practice development and contribute to creation of intellectual capitals for the firm.\nOversee proposal and RFP preparation and lead or participate in the presentation of proposals to clients.\nDefine, document and maintain the business domain architecture(s) to ensure that the organization understands the technology capabilities that require alignment with business capabilities.\nDevelop and continually update/maintain architecture artifact, road maps / plans, and standards that enable the development of systems that efficiently and reliably support business processes / capabilities.\nDefine and manage the framework and governance for how IT components interact in order to ensure systems of technology and business processes that work together effectively.\nFollow and maintain the principles, policies and standards that ensure the effective incorporation of business architecture into technology architecture and solution design.\nManage the review process to ensure that new technology architectures are consistent with organization’s business needs.\nLead the implementation of strategies, architecture artifact, plans, and policies for applications, infrastructure, and data systems. Propose changes as needed.\nMaintain awareness of industry and technology trends/practices to identify best\nin\nclass technology architecture practices.\nProficient knowledge of project management, organizational and team\nbuilding skills\nAbility to mentor junior architectsSkills",
    "Skills": [
        "Bachelor or Master degree in computer science, computer engineering or equivalent experience; Certification in TOGAF or another enterprise architecture is strongly recommended.\n8 to 10 years experience of IT design and delivery experience of solutions involving enterprise level applications, databases, integration, and infrastructure components.\nAt least 7 years of experience in enterprise architecture roles or prior experience as an architect at a large corporation\nKnowledge of technology in the business domain gained through experience working in firms that engage in commercial activity of a similar nature to organization.\nProven expert level architecture design and modelling skills\nDeep understanding of the business architecture standards and components gained through years of experience working in enterprise architecture, including working as an architect and/or domain expert."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}