{
    "Job ID": "3995568",
    "Description": "General1.     Direct, manage and lead T/A’s, supervisors, specialists, and sub-contractors during outages.2.     Support FS Back Up Office for outage related matter (development of outage documents, customer meeting, resource planning, etc.)Detailed1.     Optimize the use of personnel on sites2.     Implement quality control procedures during disassembly, inspection, and assembly of turbines and related equipment.3.     Review disassembly data and clearances and provide recommendations.4.     Review unit start-up and post outage operation data and abnormalities.5.To update FS Skilled Matrix5.     Develop and maintain positive relationship with customer personnel.6.     Manage outage implementation budget control.7.     Generate detailed field report and daily reports in a timely manner.8.     Assist with improvements to outage tools and equipment.9.     Develop, review, revise field procedures, and related technical information.10.  Interpret and apply drawings, field procedures, and technical documents to open/close activities.11.  Hold permits if required12.  Mentor and train personnel13.  Forecast and schedule resources for field service outages.14.  Support customer/internal negotiation and implementation meetings as required.Skills",
    "Skills": [
        "1. Project Management:",
        "Expertise in project planning, execution, and monitoring to ensure outage projects are completed within scope, budget, and timeline.",
        "2. Technical Knowledge:",
        "Understanding of the technical aspects related to the specific field (e.g., energy, telecommunications, utilities) to effectively manage outage situations.",
        "3. Problem-Solving:",
        "Ability to quickly identify and analyze issues during outages, implementing effective solutions to restore services promptly.",
        "4. Communication:",
        "Strong verbal and written communication skills to coordinate with cross-functional teams, stakeholders, and customers during outages."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 7 Max: 20",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Installation & Technical Services",
        "Company Type": "Unspecified",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}