{
    "Job ID": "4095798",
    "Description": "The document specialist is responsible for receiving, control, security, recording, accessibility, and timeliness of organizational documents such as policies, procedures, guidelines, forms, templates, and training materials. Ensure quality and compliance with organization policies and procedures with regards to document management.Strategic Responsibilities1.     Proactively seek problem prevention measures to ensure business operational and continuity2.     Perform process re-engineering to optimize business processes3.     Map business requirements to the organization strategic goals and objectives4.     Ensure adapted and implemented KPI’s are met5.     Identify opportunities for continuous improvement to enhance performance and quality of work with a view of stakeholders’ expectations.Operational Responsibilities1.      Perform the role of the custodian of Document Control system(s), policies, and standards and liaise with other document control functions on operational standards2.      Review the completeness and correctness of all documents belonging to a respective function / directorate3.      Conduct end to end business analysis and design of content lifecycle management within DMS electronic file system.4.      Design and deploy firm information document governance, email, security and privacy policies related to content in the DMS.5.      Help develop and enforce documentation design, review, and storage guidelines6.      Ensure that organizational documents go through a documented and approved review-and-approval process before being stored.7.      Designing, documenting, implementing and deploying implementations of DMS system.8.      Ensure follow-up with concerned stakeholders on missing signatures, addendums, and other documentation. Receive, sort, and examine all incoming and outgoing documents (including external and all internal related documents)9.      Collect and archive all documentation including confidential documents, and share / circulate on need basis10.    Develop key search string references for all documentation uploaded into system to ease process of searching for documents11.    Ensure the security, accessibility, and proper distribution of organizational documents.12.    Distribute documents to internal and external parties and as required by stakeholders13.    Ensure adherence to standards and procedures, in:a.      Scanning and uploading live documentsb.      Setting search attributes for each file to ensure ease of retrievalc.      Ensuring bulk scanning processingd.      Distributing documents to internal and external parties14.    Perform and document regular Access Review and audit activitiesSkills",
    "Skills": [
        "Bachelor degree in Business Administration or Computer Science relevant degree\nMinimum of 6 years’ experience in document management and document management systems\nMinimum of 2 years’ experience as Document Manager or a Head Position\nMinimum of 3 years’ experience in ITExperience in content management systems software is preferredExperience in software design and development is plus\n(Qatari National)"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Qatar",
        "Nationality": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Non-profit Organization; Military & Defense",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}