{
    "Job ID": "4143835",
    "Description": "Sales Executive (Chinese/Mandarin Speaking)Are you ready to grow your dream career while making others vacation dreams come true? Marriott Vacations Worldwide is the world premier organization for Vacation Ownership with resorts at destinations around the globe. Join our team and help deliver unforgettable experiences that make vacation dreams come true.Department: Marketing and SalesJob Family: Marketing and SalesReports to: Sales ManagerJOB SUMMARY Contribute to the success of the organization and sales distribution site by effectively using sales techniques and processes to convert prospective owners into purchasers. Develop relationships with prospective owners by soliciting and following up on referrals and leads. Cater the sales experience to the individual needs and preferences of each potential owner, and follow through with the sales contract process to ensure that all required paperwork and legally required documents are completed accurately and in a timely manner efficiently. Maintain the customer relationship after the sale is complete to ensure continued owner satisfaction with the organization and to develop future business opportunities (referrals, additional sales).JOB SPECIFIC TASKS Building and Maintaining Customer Base Giving Sales Presentations Conducting and Managing Business Transactions Providing Service to OthersMarriott Vacations Worldwide is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture.Skills",
    "Skills": [
        "Education and Experience Required:",
        "• High school diploma or GED",
        "• One-year related experience Successful Candidates Will Be Willing To:",
        "• Work in the evenings (occasionally)",
        "• Must be willing to work weekends and holidays as required by business needs",
        "• Fluent in MANDARIN and ENGLISH",
        "• Willing to travel outside UAE when the business demands."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Nationality": "China; East Asia; Hong Kong; Macau; Malaysia; Singapore; Taiwan",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "Unspecified"
    }
}