{
    "Job ID": "4151360",
    "Description": "Understand Agriculture machinery operations and parts / consumables\nCheck all parts in parts catalog and manuals as per equipment model and serial number\nAssist all customers (retail and workshop) in selecting required parts in a professional and efficient manner.\nInforms customers of companion parts requirements and specials and ensures that the customer is exposed to the full product line.\nAnswer phone calls, providing price quotes and other information in professional manner.\nProvides high level of service to internal and external customers\nNotifies Parts Manager of out of stock part or shop materials that need immediate attention.\nNotifies the service advisor and the customer when special ordered parts have been received.\nFollow up on back-ordered parts from supply chain team.\nAssist outside sales representatives with their orders.\nMake sure all internal requests for parts are posted and goods movement is done.\nEnsures that all customers receive their copy of the invoices and sign receiving of goods\nIssues credit for parts returned, ensuring that the original invoices or its number is available so that the purchase and pricing can be verified.\nUpdate technical knowledge by reading all the technical reports from suppliers and knowing the new update information in the EPC.\nKeeps orderly records of all parts orders from workshop\nSets up orders for daily shipment, delivery or pick up\nKeeps rear and front counter areas clean and uncluttered\nClean computer terminals and printer daily\nParticipate in approved training programs and keep himself undated with units sold from sales department.\nUpdate parts manager with lost sale and follow given KPI\nMaintain professional appearance and carryout any temporary assignments assigned by manager.Skills",
    "Skills": [
        "Diploma or bachelors degree graduate\nProven work experience as a sales representative in Construction Machinery or automotive industry\nExcellent knowledge of MS Office\nHighly motivated and target driven with a proven track record in sales\nExcellent selling, communication and negotiation skills"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "Qatar",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Automotive Dealership & Distributor; Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}