{
    "Job ID": "4175422",
    "Description": "Check and inspect all used instruments and other materials returned from theatres, wards and clinics ensuring that all are identified according to name, type, functions and size.\nEnsure that infected material is immediately disinfected taking meticulous care to wear protective clothing.\nSelect the most suitable programme to clean the instruments using the ultrasonic cleaning machine and the instruments washing machine.\nIdentify items that are thermolabile and sterilises them using ethylene oxide gas sterilisers. This include selecting the correct time, cycle and placing of the gas cylinder. Allows enough time for aeration before material is issued to ensure that there are no traces of gas.\nOperate the ultrasonic fine lumen cleaner and sonic irrigator ensuring that all surgical and instruments are correctly placed in their baskets and transferred to different tanks at the correct time.\nAssemble, returned surgical instruments after cleaning into various sets. Inspect and test all instruments and other related materials including sharpness alignment.\nPack sets in a manner consistent with sterile techniques and medical arrangement procedure. Identify each set by fixing its official name on the outer covers with expiry dates, packing dates and batching codes.\nAssemble and prepare various operating material used in theaters such as lithotomy, abdominal sets, surgeon’s gowns and all needed packs for daily posted operations.Skills",
    "Skills": [
        "Graduated from reputable University\nMinimum 1 Year Experience in the same field.\nLicensed in Sterilization."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}