{
    "Job ID": "4211704",
    "Description": "We are looking for a devoted and energetic IT System Administrator to implement, lead and manage our new IT infrastructure expansion plans across our 3 locations (Abu Dhabi, Riyadh and Sri lanka). We are a family run company that have just recently expanded our manufacturing capabilities and market presence within the G.C.C. If you are a hardworking and dedicated individual, ready to take up the challenge, then Adeem Uniforms would be a great place to secure and grow your career.Key ResponsibilitiesResponsible for the maintenance, configuration, and reliable operation of computer systems, network servers, and virtualization\nInstall and upgrade computer components and software, manage virtual servers, and integrate automation processes\nTroubleshoot hardware and software errors by running diagnostics, documenting problems and resolutions, prioritizing problems, and assessing impact of issues\nPerform regular backup operations and implement appropriate processes for data protection, disaster recovery, and failover procedures\nLead desktop and helpdesk support efforts, making sure all desktop applications, workstations, and related equipment problems are resolved in a timely manner with limited disruptions\nResponsible for capacity, storage planning, and database performance\nOversea hardware technician’s Recording and maintain of  hardware and software inventories, site and/or server licensing, and user access and security.\nMaintain confidentiality with regard to the information being processed, stored, or accessed by the network.\nCreating an email account, setting up permissions (restrictions on mailbox, recipients, etc...)\nGive internet access to users and set up permissions (Time & Traffic Quota) and policies.\nIn charge of the IT Store, maintain all the computer accessories record through Maximo, make PR, GRV, and Issuance as per user requirement.\nDealing with Suppliers for purchasing any IT Assets and follows company procedure of Cape, PR, PO, and Payment.\nManaging Microsoft 365 and/or ERP Odoo admin consoles certification -a bonus!\nCCTV and/ or PBX experience-a bonus!Skills",
    "Skills": [
        "Skills",
        "Excellent working knowledge of computer systems, security, network and systems administration, databases and data storage systems, pbx phone systems, and Microsoft 365 admin certification for IT.\nStrong critical thinking and decision-making skills\nExcellent project management skills and strong ability to prioritize\nFirm grasp on IT infrastructure and operations best practices!.\nAnalytical skills.\nStrong Communications and Written skills (English)\nInterpersonal skills.\nHighly self-motivated and directed.\nStrong customer service orientation."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 15",
        "Residence Location": "Riyadh, Saudi Arabia ; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28 Max: 38"
    },
    "Data": {
        "Job Location": "Kharj Road, Industrial Area, Riyadh , Saudi Arabia",
        "Company Industry": "Industrial Production; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}