{
    "Job ID": "4212739",
    "Description": "On behalf of a luxury hospitality division, we are seeking a talented Finance Director for their Riyadh operations.Reporting to the General Manager you will manage a small team and handle the day-to-day financial activities related to financial planning, cash management, treasury management reporting & analysis functions.Manage day-to-day financial activities related to financial planning, cash management, treasury management reporting & analysis functions.\nPreparation of overall organizational budgets and ensuring the effectiveness of the financial control by continuously monitoring the business spending against the budgets.\nParticipate in the development of financial planning and lead the process.\nDevelop quarterly sales for the quarterly performance evaluation of the Operations.\nIntroduce new methodologies and techniques for use in financial planning, budgeting, and cash forecasting activities in coordination with the Director of Finance.\nParticipate in the development of financial policies, processes, and procedures.\nRecommend any necessary procedures to enhance the internal control environment\nConduct financial and costing analysis (key performance indicators, trends, capital expenditures analysis, variances reporting in terms of actual versus target reports, deviation reports, etc). \nAnalyze the organization’s revenues, liabilities, credit condition, and other financial indicators to forecast its short, medium, and long-term cash flow position\nEvaluate and recommend investments, funding sources, and other financial instruments that will meet these cash flow needs.Skills",
    "Skills": [
        "Bachelor’s degree in Finance or Accounting\n6 to 8 years of experience in a similar role with at least 3 years’ experience in a managerial role\nPrior experience in an audit firm.\nCIMA/ACCA certification\nProven Management experience\nExcellent Analytical, and Problem-Solving Skills\nComputer Literacy (Word, Excel, PowerPoint, Outlook)\nAttention to details\nNegotiation skills\nPresentation skills"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant; Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}