{
    "Job ID": "4215960",
    "Description": "Project requirement is to have Two Consultants sharing the below responsibilities:-    The TSCM consultant will conduct and provide training on TSCM equipment and surveys to detect, deter, and neutralize technical penetrations.-    Conducts comprehensive Basic and Advanced TSCM Training courses.-    Drafts comprehensive weekly reports that detail the TSCM training process and evaluations to project manager.-    Responsible for all TSCM equipment provided to client.-    Hands on Experience on Several TSCM Equipment (RF Signal Search – Line Analyzer – GSM identifier and locater - portable X-Ray – Mobile Spyware Detection).-    Provides proper recommendations for countermeasures to mitigate technical hazards and vulnerabilities.-    Performs an intense practice on TSCM equipment, and Offensive Techniques (Bugging).-    Providing subject matter mentoring on daily basis to client.-    Assisting in planning of sweep operations.-    Closely partners with trainees and team members in practical tests and implementations.-    Maintains knowledge of emerging technical threats and capabilities.-    Provides procurement support.-    Liaising, preparing, arranging, coordinating, managing and orienting with external training providers to develop course provision.-    Liaising, preparing, arranging, coordinating, managing and orienting with source manufactures for any technical support needed.-    Liaising, preparing, arranging, coordinating, managing and orienting with source manufactures for overseas expos and manufactures visits.Skills",
    "Skills": [
        "-    Certification from the TSCM Fundamental Course or equivalent.",
        "-    Instructor experience at a training center is desired.",
        "-    Possess at least ten (10) years of experience and demonstrated subject matter expertise in technical surveillance countermeasures (TSCM), with a minimum of 4 years as a team lead.",
        "-    Extensive experience with the deployment and maintenance of security telephony systems, planning of sweep operations and Offensive Techniques.",
        "-    Demonstrates excellent communications skills, including written and oral presentations.",
        "-    Microsoft Office Suite experience",
        "-    Strong, detail-oriented analytical and critical thinking skills."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Consulting",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}