{
    "Job ID": "4224279",
    "Description": "To coordinate with all departments, the planning and budgeting criteria of the department to insure that the department has all necessary resources and plans to enable the achievement of objectives and performance indicators.\nMaintains and verifies records of budget expenditures to regularly update comparison of actual spending vs. budget and AFE and reports to superintendentPerforms tracking of budget spending and progress of KPIs to keep records of budget controls and achievement of departmental performance indicators\nProcesses contractors’ invoices to ensure timely compensation of planned operationsSkills",
    "Skills": [
        "Financial Analysis: Proficiency in financial analysis and the ability to interpret financial data, including budgets, forecasts, and financial statements. Strong analytical skills to identify trends, variances, and financial risks.\nBudgeting and Forecasting: Experience in budgeting processes, including the development, implementation, and monitoring of budgets. Ability to prepare accurate financial forecasts and identify potential areas for cost savings or revenue enhancement.\nFinancial Planning and Strategy: Understanding of financial planning principles and the ability to contribute to the development of financial strategies and goals. Knowledge of financial modeling techniques to support decision-making and scenario analysis.\nCost Control and Management: Expertise in cost control techniques, including monitoring and analyzing expenditure, identifying cost-saving opportunities, and implementing cost management strategies to ensure budget compliance.\nFinancial Reporting: Proficient in preparing timely and accurate financial reports, including variance analysis, budget performance reports, and management dashboards. Familiarity with financial reporting standards and regulations."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 7 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 23 Max: 40"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}