{
    "Job ID": "4240768",
    "Description": "صندوق النقد العربي مؤسسة مالية عربية مقرها مدينة أبوظبي، دولة الإمارات العربية المتحدة، تهدف إلى إرساء أسس التكامل الاقتصادي العربي والإسراع بعملية التنمية الاقتصادية في البلدان العربية. يسعى الصندوق في هذا الإطار، إلى المساعدة على تطوير القطاع المالي والمصرفي في الدول العربية وتعزيز سلامته وكفاءته. كما يعمل في هذا الصدد، على المساهمة في تطوير أسواق المال في الدول العربية. كذلك يضطلع الصندوق بأعمال الأمانة الفنية لمجلس محافظي المصارف المركزية ومؤسسات النقد العربية واللجان وفرق العمل المنبثقة عنه، والأمانة الفنية لمجلس وزراء المالية العرب.\nيرغب الصندوق في شغل وظيفة \"أخصائي قطاع مالي مختص في التقنيات المالية الحديثة\".\nالمهام الرئيسية:\n1.المساهمة في تحقيق استراتيجية الصندوق، خاصة فيما يتعلق بتطوير برامج ومبادرات القطاع المالي والمصرفي وتعزيز بيئة التقنيات المالية الحديثة والخدمات المالية الرقمية.\n2.متابعة أنشطة مبادرات تطوير القطاع المالي في الدول العربية، وخاصة الجوانب المتعلقة بالخدمات المالية الرقمية والتقنيات المالية الحديثة والاقتصاد الرقمي.\n3.المساهمة في إعداد برامج لتقديم الدعم الفني للدول العربية في مجال تطوير التقنيات الحديثة للقطاع المالي والمصرفي والبنية التحتية الرقمية للنظام المالي.\n4.المساهمة في تنفيذ البرامج والأنشطة المختلفة المعنية بتطوير القطاع المالي بالتعاون مع المؤسسات الدولية.\n5.المساهمة في تقديم دورات تدريبية متقدمة للعاملين في الهيئات الرقابية والاشرافية في الدول العربية حول تعزيز الإشراف على التطورات في التقنيات المالية الحديثة والخدمات المالية الرقمية.\n6.المشاركة في أعمال اللجان وفرق العمل المختلفة التي يساهم فيها الصندوق بإطار مهامه، مثل مجموعة عمل التقنيات المالية الحديثة، وفريق عمل الشمول المالي، وفريق عمل الاستقرار المالي.\n7.المساهمة في تنفيذ مبادرات التقنيات المالية الحديثة، والشمول المالي الرقمي، والاقتصاد الرقمي ضمن مهام الصندوق.\n8.المساهمة في إعداد الأبحاث والدراسات والفعاليات المختلفة التي يقوم بها الصندوق في إطار مهامه.\n9.تطوير المهارات الإشرافية من خلال الدورات التدريبية الموجهة لدول الأعضاء في مجالات تطورات التقنيات المالية الحديثة.Skills",
    "Skills": [
        "الشروط والمؤهلات العلمية والخبرات المطلوبة:\n1.أن يكون من مواطني الدول العربية.\n2. شهادة الدكتوراه من جامعة معترف بها في مجالات الاقتصاد أو التمويل أو في اختصاصات أخرى شبيهة.\n3.خبرة متميزة في مجالات عمل مشابهة في حدود خمس سنوات في المصارف المركزية أو المؤسسات المعنية بالخدمات المالية الرقمية أو المؤسسات المالية الإقليمية أو الدولية.\n4.معرفة شاملة بالمعايير والمبادئ والأبحاث والدراسات الصادرة عن المؤسسات المالية الدولية، مثل بنك التسويات الدولية، ومجلس الاستقرار المالي، وصندوق النقد والبنك الدوليين، ولجنة بازل للرقابة المصرفية، ومجلس الخدمات المالية الاسلامية، ومعهد الاستقرار المالي.\n5.معرفة شاملة بمفاهيم التقنيات المالية الحديثة والخدمات المالية الرقمية مثل التحول الرقمي، والهوية الرقمية وقواعد اعرف عميلك الإلكترونية واجراءات العناية الواجبة، وأنظمة الدفع الرقمي، والخدمات المالية الرقمية، وتطبيقات السجلات اللامركزية DLT في القطاع المالي، والذكاء الاصطناعي في القطاع المالي، والأمن الإلكتروني (Cyber security/ resilience).\n6.معرفة شاملة بالمعاايير الدولية ذات العلاقة، ونظم وتشريعات الأنشطة التي تندرج تحت التقنيات المالية الحديثة على مستوى العالم.\n7.معرفة شاملة بإدارة مخاطر التقنيات المالية الحديثة.\n8.معرفة شاملة بمنظومة التشريعات المالية والمصرفية والبنية التحتية للنظام المالي الرقمي في الدول العربية.\n9.تم نشر أبحاث حديثة في مجلات علمية محكمة.\n10.إجادة اللغتين العربية والإنجليزية إجادة تامة تحدثاً وكتابة شرط أساسي ومعرفة اللغة الفرنسية أمر مساعد.\nيقدم الصندوق شروط خدمة تنافسية وفقا لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وتذاكر السفر، وبدل تعليم، والتأمين على الحياة والتأمين الطبي.\n11.مختص في التقنيات المالية الحديثة\nسيتم الاتصال فقط بالذين يتم ترشيحهم لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}