{
    "Job ID": "4240705",
    "Description": "صندوق النقد العربي مؤسسة مالية عربية مقرها مدينة أبوظبي، دولة الإمارات العربية المتحدة، تهدف إلى إرساء أسس التكامل الاقتصادي العربي والإسراع بعملية التنمية الاقتصادية في البلدان العربية. يسعى الصندوق في هذا الإطار، إلى المساعدة على تطوير القطاع المالي والمصرفي في الدول العربية وتعزيز سلامته وكفاءته. كما يعمل في هذا الصدد، على المساهمة في تطوير أسواق المال في الدول العربية. كذلك يضطلع الصندوق بأعمال الأمانة الفنية لمجلس محافظي المصارف المركزية ومؤسسات النقد العربية واللجان وفرق العمل المنبثقة عنه، والأمانة الفنية لمجلس وزراء المالية العرب.\nيرغب الصندوق في شغل وظيفة \"اقتصادي -مُختص في مجال الحسابات القومية\".\nالمهام الرئيسة:\n1.إعداد الدراسات والتقارير المتعلقة بالموضوعات الاقتصادية والمالية والنقدية.\n2.تقديم دورات تدريبية وورش عمل ومعونة فنية في المجالات ذات العلاقة بنظام الحسابات القومية والتحليل الاقتصادي وبطرق جمع البيانات وتقديرها في نظام الحسابات القومية.\n3.التنبؤ الاقتصادي وتحليل الآثار الكلية والقطاعية للسياسات الاقتصادية.\n4.المشاركة في تطوير مبادرة \"عربستات\".\n5.القدرة على والمعرفة بأساليب تكوين المؤشرات الإحصائية ذات العلاقة.Skills",
    "Skills": [
        "الشروط والمؤهلات العلمية والخبرات المطلوبة:\n1.أن يكون من مواطني الدول العربية.\n2.الحصول على درجة الدكتوراه في الاقتصاد أو الإحصاء من جامعة معترف بها مع خبرة في حدود 5 سنوات في مجالات عمل ذات صلة بعمل صندوق النقد لعربي، ويُفضل أن تكون في البنوك المركزية أو وزارات المالية أو مراكز دراسات أو مؤسسات إقليمية ودولية ذات صلة بعمل صندوق النقد العربي.\n3.معرفة عميقة بالاقتصاد القياسي والنمذجة الاقتصادية ومهارات التنبؤ.\n4.أن يكون للمترشح أبحاث ودراسات حديثة منشورة في مجلات علمية محكمة في المجالات الاقتصادية والمالية النقدية والاحصائية.\n5.القدرة على التدريب في مجالات التخصص المطلوبة المنوه عنها.\n6.الإلمام ببرامج تحليل البيانات والاقتصاد القياسي والنمذجة الاقتصادية.\n7.الإلمام بمتطلبات الأدلة الإحصائية ذات العلاقة الصادرة عن المؤسسات الدولية.\n8.إجادة اللغتين العربية والإنجليزية إجادة تامة تحدثاً وكتابة شرط أساسي ومعرفة اللغة الفرنسية أمر مساعد.\n9.- مُختص في مجال الحسابات القومية\nيقدم الصندوق شروط خدمة تنافسية وفقاً لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وتذاكر السفر، وبدل تعليم، والتأمين على الحياة والتأمين الطبي.\n\nسيتم الاتصال فقط بالذين يتم ترشيحهم لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}