{
    "Job ID": "4240780",
    "Description": "صندوق النقد العربي مؤسسة مالية عربية مقرها مدينة أبوظبي، دولة الإمارات العربية المتحدة، تهدف إلى إرساء أسس التكامل الاقتصادي العربي والإسراع بعملية التنمية الاقتصادية في البلدان العربية. يسعى الصندوق في هذا الإطار، إلى المساعدة على تطوير القطاع المالي والمصرفي في الدول العربية وتعزيز سلامته وكفاءته. كما يعمل في هذا الصدد، على المساهمة في تطوير أسواق المال في الدول العربية. كذلك يضطلع الصندوق بأعمال الأمانة الفنية لمجلس محافظي المصارف المركزية ومؤسسات النقد العربية واللجان وفرق العمل المنبثقة عنه، والأمانة الفنية لمجلس وزراء المالية العرب.\nيرغب الصندوق في شغل وظيفة \"إحصائي - مُختص في إدارة قواعد البيانات الاقتصادية \".\nالمهام الرئيسة:\n1.تطوير قواعد البيانات الاقتصادية من حيث المحتوى والدقة والسلامة والاستخدام.\n2.التأكد من سلامة عملية تخزين البيانات واستردادها.\n3.دراسة حاجيات مستخدمي البيانات.\n4.متابعة التطورات في التصانيف الإحصائية وتطبيق المعايير والأدلة الدولية لمقارنة البيانات والتأكد من تناسقها وقابلية مقارنتها، ودورية تجميعها ونشرها.\n5.مراجعة المعايير الإحصائية وتطويرها.\n6.العمل على تطوير الإصدارات الإحصائية، وتطوير مهارات التحليل.\n7.تحديث أنشطة الدائرة الاقتصادية على موقع الصندوق.\n8.تقديم دورات تدريبية وورش عمل ومعونة فنية في المجالات الإحصائية والاقتصاديةSkills",
    "Skills": [
        "الشروط والمؤهلات العلمية والخبرات المطلوبة:\n1.أن يكون من مواطني الدول العربية.\n2.الحصول على درجة الدكتوراه في الطرق الكمية أو ما يعادلها (تخصص رئيس في الإحصاء أو الاقتصاد القياسي ويفضل تخصص فرعي في علوم الحاسب الآلي ونُظم المعلومات) من جامعة معترف بها مع خبرة في حدود 5 سنوات في مجالات عمل مماثلة، ويُفضل أن تكون في المراكز الإحصائية والبنوك المركزية أو وزارات المالية أو مؤسسات إقليمية ودولية ذات صلة بمجالات عمل صندوق النقد العربي.\n3.أن يكون للمترشح أبحاث ودراسات حديثة منشورة في مجلات علمية محكمة في المجالات الإحصائية والاقتصادية والمالية والنقدية.\n4.القدرة على التدريب في مجالات التخصص المطلوبة المنوه عنها.\n5.القدرة على التحليل والنمذجة القياسية والاقتصادية.\n6.الإلمام ببرامج تحليل البيانات والاقتصاد القياسي والنمذجة الاقتصادية.\n7.خبرة عميقة بنظم إدارة قواعد البيانات.\n8.إجادة اللغتين العربية والإنجليزية إجادة تامة تحدثاً وكتابة شرط أساسي ومعرفة اللغة الفرنسية أمر مساعد.\n9.مُختص في إدارة قواعد البيانات الاقتصادية\nيقدم الصندوق شروط خدمة تنافسية وفقاً لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وتذاكر السفر، وبدل تعليم، والتأمين على الحياة والتأمين الطبي.\nسيتم الاتصال فقط بالذين يتم ترشيحهم لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}