{
    "Job ID": "4240699",
    "Description": "صندوق النقد العربي مؤسسة مالية عربية مقرها مدينة أبوظبي، دولة الإمارات العربية المتحدة، تهدف إلى إرساء أسس التكامل الاقتصادي العربي والإسراع بعملية التنمية الاقتصادية في البلدان العربية. يسعى الصندوق في هذا الإطار، إلى المساعدة على تطوير القطاع المالي والمصرفي في الدول العربية وتعزيز سلامته وكفاءته. كما يعمل في هذا الصدد، على المساهمة في تطوير أسواق المال في الدول العربية. كذلك يضطلع الصندوق بأعمال الأمانة الفنية لمجلس محافظي المصارف المركزية ومؤسسات النقد العربية واللجان وفرق العمل المنبثقة عنه، والأمانة الفنية لمجلس وزراء المالية العرب.\nيرغب الصندوق في شغل وظيفة \" اقتصادي أول\".\nالمهام الرئيسة:\n1.إعداد الدراسات والتقارير المتعلقة بالموضوعات الاقتصادية والمالية والنقدية.\n2.تقديم دورات تدريبية وورش عمل ومعونة فنية في المجالات ذات الصلة بعمل الصندوق.\n3.تحضير وإعداد المواد التدريبية وحلقات العمل التي ينظمها الصندوق.\n4.المشاركة في التدريس وإلقاء المحاضرات خلال الدورات التدريبية وورش العمل.\n5.التنبؤ الاقتصادي وتحليل الآثار الكلية والقطاعية للسياسات الاقتصادية.\n6.المشاركة الفاعلة في تنفيذ الأنشطة ذات الصلة بالمبادرات المختلفة التي يعمل عليها الصندوق.\n7.المشاركة الفنية في أعمال اللجان وفرق العمل الفنية المنبثقة عن مجلس محافظي المصارف المركزية ومؤسسات النقد العربية ومجلس وزراء المالية العرب، والفعاليات الاقتصادية والمالية المختلفة التي ينظمها الصندوق.\n8.الإحاطة ومعرفة التطورات الحديثة في مجالات الاقتصاد الرقمي والتقنيات الماليةSkills",
    "Skills": [
        "الشروط والمؤهلات العلمية والخبرات المطلوبة:\n1.أن يكون من مواطني الدول العربية.\n2.الحصول على درجة الدكتوراه في الاقتصاد من جامعة مرموقة.\n3.خبرة في حدود 10 سنوات في مجالات ذات صلة بعمل صندوق النقد العربي، ويُفضل أن تكون في وظائف إشرافية في البنوك المركزية أو وزارات المالية أو في الجامعات ومراكز البحوث والدراسات أو مؤسسات إقليمية ودولية ذات صلة بعمل صندوق النقد العربي.\n4.معرفة عميقة بالاقتصاد القياسي والنمذجة الاقتصادية ومهارات التنبؤ.\n5.الإلمام بكيفية صياغة السياسات الاقتصادية الكلية لتحقيق الأهداف الاقتصادية الكلية وآليات التفاعل فيما بينها.\n6.القدرة على التحليل الاقتصادي المُتعمق والخروج بتوصيات على صعيد السياسات لدعم صناع القرار.\n7.أن يكون للمترشح دراسات حديثة منشورة في مجلات علمية مُحكمة في المجالات الاقتصادية والمالية والنقدية.\n8.القدرة على التدريب في مجالات التخصص ذات الصلة بعمل الصندوق.\n9.الإلمام ببرامج تحليل البيانات والاقتصاد القياسي والنمذجة الاقتصادية.\n10.إجادة اللغتين العربية والإنجليزية إجادة تامة تحدثاً وكتابة شرط أساسي ومعرفة اللغة الفرنسية أمر مساعد.\nيقدم الصندوق شروط خدمة تنافسية وفقاً لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وبدل تذاكر السفر، وبدل تعليم، والتأمين على الحياة والتأمين الطبي. \nسيتم الاتصال فقط بالذين يتم ترشيحهم لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 10",
        "Nationality": "All Arab Countries",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Investment, Securities & Funds; Economics & Financial Consulting",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}