{
    "Job ID": "4242099",
    "Description": "Arab Monetary Fund is a regional Arab financial institution based in Abu Dhabi, with the mission to lay the monetary foundation of Arab economic integration and to accelerate the process of economic development of its member countries. In this context, the AMF supports banking and financial sector development in the Arab States and provide assistance towards its integrity and efficiency. Moreover, the AMF carries out and acts as a technical secretariat for the Council of Arab Ministers of Finance, the Council of Arab Central Banks and Monetary Authorities’ Governors as well as for its sub-committees and task forces.The AMF is seeking to hire \"Financial Sector Specialist- Financial Markets\"Duties & Responsibilities:Contribute to the implementation of the AMF’s strategy in relation to non-banking financial sector development programs and initiatives, including developing domestic markets in Arab countries.\nSupport the implementation and follow-up activities of the financial market’s development initiatives in the Arab countries.\nContribute to formulate technical assistance programs to the Arab countries in developing their domestic markets with focus on debt markets.\nConduct researches and working papers in the financial sector with focus on capital and debt markets, both traditional and Islamic.\nContribute to the implementation of various programs and activities related to the development of domestic markets in Arab countries, jointly conducted with IFIs. \nContribute to delivering training and workshops to the Arab regulatory & supervisory authorities.\nParticipation in the work of various committees and task forces, in which AMF acts as a technical Secretariat, such as the Arab Regional Fintech WG, the Financial Stability Task Force, as well as the Financial Inclusion Task Force.\nContribute to various activities, studies and events carried out by the AMF within the framework of its financial sector development mandate.Skills",
    "Skills": [
        "Selection criteria, Academic qualifications and experience required: ",
        "Arab country’s citizen.\nA doctorate degree from a recognized university in the fields of economics or finance, or other related fields.\nRelevant experience in similar fields of work of 5 years in capital market authorities, or any other relevant authorities such as ministries of economies, finance, central banks, or regional and international financial institutions.\nComprehensive knowledge of international principles / guidelines and papers issued by the relevant standard setters such as IOSCO, IMF, WG, BIS, FSB, IFSB.\nDeep knowledge of concepts related to domestic Capital and debt markets, in its conventional and Islamic versions.\nDeep knowledge of domestic markets developments’ strategies.\nComprehensive knowledge of financial markets legislations in the Arab countries\nDemonstrates ability to carry out research and analytical tasks related to financial markets.   \nHave recently published refereed researches / articles in scientific reputed journals.\nFluent in Arabic, English, and French is plus.",
        "The fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance, and life & medical insurance.",
        "Only short-listed candidates will be contacted."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}