{
    "Job ID": "4242075",
    "Description": "Financial Sector Specialist - FintechArab Monetary Fund is a regional Arab financial institution based in Abu Dhabi, with the mission to lay the monetary foundation of Arab economic integration and to accelerate the process of economic development of its member countries. In this context, the AMF supports banking and financial sector development in the Arab States and provide assistance towards its integrity and efficiency. Moreover, the AMF carries out and acts as a technical secretariat for the Council of Arab Ministers of Finance, the Council of Arab Central Banks and Monetary Authorities’ Governors as well as for its sub-committees and task forces.The AMF is seeking to hire \"Financial Sector Specialist- Fintech\"Duties & Responsibilities:Contribute to the implementation of the AMF’s strategy in relation to financial sector development programs and initiatives, including promoting Fintech ecosystem and enhancing digital financial services in Arab countries.\nSupport the implementation and follow-up activities of the initiatives in the Arab countries focusing on enhancing Fintech digital financial services and digital economy.\nContribute to formulate technical assistance programs to the Arab countries in developing their financial and banking sector with focus on Fintech and digital financial infrastructure.\nContribute to the implementation of various programs and activities related to fostering Fintech ecosystem in Arab countries, jointly conducted with IFIs. \nContribute to delivering training and workshops to the Arab regulatory & supervisory authorities.\nParticipation in the work of various committees and task forces, in which AMF acts as a technical Secretariat, such as the Arab Regional Fintech WG, the Financial Inclusion Task Force, as well as Financial Stability Task Force.\nContribute to various activities in the financial sector with focus on Fintech and digital financial services.\nConduct researches and working papers, studies and events carried out by the AMF within the framework of its financial sector development mandate.\nSupervisory skills in providing training courses for member countries in the area of Fintech.Skills",
    "Skills": [
        "Selection criteria, Academic qualifications and experience required:",
        "Arab Country’s citizen.\nA doctorate degree from a recognized university in the fields of economics or finance.\nRelevant experience in similar fields of work of 5 years in related regulatory & supervisory authorities such as central banks, relevant financial institutions, or regional and international financial institutions.\nComprehensive knowledge of international principles / guidelines and papers issued by the relevant standard setters such as BIS, IMF, WG, FSB, Basel Committee, FSI, IFSB.\nDeep knowledge of concepts related to Fintech such as digital transformation, digital ID and eKYC & CDD, digital payments systems, digital financial services, Distributed Ledger Technologies (DLT), Artificial Intelligence, and cyber resilience.\nDeep knowledge of Fintech standards and related financial legislations around the world.\nDeep knowledge of risks related to Fintech activities, and hoe to mitigate those risks.\nComprehensive knowledge of financial, banking, and digital financial infrastructure legislations in Arab countries.\nHave recently published refereed researches / articles in reputed scientific journals.\nFluent in Arabic, English, and French is plus.",
        "The fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance, and life & medical insurance"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}