{
    "Job ID": "4242106",
    "Description": "Arab Monetary Fund is a regional Arab financial institution based in Abu Dhabi, with the mission to lay the monetary foundation of Arab economic integration and to accelerate the process of economic development of its member countries. In this context, the AMF supports banking and financial sector development in the Arab States and provide assistance towards its integrity and efficiency. Moreover, the AMF carries out and acts as a technical secretariat for the Council of Arab Ministers of Finance, the Council of Arab Central Banks and Monetary Authorities’ Governors as well as for its sub-committees and task forces.The AMF is seeking to hire a “Statistician Economic database management Specialist”.Main responsibilities:Developing the content of the economic databases and ensuring its integrity and accuracy.\nEnsuring the integrity of the data storage and retrieval process.\nIdentifying database users’ requirements.\nFollowing up statistical classifications and using international standards to ensure data comparability, consistency and the regularity of data collection and publication.\nReviewing and setting statistical standards.\nWorking on developing statistical publications and improve analysis.\nUpdating the activities of the economic department on the fund's website.\nProviding training courses, workshops, and technical assistance in the statistical and economic fields.Skills",
    "Skills": [
        "Selection criteria, Academic qualifications and experience required:",
        "Arab country’s citizen.\nA Ph.D. in quantitative methods or its equivalent (major in statistics or econometrics with a minor in computer science and information systems) from a reputable university with 5 years of experience in similar fields of work, preferably in National Statistical Offices, Central Banks, Ministries of Finance, or similar regional and international institutions.\nHaving recently published researches in refereed statistical and economic journals in economic, financial, and monetary issues.\nProviding training in the required fields of specialization mentioned above.\nDeep knowledge of economic analysis and modeling.\nFamiliar with data analysis, econometrics, and economic modeling programs.\nDeep Experience in database management systems.\nFluent in Arabic, English, and French is plus.",
        "The fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance, and life & medical insurance.",
        "Only short-listed candidates will be contacted."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}