{
    "Job ID": "4242057",
    "Description": "Arab Monetary Fund is a regional Arab financial institution based in Abu Dhabi, with the mission to lay the monetary foundation of Arab economic integration and to accelerate the process of economic development of its member countries. In this context, the AMF supports banking and financial sector development in the Arab States and provide assistance towards its integrity and efficiency. Moreover, the AMF carries out and acts as a technical secretariat for the Council of Arab Ministers of Finance, the Council of Arab Central Banks and Monetary Authorities’ Governors as well as for its sub-committees and task forces.The AMF is seeking to hire a \"Senior Economist\".Duties and Responsibilities:Conducting research and preparing reports related to Economic and Financial topics\nProviding training courses, workshops, and technical assistance in the fields related to the AMF work.\nPreparation of training materials and workshops organized by AMF.\nParticipation in teaching and lecturing.\nEconomic forecasting and analysis of the macro and sectoral impacts of economic policies.\nActive participation in the implementation of activities related to the various initiatives on the AMF.\nTechnical participation in the work of committees and working groups emanating from the Council of Arab Central Bank Governors and Arab Monetary Authorities and the Council of Arab Finance Ministers, and the various economic and financial activities organized by the Fund.Skills",
    "Skills": [
        "Selection criteria and academic qualifications and experience required:",
        "Arab country’s citizen.\nA Ph.D. in economics from a reputable university\n 10 years of experience in areas related to the work of the Arab Monetary Fund, preferably assuming a supervisory role in central banks, ministries of finance, research centers, or similar regional and international institutions.\nDeep knowledge in data analysis, econometrics, economic modeling and forecasting.\nExperience in the formulation of macroeconomic policies to achieve economic goals and interaction between different macroeconomic policies.\nThe ability to provide in-depth economic analysis and tailor policy recommendations to support the decision-making process.\nA record of recent publications in refereed economic journals in the economic, financial, and monetary fields.\nProviding training courses in areas of specialization mentioned above.\nDeep knowledge in data analysis, econometrics, and economic modeling programs.\nFluent in Arabic, English, and French is plus.\nKnowledge of recent developments in the areas of digital economy and Financial technologies",
        "The fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance, and life & medical insurance",
        "Only short-listed candidates will be contacted."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 10",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services; Investment, Securities & Funds",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}