{
    "Job ID": "4285366",
    "Description": "Recruits, interviews, hires, and trains new staff in the department.\nOversees the daily workflow of the department.\nProvides constructive and timely performance evaluations.\nHandles discipline and termination of employees in accordance with company policy.\nPartners with the leadership team to understand and execute the organizations human resource and talent strategy particularly as it relates to current and future talent needs, recruiting, retention, and succession planning.\nProvides support and guidance to HR generalists, management, and other staff when complex, specialized, and sensitive questions and issues arise; may be required to administer and execute routine tasks in delicate circumstances such as providing reasonable accommodations, investigating allegations of wrongdoing, and terminations.\nManages the talent acquisition process, which may include recruitment, interviewing, and hiring of qualified job applicants, particularly for managerial, exempt, and professional roles; collaborates with departmental managers to understand skills and competencies required for openings.\nAnalyzes trends in compensation and benefits; researches and proposes competitive base and incentive pay programs to ensure the organization attracts and retains top talent.\nCreates learning and development programs and initiatives that provide internal development opportunities for employees.\nOversees employee disciplinary meetings, terminations, and investigations.\nMaintains compliance with MOH employment laws and regulations, and recommended best practices; reviews policies and practices to maintain compliance.\nMaintains knowledge of trends, best practices, regulatory changes, and new technologies in human resources, talent management, and employment law.\nPerforms other duties as assigned.\nwill be responsible to meet Saudization requirements.Skills",
    "Skills": [
        "Excellent verbal and written communication skills.\nExcellent interpersonal, negotiation, and conflict resolution skills.\nExcellent organizational skills and attention to detail.\nStrong analytical and problem-solving skills.\nAbility to prioritize tasks and to delegate them when appropriate.\nAbility to act with integrity, professionalism, and confidentiality.\nThorough knowledge of employment-related laws and regulations.\nProficient with Microsoft Office Suite or related software.\nProficiency with or the ability to quickly learn the organizations HRIS and talent management systems.\nBachelor’s degree in Human Resources, Business Administration, or related field required.\nA minimum of three years of human resource management experience preferred.\nSHRM-CP or SHRM-SCP highly desired."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Residence Location": "Southern Province, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$5,000 - $6,000",
        "Number of Vacancies": "1"
    }
}