{
    "Job ID": "4331911",
    "Description": "المهام الوظيفية\nإستخدام نظام ال ERP MICROSOFT DYNAMIC System  كبرنامج اساسي في العمل.\nالإشراف على أعمال المحاسبين وأمين صندوق الشركة واعتمادها.\nإعداد تنظيم الحسابات والالتزام بأسس التوجيه المحاسبي ومراجعة توجيه القيود المحاسبية الخاصة بجميع عمليات الشركة طبقاً للأسس والقواعد المحاسبية السليمة وفقاً لدليل الحسابات المالية المعتمد.\nإعداد الإقرارات الضريبية والرد على ملاحظات مصلحة الضرائب بشأنها وذلك في المواعيد المقررة والاشتراك في مناقشة أوجه الخلاف في مراحل نظهرها.\nمراقبة وفحص حسابات المدينين والدائنين شهرياً وتتبع محضر استلام المواد الموردة للشركة حتى يتم سداد قيمتها .\nإجراء كافة التسويات المحاسبية قبل إعداد القوائم المالية والحسابات الختامية بحيث تحمل السنة المالية بكل ما يخصها من جميع المصروفات والإيرادات طبقاً لمبدأ الاستحقاق واستقلال الدورات المالية بحيث تظهر حسابات النتائج فائض أو خسارة على الوجه الصحيح وذلك طبقاً للقواعد المحاسبية.\nمتابعة مهام طلب كشوف الحساب من البنوك للتعرف على أوضاع النقدية لدي الشركة وإعداد مذكرات التسوية اللازمة وعرض ذلك على المدير المالي الذي يقوم بدوره بعرضها ومناقشتها مع رئيس الشركة أو نائبه.\nالقيام بعمليات الجرد المفاجئ والدوري والسنوي للمستودعات  والمواد والموجودات الثابنة وصناديق الشركة وإجراء المطابقات وحصر الفروق – إن وجدت- وإعداد قوائم الفروقات الناتجة عن ذلك وإعداد التسويات اللازمة عليها وعرض ذلك على المدير المالي والذي يقوم بدوره بعرضها على رئيس الشركة ونائبه ومناقشتها معهم .\nالمصادقة على كافة القيود المحاسبية وترحيلها أولاً بأول بعد التأكد من سلامتها.\nأرشفة كافة السندات المحاسبية أولاً بأول في ملفات خاصة بها وترتيبها بشكل سليم يسهل الرجوع إليها عند الحاجة.\n11-القيام والمشاركة في عمل الموازنة السنوية التقديرية للشركة بما يتناسب مع توجهات التطوير وتحسين ورفع الأداء العامللشركة.\n12-تولي مسؤولية الالتزام بالمتطلبات المحاسبية الخاصة بالشركة لتشمل دون تحديد، الالتزام بمواعيد رفع التقارير والطلبات الخاصة بشأن المعلومات المالية والالتزام بالسياسات المحاسبية للشركة .\nترجمة التقديرات الاحتمالية المستقبلة لعمليات الشركة إلى موازنات المصروفات والتدفق النقدي وميزانيات التشغيل.\nتوجيه ومراقبة كافة الأنشطة المحاسبية والمالية وأنشطة رفع التقارير الخاصة بالشركة.\nالتأكد من إجراء التسويات وتحليل حسابات الميزانية العمومية بوقت زمني محدد .\nإعداد البيانات المالية الشهرية للشركة مع كافة الإيضاحات والتحليلات المطلوبة من قبل الإدارة.\nإصدار التوجيهات بشأن تطوير وتطبيق أنظمة الرقابة الملائمة وذلك لحماية موجودات الشركة ومراقبة عملياته بفاعلية .\nإعداد كافة تقارير ونماذج الخزينة وفقا لسياسات وإجراءات الخزينة .\nالإشراف على إعداد كشوفات التسوية الخاصة بالبنوك شهرياً ومراقبة جميع الحركات المحاسبية والأرصدة وإظهار الفروقات (إن وجدت) وإعلام المدير المالي للمراجعة بشأنها وتحضير قيود التسوية اللازمة بشأنها.\nالإشراف على تحضير سندات القيد واعتمادها قبل تسجيلها في الدفاتر المحاسبية.\nالإشراف على إعداد موازين المراجعة للحسابات التفصيلية والحسابات العامة والتقارير المالية الدورية في نهاية كل شهر ودراستها وتحليلها والتأكد من صحة الارصدة في كل منها  ون ثم رفعها للمدير المالي للموافقة ولعرضها على الإدارة العليا .\nالإشراف على تسجيل العمليات في حسابات الذمم الدائنة وإصدار أوامر الدفع الخاصة بها في الأوقات المحددة .\nمتابعة الديون والتحصيلات وعقود الموردين والمستثمرين.\nتنسيق وتسهيل عمل المدققين الداخليين والخارجين وإعطاءهم المعلومات والتفاصيل اللازمة عن الحسابات والأنظمة المستخدمة.\nالاحتفاظ بالدفاتر والمستندات المحاسبية اللازمة لتطبيق النظام المحاسبي المعتمد ، والتأكد من التسجيل فيها بشكل قانوني وحفظها بعد الانتهاء منها المدة القانونية\nالرقابة على المستندات الصادرة والواردة إلى قسم المحاسبة ، والتأكد من صحتها ومن احتوائها على التواقيع اللازمة ..\nتوفير كافة المعلومات والإيضاحات التي يتطلبها عمل الأقسام الأخرى في الشركة وعمل مدققي الحسابات الخارجيين والعمل على تسهيل مهمتهم.\nتبليغ المدير المالي عن أي مخالفة للسياسة المالية أو للإجراءات المالية المطبقة من قبل الادارات والأقسام المختلفة في الشركة أو عن أي انحراف يظهر في البيانات المالية الدورية .\nإعداد التقارير المالية في نهاية كل فترة زمنية .\nتقديم اقتراحات إلى المدير المالي بشأن الكيفية التي يمكن بها تعديل أو تبسيط الإجراءات المحاسبية والدورات المستندية طبقاً لحاجات العمل وبما يضمن سلامة الإجراءات المالية وانضباطها وبما لا يخالف الإجراءات بعد موافقة المدير المالي عليها .\nإعداد الحسابات الختامية في نهاية السنة المالية .\nمراجعة واعتماد كشف رواتب ومزايا الموظفين الشهري.\nلإشراف على تحضير جداول الرواتب والأجور الخاصة بالموظفين والتأكد من صحة تحضير هذه الجداول.Skills",
    "Skills": [
        "المؤهلات العلمية المطلوبة:\n1- بكالريوس محاسبة \n2- شهادة CPA تعتبر ميزة تفضيلية\n3- خبرة في العمل على نظام ال ERP MICROSOFT DYNAMIC System\n\n.المهارات والسمات\n1.     قدرات عالية ومعرفة تامة في العمل بنظام ال (ERP MICROSOT DYNAMIC System)\n2.     قدرات عالية في استخدام البرامج المحاسبية الاخرى\n3.     مهارة عالية في استخدام MS Office وخاصة الاكسل في المحاسبة.\n4.     معرفة جيدة باللغة الانجليزية ويفضل العربية أيضاً.\n5.     إلمام كامل بالعمليات والقواعد المحاسبية."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "An Nakhil, Riyadh , Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}