{
    "Job ID": "4363446",
    "Description": "To support the growth of the Company by managing the supply, procurement, and maintenance of equipment and services for projects in accordance with corporate strategies and Company policies and procedures.Job Responsibilities:To formulate long-term plans and objectives to manage the efficiency of the Department and reduce downtime.\nTo make recommendations to Management regarding the acquisition and disposal of equipment.\nTo manage equipment workshop functions for repairs and preventative maintenance and servicing according to manufacturer’s specifications and recommendations.\nTo manage the administration of the Department and advice on technical matters related to equipment and machinery.\nTo facilitate the procurement and finalize purchases for new equipment and respective spares.\nTo coordinate with Projects for the supply of equipment and services to ensure an efficient operation and availability.\nTo develop, review and approve procedures and practices for the efficient operation of the Division within the Company’s guidelines and framework.\nTo establish links with suppliers and rental companies for the purchase and hire of equipment and services.\nTo action strategic plans and directives of corporate management including the implementation of safety procedures, according to Company policies and procedures and international standards.\nTo advise on technical matters related to equipment and machinery to Projects and internal and external customers.Skills",
    "Skills": [
        "Qualification and years of experience:",
        "Bachelor’s Degree in Mechanical Engineering\nMinimum 15 years of work experience",
        "Technical & Personal Skills:",
        "Excellent knowledge in Risk Assessment & Job Safety Analysis.\nExpert knowledge of all relevant Safety and Environmental Legislation & Standards.\nExpert knowledge of accident/ incident investigation and Root Cause Analysis (RCA).\nFluent in English and Arabic languages\nCommunication -Written and Oral\nQuality Orientation/ Attention to Detail"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 15",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 36 Max: 58"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Construction & Building; Civil Engineering; Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}