{
    "Job ID": "4407603",
    "Description": "The Manager of Applications and ERP will report to the Director of Information Technology. The manager will collaborate with the director and cross-functional teams to lead direct reports and integration partners to implement and operate an ERP and related business applications and processes. This role requires continuous partnership with business stakeholders to resolve business needs all while adhering to the overall IT security and operation best practices.Evaluate, recommend, and implement administrative software standards; upgrade procedures and maintenance activities to achieve the highest possible reliability, security and accessibility of enterprise applications.\nDefine the scope of enterprise application projects, coordinate project schedules, and monitor progress to ensure that projects meet requirements and established milestones; maintain enterprise application including software updates, reporting tools, and database management.\nPlanning, budgeting and implementation of on-premises ERP system\nPlanning, budgeting and implementation of application system\nPerform continuous business process analysis to ensure technical and application components meet business requirements.\nManage DBA duties (e.g. DB management & configuration).\nTrack and monitor through applications Help Desk support tickets to ensure issues are resolved in a timely manner.\nInterface with vendors, IT Shared services manager and clients\nDrive Vulnerability remediation within supported environment\nBusiness partnership to ensure operation enablement\nResponsible on ensuring application integration, automation and streamline within all assets within scope\nEvangelizes concepts beyond current offerings and considers business model innovation (product, service and delivery innovations\nPrevious hands-on technical experience and proven record in multiple domains of IT (Infrastructure, security, applications)\nDemonstrated ability to lead teams in establishing goals, setting Technical performance metrics and delivering on milestones.\nAligns goals, feature sets, capabilities to business objectives.\nWorking Knowledge of the technical characteristics and current infrastructure and security solutions.Skills",
    "Skills": [
        "Bachelor’s Degree in Computer Science/Information Technology or related field\n8 - 10 Years’ experience with continuous increase of scope and responsibility\n(Qatari National)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "Qatar",
        "Nationality": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services; Software Development; Military & Defense",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}