{
    "Job ID": "4456307",
    "Description": "Bayt.com is looking for a product marketing manager to act as a product advocate, understand the product feature set and its benefits and clearly articulate the value proposition delivered through innovative and compelling deliverables such as messaging, marketing collateral, sales materials, and thought leadership content. The aim is to tell the market and company the story of the product.  A key role for the go-to-market team. Works collaboratively with Sales, Product Management, Marketing Communications, Demand Generation, and other teams to drive growth and customer success.\nMessaging: Develop product positioning and messaging that differentiates the product in the market.\nContent: Owns and ensure the creation of content (e.g. data sheets, infographics, solution briefs, white papers, user guides, web tutorials, web content, presentations, sales documentation, product videos, website copy, blog posts, release announcements) to articulate the benefits of the product to the world.\nSales enablement: Partner with the Product Management team to communicate the value proposition of the product to the sales team. Develop the sales tools and training that support the selling process of the product. Assist sales on calls when appropriate to provide deeper dives into the product.\nProduct launch: Plan the launch of new related products and releases and manage the cross-functional implementation of the plan.\nCustomer Intelligence: Be the expert on buyers of the product, how they buy, and their buying criteria.\nMarket/Competitor Intelligence: Be the expert on the competition. Follow and analyze market trends to position the product and identify new required capabilities.Skills",
    "Skills": [
        "MUST have exceptional written and verbal communication skills\nMUST have experience with Mailchimp and Google Adwords\nExperience in a B2B/ Saas company is preferred\nBachelor’s degree in Marketing, Communications, or a technical discipline; MBA desirable\nExperience in data analysis is highly preferred"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}