{
    "Job ID": "4477966",
    "Description": "يرغب صندوق النقد العربي بشغل وظيفة \"رئيس قسم الموارد البشرية\" في دائرة الخدمات المساندة من ذوي الكفاءات العالية والشخصية القيادية والخبرة المتميزة التي تشمل التخطيط الوظيفي وخدمات التوظيف وإدارة المزايا والرواتب والتدريب وتقييم العاملين لمساندة الوحدات التنظيمية في الصندوق لتحقيق الأهداف الاستراتيجية الطموحة التي يسعى الصندوق لتحقيقها كمؤسسة ماليّة عربية رائدة، ودعم الصندوق في أن يكون الشريك الأقرب للدول العربية في تفاعلها مع التطورات الاقتصادية والمالية، للوصول إلى مراكز الاستقرار المالي في المنطقة العربية.\nالمهام الرئيسيّة:\nالتنسيق مع مدير دائرة الخدمات المساندة لوضع أولويات المهام وتوزيع الأعمال وتحديد المسؤوليات لمتابعة تنفيذ المهام والواجبات التي يختص بها القسم.\nالتواصل والتنسيق مع الوحدات التنظيمية الأخرى لوضع خطة التوظيف السنوية والإشراف على تنفيذها، وتحديث أدلة وسياسات وإجراءات العمل وسجلات المخاطر للقسم.\nمتابعة جهود عمليات التوظيف من استقطاب المرشحين الملائمين إلى المقابلات الوظيفية والترشيح والتوظيف، حسب السياسات والإجراءات المتبعة في الصندوق.\nإدارة شؤون العاملين من نواحي المستحقات المالية من خلال الإشراف اليومي المباشر على تنفيذ إجراءات دفع البدلات والمنافع والرواتب.\nالحفاظ على علاقات مميزة مع العاملين وتنظيم اجراءات تجديد عقود العمل للعاملين أو إنهائها وفقاً للسياسات والتعليمات المطبقة في الصندوق.\nالتخطيط والإشراف ومتابعة تجديد وثائق عقود التأمين الجماعي والتأكد من إستمرار توفير التغطية التأمينية اللازمة على الحياة وضد الحوادث للعاملين (موظفين ومستخدمين) والمشاركين في نشاطات الصندوق وعلى ذوي العاملين.\nالمشاركة في فرق العمل واللجان ذات العلاقة بالشؤون الإدارية ودعم الاستراتيجية وإدارة المخاطر، والمشاركة في تطوير أساليب العمل والمساهمة في تحديث النظم المعلوماتية وتعزيز اّلية الإدارة الإلكترونية، بما يواكب تطوّر أنشطة الصندوق ويرفع كفاءة الأداء المؤسسي.\nالإشراف مباشرة على الحفاظ على ملفات القسم والموظفين محدثة وإتباع سياسة حفظ الوثائق والأرشفة المطبقة في الصندوق.\nالإشراف على العلاقات مع الخبراء الخارجيين لتعزيز قدرات الصندوق الذاتية في تنفيذ أنشطته المختلفة، من تعاقد معهم وما يلي ذلك من إجراءات لوجستية وتأمين وتسديد للمستحقات.\nإدارة عمليات تقييم أداء العاملين بالتنسيق مع الوحدات التنظيمية والتوصية ببرامج التطوير الملائمة لتطوير قدرات الكوادر تقنياً ومهنياً.\nتطوير ومتابعة مؤشرات الأداء للعاملين في القسم.\nالمشاركة في وضع الميزانية الإدارية السنوية، وأية مهام أخرى يتم تكليفه بها لدعم جهود الدائرةSkills",
    "Skills": [
        "المؤهلات العلمية والمهنية والخبرة:\nشهادة بكالوريوس في إدارة الأعمال أو الموارد البشرية ويفضل شهادة ماجستير من جامعة مرموقة.\nخبرة لا تقل عن 15 سنة منها 7 سنوات في مجالات عمل مماثلة بمستوى قيادي في مؤسسات مالية إقليميّة أو دوليّة أو محليّة معروفة بمستوى عالٍ من الانضباط المالي والإداري والعمل المؤسسي المنظم.\nيتمتع بمهارات عالية في التواصل والبحث وإعداد التقارير والتنظيم الإداري وإدارة المخاطر.\nإجادة اللغتين العربيًة والإنجليزية. إجادة اللغة الفرنسية تعتبر ميزة إضافية.\nيتمتع بشخصية متزنة جادّة وقادرة على المشاركة في القيادة والتجاوب مع متطلبات الأعمال والتكيّف مع المتغيرات والتطوير المستمر لأساليب العمل.\nقدرة عالية على التفاوض وإدارة التكاليف والتواصل الشفهي والمكتوب بأسلوب مهني.\nيوفّر الصندوق لشاغر هذه الوظيفة حزمة مزايا وفقاً لسياسة التوظيف المطبّقة التي تشمل الراتب وبدل السكن وبدل الأثاث وبدل تذاكر السفر والمساهمة في نفقات تعليم الأولاد والتأمين الطبي وعلى الحياة.\nسيتم الاتصال فقط بالمتقدمين الذين يستوفون الشروط ويرشحون من الإدارة لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 15",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}