{
    "Job ID": "4477969",
    "Description": "يرغب صندوق النقد العربي بشغل وظيفة \"رئيس قسم الحسابات\" بدائرة المالية من ذوي الكفاءات العالية والشخصية القيادية والخبرة المتميزة، لمساندة الدوائر المعنية في تحقيق الأهداف الاستراتيجية الطموحة التي يسعى الصندوق لتحقيقها كمؤسسة ماليّة عربية رائدة في مجال دعم الإصلاحات الاقتصادية والنقدية للوصول إلى مراكز الاستقرار المالي في المنطقة العربية، وليكون الشريك الأقرب للدول العربية في تفاعلها مع التطورات الاقتصادية والمالية.\nالمهام الرئيسيّة:\nالتنسيق يومياً مع مدير الدائرة المالية لمتابعة تنفيذ المهام المؤسسيّة التي تختص بها الدائرة، ووضع أولويات المشاريع وتوزيع الأعمال لقسم الحسابات.\nالتنسيق مع إدارة الدائرة لوضع أولويات المهام وتوزيع الأعمال وتحديد المسؤوليات لمتابعة تنفيذ واجبات القسم لتحقيق خطط الدائرة.\nالإشراف مباشرة على تنفيذ مهام قسم الحسابات المكّون من عدّة فرقٍ تختص بحسابات القروض، وحسابات الاستثمارات، والحسابات العامة.\nإدارة هيكل الحسابات وروابط النظام المحاسبي الرئيس بالنظم المالية المساندة المختلفة.\nاعتماد القيود المحاسبيّة لجميع المعاملات المالية لأنشطة الصندوق والأموال المدارة.\nتنظيم وتنفيذ مهمة إعداد البيانات المالية الشهرية وتقارير الأداء المالي المختلفة للصندوق والمؤسسات التابعة (برنامج تمويل التجارة العربية والمؤسسة الإقليمية لمقاصة وتسوية المدفوعات العربية، والأموال المدارة الأخرى).\nمساندة إدارة الدائرة في تنسيق مهمة مدققي الحسابات المستقلين للبيانات المالية الموحدّة للصندوق، وتوفير البيانات التحليلية والإيضاحات اللازمة.\nتطوير أساليب وإجراءات العمل والإشراف المباشر على مشاريع تحديث نظم المعلوماتية المالية لمواكبة تطوّر أنشطة الصندوق ورفع كفاءة الأداء المؤسسي خاصةً ما يتعلق بالإقراض والاستثمارات المالية.\nالمساهمة في رسم خطط الدائرة ومتابعة تنفيذ أنشطتها إضافة إلى وضع مقترحات خطط العمل السنوية لقسم الحسابات.\nمساندة إدارة الدائرة في مهمة إعداد الميزانية الإدارية السنوية، والتقرير عن الأداء للأنشطة الرئيسة مقارنة بتقديرات الميزانية.\nالمشاركة في فرق العمل واللجان ذات العلاقة بالشؤون المالية ودعم الاستراتيجية وإدارة المخاطر.\nتقييم أداء العاملين بقسم الحسابات وتقديم الدعم والتوجيه لمنسوبي القسم وتنمية قدراتهم والتوصية ببرامج التطوير الملائمة لتطوير قدرات الكوادر تقنياً ومهنياً.\nالقيام بأي أعمال أخرى يكلف بها ضمن نطاق مهام واختصاصات القسم.Skills",
    "Skills": [
        "شهادة ماجستير في المحاسبة أو المالية أو الاقتصاد أو إدارة الأعمال أو ما يماثلها من جامعة مرموقة. \nشهادة مهنية من إحدى الجمعيات المهنية المعروفة مثل CFA, CMA, CPA.\nخبرة لا تقل عن 15 سنة في مجال إدارة الشؤون المالية والمحاسبة أو تدقيق الحسابات منها\n7 سنوات أو أكثر بمستوى اشرافي في مؤسسات مالية إقليمية أو دولية أو مكاتب تدقيق حسابات أو مؤسسات حكومية وغيرها من المؤسسات المعروفة بمستوى عالٍ من المهنيّة والانضباط والعمل المؤسسي المنظّم.\nمعرفة ممتازة بتطبيقات معايير التقارير المالية الدولية IFRS.\nقدرة مميزة في إعداد التقارير والتحليل المالي واستخدام نظم المعلوماتية.\nخبرة ملموسة في إدارة وتطوير نظم المعلوماتية المالية وأساليب العمل وتحديث أدلة سياسات وإجراءات العمل.\nشخصية تنسجم مع متطلبات قيادة قسم الحسابات في مؤسسة مالية عربيّة إقليمية رائدة في مجالات اختصاصها، وقدرة مميزة على التجاوب مع احتياجات العمل المتغيّرة والتكيف مع التطورات المهنيّة والمؤسسيّة.\nإجادة اللغتين العربيًة والإنجليزية. إجادة اللغة الفرنسية تعتبر ميزة إضافية.\nيتمتع بشخصية متزنة وجادّة وقادرة على المشاركة في القيادة والتجاوب مع متطلبات الأعمال والتكيّف مع المتغيرات والتطوير المستمر لأساليب العمل.\nيوفّر الصندوق لشاغر هذه الوظيفة حزمة مزايا وفقاً لسياسة التوظيف المطبّقة التي تشمل الراتب وبدل السكن وبدل الأثاث وبدل تذاكر السفر والمساهمة في نفقات تعليم الأولاد والتأمين الطبي وعلى الحياة.\nسيتم الاتصال فقط بالمتقدمين الذين يستوفون الشروط ويرشحون من الإدارة لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 15",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}