{
    "Job ID": "4479240",
    "Description": "Data Entry Officer (Ardiya)Responsible for entering data from various source documents relating to Inventory Activities into the computer system for storage, processing, and data management purposes, in line with set Policies and procedures. Policies and Procedures ▪ Implement the Finance Department’s established policies and procedures and comply with Mohamed Naser Al – Hajery & Sons other policies. Key Activities:Prepare, compile and sort documents for data entry purposes in an efficient and accurate manner.▪ Check documents for accuracy and verify data with necessary corrections where necessary.▪ Obtain further information for incomplete documents to comply with the policies and procedures.▪ Update data and delete unnecessary files and maintain records to ensure accuracy.▪ Combine and rearrange data from source documents where required.▪ Enter data from source documents into computer database, update files and forms.▪ Record information into required electronic format, scan documents into document management systems or databases.▪ Store & update completed documents in designated locations to ensure easy retrieval of these documents.▪ Maintain logbooks or records of activities and tasks in order to ensure efficiency.▪ Respond to requests for information and access relevant files & print information when required.▪ Comply with data integrity and security policies & procedures.▪ Perform other duties as directed by the direct manager.Skills",
    "Skills": [
        "▪ High school diploma.(Degree in business administration is an advantage)",
        "▪ Minimum of 0 - 2 years of experience in the same or related field.",
        "▪ Reliable and Dependable.",
        "▪ Achievement Oriented",
        "▪ Detail Oriented",
        "▪ Communication Skills ",
        "▪ Proficiency in English and Arabic languages. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 2",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale; FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}