{
    "Job ID": "4491126",
    "Description": "صندوق النقد العربي (الصندوق) منظمة مالية إقليمية عربية مقرها في أبوظبي (الإمارات العربية المتحدة) وهدفها الرئيسي هو وضع الأسس النقدية للتكامل الاقتصادي العربي وتسريع عملية التنمية الاقتصادية في الدول العربية. يسعى الصندوق من خلال هذا الإعلان إلى توظيف\n\" محلل تخطيط إستراتيجي\" في وحدة الإستراتيجية والتقييم. \n\nالمهام الرئيسة للوظيفة:\nالمساهمة في جمع المعلومات من الوحدات التنظيمية لإعداد الخطط الخمسية للصندوق، وتنسيق المحتوى وفقاً للأهداف الإستراتيجيّة ومتطلبات التحليل الرباعي (SWOT analysis)، وتحديد مؤشرات الأداء، وغيرها.  \nالمساهمة في المتابعة الدورية مع الوحدات التنظيمية بشأن تحديث بيانات المهام ومستهدفاتها وإدراج المنُجز من المهام المخططة.\nإعداد التحاليل والتقارير الدوريّة التي تمكّن من متابعة التقدم الذي تحرزه الوحدات التنظيمية المعنية في تنفيذ المهام المخططة من خلال التطبيقات التقنية والمنهجيّة المعتمدة.\nالمتابعة الدورية مع الوحدات التنظيمية بشأن مشاريع المبادرات القائمة والمقترحة، لغرض تجميعها وتحليلها وعرضها على المعنيين.\nالمساهمة في إعداد ومتابعة إجراءات إصدار استبيانات دورية بشأن مقترحات ومبادرات موظفي الصندوق بإطار رؤيته واستراتيجيته، وأية مسوحات أخرى تطلبها وحدة الاستراتيجية والتقييم.\nالمشاركة في تحديث دليل التخطيط الاستراتيجي بناءً على المعطيات المستجدة كلما تطلب ذلك. \nتجميع البيانات المطلوبة لإعداد تقارير الأداء نصف السنوية والسنوية بما في ذلك مؤشرات الأداء المؤسسي، من خلال نظام معلوماتي وإعداد تقارير المُنجز تأسيساً على البيانات التي تعدها الوحدات التنظيمية المعنية.\nالتنسيق مع الوحدات التنظيمية لجمع البيانات المتعلقة بقياس التعاون المؤسسي في الصندوق بصورة دورية.\nإجراء البحوث والدراسات لتطوير تطبيقات مهمات التخطيط الإستراتيجي والإرتقاء بالإستراتيجية للصندوق.\nالمشاركة في ورش العمل والعروض التوعوية الداخلية لتعزيز الثقافة الاستراتيجية في الصندوقSkills",
    "Skills": [
        "الشروط والمؤهلات والخبرة:\nشهادة بكالوريوس، أو ماجستير إدارة الأعمال ،أو تقنية المعلومات أو التحليل المالي و الإحصائي، يفضل من لديه تأهيل مهني أو شهادات في التخطيط الإستراتيجي من جامعة معترف بها.\nخبرة في حدود 5 سنوات في مجالات ذات صلة بالتحليل والبحث والتخطيط الاستراتيجي وتقييم الأداء.\nمعرفة بدورة الاستراتيجية، بما في ذلك عملية المتابعة والتقييم (M&E).\nالإلمام بكيفية صياغة التقارير المتعلقة بالإدارة الاستراتيجية.\nالقدرة على تقديم العروض التوعوية في موضوعات التخطيط الاستراتيجي.\nمهارات مميزة في إستخدام تطبيقات تحليل البيانات والتطبيقات المكتبية.\nيتمتع بشخصية مرنة وإيجابية قادرة على التفاعل والتواصل والتنسيق بإطار مؤسسي مع الزملاء والعاملين داخلياً إضافة إلى القدرة على الإنجاز واليقظة.\nإجادة اللغتين العربية والإنجليزية.\nالإلتزام بالدقة والحرص في العمل، والقدرة على تلبية الأعمال بجودة مع ضغوط العمل، ومتطلبات الإنجاز خارج ساعات الدوام الرسمي.\nشخصية تتمتّع بالطموح والتعلّم الذاتي، والرغبة والقدرة في تعزيز ورفد خبراته بمنهجيات التخطيط الإستراتيجي.\nيقدم الصندوق شروط خدمة تنافسية وفقاً لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وبدل تذاكر سفر، والمساهمة في نفقات تعليم الأبناء، والتأمين على الحياة والتأمين الطبي.\nسيتم الاتصال فقط بالذين يتم ترشيحهم من المؤهلين لشغل الوظيفة."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Nationality": "All Arab Countries",
        "Age": "Min: 18 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}