{
    "Job ID": "4491942",
    "Description": "Dealer - Fixed IncomeThe Arab Monetary Fund (AMF) is an Arab regional organization based in Abu Dhabi, United Arab Emirates. Its main objective is laying monetary foundations of Arab economic integration and accelerating the process of economic development in all Arab Countries. AMF is seeking to recruit a “Dealer - Fixed Income” in the Investment Department.Job Purpose:Act as a member of the fixed income unit and work with other colleagues in the Treasury & Direct Investment Division by assisting in managing the surplus liquidity through deployment of funds in fixed income instruments and monitoring the assigned investment portfolios.Duties & Responsibilities:Study varying market trends, analyze current market conditions, and research fixed income opportunities.\nMonitor the AMF's bonds portfolios through daily reviewing valuation, performance, interest rates, maturity, characteristics, and risk parameters relative to benchmarks in order identify any potential discrepancies.\nAnalyze fixed-income securities and make recommendations on possible investment opportunities.\nExecute security trades based on research relating to fixed income investments.\nSelect and execute suitable bond investments in accordance with the relevant investment objectives of each portfolio.\nContinuously monitor the risk indicators of bonds holdings, report exceptions and ensure the system is updated.\nUndertake FX hedging operations using spot, forwards and swaps.\nConduct interbank placements as needed.\nGenerate reports on bonds portfolios managed by the AMF.\nCarry out any other work assignments relevant to the Division.Skills",
    "Skills": [
        "Education:",
        "Bachelor’s degree in Finance, Economics, Business Administration, or Investment Management from a reputable university.\n Professional designation of CFA is preferable. Professional dealing certificate is an advantage.",
        "Experience:",
        "A Minimum of 3 years of experience in a bank or investment management company.",
        "Qualifications, practical experience, and skills:",
        "Professional use of Bloomberg and Reuters.\nInvestment research and studies skills.\nSecurity analysis and modeling skills.\nCredit analysis skills.\nData gathering & analysis skills.\nKnowledge of Microsoft office applications.\nFollow and comply with work related policies, procedures, and processes.\nReport writing skills.\nAbility to work under pressure and plan for own work schedule.\nExcellent communication skills and ability to work with team.\nArabic and English language skills.",
        "The Fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance and life & medical insurance.",
        "Only short-listed candidates will be contacted."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}