{
    "Job ID": "4491946",
    "Description": "The Arab Monetary Fund (AMF) is an Arab regional organization based in Abu Dhabi, United Arab Emirates. Its main objective is laying monetary foundations of Arab economic integration and accelerating the process of economic development in all Arab Countries. AMF is seeking to recruit a “Credit Analyst” in the Investment Department.Job Purpose:Generate periodic credit analysis reports covering both the internally managed and the externally managed fixed income portfolios and inter-bank placements. Duties & Responsibilities:Design models to measure the expected loss from credit exposures across various portfolios.\nMeasure and forecast default risk on credit exposures across various portfolios.\nDevelop, enhance and maintain quantitative credit analysis modules and apply them in order to identify attractive investment opportunities.\nAssess and review risks from covenants and collateral included in bond issuance documentation.\nDesign and implement an internal credit rating system.\nBuild a RAROC model for assessing the performance of the credit portfolio.\nUse credit default models to evaluate credit risk.\nBuild a credit portfolio risk management model to assess credit risk across both the internally managed and externally managed credit portfolios.\nAssist in managing investments risks through performing regular reviews of the ratings and limits of the fixed income portfolios for internally and externally managed funds to ensure they are within the investment policies and guidelines, maintain high quality investments in terms of credit rating, credit ranking, and geographical distribution, and report any exceptions.\nUtilize primary and secondary analysis, research and due-diligence reports of investment firms, banks, and other external financial institutions in order to identify opportunities.\nUndertake thematic and sector research in the global fixed income markets.\nAcquire knowledge of fixed income markets, macro and credit research, and portfolio and risk management capabilities.\nConduct research on global fixed income and credit markets and prepare related reports.\nStay up to date with financial markets developments, including exchange rates, interest rates, short-and long-term deposits, bonds and securities, in order to consider the implications of these market movements on the Fund’s investment activities.\nPerform regular evaluation and monitoring of the credit rating of banks and financial institutions that the Fund deals with currently or may deal with in the future and recommend the appropriate dealing limits with each one of them based on the approved investment policy and guidelines.\nPrepare various investment research papers, studies and due diligence covering areas related to credit in the internal portfolios, the external portfolios and financial markets in order to facilitate the decision-making process within the Department on matters related to the selection of bonds and bond managers.\nSupport portfolio management administration, performance attribution and risk analyticsSkills",
    "Skills": [
        "Qualifications and Practical Experience:",
        "Candidate should be of Arab origin.\nBachelor’s Degree in Finance, Economics, Business Administration, or Investment Management from a reputable university\nProfessional qualification of CFA, PRM or FRM is required.\n5-7 years of experience in a bank or investment and research company with at least 2 years of experience at a similar level.",
        "Skills:",
        "Able to follow and comply with work policies, procedures, and processes\nAbility to work under pressure and plan for own work schedule\nUnderstanding of AMF’s mandate\nProfessional use of spread sheets and Bloomberg, Reuters and data services\nProficient Reports writing skills\nProficient investment research and studies skills\nProficient securities analysis and modeling skills\nProficient understanding of financial markets\nBasic portfolio management skills\nCredit and risk analysis skills\nExcellent communication skills and ability to work with team.\nArabic and English language skills",
        "The fund offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing, furniture, air tickets, education allowance and life & medical insurance.",
        "Only short-listed candidates"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Nationality": "All Arab Countries",
        "Age": "Min: 18 Max: 60"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}