{
    "Job ID": "4511497",
    "Description": "Develop the communications strategy, approach, and implementation plan to create a positive and progressive image of the Group and its business in KSA in line with the Vision of the Group and Vision 2030.\nEnsure continuous coordination and alignment with the group Global brand and communications\nDevelop and execute internal and external communications strategy, guidelines, channels and ensure support is provided to all group's departments and companies.\nManage the identification of target audience segments in preparation for strategy development.\nManage tendering and contracting process to work with outsourced agencies including identifications, request for proposal development, evaluation of proposals and contactor management in coordination with procurement department.\nMonitor the effectives of communication activities for measurement of market positioning and enhancement purposesDigital Marketing:Develop the Website, company profile, content and all related operations to ensure the consistency of the brand image\nDevelop the SEOs and the delivery of quarter/monthly based reports\nManage the social media accounts, and the delivery of KPIs by issuing monthly content calendar and reports.Brand and Branding:Develop brand identity of ALJ Enterprises including communications plan and other materials such as the glossary book.\nManage communications materials for all board meetings and monthly meetings.\nDevelop the branded materials and assets including visual and written content for internal and external, offline, and digital communication channels and platforms ensuring proper message and tonality in line with the set guidelines and brand identity.\nResponsible for activation of the Thought leadership strategy.\nDevelop communication programs via digital and offline channels on a national and international level to ensure proper awareness.\nMonitor and control the use of the brand logo and assets\nOversee and monitor all internal communication and engagement activities\nSet the guidelines and raise the awareness of the Communication Framework\nLaunch annual activity calendar with the support of HR team\nSupport all departments and businesses to launch their communication/ campaigns\nPresent the company in any communication role or activity that is related to the CSR and sustainability\nSet approach and standards for the management of events and protocols, establish roadmap, and ensure all needed resources are available.\nManage event planning and organization (ie. Conferences, exhibitions, sponsorships, special events, board events,..etc) including the development of detailed proposal, vendor selection and management, booth design, and media coverage and ensure timely and accurate implementation of plans in coordination with concerned partners.Skills",
    "Skills": [
        "• Strong knowledge of advanced marketing, public relation and communication techniques and methodologies\n• Ability to manage all communication aspects and sustain consistent brand application and communication practices through all channels\n• Bachelor’s degree in Marketing, or communications or related field.\n• MBA is preferred\n• PMP is preferred\n• 10 + years of experience in the same field (managerial position)\n• Experience in setting up the Balance score card, KPIs.\n• Leadership skills\n• Strategic Planning\n• Management of Personnel Resources: Motivating, developing, and directing people as they work, identifying the best people for the job. Also, ability to lead creative teams.\n• Stress Tolerance: Job requires accepting criticism and dealing calmly and effectively with high stress situations.\n• Good Analytical Skills and Decision Making, Social Perceptiveness.\n• Problem Sensitivity\n• Inductive Reasoning\n• Highly proficient in oral and written English, and Arabic language.\n• High creative skills\n• Balanced and accurate media coverage\n• Qualitative analysis of media coverage.\n• Leverage media coverage to influence key stakeholders.\n• Based in Jeddah with the ability to travel"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}