{
    "Job ID": "4517831",
    "Description": "Job ResponsibilitiesDescription:Develop and oversee the implementation of the business plan and strategies for the mall.\nEnsure appropriate tenant mix in line with business strategy and market demand to achieve desired footfall.\nDevelop and maintain beneficial relationships with existing and potential tenants to ensure continued business.\nEnsure good relations with all tenants, suppliers and contractors.\nMonitor property management, leasing and financial performance of the mall and take required action.\nInvestigate complaints, disturbances and violations of tenants and resolve the issue.\nDevelop and oversee the implementation of marketing and annual events calendar for the mall in coordination with the Marketing department.\nEnsure collection of monthly assessments, rental fees and deposits incurred operating expenses.\nSupervise the operations, maintenance and administrative activities on daily basis.\nCoordinate the activities of staff and contracted personnel.·     Act as liaison between on-site managers, tenants and owners.Skills",
    "Skills": [
        "Qualifications, Skills & Competencies",
        "Experience & Qualification",
        "Bachelor’s degree in Business Administration or similar\nAt least 10 – 15 years’ experience in the similar field\nMS Office experience\nExcellent Arabic & English communication",
        "Abilities & Skills:",
        "Excellent relationship management\nExcellent presentation and communication skills\nGood strategical approach\nCommercial acumen\nVery good technical understanding of all aspects of mall management",
        "Competencies:",
        "Deliver results\nCustomer first\nProblem solving & decision making\nRelationships & teamwork"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries; Kuwait",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 48"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}