{
    "Job ID": "4518710",
    "Description": "Objectives: Our client is a well-known medical center, leaders in the Dermatology and Plastic Surgery, is looking for a Dermatologist to join their team in Doha, Qatar. The main objective of this position is to play a central role in the delivery of dermatological expertise through consulting and diagnostic interaction and servicing clients.The candidate will be reporting to the Medical Doctor. Responsibilities: Providing patients with the highest level of consultation, and appropriate treatment including medicine and cosmetic dermatology procedures.   Assessing patients’ skin diseases, conditions, and ailments to determine appropriate treatment, prescribing medication and creating treatment plans, Conversing with clients to better understand their requirements and making suggestions for improving their appearance. Keeping up to date with new medical procedures, topics, and scientific studies by attending seminars, conferences, and training programs. Adhere to all safety guidelines & processes designed by the clinic, custodian of and has to drive key service quality processes at the clinic level and attend to any emergencies arising during the course of treatment/procedure being offered to a client/patient Ensuring infection control implementation are always meet.Skills",
    "Skills": [
        "Has a Dermatology degree from a reputable university (AUB, LAU, LU, USJ, LAU)\nHas minimum 5 years of practical experience\nProficient with dermatological tools\nUpselling Character"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Gender": "Female",
        "Nationality": "Lebanon"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Medical Clinic",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "--",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "2"
    }
}