{
    "Job ID": "4519109",
    "Description": "Skills",
    "Skills": [
        "Qualifications:\na. Bachelor’s degree in Civil Engineering from recognized University.\nb. Education qualification shall be obtained from North America, West Europe,Australia or equivalent University.\nc. Member of Recognized Body e.g. Chartered Engineer, Professional Engineer or Equivalent.\nExperience:\na. Minimum 8 years of previous experience after obtaining degree from North America, West Europe, Australia or equivalent University.\nb. Experience in designing for the Middle East clients is expected.\nc. Broad experience in sewerage drainage and irrigation design sector.\nd. Experience in projects involving Government Departments and Outsourced Consultants.\ne. Has undertaken similar task as per above item 1 and able to demonstrate Technical Competencies and skills as per below item 4 and 5.\nTechnical Competencies:\na. Knowledge and good experience in using MS office programmes, ACAD, 3D Civil CAD.\nb. Familiar with Planning / Project control software e.g. Primavera or Microsoft Project Control or Microsoft Visio etc.\nc. Familiar with corporate management plans, Project Management Method / Practice or equivalent.\nd. Ability to manage and organize projects.\ne. Ability to understand information from a number of different perspectives to ensure both the operational and customer perspectives are taken into consideration when assessing H&S Risks and recommending / implementing solutions.\nSkills:\na. Preferably able to speak and write in Arabic.\nb. Relationship skills to build common under-standing and ensure delivery of robust and appropriate solutions.\nc. Ability to work on own initiative.\nd. Ability to escalate issues with evidence to management to resolve in acceptable timescales.\ne. Appreciation of good Code of Conduct.\nf. Appreciation of good Customer Service.\ng. Leadership abilities.\nh. Ability to work under pressure.\ni. Willingness to work on a shift/standby rotation."
    ],
    "Preferred": {
        "Career Level": "Mid Career"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}