{
    "Job ID": "4519103",
    "Description": "Key Tasks and Duties:\na. Develop plans and schedules for Department.\nb. Track progress against schedules.\nc. Recommend and evaluate procedures and practices to improve operational efficiency and for alternatives to enhance performance (including outsourcing services).\nd. Attend project review meetings to evaluate progress of on-going construction or maintenance activities.\ne. Liaise with Manager of Drainage Network Operations & Maintenance Department (DNOMD) in order to understand the maintenance plans and adherence to deadlines by third party (outsourcing) contractors.\nf. Develop and responsible for final review of maintenance plans.\ng. Liaise with internal/external Project Manager to understand the implications of their design/construction of their project in relation to maintenance and on-going operation.\nh. Direct and organise a master plan for DNOMD.\ni. Direct and organise advance maintenance management programmes for drainage infrastructure.\nj. Co-ordinate with PWA’s planned maintenance activities with external and internal departments and outsourced companies.\nk. Lead research and benchmarking activities against accepted best practice standards in relation to maintenance planning.\nl. Monitor and supervise the operation of installed computerized asset management system for infrastructure.\nm. Ensure relevant operations and maintenance related design requirements are included in contracts as appropriate.\nn. Final review of Budget to compare with plan as well as previous year’s cost.\no. Ensure that DNOMD and PWA’s planning rules meet requirements of policy and strategy.\np. Highlight to Manager of DNOMD, business risk management/risk assessment base on Plan and progress information especially on critical points, milestones etc.\nq. Gather information and co-ordinate data required for planning purposes from various divisions\nr. Co-operate with Safety and QA/QC.\ns. Report technically and financially to Manager of DNOMD regarding planning and overall progress of approved plans.Skills",
    "Skills": [
        "2. Qualifications:\na. Bachelor’s degree in Civil Engineering or equivalent from recognized University.\nb. Education qualification shall be obtained from North America, West Europe, Australia or equivalent University.\nc. Member of Recognized Body e.g. Chartered Engineer, Professional Engineer or Equivalent Certification in Project Management.\n3. Experience:\na. Minimum 8 years of previous experience after obtaining degree from North America, West Europe, Australia or equivalent University.\nb. Broad experience in construction sector with demonstrated experience in Operations and Maintenance plans and schedules for drainage construction projects & maintenance schedules for waste water networks.\nc. Experience in projects involving Government Departments and Outsourced contractors / Consultants.\nd. Has undertaken similar task as per above item 1 and able to demonstrate technical competencies and skills as per below item 4 and 5.\n4. Technical Competencies:\na. Familiar with Planning / Project control software e.g. Primavera or Microsoft Project Control or Microsoft Visio etc.\nb. Familiar with corporate management plans.\nc. Project Management Method / Practice or equivalent.\n5. Skills:\na. Preferably able to speak and write in Arabic.\nb. Ability to manage and organize projects.\nc. Ability to work on own initiative.\nd. Ability to understand information from a number of different perspectives to ensure both the operational and customer perspectives are taken into consideration when assessing H&S Risks and recommending / implementing solutions.\ne. Ability to escalate issues with evidence to management to resolve in acceptable timescales.\nf. Relationship skills to build common under-standing and ensure delivery of robust and appropriate solutions.\ng. Time Management."
    ],
    "Preferred": {
        "Career Level": "Mid Career"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}