{
    "Job ID": "4520771",
    "Description": "Time Management: Managing one's own time and the time of others.\nMonitoring: Assessing performance of self, other individuals, or organizations to make improvements or take corrective action.\nActive Learning: Understanding the implications of new information for both current and future problem-solving and decision-making.\nInter-Personal Skills:Should possess high level of people handling with ability to analyze and identify the complex nature of the problem.\nGood Communication Skills: (Listening and Questioning) Proven ability to communicate and determine customers’ needs and to sell the dealership's parts and service capabilities based on features, advantages and benefits.\nComputer Skills: Job requires the knowledge in worksheets, word processing, presentation and database management..\nAfter Sales Related Skills:  Persuasive, Able to deal with stress, patient, persistent. Should have automotive and technical knowledge (pre-diagnostic questioning, trouble-shooting, etc.)إدارة الوقت: إدارة وقت الفرد ووقت الآخرين.المراقبة: تقييم أداء الذات أو الأفراد الآخرين أو المنظمات لإجراء تحسينات أو اتخاذ إجراءات تصحيحية.التعلم النشط: فهم الآثار المترتبة على المعلومات الجديدة لكل من حل المشاكل الحالية والمستقبلية واتخاذ القرار.المهارات الشخصية: يجب أن يمتلك مستوى عالٍ من التعامل مع الأشخاص مع القدرة على تحليل وتحديد الطبيعة المعقدة للمشكلة.مهارات الاتصال الجيدة: (الاستماع والتساؤل) قدرة مثبتة على التواصل وتحديد احتياجات العملاء وبيع قطع غيار الوكالة وقدرات الخدمة بناءً على الميزات والمزايا والفوائد.مهارات الكمبيوتر: تتطلب الوظيفة المعرفة في أوراق العمل ومعالجة النصوص والعرض وإدارة قواعد البيانات.مهارات ما بعد البيع: مقنعة ، قادرة على التعامل مع الإجهاد ، والصبر ، والمثابرة. يجب أن يكون لديه معرفة فنية ومعرفة بالسيارات (استجواب ما قبل التشخيص ، وحل المشكلات ، وما إلى ذلك)Job Details",
    "Skills": [],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Altaif, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Altaif, Saudi Arabia",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}