{
    "Job ID": "4526092",
    "Description": "Customer (Guest) and Personal Service: Knowledge of principles and processes for providing customer and personal services. This includes customer needs assessment, meeting quality standards for services, and evaluation of customer satisfaction.\nProduct Sales and Marketing: Knowledge of principles and methods for showing, promoting, and selling products or services. This includes marketing strategy and tactics, product demonstration, sales techniques, sales control systems and Saudi Automotive Industry.\nFinancial and Accounting: Basic knowledge of Accounting and Financial principles and procedures.\nEnglish Language: Knowledge of the structure and content of the English language including the meaning and spelling of words, rules of composition, and grammar.\nTime Management: Managing one's own time and the time of others.\nActive Learning: Understanding the implications of new information for both current and future problem-solving and decision-making.\nStress Tolerance: Job requires accepting criticism and dealing calmly and effectively with high stress situations.\nAchievement/Effort: Job requires establishing and maintaining personally challenging achievement goals and exerting effort toward mastering tasks.\nProblem Sensitivity: The ability to tell when something is wrong or is likely to go wrong. It does not involve solving the problem, only recognizing there is a problem.\nInductive Reasoning: The ability to combine pieces of information to form general rules or conclusions (includes finding a relationship among seemingly unrelated events).\nSales Related Skills:  Persuasive, Aggressive in Sales, Able to deal with stress, patient, persistent. العميل (الضيف) والخدمة الشخصية: معرفة المبادئ والعمليات لتقديم خدمات العملاء والخدمات الشخصية. يتضمن ذلك تقييم احتياجات العملاء وتلبية معايير الجودة للخدمات وتقييم رضا العملاء.\nمبيعات وتسويق المنتجات: معرفة المبادئ والأساليب لعرض المنتجات أو الخدمات والترويج لها وبيعها. ويشمل ذلك إستراتيجية وتكتيكات التسويق ، وعرض المنتج ، وتقنيات المبيعات ، وأنظمة التحكم في المبيعات ، وصناعة السيارات السعودية.\nالمالية والمحاسبة: المعرفة الأساسية للمحاسبة والمبادئ والإجراءات المالية.\nاللغة الإنجليزية: معرفة بنية ومحتوى اللغة الإنجليزية بما في ذلك معنى الكلمات وتهجئتها وقواعد التركيب والقواعد.\nإدارة الوقت: إدارة وقت الفرد ووقت الآخرين.\nالتعلم النشط: فهم الآثار المترتبة على المعلومات الجديدة لكل من حل المشكلات الحالية والمستقبلية وصنع القرار.\nتحمل الإجهاد: تتطلب الوظيفة قبول النقد والتعامل بهدوء وفعالية مع المواقف الشديدة التوتر.\nالإنجاز / الجهد: تتطلب الوظيفة إنشاء أهداف الإنجاز الصعبة الشخصية والحفاظ عليها وبذل الجهد نحو إتقان المهام.\nحساسية المشكلة: القدرة على معرفة ما إذا كان هناك خطأ ما أو من المحتمل أن يحدث خطأ. لا يتضمن حل المشكلة ، فقط الاعتراف بوجود مشكلة.\nالاستدلال الاستقرائي: القدرة على دمج أجزاء من المعلومات لتشكيل قواعد أو استنتاجات عامة (بما في ذلك إيجاد علاقة بين الأحداث التي تبدو غير ذات صلة).\nالمهارات المتعلقة بالمبيعات: مقنعة ، عدوانية في المبيعات ، قادرة على التعامل مع التوتر ، صبور ، مثابرة.Job Details",
    "Skills": [],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Altaif, Saudi Arabia",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}