{
    "Job ID": "4538294",
    "Description": "A Fortune 500 client is hiring a Profit Analysis & Consultancy Consultant. Based in Riyadh you will provide the consultancy and the right tools for operations leads to improve the restaurant's profitability.Review the monthly detailed P&L and Management Reports to identify the store-wise performance opportunities for the profit consultancy.\nPresent the identified opportunities to the operations leads (Operations Manager, Operations Consultant & Store Manager) and discuss & agree on the action plans to improve restaurant profitability.\nContinuous follow-up on the status of the already agreed action plans.\nAssist Manager, PAC on action planning on loss-maker stores to improve profitability.\nAssist Manager PAC in the benchmarking process to establish internal standards for the loss-maker stores.\nCarry out continuous P&L workshops.\nProvide monthly P&L Clarification to the Operations Leads.\nAssist PAC Manager in reviewing and evaluating the functional processes of the various departments to enhance process efficiency and cost savings.\nProvide timely, relevant, and accurate reporting & analysis of the results of the operational performance against historical & approved budget to facilitate the profitable decision making\nProactively take responsibility for self-improvement and develop expertise through off-the-job training activities and involvement in more complex tasks and projectsSkills",
    "Skills": [
        "Minimum 3 years of experience in a similar role specializing in Performance Analysis and Consultancy.\nCIMA (UK) /CPA.\nManagement Skills.\nAnalytical Skills.\nProblem Solving Skills.\nCommunication Skills.\nPresentation Skills.\nComputer Literacy (Word, Excel, PowerPoint, Outlook).\nDetail Orientated."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 6",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 28"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}