{
    "Job ID": "4559538",
    "Description": "Accountant- Saudi FemaleWe are Building Tec. Elevators .We are looking for an Junior Accountant to Performing day to day all financial transactions, provide us with financial information and prepare feasibility studies.Key Responsibilities:Performing day-to-day financial transactions, including verifying, classifying, computing, posting, and recording accounts receivables, accounts payable, and cash data.\nPrepare monthly bank reconciliation reports regarding all cash deposits to the banks.\nPerform monthly, quarterly, and annual accounting activities.\nReview accounts payable/accounts receivables balances to ensure accuracy\nPrepare the fixed assets register for the company and use the par code system.\nFollow up the loan settlements and prepare a bank reconciliation every Month.\nResponsible for ZAKAT & VAT report for the Company.\nPreparing Monthly Financial Reports to Management and doing periodical book closing.\nAssist the manager to Finalize the financial statements with the auditor.Skills",
    "Skills": [
        "Qualification Requirements Education and/or Experience",
        "Must be Saudi Citizen females\nBachelor's degree in Accounting or a related field\n Ability to read, speak and write Arabic and English\nIt’s plus , Extensive knowledge of Oracle like ( Netsuite ).\nAdvanced computer skills in accounting software and databases.\nMS Excel, Word, and PowerPoint skills.\nExcellent communication skills, both verbal and written.",
        " This is an immediate hire."
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Mechanical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}