{
    "Job ID": "4566301",
    "Description": "صندوق النقد العربي (الصندوق) منظمة مالية إقليمية عربية مقرها في أبوظبي (الإمارات العربية المتحدة) وهدفها الرئيسي هو وضع الأسس النقدية للتكامل الاقتصادي العربي وتسريع عملية التنمية الاقتصادية في الدول العربية. يسعى الصندوق من خلال هذا الإعلان إلى توظيف \"مدير دائرة القانونية والامتثال\" في الصندوق.\nالغرض:\nبصفتك مدير دائرة القانونية والامتثال، يقع على عاتقك مسؤولية التأكد من أن صندوق النقد العربي يتوافق مع المتطلبات التنظيمية الخارجية والسياسات والتعليمات الداخلية، وكذلك تقديم التعاون في القضايا المتعلقة بإجراءات الحوكمة. سوف تختص بأمور الامتثال التنظيمي للتشريعات المحلية، وتتحمل الدور عن تحديد التشريعات التي لها آثار على صندوق النقد العربي والتأكد من الالتزام بها. بالإضافة إلى ذلك، عليك أن تقدم المشورة والرأي القانوني الأمثل وتقييم المخاطر القانونية لصندوق النقد العربي بشأن جميع المسائل القانونية لتسهيل صنع القرار وضمان الحماية من التعرض للأخطار القانونية (خط الدفاع الأول)؛ والتصرف بمثابة \"خط الدفاع الثاني\" الذي يوفر الإشراف على مخاطر الامتثال التنظيمي والداخلي للوائح والتعليمات التنظيمية وتقديم التقارير إلى المدير العام رئيس مجلس الإدارة لصندوق النقد العربي.\nالمهام الرئيسة للوظيفة :\nإنشاء وتنفيذ وإدارة وتطبيق السياسات والإجراءات والتعليمات والقوانين واللوائح اللازمة لعمل صندوق النقد العربي وفقًا للوائح الداخلية والسياسات والإجراءات. \nإنشاء وتحديث دليل الامتثال، وتطوير و/أو الحفاظ على استراتيجية وأطر عمل السياسات القانونية والامتثال. \nصياغة العقود التقليدية والمعقدة والتفاوض بشأنها.\nمواكبة القوانين واللوائح ذات الصلة وفهمها ومراقبة الامتثال للقوانين واللوائح والسياسات والإجراءات والتعليمات الداخلية. \nتقديم المشورة والخدمات القانونية عالية الجودة والفعالة من حيث التكلفة، بما في ذلك الصياغة والمراجعة والعمل كحافظ أمين لجميع الوثائق والعقود القانونية.\nأداء أنشطة الأمانة الفنية لمجلس المحافظين ومجلس المديرين التنفيذين.\nتطوير المنهجيات والعمليات الداخلية وصيانتها وتشغيلها لتحديد مخاطر الامتثال التنظيمي أو القانوني بشكل فعال ومراقبتها والإبلاغ عنها وتصعيدها، بما في ذلك إجراء أي تحقق داخلي.\nالإشراف على العلاقة مع هيئات الدولة الرسمية ذات الصلة في الأمور القانونية والامتثال.\nالعمل كحافظ أمين لكلمات المرور الحساسة أو كلمات المرور للمستخدمين لخدمة السويفت وخلافه.\nاقتراح التغيرات في أمور الحوكمة القانونية لصندوق النقد العربي.\nاعتماد المنهجيات والعمليات الداخلية لتحديد مخاطر الامتثال ومراقبتها والإبلاغ عنها وتصعيدها.\nتطوير وتنفيذ الإجراءات القانونية للوفاء بالمتطلبات الإجرائية أو التشريعية.\nتطوير المنهجيات والعمليات الداخلية وصيانتها وتشغيلها لتحديد مخاطر الامتثال ومراقبتها والإبلاغ عنها وتصعيدها بشكل فعال، بما في ذلك إجراء التحقق الداخلي.\nتقديم المشورة والآراء القانونية للإدارة العليا وأي دائرة/ قسم آخر بشأن الاستثمارات والمحافظ والاتفاقيات والمنازعات.\nتوجيه ومراقبة وإعداد الدراسات والأبحاث القانونية. وتنسيق العلاقات مع الخبراء القانونيين الخارجيين والمحامين الخارجيين. وإدارة الاستجابة للقضايا والنزاعات القانونية.\nمباشرة الإعداد للاجتماعات والمستندات المتعلقة بها، ووضع جدول الأعمال وإعداد المحاضر لمجلس المديرين التنفيذين ومجلس المحافظين وعمل المسودات وإعداد مسودات القرارت الداخلية. \nصياغة وإعداد مسودات قرارات مجلس المديرين التنفيذين ومجلس المحافظين والعمل حافظ أمين لأصول المستندات ذات الصلة.\nتقييم آثار مخاطر الامتثال القانونية والتنظيمية بشأن أهداف صندوق النقد العربي وأنشطته.\nمباشرة التحقق بشأن الخروقات المزعومة للوائح الداخلية.\nإقامة علاقات فعالة والحفاظ عليها مع جميع السلطات التنظيمية مع توخي أعلى معايير أخلاقيات الأعمال.\nالحضور في جميع المسائل والأمور الهامة على الفور للتأكد أن الخدمات القانونية التي يتطلبها صندوق النقد العربي تؤدى إليه بكفاءة.\nتولي أداء أي مسائل قانونية أو متعلقة بالامتثال يتم تكليفك بتنفيذها. Skills",
    "Skills": [
        "المؤهلات والخبرة:\nليسانس القانون من كلية حقوق معتمدة، وعضو في نقابة محامين معترف بها، ويفضل الحصول على الماجستير في القانون.\n10-15 سنة من الخبرة لدى مؤسسة/شركة ذات سمعة طيبة منها 3 سنوات في وظيفة قانونية رائدة في شركة أو منظمة مماثلة أو مؤسسة مالية.\nالمهارات الفنية الخاصة بالوظيفة:\nالبحث القانوني وصياغة التقارير واتخاذ القرارات والتحكيم والمقاضاة، والتقاضي، والتفاوض والتعاقد.\nمعرفة السياسات واللوائح والتشريعات.\nتحليل التخفيف من المخاطر القانونية والامتثال ومهارات إدارة الأزمات.\nفهم الأطر التنظيمية والقانونية لإدارة مخاطر الامتثال وأفضل الممارسات واللوائح.\nتقدير المخاطر.\nمهارات التواصل الفعال.\nمهارات التدريب على المواضيع القانونية والإمتثال.\nالمعرفة بعمليات ومخاطر المؤسسات المالية.\nإتقان اللغة العربية والإنجليزية اتقان تام.\nيقدم الصندوق شروط خدمة تنافسية وفقا لسياسة التوظيف المطبقة، والتي تشمل الرواتب المعفاة من الضرائب، وبدل الأثاث، وبدل تذاكر الطيران، وبدل تعليم الأبناء، والتأمين على الحياة والتأمين الطبي.\nسيتم الاتصال فقط بالذين يتم ترشيحهم لشغل الوظيفة"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}