{
    "Job ID": "4578366",
    "Description": "The Arab Monetary Fund (AMF) is an Arab regional organization based in Abu Dhabi, United Arab Emirates. Its main objective is laying monetary foundations of Arab economic integration and accelerating the process of economic development in all Arab Countries. AMF is seeking to recruit a “Legal officer” in the Legal Department.Duties & Responsibilities:Provide legal advice and support to the business while keeping in mind the AMF strategic and business objectives.\nConduct legal due diligence for AMF projects to ensure compliance with the AMF Articles of Agreement and operational policies, and general adequacy of projects’ institutional and other arrangements with the relevant country’s legal framework.\nComplete legal tasks and projects in a timely manner and responds to legal queries.\nSupport AMF affiliates by providing legal oversight/opinions on legal matters/risks.\nDraft and negotiate contracts/agreements and other legal documents to maximise the AMF legal protections whilst simultaneously minimising legal risks.\nProduce and regularly update standardised legal agreements, contracts and standard terms and conditions for the AMF in compliance with international best practices and applicable legal requirements.\nAdvise departments/project teams on AMF policies, procedures, and legal inquiries.\nPrepare legal memoranda on pertinent legal issues.\nWork closely and develop a positive professional relationship with other members of the AMF and shares legal knowledge and best practices with colleagues, including providing formal and informal legal training sessions.\nLiaise with external law firms and relevant authorities to ensure the effective resolution of all legal matters affecting the AMF.\nMake recommendations for improvements to policies, processes and streamlining the same to bring about efficiency and improve turn-around time.\nDevelop contingency plans to deal with emergencies related to legal matters.\nMaintain continuous follow-up of regulatory landscape development related to AMF fields of legal interest. Skills",
    "Skills": [
        "Qualifications and Experience::",
        "An LL.B. degree, JD degree or equivalent, with at least seven years of relevant work experience and qualified to practice law /Bar admission (or equivalent) in at least one jurisdiction is required.\nA master’s degree in law (LLM) is desirable. Experience in a reputable private sector law firm and / or with an international/regional financial organization is a strong plus.\nExcellent legal research, writing, drafting, analytical and communications skills.\nExcellent interpersonal skills.\nExperience in administrative/civil contract law, in transactional legal work and/or preparation and negotiation of legal agreements.\nFamiliarity in the use of varied legal research sources (including electronic sources in the internet) and other databases.\nFully proficient in computer skills, particularly in using word processing software, information databases, internet services, and library sources.\nAbility to work well as a team member in a multi-cultural and multi-ethnic environment.\nAbility to work under time pressure and to juggle multiple tasks within tight deadlines.\nGood command of both the Arabic and English languages.",
        "The AMF offers competitive terms of services in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air tickets, education allowance, and life and medical insurance.",
        "Only short-listed candidates will be contacted"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 18 Max: 45"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}