{
    "Job ID": "4591264",
    "Description": "ترتيب المواعيد وزيارة العملاء المستهدفين.\nالوصول إلى أهداف المبيعات السنوية وتجاوزها إن أمكن.\nكسب عملاء جدد وكذلك تطوير علاقات طويلة الأمد مع العملاء الحاليين.\nتخطيط جداول العمل والجداول الزمنية الأسبوعية والشهرية مع فريق مبيعات ومناقشة الأهداف المستقبلية.\nحضور اجتماعات الشركة وعرض البيانات التقنية.\nمواكبة مع أحدث البيانات المقدمة من الشركة وتفسير وعرض هذه البيانات مع المهنيين.\nتحليل بيانات المبيعات لتحسين النتائج والتأكد من تخصيص الموارد بفعالية.\nمراقبة نشاط المنافسين و منتجات المنافسين.\nوضع استراتيجيات لزيادة فرص البيع والتواصل مع أصحاب القرار في القطاع الطبي والرعاية الصحية.\nالبقاء على اطلاع حول أنشطة الخدمات الصحية في منطقة محددة.Arranging appointments and visiting target customers.\nReach and exceed annual sales targets if possible.\nGain new clients as well as develop long-term relationships with existing clients.\nPlan weekly and monthly work schedules with a sales team and discuss future goals.\nAttend company meetings and present technical data.\nKeep up to date with the latest data provided by the company and interpret and present this data to professionals.\nAnalyze sales data to improve results and ensure resources are allocated effectively.\nMonitor competitors' activity and competitors' products.\nDevelop strategies to increase sales opportunities and communicate with decision-makers in the medical and healthcare sector.\nStay informed about the activities of health services in a specific area.Skills",
    "Skills": [
        "خبرة لاتقل عن ٣ سنوات.\nوجود رخصة قيادة وسيارة.\nالقدرة على التفاوض وإقناع العملاء.\nامتلاك مهارات البيع وبناء العلاقات.\nاتقان مهارات الكمبيوتر واللغة الانكليزية\nExperience of not less than 3 years.\nOwn car and driving license\nAbility to negotiate and persuade clients.\nPossess selling and relationship-building skills.\nFluency in computer and English language skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Alqasim, Saudi Arabia ; Dammam, Saudi Arabia ; Jeddah , Saudi Arabia ; Riyadh, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}