{
    "Job ID": "4600491",
    "Description": "The International University of Science & Technology in Kuwait (IUK) is a newly established private university in Kuwait, with a new Campus located in the heart of Kuwait near the Avenues Mall. Fully accredited by the Private Universities Council (PUC), the University offers a wide range of academic programs in three Colleges; namely: College of Engineering, College of Business Administration, and College of Arts. In addition to the academic programs, the IUK has established the University Foundation Program (UFP) that offers English and Math foundation programs. The IUK is looking for dynamic full-time faculty members who are passionate about teaching, and contributing to the development of a vibrant and successful learning environment for students.  Position SummaryThe College of Engineering invites applications for positions at the level of Assistant /Associate Professor in different domains; namely: Computer Engineering \nElectrical, Engineering \nCivil & Architectural Engineering \nBio-Medical Engineering \n Architecture & Design  \nComputer Science & Cyber security The College offers Bachelors of Science (B.Sc.) in the above programs. The primary role of the faculty members is to promote high-quality teaching, research and creative work, university services, and to mentor junior colleagues. In addition, the faculty will collaborate with the Head of Department, Dean, and colleagues to achieve the Department's and College’s mission and vision, in line with the IUK’s vision, and support the department with academic and administrative services. Reporting to the Department Chair, the successful candidate will be responsible for the development, delivery, and evaluation of a broad range of courses within designated specialization.  In addition to teaching, successful candidates are expected to maintain significant scholarly work and professional services. The successful candidate will contribute to developing an outcome-based student-focused curriculum. Furthermore, faculty members are expected to maintain office hours, provide advice for students, participate in curriculum development, and contribute to the university’s professional development activities. Responsibilities:Teach different courses according to his/her specialty and experience. \nPromote innovation in teaching by introducing new teaching methodologies and strategies.  \nEngage with students in and out of the classroom. \nPromote research activities and other creative work at IUK including publishing in indexed peer-reviewed publications. \nMentor new colleagues and teaching assistants  \nSupport the mission of the Department and College at IUK by following the set curriculum and working towards achieving the program objectives and student learning outcomes.  \nFollow the university bylaws and regulations and promote the institutional environment. \nCommit to teaching schedules, office hours, preparation, service, and professional development. \nProvide academic support to other colleagues in the department. \nParticipate in the College's and the University's events and supporting collegiality.  \nSupport the College and the University in organizing seminars, international conferences, and faculty events. \nServe in the College's and university's committees as needed.  Skills",
    "Skills": [
        "Qualifications:",
        "A Ph.D. in the related Engineering domain with a dissertation or intensive research/teaching. \nProfessional certifications is an asset. ",
        "Experience:",
        "A minimum of three years of university teaching experience for Assistant professor and five years for associate professor at a university level. \nA proven research record, scholarly work, publications, and knowledge transfer. A minimum of three journal articles in peer-review indexed journals (ISI or Scopus) for Assistant professor and five years for associate professor. \nA proven experience in using different learning management systems and in adopting e-learning teaching strategies.  \nAn experience that proves an understanding of a multicultural academic environment, and understanding of students' needs, including those of special needs. \nAn experience with various instructional methodologies. ",
        "Technical Skills",
        "Excellent writing and interpersonal skills. \nCommitment to excellence in teaching and scholarship \nComputer, LMS, and e-learning skills \nExperience in course design based on outcome-based education (OBE) model is an asset.  ",
        "Behavioral Skills ",
        "Strong interpersonal and problem-solving Skills  \nEffective communication skills in English \nTeam and time management skills \nA passion for teaching. ",
        "How to Apply",
        "Interested applicants are kindly requested to prepare the following and email to hr@iuk.edu.kw:",
        "A cover letter explaining how your experience and credentials demonstrate that you are qualified for the position. \nA detailed resume indicating academic and professional experiences.  \nTeaching statement that shows your philosophy about teaching and learning. You may include evidence of how you transfer your philosophy into practices in the classroom. \nThree letters of recommendation. \nA copy of your credentials, transcripts, and certificates that show you meet the minimum requirement(s) for the position; all in one PDF file "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Degree": "Doctorate"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "15"
    }
}