{
    "Job ID": "4600808",
    "Description": "Compares identifying information and counts items of outgoing shipments to verify information against sales orders or other records\nAffixes shipping labels on packed cartons and write and/or stamps identifying shipping information on cartons\nSchedule and process International shipments, including bill of lading and NAFTA documentation\nPick/pack using scanner including trade show orders\nOperates forklift truck, cherry picker or uses pallet jack to move, or transport products from/to storage or work area\nCreate a constant pipeline of new materials and technologies that will be of interest to ThinkLAB clients and team\nIdentify root cause and supply possible solutions\nAssist the Materials Manager in all phases of inventory managementSkills",
    "Skills": [
        "Must be able to operate all other pieces of equipment within the department safely and efficiently\nCommunication skills.\nAbility to work in a multi-cultural environment.\nTeam Orientation & Interpersonal – highly motivated team player with ability to develop and maintain collaborative relationships with all levels within and external to the organization.\nAdaptability to Change – able to be flexible and supportive, react swiftly to and able to positively and proactively assimilate change in rapid growth environment.\nMulti-task - Ability to expeditiously organize, coordinate, manage, prioritize, and perform multiple tasks simultaneously to swiftly assess a situation, determine a logical course of action, and apply the appropriate response.\nOrganization & Time Management – able to plan, schedule, organize and follow up on tasks related to job to achieve goals within or ahead of established time frames.\nRelationship Management – able to personally provide high level of interactive service to others, building relationships and addressing identified needs.\nMin GPA 3/4 & 3.75/5\n3+ years of proven experience."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}