{
    "Job ID": "4608953",
    "Description": "Generally familiar with systems design, programming, and oral and written communications.\nReport, work closely and collaborate with the Director to understand the business logic and design to optimize frontend performance\nWork in a fully agile environment and learn from a smart, motivated team\nWrite clean codes for the front and back end of the applications\nBuild and deploy reliable web applications in a production environment leveraging automated testing and continuous delivery\nUpgrade and main the software following deployment\nImplement and design new features on both applications and web technologiesWrite effective APIs\nCollaborate with the Director to understand the business and design provided\nMaintain and write all necessary technical documentation\nTroubleshoot, debug and resolve application and client side issues\nBuild cutting-edge web applications and microservices and mobile applicationsSkills",
    "Skills": [
        "Primary:",
        "HTML5, JavaScript, CSS3\nAble to travel internationally when needed\nPossesses a thorough understanding of SQL and NoSQL database design and implementation methodologies\nPossesses IT or business related two- or four-year college degree, or a minimum of three (3) years of experience in a medium to large scale Information Services environment\nBachelor’s Degree in Computer Science or comparable degree\nMinimum 3year consecutive work experience related to Web Development or Database Administration\nMust be competent to work independently in database management activities.\nExperience in developing API-driven micro-services\nPython\nWeb-UI Frameworks\nFront-end Web Frameworks (ReactJS, NodeJS, Odoo, OWL)\nMobile Framework (React Native, Swiftic, Ionic)\nTesting Framework (Selenium, Webdriver)\nElastic Search, Kabana\n.Net (C#, ASP.Net, MVC, Web API)\nPHP Framework (Laravel)\nREST API\nSQL Server, MySQL, Postgres\nWeb Server administration (IIS, Apache, Nginx)\nHave strong communication skills\nExperience with data mining techniques and procedures\nFluent in English\nEffective communication skills\nCreative and meticulous and has the ability to manage tasks with attention to detail and accuracy.\nStrong commitment to customer service.\n·Demonstrated strong analytical skill sets, which include problem solving",
        "Plus:",
        "AWS Cloud\nOdoo\nNoSQL (MongoDB)\nPython\nCICD\nMobile Development\nData and Access security and optimization\nHigh-density data optimization\nBusiness Intelligence\nKnowledge in linux server administration"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}