{
    "Job ID": "4615197",
    "Description": "يسر شركة قونية للتطوير وإدارة العقارات الإعلان عن إطلاق المرحلة الثانية من البرنامج الأول من نوعه في الأردن \"برنامج رواد الأعمال العقاريين\" والذي سوف يخضع المشاركون من خلاله إلى برنامج تدريبي دولي مكثف بالإضافة إلى دعم وتوجيه فريق من خبراء العقار في قونية حتى يتمكن المشارك في البرنامج من تحقيق الاستقلالية المادية والدخل المرتفع.نسعى لتدريب وتطوير فريق من استشاري العقارات للانضمام إلى فريقنا المميز لمساعدة عملائنا في شراء وبيع وتأجير عقاراتهم باحترافية وخدمة مميزة عالية المستوى.نحن في قونية تحكمنا مجموعة من القيم النبيلة ومن أهمها المصداقية، الاحترافية، الثقة، والعمل الجماعي. وإذا كانت لديك رغبة بالتعلم والتطور والاستقلالية،Konya Real Estate is pleased to launch the second phase of the first-of-its-kind programme in Jordan, the “Real Estate Entrepreneur Programme”. Participants will receive an intensive, world-class, and free training programme and, top-notch support from our team of experts and managers until you start generating your own income.We are looking for a team of real estate agents to join our company as we continue helping our clients buy, sell, and rent their properties.Skills",
    "Skills": [
        "المهارات / القدرات المطلوبة:",
        "·       مهارات تواصل ممتازة شخص اجتماعي",
        "·       منظم ويهتم بالتفاصيل ولديه شغف بالتعلم",
        "·       يتقن التعامل مع Microsoft Office والبرامج الأخرى",
        "Required Skills/Abilities:",
        "·       Excellent communication skills and ability to build a network of relations (Social Person)",
        "·       Interpersonal and customer service skills.",
        "·       Organisational skills and attention to detail.",
        "·       Proficient with Microsoft Office and related softwares.",
        ". Candidates should be motivated and eager to learn, honest, confident, and extroverted.",
        "ملاحظات هامة:",
        "·       يجب امتلاك رخصة قيادة + سيارة",
        "·       لا يوجد ساعات عمل محددة.",
        "·يشترط ان يكون مكان الاقامة في عمّان",
        "Important Notes:",
        "·       Must have a driving license + a car",
        "·       Attendance at company’s office is optional and not required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}