{
    "Job ID": "4621339",
    "Description": ": الأهداف الوظيفة\n·        وضع خطط وآليات العمل الخاصة بتصميم وإدارة العمليات وتطبيق مبادئ وممارسات الجودة والمواصفات، والمساهمة في تحقيق أهداف الإدارة من خلال الاشراف والمتابعة على جميع الأعمال التنفيذية في الخطة التشغيلية ذات الصلة.\n·        المساهمة في تنفيذ الأنشطة المرتبطة بعمل الإدارة ورسم السياسات العامة ووضع الاستراتيجيات الخاصة بالتميز المؤسسي وتطوير منظومة العمل الحكومي وتطبيق معايير وبرامج الجودة والتميز الحكومي والتي تتمثل في تطوير الخدمات المؤسسية بالتوافق مع معايير برامج التميز الحكومي\n\nالمسؤوليات:\nالجودة\n·        اعداد مقترح الخطة الاستراتيجية للقسم والاسهام في تطويرها واعداد ومتابعة تنفيذ الخطط التشغيلية لضمان توازنها مع اهداف الادارة.\n·        وضع مبادئ وضوابط لإدارة وتوجيه العمليات وتحسين الانتاجية.\n·        تعزيز العلاقات مع الشركاء الداخليين والخارجيين لضمان تقديم خدمات وفق أفضل المعايير.\n·        وضع برامج تعزز التعلم المستمر وتطوير وتدريب وتحفيز فرق العمل لضمان تقديم الخدمات بأعلى جودة.\n·        المتابعة الدورية لمؤشرات الأداء واعداد تقارير نسب الانجاز بالقسم ورفعها لمدير الادارة.\n·        المشاركة في إعداد موازنة الإدارة بالتنسيق مع الوحدات المختصة بالجهة.\n·        الإشراف على تطوير نظام متكامل لإدارة العمليات، والتوعية به ومتابعة تطبيقه مع الوحدات التنظيمية ذات العلاقة، والعمل على توثيق وحصر وتصنيف العمليات بما يساند جهود التطوير وتحسين الأداء.\n·        الإشراف على تحليل العمليات وإعادة هندستها بما يضمن تسهيلها وتقليل كلفتها ووقت إنجازها وفق افضل الممارسات.\n·        اقتراح التعديلات على الأنظمة الإدارية لتسهيل العمليات ومنع الازدواجية في المهام بين الوحدات التنظيمية في الجهة الاتحادية والجهات المختصة، وفق أفضل الممارسات والمعايير المعتمدة. \n·        الإشراف على تطوير أدلة العمل في الجهة الاتحادية بما يشمل توضيح الأدوار ومسؤوليات الوحدات التنظيمية المختلفة وتحديد مقاييس أداء العمليات ومتابعة قياسها وعمل التعديلات والمراجعات التطويرية عليها.\n·        الإشراف على متابعة تطبيق أنظمة الجودة الإدارية المختلفة في الجهة.\n·        الإشراف على تطبيق برامج التدقيق الداخلي على مختلف أنظمة الجودة والمواصفات في الجهة ومتابعة المبادرات التصحيحية والوقائية.\n·        متابعة التزام مختلف الوحدات التنظيمية بمتطلبات مواصفات الجودة وضمان استمرارية حصول الجهة على شهادات الاعتماد.\nالتمييز\n·        المساعدة في تنفيذ أنظمة الجودة وهندسة العمليات ومتطلبات تطوير الأداء المؤسسي والتميز الحكومي وتعزيز ثقافة التميز والخدمة المتميزة للمتعاملين\n·        المساعدة في تطبيق متطلبات برنامج الشيخ خليفة للتميز الحكومي بتخطيط وتنفيذ برامج التقييم الذاتي على مستوى الوزارة والمشاركة في إعداد ومراجعة أوراق التقديم للجائزة ورفع التقارير اللازمة\n·        المساعدة في تنفيذ و إدارة جائزة التميز المؤسسي الداخلية ونشر ثقافة التميز لكافة المستويات الوظيفية بمختلف الوسائل المتاحة\n·        متابعة وإعداد و مراجعة أنظمة المكافآت في الوزارة وتطبيق منهجية تكريم الفئات المعنية\n·        متابعة وإعداد و تطبيق منهجيات التميز الحكومي ووضع وقياس كافة مؤشرات الاداء الرئيسية للعمليات\n·        متابعة وإعداد وتنفيذ دراسات قياس رضا الفئات المعنية ورفع النتائج للمعنيين وتوجيه الإدارات المعنية لاتخاذ اللازم في هذا الخصوص\n·        متابعة ومراجعة وتقييم كفاءة العمليات والاجراءات المختلفة في الجهة وضمان تناسقها وتقديم الاقتراحات التحسينية لرفع فعاليتها وتبسيطها\n·        المساعدة في تطوير نماذج وآليات قياس مستوى رضا العملاء والمتعاملين حول جودة الخدمات والبرامج المقدمة من الوزارة وتعميم هذه النماذج على المعنيين\n·        المساعدة في دراسات المقارنة المعيارية مع الجهات الحكومية المتميزة والجهة في ذات المجال وتحديد نقاط الضعف والقوة ومجالات التحسين\n·        المساعدة في تنفيذ معايير تقييم الأداء المؤسسي KPI\n·        متابعة وإعداد التقارير اللازمة المختصة بتطوير آليات التميز في العمل الحكومي \nمهام أخرى\nأي مهام أو مسؤوليات أخرى من نفس الطبيعة أو المستوى يُكلَّف بها أو يكلفه بها المدير المباشر.Skills",
    "Skills": [
        "المؤهلات:\nماجستير في الإدارة العامة أو ما يعادله في تخصص مشابه \nأو بكالوريوس في الإدارة العامة أو ما يعادله في تخصص مشابه\nالخبرات ماجستير خبرة 5 سنوات في ذات المجال أو بكالوريوس خبرة 10سنوات في ذات المجال\nالمهارات التقنية:\n·        إلمام باللغة العربية والإنجليزية\n·        مهارات الإشراف\n·        مهارات التحليل واعداد التقارير\n·        مهارات استخدام الحاسب الآلي وتطبيقاته\n·        اعداد الموازنات\n·        الالمام بكافة السياسات والاجراءات والانظمة المتعلقة بمجال العمل\n·        مفاهيم التميز المؤسسي \n·        اساليب التقييم الذاتي المؤسسي EFQM\n·        نظم إدارة الجودة QMS\n·  القدرة التواصل و حل المشكلات\n\nالمهارات الشخصية:\n·        العمل بروح الفريق\n·        التواصل ومهارات الاتصال\n·        التركيز على خدمة العملاء\n·        التركيز على النتائج\n·        إدارة الموارد بفاعلية\n·        التفكير الاستراتيجي\n·        تمكين الموظفين وتطوير قدراتهم\n·   قيادة التغيير "
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Sports & Outdoor Activities",
        "Company Type": "Unspecified",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}