{
    "Job ID": "4632222",
    "Description": "Core AccountabilitiesAssist in obtaining sufficient background information and knowledge, in the understanding of the overall business process, and in the identification of key risks to properly plan and complete fieldwork.\nConduct audit procedures and tests of audits as assigned and provided by the Managerial position, draft memorandum for reporting results of audit procedures and tests, and discuss results of audit procedures and tests before communicating with the audit clients to have quality & compliance review of the results.\nEnsure development of the audit reports to communicate results of assigned audit engagements, liaison with audit clients to carry on audit planning, fieldwork, follow-up, monitoring, and consultations, and Support internal auditors to conduct the audit procedures.\nConduct the audit work to ensure the assessment of the effectiveness and efficiency of internal controls is adequate and sufficiently supported and documented and the departmental and professional standards are adequately upheld.\nPrepare audit findings and recommendations from technical and compliance aspects to improve the quality of the result and discusses findings with auditees/clients to achieve agreement and understand their concerns on corrective actions.\nCoordinate entrance and exit conferences with audit clients and prepare draft findings to facilitate the work between parties.\nDocument work papers after reviewing the procedures, record notes, and obtain sufficient evidence to support audit findings and recommendations.\nAssist in research of consulting engagement issues and special reviews (other than audits), particularly of a technical nature, and investigate support activities to facilitate the research and investigation processes.\nParticipate in occasionally leading project teams and task forces especially of a technical nature to facilitate the workflow.\nReview and evaluate the performance of consultants and auditors appointed from external firms to meet certain standards of performance.Skills",
    "Skills": [
        "·       Proficient in applying internal auditing standards and accounting principles & practices.",
        "· Hands-on knowledge to conduct a risk assessment.",
        "·       Analytical Ability",
        "·       Skill in collecting and analyzing complex data and drawing logical conclusions.",
        "·       Considerable skill in effective verbal and written communication in English. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 4"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}