{
    "Job ID": "4651514",
    "Description": "Assist in documenting the risk assessment and support executing the risk-based audit plan to achieve audit objectives and goals.\nReceive the audit program and instructions for a specific audit area and accordingly perform the work in line with Audit Plan.\nFollow the prescribed audit program, accumulate, verify, analyze available data, observe actual practices, evaluate functional operational techniques and identify existing or potential problem areas to facilitate the workflow.\nIdentify factors that require possible deviation from the existing audit program, coordinate findings and recommended program changes, and incorporate approved changes into the audit program to improve the results' quality.\nIdentify, develop, and document possible causes or contributing factors relating to problems, design tentative solutions, coordinate tentative solutions, obtain approval for investigation, analyses, and testing of solutions, analyses results, and recommend the best approach for improvement to identify causes and factors more efficiently.\nAssist in preparing audit memos for initial findings and recommendations.\nAssemble and maintain work papers and supporting documents in a prescribed manner.\nConduct procedures to ensure the findings are resolved or in the follow-up engagement\nAssist in projects and other related duties, in performing the assigned audit procedures, including identifying issues, reviewing evidence, and documenting auditee’s processes and procedures, and in conducting the follow-up audits to meet certain standards of performance.\nReview audit documents, prepare work papers, assist in preparing surveys and compose summary memos as per directions from the management.\nDevelop and maintain productive relationships with the auditee and staff through individual contacts and Company meetings to maintain strong relationships with the auditee and staff.Skills",
    "Skills": [
        "Good communication skills\nConsiderable skill in using a computer with word processing, spreadsheet, and other business software.\nInternal Audit Management\nGovernance, Risk & Control\nAble to manage multiple engagements and deadlines"
    ],
    "Preferred": {
        "Years of Experience": "Max: 4",
        "Residence Location": "Saudi Arabia",
        "Age": "Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}