{
    "Job ID": "4653181",
    "Description": "Job SummaryUnder the direction of management, the incumbent coordinates and performs security assessment functions, control testing reporting, and activities in accordance of Internal Controls compliance, regulatory and departmental policy and procedures. The cyber Security GRC Specialist updates and maintains control matrices and spreadsheets and provides recommendations for management’s consideration. This position ensures compliance with Tamara’s internal controls, regulatory and information security policies and procedures. The incumbent works with internal audit, external audit firms, and regulatory agencies to provide supportive documentation as applicable. The Cyber Security GRC Specialist takes a lead role in ensuring the security of all protected information collected, used, maintained.Typical Duties and Responsibilities:Implements security controls, risk assessment framework, and program that align to regulatory requirements, ensuring documented and sustainable compliance that aligns and advances College business objectives.\nEvaluates risks and develops security standards, procedures, and controls to manage risks. Improves Tamara’s security positioning through process improvement, policy, automation, and the continuous evolution of capabilities.\nImplements processes, such as GRC (governance, risk and compliance), to automate and continuously monitor information security controls, exceptions, risks, testing. Develops reporting metrics, dashboards, and evidence artifacts.\nDefines and documents business process responsibilities and ownership of the controls in the GRC tool. Schedules regular assessments and testing of effectiveness and efficiency of controls and creates GRC reports.\nUpdates security controls and provides support to all stakeholders on security controls covering internal assessments, regulations (SAMA, NCA, and GCC), protecting Personally Identifying Information (PII) data, and Payment Card Industry Data Security Standards (PCI DSS).\nPerforms and investigates internal and external information security risk and exceptions assessments. Assess incidents, vulnerability management, scans, patching status, secure baselines, penetration test result, phishing, and social engineering tests and attacks.\nHelp in documenting and reporting control failures and gaps to stakeholders. Provides remediation guidance and prepares management reports to track remediation activities.\nAssists other staff in the management and oversight of security program functions.\nTrains, guides, and acts as a resource on security assessment functions to other departments within the College.\nRemains current on best practices and technological advancements and acts as the College’s technical resource for security assessment and regulatory compliance.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Minimum Qualifications:",
        "Bachelor’s degree or Diploma in information technology or computer science is required..\n3-5 years of applied work experience in IT infrastructure/cybersecurity programs, audits, assessments, risk, remediation, or cyber security compliance management.",
        "Qualifications:",
        "Security +, CISA, CRISC, CISM ,ISO27001",
        "Knowledge of:",
        "Applicable information security management, governance, and compliance principles, practices, laws, rules and regulations (SAMA, NCA, ISO 27001, and PCI DSS);\nInformation technology systems and processes, network infrastructure, data architecture, data processes, and protocols;\nCyber and cloud security standard frameworks, architecture, design, operations, controls, technology, solutions, and service orchestration;\nInformation systems auditing, monitoring, controlling, and assessment process;\nIncident response management;\nRisk assessment and management methodology.",
        "Skills in:",
        "Developing and implementing enterprise governance, risk, and compliance strategy and solutions;\nResearching and locating information related to internal and external organizations using online and other sources;\nSecurity project management and planning;\nMaintaining confidentiality;\nTroubleshooting and operating a computer and various software packages;\nDefining problems, collecting and analyzing data, establishing facts and drawing valid conclusions;\nUsing judgment and ingenuity in maintaining objectives and technical standards;\nWorking with diverse academic, cultural and ethnic backgrounds of community college students and staff. Ability to:\nEffectively communicate technical issues to diverse audiences, both in writing and verbally;\nApply a risk-based approach to planning, executing, and reporting on audit engagements and auditing process;\nEvaluate and update and/or revise program materials;\nLearn quickly and apply knowledge to new situations;\nHandle sensitive and confidential matters, situations, and data;\nUnderstand and follow broad and complex instructions;\nInteract positively with staff, the Board, the public, and regulatory agencies in order to enhance effectiveness and to promote quality service;\nWork independently and prioritize multiple tasks and adapt to needed changes."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}