{
    "Job ID": "4653184",
    "Description": "Job DescriptionReceipt of user requests/incidents escalated by the ServiceDesk / end user.\nProvide L2 support for tickets escalated by Service Desk.\nConfigure, troubleshoot, and resolve issues related to hardware and software for AV.\nProvide support for install/upgrade/de-install/repair activities on AV solutions.\nAssembling, and disassembling AV equipment.\nEnsuring the production and updating of AV documentation such as user guides.\nCabling and wiring to implement technologies for AV setup.\nManage and administer all the AV equipment and software used including, but not limited to speakers, microphones, TVs, Smart TVs, Digital Signage, Digital Signal Processors, Cameras, CCTV, CCTV system Management software, AV Management server/ management tools, CCTV hardware and servers, Projectors, Interactive Projectors, Smartboards, Amplifiers, lighting controllers, curtain controllers, home automation control systems, perform firmware upgrade etc.\nHandle the installation and configuration of AV equipment using different platforms Smartboards, Interactive projectors, etc.\nPerform routine hardware and software maintenance on AV equipment including any upgrades and patches that may be required, both hardware and software.\nConduct preventive maintenance of the AV systems and equipment as per an agreed schedule.\nMeet SLA for client ticket requests, assess and prioritize incidents while investigating & resolving critical incidents, and problems.\nEscalate to appropriate next-level resources for incident resolution.\nFacilitates progressive internal and external updates on CCTV and AV hardwareSkills",
    "Skills": [
        "Qualifications:",
        "Bachelor or Diploma in Electronics/Electrical/IT\n2-5 years Experience on AV & CCTV\nFluent in Arabic and English\nDriving License\nWork independently & in collaboration.\nAbility to manage multiple activities and tasks simultaneously.\nExcellent customer service, communications, and soft skills \nAble to setup microphones, AV and CCTV hardware\nAbility to do the physical installation of AV and CCTV hardware\nGood Knowledge of CCTV, Digital and Analogue mixing desk\nAbility to mix bands and Live Music on stage\nAbility to set up stage Monitors, large screens.\nAbility to quickly fault find issues if and when they rise\nAbility to do wiring for CCTV, speakers, amplifiers, DSP, Loud Speakers management system\nAbility to mitigate incidents and problems quickly. \nAbility to install AV hardware and software to meet the needs of the organization.\nAbility to install and configure communication and collaboration platforms."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}