{
    "Job ID": "4656006",
    "Description": "Main Responsibilities:Audit Planning:▪ Assist Audit Supervisor in scheduling meetings and recording meeting minutes for risk assessment interviews with heads of departments and preparing Strategic and Annual Internal Audit Plan following risk assessment results/ exercise.Internal Controls and Audit Executions:▪ Conduct Internal Audit and other audit related engagement such as special assignments as per the prescribed auditing standards and Internal Audit plan.▪ Develop risk-based internal audit programs and other audit related deliverables such as Risk and Control Matrices and Test Plans.▪ Participate in preparing all the Internal Audit deliverables.▪ Conduct audit testing of specified area and identify reportable issues.▪ Prepares a variety of reports, documents and other written materials (e.g. audit analytical reports, monthly report to Head of Internal Audit, detailed audit findings, reports, memos, letters, etc.) for the purpose of documenting activities, providing written reference and/or conveying information.▪ Record meeting minutes for opening / closing meetings for audit assignments.▪ Prepare audit files for closed audit processes and properly archive the same.▪ Update the audit management tool. ▪ Perform work as assigned by the Audit Supervisor.Follow - up:▪ Provide assistance to Audit Supervisor in conducting follow up with process owners to ascertain implementation status.▪ Update follow up tracker based on follow-up audits.▪ Assist Audit Supervisor in preparing follow up reports for the top management/Audit Committee.Communication / Reporting:▪ Prepare draft report for review of Audit Supervisor and Head of Internal Audit▪ Prepare status update reports on quarterly basis for the work performed by Internal Audit department ▪ Assist Audit Supervisor in preparation of presentation/ documentation.Skills",
    "Skills": [
        "Selection Criteria, Academic qualifications, Experience and skills required:",
        "▪ Bachelor’s degree in accounting, finance or business administration.",
        "▪ A professional qualification in Accountancy and/or Internal Audit such as CPA, CIA, ACCA, CA.",
        "▪ 5-7 years of experience in a similar field. Experience in auditing of electronic systems such as investment, accounting, and human resources systems",
        "▪ Conversant with use of Computerized Audit Software.",
        "▪ English and Arabic (verbal and written), French is preferred.",
        "▪ Time management skills",
        "▪ Communication skills",
        "▪ Analytical skills",
        "▪ Computer literacy",
        "▪ Good interpretation skills",
        "▪ Energetic and strong work ethic"
    ],
    "Preferred": {
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}