{
    "Job ID": "4658814",
    "Description": "صندوق النقد العربي (الصندوق) منظمة مالية إقليمية عربية مقرها في أبوظبي )الإمارات العربية المتحدة( وهدفها الرئيسي هو وضع الأسس النقدية للتكامل الاقتصادي العربي وتسريع عملية التنمية الاقتصادية في الدول العربية. يسعى الصندوق من خلال هذا الإعلان إلى توظيف \"مدقق داخلي أول\" في مكتب التدقيق الداخلي بالصندوق .\n\nالمهام الرئيسة للوظيفة:\n\nخطة التدقيق السنوية:\n▪ مساعدة مشرف التدقيق في جدولة وإعداد محاضر الاجتماعات المتعلقة بتقييم المخاطر مع رؤساء الوحدات التنظيمية،\nوالمساعدة في إعداد خطة التدقيق السنوية بناءً على نتائج تقييم المخاطر.\n\nالضوابط الداخلية وعمليات التدقيق:\n▪ القيام بعمليات التدقيق الداخلي والمهام الأخرى ذات الصلة وفق المعايير التدقيق الداخلي الدولية وخطة التدقيق السنوية .\n▪ تطوير برامج التدقيق الداخلي والتقارير المتعلقة بناء على المخاطر والضوابط والاختبارات .\n▪ المشاركة في إعداد تقارير التدقيق الداخلي .\n▪ إجراء اختيارات التدقيق الخاصة وإعداد التقارير المتعلقة بذلك .\n▪ إعداد اوراق العمل وتقارير التدقيق )مثل التقارير التحليلية للمراجعة، والتقرير الشهري لمدير التدقيق، ونتائج التدقيق التفصيلية، والتقارير، والمذكرات، والرسائل، وما إلى ذلك(، بغرض توثيق وتحديث سجلات أنشطة التدقيق المختلفة .\n▪ إعداد محاضر اجتماعات التدقيق المتعلقة بإجتماعات بداية وانتهاء مشاريع التدقيق .\n▪ إعداد ومتابعة إغلاق ملفات التدقيق للمهام التي تم الإنتهاء منها بغرض الأرشفة .\n▪ القيام بأي مهام تطلب من قبل مشرف التدقيق.\n\nمتابعة عمليات التدقيق:\n▪ مساعدة مشرف التدقيق في متابعة القائمين على إجراءات العمل في الوحدات التنظيمية للتأكد من تنفيذ الإجراءات على الشكل المطلوب .\n▪ تحديث سجلات التدقيق الخاصة بمتابعة عمليات التدقيق.\n▪ مساعدة \"مشرف التدقيق\" في إعداد تقارير المتابعة مع الإدارة العليا ولجنة المراجعة .\n\nالتواصل والتقارير:\n▪ إعداد مسودات التقارير لمشرف التدقيق ومدير مكتب التدقيق الداخلي .\n▪ إعداد تقارير المتابعة للأعمال المنجزة من قبل التدقيق الداخلي .\n▪ مساعدة مشرف التدقيق في إعداد العروض التقديمية وأوراق العمل.Skills",
    "Skills": [
        "المواصفات والمؤهلات والخبرة والمهارات المطلوبة:\n▪ درجة البكالوريوس في المحاسبة أو المالية أو إدارة الأعمال .\n▪ مؤهل مهني في المحاسبة أو التدقيق الداخلي مثل CPA و CIA و ACCA و CA .\n▪ 5 - 7 سنوات خبرة في مجال مماثل . وخبرة في مجال أعمال التدقيق على الأنظمة الالكترونية الخاصة بأنظمة الاستثمار والمحاسبة والموارد البشرية .\n▪ إلمام في استخدام برامج التدقيق الالكترونية وتدقيق أنظمة ومشاريع الحاسب الألي.\n▪ إجادة تامة للغتين الإنجليزية والعربية، وتعتبر إجادة اللغة الفرنسية ميزة إضافية .\n▪ مهارات إدارة الوقت\n▪ مهارات الاتصال\n▪ مهارات تحليلية\n▪ مهارات الترجمة\n▪ نشيط وقادر على تحمل المسؤولية مع قدرة على التجاوب مع احتياجات وضغوط العمل والتكيف مع التطور المستمر في أساليب العمل وتقنياته والتقدم لمواكبة التطورات المهنية .\n\nيقدم الصندوق شروط خدمة تنافسية وفقا لسياسة التوظيف المعمول بها، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن،وبدل أثاث، وبدل تذاكر سفر، والمساهمة في نفقات تعليم الأبناء، والتأمين على الحياة والتأمين الطبي .\n\nسيتم الاتصال فقط بالذين يتم ترشيحهم من المؤهلين لشغل الوظيفة."
    ],
    "Preferred": {
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}