{
    "Job ID": "4659713",
    "Description": "Job Duties/ResponsibilitiesCheck and reconcile all bank accounts daily.\nHandle office petty cash and petty cash expenses Issue cheques / arrange telegraphic transfers to all suppliers / vendors.\nDaily accounting (input to company ERP of all transactions such as bank / cash payments & receipts, journal vouchers, debit notes, credit notes.\nCoordinate with external parties (Customers, Suppliers, Group Companies, Banks, Insurance Companies, etc.) to ensure smooth flow of information.\nPrepare regular / monthly accounts receivable reports, reconcile accounts with customers and follow up for collections of due and overdue amounts.\nPerform periodic stock takes to ensure accuracy of stocks in hand.\nAssist in all month end accounting closing including accounting, reconciling accounts, preparing outstanding expenses and prepaid expenses statements,\nAssist in year-end audit.\nAccountable in maintaining accurate records for all above services.\nResponsible for coordinating and liaising between the company and Government organisations / authorities and provide a key inter-face between the two.\nRespond effectively to the demands of the business and employees to assist them on all government related services.Skills",
    "Skills": [
        "Degree in Accounts/Finance/Business Administration.\nMinimum 3 years of accounting experience in Kuwait\nGood communication (oral and written) in English.\nGood influencing skills.\nVery good command of MS Office.\nBasic knowledge in Logistics.\nValid driving license."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}