{
    "Job ID": "4660925",
    "Description": "Developing new sales opportunities.\nResearching prospects and generating leads.\nContacting potential and existing customers on the phone, per email, and in person.\nDeveloping and sustaining solid relationships with the clients.\nSetting sales goals and developing sales strategies.\nCommunicating with clients to understand their needs and explain product value.\nCollecting and analyzing data to learn more about consumer behavior.\nActing as the main point of contact between key clients and internal teams.\nCompiling a weekly report on accounts progress, goals, and forecasts.\nDeveloping a thorough understanding of key clients' needs and requirements and preparing customized solutions.\nNegotiating contracts with key clients and meeting established deadlines for the fulfillment of each client's projects.Skills",
    "Skills": [
        "To succeed in this position, candidates should be an inspired self-starter, able to drive sales growth, with exceptional communication and interpersonal skills, plus the ability to manage multiple tasks at once. Ultimately, a quality Advertising Account Manager should demonstrate great customer service skills, strong business acumen, problem-solving skills and close sales.\nBachelor Degree in Business Administration, Marketing or any related field.\n2+ years of sales experience.\nExcellent customer service and sales skills.\nStrong verbal and written communication.\nExcellent phone and presentation skills.\nExcellent active listening and learning skills.\nGood negotiation and problem-solving skills.\nThe ability to build affinity with key clients and to handle multiple client accounts.\nAbility to build rapport and collaborate with others within the company and externally.\nArabic Speaking is a big plus."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Advertising; Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "2"
    }
}