{
    "Job ID": "4660556",
    "Description": "Responsibilities:Develop and implement sales strategies to increase market share and revenue.\nBuild and maintain strong relationships with customers, suppliers, and industry stakeholders.\nConduct regular market research to identify new business opportunities\nPrepare and deliver presentations to prospective customers\nNegotiate contracts and close sales deals\nCollaborate with internal teams to ensure customer satisfaction and resolve any issues\nAchieve sales targets and report regularly on sales performance and trends.Skills",
    "Skills": [
        "We are seeking a highly motivated and results-driven Sales Executive to join our growing air-conditioning company. The ideal candidate will have a proven track record in sales, excellent communication skills, and a passion for delivering exceptional customer service.",
        "In-depth knowledge to convert leads into a final customer, thereby contributing to the company revenue.\nProven track record of maintaining professional ethics through the portrayal of exemplary soft skills.\nKnowledge of customer service principles and processes.\nAbility to prioritize targets as per the requirements set forth by the company.\nPortraying superb soft skills during customer interaction and seminars as per requirement.\nAbility to find the right balance between client requirements and company terms, thereby improving profit margins and maintaining fruitful customer relationships.",
        "Competencies:",
        "Proven sales experience, preferably in the air-conditioning industry\nExcellent communication, negotiation, and interpersonal skills\nAbility to build strong relationships and effectively manage a customer-focused approach\nStrong analytical and problem-solving skills\nAbility to work independently and as part of a team\nResults-oriented, with a track record of meeting and exceeding sales targets\nProficient in Microsoft Office, including Excel and PowerPoint",
        "If you are a motivated and driven individual with a passion for sales, we would love to hear from you. Please apply with your resume and a cover letter that highlights your relevant experience and competencies."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Jordan; Morocco; Philippines",
        "Age": "Min: 25"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Airconditioning Plant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}