{
    "Job ID": "4661345",
    "Description": "هدف الوظيفة | Job Purpose\n\nاستلام المواد الواردة للمستودع وفحصها ومطابقة مواصفاتها مع الطلبات المعتمدة والفواتير المرفقة والمحافظة عليها وجرد المخزون وضمان تطبيق اساسيات السلامة والصحة لضمان توفر المخزون عند الحاجة والمحافظة عليه.\n\nالمهام والمسؤوليات الرئيسية |Responsibilities and Accountabilities\nتنفيذ سياسات وإجراءات المستودعات ومراقبة المخزون المعتمدة في الشركة فيما يتعلق باستلام وصرف وتخزين المواد.\nاستلام المواد الواردة للمستودع وفحصها ومطابقة مواصفاتها مع الطلبات المعتمدة والفواتير المرفقة.\nإدخال وإخراج جميع المواد اللازمة وفق التعليمات لضمان المحافظة عليها.\nتسجيل جميع المواد الداخلة والخارجة في المستودع.\nالمحافظة على المخزون والمواد الموجودة في المستودع بشكل يضمن عدم تلفها.\nضمان تطبيق اساسيات السلامة والصحة في المستودع.\nالمساعدة في عملية جرد المخزون بشكل دوري وتحديث السجلات.\nإعداد بطاقات تصنيف المواد وتسجيل المعلومات اللازمة عليها وتحديثها باستمرار.\nاستلام وتخزين وترتيب المواد الواردة في المستودع وفق قواعد التخزين المعتمدة وبالشكل الذي يسهل الوصول إليها.\nصرف وتوزيع المواد او المخزون في المستودع حسب الطلب وبما يخدم مصلحة الشركة.\nتسجيل وتحديث حالة المواد/الأجهزة المعارة والعهد من المستودع وإعادة استلامها وفق التعليمات والسياسات المعتمدة.\nتسجيل المواد التالفة والأدوات والأجهزة التي تحتاج إلى صيانة او إتلاف واشعار الرئيس المباشر بذلك.\nاعداد وتحديث قواعد بيانات المستودع كالمواد المستلمة والمنصرفة والمخزون في المستودع.Skills",
    "Skills": [
        "الجدارات | Competencies\nتحقيق النتائج وتلبية التوقعات\nالإلتزام بالمبادئ والقيم\nالإمتثال\nالعلاقات والتواصل\nحس المسؤولية\nالتعاون (العمل ضمن فريق العمل)\nالتعامل مع ضغط العمل\n\nمواصفات شاغل الوظيفة | Employee Specifications for the job\n\nالمؤهلات العلمية والشهادات الإحترافية Qualifications and Professional Certificates\n  دبلوم في تخصص ذو علاقة.\n\nالخبرات العملية Experience\n  لا يتطلب خبرة.\n\nالمهارات واللغات Skills and Languages\n مهارات تنظيمية\nاجادة استخدام الحاسب الآلي وتطبيقاته\nمهارات تواصل فعاله\nمعرفة باللغة الانجليزية"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Altaif, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}