{
    "Job ID": "4663536",
    "Description": "Job Summary:Repairing and checking MECL products for repair with optimal quality, time and cost to satisfy customer requirement, providing product performance feedback to MECL for continuous improvement.Key Accountabilities (Responsibilities):Repairing and checking MECL products brought by customers or at customer's site for repair with optimal quality, time, and cost to satisfy customer requirement - As Needed.\nRepairing of white goods products (Washer/Refrigerator/Dishwasher/Cooker/Dryer).\nFeild service repair in customer house.\nRepairing of white goods products for walk-in customers.\nKnowledge in VRF system installation and repair.\nDriving VAN vehicle for any flied SVC request.\nProviding product performance feedback to MECL for continuous improvement.\nAssisting staff at the reception section in handling customer inquiries and complaints and provide any assistance needed.\nReporting to the direct supervisor about any inquiries needed to provide a better service for customers such as: technical assistance, spare parts…etc.\nMaintaining cleanliness and tidiness of service workshop and ensuring packing and arranging tools and equipment’s after use.\nCoordinating with the Spare Parts Section to follow up on providing the area with the needed spare parts – As Needed.\nProviding relevant information and basic product usage instruction to the customers during their visit to customer's site.\nHandling cash for Chargeable services until it is turned over to authorized person in the Service Center.\nMaking pick-up and/or delivery of the customer set when necessary.Skills",
    "Skills": [
        "Education Qualifications:",
        "Technical Vocational College or similar.\nMajor: Air Conditioning and Home Appliances product.",
        "Experience:",
        "3 years in service operations or related field.",
        "Locations:",
        "Riyadh\nKhobar\nJeddah",
        "Competences and Skills:",
        "Commitment & Responsibility\nGood Command of both Arabic and English\nTechnical knowledge\nPersonal Development\nCommunication and Interpersonal Skills\nCoordination Skills\nProblem Solving\nTime Management\nLearning ability\nCost & Quality awareness\nAnalytical thinking\nService quality and user satisfaction oriented\nCustomer Satisfaction\nTimely accomplishment of tasks"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Technical Maintenance & Repair",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "3"
    }
}