{
    "Job ID": "4665620",
    "Description": "eMagine Solutions is a disruptive recruitment consultancy, we partner with some of the word's leading brands on mid to senior level placements.Due to amazing success in the past 12 months we are scaling up our team in Jumeriah Lake Towers, Dubai.Are you an ambitious sales-driven individual looking for an opportunity to develop a long-term career in a business that is going places?You'll also benefit from industry-renowned training and the tools and technological support to make that hard-hitting impact. You won't be alone either - with the support of experienced and talented colleagues supporting you to create the career that's right for you.What can I expect day to day?As a Recruiter, you will work alongside a Key Account Manager (Business Development) working as a team to develop and grow your market. The KAM has over 15 years commercial experience and she is known for a being a leader within the UAE and Saudi recruitment market.Being candidate focused you will have the freedom to do things differently, supported by colleagues with a wealth of experience empowering you to learn and grow. Every day will be exciting and you will gain experience across a varied range of skills to include:• Sales writing• Screening, interviewing and shortlisting candidates• Matching the best candidates to the best jobs• Building relationships with existing clients• Gathering compliance and rights to workSkills",
    "Skills": [
        "Recruitment and on-boarding of professionals, according to our recruitment policy",
        "Data analysis of reports to identify where priority needs to be placed to support a high-energy and fast moving department",
        "Written and verbal communication with candidates",
        "Diary management of a number of senior figures within an organisation",
        "Liaising with recently onboarded staff and associates to collect essential HR information",
        "Remember recruitment is a client facing position as such you are expected to carry yourself with the utmost professionalism at all times."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 9",
        "Age": "Min: 22 Max: 29"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Sales Outsourcing; Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}