{
    "Job ID": "4666616",
    "Description": "Job DescriptionResponsible for the overall Sales management, direction, and coordination of sales and rental activities which will result in the fulfillment of planned sales and profit objectives and ensure long-term optimum growth consistent with market trends and conditions specified in the Dubai MarketDevelop and execute strategies to drive business in new and existing markets\nMentor employees to help them achieve individual & team objectives\nTrain guide and monitor and recruit result oriented sales consultants.\nEnsure that you fully understand the business strategy and positioning of the company and that you are able to effectively articulate its positioning in the marketplace.\nMaintain a personal up-to-date knowledge of the Dubai Property Market and service and  awareness of general industry trends.\nApproach personal sales activities from a strategic perspective, understanding the relative importance and priority of the current market trend and apply efforts accordingly.\nFocus on assertively establishing new client contacts.\nTake responsibility for your own professional development, ensuring that you have the financial literacy, negotiation and face-to-face selling skills needed to successfully do your job.\nMaintain accurate management status reporting on business results, and associated action planning.\nLiaise effectively with all operational colleagues, providing support and information to ensure accurate delivery of our promise\nDrive opportunities to upsell and cross-sell all properties listed.\nDevelop and maintain a network of local agents and broker partners to drive the supply pipeline.·       Please note that this is not an exhaustive list of everything that needs to be doneSkills",
    "Skills": [
        "Qualifications",
        "At least 5  years sales experience importantly in real estate\nBachelor's Degree in any related field\nGood command of spoken and written English\nPositive attitude with excellent interpersonal skills and strong leadership\nExcellent computer and telephone etiquette skills.\nBachelor's degree in real estate, finance, business administration or related field is preferred\nExperience in sales ideally in Dubai real estate\nSound knowledge of real estate laws.\nStrong negotiation skills.\nGoal oriented with a focus on personal development\nGreat Presentation and Interpersonal skills\nZeal and Hunger to exhale\nRERA certified preferred\nDriver's license required\nThe ideal candidate is a motivated, well-organized individual who has a deep understanding of prospecting and developing strong relationships with clients.",
        "About the company",
        "We are seeking Dynamic, Passionate and Result- driven Real Estate Sales Specialist to join lead our Sales team, where you get the opportunity to work on Off plan projects, Secondary Sales and Leasing too!",
        "Please note that only shortlisted candidates will be contacted & to apply only if you have relevant experience in UAE."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}