{
    "Job ID": "4668573",
    "Description": "who you areYou are a licensed doctor to provide specialized and holistic care to patients with a broad spectrum of heart diseases, whether it is an emergency or a long-standing chronic condition.Skills & Competencies:Ability to work harmoniously with fellow physicians, nurses, pharmacists, and other hospital personnel;\nExcellent communication skills;\nClose attention to details;\n Compassionate character and gentle personality.Education & Qualifications:MBBS AND Master or equivalent;\nMinimum of 5 years’ experience (including 1 year after Master);\nWilling to relocate to Kuwait.descriptionThe hospital is looking for Registrar Cardiologists responsible for the day to day medical care of patients in the Coronary Care Unit (CCU). You will supervise the work of a House Officer, with whom they will organize the investigation and management of inpatients under the care of the department, requesting assistance from the Consultant on call when required. You are expected to ensure their patients are safely and efficiently handed over and to liaise with the other health professionals in the unit to ensure the required level of coordinated care to the patients is achieved and maintained. Undertake a daily morning and evening round of all patients in CCU and an additional daily round of the CCU with the supervising Cardiologist;\nAttend Consultant ward rounds and will have a current knowledge of the progress of inpatients under their care;\nMaintain a satisfactory standard of documentation in the files of patients in CCU;\nMaintain a high standard of communication with patients, patients’ families and staff. The Registrar will confer at all times with other clinical team members regarding discharge planning and progress of patients;\nAttend rostered outpatient clinics, one session per week, and endeavor to see outpatients at their scheduled appointment times. Outpatients for pre-assessment in the department or who are to be discharged will be discussed with the Consultant Cardiologist;\nAnswer calls from GPs and will make appropriate decisions regarding the disposition of these patients;\nUndertake investigation or treatment of patients in the CCU where appropriate and request assistance from the Cardiologist on call when required;\nUndertake GP ECG reporting and liaise with the GP regarding important abnormalities by telephone if necessary and discuss interpretations of ECGs with the Cardiologist if required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}