{
    "Job ID": "4670607",
    "Description": "Estimator is responsible for taking a tender from start through to finalization. Acknowledges the tender, books in the tender documents and checks the documents for missing scope. Marks up the enquiries to be sent out for quotation and ensures this is done quickly. Selects suitable subcontractors for the works taking into consideration volume of work and location. Inputs the BOQ and sets up the job ready to price. Contacts the key supply chain contractors to discuss the project and any technical issues. Carries out bulk measures checks and picks up any scope missing in the BOQ and ensures this is incorporated into the price. Visits site and carries out a site report summary of access/egress. Locations for the site establishment and understands logistically how the project will be run. Distributes any addendum information to the relevant sub-contractors. Raises tender queries to the consultants where necessary. Compiles the prelims book with input from the production team on suitable staffing levels. Analyses the quotations and prepares a summary report of all the quotations received. Evaluates the H&S obligations and ensures we price the job accordingly. Settles the tender with the Operations Manager. Produces a list of tender clarifications for submission. Finalizes the price and submit the tender on time.Skills",
    "Skills": [
        "Skills",
        "Bachelor Degree in Civil or Architecture Advance Diploma/ Diploma/Certificate in Quantity Surveying/ Building or Equivalent Technical Requirements\nMinimum 5 to 8 years in Estimating Familiarity with civil and Interior fit-out project or architectural finishes.\nGood understanding of construction techniques and methodology/sequence of works Managerial Experience\nAbility to delegate work to the Measurement team\nAbility to manage others assigned to the bid (Planner / Projects Manager) for input Key Skills Good command of English- written and spoken.\nAble to work independently with minimum supervision\nEfficient time management skills\nComputer literate (Auto cad, MS projects & MS office) and Good communication skills, Methodical manner of working logically through the tender process."
    ],
    "Preferred": {
        "Degree": "Certification / diploma",
        "Age": "Min: 22 Max: 45"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Fit-Out & Joinery; Architecture; Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}