{
    "Job ID": "4670126",
    "Description": "The Facilities Management Department Manager (FM) is responsible for all aspects of facilities management operations across The company property portfolio of buildings located in Kuwait, including 3rd party portfolios.The role of the FM is to support a team of Heads of Department in their delivery of Maintenance, Cleaning, Security, Hotel Services and Tenant Rent Collection Services along with supporting site based Property Managers. The FM is responsible for ensuring the Team manage their operations proactively and to a high standard through the delivery of in-house and outsourced services:  MEP/Landscaping/Civil & Fabric Works/Security/Cleaning/Hotel Services/Tenant Services /Waste Management /Energy Management/Health & Safety & Environmental Management.The FM is to ensure the cost-effectiveness of the facilities management services and to ensure appropriate systems and processes are in place to support the company’s strategic objective of achieving an image for excellence.Responsibilities:To provide an FM framework to manage existing and future buildings in the company’s portfolio of properties\nLead and manage the team - providing guidance and direction\nStandardise and provide monthly management reports on FM operations - costs, performance to improve visibility across the company portfolio of buildings and ensure upper management is briefed on property operations.\nEstablish FM planned and reactive costs across the portfolio and ensure the cost-effectiveness of the facilities management operations\nChampion the CMMS system and oversee its population and its implementation.\nEstablish and ensure department policies and procedures are met on ongoing basis including Helpdesk procedures\nEnsure site-specific Site Manuals are developed for use by tenants and their fit out contractors\nCoordinate tenants fit out plans approvals & progress.\nEstablish FM KPI’s to measure the contractor performance.\nReview all existing contractor contracts and their effectiveness, monitoring contractor performance by ensuring regular audits are carried out to ensure KPI’s are met.\nIdentify methods for reducing costs and increasing profits by expanding our services.\nWork closely with CEO providing regular updates of site activities.\nWork closely with site based and technical support team to resolve site based issues\nSet up all necessary staff training\nEnsure H & S and environmental compliance\nLiaise with projects department to ensure a smooth handover\nEnsure customer complaints and suggestions are recorded and acted upon.\nSupport the team in identifying & prioritizing the needs for manpower and equipment for allocated sites.\nEnsure periodic checks of all building assets and ensure preventive and corrective maintenance regime is effective.\nEnsure Pre-occupational checks are conducted.\nSupport and promote the companies vision and values making this transparent though the team supporting them during change.Skills",
    "Skills": [
        "Candidate should have experience in Real Estate industry.\nCandidate should have a bachelor's degree in Engineering\nCandidate should be able to communicate in both Arabic and English languages.\nAbility for Supporting with multi tasks"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}