{
    "Job ID": "4671159",
    "Description": "Position : Head of EnergySection : General InsuranceCompany : Al Koot Insurance & Reinsurance CompanyLocation : Doha, QatarExperience : 10 – 15 Years relevant experienceNo of resources : 1Purpose: We are looking for an experienced Energy Underwriter to Head the Energy line of business. Head of Energy will report to Underwriting Manager – General Insurance. Energy forms the integral part of General Insurance portfolio. The Head of Energy will have the responsibility for a broad portfolio comprising of upstream, midstream and downstream oil & gas, petrochemicals and power risks, managing and expanding the portfolio and team. Our client base includes national oil companies, international oil companies, operators, drilling contractors and other service providers to the Energy and Power sector. Coverage offered is Operational Package, Property Damage, Business Interruption, OEE, TPL, Construction (Offshore & Onshore) etc.Head of Energy Will be expected to:Lead the Energy Underwriting unit\nEstablish Energy division’s Underwriting policies and procedures based on the company’s business plan and objectives.\nActively Underwrite energy portfolio and Manage & oversee the Energy insurance underwriting philosophy\nPromote, maintain and develop Energy book of business in a profitable manner\nExpand local and international energy book of business\nProvide strategic direction, underwriting control and action for Energy portfolio\nProvide financial plan and forecast, management information, coordination with claims and reinsurance functions and other departments within Al Koot, meet performance standards etc.Responsibilities:Actively underwrite Review new and renewal submissions, endorsements, policy wordings, risk engineering reports, loss history, financial reports as well as conduct appropriate research to determine extent of participation on each account\nCalculate appropriate risk premium\nDrive day to day underwriting function, manage emerging risks through underwriting measures, driving and contributing to the development & implementation of appropriate policy wordings, clauses and exclusions.\nDrive financial planning and forecasting process\nMonitor risk exposures with limits outlined in policies and procedures\nDevelop and adapt the underwriting philosophy and portfolio strategy to achieve profitable underwriting results\nProvide timely and highest standards of advice, assistance, response, service to enquiries from clients/brokers\nDrive key broker and client relations, Promote account retention.\nInitiate and manage opportunities for cross selling.Skills",
    "Skills": [
        "Desired Qualifications",
        "Bachelor’s Degree in any discipline, preferably in engineering\nA Diploma or Master’s degree in Risk & Insurance Management is a plus.\nAdvanced Diploma in Insurance (ACII) from Chartered Insurance Institute (CII) is a must\n10 to 15 year’s experience in insurance business with at least 3 years in supervisory level in an energy, oil/gas and petrochemical environment\nEnergy industry knowledge (working in Oil & Gas – Power Gen – Utilities – Renewables – Mining Industry)\nStrong understanding of basic sales principles, negotiation skills and demonstrate a competitive drive\nFluency in English & Arabic (read, write and communicate) as must",
        "Skills needed:",
        "Proven capability of underwriting in energy classes of business\nTechnical knowledge of both Energy insurance products and energy insurance industry\nBe able to work independently and in a team\nAdhere to Underwriting guidelines and company policies and procedures\nAdvanced analytical skills, negotiating and marketing capabilities\nBudget and Financial planning and reporting\nTeam management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 33"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}