{
    "Job ID": "4671199",
    "Description": "Job Purposeالهدف من الوظيفة                                                                                        Charged with the day-to-day implementation of the company's policies, procedures, and programs that will assure a well-managed, well maintained buildings, placing maximum emphasis on positive response to the concerns and needs of the tenants, maximizing revenues and minimize operating expenses through setting cost effective procedures and plansDisclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.مكلف بالتنفيذ اليومي لسياسات وإجراءات وبرامج الشركة التي من شأنها ضمان إدارة جيدة للعقارات وصيانتها بشكل جيد ، مع التركيز بشكل كبير على الاستجابة الإيجابية لمخاوف واحتياجات المستأجرين ، وزيادة الإيرادات وتقليل مصاريف التشغيل من خلال وضع إجراءات وخطط فعالة من حيث التكلفة.إخلاء المسؤولية: يجب على صاحب العمل الامتثال واتباع السياسات والإجراءات المعمول بها في الشركة التجارية العقارية.Key Accountabilities & Performance Indicators المسؤوليات الرئيسية ومؤشرات الأداء AccountabilitiesRental ResponsibilitiesEffectively show, rent, and move in prospective residents.Establish and implement rental goals.Adhere to established policies and procedures for screening applicants for residency.Initiate legal action against tenants who are not in compliance with lease contract termsPrepare annual operating budgets for properties assigned Monitor deviations in budgets and report it to the ManagerSuggest and apply corrective course of action to the budgets Study and analyze current market trends and accordingly recommend alternative objectives مسؤوليات التأجير:فعالية التأجير و التواصل مع العملاء بشكل فعال لتأجير الوحدات الشاغرة. وضع أهداف تأجيرية وتنفيذها.الالتزام بالسياسات والإجراءات المعمول بها و التدقيق على العملاء الذين يرغبون بالتأجير لدى عقارات الشركة. إتخاذ إجراءات القانونية ضد المستأجرين الذين لا يمتثلون لشروط عقد الإيجار.إعداد ميزانيات التشغيل السنوية للعقارات المعنية. مراقبة الانحرافات و الإختلافات في الميزانيات وإبلاغ المدير بهااقتراح وتطبيق إجراءات تصحيحية و تعديلية على الميزانياتدراسة وتحليل اتجاهات السوق الحالية وبالتالي تقديم التوصيات بأهداف بديلةMarketingEffectively maintain product knowledge of property and competitive properties through consistent evaluation of market conditions and trends. Ensure assistant managers develop similar knowledge.Develop efforts to implement sales and marketing plans, which effectively maximizes rental income and results in high occupancy.Evaluate and recommend changes on rent/pricing strategies by conducting market surveysFrequently meet with the Marketing team to brainstorm and come up with ideas to assist marketing the property. التسويق:معرفة فعالة و شاملة بعقارات الشركة والعقارات المنافسة من خلال تقييم وضع و إتجاهات السوق.التأكد من قيام مساعد المدير بتطوير المعرفة الشاملة لعقارات الشركة و السوق العقاري.تطوير الجهود لتنفيذ خطط التأجير والتسويق ، مما يزيد بشكل فعال من دخل الإيجار ويؤدي إلى ارتفاع معدلات الإشغال.تقييم و تقديم التوصيات لتغيير إستراتيجيات أسعار الإيجار من خلال إيجراء مسح دراسي للسوق العقاريResident RetentionDirect and manage resident functions in such a manner as to win and maintain the respect and goodwill of all residents.Enforce resident retention and service request follow-up programs.Assist and ensure all customer complaints are handled promptly and appropriately.Implement and monitor effective rental renewal programs..توجيه وإدارة  المستأجرين  بطريقة لكسبهم و الحفاظ على احترامهم.فرض برامج متابعة طلبات المستأجرين.مساعدة المستأجرين والتأكد من حل جميع الشكاوى على الفور وبشكل مناسب.تنفيذ ومراقبة برامج تجديد الإيجارات الفعالة كما هو مطلوب.Maintenance & Quality ControlEnsure that all physical aspects of the property are at all times fully functional and maintained in an attractive condition.Monitor an effective preventative maintenance program.Ensure that an adequate number of units are market ready.Monitor service request turnaround and ensure the responsiveness of the maintenance staff.الصيانة و جودة التحكمالتأكد من أن جميع الجوانب المادية الملموسة للعقارات تعمل بكامل طاقتها في جميع الأوقات ويتم الحفاظ عليها في حالة جذابة.مراقبة برنامج الصيانة الوقائية الفعالة. التأكد من أن عددًا كافيًا من الوحدات جاهزة للتسويق.مراقبة الطلبات و التأكد من استجابة موظفي الصيانة.Customer Service OrientationMaintain a high level of customer service awareness in relation to both residents and prospects.Communicate effectively with owners, tenants, and on-site Associates. Ensure that any areas of concern are addressed promptly and thoroughly.خدمة العملاءالحفاظ على مستوى عالٍ من الوعي بخدمة العملاء فيما يتعلق بكل من المستأجرين والعلاء.التواصل بشكل فعال مع المالكين والمستأجرين والمنتسبين في الموقع.التأكد من معالجة أي مواضيع مثيرة للقلق بشكل سريع وشامل.AdministrativeEnsure that accurate submission of all corporate reporting rental paperwork is accomplished timely and includes approvals as required.Monitor the timely receipt and reconciliation of rent collections and ensure tenant statutes are followed.Analyze and evaluate monthly and/or quarterly financial statements. Write clear and concise owner’s reports to substantiate the analysis.الجانب الإداريالتأكد من التسليم الدقيق لجميع الأعمال الورقية  في الوقت المناسب متضمنه جميع الموافقات مطلوبة.مراقبة استلام وتسوية تحصيل الإيجارات في الوقت المناسب والتأكد من اتباع حالة المستأجرين. تحليل وتقييم البيانات المالية الشهرية و / أو الربع سنوية.كتابة تقارير ملخصة لملاك العقارات مع إثبات التحليل سير الأعمال في دقه Skills",
    "Skills": [
        "Performance Indicators",
        "Timeliness of actions taken",
        "تنفيذ الأعمال بالإطار الزمني المطلوب",
        "Feasibility of recommendations",
        "  القدرة على تقديم التوصيات",
        "of occupancy",
        "نسبة الإشغال",
        "Number of maintenance requests serviced successfully",
        "% of maintenance complaints",
        "عدد طلبات الصيانة التي تمت حلها بنجاح",
        "٪ من شكاوى الصيانة",
        "% of complaints by customers",
        "٪ نسبة شكاوي العملاء",
        "Accuracy of process",
        " سير الأعمال في دقه "
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}