{
    "Job ID": "4671171",
    "Description": "Position : Head of Non-EnergySection :  Underwriting – General InsuranceCompany : Al Koot Insurance & Reinsurance CompanyLocation : Doha, QatarNo of resources : 1ROLE PURPOSE:Responsible for assisting in the development and formulation of the underwriting strategy for Al Koot, based on which the underwriting policies, procedures, plans and manuals are established that aids in achieving group underwriting results. The Head of Non-Energy will carry Research & Development to design new insurance products, product mixes; and to plan the launching of new products across Al Koot synergizing capabilities; holding client seminars, conferences, conducting awareness programs and ensuring adherence to the policies and procedures, laws, in order to achieve Al Koot’s set goals and objectives. Make steady growth in the Non-Energy business while maintaining healthy loss ratios.KEY ACCOUNTABILITIES:Supervision of SubordinatesOrganise and manage the activities and work of team of underwriters and subordinates to ensure that all work within a specific area of underwriting activity is carried out in an efficient and procedurally compliant manner.UnderwritingManages & oversees the Non-Energy insurance underwriting program.\nPromote and develop Non-Energy book of business in a profitable manner\nProvide strategic direction, underwriting control and action for Non-Energy portfolio\nAct as the focal point for Underwriting Non-Energy within the underwriting department\nLead Product Underwriting best practices\nEnsure proper application of underwriting methodology and risk appetite of new and renewal business · Assemble and analyze data in order to estimate Al Koot’s insurance premium and provide quotation.\nReview Al Koot’s endorsement requests and loss control reports.\nAppraise and underwrite Al Koot’s insurance applications.\nCompute competitive quotations in line with the Company’s underwriting philosophy and send it to the Underwriting Manager for review and approval, to be discussed with clients.\nSet the premium rating and guidelines that may aid the insurance business units in achieving the desired operating results.\nPrepare technical accounts per class of insurance business.\nPut up budget and business plan for Non-Energy portfolio\nAssist in calculating solvency margins and assist with the calculation of adequate retention levelReinsurancePrepare Al Koot’s reinsurance requests in coordination with the Reinsurance Manager, and submit it to Underwriting Manager for review and management approval.\nPurchase reinsurance (only with approval) when needed, review reinsurance certificates and contracts, ensure it meets with our requirements and complete reinsurance documentation\nEnsure that business acceptances and computations are in line with Al Koot’s reinsurance treaty arrangements and prepare appropriate supporting reinsurance documents.\nSupport the Reinsurance Function in negotiations and determination of business requirements.Risk ExposureDetermine individual risk acceptability, pricing, coverage, terms and liaise with the Chief Officer General Insurance on Al Koot’s risks of a complex nature.\nIdentify and calculate the risk of loss from Al Koot’s policyholders.\nSpecify conditions to be imposed on different types of policies, to minimize risk.\nEnsures balanced portfolio and business profitability.\nReview accumulation on our participation on the same risk or other neighbouring risk\nManage accumulation table by updating on regular basisCoordinationClosely coordinate with the Reinsurance & Claims section to ensure smooth functioning.\nSupport the Reinsurance Function in negotiations and determination of business requirements. Brokers, Agents and ceding companies\nDirectly coordinate with international brokers and agents and insurance companies for Underwriting business\nDrive the broker’s performance and support Claims and Credit Control activity where necessary.DocumentationEnsure policy and accounting documentation are completed accurately as well as in a timely manner and sent to the clients/brokers/ceding companies/reinsurers\nProvide timely, accurate and complete progress reports to the Underwriting Manager on the financial and operational progress of the Business Line and the achieved results.Skills",
    "Skills": [
        "Knowledge & Experience:",
        "Bachelors Degree in any discipline\nA Diploma or Master’s degree in Risk & Insurance Management is a plus.\nACII from the Chartered Insurance Institute (CII) as minimum. Other insurance qualifications added advantage\n10 to 15 years’ experience in insurance business with at least 5 years in supervisory level in an Non-energy lines of business (Property, Engineering, Casualty and Financial product lines), oil/gas and petrochemical environment\nThorough technical knowledge of non-energy insurance subjects, products and capability to pricing\nStrong understanding of basic sales principles, negotiation skills and demonstrate a competitive drive\nExperience : 10 – 15 Years of relevant experience",
        "Skills & Competencies:",
        "Business Understanding Skills\nReport Writing & Drafting Skills\nAnalytical Skill and Detail Oriented skill\nDecision-making skill\nReinsurance\nUnderwriting ability\nPolicies, Procedures & Work Methods Knowledge\nAnalytical capabilities\nCosting & Budgeting Skills\nCommunication Skills\nNegotiation Skills\nPlanning & Organizing Skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 18",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 33"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}