{
    "Job ID": "4671167",
    "Description": "Position : Claims and Complaints ManagerSection : General InsuranceCompany : Al Koot Insurance & Reinsurance CompanyLocation : Doha, QatarNo of resources : 1ROLE PURPOSE:Responsible for Al Koot’s Claims Function, i.e. settling all claims accurately and in timely manner and recover reinsurance claim amounts from reinsurers, and ensuring adherence to the claim policies and procedures, in order to achieve Al Koot’s set goals and objectives. The Claims Manager will examine, assess and process claims, ensure that payments and settlements have been made by reviewing settled insurance claims, and report any over-payments, underpayments and other irregularities.KEY ACCOUNTABILITIES:Policies, Systems, Processes & ProceduresDevelop, iterate, document and execute claims strategies taking into account uncertainties, key decisions, potential outcomes and estimated associated costs.\nEstablish Al Koot’s claims management policies and procedures based on the company’s business plan, Claims Strategy and objectives.\nSet, in accordance with, the Chief Officer General Insurance and the Business Planning and Performance Management Department, performance standards/ objectives and Key Performance Indicators, for performance monitoring and quality measurement purposes for the Claims DepartmentReinsurance RecoveryProvide initial notices to the Reinsurance Function, to assist in establishing the reinsurance strategy as required by treaty.\nEnsure efficient and timely correspondence with reinsurers updating them periodically on all General Insurance Claims for smooth processing and recovery of claims.\nEnsure all reinsurers queries are accurately addressed.Claims Management / AnalysisProactively manage claims from notification to closure, investing the necessary level of involvement required for each claim depending on, the nature, category, maturity, type and importance of the claim.\nSupervise and approve claim processing, within authorized limits\nPeriodically update senior management with the claims trends in order to make aware of the financial status and to facilitate ease of decision-making.\nCoordinate with Actuary & Finance in reviewing calculation of Incurred but Not Reported claims (IBNR).\nResolve complex, severe exposure claims, using high service Consultants, if required.Procedure ComplianceEnsure compliance with all department procedures as well as requirements of the statutory auditors / ISO Auditors / Internal Auditor to avoid any violations.\nEnsure Compliance with QCB regulations\nEnsure timely coordination with Legal and Compliance on claims requiring litigation.Service Provider ComplianceSupervise reviewing all claims and coordinate with service providers as appropriate in order to facilitate timely payments / processing of all claims for all companies as well as Collect / provide necessary documents as appropriate.Loss Adjuster ReportsDevelop and maintain clear investigation and verification procedures for claims.\nMonitor the adherence to claims investigations procedures.\nScrutinise all loss adjuster reports to ensure the claims are genuine and in line with policy terms and conditionsSystem updatesEnsure all claims are registered, managed and settled through the system to facilitate generating of reports as per management requirements.Complaints and GrievancesResponsible for complaints and grievances raised against the company\nEnsure that procedures for complaints and grievances are well known to the insureds.\nDeclare monthly complaints and grievances received to QCB\nFollow-up complaints and grievances for closureSkills",
    "Skills": [
        "Experience: 12 – 18 Years of relevant experience",
        "Knowledge & Experience:",
        "Minimum qualification required is a bachelor’s degree in Economics, or Business Administration or law or Engineering\nMaster degree/ Certificate in Risk Management is preferable\nMinimum 12 - 18 years experience in Claims and Reinsurance including 5-7 years experience within the energy, oil / gas and petrochemical industry\nACII from the Chartered Insurance Institute (CII) as minimum. Other insurance qualifications added advantage.",
        "Skills & Competencies:",
        "Communication & Attention to detail\nOrganised / coordination skills\nTime Management & Supervisory"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 18",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 33"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}