{
    "Job ID": "4671172",
    "Description": "Position : Head of Insurance SupportSection : General InsuranceCompany : Al Koot Insurance & Reinsurance CompanyLocation : Doha, QatarNo of resources : 1ROLE PURPOSE:Responsible for assisting in the development and formulation of the documentation and support strategy for General Insurance Underwriting division Al Koot, based on which the underwriting policies, procedures, plans and manuals have established that aids in achieving group underwriting results. The Head of Insurance Support will ensure document control by timely registration of enquiries, AML/KYC initiation process, follow-up with UW team on outstanding documentation, tender preparation, assist in carrying out Research & Development to design new insurance products, product mixes; and to plan the launching of new products across Al Koot synergizing capabilities; holding client seminars, conferences, conducting awareness programs and ensuring adherence to the policies and procedures, laws, in order to achieve Al Koot’s set goals and objectives. Coordinate IT requirements from General Insurance dept with IT department and ensure it is all addressed in timely manner.KEY ACCOUNTABILITIES:Underwriting/Reinsurance team supportRegister all incoming entries (direct/reinsurance new/renewal as well as all endorsements) in CTS & RIMS\nForward to concerned Line of Business\nFollow-up with respective LOB for open items ahead of KPI dates\nEnsure closing of entries within time frame\nReport to GI management on bi-weekly basis on incoming entries, ongoing, closed and outstanding enquiries. Send alerts to respective LOB before month end closing date\nRegister and maintain RFQ/Tender register\nTender process – from collection to arranging bank guarantees to prepare base presentation to be sent to line of business and collection completed tender documents, preparing cover letter, arranging for submission of tender to concerned companies.\nPrepare all tenders from Al Koot presentation in Al Koot standard format and forward to respective line of business for completing Technical and Commercial Submission.\nUpdate tender register.\nUW & RI Department KPI follow-up\nSend renewal list to each line of business and start renewal process\nKYC/TR screening process – Coordinate with AML / LOB/counterparties on KYC/TR Screening and completing the process for new and renewal accounts then pass on file to concerned LOB. Initiate HRBAF process and forward to UW team\nCoordinate with Finance and concerned LOB on reconciliation matters. Report to GI management on progress made\nCoordinate with respective LOB and other department with regard to Supplier/Customer code creation\nGenerate monthly reports/statistics for GI managementCoordinationClosely coordinate with the Underwriting, Reinsurance & Claims section to ensure smooth functioning.\nSupport the Underwriting Function in timely registration of enquiries and renewals, KYC/AML process, tenders,\nCoordinate with all other departments such as IT, AML, Finance and ensure all support is provided mutually in efficient manner to ensure efficient operations of GI departmentBrokers, Agents and ceding companiesDirectly coordinate with brokers, agents and insurance companies for AML/KYC process clearance· Decision making skillDocumentationEnsure all incoming enquiries are registered in timely fashion and record initial entries in RIMS/Business Register are completed accurately as well as in a timely manner and sent to the UW team, AML Team\nProvide timely, accurate and complete progress reports to the Underwriting Manager on the operational progress of the Business Line and the achieved results/deviationsPolicies, Systems, Processes & ProceduresAssist Underwriting Manager in developing and formulating the GI upport strategy In alignment with General Insurance division’s strategy\nEstablish the function’s policies and procedures based on the company’s business plan and objectives.\nSet, in accordance with, Underwriting Manager and the Business Planning and Performance Management section, performance standards/ objectives and Key Performance Indicators, for performance monitoring and quality measurement purposes for the Business Line.\nCoordinate IT requirements from GI dept with IT department and ensure it is all addressed in timely mannerStatement and ReportsPrepare sectional statements and reports of the underwriting section timely and accurately to meet Al Koot and department requirements, policies and standards.Skills",
    "Skills": [
        "Experience: 12 – 18 Years of relevant experience",
        "KNOWLEDGE & EXPERIENCE:",
        "Bachelors Degree in any discipline, preferably management\nSoftware development/management skills and coordination with internal IT department and external vendors for software's\nA Diploma or Master’s degree in Business Administration is a plus.\nProfessional Certification from the Chartered Insurance Institute (CII) or equivalent body is beneficial but not essential.\n12 to 18 years experience in insurance business with at least 3 years in supervisory level\nStrong understanding of insurance operations, compliance requirements, KPI setting, insurance software’s and basic programming with insurance domain knowledge",
        "SKILLS & COMPETENCIES:",
        "Policies, Procedures & Work Methods Knowledge\nCosting & Budgeting Skills\nCommunication Skills\nPlanning & Organizing Skills\nBusiness Understanding Skills\nReport Writing & Drafting Skills\nAnalytical Skill and Detail Oriented skill\nDecision making skill\nInterpersonal skills\nReinsurance\nUnderwriting ability\nOperations control\nTime management\nSoftware skills and basic programming with insurance domain knowledge"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 18",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 33"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA; Economics & Financial Consulting; Financial Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}