{
    "Job ID": "4671223",
    "Description": "يقدم مهندس المرافق الدعم الازم لإدارته لصيانة وتشغيل العقارات المسنده إليه ، كما أنه مسئول عن التشغيل السلس لجميع الأنظمة الميكانيكية والكهربائية بالعقارات وكذلك أعمال الصحى ومعدات الأمن والسلامة ، من أجل تقديم أفضل خدمة ممكنة لمستأجرى العقارات ، وضمان قيام المقاولين المتخصصين والمقاولين من الباطن بتنفيذ الأعمال المطلوبة داخل العقاراتيلتزم صاحب الوظيفة بالسياسات والإجراءات المتبعة داخل الشركة التجارية ويقوم بتنفيذها.3.Key Accountabilities & Performance Indicatorsالمسئوليات الرئيسية ومؤشرات الأداء Accountabilitiesالمسئوليات                                              Performance Indicatorsمؤشرات الأداء                       Technical SkillsEnsure the physical condition of the property according to Al-Tijaria & Kuwait operating and safety standards.\nRespond to all kinds of emergencies at the properties by physical presence on site.\nCo-ordinate emergency and regular repairs to buildings\nSupervise landscaping and ground service providers\nCo-ordinate Mechanical Electrical and HVAC maintenance on unmanned sites.\nCo-ordinate fabric works and monitor.Provide budget costs for old or replacement plant for use in preparation of annual maintenance budgets for assigned buildings \nPrioritize and ensure that help desk requests and repairs are made correctly and in a timely manner.\nEnsure preventative maintenance schedules are conducted effectively.\nEnsure Fire alarm &firefighting systems are operational without faults.\nFacilitate quotes for reactive repair works.\nPersonally inspect properties on a regular basis to ensure all repair work is being done properly, safely, and in a timely manner.\nEnsure reactive work requests are facilities via the helpdesk and work closed down when works are completed.\nCarry out technical service provider audits and inspect plant & equipment’s of the property\nSupervise and monitor the performance of service provider carrying out planned and reactive works where necessary.\nTrouble shoots and rectify where necessary.\nEnsure fire safety equipment is operational\nPerform audits on PPM schedules.\nEnsure specialist service provider adhere to their planned maintenance programs and highlight and rectify issues arising in a timely manner.\nCo-ordinate maintenance and repairs to appliances including refrigerators and washing machines were applicable.\nMaintain monthly tool inventory records\nEnsure in-house technician carry out their work as instructed and monitor their work and performance\nEnsure 3rd parties works reports are produced in accordance to Contract requirements.\nEnsure cleaning effectively carried out the building interior and exterior, walkways, parking areas, plant rooms and stairwells.\nEnsure O & M manual and testing & commissioning reports are available at site. \nEnsure all works is carried out in a safe mannerمهارات فنية وتقنيةالعمل على ضمان سلامة المبانى وفقاً لمعايير الأمن والسلامة المتبعه داخل الشركة التجارية ووفقاً لقانون دولة الكويت.\nالاستجابة لكافة حالات الطوارىء داخل العقارات والتواجد الفعلى بالمواقع.\nتنسيق وترتيب عمليات الصيانة الطارئة وكذلك عمليات الصيانة الدورية لعقارات الشركة.\nالمتابعه والتسيق مع القائمين على صيانة المناظر الطبيعية والنباتات الموجودة بالعقارات.\nتنسيق عمليات الصيانة الميكانيكية والكهربائية وصيانة التكييف للعقارات غير المستغله.\nتنسيق ومتابعه أعمال تركيب المواد بالمواقع\nتزويد إدارة المرافق بأسعار صيانه او استبدال المواد الميكانيكية والكهربائية داخل العقارات للاستفادة بها فى إعداد الميزانية السنوية للعقارات المسندة إليه.\nتحديد أولويات العمل والتأكد من تسجيلها على نظام helpdesk والتأكد من القيام بأعمال الإصلاحات بالشكل الصحيح وفى الوقت المناسب.\nالتأكد من القيام بعمليات الصيانة الوقائية بشكل صحيح وفعال.\nالتأكد من عمل أنظمة إنذار الحريق ومكافحة الحريق الخاصة بالعقارات دون أى فشل.\nمتابعه عروض الأسعار الخاصة بأعمال الصيانه.\nيقوم مهندس المرافق بفحص مباني العقارات بنفسة للتأكد من القيام بالإصلاحات اللازمة بشكل صحيح وآمن وفى الوقت المحدد.\nمتابعه تسجيل الأعمال الموقعية على نظام ال helpdesk وإغلاقها بعد الانتهاء من الأعمال.\nفحص المعدات الكهربائية والميكانيكية الخاصة بالعقارات والتأكد من الحفاظ عليها.\n مراقبة وتقييم أداء المقاولين ومقدمى الخدمات ، والتدخل عند الضرورة .\nالقدرة على حل المشكلات إن وجدت وعند الضرورة.\nالتأكد من أن معدات الأمن والسلامة ومعدات الحريق  تعمل بدون أى فشل\nمتابعه وتدقيق الخطط الخاصة بعمليات الصيانة الوقائية\nالتأكد من التزام المقاولين ببرامج الصيانة المعدة من جانبهم والقاء الضوء على اى أعمال مطلوبة ليتم تنفيذها فى الوقت المحدد\n تنسيق ومتابعه صيانة الأجهزة الكهربائية الموجودة بداخل كل عقار من الأجهزة \nتأمين وإعداد سجلات جرد للمعدات  والأدوات شهرياً والاحتفاظ بها\nالتأكد من قيام مشرفى الخدمات بالشركة بالمهام المطلوبة منهم ومراقبة عملهم.\nضمان التزام المقاولين بتقديم شهادات المسئوليه المدنية الخاصة بالأعمال التى يقومون بها وفقاً لبنود العقود المبرمة معهم\nالحرص على نظافة العقارات من الداخل والخارج وكذلك والممرات ومواقف السيارات والسلالم الخاصة بكل عقار.\nالتأكد من  القيام بعمليات الصيانة والتشغيل واختبارها وإعداد تقارير بالتكلفة الفعليه  الموجودة فى الموقع.\nالتأكد من تنفيذ جميع الأعمال بطريقة آمنه Skills",
    "Skills": [
        "القدرة على دعم المهام المتعددة",
        "Ability for Supporting with multi tasks"
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}