{
    "Job ID": "4672661",
    "Description": "introduction           Technological progress and scientific discoveries have made economic activity mostly knowledge-based and have accelerated growth. It is only possible to meet all the challenges thus imposed, through decisions that are mainly based on research and studies that take into consideration the problems but also anticipate future trends and global expectations. Decision makers are in dire need for research and in-depth and futuristic studies that produce enlightened recommendations and help make the most suitable choices, while avoiding risks and overcoming challenges.Prince Mohammad bin Fahd University strives to develop human intelligence, disseminate knowledge and find solutions based on research and scientific studies of problems experienced by societies. Based on its vision and mission in serving the local and international communities, and with the expertise, potential and facilities supporting scientific research and studies, and outreach activities, the University is inviting applications for the faculty positions in the Computer Science Department in the College of Computer Engineering and Science.In order to apply for the position of Associate / Full Professor, candidates must provide a letter of promotion from an academic institution with a documented due process to the rank of Associate / Full Professor.Duties and ResponsibilitiesThe members of PMU’s Computer Science faculty will:General·       To carry out the duties of the position in accordance with College values and standards and in line with College policies and procedures, upholding high professional standards and leading by example.·       To work with our students as members of a learning community to provide world-class education and an excellent student experience.·       To integrate the College value of inclusiveness into all appropriate aspects of the job, respecting the dignity and diversity of all members of the College community and of visitors to the College.·       To promote the values of collegiality within the College community. Teaching·       To contribute at an appropriate level to school and faculty policy and practice in teaching.·       To play a significant role in the design, development, and planning of courses and programs within the subject area as required.·       To play a significant role in the review of courses and programs and in assessment, quality assurance, and quality enhancement as required.·       To develop innovative approaches to learning and teaching as appropriate.·       To provide timely feedback and assessment of coursework and examinations.·       To provide general support and guidance to students, resolving issues and/or referring to specialist parties, where appropriate. Scholarly and Professional Development and Service·       To maintain an appropriate scholarly or professional development activity and to keep up to date with developments in the field as necessary to carry out the duties of the position.·       To participate in the comprehensive advisement of students majoring in the College.·       To contribute to the overall work of the College and/or equivalent external organizations by representing the institution and faculty on appropriate committees and groups.·       To effectively contribute to the management and administrative processes and committee structures of the School, faculty, and College, as required.·       To participate in, manage, or lead major initiatives or areas of work (as either sustained or one-time projects) that facilitate School, faculty, or College performance and accreditation, as required.·       To participate in the recruitment, management, development, and mentoring of colleagues, as required.·       And to perform any and all other position-related duties as requested by Chair, Dean, Vice President, or President.  Skills",
    "Skills": [
        "Qualifications & Experience (Required)",
        "The quality of educational trainings and academic careers obtained by the Faculty Members for Computer Science in Western university is vital to PMU.  ",
        "·       A Ph.D. in Computer Science or related field from an accredited, reputable Western university.   A Master's degree with good teaching experience may be considered especially in teaching freshman and sophomore courses and laboratory modules.",
        "·       Candidates should have a minimum 2-3 years teaching experience after the terminal degree with good research experience, including publications in international Journals and Conferences.",
        "·       Industrial experience is a Plus.",
        "·       Candidates are expected to have excellent command of the English Language.",
        "·       Candidates should be familiar with technology infused academic environments.",
        "·       Previous experience in the Middle East or GCC countries is a plus. ",
        "Knowledge, Skills and Abilities (Required)",
        "Candidates are expected to have research interest and experience in teaching the following areas: ",
        "·       Computer graphics",
        "·       Computer vision",
        "·       Image Processing",
        "·       Machine learning",
        "·       Artificial Intelligence",
        "·       Distributed Systems",
        "·       Computer Graphics",
        "·       Mobile App dev.",
        "·       Parallel Computing.",
        "·       Cryptography",
        "·       Distributed Systems and Algorithms",
        "Remuneration and Benefits",
        "PMU offers an income tax-free compensation package, commensurate with rank and experience, including 12-month salary, PMU accommodation, annual vacation, and annual round-trip airfare to the home country, medical insurance and end of contract benefits."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Doctorate",
        "Age": "Max: 60"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}