{
    "Job ID": "4673128",
    "Description": "Landscaping Field Supervisor. CONTRACTOR shall provide experienced Landscaping Supervisor(s) who shall have the authority to act on matters pertaining to Landscaping Services required under this Contract. The Landscaping Supervisor shall be a working supervisor with knowledge of this Contract, the maintenance plan and schedule for service areas, and each facility/ building.Skills",
    "Skills": [
        ". Have Associate Degree in Horticulture/Agriculture with minimum Ten (10) years of related experience in gardening, landscaping and pest control services. Experience in sanitation services is preferable.\n. Have sufficient experience and technical knowledge of plant propagation, distinguishing and differentiating between seasoned bond flowering annuals and perennials. Be familiar with the new varieties of flowers, as well as spring and summer.\n. Shall be familiar with the new varieties of flowers, as well as spring and summer bulbs, herbs and vegetables.\n. Have sufficient knowledge of which plants and bushes can be adopted and acclimated to a wide range of soils, climates and adapted practices without losing their beauty.\n. Have valid Saudi Arab Government driving license.\n. Shall possess a current Saudi Arab Government driving license sufficient to drive for the flower delivery van if required.\n.Be able to understand and carryout the instructions of the Landscaping Manager & Landscape specialist"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}