{
    "Job ID": "4673445",
    "Description": "صندوق النقد العربي (الصندوق) منظمة مالية عربية مقرها في مدينة أبوظبي (الإمارات العربية المتحدة)، وتهدف لإرساء المقومات النقدية للتكامل الاقتصادي العربي ودفع عملية التنمية الاقتصادية في جميع الدول العربية. يسعى الصندوق من خلال هذا الإعلان إلى توظيف كوادر شابة لشغل وظيفة \"مسؤول موارد بشرية\" في قسم الموارد البشرية - دائرة الخدمات المساندة. \n\nالمهام الرئيسة:\n\nتنفيذ معاملات العاملين ودفع مستحقاتهم وفقاً للسياسات والإجراءات المعتمدة.\nتنفيذ إجراءات التوظيف التي تشمل الإعلان عن الوظائف الشاغرة واستقبال الطلبات وفرز السير الذاتية والتواصل مع المتقدمين وتنظيم المقابلات.\nتحديث سجلات العاملين وبيانات الحضور والإنصراف والإجازات وفقاً للإجراءات المعتمدة. \nإعداد مدخلات مسار الرواتب والمنافع وفقاً للسياسات والإجراءات المعتمدة في الصندوق.\nإعداد ومتابعة عقود التأمين الجماعي والتأكد من توفير التغطية التأمينية اللازمة للمعاملين والمشاركين في نشاطات الصندوق. \nالمشاركة في أية مهام أخرى يكلف بها لدعم جهود قسم الموارد البشرية وإعداد التقارير الشهرية ووفقاً للإجراءات المتبعة.\nتطوير أدلة سياسة وإجراءات العمل ذات الصلة بنطاق عمل الموارد البشرية وتقديم المقترحات والمبادرات بشأن تطوير أعمال قسم الموارد البشرية في الصندوق.Skills",
    "Skills": [
        "المؤهلات والمهارات والخبرة:\nشهادة بكالوريوس في إدارة الأعمال أو الموارد بشرية أو ما يعادلها من جامعة مرموقةٍ معترف بها.\nيفضل من يحمل تأهيل مهنية في مجال الموارد البشرية.\nخبرة بحدود السنتين في مجال الموارد البشرية.\nمهارات تواصل متميزة للتعامل مع التحديات الوظيفية.\nشخصيّة طموحة قادرة على التطوّر والتعلّم الذاتي.\nالمبادرة والإبداع في مجال العمل.\nيتمتع بالكياسة وحسن السلوكيات الوظيفية وبشخصيّة إيجابية قادرة على التفاعل مع الزملاء والعاملين داخلياً إضافة إلى القدرة على الإنجاز واليقظة.\nمهارات تقنية المعلومات وإجادة إستعمال التطبيقات ذات الصلة.\nإجادة اللغتين العربية والإنكليزية تحدثاً وكتابةً، والمعرفة باللغة الفرنسية ميزة إضافية. \nالقدرة على تلبية الأعمال بجودة مع ضغوط العمل ومتطلبات الإنجاز خارج ساعات العمل الرسمية.\nيقدم الصندوق شروط خدمة تنافسية وفقاً لسياسة التوظيف المعمول بها لديه، والتي تشمل رواتب معفاة من الضرائب، وبدل السكن، وبدل أثاث، وبدل تذاكر سفر، والمساهمة في نفقات تعليم الأبناء، والتأمين على الحياة والتأمين الطبي.\nسيتم الاتصال فقط بالذين يتم ترشيحهم من المؤهلين لشغل الوظيف"
    ],
    "Preferred": {
        "Nationality": "All Arab Countries",
        "Age": "Min: 18 Max: 27"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}