{
    "Job ID": "4673080",
    "Description": "Advising customers on how best to use the products or services provided.\nCollaborating with the design, production, engineering, or research and development departments of the company to determine how products and services could be made or modified to suit the needs of the customer.\nSelling and consulting on technologically and scientifically advanced products.\nUsing technical skills to demonstrate to potential customers the usefulness of the product or service and how it may suit the customer better than competing products.\nMemorizing technical product specifications and keeping up-to-date with new company products as well as industry trends.\nAttending conferences, lectures, seminars, and workshops to improve your skills and knowledge.\nConducting market research and obtaining feedback from clients to improve existing products.\nWriting reports and liaising with the production team regarding issues, foreseeable problems, and effective solutions.\nSimplifying technical terms during product demonstrations and post-sales customer support.\nMaintaining strong professional relationships with existing clients and meeting with new clients to expand sales territories.\nUpdating orders and sales and negotiating the best contract terms.\nListening to customers’ needs and advising them on the best products to buy.Skills",
    "Skills": [
        "Bachelor’s degree in engineering or similar.\nExperience in sales would be advantageous.\nStrong customer service, analytical, and interpersonal skills.\nExcellent organizational, research, and multitasking abilities.\nStrong negotiating and problem-solving skills.\nA professional appearance.\nA valid driver’s license."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10 Max: 16",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sports & Outdoor Activities; Entertainment; Amusement & Recreation Facility",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}