{
    "Job ID": "4673415",
    "Description": "Job purpose:Design and detail engineering of complete unit of Air-Cooled Heat Exchangers (Fin-fan Cooler), Air-cooled condensers & accessories using customer specification and recommendation.\nResponsibility involves review of drawings, mechanical designs calculations, material specifications and purchase requisition.\nCoordination with inter-disciplines, other departments and external agencies like client, consultants, A.I. etc.\nAssigning and receiving work of Designers, Draftsmen & Checkers.Duties and responsibilities:Preparation of detailed strength calculations for pressure part and non-pressure parts, Fabrication drawings and Job package for Air-Cooled Heat Exchangers in accordance with Design Code, Client datasheet and Specifications.\nFinite element analysis of various parts of ACHE including Nozzle and Header box.\nPreparation / Review of Material Take off, Material specifications and Purchase requisitions. \nTechnical review of vendor quotations in compliance with project requirements.\nPreparation / Review of Techno-Commercial bid estimation including MTO, RFQ, Evaluation of vendor quotations etc.\nResponsible for timely Deliverables of design documents\nCoordination with inter-discipline departments, clients/consultants, and inspection agencies.Skills",
    "Skills": [
        "Qualifications:",
        "Required Qualifications",
        "Bachelor’s Degree in Mechanical Engineering\n8 to 12 years experience in Engineering industry (with Fabrication background) with hands on experience in preparation of Design calculations and Drawing review\nExposure to finite element analysis software like Ansys\nExperience in Air Cooled heat Exchangers is preferable \nMust have knowledge of ASME, API, TEMA & customer specification like Saudi Aramco, SABIC.",
        "Preferred Qualifications",
        "Master’s Degree in Mechanical Engineering\nThermal design of Air-Cooled Heat exchangers using HTRI \nKnowledge of International Engineering practices",
        "Key Skills:",
        "Well versed with Microsoft office applications \nSound Knowledge of International Codes on Pressure Vessel Design like ASME Sec.VIII Div,1 / Div.2, API 661 & TEMA code etc.\nThermal design of ACHE using HTRI (preferred)\nGood knowledge of ASME, ASTM, BS and ISO Materials\nExcellent communication skills in English Language\nPhysically fit, able to travel and work overtime when required, flexible attitude, be a team player.\nExposure to International Clients / Consultants, Engineering Standards, and specifications like Saudi Aramco, Sabic etc"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}