{
    "Job ID": "4673119",
    "Description": "Instrumentation Design: Designing and developing instruments and control systems that can measure, control, and automate industrial processes.Equipment Selection: Selecting the most appropriate instruments and control systems for specific industrial processes based on their performance and cost.Installation: Installing and configuring instruments and control systems, ensuring they are properly calibrated and integrated with existing equipment.Testing and Calibration: Conducting tests and calibrating instruments to ensure their accuracy and reliability.Maintenance: Maintaining and repairing instruments and control systems to ensure they operate efficiently and effectively.Documentation: Creating and maintaining documentation such as user manuals, technical specifications, and installation procedures.Troubleshooting: Troubleshooting issues with instruments and control systems, identifying the root cause of the problem and implementing solutions. Skills",
    "Skills": [
        "CONTRACTOR shall provide experienced Instrumentation Engineer who shall have the authority to act on matters pertaining to O&M Services required under this Contract. This personnel shall have knowledge of this Contract, and the maintenance plan and schedule for each facility/ building. This personnel shall:",
        "Have two (2) years Diploma in Electrical/Electronic/Instrumentation Engineering (or) Trade Certificate from vocational training center with full apprenticeship and more than 10 year of experience as instrument technician/Engineer in an Industrial plant  (or) BMS. \n(OR) Have four (4) years Engineering Degree in Electrical/Electronic/Instrumentation Engineering and more than 5 year of experience as instrument technician/Engineer in an Industrial plant (or) BMS. \nHave the ability to read technical drawings and sketches\nHave hands-on Experience in repair and maintenance of field instruments and the controllers\nHave proficiency with open protocols like Bacnet and Modbus for troubleshooting.\nHave proficiency with Windows as an administrator.\nWill be added advantage if he has hands-on knowledge of control system that is implemented in Ithra (or) similar systems.\nWill be added advantage if he has hands-on knowledge Honeywell’s product lines in BMS like EBI, Comfort point open, Sitelink from Emmerson and Niagara.\nShall be a qualified SAUDI ARAMCO Work Permit Receiver with valid certificate. If not already certified at the time of mobilization, the incumbent shall enroll to the earliest available slot to get certified as work permit receiver and maintain the certification throughout the Contract Period\nRead technical drawings and sketches\nRepair and maintenance of field instruments and the controllers"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}