{
    "Job ID": "4676666",
    "Description": "Directly in charge and supervises operation of project sites with focus on kitchen and server area.\nResponsible for orientation of new and incoming employees to their assigned tasks. Plans and prepares schedule of employees, reports, training and requisitions as necessary for the kitchen.\nReports and liaises directly to the Production Manager on all departmental responsibilities.\nInspects employees daily for cleanliness and health problems.\nMonitors and checks cleaning procedure execution.\nMonitors and checks proper food handling procedures.\nOrient new and incoming employees on specific task; cleaning procedures, use of equipment and supplies.\nInspects kitchen, butchery, salad preparation, pot washing room, cooking area, kitchen chillers, freezers, employee rest rooms and garbage disposal to ensure cleaning standards are met.\nEnsures proper coverage of employees for each section and keeps daily timesheets of all employees under supervision.\nMaintain coordination of Process and Quality monitoring forms in accordance with HACCP Principles and practices.\nLiaises with Chef Cook, Pastry Chef and key personnel on operational and quality functions in each section.\nMaintain professional customer/client relationship.\nShould maintain a professional management/employee relationship.\nControl and safe custody of company property and assets in assigned section or site.\nOrganize and monitor preventive maintenance activities of AGS property and equipment.\nMaintain professional behavior of all AGS staff.\nTimely accurate accounting, production and reporting of operational and quality documents for regular submission.\nPrepares menus, minimize wastage and achieve budget food cost.\nDevelop and introduce new dishes.Skills",
    "Skills": [
        "Ensures food safety and occupational safety requirements are met in the entire flow of food items for each department and sites.\nDirectly responsible for maintaining good and professional relationship with customers and addresses any customer requests, suggestions and complaints within assigned site.\nEnsure the staffs practices safety on the job.\nMust be responsible that the site abides by the principles and correct food practices as prescribed in the customers’ food safety manuals or as prescribed by government regulations of Saudi Arabia.\nMust have the ability to direct, motivate and control employees.\nMust have the patience to teach and educate personnel.\nMust be able to cope with unexpected occurrences in food production and operational problems.\nMust be able to work independently and can give instructions to others regardless of nationality.\nMust have high personal health standards.\nMust have thorough knowledge of food service, food production and employee management.\nMaybe required to work irregular hours as circumstances may require.\nResponsible for overseeing all duty work schedules within the site.\nMust be honest, objective, approachable, patient, level headed, disciplined and practices the value of fair play.\nMust have knowledge and skill to perform First Aid and CPR and undergone training in Fire Prevention."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 15",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}