{
    "Job ID": "4676347",
    "Description": "Establishes, develops and maintains business relationships with current and prospective customers in the assigned territory/market segment to generate new business for the organization's\nConduct telephone calls and face-to face visits and presentations to existing and prospective customers.\nNegotiates the terms of agreements and closing sales.\nResearches sources for developing prospective customers and for information to determine their potential.\nDevelops clear and effective written proposals/quotations for current and prospective customers.\nExpedites the resolution of customer problems and complaints.\nCoordinates sales effort with marketing, sales management, accounting, and operations\nEstablish productive, professional relationships with key personnel in assigned customer accounts.\nHave frequent visits / meetings with targeted clients, and ensure that RFQs are received and handled professionally.\nDevelop and maintain large pool of accounts (not less than 50 clients) in Consumer Goods Sectors and tap every opportunity of providing logistics services.\nBe a single point of contact for the clients in representing MLC and promoting its services.\nSatisfy customers upon queries regarding prices, availability and product uses.\nSells company services by establishing contact and developing relationships with prospect clients.\nNegotiate prices and terms of sale and service agreements.\nPrepare and deliver sales presentations to prospected clients to sell the company's servicesSkills",
    "Skills": [
        "Good negotiation skills\nSoftware skills (Word, Excel, PowerPoint, etc)\nValid Driving License is a must.\nGood Networking and interpersonal skills\nExcellent organization, communication and problem solving skills.\nA team player\nSelf-confident and mature\nSelf-motivated and adaptable to be able to work with minimal supervision."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 0",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}