{
    "Job ID": "4676739",
    "Description": "Doha Academy is a growing group of schools providing a British-based curriculum to KG-13 students. Forming a key part of Al Faleh Educational Holding, a publicly listed company, Doha Academy comprises three schools with its largest campus located in Al Waab. Founded in 2000, the Academy’s vision is to be a global leader in education, providing inclusive and accessible programmes of study to a diverse range of students. Fundamentally, the schools are founded on Islamic teachings and principles and seek to provide the best of an internationally-benchmarked education that is shaped by Islamic values. We are currently seeking a new Personal Assistant (PA) to the Academy’s Academic Director / Group Principal. The PA is responsible for: Ensuring that the Principal is fully supported in all aspects of her/his work including all confidential matters. \nProviding verbal translation (Arabic-English) in meetings with parents, staff, other stakeholders, and visitors. \nProviding written translation (Arabic to English, English to Arabic) for all communications to stakeholders. \nTo help quality assure written communications in Arabic to stakeholders. \nManaging the school’s office, secretarial and administrative functions, assisting as required. \nMaintaining the Principal’s calendar. \nKeeping up-to-date with school developments so as to be well-informed in meetings requested by the Principal. \nAssisting, as required, with the administrative preparations for school visits / inspections.  \nSupporting and encouraging the school’s ethos and its objectives, policies and procedures. Skills",
    "Skills": [
        "Candidates should be: ",
        "Experienced in a PA / Secretarial role – preferably in an international school setting \nFluent in both English and Arabic. \nHighly articulate communicators. \nAble to multi-task. \nGenuinely interested in KG-13 education. ",
        "A full job description will be provided to longlisted candidates. ",
        "Please note that the post holder may be required to work outside of normal school working hours for extended school status activities, school events, meetings and emergencies. "
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}