{
    "Job ID": "4677845",
    "Description": "Detailed Role and Responsibilities:Supporting Practice Head for the monthly financial progress report of each project and for the business unit.\nMaintaining, monitoring and reviewing project utilization, budgets and expenditures\nFacilitating the Revenue and Cost recognition and accruals every quarter\nPerform standard calculations to produce analyses and reports\nCreating client invoice application.\nProcessing and recording transactions, fielding communications with vendors, fact checking\nCollecting and entering data for various financial system\nReconcile any discrepancies or errors identified by communicating with employees, vendor and/or clients\nCreating and submitting Business Cases\nAnswers question and provide assistance to stakeholders, customers, and clients as needed\nRaise new employee requests in the system used by the practice\nLiaising with internal and external recruiters to fill any open positions\nCoordinate the hiring process and assist with candidate on-boarding\nProvide updates on hiring in a regular and accurate manner\nOther projects and responsibilities may be added at the manager’s discretion.Skills",
    "Skills": [
        "Practice Coordinator Skills & Competencies",
        "Practice coordinators need to be organized, efficient, good at multitasking, and driven to succeed. Some specific skills necessary for this line of work include:",
        "Communication: To develop and maintain schedules, project coordinators need to be aware of the challenges or obstacles that team members may be facing, and team members need to be aware of the expectations of the project coordinator.\nProblem-solving: Projects rarely go exactly as planned, and the best project managers incorporate contingencies into their planning. Before problems arise, they have plans ready to be implemented and strategies for circumventing those obstacles. When a completely unexpected problem arises, project coordinators need to be adept at addressing it as quickly as possible.\nTime management: One stage of a project often relies on another stage meeting its deadline or maintaining its schedule. This kind of coordination makes it vital that project coordinators keep tight schedules.",
        "Budgeting: Projects cost money, and project coordinators need to know how to best allocate resources in order to accomplish goals.",
        "Educational Qualifications:",
        "Bachelors in Management, Accounting, or Management Information System",
        "Soft Skills and Languages:",
        "Bilingual – English and Arabic is preferred\nExcellent communication skills both written and verbal.\nWilling to learn quickly.\nKnowledge of accounting principles\nExcellent Project management and control skills\nExperience in a client facing role with proven success in communication methods\nHighly organized, hard worker, self-motivated and result-driven individual.\nWorking in non-standard working hours.\nAbility to work well in groups and independently.\nAble and willing to share on-call responsibilities with peers.\nStrong analytical and problem solving skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Security",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}