{
    "Job ID": "4677034",
    "Description": "رئيس قسم الشؤون الإدارية والموظفين- برنامج تمويل التجارة العربية\nيرغب برنامج تمويل التجارة العربية بشغل وظيفة \"رئيس قسم الشؤون الإدارية والموظفين\" في الدائرة المالية والإدارية من ذوي الكفاءات العالية والخبرة المتميزة التي تشمل خدمات التوظيف وإدارة المزايا والرواتب والتدريب وتقييم العاملين والخدمات الإدارية والمشتريات لتحقيق الأهداف الاستراتيجية الطموحة التي يسعى البرنامج لتحقيقها كمؤسسة ماليّة عربية رائدة، ودعم البرنامج في أن يكون الشريك الأقرب للوكالات الوطنية في الدول العربية في تفاعلها مع التطورات الاقتصادية والمالية، لدعم التجارة والمساهمة في رفع القدرة التنافسية للمصدرين في المنطقة العربية.\nالمهام الرئيسية:\nالمشاركة في خطط تقدير احتياجات القوى العاملة ورعاية حقوق العاملين وتطوير قدراتهم والحفاظ على حقوق البرنامج لديهم.\nالمساهمة في تطوير الهيكل التنظيمي وإعداد التوصيف للوظائف والعاملين في البرنامج.\nحفظ سجلات العاملين بما يضمن خصوصية المعلومات ويوثق التزامات البرنامج اتجاه العاملين.\nالمشاركة في إعداد الدراسات والمقترحات الخاصة بالتعليمات الإدارية ولوائح وإجراءات إدارة شؤون الموظفين والعمل على مراجعتها وتطويرها.\nالإشراف على تنفيذ الإجراءات المتعلقة بتعيين العاملين أو إنهاء خدمتهم وتسديد مستحقاتهم المالية خلال فترة الخدمة.\nالمشاركة في تقييم طلبات المتقدمين لشغل وظائف وإجراء المقابلات اللازمة، ورفع التوصية بالكفاءات المناسبة وعرض مقترح المرتب والدرجة.\nالمساهمة في إجراءات التقييم الدوري للموظفين وتجميع وتحليل النتائج.\nالتنسيق مع المختصين في البرنامج لوضع وتطوير البرامج المستخدمة على الحاسب الآلي والمتعلقة بإدارة شؤون الموظفين واحتياجات القسم من خدمات ومعلومات للتوظيف.\nتنفيذ كافة إجراءات مشتريات البرنامج وفقاً لإجراءات وقواعد الشراء المعتمدة.\nالاشراف والإعداد والتنظيم وتوفير الاحتياجات الإدارية واللوجستية والتغطية الإعلامية لكافة الاجتماعات والندوات واللقاءات والمناسبات التي يقيمها أو يشارك فيها البرنامج.\nالإشراف على تقديم الخدمات الإدارية والعامة وتوفير المعدات والمستلزمات لاستخدامات البرنامج، ومتابعة عقود صيانتها وتجديدها.\nالتعاون مع قسم الشؤون المالية والحسابات في إعداد وتوفير البيانات الإدارية اللازمة لاستخدامات الشؤون المالية.\nاستمرار تطوير أدلة وإجراءات العمل وسجلات المخاطر.\nأية أعمال ومهام أخرى يكلف بها أو يطلبها منه مدير الدائرة، أو إدارة البرنامجSkills",
    "Skills": [
        "المؤهلات العلمية والمهنية والخبرة:\nشهادة بكالوريوس في إدارة الأعمال أو ما يعادلها ويفضل شهادة ماجستير.\n7 سنوات خبره في مجالات عمل مماثلة بمستوى قيادي في مؤسسات مالية إقليميّة أو دوليّة أو محليّة معروفة بمستوى عالٍ من الانضباط المالي والإداري والعمل المؤسسي المنظم.\nيتمتع بمهارات عالية في التواصل الايجابي مع كافة الاطراف والبحث وإعداد التقارير والتنظيم الإداري وإدارة المخاطر.\nخبره في إدارة الأمور الإدارية والموظفين وكذلك خبره في إدارة المشتريات.\nمهارات على استخدام الأدوات التقنية.\nخبرة في الاعداد والتنظيم للإجراءات الإدارية.\nإجادة تامه للغتين العربية والإنجليزية وإجادة اللغة الفرنسية تعتبر ميزة إضافية.\n سيتم الاتصال فقط بالمتقدمين الذين يستوفون الشروط ويرشحون من الإدارة لشغل هذه الوظيفة."
    ],
    "Preferred": {
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}