{
    "Job ID": "4677838",
    "Description": "Customer Service Representative (Native Tagalog Speaker)Job ObjectiveTo respond to customer quires and requests through phone, email, web chat etc.and update necessary systems and details about the interaction and caller detailsJob Roles and ResponsibilitiesAnswering telephone calls in a timely manner and providing helpful accurate information to callers.\nDemonstrate high level of empathy during interactions with the caller.\nMaking outgoing telephone calls to customer/clients to provide further information or to follow up on information previously given if needed.\nSupporting other functions within the project such as appointment booking, making outgoing calls for appointments, providing specific information and more as instructed by line manager.\nKeeping database up to date\nEnsure adherence to company policies, procedures and practices.\n Providing good customer service to callers by always demonstrating showing positive behavior.\nAttend training courses relevant to the role and implement the training as appropriate.\nEstablishing and maintaining effective working relationships\nCommunicating effectively verbally and in writing in both Tagalog and English.\nWork as a team with other colleagues to carry out work smoothly.\nTo understand the need for and maintain strict confidentiality at all timesKey InteractionsCustomers\nTeam Leaders\nSupport Team\nHR\nIT Team Skills",
    "Skills": [
        "Skill & Experience ",
        "Bilingual ( Tagalog and English) \nExcellent written and verbal communication\nSolution focused and High problem solving skills\nExcellent time management and self-organizing\nGood typing speed\nExperience with usage of MS Windows and MS office and related tools",
        "Educational Qualification",
        "High School and Above",
        "Behavioral Skill",
        "Highly Empathetic\nAbility to work under pressure \nFlexible hours\nPatient, Motivated self-starter\nExcellent communication with the team\nPresentation and negotiation talent\nDisplays positive professional outlook and behavior"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}