{
    "Job ID": "4677067",
    "Description": " تصميم برامج وحزم المنافع والتعويضات وبرامج المكافآت التي تتماشى مع الخطة الإستراتيجية للشركة بحيث تكون عادلة\nوجذابة ومنافسة\n تحليل وتقيم الوظائف وفق أحدث ممارسات الموارد البشرية\n دراسة أنظمة الأجور للاستثمارات في قطاعات القوى العاملة التي تساهم بأكبر قدر من القيمة\n تقييم مدى فعالية حزم المنافع من حيث التكلفة المالية ورضا الموظفين\n التأكد من امتثال خطط التعويضات والمنافع للتشريعات ذات الصلة\n تطوير فلسفة التعويضات والمنافع\n رفع الاقتراحات اللازمة بميزانية قسم التعويضات والمنافع\n متابعة والرفع ببرامج الدعم الحكومية\n تخطيط التعويضات والمنافع وبرامج المكافآت التي تتوافق مع الخطة الإستراتيجية لإدارة الموارد البشرية\n ضمان توافق الرواتب والمزايا مع التشريعات الحالية المتعلقة بوزارة الموارد البشرية والتنمية الاجتماعية والمساواة في\nالأجور\n استخدام أساليب وتقنيات مختلفة واتخاذ قرارات تستند إلى المعلومات السويقية بشأن التعويضات المالية المباشرة وغير\nالمالية\n تحديد الاتجاهات اللازمة لتنفيذ الممارسات الحديثة في إشراك وتحفيز الموظفين\n إجراء الدراسات والبحوث السوقية اللازمة لتحديث نظام التعويضات للتأكد من تقديم خطط تعويض منافسة\n القيام بتحديد احتياجات الموظفين من خلال إجراء استطلاعات علم النفس التنظيمي لمعرفة ما يحفز الموظفين ويشركهم\n إجراء بحث حول رضا الموظفين (على سبيل المثال، استخدام الاستبيانات والبيانات الكمية)\n تجديد خطط المكافآت الخاصة بالمزايا النقدية وغير نقدية بناءً على احتياجات الشركة\n إعداد الوصف الوظيفي مع تحليل الوظائف وتقيمها وتصنيفها\n إعداد مقايس ومؤشرات الأداء للشركة\n تقييم والإشعار عن فعالية برامج مزايا الموظفين\n إجراء عمليات تدقيق دورية وإعداد التقارير وحفظ السجلات والملفات\n إعداد ميزانية التعويضات والمزايا، بما في ذلك الرصد المنتظم وإعداد التقارير وضبط الميزانية.\n تطوير استراتيجية المكافآت بما يتماشى مع ثقافة العمل والأهداف التنظيمية.\n البحث عن هيكلة الرواتب والمزايا في قطاعات الأعمال المعيارية وجمع بيانات السوق لتقديم توصيات واضحة للأعمال.\n الإشراف على إعداد وتنفيذ دورة مراجعة الرواتب السنوية، والشهرية، وحسابات المكافآت، والحوافز.\n الإشراف إعداد درجات وظيفية باستخدام طرق تقييم الوظائف\n الرد على جميع الاستفسارات المتعلقة بالتعويضات والمنافع للإدارات التنفيذية.\n مراجعة دراسات ساعات العمل لكل موظف ووضع الإجرآءات اللازمة لتحسينها.\n تخطيط وتنظيم ساعات العمل الإضافية الممنوحة للموظفين\n تخطيط وتنظيم رحلات العمل الممنوحة للموظفين\n تخطيط وتنظيم عملية السلف النقدية\n الإشراف على إجراء المستحقات الخاصة بالإجازات او نهاية الخدمة\n متابعة المهام التي توكل اليه من إدارة الموارد البشرية فيما يخص متطلبات العمل\n الوصف الوظيفي قابل للتعديل في مجال الوظيفيةSkills",
    "Skills": [
        " الخبرة كمشرف للتعويضات والمنافع أو دور مماثل\n خبرة عملية في إدارة نظام معلومات الموارد البشرية أو برنامج كشوف المرتبات والمنافع\n معرفة حزم تعويضات البناء وبرامج المكافآت لمختلف الإدارات ومستويات الأقدمية\n فهم ممتاز لأنظمة تقييم وتحليل الوظائف\n مهارات تحليلية قوية\n الإلمام بتشريعات العمل"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}