{
    "Job ID": "4677847",
    "Description": "Role SummaryThe role is responsible for creating the strategic blueprint for delivery execution of the organizational change and transformation efforts of malomatia and planning and developing the capabilities for relevant units and departments for seamless execution. He/she is also responsible for supporting the formulation of the change management plan and heads the steering committees of all units/functions/departments related to organizational change and transformation initiatives.The role holder plays a key role in delivering the transformation agenda, focusing on identifying and driving opportunities for significant change. He/she will be responsible for leading the development and implementation of ambitious, complex, and multi-faceted transformation programs, including elements of system redesign, remodeling of services, culture/ behavior/ mindset changes and delivery of savingsStrategic Responsibilities  Assist the Chief Strategy and Transformation Officer in the development and implementation of corporate change and transformation initiatives.\n Guide organization by establishing a change management strategy for transformation to enable realignment and ensure teams are provided with sufficient support in understanding and adapting to any fundamental change in business operations.\nUnderstand the business architecture, integrate process frameworks for the organization and develop and own the roadmap to proposed change that can help drive organization maturity.\nEnhance capabilities of relevant departments and units that ensures seamless execution of corporate change and transformation strategy.\nCollaborate with all internal stakeholders to develop a change management plan for successful implementation of corporate strategy.\nDetermine KPIs to measure corporate performance to determine effectiveness of strategies in place and identify areas of improvement to ensure efficiency\nHandle issues encompassing change management procedures, prioritization of projects, and resource allocation in line with malomatia’s standards. Address any alerts emanating from the process to the CSTO for recommendation.\nWork with Leader – Enterprise Risk Management to ascertain risks and opportunities in corporate change initiative and identify business adjacencies that can drive innovation in strategy design.\n Lead the development of key reports for business leaders with insightful inferences and the creation and application of insights for commercial deals and decision making. \n Implement governance of and compliance with malomatia’s existing strategic policies and procedures. Operational Responsibilities  Lead and co-ordinate a portfolio of strategic projects related to organizational change and transformation initiatives to accelerate go-to market and drive commercial outcomes.\n Ensure alignment with the balanced scorecards of the company. Assist the Chief Strategy and Transformation Officer in overseeing projects that are company-wide and strategic in nature and have a direct impact on business plans of the company through the Project Management team function.\nUnderstand overall client needs and trends and frame the overall transformation strategy and objectives to analyze large amounts of data and drive key insights.\nOversee the strategic progress of the change initiatives and provide feedback with respect to forecast completion, schedules, and budgets to identify issues that may affect future project planning and prevent project cost overboard. \nEnsure financial soundness and alignment for any recommendations by develop quantitative analysis to support them, considering competition and innovation. \nProvide clear, concise, and persuasive executive level communications and reports which assists in prioritization of initiatives and high impact decision making.\nStay updated with commercial and business landscape scenario to provide foundational context for essential strategic projects.\n Engage with unit and departmental heads to identify disruptive growth and efficiency opportunities to achieve performance targets and gain market visibility.\nOversee the preparation and facilitation of planning sessions with the top management. People Responsibilities Ensures the culture of the function is aligned to the overall culture and ways of working of malomatia.\nProvides strong, dynamic leadership that mentors, develops, and guides employees to efficiently perform and achieve customer delivery excellence. \n Provides guidance and direction to direct reportees by managing their performance through appropriate feedback and counseling. \nFosters high level of employee engagement and retention of talent \nSupports leadership & functional capability building initiatives through training as per organization’s guidelinesJob SpecificationsDesired Educational Background : University degree in Business Administration with specialization in Strategy from a recognized university. Professional Certification such as PMP is preferred.\nLanguage Requirement : English & Arabic\nDesired Experience : About 12-15 years of related experience of which a minimum of 9-10 years should be in a similar position/ responsibility, preferably in a similar Industry.Skills",
    "Skills": [
        "Required Skills & Competencies",
        "Functional",
        "Proven experience of project and program management from initial design to completion\nAbility to exercise influence across a range of stakeholders, especially senior management\nAbility to present a well-argued, robust business case along with preparing and presenting clear, concise reports\n Problem solving and analytical skills\nBenefits management, including using benefits realization plans to deliver cashable benefits\nAbility to work with/ across a range of stakeholders\nIdentifying risks and implementing appropriate mitigation plan\nCertified Change Management Professional (or Prosci)",
        "Behavioral",
        "Ability to use leadership skills to motivate and inspire others to change their behavior and embrace new ideas\nExcellent negotiation and conflict resolution skills to ensure support for ideas, strategies, and values\nFlexible approach ensuring achievement of objectives within constantly changing and complex situations and environments\nExcellent written and verbal communication skills\nWell organized, able to meet tight deadlines and committed to high standards\nAble to work with a team of individuals with varied skills and backgrounds"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}