{
    "Job ID": "4681167",
    "Description": "Treasury Manager- KuwaitOn behalf of the fastest-growing retail company in the Middle East, our client is hiring a Treasury Manager for their Head office in Kuwait.Reporting to the Head of Finance, you will manage all activities related to the Company’s cash, investments, and debt in order to meet the financial obligation of the organization’s adopted policies and procedures.Oversee forecast cash flow positions, related borrowing needs, and funds available for investment.\nEnsure sufficient funds are available to meet ongoing operational and capital investment requirements.\nAdvise management on the liquidity aspects of its short- and long-range planning.\nOversee daily cash positioning activities and develop cash targets to support efficient liquidity management.\nDevelop a facilities tracker to maintain and record all loans and their calculations as per bank and loan facilities.\nDevelop and lead hedging procedures to mitigate risk from currency and interest rate fluctuation by applying advanced hedging strategies.\nMaintain broker database for trade clearance and counterparty risk\nDevelop and enforce strong internal controls and financial management policies.\nManaging counterparty risk by creating careful and considered policies regarding investments and deposits.\nManage FX and interest-rate risk/ direct the FX exposure management.\nMonitor and manage bank relationships and liquidity management, coordinate, and liaise with the bank on the company’s trade facilities.\nManage large numbers of L/C transactions, including the issuance, amendment, and acceptance of L/C.\nThe automation of important financial operations using systems that facilitate communication between treasury departments and their banking partners.Skills",
    "Skills": [
        "8 to 10 years of experience in Finance & Treasury, with at least 4 years of experience in a Managerial position.\nBachelor’s Degree in Banking & Finance or Professional Certificate in treasury/cash management (preferred).\nExperience with SAP ERP system for treasury functions is a must.\nSAP ERP SYSTEM and TMS (Treasury Management System) Kyriba/FIS experience.\nKnowledge of Bank Guarantees.\nKnowledge of the type of credit facilities (ST/MT/TL) available from the Bank, and additional Islamic finance products for facilities."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 15",
        "Gender": "Male",
        "Nationality": "All Arab Countries; Kuwait",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}