{
    "Job ID": "4681750",
    "Description": "Will manage multiple number of restaurants/stores\nWork on positive comps of 5% on sales and transactions over last year. Ensure the profitability of the stores\nPrepare or review manpower schedule to ensure optimum manning of all restaurants based on business volumes.\nEnsure all staff and managers are trained and certified as per the company's guidelines.\nMonitor store opening and closing timings as per management guidelines.\nConduct regular meetings with the store management team and help boost their morale.\nVisit all restaurants in the area on a regular basis. Be on top of the day-to-day operations of the stores.\nMonitor product quality, storage and expiry.\nCheck all operating equipments are in working condition and liase with maintenance for all preventive maintenances.\nOversee all LSM programs in the trade area.\nMonitor the flyer distribution through external agency as well as inhouse teams.\nReview and analyze KPI's\nCheck and approve all store petty cash expenses.\nPlan and budget monthly overtime in stores.\nCheck daily reports and verify store inventories.\nConduct weekly/monthly audits in co-ordination with the Restaurant Manager. Plan corrective action where necessary.\nMonitor the quality of the finished products.\nMonitor Food Cost and store consumptions. Take corrective action on inventory variance.\nEnsure all records are maintained in the restaurant.\nFollow through all duties as assigned by the Operations Manager/Senior Management TeamSkills",
    "Skills": [
        "Minimum of 5 years experience in the same position\nDynamic, Results oriented, Outstanding analytical skills.\nExcellent computer skills and able to generate reports to the Management Team and provide suggestions and action plans.\nWith valid driving license (Kuwait)\nBilingual (excellent in both English and Arabic communication skills)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}