{
    "Job ID": "4683889",
    "Description": "Sales Executive Aftermarket Parts SalesCommercialization of aftermarket sales resulting in the continual increase in Co revenue stream from the sale of aftermarket parts and accessories.Planning/forecasting, market price information, and sales program. Build customer relationships in a professional manner through solution-oriented communication, service, and telephone support. Supervise for fleet, Cooperative societies, parts jobbers, and dealer sales operations to achieve set targets and ensure highest customer satisfaction.Responsibilities:1. Product and market knowledge in aftermarket parts and service.2. Responsible for achieving annual sales and profit target by monitoring salesthrough assigned channel.3. Build customer relationships in a professional manner through solution-orientedcommunication, service, and telephone support.4. Ensure all operational procedures and standards are carried out to obtain thehighest customer satisfaction.5. Responsible for prompt distribution of aftermarket parts to customers and fieldtechnicians.6. Identify and quote accurate parts and services to customers in a timely manner.7. Ability to read both electronic and manual catalogues.8. Develop and update customer database, identify and interact with Key AccountCustomers through email, personal visits, contact etc.… to maintain customerrelation and enhance sales.9. Follow up with customers on submitted quotations, tenders, and Ministry orders.10. Review escalated customer complaints and coordinate with central CustomerRelations team to resolve complaints/suggestions.11. Submit quotations online, receive LPO, create back orders and fulfill on timeagainst purchase orders.12. Update customers on the status of back-order details on a weekly basis.13. Monitor delivery of goods and coordinate with Parts Distribution Center (PDC) onthe same.14. File and maintain credit documents and LPOs for future reference of ASGCredit/Legal departments.15. Ensure updating of Estimated Time of Arrival (ETA) for parts on SAP for theinformation of fleet and dealer customer orders.16. Coordinate with Inventory department for the fulfillment of back orders createdand update supersession/alternate information from Toyota Motor Corporation tocustomers.17. Create loss of sales in system and liaise with Inventory to provide feedbackregarding the non-available parts order forecast.18. Responsible for implementing Dealer agreement and contracts.19. Ensure the company policy and guideline in the operations are in place to meetaudit compliances.20. Propose various sales promotional scheme and provide the market feedback tosupport Pricing team regarding market pricing and branding.21. Identify areas for improvement and recommend kaizen ideas or suggestions to manager.People Management:1. Provide on-the-job training and coaching to staff and provide information and necessary material to staff to carry out the jobs.2. Receive grievances raised by subordinates and promptly escalate such grievances to management.Prepare VOC based action plans.\nPrepare periodic sales and activity reports and presentations.\nDocument and maintain records of activities and process workflows on internal communication portals.\nAdhere to Al-Sayer Group policies and health and safety regulations.\nPerform other duties as requested by management.Skills",
    "Skills": [
        "Educational Qualifications and Experience:\nPrimary: BBA/Bachelor’s Degree with 3 - 4 years of experience.\nAlternate: Diploma with 5 – 6 years of experience.\nHave technical knowledge to assist customers and employees as needed and have",
        "access to reference materials to ensure appropriate completion of all work.",
        "Linguistic Abilities: English and Arabic."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}