{
    "Job ID": "4683297",
    "Description": "Be the change. Join the world’s most visionary developer. Red Sea Global (RSG) is showing that there is a better way to positively shape the places we live, work and travel. We are purpose-driven and committed to people and planet. Our transformative programs are a driving force to achieving Vision 2030, as well as leading the world towards regenerative tourism. Join RSG and be part of the positive change for Saudi Arabia and the world.We are hiring now! As part of the recruiting process, we will be in the United Kingdom, Scotland and Ireland to interview candidates in May 2023.Our executive team will be in these countries to conduct interviews with candidates for the following position.Location: London, Manchester, Glasgow and DublinAs our programs expand, and our remit widens to develop more of the coastline, we have opportunities for best-in-class professionals within various disciplines. Should you have a hospitality or major projects background or have anyone to refer in either location who would be interested to join our team and meet our team, please Associate Construction Directors\nAssociate Project DirectorsPackage /BenefitsOffering expats, a highly attractive tax-free salary, we also provide a superior comprehensive global benefits package for the individuals including:Global schooling allowance, annual flights, annual leave, medical Insurance, relocation allowance, wellness allowance, life insurance/discretionary bonus/Site based accommodation/Food/Site transportation/ flexible working schedule.\nAlongside this, you will have the opportunity to work with some of the most renowned global design consultants, on the most prestigious and high-profile projects currently underway anywhere in the world.Skills",
    "Skills": [
        "Minimum Requirements:",
        "Bachelor's degree in engineering or any other related field.\nMaster’s or MBA (Preferred) PMP (Preferred).\nMinimum of 18 years of experience out of which the last 4 years in a lead role having delivered a project in UK or globally.\nHospitality projects/ High end resort programs or Major buildings projects experience will be preferred.\nContractor experience will be a huge plus."
    ],
    "Preferred": {
        "Residence Location": "United Kingdom"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Civil Engineering; Construction & Building; Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}