{
    "Job ID": "4683848",
    "Description": "Union Square House is expanding its wings and has evolved as a real estate solutions company with a turnover of one billion dollars per year. Since its incorporation in UAE from year 2009, the company has been a pioneer for all real estate solutions. We are the preferred partners and an award-winning property brokerage firm from leading developers like DAMAC, EMAAR, NAKHEEL, MERAAS, DUBAI PROPERTIES, LAND DEPARTMENT, SOBHA etc., for consecutive ten years. Our senior management and experienced agents have been in the industry for over 15 years having worked with some of the most renowned property companies in UAE.  We treat every employee as a part of the family and offer a multicultural environment to thrive in. We strongly believe that Hard Work Pays Off, so we are look at hiring talent based on quality and fit for the company culture we have created.We are looking for passionate Russian, Hindi, German and French speakers Real Estate Sales Professional to join our team. As a member of our team, we offer you:Qualified Leads\nAttractive and Competitive Commission Structure\nMonthly allowance for business calls\nReal Estate License ( RERA)\nCareer Progression & Growth\nIn-house training and continuous mentoring\nIn-house Digital Marketing support\nProfessional Photographer & Videographer\nStrong Admin support\nRobust CRM system\nAccess to Exclusive Projects Inventory\nPositive & diverse work culture with a well-equipped game room for recreation\n30 days Annual Leave\nEmployment visa\nMedical Insurance\nOpportunity to work with some of the top brokers in the industry.Skills",
    "Skills": [
        "Strong Sales background in Real Estate, Banking, Investment and Insurance\nStrong presence on all Property Portals\nKnowledge of local real estate market trends, laws, and regulations\nNative English communicator & written skills\nStrong negotiation skills - experience in offering expert customer service\nAbility to work independently with great dedication\nMust be presentable, have a professional attitude and like to work as part of a team.\nPassion to succeed & strong Mindset\nValid UAE Driving license\nRERA certification will be an advantage\nOwn car is a plus"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "United Arab Emirates",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Investment, Securities & Funds; Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}