{
    "Job ID": "4684884",
    "Description": "The incumbent drafts, writes, negotiates, and finalizes an organization's contracts with external parties. This person will also be responsible for drafting , reviewing and interpreting contracts/ agreements and other important documents to ensure that the legal terms and conditions are favourable and safeguard the interests of Barwa. Prepare contractual responses to client / customer contractual correspondencesPreparing and editing/ drafting contracts between the company and potential clients/customersNegotiating contract terms and conditions for products and servicesAssessing contractor performance to identify the need for amendments of existing contractsHandle changes and breach of contracts in a timely mannerServe as the main liaison with client/customer contract representativesDevelop and implement effective procurement/contract proposalsUpdated about all regulations to ensure contracts are updated and in compliance with lawsCoordinate with clients to guarantee terms of contracts are fulfilled in compliance with the terms and regulationsCoordinate with all stakeholders within and outside the organisation for smoother contract administrationSkills",
    "Skills": [
        "Bachelor’s degree in law or relevant field",
        "A minimum of 5 years’ experience in a similar role",
        "Proven work experience as a Contracts Specialist or similar role",
        "Excellent oral and written communication skills in English is required. Arabic language understanding is an added advantage. ",
        "In-depth knowledge of procurement regulations, contract documents and legal specifications",
        "Outstanding negotiation and interpersonal skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}