{
    "Job ID": "4684984",
    "Description": "Qualifications and SkillsA degree in computer science, information systems, electrical engineering or a closely related degree.\nAn active, demonstrable interest in cyber security, cyber threat detection and cyber threat intelligence.\nDemonstrable experience analyzing and interpreting threat intelligence indicators, TTPs and threat actors.\nA solid understanding of IT systems and network security concepts.\nA sound knowledge of IT security best practices, common attack types and detection / prevention methods.\nDemonstrable experience of analyzing and interpreting system, security, and application logs.\nKnowledge of the type of events that both Firewalls, IDS/IPS and other security related devices produce.\nExperience in using SIEM tools such as ArcSight, Envison, Splunk, NitroSecurity\nTCP/IP knowledge, networking and security product experience\nPossible attack activities, such as scans, man in the middle, sniffing, DoS, DDoS, etc and possible abnormal activities, such as worms, Trojans, viruses, etc.\nCCNA, CISSP, GCA, GCIA, GCIH, CEH certification would be preferable.\nOutstanding organizational skills.\nExclusive focus and vast experience in IT.\nStrong analytical and problem-solving skills.\nA motivated, self-managed, individual who can demonstrate above average analytical skills and work professionally with peers and customers even under pressure.\nStrong written and verbal skills.\nStrong interpersonal skills with the ability to collaborate well with others.\nThe ability to speak and write in English is required; Ability to speak and write in both English and Arabic is optional.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}