{
    "Job ID": "4685400",
    "Description": "The Job Purpose of a Business Administrator will be to provide administrative support to Management along with other secretarial duties.Key AccountabilitiesTyping of all correspondence i.e., letters, memos, schedules, agendas, etc.\nHandling independent business correspondence for the division (incoming and outgoing)\nDirecting incoming telephone calls to the appropriate recipient\nManage, organize and update relevant data, maintain a proper filing system.\nOrganizing all business operations related events i.e., training, team meeting etc.\nOrganizing travel and hotel reservations for business trips from and visitors to, the division as well as visa processing\nResponsible for preparing employees change of status forms and recruitment requests (new appointments, terminations, resignation)\nCoordinating with personnel office especially in residence related matters\nCoordination of tasks, projects and staff across various locations in Kuwait (warehouses, offices, suppliers, business partners and other facilities)\nResponsible for division's stationery requirements\nResponsible for the division’s time sheet, tracking and resolving of various matters etc.\nMust be able to multitask, handle demanding customers (internal and external), liaise with different individuals across different departments and functions, and be able to work systematically, accurately and with strong time management skills. Skills",
    "Skills": [
        "Communication skills\nSolid knowledge of wider Kuwait\nAt least 1 year experience in similar administrative role\nPlanning and organizational skills\nComputer skills (Microsoft office - especially Excel )\nSelf motivated, able to work independently\nTime Management skills"
    ],
    "Preferred": {
        "Nationality": "Kuwait",
        "Degree": "High school or equivalent",
        "Age": "Min: 20 Max: 29"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}