{
    "Job ID": "4686572",
    "Description": "Job Purpose:Ensuring Retail outlets have sufficient stock cover in store for all our Category lines in distribution, through efficient order taking, and communication to EDP for processing/delivery. To also facilitate efficient sell-in of central and local promotions and assisting Merchandisers to secure space for promotional plans. The role also includes responsibility for Central/Local activity implementation and Point of Sale implementation in store (through Merchandisers)Key Responsibilities:·Achieving Value and Volume targets as set from month to month. ·\nManaging spend in trade.\nManage product freshness through efficient store ordering, and stock rotation (with the help of Merchandisers).\nCoaching responsibility for Merchandisers\nAchieving monthly set Targets.\nStrictly adhering to Journey Plans.\nEnsuring On shelf availability and display for all our lines in distribution by category, according to agreed availability plan and Planogram, through a process of efficient store ordering, and implementation through Merchandisers\nTracking and ensuring on shelf availability and display for all our lines in distribution by category, according to agreed availability plan and Planogram.\nInputting contractual display opportunities at all outlets under coverage.\nImplementing Central and local activity efficiently through efficient sell in\n100% contractual implementation and reporting any deviations/exceptions\nEfficient usage of Point of Sale Material in each of the categories, as negotiated with the Store and implemented through the Merchandisers.\n100% implementation of Local and Central Activities, through efficient sell in of promotional & new product line.\nReporting all in store opportunities and issues to line manager.\nMaintaining excellent relationship with store supervisors or managers.\nEnsuring MF/GTRC asset integrity at store level, including maintenance follow up.\nLimit spend on Freshness through efficient store ordering, stock rotation, freshness actions in advance and reporting of any exceptions\nCoordinating with Merchandisers to ensure all GRVs for any freshness actions are processed within 2 weeks from date of actioning.\nOptimally reduce and eliminate write-offs (0% on chocolate)\nAchieve optimum sales phasing during the month.\nCarry out specific implementation activity as may be delegated\nCoach Merchandisers on display standards/effective implementations\nReporting to management on critical control measures as agreed/communicated.Skills",
    "Skills": [
        "Education: Diploma or higher.",
        "Experience: Prior experience in sales, especially in the FMCG industry, is highly desirable. Experience in customer service or retail may also be beneficial.",
        "Skills Required:",
        "Communication Skills: Good communication skills are necessary to be able to effectively communicate with customers, answer their queries, and persuade them to buy products.\nInterpersonal Skills: Must be able to build good relationships with customers, colleagues, and other stakeholders. They must be able to work well in a team environment.\nNegotiation Skills: Negotiation skills are critical to be able to close deals and achieve sales targets.\nTime Management: To be able to manage their time effectively, prioritize tasks, and meet deadlines.\nAnalytical Skills: Analytical skills are important to be able to analyze sales data, identify trends, and adjust sales strategies accordingly.\nComputer Skills: A basic understanding of computer applications such as Microsoft Office."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Kuwait",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}