{
    "Job ID": "4686815",
    "Description": "We are seeking a dynamic and enthusiastic Librarian to join our team of educators at our school. The successful candidate will be responsible for managing and developing our primary section library, providing a welcoming and stimulating environment for our students to read and learn.Responsibilities:Develop and maintain an up-to-date library collection of age-appropriate materials for primary students.\nAssist students in selecting books and other resources that support their learning.\nConduct library orientation and information literacy sessions for primary students.\nFoster a love of reading and literature by organizing reading programs, book clubs, and other library-related activities.\nCollaborate with classroom teachers to integrate library resources and services into the primary curriculum.\nManage circulation and overdue notices, as well as repair and replace damaged books and resources.\nParticipate in professional development opportunities to stay current with library trends and best practices.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Library Science or a related field.\nMinimum of 2 years of experience working in a school library setting, preferably with primary students.\nKnowledge of children's literature and experience in collection development and management.\nExcellent communication and interpersonal skills, with the ability to work collaboratively with students, teachers, and parents.\nFamiliarity with library technology and digital resources, including online cataloging and circulation systems.\nPassion for working with children and fostering a love of reading and learning.",
        "If you are a dedicated and passionate Primary Section Librarian with a commitment to creating a positive learning environment for students, we encourage you to apply. We offer a competitive salary and benefits package, as well as opportunities for professional development and growth."
    ],
    "Preferred": {
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Unspecified",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}