{
    "Job ID": "4687251",
    "Description": "The Area Civil Engineer is responsible for generation of leads and specification pipeline of Tensar applications by offering solutions to Clients, Consultant Engineer and Contractors in all Middle East (Mainly Saudi Arabia, Qatar, Kuwait &amp; UAE) construction markets such as Civil Engineering, Rail, Housebuilding, Landscape, etc.Historically sales are generated by providing solutions to Consulting Engineers and gaining specifications for projects. These projects need to be tracked through all stages through to completion and the ACE is responsible for managing the internal resources of Tensar to best provide a complete service to the Consultant/Contractor.The ACE has a defined sales territory and is responsible for the communication and management of all potential sales opportunities in this territory including identifying and managing an existing and potential customer base so as to achieve agreed budgets.The ACE is also part of a larger sales team and is responsible for working closely with colleagues so as to maximise potential sales opportunities as an influencer on own customer base that has a sales opportunity in other territories.The ACE is predominantly self-managing and needs to manage Territories so as to provide a timely and professional service and solution offering to customer base.Key responsibilities:Thorough understanding of geographical territory in Middle East so as to provide an accurate opportunity analysis for Tensar specification work within the territory, including market segment awareness.Communicate the benefits of Tensar products and solutions to existing and potential customers/influencers so as to grow the market knowledge of Tensar services.Work closely with all members of the Tensar Distributor team so as to provide the Tensar service offering to own customer base but also influence project sales in other territories.Provide technical communication forums for customer base through workshops, seminars, case studies, technical papers, literature, press articles, referrals etc. Objective is to differentiate our offering from that of our competitors.Organise sales team support for territory through all stages of projects, and customer requirements by utilising all resources such as Key Account Managers, Design, Customer Services, Marketing, Finance etc. so as to provide customers with all levels of support and to maintain excellent sales relationships.Utilise all sales tools offered by the Company so as to best manage opportunities and time within territory.Provide regular input to the Gateway NPI (New Product Introduction) process by using routine contacts with customers and specifiers to actively seek out and identify problems, unmet needs and unarticulated needs that may generate ideas or directions for new product development.Key competencies:Health &amp; safety - Monitors working practices to ensure health and safety standards are adhered to within the team.\nIntegrity - Offers and asks for opinions in a professional constructive manner, encourages honest conversations and promotes transparent working practices .\nIntegrity - Manages and reviews own and others workload to ensure tasks are always completed, objectives are delivered on time and within budget.\nTeamwork &amp; diversity - Effectively adapts communication style to the audience, inspiring, engaging and motivating them.\nContinuing personal growth - Encourages self and others to step outside of their comfort zone and develop the courage to take on new challenges, capturing the learning and celebrating success.\nAccountability - Thinks through challenges thoroughly, asks questions to confirm understanding, seeks to resolve issues without the need to escalate them.\nContinuous innovation - Cultivates a curious mindset within the team to keep updated on functional and industry developments and cutting-edge technology.\nCustomer-centric mindset - Monitors and evaluates service delivery to ensure solutions are delivered in the most efficient, timely and seamless way.\nCustomer-centric mindset - Ensures customers are delighted and works to maintain long term relationships with them.Skills",
    "Skills": [
        "To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required.",
        "Degree standard or similar in Civil Engineering or equivalent.\nSound understanding of Contract law to ensure that the Company’s position is protected.\nSeveral years’ experience in Civil Engineering design and Construction with particular emphasis on geotechnical engineering at similar level to main contacts [Consultants, Project Engineers etc.]\nAbility to communicate effectively and to establish good working relationships within company and external customers.\nExtensive knowledge of geosynthetic marketplace.\nProven technical competence.\nThe ability to develop solutions to construction problems using internal/external experiences.\nGood motivational/communication of strategy skills.\nSelf-Motivated. \nTo be aware of the safety aspects and responsibilities of site work.\nWillingness to strive for self-teaching with regards to market technology.\nGood computer literacy so as to use Microsoft Office, CRM systems &amp; design software.\nExcellent project management skills are required to ensure that design work is completed efficiently and on time, experience of working on large/major projects would be advantageous.",
        "This position is located in Dubai, UAE. Pay is commensurate with skill set and experience. Tensar International",
        "Limited is an Equal Opportunity Employer offering competitive compensation and an excellent benefits package."
    ],
    "Preferred": {
        "Residence Location": "All GCC Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}