{
    "Job ID": "4687635",
    "Description": "Purpose of the job:To strengthen Product channel and marketing tool development and management.\nTo develop / monitor / expand the channel and Marketing coverage by working closely with the Sales team with marketing plans.\nAdditional responsibility will include assisting Business Head in various aspects of Marketing Budget Management.Key Objectives:The successful applicant is responsible for:Maintaining & developing the business with clear objective of achieving the company’s marketing tool development and new product planning in the Division.\nCarry out all marketing activities related to the division.\nBudgeting, Planning, execution and monitoring product’s.\nPlan and create the marketing communication asset to achieve the IMC (Integrated Marketing Communication) strategy.\nDevelop the execution strategy to ensure that the marketing communication asset is used organically and multi dimension-ally at all touch points.Position Responsibilities:Marketing Budget Management:Quarterly/Monthly budget planning (product and market wise) for company budgets within company’s deadline.\nMonthly evaluation of the marketing spends (market, budget and product wise) covering ATL and BTL activities (ATL/ BTL portion management as per company guideline).\nMonthly Budget management: Plan proposal with (TIM %) Total Investment to Market guide.Marketing Activities and Reporting:Recommend the measures to enhance the quality of Product display.\nDevelopment of in store material for all the product categories.\nMaintenance of good level of Samsung display & products in stores – keeps records of distribution of special displays, pops (point of sales materials)\nManage all ATL.\nWeekly marketing activity reports to be prepared and circulated to all concerned in SAMSUNG Levant and HQ.\nArrange and coordinate product launches.\nCoordinate product reviews and PR activities with PR Manager.\nPrepare and execute plans for marketing assigned products or product line(s), with the ultimate objective to achieve or exceed company goals.\nWork closely with Brand Marketing to assure consistency with established guidelines.\nParticipate in decisions regarding product positioning and advertising campaigns.\nDevelop budget for assigned area of responsibility, and operate within established budget guidelines.\nMaintain high level of brand preference and awareness.\nParticipate in close communication with the agencies by delivering clear briefings, thus deriving ideas that align with the communication strategy and the output wanted.\nAnalyze the communication impact through before and after consumer research.Skills",
    "Skills": [
        "Qualifications:",
        "Experience & Education:",
        "A track record of success within LEVANT is essential and minimum 4 years’ experience in consumer electronics industry in the same position.\nBachelor / Master degree in business, Marketing, Advertisement or any related field.\nAnalysis and Proposal, Persuasion, Negotiation skills.\nExcellent quantitative aptitude, commercial acumen.\nGood PC skills- Excel, PowerPoint and good presentation skills is a must.\nUnderstanding of the local market is required hence local experience will be preferred.\nKnowledge of some or all of products: Audio/Video, IT, Home Appliances.\nAbility to perform and work under different conditions and a team player.",
        "Language:",
        "Fluent Arabic & English Language, excellent negotiation skills.\nAbility to read, analyzes, and interprets sales/financial reports, data and studies.\nAbility to respond to common inquiries or complaints from customers, distributors, or members of the business community.\nAbility to effectively present information to top management, public groups and/or clients.",
        "In the whole process of recruitment, job applicants should be careful not to infringe the trade secret of the company which they have been/were working for."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Beirut, Lebanon",
        "Nationality": "Lebanon",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}