{
    "Job ID": "4688921",
    "Description": "We are looking for a motivated and results-driven Sales Representative to join our team. You will be responsible for generating leads, contacting potential customers, presenting our products or services, closing sales deals and maintaining customer satisfaction. You will also provide feedback on customer needs, preferences and market trends.To be successful as a Sales Representative, you should have excellent sales and negotiation skills, as well as the ability to build rapport with customers. You should also have a positive attitude, a strong work ethic and a customer-oriented approach. You should have a minimum of two years of experience in sales or customer service and a high school diploma or equivalent.Responsibilities:• Generate leads through cold calling, networking or referrals• Contact potential customers via phone, email or in person• Present our products or services in a professional and persuasive manner• Answer customer questions and address their concerns• Negotiate prices, terms and conditions with customers• Close sales deals and process orders• Follow up with customers to ensure satisfaction and loyalty• Meet or exceed sales targets and quotas• Provide feedback on customer needs, preferences and market trendsSkills",
    "Skills": [
        "Qualifications:",
        "High school diploma or equivalent \nMinimum of two years of experience in sales or customer service (IT market – Mobile market – consumer electronic)\nExcellent sales talent\nCar , driving license    "
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Consumer Electronics; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}