{
    "Job ID": "4688022",
    "Description": "Visiting existing and potential retail clients to evaluate needs and promote products as per the assigned route.\nRecording orders and sending details to the sales office.\nFollow-up on orders fulfillment with distribution team.\nUnderstanding and promoting the company’s Products as assigned.\nMeeting or exceeding sales targets.\nEnsure company’s equipment is properly utilized.\nAchieve retail execution excellence according to the assigned Picture Of Success.\nContribute to increasing company profits through fruitful customer relationships.\nMaintain accurate records of all sales and prospecting activities to analyze the sales prospects.\nMaintain accurate records of competitors’ activities and promotions.Skills",
    "Skills": [
        "Bachelor’s degree in a business-related course with emphasis on marketing.\nKuwait Driving License .\nProven work experience in marketing and achieving set targets.\nExcellent communication skills, both written and verbal communication.\nAbility to lead and motivate a sales team, and put in place measures to retain a great team.\nExcellent selling skills, ability to close deals, and deal with post-purchase anxiety.\nExcellent selling skills, people-oriented, and ability to motivate a team.\nAbility to identify potential areas of growth and identify new business partnership opportunities.\nStrong organization skills and multi-tasking skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 45"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}