{
    "Job ID": "4688765",
    "Description": "Job Title: HYDROJETTING SUPERVISOR                 HYDROJETTERSSalary: Negotiable and purely based on your Qualification, Experience, Skills, Ability & Interview performanceType of Employment: Long TermJob Location: Kingdom of Saudi ArabiaPlanning and Coordination: Develop work schedules, assign tasks, and coordinate hydro jetting operations to ensure efficient and timely completion of projects.\nSafety Compliance: Ensure adherence to safety protocols and regulations during hydro jetting activities. Conduct safety briefings, provide proper training, and enforce safety practices to mitigate risks.\nEquipment Maintenance: Oversee the maintenance and proper functioning of hydro jetting equipment. Coordinate repairs, inspections, and ensure that equipment is in optimal condition for operation.\nQuality Control: Monitor and evaluate hydro jetting operations to ensure quality standards are met. Conduct inspections, assess cleaning effectiveness, and address any issues or deficiencies.\nTeam Management: Provide leadership and guidance to a team of hydro jetters. Delegate tasks, provide training and support, and foster a positive and productive work environment.Skills",
    "Skills": [
        "·      Job Title: HYDROJETTING SUPERVISOR",
        "                 HYDROJETTERS",
        "·      Experience: Min. 5 years of experience including experience as a Supervisor working for Oil & Gas and related industry.",
        "·      Salary: Negotiable and purely based on your Qualification, Experience, Skills, Ability & Interview performance"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 20",
        "Age": "Min: 22 Max: 40"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Oil & Gas; Petrochemicals & Refined Petroleum Products Manufacture; Crude Petroleum & Gas Extraction",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "20"
    }
}