{
    "Job ID": "4688152",
    "Description": "Perform operations (quality/timing) in a safe manner·     Execute the contract under supervision and approbation of the Operation Manager, and respect quality and timing required as per contract.·     Manage the relationship with the client under supervision and approbation of the Operation Manager to ensure that all aspects of the contract are respected for the project.·     Propose and respond to client requests for additional work and ensure that the relevant steps of the applicable internal procedures are followed to be sure that any variation orders are feasible and achievable on time and within budget.·     Direct and manage all activities of the project team and on-site personnel under supervision and approbation of the Operation Manager, ensuring that staff is qualified and competent, properly coached, given the opportunity to develop and continually motivated to handle the demands of their jobs and achieve their objectives. Ensure operational excellence.·     Apply and respect regional project procedures, QA / QC plan and procedures. Support QA / QC / HSE and competitiveness improvements.·     Liaise, in accordance with the Operation Manager, with all the support functions throughout the project to ensure they have all the relevant information to be able to provide full and timely support.·     Issue, update and communicate the project schedule internally and to clients.·     Mobilize and manage equipment and personnel resources on the project.B- Collect the cash·     Ensure that invoices related to the project are issued and that they are paid in time.·     Optimise project cash flow.·     Issue and negotiate progress work certificates and invoices to clients.C- Feedback analysis·     Organize the feedback on the project to the Operation Manager and other relevant functional managers. This includes the completion of all the necessary reporting at the regional and group levels.·     Hold project review with the management and build up project costs per tasks and estimate project revenues (CEP N). Monitor the project costs, progress and revenues to ensure the profitability of the overall project and the reduction or elimination of variable costs.·     Build up KPI for the project and make them approved by the P&O Department Manager.·     Support any task as required to improve the efficiency of the project management (procedure and method statement review, etc...).Skills",
    "Skills": [
        "Education: Engineering diploma or degree, ideally in Welding",
        "Experience & knowledge / Expérience & savoir-faire:",
        "Minimum of 3 years experience in project management, with preference for broad-based experience within the oil and gas or construction industries. Proven operational experience and success within an international environment; ability to deliver customer satisfaction.",
        "·     Considering customer service of paramount importance. Regular interaction with clients to gain feedback and to ascertain ways to improve services.",
        "·     Strong project management skills.",
        "·     Necessary knowledge in welding, mechanics and materials.",
        "·     Good knowledge of Microsoft Project, Excel and Word softwares.",
        "·     Excellent communication skills and intercultural adaptability and sensitivity.",
        "·     Strong team-player with excellent reporting, communication and interpersonal skills.",
        "·     Strong focus and drive to set him / herself and the team ambitious objectives.",
        "·     Strong analytical skills: attention to detail.",
        "·     Excellent interpersonal savvy and business acumen.",
        "·     Integrity, tenacity, resilience and adaptability in complex situations and often changing environment.",
        "·     Ability to handle pressure and commit to, and respect, deadlines.",
        "·     Excellent English language skills.",
        "·     Legal and contract management knowledge."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}