{
    "Job ID": "4689517",
    "Description": "Responsible for supporting, implementing, and maintaining the Business Continuity Management System (BCMS) to protect the company’s people, assets, and reputation.\nReview and update BCM plans, strategy, policies and procedures and other documentation for approval,\nContributes to building a Business Impact Analysis (BIA) to assess internal and external threats and the risk they pose to Qatar Rail and recommends mitigation strategies to reduce or eliminate identified risks,\nCommunicate the BCM plans and drives the delivery of BCM plans,\nCoordinate the activities amongst various BCM work streams,\nWork closely with technology teams to ensure their disaster recovery plans for critical systems and applications are consistent with the plans developed for Qatar Rail,\nAssist in the coordination of the BCP testing program and actively participate in testing scenarios,\nInitiate and coordinate training and awareness programs,\nEscalate risks and coordinate mitigation responses,\nDevelop status reports on continuity plans and prepare management reports as necessarySkills",
    "Skills": [
        "Bachelor’s degree in business administration, finance, information technology, management, or similar field required; Master’s degree preferred.\nProfessional Training\nA certificate in business continuity management is a plus\nMinimum of five years of management experience with at least two years in a risk management position and or experience in business continuity/disaster recovery planning or a related field. Proven experience in achieving performance targets"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Metro & Rail Passenger Transport",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}