{
    "Job ID": "4689454",
    "Description": "Gramercy Networks is a global, facilities-based licensed carrier of enterprise and telecommunications services that provides low latency connectivity. We focus on investing and developing the fastest global and transcontinental routes between capitols, major cities, financial trading centers, critical corporate operations centers, and other end point locations.We are seeking Senior Network Engineers to serve as instructors and technical advisors as we create a training curriculum for our partners and customers in the Middle East and North Africa (MENA) market. In particular, we are seeking Network Engineers experienced in optical fiber network design, planning, construction and/or O&M, or optical fiber network NOC operations and related network management systems (NMS). Varied experience with leading vendor equipment (Huawei, Nokia, Ericsson, ZTE, etc) is a plus. This role is a perfect fit for network engineers with 7+ years of experience supporting metro, regional or national networks who are looking to apply their expertise towards new and unique projects with a global focus.In this role, you will use your expertise to help Gramercy Networks create content for a series of training courses to support and educate our partners and customers on optical fiber network development, operations and best practices. You will also use your experience and skills to advise and support the development of new projects in the region.Your duties will include:Provide real-world technical expertise to assist with development of training course curriculum\nAssist the internal training team with development of educational products and technical materials\nReview training course materials for accuracy and real-world applicability based your areas of expertise\nOffer internal training demonstrations and help craft new training course content\nProvide technical advisory support towards new business opportunities\nSupport internal technology research and development activities in accordance with your areas of expertise\nPerform field and laboratory testing of new network equipment to support ongoing and future projectsSkills",
    "Skills": [
        "The ideal candidates will have:",
        "Bachelors degree in a telecommunications-related field; advanced degrees or specialized training certificates are a plus\nAt least 7 years of experience with optical fiber networks, ideally working for large telecom firms and/or with exposure to multiple vendor technologies\nPrior experience as an instructor or with training activities is a plus",
        "This position offers a flexible/remote work arrangement with some travel may be required.",
        "Gramercy Networks is proud to be an Equal Opportunity Employer and values diversity. All employment is decided on the basis of qualifications, merit and business need. We are compliant with the Fair Chance Ordinance as applicable and will consider all qualified applications for employment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "3"
    }
}