{
    "Job ID": "4689192",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Duties And Responsibilities:The Program Manager will ensure the Program Management requirements are met and they will interact with each project manager to provide support and guidance on individual projects, including:Conveying the important relationship of each project to the overall program and organizational performance objectives\nWorking to ensure that the overall program structure and program management processes enable the program and its component teams to successfully complete their work and to integrate the components’ deliverables into the program’s end products, services, results, and benefits\nWorking to ensure that projects are organized and executed in a consistent manner and fulfilled within established standards\nResolving resource constraints and / or conflicts that affect multiple projects within a program\nAligning organizational / strategic direction that affects project and program goals and objectives; and\nResolving issues and change management within a shared governance structureResponsibilitiesProgram integration.\nProgram scope management.\nProgram time management.\nProgram cost management.\nProgram quality management\nProgram Human Resource Management\nProgram Communication Management\nProgram Risk Management\nDesign of new reports\nFacilitate continuity and standardization across departments\nBuild and manage program teams\nServe as a point of contact for critical program requirements\nEnsure program delivery following Charter and Execution PlanSkills",
    "Skills": [
        "Skills:",
        "Bachelor's degree; Engineering, Construction Management, Advance degree preferred",
        "PMP Required",
        "Technical Skills",
        "Proficiency in software especially in Oracle Primavera P6, Oracle Unifier, software Estimating, Oracle BI, Oracle EBS and MS Office Suite.",
        "Strong understanding of electric and gas utility business.",
        "Non – Technical Skills",
        "Problem Solving / Analytics – Advanced",
        "Written & Verbal communication – Advanced",
        "Stakeholder Management – Advanced",
        "Interpersonal Skills – Advanced",
        "Leadership Skills- Advanced"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}