{
    "Job ID": "4689203",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Description:Coordinating transportation providers to ensure prompt and proper movement of shipments\nResponding to customer inquiries and referring clients to the proper channels\nReviewing purchase orders and shipping documents to ensure accuracy\nMaking special shipping arrangements as necessary\nTracking and fixing shipping errors\nPreparing bills and invoices\nManaging distribution and shipment budgets\nEnsuring that the quality of all services provided meets the required standards\nDeveloping processes that make the supply chain more efficient and organized\nCoordinate and monitor supply chain operations\nEnsure premises, assets and communication ways are used effectively\nUtilize logistics IT to optimize procedures\nRecruit and coordinate logistics staff (e.g. truck drivers) according to availabilities and requirements\nSupervise orders and arrange stocking of raw materials and equipment to ensure they meet needs\nCommunicate with suppliers, retailers, customers etc. to achieve profitable deals and mutual satisfaction\nPlan and track the shipment of final products according to customer requirements\nKeep logs and records of warehouse stock, executed orders etc.\nPrepare accurate reports for upper managementSkills",
    "Skills": [
        "Skills:",
        "Proven experience as logistics coordinator\nExperience in customer service will be appreciated\nKnowledge of laws, regulations\nAbility to work with little supervision and track multiple processes\nComputer-savvy with a working knowledge of logistics software (ERP)\nOutstanding organizational and coordination abilities\nExcellent communication and interpersonal skills"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}