{
    "Job ID": "4689145",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!We are currently seeking for an enthusiastic and committed individual with exceptional communication skills that prides himself on his ability to deliver extraordinary levels of service.As an Office Manager you are responsible to provide a full range of executive secretarial and administrative support activities for the Executive Manager.inclusive of highly confidential and sensitive matters to ensure smooth operation of the executive office, whereby your role will includekey responsibilities such as:• Organize office operations and proceduresCoordinate with IT department on all office equipment.• Manage relationships with vendors, service providers, and landlord, ensuring that all items are invoiced and paid on time.• Manage contract and price negotiations with office vendors, service providers and office leaseManage office G&A budget, ensure accurate and timely reporting.• Provide general support to visitors.• Ensure all outgoing correspondence is typed, proof read and dispatched to the highest possible standard.• Compose and prepare routine correspondence and prepare simple interpretation of documents / correspondence if requested.• Review all incoming mail and prioritize before forwarding to the Executive Manager.• Act on routine standardized correspondence and inform the Executive Manager accordingly.• Keep calendar constantly updated to facilitate appointment and meeting schedules• Establish and maintain various filing / records / database of business contacts, trace pending items and follow up as appropriate• Compose letters on behalf of the Manager.• Attend meetings, record, write and distribute the minutes and follow up on action items.• Organize travel and external business trips on behalf of the Executive Manager.Skills",
    "Skills": [
        "Skills:",
        "Education, Qualifications & Experiences",
        "You should ideally have a HR Background or experience.",
        "College diploma in secretarial training and relevant previous experiences.",
        "You must also have fluency in both written and spoken English and the ability to take sufficient notes at a meeting to prepare record of events.",
        "Computer literate and sufficient typing skills."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}