{
    "Job ID": "4689212",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Key TasksPrepares range /buying plans based on sales budget/forecast with Category Manager / Buying Director sign off.\nManages product performance, including sell through, to recommend price action, promotional activity and / or reorders.\nAttends international Trade Fairs and Exhibitions to select products, monitor market trends/influences and in order to maintain relationships with key suppliers\nEnsure that optimal stock levels are being maintained across all continuing lines and that business stock target is achieved.\nClarifies roles and responsibilities of the team and briefs colleagues about what is needed\nInteracts with all cross functional teams, including Retail Operations, Sales, Marketing, Merchandising,\nFinance, OSO, Warehouse, Group Control and IT\nIdentifies market opportunities for range extensions in order to grow the category , in line with overall strategy of the HF business\nEnsure effective delivery of all promotional campaigns, discounts and product launches within the agreed promotional calendar.\nInteracts with Sales colleagues on a regular basis to ensure that customer feedback is communicated in order to maximise opportunities within the range\nSets goals and objectives for the team and monitors against actual performance\nUses market information to develop plans to promote new and existing products\nDevelop and coach junior buying team members \nCommunicate ideas / suggestions for improvement and efficienciesKey AccountabilitiesPreparation & Maintenance of the buying budget – Preparing an Open-to-Buy plan every month based on the overall directives from the business. Maintaining of buying decisions based on strategies.\nIdentification of purchase requirements – Coming up with relevant stock levels across all ranges and meeting actions, ideas to maximize sales and profits. Rationalizing product offering to deliver consumer and market needs. Manage core/ value/ promo/ fusion ranges and stock flow of all lines.\nRange launches – coordinating the launch of new ranges in store, tracking performance of new lines .Managing allocation / replenishment of stock to stores and maintain well-balanced stocks with an effective stock program that is reviewed and revised regularly. \nIdeal display stock holding – devise ideal stock holding levels for the showrooms and the business across all categories\nMonitoring – best sellers /slow sellers, ageing stock and maximize the fast selling items and find ways to exit of the slow sellers.\nPlanning and execution of “Promotions/Sales/Campaigns”\nProduct Selection – Selecting products to be put in promotional campaign.\nPrice setting – Proposing a sale promo price for the selected SKUs based on pre-decided business parameters\nMerchandise allocation – allocation of sale stock to the showrooms\nMonitoring – Weekly monitoring of on sale stock to enhance sale effectivenessSkills",
    "Skills": [
        "Skills:",
        "Excellent numerical and analytical skills.\nExperience with Business Objects/SAP is an advantage.\nTeam player and results orientated"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}