{
    "Job ID": "4689238",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Job DescriptionContributes to the revenue and attendance targets for each financial year through the contracting of B2B partners, provides recommendations in the development of attractive offers for the different segments.\nDevelops, manages and contracts business to business (B2B) accounts and is responsible for specific market as assigned by the Sales Manager.\nDevelop B2B partners sales in assigned markets through communicating trade briefs as instructed by the Sales Unit Head or Sales Manager.\nHandling of all contracting requirements related to the assigned client account coordinating with the Sales unit head when required.\nProvide and coordinate familiarization trips for but not limited to trading partners and B2Bs.\nProvide weekly, quarterly and annual sales feedback and reporting on own targets to the Sales Unit head and compare against the museum's revenue and attendance targets, providing recommendations as required.\nCommunicate issues to Sales Unit Head including but not limits to challenges with internal processes or departments which may be impacting the flow of business and sales.\nResponsible for managing own scheduling and administrative functions to match their target requirements and reporting their agenda to the Sales Unit Head on a weekly basis.\nResponsible for the contact data associated to their allocated accounts in the Client Relationship Management (CRM) system.\nCreate distribution channels as set out in B2B sales strategy by engaging and contracting B2B partners, including but not limited to hotels, destination management companies (DMCs) and trade partners, airlines, tourism boards, tour operators, corporates and educational institutions.Skills",
    "Skills": [
        "Skills:",
        "Requirements",
        "Have worked for a travel agent, tour operator, DMC, OTA and / or hotel\nHave established network in the industry\nSales Track-record in the field of Travel/Tourism\nUnderstanding of museum seasonality, need periods and periods of high demand\nLiterate with writing, negotiating proposal and contracts\nProficiency and strong knowledge in Excel\nAble to work alone and within a team\nMotivator, self-starter and a team-builder\nExcellent command of Arabic/English & preferably French"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}