{
    "Job ID": "4689190",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Responsibilities & Duties:Responsible for the delivery of the annual revenue target agreed with their Sales Leader for their specific area. \nThrough effective account management, they are responsible for delivering an accurate revenue forecast based on the operational activity and expenditures planned by their customer(s).\nAccountable for retaining the customer base as well as identifying and successfully developing relations with new customers. \nAccountable for understanding client needs and responsible for introducing the Weatherford portfolio of products and services across the customer matrix. \nProvide a detailed Account Plan which will be reviewed on a regular basis, quarterly as a minimum, to monitor performance and offer an early indication of any potential revenue gaps that they will be accountable for addressing. \nShould the account be expanding, they should provide an early indication of the resources needed to capture additional market share. \nThe role is supported by Technical Sales resources within the Sales function to ensure the effective & efficient delivery of all sales processes including; support for client engagement opportunities, opportunity management, contract handover, and management of contract review processes. \nThrough liaison with their respective Global Business Manager, they shall identify strategic business opportunities for introducing new technologies, products, and services and bundling models to their customers. \nMaintains safety and service quality as a first priority when working across all areas of the business \nMaintains the highest standards of corporate governance, ensuring that all commercial activity is carried out ethically and in compliance with company policies, relevant laws, regulations, standards, and industry practices \nOversee the tender development and response process, ensure all resources are available for the highest quality tender submissions via the tender management process \nAccountable for addressing budget considerations for proposals as well as addressing technical specifications with the client in conjunction with technical sales \nAssemble and disseminate market intelligence including gathering client feedback \nDevelop and execute strategic plans to strengthen WFT Identity by understanding customer/industry key objectives & challenges -emphasizing and aligning our Core Capabilities \nOversee all areas of business risk and ensure strategies exist to mitigate these as much as possibleSkills",
    "Skills": [
        "Skills:",
        "Qualifications",
        "Workforce Development & Mentoring Skills\nIntegrated Management Systems\nExperience with Well construction and completion product lines.\nExperience with Salesforce or similar CRM software.\nBasic finance knowledge"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}