{
    "Job ID": "4689538",
    "Description": "دراسة مواصفات وتركيبات الأدوية والعقاقير والمواد الصيدلانية وتحضيرها وصرفها بحسب الوصفة الطبية ودراسة وتحديد الآثار الجانبية لاستخدامها وتأثيراتها في الإنسان.\nدراسة احتياجات الصيدلية وتحديد أنواع وكميات الأدوية والعلاجات ومواصفاتها وإعداد وتدقيق طلبيات الشراء ومتابعة توفيرها واستلامها وتخزينها بحسب سجلات موجودات الصيدلية وفق الأسس الصيدلانية.\nدراسة الوصفات الطبية وتجهيز الدواء قبل صرفه للمستهلك وإرشاد المريض بشأن طريقة الاستعمال والى الآثار الجانبية المحتملة.\nتطوير أساليب وإجراءات العمل ومواكبة التطورات في مجال الصيدلة.\nإعداد الوثائق والتقارير الطبية المتعلقة بالصيدلة وحفظها في قاعدة البيانات الخاصة بها وفقاً للسياسات والإجراءات المنظمة، وضمان تطبيق مبادئ وقواعد السلامة العامة أثناء القيام بمختلف أعمال الصيدلة.\nاتباع جميع القواعد واللوائح والإجراءات القانونية الخاصة بمجال الصيدلة.\nالإستماع جيدًا للعملاء لتفسير احتياجاتهم وتقديم المعلومات والمشورة الصحية المناسبة.\nتنظيم الصيدلية بطريقة فعالة لجعل تحديد المنتجات أسهل وأسرع.\nمراجعة وتنفيذ وصفات الطبيب للتحقق من ملاءمتها.\nتنظيم الصيدلية بطريقة فعالة لجعل تحديد المنتجات أسهل وأسرع.\nالحفاظ تخزين وترتيب الأدوية وغيرها من المنتجات ومتابعتها والتأكد من مدة الصلاحية ومنع مشاكل سوء التخزين.\nالاستمع جيدًا للعملاء لتفسير احتياجاتهم وتقديم المعلومات والمشورة الصحية المناسبة.\nتقديم المساعدة الطبية الأخرى مثل الحقن وقياس ضغط الدم وقياس درجة الحرارة وما إلى ذلك.\nإعداد الدواء والوصفة الطبية عند الاحتياج باستخدام الجرعات والمواد الطبية لكل مريض.\nالاحتفاظ وتدوين السجلات عن تاريخ المريض وجميع الأنشطة المتعلقة بالأدوية المختلفة.\nمواكبة التطورات في مجال الطب من خلال حضور المؤتمرات والندوات والتعاون مع المتخصصين في الرعاية الصحية.Skills",
    "Skills": [
        "الفهم الشامل لادارة المركبات الكيميائية وتحديد الجرعات والقياسات المختلفة.\nالمعرفة الجيدة بالعلامات التجارية.\nاجادة استخدام برامج مايكروسوفت ( MS Office ).\nالقدرة على التنظيم والادراة بشكل ممتاز.\nاجادة التعامل مع برامج وانظمة ادارة الصيدليات.\nالقدرة على التواصل والتفاوض وتقديم المشورة وتبسيط المعلومات الطبية."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Pharmacies",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}