{
    "Job ID": "4689226",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!As a project manager your role will include:Source and negotiate with subcontractors, production suppliers, internal and external supply chain, to ensure each project is successfully resourced, budgeted and managed, and delivered according to Company processes.\nProduction of onsite working documents to agreed deadlines, as directed by the Account Management team.\nMonitor the technical drawings for all approved projects and provide the needed support to draftsman.\nAnalyses and review the technical drawings of all approved projects before submitting it to production department.\nThe ability to manage a changing workload, prioritize accordingly and remain calm under pressure.\nProactive in the team and a good team player. Key performance indicators Exhibition stands delivered smoothly, to quality and budget expectations.\nFacilitate project reconciliation ensuring financial information from suppliers and timesheets from freelancers are available and accurate records have been kept and are available in a timely manner.Skills",
    "Skills": [
        "Skills:",
        "You will display the following skills:",
        "Excellent communication skills.\nMeeting deadlines.\nStrong organization and time management discipline.\nOperate effectively in stressful situations.\nWilling to work overtime.\nCommunications skills\nPresentation skills\nTeam work\nCreativity.\nAbility to work under pressure and meet deadlines.\nAttend to office on time.\nRepresent an excellent image of the company in front of the clients.\nCommit to the company’s rules and regulations.\nAbility to relate to and communicate with people.\nAbility to solve complex problems with creative solutions."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}