{
    "Job ID": "4689155",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!An IT support officer often deals directly with the employees or customers who have technical issues like forgotten passwords, viruses or email issues. He is responsible for installing and configuring computer systems and related software. He is also needed to diagnose and solve hardware or software faults. He further helps in the compilation and maintenance of an accurate record of hardware and software. He is also accountable for providing technical support to requests over the telephone and email for all PC hardware, software and associated peripherals. He should maintain a log to support calls and document their results to aid in the solution of common queries. Moreover, he is responsible to maintain and upgrade the existing PCs and peripherals as directed by the Team Leader. He also needs to install new connections and carry out routine procedures. He should also regularly conduct electrical safety checks on computer equipment. He should actively help the Support Assistants to develop their skills and knowledge by making them participate in appropriate training activities.Skills",
    "Skills": [
        "An IT support Officer should be able to refer to technology in simple terms without using confusing terminology. He should also be an excellent problem solver with strong analytical skills. He should always be enthusiastic to remain updated with the latest technology. He should be able to prioritize and manage many assignments at the same time. He should be patient and should have the perseverance to continuously work on the same task till it is complete. He should possess very good interpersonal skills as he needs to interact with various kinds of people and complaints. Therefore, he should be able to establish a good working relationship with customers and other professionals."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}