{
    "Job ID": "4689979",
    "Description": "Develop, and manage account activity plans to meet budgeted volumes and margin objectives, in alignment with the overall BU Strategy –\nManage the Sales & Distribution of the total Food service Segment (Hotels, Restaurants, Catering Companies, Ship Chandlers & Bakeries) for all the Emirates of UAE.\nFocusing on enhancing the existing business & target new potential customers to develop the Business.\nTo monitor Competitor's activities in the Market by conducting random surveys and countering it by making necessary measures and attractive proposals to our clients so that our competitors may not take over our market share.\nFollow up with the sales team for payment collections from the market as per the Company's agreed credit terms and coordinating with the Finance Dept.\nProvide impeccable customer service and attend to customer complaints on an immediate basis to ensure it is clearly communicated to the respective departments and solved .\nPrepare negotiation scenarios and strategy and fully lead negotiation process. –\nContinuously analyze customer development, define and maximize business development opportunities - Analyze available data sources to profitably manage the portfolio and drive growth opportunities for our brands with each customer. –\nBuild effective annual promotion plans based on sound sales development and profitability analysis. Produce excellent conceptual selling decks and establish the brand as the category leader with key customer.\nBuild strong intercompany networks and establish a close cross functional relationship. - to ensure alignment to the objectives for the outlets.\nHandling the out of stocks situations effectively in coordination with the concern departments so that the customer should not suffer.Skills",
    "Skills": [
        "Graduate with 5+ Years’ experience in the similar role\nExperience in HORECA Industry in UAE region is a must .\nExcellent use of office applications, Microsoft Office, Good Financial and Marketing Skill\nStrong Communications, Leadership, Customer Service, and interpersonal Skill\nAbility to build and maintain relationships and apply skills; and to train and develop staff\nStrong planning, analytical skill\nExperience of managing business development agreements\nStrong negotiation skills\nUAE driving License "
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}