{
    "Job ID": "4689230",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Responsibilities• Plan and implement the plant maintenance programs with an emphasis on preventive / predictive maintenance. • Analyze and improve key maintenance parameters such as asset utilization, downtime, maintenance cost, compliance with the schedules etc. • Conduct inspection and ensure that there are no breakdowns or disruptions in the production processes. • Plan maintenance and service activities in a way that the process of production does not get affected. • Ensure that SAP is updated for tracking work orders, utilization of spare parts on respective machines, inventory of spare parts, tool record etc. • Ensure that a record of all service, maintenance and refurbishing works carried out on the machinery is available. • Prepares reports, analyzes data, and makes recommendations for improving plant operations and solving maintenance related problems.  • Maintain the Preventative Maintenance system. Complete data based analysis of equipment failures and revise the Preventative Maintenance Program as required to improve safety, optimize uptime and reduce cost. • Reviews the operation of plant equipment and systems constantly, to minimize unplanned downtime, anticipate solve problems in a timely manner, and to identify opportunities for improvement. • Ensure that department is adhering to Quality objectives, GMP's (Good Manufacturing Practices), safety and maintenance policies and procedures. Be ready for the audit at all times with up to date and accurate maintenance and inspection records. • Ensure that all necessary tools are available for the smooth execution of repairing activities. • Maintain a culture where all equipment's / tool are kept in good conditions. • Maintain a comprehensive list of spare parts and ensure that critical spares are readily available to support business needs.  • Implement the safety program for the maintenance department and ensure that technicians are using PPE’s personal protective equipment's. • Lead and coordinate the maintenance team and maintain competencies, motivation and performance to achieve the objective of department. • Prepare plans to maintain a minimum of 25% saudization rate within the department. Implement training programs to retain the local talent. • Provide support and guidance for the maintenance team in their efforts and assist in trouble shooting and problem solving. • Ensures that maintenance technicians are adequately trained, equipped, and motivated so that the maintenance program can be accomplished in a safe, timely, and cost effective manner. • Perform other duties as assigned by Plant Director.Skills",
    "Skills": [
        "Skills:",
        "Knowhow of mechanical, electrical, electronics and chillers function. \nGood knowledge of Microsoft office tools and has an ability to work on maintenance management system. \nGood command on English and have an ability to write effective reports / analysis.\nStrong technical skills, leadership skills, excellent negotiation skills, ability to work under pressure and meet tight deadlines, time management skills, independent thinking, strong organizational and planning abilities, demonstrates initiative, excellent analytical and problem solving skills.\nProfit driven – seeks ways to cut costs and improve efficiency and customer focused."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}