{
    "Job ID": "4689236",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Job Profile:The Manufacturing Manager oversees the ongoing operations and procedures. As a key member of the senior management team, the Manufacturing Manager reports directly to the Chief Executive Officer (CEO) and establishes policies that promote company culture and vision through its operations. The Manufacturing Manager is responsible for the efficiency of the business, which includes maintaining control of diverse business operations and establishing and following a set of policies and processes.By setting comprehensive goals for performance and growth, the Manufacturing Manager leads employees and encourages maximum performance and dedication. The Manufacturing Manager role is a high-visibility position, requiring strong communication skills and the responsibility of being called upon to positively represent the organization in the community and in the media. The Manufacturing Manager must maintain the highest level of integrity and lead by example in all areas.Duties & Responsibilities:·        Provide day-to-day leadership and management·        Responsible for driving the company to achieve and surpass sales, profitability, cash flow and business goals and objectives·        Excellent interpersonal, presentation and public speaking skills, both practiced and impromptu·        Dedication to building and growing a strong and stable workforce·        Ability to comfortably and energetically present the company and its products publicly·        Outstanding organizational and leadership abilities, including the ability to recognize and cultivate rising talent·        High-level understanding of all business functions such as IT, HR, Finance, Marketing, etc.·        Aptitude in sound decision-making and problem-solving in pressure situations·        Collaborate with the leadership team to develop and implement plans for the operational infrastructure of systems, policies, processes, and staff planning.·        Maintain MPS·        Manage hours & capacity·        Maintain health & safety in all workshop areas·        Manage CIP·        Manage 5S·        Reduce boat building hours·        Improve efficiency·        Maintain & improve quality Skills",
    "Skills": [
        "Skills:",
        "Requirements & Skills:",
        "BSc/BA in Business Administration or relevant field; MSc/MBA is a plus\nProven experience as Operations Manager or a similar relevant role\nDemonstrable competency in strategic planning and business development\nUnderstanding of data analysis and performance/operation metrics"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}