{
    "Job ID": "4690469",
    "Description": "Work closely with various risk functions to identify their data needs and emerging information requirements to effectively conduct risk analysis and reporting.\nCoordinate with financial control, IT, Business Units, and subsidiaries to obtain and extract the required data to facilitate timely development of risk reports as per defined reporting plans.\nCoordinate with various functions across Mezzan to collate and reconcile data pertaining to risk while resolving any discrepancies about same to ensure fit for risk reporting in accord with defined quality standards.\nValidate collected data in liaison with financial control, IT, and business functions to ensure mutual agreements and effective capturing of information.\nFollow all relevant ERM policies, processes, standard operating procedures and instructions so that work is carried out in a controlled and consistent manner.\nContribute to the identification of opportunities for continuous improvement of data gathering, reconciliation and validation systems, processes and practices considering ‘international leading practice’, improvement of business processes, cost reduction and productivity improvement.\nAssist in the preparation of timely and accurate ERM statements and reports to meet Mezzan Risk reporting requirements, policies and standards.\nWork with IT and external service providers to streamline the risk data collection process using automated tools and improve the turnaround time for availability of accurate data for the reporting processes.\nSupport in the risk identification, assessment and evaluation processes as well as confirm the risks identified and analyzed with concerned risk owners.\nControl the documentation of all Risk Management registers as per the risk management plan for different departments and divisions.\nSupport the ERM Lead in preparing risk reports based on the updated and approved risk management registers (Risk Registers, Control Registers, KRIs Register etc.).\nPrepare process understanding working papers and draw process maps.\nOrganize the department’s meetings, correspondences with all stakeholders.\nResponsible for all secretarial and administration work of the department.Skills",
    "Skills": [
        "QUALIFICATIONS AND EXPERIENCE",
        "Mandatory: Bachelors’ degree in Accounting or Business Administration.\nBasic level of knowledge of Risk Management and Assessment, Corporate governance.\nDetail Oriented.\nExcellent Communication and Presentation Skills.\nLiterate in MS Office Applications.\n3 years of relevant work experience in Risk Management, Internal Audit, Risk Consulting or Assurance Services"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "FMCG; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}