{
    "Job ID": "4690174",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Transport engineers are responsible for1) Prepare project budgets, schedules, or specifications for labor or materials.2) Supervise the maintenance or repair of transportation systems or system components.3) Participate in contract bidding, negotiation, or administration.4) Evaluate construction project materials for compliance with environmental standards.5) Investigate traffic problems and recommend methods to improve traffic flow or safety.6) Direct the surveying, staking, or laying-out of construction projects.7) Estimate transportation project costs.8) Analyze environmental impact statements for transportation projects.Skills",
    "Skills": [
        "Qualifications:",
        "Knowledge of engineering principles and practices used in the location design, construction and maintenance of all types of highways, bridges and related structures. Knowledge of highway laws, codes, standards and specifications pertaining to highway engineering and costs.\nKnowledge of materials, methods and techniques used in the design, construction and maintenance of highways, bridges and related structures.\nKnowledge of the procedures and practices applied in the inspection and testing of materials used in highway and bridge construction and the design of such materials.\nKnowledge of intelligent transportation and traffic management systems technology and applications.\nKnowledge of traffic operations theory and practice.\nKnowledge of engineering office practices and procedures. Ability to make mathematical computations and design engineering projects"
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}