{
    "Job ID": "4690196",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Description:1. Under the direction of the Intermediate Estimator, calculate various statistical data – quantity take-offs, material price lists, labor costs per man hour, equipment, etc.2. Assist in obtaining scopes of work and pricing from subcontractors and suppliers.3. Assist in closing bids.4. Research historical data (purchase orders, subcontracts, productivity analysis reports, etc.) and compile summary reports to develop guidelines and precedence for future estimates.5. Participate in developing project update and bid package estimate documents.6. Maintain files of working documents for back-up to estimating figures.7. Assist in the monitoring of conceptual estimates with actual cost data.8. Perform additional assignments per supervisor's direction.9. Take-off and measurement of construction works prior to tender.10. Clarify and evaluate tenders.11. Prepare tender and contract documents including bills of quantities and requests for quotations.12. Undertake costs analysis for repair and maintenance of project work.13. Undertake feasibility studies.14. Perform risk and value management and cost control.15. Prepare and analyze costing for tenders.16. Analyze outcomes and write detailed progress reports.17. Value completed work and arrange payments.18. Maintain awareness of the different building contracts in current use.19. Understand the implications of health and safety regulations.20. Manage the resultant contract through monthly valuations, variations control, contract administration and assessment of claims.Skills",
    "Skills": [
        "Skills:",
        "• A good knowledge of construction methods and materials.",
        "• Budget handling skills.",
        "• Excellent IT and math’s skills.",
        "• A methodical approach to work.",
        "• Good organizational skills.",
        "• A clear understanding of Building Regulations and other legal guidelines.",
        "• Excellent communication and negotiating skills.",
        "• The ability to work as part of a team.",
        "• High level of organizational skills.",
        "• Ability to calculate mathematical extensions, read and understand engineering drawings, purchase orders, contracts, cost coding systems, and material pricing required.",
        "• Ability to assume responsibility and to interface and communicate effectively with others, have strong interpersonal skills and be self-motivated.",
        "• Enthusiasm for challenge and new initiatives are prerequisites."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}