{
    "Job ID": "4690198",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Boilermaker Duties & ResponsibilitiesThis job requires candidates to be able to perform duties that include the following:Install premade boilers into manufacturing facilities and other buildings\nRead and understand blueprints for the location, position, and dimension of boiler parts\nComplete job work orders and other needed maintenance documentation\nOrganize and arrange pre-made boiler parts before assembly\nIdentify all of the necessary tools required for tasks\nAssemble boiler tanks that often involves automatic or robotic welding\nUse scrapers, cleaning solvents and wire brushed to clean vats\nInspect and perform tests on boiler systems to find any defects or leaksSkills",
    "Skills": [
        "Boilermaker Skills & Competencies",
        "You will acquire the hard skills that allow you to do your job through your formal training, but boilermakers also need certain soft skills, or personal qualities. They are:",
        "Mechanical skills: Boilermakers must use and maintain many types of equipment, such as welding machines and hoists.\nUnafraid of heights or confined spaces: Boilermakers often work inside a vat or boiler, and must be able to handle working in tanks at any height, such as water storage tanks that may be several stories above the ground.\nPhysical strength and stamina: You must be able to lift heavy equipment and spend many hours on your feet.\nTroubleshooting: The ability to correctly diagnose and then fix problems is essential.\nCritical Thinking: Boilermakers must weigh various solutions to problems and then predict which one will be most effective.\nReading comprehension: You must be able to understand written documentation."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}