{
    "Job ID": "4690171",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Responsibilities:To provide professional and technical excellence in highway engineeringIdentify, prepare, design, plan, programme and order works and services.Prepare and assist in the management and monitoring of works programmes or services.Provide timely and accurate advice to Councillors, Parish Councils and the general public on all highway-related matters as required.Liaising as required directly with Elected Members, District Councils, and stakeholders and other providers to manage the implementation of allocated programs of workAssist with the management and provision of technical support for staff dealing with all aspects of the service.Provide assistance to the functional leader or Senior Engineer in relation to all aspects covered within the Team and deputise in their absence.Preparation of reports for projects and attend meetings to provide support as appropriate.Skills",
    "Skills": [
        "Desirable to have an Incorporated Engineer/Technician Engineer.",
        "Qualified to carry out the role of Road Safety Team Leader as per the DMRB requirements.",
        "Essential to have HNC/NVQ4 or equivalent in relevant disciplineMembership of or working towards membership of a relevant Professional Institution.",
        "Evidence of continuous professional development.",
        "Knowledge of ICE and ECC contracts and their applications.",
        "Good knowledge of and application of Health and Safety legislation knowledge of and application of Highway Legislation, relevant design procedures and standards, and good practice."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Recruitment Agency",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}