{
    "Job ID": "4690131",
    "Description": "Job Purpose: Maintains and coordinates all the components and aspects of the (MIS) to support the computing needs. This includes servers, data archive and storage, databases, middleware, network, and messaging systems, as well as applications and systems which directly support the end-user computing environment.Key Responsibilities ·     Troubleshoots all Technology issues that are covering Software, Hardware and Network Operating Systems. ·     Plans, Organizes, Controls and evaluates the operations of the branch Management Information Systems (MIS). ·     Controls the branch IT infrastructure budgets and expenditures. ·     Monitors security of all IT hardware and software components. ·     Maintains logs for all required repairs and maintenance. ·     Maintains proper records for all applications and systems installation, upgrade and or disposal as the case may be. ·     Monitors and maintains the branch IT infrastructure to ensure end-users maximum access. ·     Responsible for managing all project aspects. ·     Conducts project activities according to the approved project plan and within scope, quality, time and budget constraints. · Sets up and manages the project team and arranges for training where necessary. ·     Works closely with internal /Bank-HO Units and vendors and provides administrative services. ·     Resolves conflicts and manages the project risks.Skills",
    "Skills": [
        "1.    Requirement open for Kuwaiti national.",
        "2. Bachelor's in Computer Science, Programming, or related field.",
        "3.    Min. 7 years of experience in IT.",
        "4.   Preferred candidates from banking background with main specialty in Infrastructure.  ",
        "5. familiar with all hardware, software and network operating systems of the branch computing platforms."
    ],
    "Preferred": {
        "Nationality": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency; Banking",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}