{
    "Job ID": "4690294",
    "Description": "Position Overview:The successful candidate will be responsible for promoting and selling a range of banking products to customers, including credit cards, mortgage loans, personal finance solutions, auto lease options, insurance products, etc.Responsibilities:Identify and target potential customers through various channels, including referrals, leads, and cold calling.\nEngage with customers to understand their financial needs and provide suitable banking solutions, including credit cards, mortgage loans, personal finance options, auto lease plans, and insurance products, etc.\nActively promote and sell banking products, explaining features, benefits, and terms to customers.\nGenerate leads and convert them into sales by delivering persuasive sales pitches and overcoming objections.\nDevelop and maintain a strong knowledge of the bank's products and services, as well as industry trends and competitor offerings.\nConduct thorough customer needs assessments to offer personalized recommendations and optimize cross-selling opportunities.\nBuild and maintain strong relationships with customers to enhance customer loyalty and increase referral business.\nAchieve individual sales targets and contribute to the overall sales goals of the organization.\nEnsure compliance with all banking regulations and internal policies throughout the sales process.\nKeep accurate and up-to-date records of customer interactions, sales activities, and pipeline management.\nCollaborate with other teams, such as customer service and product development, to provide feedback and improve the customer experience.\nContinuously update knowledge of banking industry trends, products, and competitive landscape to position and differentiate our offerings effectively.Skills",
    "Skills": [
        "We seek a highly motivated and results-oriented Direct Sales Agent with a minimum of 1 year of experience in the banking and financial services industry.",
        "Minimum of 1 year of direct sales experience in the banking and financial services industry.\nProven track record of meeting or exceeding sales targets in a similar role.\nStrong knowledge of banking products, including credit cards, mortgage loans, personal finance solutions, auto lease plans, and insurance products.\nExcellent interpersonal and communication skills, with the ability to engage and build rapport with customers.\nDemonstrated ability to understand customer needs and provide appropriate solutions.\nSelf-motivated and driven to achieve individual and team sales targets.\nKnowledge of banking regulations and compliance requirements.\nAbility to work independently as well as collaboratively in a team environment.\nA high level of professionalism, integrity, and ethical behavior.\nThis role requires excellent communication skills, a deep understanding of the banking sector, and a proven track record in sales."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Dammam, Saudi Arabia ; Jeddah , Saudi Arabia ; Khobar, Saudi Arabia ; Riyadh, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}