{
    "Job ID": "4691322",
    "Description": "Scope of Work• Respond quickly to maintenance and troubleshooting requests.• Complete assigned work at the highest possible level of quality and in a timely manner.• Coordinate with end-user to schedule equipment maintenance and other services.• Confer with lab equipment operators/manufacturers/agents to identify and diagnose problems and implement appropriate solutions.• Coordinate with off-site and on-site, local and international, technical teams/specialists, vendors, etc. when ensuring the proper repair and alignment of equipment.• Identifies required spare parts and facilitates the ordering process.• Timely completion of service reports for all maintenance performed.• Provide sufficiently detailed and regular communications to end-users.• Maintain Field Service Reports to record all service-related activities.• Participate in professional development training, seminars, and other activities to remain at a highly competent level of expertise on assigned equipment.• Instruct end users on preventative equipment maintenance strategies and proper instrument use.• Provide occasional value-added user training sessions on assigned equipment within the expertise.• Comply with all HSE safety policies, practices, and procedures at all times.• Work closely and productively with the Lab Equipment Maintenance Leads in a professional manner to define and complete any additional objectives.Skills",
    "Skills": [
        "Qualifications",
        "• Bachelor’s degree in mechanical engineering or related field.",
        "Experience",
        "• Experience in maintaining refrigeration equipment in the Labs, using maintenance reporting systems. ",
        "• Minimum 3 years experience working as a field service engineer or equivalent repairing and maintaining lab equipment for one or more of the following manufacturers: Agilent, Angstrom, APC, Bruker, Coherent, Horiba, Instron, Lakeshore, Leica, Mbraun, Newport, PerkinElmer, Retch, Shimadzu, TA Instruments, Thermo-Fisher, Veeco, and Zeiss.",
        "• Field service experience with other major manufacturers of physical technologies instrumentation is preferred.",
        "• Experience using a computerized maintenance management system (CMMS), such as SAP, Maximo, or Zoho.",
        "• Understands the impact of CMMS data on operational KPIs",
        "• Ability to work extended hours (as needed)."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}