{
    "Job ID": "4691366",
    "Description": "* Build new relationships with potential clients from travel agents, online communities, media, corporate segment, and public relations channels.* Make budgets, pricings, packages and other activities / offers to drive meet revenue goals.* Strategize and lead the sales efforts, campaigns and activities to achieve the committed revenue objectives / targets.* Develop sales materials, conduct personal marketing and promotional visits to potential clients.* Translate marketplace needs into integrated offerings across all platforms* Work as an effective cross-functional partner with various internal and external stakeholders including digital operation, brand marketing, editorial, team, etc.* Participate in relevant trade shows, industry meetings, and organize, execute roadshows.* Leads creative briefing sessions, material development and overall promotional presence for assigned business units.* Monitors competitive factors in order to capitalize upon market opportunities, minimize the effects of competitive activity and deliver effective messaging within the marketplace.* Ensures that sales efforts are progressing and meeting goals, targets, etc.* Create and package integrated proposals, including custom creative and branded programs* Maintain high level of Customer Relationship Management* Perform related duties and responsibilities as required.Skills",
    "Skills": [
        "* Ability for developing new and innovative businesses.",
        "* Professionalism in establishing selective selling techniques.",
        "* Strong negotiation skills.",
        "* Ability to work in a fast-paced work environment and have excellent written and verbal communication skills, as well as interpersonal skills.",
        "* Has an interest in the evolving media and technology landscapes, with a passion for the latest and greatest innovative solutions",
        "* Well organized and detail oriented with the ability to prioritize and handle multiple assignments and be willing to get involved in projects with varying degrees of difficulty.",
        "* Willingness to work as an individual and in a group.",
        "* Must have a strong desire for tourism sales with focus on career and industry growth.",
        "* Must establish and maintain effective working relationships with partners and clients.",
        "* Ability to make verbal and virtual presentations to groups of various sizes and cultures.",
        "* Ability to work independently, exercising good judgment, and initiative.",
        "* Ability to make decisions intelligently and confidently",
        "* Ability to prepare appropriate reports, correspondence, memoranda, agreements and budget projections in a highly professional manner.",
        "* Ability to project and recognize potential problems and implement corrective actions.",
        "* Provides the highest customer service excellence."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}