{
    "Job ID": "4691348",
    "Description": "COLLECTING POOL OF CANDIDATES FOR OUR UPCOMING PROJECTS IN IRAQ!Duties and Responsibilities:Interacts with other departments when necessary to provide additional or specialized services for functions, promotions and festivities. \nCarries out repairs and maintenance of domestic hot/cold water system, cooling water systems, storm and sanitary sewer system, irrigation and fountain water systems and swimming pools. \nAttends to repairs or replacement of all bathroom/toilet fixtures in guestrooms, public areas and back of the house areas. \nCarries out fan coil unit services in guestrooms, shops, public areas and offices. \nCleans all manholes, clearing sewage and storing water line blockages using snake machine or other means as required. \nRepairing and maintaining functional parts of mechanical equipment and machinery, such as pumps, compressors etc. \nAttends to all types of repair and maintenance work on site, including emergency response and planned activities.\nResponding to a maintenance request within the contractual service level agreement. \nEnsures that the plant room, workshop and related areas are kept clean and tidy condition. \nObserves prescribed safety standards. Helps maintain safe conditions for self and others. \nOther duties as required. Required to work hours to meet operational needs..Skills",
    "Skills": [
        "Skills:",
        "Essential Experience:",
        "Working within engineering or similar environment.\nExcellent customer service skills.",
        "Desirable:",
        "Knowledge of materials, methods, and the tools involved in the repair of industrial machinery and equipment or other technical issues.\nKnowledge of principles and processes for providing customer and personal services. This includes customer needs assessment, meeting quality standards for services, and evaluation of customer satisfaction."
    ],
    "Preferred": {
        "Residence Location": "Iraq",
        "Nationality": "Iraq"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}