{
    "Job ID": "4691788",
    "Description": "Electrical Technical Office Engineer (copy)Purpose of the Job:To provide technical support and assistance with earthing designs, reports and analysis.Responsibilities:Customer and/or site visits to discuss project scope of work. Agree deliverables and offer general technical advice relating to power and lightning earthing design systems.\nCarry out soil resistivity and earth measuring tests as described in BS7430. Report and make necessary recommendations on findings.\nCarry out full system fall of potential testing to verify/validate design intent.\nUnderstanding and working compliance with relevant earthing standards.\nProduce power earthing and lightning protection earthing designs, reports and analysis to clients’ specification, relevant and applicable standards or codes of practice.\nCompile a bill of quantity for the materials, to enable the Sales department to forward a comprehensive quotation to the client.\nRespond to client’s queries in a clear and precise manner covering technical knowledge with confidence.\nLiaise with marketing department to support and promote relevant earthing technical literature.Skills",
    "Skills": [
        "Education:",
        "Very good grade in in Electrical Engineering",
        "Skills:",
        "A comprehensive working knowledge of power/lightning earthing designs and analysis\nA working knowledge and compliance to current relevant standards BS EN 50522, BS7430, EA TS 41-24, IEEE Std80\nAuto-CAD & basic 2D drawing knowledge and experience essential.\nGood verbal and written communication skills required\nAdobe & MS office applications to suit the business need\nExperience: 3+ years with proven record of success.\nPreferably experienced in grounding systems\nVery Good command of English.\nGiza Residents are preferred."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 6",
        "Nationality": "Egypt"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Electrical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}