{
    "Job ID": "4692024",
    "Description": "The sales representative will be responsible for generating sales and sales opportunities via managing current customers and acquiring new customers from the market or walk-in (if positioned in the showroom).\nThey may be responsible to handle Gov’t/Institutional accounts as per the current customer assignment by direct management.\nThey will be responsible to meet with customers regularly, responding to their queries in a timely manner, and liaising with department management on pricing/availability and other commercial factors.\nThey will be responsible to ensure that their customer account/transactions are carried out to the satisfaction of the customer and internal controls/processes, which includes D&I, payment follow-up, and other related processes.\nThey must endeavor to increase the sales of extended warranties, maximize ASP, and negate returns.\nThey will be responsible to report regularly on their sales performance, potential sales, and customer acquisition/opportunity acquisition efforts + any other reporting requirement requested by the direct manager.\nDuty timing: standard 8 hours, 5 days/weekSkills",
    "Skills": [
        "Experience ",
        "Direct experience min 5 years in corporate sales in IT product/Services, or similar industries.\nIn-direct experience min 7 years in the same field.\nPast experience working with government, banking, the oil sector & system integrators is a major PLUS\nShould have a working knowledge of corporate sales processes & electronics products (multiple categories / digital & non-digital)\nShould have working knowledge of procurement processes for projects & tenders.",
        "Required skillset",
        "Excellent English Communication, Arabic language will be an advantage.\nGood command of PC technical skills (MS Office …etc)\nAbility to demonstrate good interpersonal communication & negotiation skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait",
        "Gender": "Female",
        "Degree": "Certification / diploma",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}