{
    "Job ID": "4692002",
    "Description": "Administers established policies, plans and programs as set forth by the company.  \nRecommends appropriate changes to existing policies, plans and programs to Senior Management for review and future action.  \nMaintains awareness of Company policies and ensures that all plant staff personnel understand and adhere to these policies and programs.  \nPays particular attention to the following:  Job descriptions for all positions are available, up to date and communicated to position holder.  \nPerformance plans are set at the beginning of fiscal year and performance evaluations are done at the end of the fiscal year.  \nSalary administration policy is adhered to.  \nMan-power plans, back up programs and Saudization program are reviewed and up to date.  \nSafety and housekeeping programs are active and receive adequate attention.  \nAdminister the plant safety, health and quality policy with respect to the blow molding department. Enforce the plant electrical lockout policy within the department. \nCost reduction and ideas programs are on-going practice and are recognized.  \nTraining and development plans for staff outlined in performance plans are executed and results are tracked and reflected as improved performance.   Ensures that department assets are properly managed and safe guarded.   \nEnsure that all products are produced in accordance with company manufacturing and quality standards. \nEnsures that all personnel records/profiles are properly maintained, up to date and safeguarded.   Establishes with plant staff facility's operational goals and objectives for each budget year. SMART and challenging goals shall focus on, but not limited to, the following areas using adequate performance indicators:   \nProductivity  \nProduct and Service Quality  \nSafety and Housekeeping  \nMaterial usage and Loss Control  \nInventory Levels (Raw / Finished Stocks)  \nOn time Deliveries  \nUnit Cost  \nCost Savings  \nOther objectives as directed  Monitors delivered results in areas mentioned above and initiates corrective actions as required.  \nCarries out periodical capacity study to ensure plant capability to handle production requirements and recommend necessary capital expenditure.  \nSolve Technical equipment problems with the aid of in-house or out-side resources.   \nReviews and approves the blow molding operation goals. \nFollowing up and monitoring the machine productivity and discussed if there is any variance with respect to the goals. \nGives solutions and suggestion for any technical problems related to productivity, as required. \nContinues improving for all molding functions that can positively reflected on the operation \nEnforces implementing materials conservation program and maintaining it to keep continuous going. \nMonitors the materials usages on monthly bases, reporting to the plants managers and recommend for usages improvements. \nResearch and studies on optimizing the material usages to lead for the lowest cost without affecting the production quality. \nHandles any the new related molding projects. \nProvide studies of any required development on the product / operation to the Assistant Production Manager.  \nEvaluates and study proposed molding project. \nExecutes and follow up on any molding project. \nWorks with machine operators to maintain machine performance. \nDevelop a production schedule and reviews weekly while managing cost, efficiency and quality. \nManages stocks of raw material and finished goods. \nManages the preventive maintenance program. Keeps logs updated and checked. \nWorks with packing line, bottle and cap suppliers to fulfill production requirements. \nConduct all trail and tests for product supply. \nOrders and designs Molds and fixtures. \nManages auxiliary equipment. \nRecords and follows all key performance indicators set by management Formulates and submits the department operating and capital budgets as directed by the Assistant Production Manager.    \nExecutes the approved budget and reports variances as required.  \nExecutes capital projects within approved budget cost and time frame.   \nMonitors operational expenses, materials usage and Losses and overall unit cost to insure efficient resources utilization and to initiate corrective actions as required.  \nRecommends disposal of overage, obsolete, bad stock (raw or finished goods) and equipment to Assistant Production Manager.  \nInvestigates and reports to Molding Manager any significant operating budgetary problems and corrective action taken or proposed.  \nSubmits monthly reports to the Molding Manager detailing all department operational activities during the month.  \nEnsures that all end of the month information required by F&A is accurate and submitted on time.  \nProvides manufacturing feasibility study support as required.  \nPerforms other duties as required.  Skills",
    "Skills": [
        "Years and Type of Experience:",
        "5-10 years’ experience of plastics Blow / Injection Molding experience in plant operations  \nLeadership and managerial experience \nAdequate knowledge of business and management principles (budgeting, strategic planning, resource allocation and human resources) \nFamiliarity with industry standard equipment and technical expertise \nPlastics process engineering background is a plus.   \nStrong trouble shooting of electrical, mechanical, pneumatic electronic and hydraulic systems. ",
        "Education Level/ Degree:",
        "Bachelor’s degree in Mechanical Engineering, Manufacturing Engineering, Industrial Technology preferred ",
        "Other Skills & Languages Required:  ",
        "Languages Required:  ",
        "English and Arabic  ",
        "Skills and Competencies:",
        "Strong Leadership Skills   \nTeamwork and communication skills \nOperation of manufacturing process equipment  \nAbility to follow directions.  \nAdherence to health and safety regulations  \nAbility to read blueprints, schematics, and manuals. \nAnalytical skills \nAttention to detail. \nAbility to quickly learn production equipment. \nInterpersonal Skills \nBasic Computer skills "
    ],
    "Preferred": {
        "Residence Location": "Jeddah , Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Chemicals Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}