{
    "Job ID": "4692133",
    "Description": "To implement corrective, planned preventive and predicted maintenance of Instruments and Automation PLC systems installed in the plant.\nTo analyze instruments / PLC’s operating problems and to find proper solution and to implement to avoid repeated breakdowns\nTo achieve 97% of machine utilization by minimizing breakdowns and to ensure KIMMCO quality assurance system requirement.\nRoutine checking of running equipments in the plant and monitoring PLC, supervisory and HMI system performance.\nPerform expansion projects automation system & modification works as per the plans and schedules.\nTrouble shooting of PLC related equipment breakdowns.\nPerform modifications on Supervisory, HMI and on PLC systems as per process requirements.\nReport log book with 100% accuracy for all observations, breakdowns and action taken with full details, work achieved or in progress and suggestions to improve the efficiency of the equipments\nMaintain latest PLC, HMI and Supervisory software’s\nMaintain minimum spare parts required for PLC and HMI systems.\nPerform updating & familiarizing drawings according to the modifications made.\nAttend all breakdown calls within an hour after working hours and during holidays.\nEnsure safe working at all times with necessary guidelines.Skills",
    "Skills": [
        "Systems Thinking: Ability to understand complex systems and their interdependencies, considering both technical and non-technical aspects to develop holistic solutions.\nTechnical Expertise: In-depth knowledge of systems engineering principles, methodologies, and best practices. Familiarity with relevant technologies, tools, and frameworks.\nRequirements Analysis: Proficiency in eliciting, documenting, analyzing, and managing system requirements. Skillful at translating user needs into technical specifications.\nSystem Design: Capability to design and architect systems, considering functionality, performance, scalability, reliability, and security requirements.\nProblem-Solving: Strong analytical and problem-solving skills to identify and resolve technical challenges throughout the system development lifecycle.\nCollaboration and Communication: Effective interpersonal and communication skills to collaborate with cross-functional teams, stakeholders, and clients. Ability to articulate technical concepts to non-technical audiences."
    ],
    "Preferred": {
        "Age": "Min: 29 Max: 48"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}