{
    "Job ID": "4693829",
    "Description": "On behalf of a global Fast Food chain, we are hiring a Buyer.Based in Riyadh, and reporting to Procurement Manager you will handle Purchasing quality products & services for the IT, Marketing, Online Delivery, and Operations Departments, including processing purchase orders and contract agreements, and negotiating with suppliers and contractors for the best prices and purchase terms and tracking orders.Handling the procurement of materials & services for the IT, Marketing, online Delivery, and Operations Departments.\nReceiving the Purchase Requisition from the User Departments and discussing with them to ensure a full understanding of the requirements.\nSearching for suitable vendors.\nSending RFQs or RFPs.\nNegotiating the deal with vendors.\nCrafting purchase order.\nWorking within the management team to ensure that all deliveries satisfy the project objectives. Providing a regular report for the management on the status of orders.\nLiaise for transport of goods and track orders to ensure timely delivery.\nCoordinate with materials/services receivers to assess the quality and escalate any discrepancies to suppliers and management.\nAssisting the User Departments, and the A&I team in regularly maintaining inventory levels.\nBudget forecast.\nWork with Procurement Manager for Spend Analysis.\nConducting market surveys and providing advice about market trends and alternatives.Skills",
    "Skills": [
        "3 to 5 years experience in Procurement.\nBachelors in Business Administration, Procurement, or Supply Chain Management.\nBusiness & Financial Acumen.\nSolid analytical and computer skills.\nExcellent knowledge of Microsoft Office.\nExperience in ERP systems.\nResult Driven.\nProblem-Solving Skills. Communication and Presentation Skills."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 3 Max: 6",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale; Catering, Food Service, & Restaurant; FMCG",
        "Company Type": "Recruitment Agency",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}