{
    "Job ID": "4693616",
    "Description": "Position Title:             Sales EngineerEmployment Type:     Full TimeSalary:                        up to 12K AED depending on experience and qualifications, plus car allowance and other benefitsJob Location:            Dubai, UAEAbout the Client:One of the leading suppliers of HVAC products and solutions across the globeJob Description:Develop strong relationships with consultants, developers, and owners, uphold company's reputation as the preferred supplier, and generate inquiries through market visits while ensuring continuous follow-up on Pipeline projects.\nProvide comprehensive sales support and documentation, including creating quotations, technical management, finalizing orders, generating invoices, coordinating delivery, payment collections, coordinating warranties, and prompt issue resolution with technical assistance from other teams.\nOffer extensive product and application support to potential customers, including regular updates on software, catalogs, and company information, along with conducting seminars for commercial and industrial market consultants and decision-makers.\nAssess credit requirements and seek approvals from the credit management team.\nSubmit reports, adhere to the company's code of ethics and online trainings, and boost product promotion by creating promotional tools like seminars and printed/electronic materials.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's Degree in Mechanical Engineering is a must\nMinimum 2 years sales experience from HVAC sector (air handling units) in UAE\nTechnical knowledge in ventilation systems, Fans, AHU and FCU is a must\nArabic speaker is a must"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Arab Countries; All GCC Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Mechanical Engineering; General Engineering Consultancy",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}