{
    "Job ID": "4693554",
    "Description": "Understand & follow work rules:· Follow attendance rules.\n· Follow all safety standards and enforce them on subordinates.\n· Follow quality standards and ensure product to be within standardSafety & housekeeping:· Wear all required Personal protective equipment. ·\nOperate machine withing safety standards (do not touch equipment while operating, ensure safety guards installed in mechanical parts of the machine)\n· Apply LOTO when preforming maintenance task in machine.\n· Ensure area of responsibility to be in good housekeeping condition and follow 6S principlesOperation:· Maintains, operates, troubleshoots, and adjusts all assigned equipment.\n· Performs bottle quality checks as directed.\n· Assists the foreman in maintaining product output according to current manufacturing procedure and specifications. · Oversees the work of the crew during the foreman’s absence.\n· Completes reports, work orders, and maintains records as directed by the shift foreman.\n· Assists in inventory of materials and empty ware.\n· Trains other blow moulding personnel when required.\n· Maintains his work area in a clean and orderly condition.\n· Understands and follows all plant safety, work, and attendance rules, and enforces same when he is acting foreman.\n· Assist shift foreman in controlling spare parts availability.\n· Technical support in the implementation of qualification and validation\n· Participation in the implementation of improvement measures\n· Submit a written report of his assignments accomplished on daily basis.\n· Understands quality bottles inspection and Solves quality problems.\n· Maintains B/M machines and case erector.\n· Repairs machines Minor trouble shooting\n· PC literature to record the quality sheet.\n· Performs other duties as assigned.Skills",
    "Skills": [
        "Years and Type of Experience:",
        "1- 2 years in Blow molding and injection plastic operation",
        "Education Level/ Degree:",
        "High school degree or Technical diploma (mechanical is preferable)",
        "Other Skills & Languages Required:  ",
        "Other Languages Required: ",
        "English is preferable",
        "Technical Skills and competencies: ",
        "sense of troubleshooting root cause if issue causing quality defect, basic knowledge & skill of using tools",
        "Behavioral Skills and competencies:",
        "· Teamwork and communication skills",
        "· Operation of manufacturing process equipment",
        "· Ability to follow directions.",
        "· Adherence to health and safety regulations",
        "· Ability to read blueprints, schematics, and manuals.",
        "· Analytical skills",
        "· Attention to detail.",
        "· Ability to quickly learn production equipment.",
        "· Interpersonal Skills"
    ],
    "Preferred": {
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}