{
    "Job ID": "4693893",
    "Description": "Study similar brand campaigns and research target markets\nAnalyze and stay on top of current marketing trends\nCreate, present, and enact marketing ideas to meet all brand objectives\nWork closely with the marketing Manager to assist in leading campaigns\nEnsure the coordination of the sales team, the development team, and any other involved teams\nKeep a close eye on budgeting to increase profit while reducing costs\nAnalyze campaigns using performance metrics and prepare reports for executives and stakeholders\nassist in the annual marketing budget which set by the marketing Manager by presenting monthly reports shows the expenses & the ROI on each & every marketing investment.\nMonitor Market Trends and Seek Consumer FeedbackSkills",
    "Skills": [
        "Strong research and analytical skills: These skills will enable the candidate to identify trends and challenges as well as make informed forecasts about market trends and other implications from the data review. \nExemplary time management and organizational skills: Ability to work on several projects and deliver results before the deadline is essential.\nExcellent communication and interpersonal skills: Written and verbal communication are essential to ensure collaboration and cooperation within various departments in the development of brand strategies. \nTeam player: Candidates will be required to work with various departments to ensure cohesion in the marketing efforts throughout the industry. \nExcellent customer service skills: Assistant Brand Managers frequently interact with clients for feedback which is then used to improve marketing strategies, product pricing, and other aspects. ",
        "Requirements:",
        "BSc degree (Commerce – Marketing – Business administration – Mass communication)\nSpecial certificate in Marketing is a must.\n3 – 10 years of experience in the marketing field (not ADVERTISING background).\nAge: 25 - 35\nExperience in FMCG"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 15",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 23 Max: 38"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}