{
    "Job ID": "4693519",
    "Description": "AUTHORITY LEVEL: S.A1. SENIOR AUTHORIZED FROM SAUDI ELECTRICITY COMPANY (SEC).Job Responsibilities:•        To monitor and observe the work activity ensuring contractors are performing the work as per schedule and plan and•        To operate and confirm RMU Outage as per plan to the contractor for smooth execution of work replacement of DAS RMU.•        To prepare schedule and writing program in SAP system for prior approval of Control center.•        To enforce the contractor to expedite the work when lack of progress is observed•        Review and approve any Technical Query rose by the contractor•        Work in coordination with the contractor to ensure smooth installation activities such as excavation, cable laying. transformers, sub-station, stand by Diesel Generator and all other electrical equipment’s installation•        Perform site acceptance test SAT & pre energized test to RMU equipment upon arrival to site and prior to installation and perform the required materials inspection at site.•        Report all work progress to site manager and project planner on a daily basis ensuring contractor is comply to project schedule•        Carry out all required inspections submitted by the contractor prior to an installation is done, like Testing and commissioning of substation Equipment's like: SF6 Gas low, motor fail, door open, battery low, EFI, A.C power fail, D.C power fail, RTU self-diagnostic, Circuit Breaker, Disconnector/Isolator, Cable Schedule and insulation Checking, Control Scheme checking & Execution, Protection Scheme checking & Execution, Interlock Scheme checking & commissioning Monitor and observe all equipment installation and erection.•        General and specific supervision to contractor to ensure works are complying with project specification, procedures and drawing•        Review final as-built drawings and record any deviation from the actual approved drawings prior to submit the drawings to SECO•        Attend follow-up construction meetings and daily meetings through WEBEX online.Skills",
    "Skills": [
        "Academic Qualification:",
        "1-     Bachelor's degree in Electrical Engineering",
        "2-     PMP Certificate is plus.",
        "3-     Experience in the same field..",
        ".Electrical Project Manager/ +5 years' experience",
        "2- Cost Oriented.",
        "3- Problem-solving and research skills. ",
        "4- Proactive & strategic thinking. ",
        "5- Good communication skills is a must.",
        "6- Working under pressure."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Albaha, Saudi Arabia",
        "Company Industry": "Electrical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}