{
    "Job ID": "4693676",
    "Description": "Develop / update, improve and implement plans, procedures, standards and systems for all the planning, scheduling and reporting related tasks Prepare and maintain project work break down structure and integrated master schedule for the Project Prepare and maintain consistent progress measurement system within the ProjectSupport in identifying, developing, and improving plans, procedures, standards and systems for the Planning department Support in developing / updating and implementing appropriate KPIs for the Project Analyze and report on the Consultant’s and Contractor’s schedules and progress reports Perform critical path analysis of schedules Prepare independent risk analysis of Consultant’s and Contractor’s SchedulesPrepare, coordinate, and update the Project Risk Register Ensure that the approved Baseline Schedule is followed by all the entities involved Prepare reports to the senior management pertaining to schedules Analyze and report on the Consultant’s and Contractor’s Extension of Time ClaimsPrepare the Project status reports (monthly, weekly, daily, and ad hoc) and any other requested relevant reportsReview, assess, and comment on the Contractor’s and Consultant’s relevant reports.Continuous monitoring and assessment to the Project cost and time and provide early warnings and recommended actions whenever a deviation to the Project cost and/or time is forecasted. Work with the members of the team and the other departments to make sure schedule obligations are met within order to complete the Project on time. Review, analyze, evaluate, and provide recommendations regarding Contractor’s and Consultant’s claims.Assist the project Manager and other members of the team in preparing or providing input for project related written communication (e.g. correspondences, reports)  Attend Project meetings as required. Organize and lead meetings with Stakeholders pertaining to schedules and Planning, and prepare meeting records.The establishment of collaborative electronic enabled tools for working efficiently with consultants, contractors and other external agencies Support in establishing tools and systems that allow lessons learned to be captured from constructing projects, and use this intelligence to alter the process, tools and systems in order to improve the approach to deliver the upcoming projectsSkills",
    "Skills": [
        "BSc degree in the Civil Engineering discipline. Preferably with a 2-year post graduate degree in engineering management / management and a PgMP or PMP certification.",
        "15 years of directly related experience in planning and scheduling both engineering and construction activities with 7 years of experience in a managerial role.",
        "Experience on design and construction of large scale building projects including Super Rise Towers.",
        "Proven ability to perform management role. Excellent written and oral communication",
        "Ability to communicate clearly.",
        "Conduct presentations to management, and interface effectively with a diverse group of professionals.",
        "Proficiency in scheduling software including Primavera P6.2, Claim Digger, Schedule Analyser and other presentation software like MS Office, Visio, Crystal Reports etc",
        "Thorough knowledge of industry practices and regulations.",
        "Knowledge of current technology and its effective use on the project."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}