{
    "Job ID": "4694309",
    "Description": "• إنشاء خطة العلاقات العامة بما في ذلك الاستراتيجية والأهداف والميزانية والتكتيكات\n• وضع استراتيجية العلاقات الإعلامية ، والبحث عن مواضع رفيعة المستوى في وسائل الإعلام المطبوعة والمسموعة وعبر الإنترنت\n• تنسيق جميع أنشطة العلاقات العامة\n• توجيه فريق وسائل الإعلام الاجتماعية لإشراك الجماهير عبر وسائل الإعلام التقليدية والجديدة\n• الاستفادة من العلاقات الإعلامية الحالية وزراعة اتصالات جديدة داخل وسائل الإعلام التجارية والصناعية\n• إدارة الاستفسارات الإعلامية وطلبات المقابلة\n• إنشاء محتوى للبيانات الصحفية والمقالات الثانوية والعروض التقديمية الرئيسية\n• مراقبة وتحليل وإبلاغ نتائج العلاقات العامة على أساس ربع سنوي\n• تقييم فرص الشراكات والرعاية والإعلان على أساس مستمر.\n• بناء علاقات مع قادة الفكر لتنمية الوعي الصناعي\n• الحفاظ على فهم عميق لاتجاهات الصناعة التي تؤثر على العملاء وتقديم التوصيات المناسبة فيما يتعلق باستراتيجية الاتصال المحيطة بهم\n• إدارة دورة الميزانية لقسم العلاقات العامة وتقديم مدخلات لعملية وضع الميزانية\n• إدارة قسم العلاقات العامة بشكل فعال ضمن الميزانية ، وتقديم تقرير دقيق عن التقدم المحرز والتحديات التي تمت مواجهتها\n• صياغة المبادرات التي ينتج عنها أثر مالي إيجابي لقسم العلاقات العامة وتخفيف المخاطر المالية والتشغيلية\n• الإشراف على تنفيذ سياسات وإجراءات الإدارة وضوابطها التي تغطي جوانب الأنشطة كافة؛ لاستيفاء المتطلبات الإجرائية/التشريعية ذات الصلة، مع العمل على المخرجات ذات الجودة العالية\n• قيادة إدارة التغيير وتوجيهها عن طريق التحسين المستمر لأنظمة الادارة وعملياته وممارساته، مع الأخذ في الحسبان الممارسات الرائدة، وتغيُرات المعايير الدولية وبيئات الأعمال التي تشترط خطط الأعمال الإستباقية\n• الرقابة على الأنشطة اليومية؛ لضمان الامتثال للسياسات والإجراءات المنصوص عليها\n• التأكد من دعم عمليات الإدارة وخدماتها بالوثائق المطلوبة لضمان تلبية متطلبات العمل\n• الإِشراف على وضع اتفاقيات مستوى الخدمة، وتنفيذها مع إدارات الماجد للعود الآخرى  Skills",
    "Skills": [
        "• المساهمة في غرس ثقافة تطور الأداء والتوجيه في إدارة التسويق الرقمي و ادارة الاداء\n• توجيه فريق ادارة التسويق الرقمي ومراقبته وتطويره؛ وتمكينه من تولي مسؤوليات أكبر وأكثر تعقيداً\n• استكشاف المواهب البارزة وتقييمها وتوظيفها في إدارة التسويق الرقمي  \n• التواصل الفعال مع جميع الموظفين\n• وضع أهداف لتقييم الأداء وتقديم الدعم اللازم والتقارير المنتظمة حول الأداء\n• خلق بيئة عمل ذات أداء ممتاز وتعزيز قِيم الماجد للعود"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}