{
    "Job ID": "4694855",
    "Description": "1.     مراجعة مستندات التعاقد مع بعضها البعض فى بداية المشروع خاصة وانه غالبا ما يوجد تعارض بين اللوحات الانشائية والمعمارية المستلمة من قبل الاستشارى ومحاولة مطابقتهم او تصحيح الخطأ منهم وهذه خطوة فى غاية الاهمية وكم سببت من كوارث فيما بعد لمن لم ينتبه لها.\n2.     مراجعة اولويات العمل بالمستندات والتاكيد على ذلك بخطابات رسمية من قبل الاستشاري لتكون ورقة مهمة عند حدوث منازعات لا قدر الله.\n3.     عمل حصر لبند الاعمال المختلفة وهى خطوة مهمة خاصة فى عقود المعتمدة على الوحدات.\n4.     عمل المستخلصات الشهرية.\n5.     مراجعة العقود مع المقايسة عند عمل المستخلصات وهذه خطوة مهمة لانه اذا زادت الاعمال عن 125% يحق طلب زيادة فى السعر عن الاعمال الزائدة.\n6.     عمل مستخلصات مقاولى الباطن وجداول المقارنة بينها وبين العميل لتفادى حدوث خلل ومصروفات بلا ايرادات او ترحيلات فى الايرادات لسنة ماليه مختلفة وهذه النقطه يحدث بها تلاعب من بعض الشركات.\n7.     عمل تقرير شهرى يوضح الموقف التنفيذى لسير الاعمال.\n8.      متابعة وعمل قائمة بنتائج فحص عينات المواد واعتمادها من قبل الاستشارى وعمل لوحات shop drawings واعتمادها وكذلك prequaification لمقاولى الباطن واعتمادها وكذلك method statement للبنود المختلفة واعتمادها.\n9.     عمل البرنامج الزمنى للمشروع.\n10. متابعة البرنامج الزمنى واستخراج التقارير اللازمة مثل ال cash flow \n11.  اعداد تقارير بالاعمال المطلوبة خلال كل شهر ونسب الانجاز ومقارنتها بالبرنامج الزمنى المعتمد.\n12. مراقبة الجودة بالمشروع.\n13. مراقبة مشتريات المشروع فيما يتعلق بجودة المواد المطلوبة للمشروع.\n14. اعداد المستندات اللازمة وتحليل الاسعار وحصر الكميات للبنود المستجدة خارج نطاق العقد.\n15. عمل المطالبات claims الخاصة بالمشروع وخلال المدة القانونية المنصوص عليها بالعقد غالبا 28 يوم من التاثير على تكلفة ومدة المشروع.\n16. إعداد المستندات اللازمة لرفع غرامات التاخير ان وجدت.\n17. عمل ال recovry programme اذا تاخر المشروع عن البرنامج الزمنى وطالب الاستشارى بذلك.\nمتابعة صرف المستخلصات من قبل العميل وتوقيتات الصرف وتسجيل الاستقطاعات واسبابها لحفظ الحقوق فى Skills",
    "Skills": [
        "استخدام برامج الأوتوكاد\nبرامج الأوفس\nاتقان صياغة التقارير الدورية لاداء المشاريع"
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 40"
    },
    "Data": {
        "Job Location": "Khamis Mushait, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}