{
    "Job ID": "4694891",
    "Description": "We are currently seeking a reliable and professional Chauffeur Driver to transport clients to and from various destinations, ensuring a safe and comfortable ride. The successful candidate will be responsible for providing exceptional customer service and maintaining a clean and well-maintained vehicle.Responsibilities:Transport clients to and from various destinations in a safe and timely manner.\nAssist clients with getting in and out of the vehicle, loading and unloading their luggage, and ensuring their comfort during the ride.\nFollow designated routes and adhere to traffic laws and regulations.\nMaintain accurate records of vehicle usage, mileage, and fuel consumption.\nConduct regular vehicle inspections and perform routine maintenance, such as oil changes and tire rotations.\nKeep the vehicle clean and well-maintained, both inside and out.\nProvide exceptional customer service, including answering clients' questions, responding to their requests, and addressing any concerns they may have.\nEnsure the safety and security of clients at all times.\nFollow company policies and procedures, including dress code and punctuality requirements.Skills",
    "Skills": [
        "Requirements:",
        "High school diploma or equivalent.\nValid UAE driver's license and clean driving record.\n5 years of prior experience as a professional driver, preferably as a chauffeur in Dubai.\nExperience driving luxury vehicles.\nExcellent driving skills and knowledge of local traffic laws and regulations.\nStrong communication and customer service skills.\nGood organizational and time management skills.\nAbility to work flexible hours, including evenings and weekends.\nAbility to maintain confidentiality and discretion when necessary.\nAbility to lift heavy luggage and assist clients with mobility challenges.\nFluent in English"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}