{
    "Job ID": "4695994",
    "Description": "Marketing Officer - Kanoo Energy DivisionKanoo Energy offers engineered products and services, specialty lubricant products, corrosion inhibitors, machine tools, hand tools, PPE, and height safety gear. It provides sustainable solutions to utility companies and the GCC industrial sector as a whole through smart engineering and value-added services. The division is a leading vendor to major utility companies, oil & gas, petrochemical companies, and general industries across the GCC region.Role:The Marketing Officer will cater to all Marketing requirements within the Kanoo Energy division including but not limited to Brochure and Website development, E-Marketing, Launch campaigns, Marketing campaigns to raise awareness of and generate demand for products and services.Responsibilities:Working with employees in the areas of sales and distribution, market research, and content creation.\nEnsure the growth of Division through developing effective advertising campaigns that help sell products and services. They also create lasting relationships with consumers and boost revenues\nOverseeing social media accounts and websites to engage existing customers and establish positive public relations\nImplementing search engine optimization (SEO) in online media\nResearching trends and new marketing opportunities, and brainstorming ideas\nCoordinating and producing financial documents for advertising campaigns, such as budgets, estimates, and contracts\nCommunicating and negotiating with ad agencies, employees, marketing staff, editors, and writers\nAnalyzing customer feedback and campaign performance\nPlan and supervise events, fairs and conferences etc.\nDevelop and update online & print marketing collateral and promotional materials\nManage internal projects such as branding, signage and brand collaterals\nDerive and manage an active Kanoo Energy Social-Media & Network strategy and engage with the Customers and Partners through these mediums.Skills",
    "Skills": [
        "Bachelor Degree (Preferable Marketing background)\n4 years of experience in Marketing\nGood English & Arabic language skill (Written & Verbal)\nExtensive experience of developing, maintaining and delivering on PR or Corporate Communications strategies to meet company objectives. \nKnowledge of E Marketing tools\nCreative and innovative thinking\nA strong understanding of customer and market dynamics and requirements."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}