{
    "Job ID": "4695145",
    "Description": "We are looking for an Accounts Payable Specialist to join our team and work with our accounting department to oversee our organization’s expenses. Accounts Payable Specialist responsibilities include processing payments, verifying invoices and performing account reconciliations as needed. Ultimately, you will work with our accounting team to ensure our organization’s expenditures are accurate and our accounting practices are standardized across the organization.Charge expenses to accounts and cost centers and control petty cash spending\nVerify vendor accounts, pay vendors and resolve purchase order, invoice or payment discrepancies\nIssue purchase order amendments and stop payments\nMonitor payroll expense claims, including salary advances and overtime payments\nReconcile account transactions with the general ledger\nPerform recordkeeping and prepare financial reports\nKeep informed of regulatory requirements and best practices in accountingSkills",
    "Skills": [
        "Proven work experience as an Accounts Payable Specialist or similar role\nAdvanced competency in accounting and business management software\nIn-depth knowledge of accounts payable principles, accounting standards and industry regulations\nExtensive experience in account reconciliation\nGreat time management and organizational skills\nExcellent collaboration and communication abilities\nRelevant training and/or certifications as an Accounts Payable Specialist"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 10",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 36"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}