{
    "Job ID": "4696631",
    "Description": "Are you a creative Marketing Manager that is passionate about marketing campaigns and always looking for ways to improve brand awareness?A leading hospitality division that partners with some of the world’s finest restauranteurs, is hiring a creative Marketing Manager whose expertise translates into increased brand awareness and profitability.Based out of Riyadh, reporting to the CEO, you will manage a small team, develop, manage, and lead day-to-day marketing programs and activities to meet plan-to-win objectives, comply with regulations and standards, and protect public reputation.\nContribute to business planning to develop an overall marketing strategy, and develop and implement marketing plans.\nAdjust marketing strategy and plans to meet changing market and competitive conditions.\nCoordinate with the market research and analysis function to gather and analyze market data, such as (economic climate, competitive atmosphere, market share, market forces, customer attitudes, buying preference, etc.) to drive new insights into marketing strategies and plans and to improve brand offerings.\nParticipate in the implementation of proper pricing strategies to ensure the competitiveness of the brand.\nDevelop and monitors the application of operating systems including policies and procedures, operating structure, and information flow in the department to achieve departmental objectives and to ensure compliance with CSM quality and service standards.\nDefine advertising objectives, recommend a choice of media, and allocate internal and external resources so that advertising and promotion campaigns are effective, economical, and appropriate for their intended audience.\nProvide inputs and recommendations on menu design and development.\nSelect and manage ongoing relationships with external vendors and ad agencies.\nEnsuring the implementation of best practices in product launching, brand awareness, market positioning, and marketing operations.\nParticipate in the identification and recruitment of key talent.\nSet performance objectives, provide the necessary support, evaluate/appraise the team, and regular feedback on performance. \nPromote a high-performance working environment and the Company's values.Skills",
    "Skills": [
        "Bachelor's degree in Marketing, Business Administration, or a related field.\nStrong marketing background, excellent communication skills, and attention to detail.\nBilingual in English and Arabic.\nOrganizational and Planning Skills.\nResult Driven.\nProblem Solving & Analytical Skills.\nCustomer Focused.\nCommunication & Presentation Skills.\nStrong knowledge of various marketing and analytics tools.\nPotential to solve practical challenges in real time using appropriate techniques.\nAdept at handling all the offline and online communication channels to transfer information effectively.\nAn excellent collaborator adept at solving practical issues from the marketing and promotional point-of-view."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant; Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}