{
    "Job ID": "4696656",
    "Description": "• Responsible for the project management of projects/program of Works within various departments portfolios• Responsible for participating in, evaluation of and recommending implementation strategies for multiple projects.• Ensure and review project management compliance related to Initiatives/Projects;• Liaise with the PMDD teams and key stakeholders to effectively manage various Projects;• Coordinate with all relevant parties and representatives such as MM Sectors to ensure the completion of the projects in time.• Provide support to the Program Director and deputize as required, in particular on project management matters• Elevate any issues on behalf of the PMDD and collect and update reports for the projects and submit them to higher management to provide clear information on the status and extent of progress of work in the projects.• Performs other responsibilities associated with this position as may be appropriateSkills",
    "Skills": [
        "• University degree from a recognised University in an appropriate field such as, Project Management, Civil Engineering or equivalent.",
        "• Excellent communication skills in Arabic, written and spoken.",
        "Mandatory Requirements",
        "• Minimum of 20 years post graduate experience and minimum 10 years’ experience in a similar role.",
        "• University degree from a recognised University in an appropriate field such as, Project Management, Civil Engineering or equivalent.",
        "• Excellent communication skills in Arabic, written and spoken.",
        "• Strong working knowledge of Microsoft Office",
        "• Extensive Project Management experience",
        "Desirable requirements",
        "• Evidence of suitable professional qualification PMP, APM or equivalent is preferable",
        "• Master’s degree in a relevant field;",
        "• English language skills",
        "• Experience of working in Qatar and / or the Gulf",
        "• Strong working knowledge of Project Planning Software’s."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 20",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}