{
    "Job ID": "4696352",
    "Description": "Responsibilities:The Oracle Fusion Technical Consultant will be responsible for providing support, enhancement, integration and implementation services using the technology stack of Fusion Applications. The candidate will be required to closely work with the Business and Functional Analyst and should have the ability to coordinate, interact and work with different teams for the delivery of the solution.Building custom reports, OTBI, Oracle Analytics, interfaces and integrations using Fusion Technology Stack.\nWorking with Functional Consultants to understand and review the feasibility of business requirements.\nGathering business requirements for enhancements, customizations and developing technical requirement documents.\nPreparing estimates based upon the custom requirements and preparing project schedules.\nDisplaying proficiency with the Oracle Fusion modules (Finance, SCM) and tools used for Fusion Applications.\nBeing involved in post-implementation support to provide a solution for production issues or for any other maintenance activities which might also involve a change management process.\nTesting and documenting all code changes. This includes unit testing, component integration testing, system integration testing, performance testing, capacity testing and quality reviews.\nLiaise with Oracle on production system issues and product bugs.Skills",
    "Skills": [
        "Oracle Fusion Finance & Supply Chain"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Jeddah , Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}