{
    "Job ID": "4697589",
    "Description": "Managing all maintenance and repairs of the venue grounds, property, equipment, and facilities.Ensuring that the venue and facilities are clean and organized.Managing all events and liaising with the employer and various stakeholders to determine event requirements.Manage all events set up, tear down, and follow up process. Conduct final inspections on the day of the event to ensure everything adheres to the standard requirements.Preparing venue hire packages and pricing options and negotiating with clients.Supervising all staff including groundsmen, event staff, and maintenance personal.Scheduling and coordinating the rental of various equipments, furniture, and other venue equipments.Liaising with catering services and supervising their requirements and logistics.Supervising the operations of events and tending to any incidents or queries.Managing all administrative tasks such as insurance, booking schedules, and invoicing.Communicating and enforcing all security regulations and protocols.Skills",
    "Skills": [
        "Bachelor’s Degree preferably in marketing, business communications and hospitality management or related field",
        "A minimum of 10 years experience as a venue or event manager.",
        "Excellent communication skills in Arabic, written and spoken.",
        "Excellent verbal and written communication Skills",
        "Strong organizational skills",
        "Ability to remain calm under pressure",
        "Strong analytical skills",
        "Fortitude to work in a challenging & fast-paced environment",
        "Confident and articulate",
        "Excellent PC operation skills including MS Office, word setting applications, primary knowledge about event planning, management and financial skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Events Management; Media Production; Administration Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}