{
    "Job ID": "4697976",
    "Description": "MINIMUM QUALIFICATION / EXPERIENCE / TRAINING Degree in Civil / Mechanical Engineering level engineering preferably with a formal qualification in Business Management.\n10 – 15 years experience in a senior position managing hihigh-value projects in the industry (UPVC Factory) of which at least 5 years must have been in strategically leading and managing a company representing both generalist and managerial skills.\nIs responsible for operational or conceptual performance and supervision of activities that are related to each other with a clear emphasis on the integration of various operational processes with the ability to design the content and planning of the operations.\nMust have highly developed skills in persuading, inspiring, developing and motivating in order to interact with other people. The ability to set and create the right (working) climate is of critical importance as the major accountabilities are achieved through others.TECHNICAL KNOWLEDGE Requires proficiency in a specialized technical field, with specific experience relating to marine construction related activities and with a broad understanding of relationships between different disciplines gained through deep and broad experience built on concepts and principles.\nMust have the ability to select, develop and assess the suitability of techniques, not just the application of those techniques.\nIn depth knowledge of the local and regional construction environment.\nConversant with Project Management and relevant Engineering softwareBEHAVIORAL COMPETENCIES  Leadership.\nStrategic Thinking.\nClient Focus.\nCommunication.\nResults Orientation.\nRelationship Building.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}