{
    "Job ID": "4698568",
    "Description": "Build our communications network, from product launches to thought leadership.\nManage relationships with PR agencies and external providers.\nSecure repeatable and visible coverage across the media landscape, including print, online, broadcast, awards, and keynotes.\nCreate the right story telling content for brand perception. Measure and review brand perception and engagement.\nImplement communication policies and safeguard the reputation of our brand.\nManage and develop spokespeople, including senior executives. Coordinate customer and partner stories for key moments and executive engagements.\nWork closely with sales, engineering, marketing, communications and legal across the company as a trusted partner and advisor.\nCreate content and stories for our linkedin and website (articles, blogs, posts etc..)\nPlay a key role in building and managing the internal communications strategy while executing all employee communications programs, events and materials.\nEffectively communicate the north star message to the team, and always have everyone’s vision set on that final goal.\nCreate innovative ways to communicate in a virtual/remote workplace that inform and motivate employees while keeping the company connected across all office locations\nManage all internal communications channels such as e-newsletters, in-office TV monitors, slack handle and more.\nCoordinate and manage internal and external events, from team engagement activities to product exhibitions. \nManage and grow our employee awards and recognition programs.\nPrepare and write pitch decks and investment presentationsSkills",
    "Skills": [
        "4+ years of experience doing communications for a technology company\nStrong writing and storytelling skills are a must, as is thriving in a fast-paced environment. Communication skills, both written and verbal need to be outstanding.\nA creative mindset and a passion for communications.\nVery strong attention to detail and the ability to juggle competing priorities.\nAbility to be a self starter and a team player.\nAbility to meet aggressive timelines across different departments.\nAbility to see the Corporate-level perspective, the business group goals & objectives, and the fine details needed to implement complex communications.\nYou \"have done it before\" – you have built communications strategies.\nExperience working with PR firms\nExperience writing pitch decks\nTangible network of business and tech writers, and media connections within business, tech, and possibly education."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7",
        "Residence Location": "Kuwait",
        "Nationality": "India",
        "Age": "Max: 42"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Preschool, Nursery, & Daycare",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}