{
    "Job ID": "4699833",
    "Description": "Barista Job Brief:We are looking for a barista who is vibrant and active and like to communicate with people. A barista who is capable of preparing specialty coffee with perfection and is capable of latte art. Barista Job Responsibilities:· Promotes coffee consumption by educating customers; selling coffee and coffee grinding and brewing equipment, accessories, and supplies; preparing and serving a variety of coffee drinks, along with pastries and cookies.· Welcomes customers by determining their coffee interests and needs.· Educates customers by presenting and explaining the coffee drink menu; answering questions.· Sells coffee and coffee grinding and brewing equipment by explaining differences in coffee beans and coffee preparation machines; demonstrates how brewing equipment operates.· Prepares and sells coffee drinks by following prescribed recipes and preparation techniques for coffee drinks, such as espresso, espresso lungo, caffe latte, and cappuccino.· Generates revenues by attracting new customers; defining new and expanded services and products.·  Maintains inventories by replenishing coffee bean supply; stocking coffee brewing equipment; maintaining supplies, pastries, and cookies for the coffee bar.·  Keeps equipment operating by following operating instructions; troubleshooting breakdowns; maintaining supplies; performing preventive maintenance; calling for repairs.·  Maintains a safe and healthy work environment by following organization standards and sanitation regulations.·  Improves quality results by studying, evaluating, and re-designing processes; implementing changes; maintaining and improving the appearance of the store and coffee bar.·  Updates job knowledge by participating in educational opportunities; reading coffee, retail trade, and food service publications; maintaining personal networks.·  Enhances coffee shop reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.Bartender Job Brief:The candidate should provide & prompt, efficient, courteous service to all guests. Should be able to serve and make all beverages for guests.Bartender Job Responsibilities:·      Develop and maintain professional functional working relationships with SBD employees and guests.·      Execute the “Service Success Steps” per the SBD SOP to ensure a high-quality guest experience.·      Develop and execute new beverage recipes.·      Discover a fresh & refreshing beverage to our guest.·      Communicate guest beverage orders and service requests in an accurate and timely manner.·      Stock and rotate all needed supplies in the service areas and bar area.·      Comply with all local and SOP health, sanitation, and safety guidelines.·      Perform all cleaning duties according to posted cleaning charts.·      Comply with SBD uniform and appearance standards per SOP guidelines.·      Perform other assignments or tasks as assigned by the General Manager, Restaurant Manager, or acting supervisor.Skills",
    "Skills": [
        "Qualifications / Skills:",
        "·      Customer service ( most important )",
        "·      Organization",
        "·      Ability to remain calm and focused in a fast-paced environment",
        "·      Team spirit, with a customer-focused attitude",
        "·      Tidiness.",
        "·      Latte art ( a must for the Barista position )",
        "·      Listening",
        "·      Verbal communication",
        "·      Basic safety",
        "·      Action-oriented",
        "·      Selling to customer needs",
        "·      Attendance",
        "·      Client relationships",
        "Education, Experience:",
        "·   High school diploma, GED, or equivalent and higher.",
        "·   Minimum of 3 years experience as a barista or Bartender.",
        "·   Familiarity with telephone, office, and point-of-sale software.",
        "+ Iqama should be transferable."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Alahsa, Saudi Arabia",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}