{
    "Job ID": "4699759",
    "Description": "مسؤوليات أخصائي التوظيف:\nتحليل احتياجات المؤسسة: فهم احتياجات المؤسسة والوظائف الشاغرة وتحديد المؤهلات والمهارات المطلوبة لكل وظيفة.\nوضع استراتيجية التوظيف: تطوير استراتيجيات التوظيف المناسبة لجذب المرشحين المؤهلين، بما في ذلك استخدام مختلف وسائل التواصل والتسويق للوظائف.\nإعلان الوظائف وجذب المرشحين: كتابة ونشر إعلانات الوظائف المناسبة في المواقع الوظيفية والشبكات الاجتماعية والمنتديات وغيرها، وتنظيم حملات ترويجية لجذب المرشحين المحتملين.\nالفرز والتقييم الأولي: مراجعة طلبات التوظيف واستبعاد المرشحين غير المؤهلين، وتقييم المرشحين المحتملين بناءً على السير الذاتية والخلفيات والمهارات.\nإجراء المقابلات: تنظيم وإجراء المقابلات الشخصية أو عبر الهاتف أو عبر الفيديو مع المرشحين المناسبين، وتقييم أداءهم وملاءمتهم للوظيفة.\nالاستشارة وتقديم المشورة: تقديم المشورة لإدارة المؤسسة حول توظيف الموظفين واتخاذ القرارات المناسبة.\nالتعاون مع الإدارات الأخرى: التنسيق مع إدارات الموارد البشرية والإدارات الأخرى لتلبية احتياجات التوظيف وضمان تنفيذ عملية التوظيف بشكل سلس وفعال.\nالراتب ٨ الافSkills",
    "Skills": [
        "فهم السوق العملية: معرفة جيدة بالسوق العملية والصناعة التي ينتمي إليها المرشحون المحتملون، ومعرفة المؤهلات والمهارات المطلوبة للوظائف المختلفة.\nالاتصال الفعال: قدرة على التواصل بشكل فعال مع المرشحين المحتملين والتعبير عن المعلومات بوضوح ودقة، وكذلك القدرة على بناء علاقات جيدة مع فريق العمل الداخلي والإدارة.\nالمهارات التحليلية: القدرة على تحليل معلومات المرشحين وتقييم ملاءمتهم للوظائف المتاحة.\nالتنظيم وإدارة الوقت: القدرة على التعامل مع مجموعة واسعة من الوظائف والمرشحين وإدارة الوقت بشكل فعال.\nخبره لا تقل عن سنه\nسعودي الجنسيه\nلغه انجليزيه ممتازه"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}