{
    "Job ID": "4699763",
    "Description": "وضع استراتيجية المشتريات: تطوير وتنفيذ استراتيجية المشتريات الخارجية بناءً على احتياجات المؤسسة وأهدافها المالية والتشغيلية.\nإدارة سلسلة التوريد الخارجية: إدارة عملية الشراء من الموردين الخارجيين بما في ذلك اختيار الموردين المناسبين وتقييمهم وإجراء مفاوضات العقود والشروط والأحكام.\nتقييم الموردين: تقييم الموردين الخارجيين من حيث جودة المنتجات أو الخدمات وتسعيرها وتوافرها وسمعتها ومصداقيتها.\nالتفاوض والمفاوضة: المفاوضة مع الموردين للحصول على شروط تجارية مواتية وتحسين الشروط والأسعار والمدفوعات وشروط التسليم.\nضمان الامتثال والجودة: التأكد من الامتثال للمعايير والمواصفات المطلوبة وضمان جودة المنتجات أو الخدمات المشتراة.\nإدارة المخاطر: تحليل وتقييم المخاطر المتعلقة بعمليات المشتريات الخارجية وتطبيق إجراءات لإدارة وتقليل هذه المخاطر.Skills",
    "Skills": [
        "المعرفة بعملية المشتريات: فهم عملية المشتريات وأفضل الممارسات في إدارة سلسلة التوريد وشراء المنتجات أو الخدمات.\nالمفاوضة والتواصل: مهارات التفاوض القوية والقدرة على التواصل الفعال مع الموردين والفرق الداخلية وفهم احتياجات العملاء الداخليين.\nالتحليل والتقييم: القدرة على تحليل البيانات وتقييم العروض والاقتراحات والتحكم في جودة المنتجات أو الخدمات المشتراة.\nالقدرة على التخطيط والتنظيم: القدرة على التعامل مع العديد من المهام والمشروعات المختلفة وإدارتها وتنظيمها بشكل فعال.\nالمعرفة بالتكنولوجيا: القدرة على استخدام أنظمة إدارة المشتريات والأدوات التقنية لتحسين كفاءة عملية المشتريات وتحليل البيانات.\nالتفكير الاستراتيجي: القدرة على التفكير بشكل استراتيجي واتخاذ القرارات التي تعزز أهداف المؤسسة وتعزز الكفاءة والتوفير.\nخبره في المشتريات الخارجيه\nخبره لا تقل عن ٥ سنوات\nفي الكرتون او الزجاج او البلاستيك"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}