{
    "Job ID": "4701824",
    "Description": "Identifying new business opportunities– connecting with key decision makers within the business and securing engagement with key decision makers. Pursuing these new sales prospects, understanding opportunities for Starlinks to support within our scope of logistics solutions, negotiating deals, and most importantly closing new business. Help meet and surpass business expectations and contribute to our company’s rapid and sustainable growth. The role involves face-to-face sales-based communications with customers.Familiarizing yourself with all products and services offered by our company. \nConduct market research to identify selling possibilities and evaluate customer needs.\nProcuring new clients through direct contact, word-of-mouth, and collaboration with the growth and marketing department.\nActively seeking out new sales opportunities through cold calling, networking and social media .\nCrafting business proposals and delivering presentations with the alignment of the BDM or Head of BD .\nSetting up face-to-face meetings with potential clients and listening to their wishes and concerns – identifying opportunities to position Starlinks as a solution.\nCombining efforts and fostering a collaborative environment within the business as a whole.\nCommunicating with clients to understand their needs and offer solutions to their requirements and/or problems.\nPrepare Minutes of Meetings (MOM) and share it with BDM’s or Head of BD for alignment on all open opportunities.\nMaintaining client activities in CRM.\nEnsuring excellent customer service through regular client follow up.\nWork under direction of the business development manager.\nCreate frequent reviews and reports with sales and financial data. \nNegotiate/close deals and handle complaints or objections.\nPerform other job-related projects and/or assignments that he/she might be asked to do by his/her direct supervisor/manager for special assistance that are often not mentioned in this job description as they arise under specific circumstances Skills",
    "Skills": [
        "Sales Management.\nCustomer Service.\nFreight Forwarding.\nTransportation.\nLogistics.\nMS Office applications i.e. Excel, Word, PowerPoint, and Outlook.\nStrong interpersonal & communication Skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}