{
    "Job ID": "4701863",
    "Description": "JOB PURPOSEThe Senior Transparency and Compliance Officer is the Head of Transparency and Compliance department in ACTED Jordan, reporting directly to the Country Director. This position is the lead in (i) controlling, on a risk-based audit approach, the implementation of ACTED’s processes in compliance with ACTED’s guidelines, specific donor guidelines, best practices and national regulations in the relevant country; (ii) developing & actively contributing to action plans agreed with country coordination in order to mitigate the identified risks, and to cope with priorities, budget constraints and organizational context. S/He provides technical support and capacity building to the country FLATS staff to implement the action plan and address the issues. S/He also provides technical support for donor external audits and due diligences preparation and follow- up. S/He should comply and ensure compliance to the audit code of conduct. CHAIN OF COMMANDUnder the authority of:Country Director (CD);Functional Management:Duty of alert toward the Transparency, Audit and Legal Director (shall inform HQ in case of major issue with a potential impact on the mission);\nArea Compliance teamLine Management:Country Risk and Compliance Intern (if any)\nNational Capital Compliance team.WORKING RELATIONSInternal:HQ (Finance, Logistics, Administration, Audit, Security, Programme, and Grant Management teams);\nCountry Director;\nIndependent from all other ACTED department but interact with all the departments at the regional, capital and area levels: Coordination, Finance, Logistics, Administration, Audit, Security, Programme, and Grant Management;External:Donors auditors;\nExternal auditors;\nNational and international Partners; National lawyersadherence with acted’s greening policy:ACTED’s greening strategy aims to tackle environmental degradation and climate change while meeting the needs of the most vulnerable who are often those most affected by the deepening environmental crisis. Each ACTED employee will adhere to these principles through key green programming responsibilities:Contribute towards the adherence and development of the greening strategy plan.\nExplore innovative green programming opportunities and/or solutions within your realm of responsibilities and roles\nEncouraging and promoting environmental safeguarding processes and environmental programming standards in accordance with SOPs and technical guideline notesAdherence with acted’s pseah policy:The Senior Transparency & Compliance Officer has the responsibility to adhere to the PSEAH Policy (Protection against Sexual Exploitation, Abuse and Harassment). The Senior Transparency & Compliance Officer has the obligation to complete all mandatory trainings related to the Code of Conduct and the PSEA policy and report any safeguarding concern such as breaches of organizational policies or codes of conduct according to ACTED’s procedures. The Senior Transparency & Compliance Officer carries out work duties in a way that does not harm children, vulnerable adults or other staff or volunteers. OBJECTIVES: Internal audit function: contribute to (i) controlling, on a risk-based audit approach, the implementation of ACTED’s processes at the capital, area and implementing partner level, in compliance  with  ACTED’s  guidelines,  specific  donor  guidelines,  best  practices  and  national.\nRegulations in the relevant country and (ii) developing and participating to action plans agreed with the Country Risk and Compliance Manager (in any) or country coordination;\nParticipate to donor external audits and due diligences preparation and follow-up;\nTraining, lessons learnt and best practices: provide training sessions to reinforce the compliance level of country teams and implementing partners, propose improvement to ACTED’s current procedures, based on lessons learnt and best practices;\nTransparency / Compliance Management: Actively promote ACTED’s anti-fraud and whistle blowing policy within ACTED country offices;Facilitate internal coordination and communication and mentor Country Risk and Compliance Intern (if any) and the National Compliance Team.DUTIES & RESPONSIBILITIESInternal Audit function1.1. Participate to the implementation of the approved national internal audit plan: conduct internal audit missions through a risk management approachAudit Plan: participate to the implementation and the update of the country audit plan (including IP Due diligences);\nConduct country Internal audit missions: conduct country/area audit missions according to the Country Audit Plan and the ACTED internal audit methodology;\nReview the country/area internal audit missions conducted by the area / country audit and compliance team before Coordination approval;\nConduct Implementing Partners due diligences, participate to the mitigation plan follow-up;\nSuggest measures for mitigating such risks to the Country Risk and Compliance Manager, discuss the main findings and recommendations during the mission; draft an action plan (AUD-04B) to be discussed during the debriefing session;\nAudit report: send the audit reports (AUD-04A) to the to the Country Risk and Compliance Manager for review before regional and/or HQ approval;\nEnsure the recommendation follow-up and actively participate in their implementation.1.2 Implementation of the ACTED standard guidelines and FLAT System at the capital, area and partner’s levels: contribute to:Control the monthly flow of documentation from the Areas and Partners to the Capital office; Review documentation compliance level on a random basis;\nSupervise the National Compliance Officer in compiling, filing and checking all project related financial, logistics, administrative, HR, and programme information (including documentation from the areas and the partners) in the designated project Compliance FLATS folder on a monthly basis (FLA 01 and FLA 03);\nSupport the Compliance Team in identifying the compliance issues by filling the compliance checklists (FLAT);\nThe follow-up of the action plan (AUD 04B);\nDraft the Monthly Compliance Report (FLA 04) and the Audit TITANIC and obtain the Country Risk and Compliance Manager review and approval and send it to HQ.1.3 When required, contribute to controlling the compliance with country rules and regulations. Upon request of your Coordination and in link with the Country Finance Manager:Support, in litigation cases (staff, suppliers, etc.) follow-up;\nSupport National and local legislation follow-up (tax exemption, social security, labour law etc.); \nTax/VAT exemption follow-up: control the ACTED compliance with tax laws and that tax/VAT exemptions are requested in a timely manner.1.4 Provide support to mitigate the high risks identifiedProvide technical support to the Finance, Logistics, Admin, Audit and Programme departments and participate to the action plan implementation to mitigate the risks identified in 1.1, 1.2 and 1.3 upon request of the Country Risk and Compliance Manager, the Country Director and / or the HQ Audit, Legal and Transparency Director.External audit : contribute to the external audit and the due diligence preparation and follow upParticipate to the preparation of external audits and due diligences in close collaboration with the HQ Audit Department, the Country Finance Manager and the Country Director;\nDraft of the External Audit preparation (AUD-01) and update the Project, FLAT & External Audit Follow-up (AUD-00);\nContribute to train the implementing partners / country/area staff to the external audit preparation;\nContribute, in line with the Country Finance Manager in managing external audit preparation related to Implementing Partners expenses.\nContribute, in close relation with the Country Director and the Country Finance Manager,to facilitate and coordinate the audit, organize the kick off and close out meetings of each external audit;Contribute to draft ACTED Management responses to the audit report, to be reviewed by the Country Risk and Compliance Manager and approved by Country Finance Manager and the Country Director first and then by the HQ Audit Department. Follow-up the reception of the signed audit report;\nContribute to ensure (i) the update of the External Audit Recommendations follow up (AUD-\nand (ii) the implementation of the recommendations from external audits;\nWhen relevant to a project or mission registration, provide technical support to select external audit companies.Training sessions / lessons learn / best practices3.1. Capacity building and TrainingProvide practical training on specific areas of ACTED procedures;\nMentor Compliance staff in the country.3.2. Lessons learnContribute to proactive dissemination and use of knowledge gained through audit activities (internal and external audits) among international and national staff;\nIn the absence of Country Risk and Compliance Manager, participate in kick-off /closure.\nmeetings to share lesson learnt from previous audit and highlight donor guidelines.3.3. Process improvementReinforce current procedures and the quality of ACTED internal control, based on international best practices, donors’ requirements and results of internal & external audits;\nUpon request from the Country Risk and Compliance Manager or Audit Director, participate to the drafting of specific policies.4.TransparencyParticipate in minimizing risk of fraud and corruption by ensuring adherence to ACTED FLATS procedures, ACTED Code of Conduct and ACTED Anti-Fraud Policy;\nUpon request of the Country Risk and Compliance Manager, the Country Director and/or the Audit Director, participate in Fraud cases investigations;\nUpon request of the Country Risk and Compliance Manager if any or the Country Director, update the Fraud Register (FRA-04)\nActively promote ACTED’s anti-fraud and whistle blowing policy within all ACTED offices in country.5.Internal CoordinationEnsure training and capacity building for the Compliance team members in order to increase the level of technical ability and skills within the department.\nManage a Risk and Compliance Intern (if any) following up the work plans and day-to-day activities;\nMentor the Risk and Compliance Intern and National Compliance Officer with the aim of strengthening their technical capacity6.OtherProvide regular and timely updates on progress and challenges to coordination and other team members.\nWarn the Country Director and HQ in case some major problems arise with a potential financial or reputational impact on the mission.\nPerform any other related activities as assigned by immediate supervisor.KEY PERFORMANCE INDICATORS% of Audit Titanic submitted on time and well completed.\n% of ongoing projects in the country with a FLAT Folder.\nNumber of internal audits conducted.\nTimely submission of internal and external audit reports.\n% of internal audit recommendations implemented at the country level.\n% of successful Due Diligence and external audits.\n% of implemented external audit recommendations.\n% Audit staff / IPs in the country provided with internal/external training during past 1 year.\nNumber of alert and action plans developed by the Audit department to improve system, process and practices.Lessons learnt and best practices recorded in the Lessons Learnt and Best Practices document according to ACTED’s standard learning procedures in a consolidated document and updated in regular and timely mannerSkills",
    "Skills": [
        "QUALIFICATIONS",
        " Education: A bachelor's degree in law, business administration, finance, or a related field. A master's degree in a relevant discipline is preferred.\nExperience: A minimum of 5 years of progressive experience in compliance, transparency, or related roles, preferably within an NGO or a similar context, preferably.\nStrong knowledge of Jordanian laws, regulations, and legal frameworks relevant to NGOs, including tax laws, financial regulations, and reporting requirements.\nFamiliarity with international standards and best practices in transparency and compliance for NGOs.\nDemonstrated experience in developing and implementing compliance frameworks, policies, and procedures.\nProven ability to conduct internal audits and assessments to identify compliance gaps and recommend corrective actions.\nExcellent communication skills, both written and verbal, with the ability to effectively communicate complex compliance concepts to diverse stakeholders.\nStrong interpersonal skills and the ability to collaborate and build relationships with internal and external stakeholders, including government officials, auditors, and donors.\nDetail-oriented with strong analytical and problem-solving skills.\nProficiency in relevant software applications, including MS Office Suite and compliance management systems.\nFluency in English and Arabic, both written and spoken."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}