{
    "Job ID": "4703268",
    "Description": "We are looking for Fast Food Recipe Developer for Execute lab trials of finished Chicken and meat samples for development or reformulation.II. Job Duties:1.   Assist in assessment of future and existing product items.2.   Participate in quality assurance process of new products.3.   Work with suppliers to provide new ideas and quality products.4.   Assist in making improvements or modifications to current product items5.   Assist in generating ideas for new products and researching feasibility6.   Conducts sensory evaluation, recording and analyzing data of results7.   Conducts product shelf life stability of existing and new product items8.   Writing and reading technical papers, reports, reviews and specificationsWe are looking for Fast Food Recipe Developer for Execute lab trials of finished Chicken and meat samples for development or reformulation.II. Job Duties:1.   Assist in assessment of future and existing product items.2.   Participate in quality assurance process of new products.3.   Work with suppliers to provide new ideas and quality products.4.   Assist in making improvements or modifications to current product items5.   Assist in generating ideas for new products and researching feasibility6.   Conducts sensory evaluation, recording and analyzing data of results7.   Conducts product shelf life stability of existing and new product items8.   Writing and reading technical papers, reports, reviews and specificationsSkills",
    "Skills": [
        "   III. Job Qualifications",
        "Education:",
        "Bachelor of Science in Food Technology/Science, Chemistry, Chemical Engineer or any related filed in science",
        "Experience and Training:",
        "l Preferably at least 5 years working experience food Industry .",
        "l Knowledge in flavor application and other finished Chicken and meat ingredients",
        "l Knowledge in cGMP, SSOP, HACCP and ISO 22000",
        "l Adept in physic-chemical analysis of soft Chicken and meats.",
        "l Ability to perform shelf-life study of finished product.",
        "l Knowledge in test method development, troubleshooting, setting up new systems."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Al Majmaah, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}