{
    "Job ID": "4703181",
    "Description": "Vilbi Corp is an established 25-year-old company in the seafood trading industry. The company is originally from Central Asian market and is currently launching its new operations in UAE. This position is responsible for developing, driving, and executing sales plans from scratch to bring revenue into the firm, as well as managing the sales teams and providing guidance and consultation to them.Responsibilities:- Develop and implement sales strategies to bolster the firm’s revenue and market position- Manage, assign, and provide guidance and consultation to the firm’s sales teams- Establish and maintain relationships with key clients and sales channels- Review the performance of sales staff and sales activities- Research potential new markets and sales prospects- Prepare sales reports and analyze results to measure progress and develop plans- Remain up to date with industry trends and market researchSkills",
    "Skills": [
        "We're looking for experienced sales leaders with 5+ years of experience in specifically seafood wholesale trading market. We're looking for a candidate who'll be able to grow into a country manager very soon and lead the UAE team in general.",
        "At least 5+ years of experience in seafood trading in the UAE\nKnowing the people, companies, and customers in the wholesale seafood industry in UAE\nExperienced in building sales teams\nDemonstrated information systems skills needed to manage data and evaluate results\nTrue leadership\nSelf-sufficient\nAbility to work effectively with minimal supervision.\nA degree in Business is welcomed"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}