{
    "Job ID": "4706239",
    "Description": "Conduct comprehensive assessments of our manufacturing operations, identifying areas for improvement and optimization.\nDevelop and implement strategic plans to upgrade our factories, modernize equipment, and enhance production capabilities.\nCollaborate with cross-functional teams, including engineering, operations, and finance, to drive process improvements, increase efficiency, and reduce costs.\nAnalyze market trends, competitor activities, and customer demands to identify new business opportunities and potential growth areas.\nLead projects to implement new manufacturing technologies, automation systems, and process innovations to improve overall productivity and quality.\nEvaluate and negotiate partnerships, collaborations, and strategic alliances with suppliers, vendors, and technology providers to support our factory upgrading initiatives.\nDrive continuous improvement initiatives, such as Lean Manufacturing and Six Sigma, to optimize workflows, eliminate waste, and enhance overall operational efficiency.\nDevelop and monitor key performance indicators (KPIs) to track progress, identify bottlenecks, and implement corrective actions to achieve manufacturing targets.\nProvide leadership, guidance, and mentorship to the manufacturing team, fostering a culture of innovation, collaboration, and continuous improvement.\nStay updated with industry trends, emerging technologies, and best practices in factory upgrading and manufacturing improvement.Skills",
    "Skills": [
        "Bachelor's degree in Engineering, Business Administration, or a related field. Master's degree is a plus.\nProven experience as a Business Development Manager or in a similar role, specifically in factory upgrading and manufacturing improvement.\nIn-depth knowledge of manufacturing processes, equipment, and technologies.\nStrong understanding of Lean Manufacturing, Six Sigma, and other continuous improvement methodologies.\nExcellent project management skills, with the ability to plan, execute, and monitor complex projects within time and budget constraints.\nStrategic mindset and business acumen to identify growth opportunities, assess risks, and make data-driven decisions.\nStrong analytical and problem-solving skills, with the ability to analyze complex data, identify trends, and propose effective solutions.\nEffective communication and presentation skills, with the ability to influence and collaborate with stakeholders at all levels.\nLeadership qualities, with the ability to inspire and motivate teams to achieve operational excellence and business objectives.\nProficiency in relevant software and tools for project management, data analysis, and presentation."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 7",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Central Province, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}