{
    "Job ID": "4706691",
    "Description": "•            Successfully match customer requirements to proposed solutions.•            Create and deliver powerful presentations and demos to the customers.•            Manage all technical aspects of RFP / RFI responses.•            Prepare and deliver technical presentations explaining products or services to existing and prospective               customers.•            Act as a liaison between the sales team and technical teams to ensure customers receive the appropriate product or service.•            Assist in researching and developing new products.•            Generating high-quality sales leads, following up after initial contact, securing and renewing orders, negotiating prices, completing sales, and arranging deliveries.•            Researching, developing, and modifying products to meet customers' technical requirements and needs.•            Identifying areas for improvement and communicating these issues as well as possible solutions to upper management.•            Setting and achieving sales goals.•            Travelling to visit potential clients.•            Establishing new, and maintaining existing, relationships with customers•            Managing and interpreting customer requirements.•            Negotiating and closing sales by agreeing terms and conditions.•            Supporting marketing by attending trade shows, conferences, and other marketing events.•            Conduct product demonstrations, technical presentations, and training sessions for customers and prospects.•            Understand customer requirements, pain points, and objectives to design and propose customized solutions that meet their needs.•            Stay informed on industry trends, technologies, and competitors to provide insights and recommendations to the sales team and customers.•            Provide technical support and troubleshoot customer issues before and after the sale.•            Participate in the development of sales and marketing strategies and plans to achieve company goals.•            Work closely with product development teams to identify product improvements, new features, and market opportunities.Skills",
    "Skills": [
        "•            Bachelor's degree in civil engineering is the first choice, Architects can also apply.",
        "•            Proven work experience as a Sales Engineer.",
        "•            Preferred with knowledge in the process to obtain approvals and accreditations in government, semi government and Mega projects.",
        "•            Knowledgeable in making material product specifications for newly developed applications.",
        "•            Proven track record selling complex enterprise solutions.",
        "•            Ability to creatively explain and present complex concepts in an easy-to-understand manner.",
        "•            Excellent written and verbal communication skills.",
        "•            Excellent presentation and creative skills.",
        "•            It would be great if the candidate had prior experience with companies that provide building technologies.",
        "•            Other Conditions:",
        "•            Transferable Iqama.",
        "•            Valid Driving License."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}