{
    "Job ID": "4707293",
    "Description": "We are searching for an innovative sales specialist with a great analytical mind to join our team. The sales specialist will be tasked with handling daily sales operations, performing in-depth market research, preparing sales forecasts, amend sales policies and make recommendations for business growth.The candidate should have excellent problem-solving and people skills.Sales Specialist Responsibilities:Providing product demonstrations to staff and clients, and taking the lead in resolving complaints.\nConducting market research and sharing findings with the team.\nWorking alongside the team to draw up strategies to increase customer base.\nSetting sales targets and implementing incentives.\nProviding accurate sales forecasts and allocating resources so targets are met.\nManaging a network of vendors, suppliers and partners / distributors\nMaintaining excellent relationships with customers that are built on trust, and encouraging the rest of the sales team to follow this example.\nKeeping up-to-date with advancements in marketing, sales and over all the operations per given strategy\nParticipate on behalf of the company in exhibitions or conferences\nNegotiate/close deals and handle complaints or objections\nActively seek out new sales opportunities through cold calling, networking and social mediaSkills",
    "Skills": [
        "Bachelor's degree in marketing, business or similar / business college\nExcellent knowledge of MS Office\nHands-on experience with CRM software is a plus\nThorough understanding of marketing and negotiating techniques\nFast learner and passion for sales\nSelf-motivated with a results-driven approach\nAptitude in delivering attractive presentations\nValid driver's license.\nStrong analytical and critical thinking skills.\nExcellent customer service and leadership skills.\nStrong networking abilities.\nAbility to diagnose problems and find solutions.\nAbility to remain professional.\nWillingness to work overtime when required."
    ],
    "Preferred": {
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}