{
    "Job ID": "4709039",
    "Description": "Branch Shipping Manager - Kanoo Shipping - Yanbu & DubaThe Role:The Shipping Manager will be responsible for effectively and efficiently managing and representing Kanoo Shipping in Yanbu, a strategically key location for our overall KSA Western Province ambitions, including business maintenance, growth, and diversification of activities.Job responsibilities include:Responsible to maximize profits / operational output, to minimize costs and to manage submission of FDAs to finance within 25 days of vessel sailing. Follow up for debtors also required in association with finance department.\nReport and analyze Kanoo Shipping – Yanbu performance on a monthly basis via written and verbal report.\nOversee recruitment and development of talented Saudi Arabian nationals in AOR including females.\nOversee the implementation of the new office and operation at Duba, including staff, office premises, communications, and systems installations.\nPrepare annual budget for Yanbu/ Duba for approval of Kanoo Shipping CEO, CFO, COO & CCO.\nDevelop / enhance business relationships with potential and current customers, including personal visits to ATC, Sabic and Lubref at least annually and in association with the commercial department where possible.\nDevelop / enhance a senior level relationship with suppliers of Kanoo Shipping Yanbu/Duba to expand our portfolio of ISO approved suppliers\nDevelop / maintain senior level relationship with Port Authorities, immigration, customs in AOR.\nEnsure Kanoo Shipping KPIs, and our Principal’s KPIs are achieved, and that any failure is investigated fully towards correction.\nOversee development and improvement of Kanoo Shipping Yanbu/ Duba as regards:ISO Operational Procedures\nISO Approved Supplier List\nHSSE procedures and policies\nIT and communications\nAccounting processes for billing clients and paying suppliers\nAnti-Corruption and Anti Bribery policies\nEmergency response and contingency procedures11. Responsible to field and investigate customer complaints, procedure/safety / corruption-related issues, and ensuring effective corrective actions are implemented, including submission of a formal report to COO12. Support to other Kanoo Shipping offices, Regional Management offices, Regional Operational hub – Fujairah and Kanoo Shipping Commercial and Finance departments at all times.Skills",
    "Skills": [
        "Bachelor’s Degree in Marine or related field.\nAt least 7 years’ experience in management level of shipping agency and related Port and Offshore operations.\nUnderstanding of Quality and HSSE management systems\nExcellent communication skills in English and Arabic languages\nExpert Knowledge in shipping industry \nSaudi Nationals with related shipping experience should apply"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Yanbu, Saudi Arabia",
        "Company Industry": "Shipping",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}