{
    "Job ID": "4712748",
    "Description": "•Collects and compiles HR matrix and data from a variety of sources including the human resource information system (HRIS) and payroll outputs, management and employee surveys, exit interviews, employment records, government labor statistics, competitors’ practices, and other sources.•Analyzes data and statistics for trends and patterns with attention to recruitment, hiring practices, motivation, turnover, and compliance with employment laws and regulations.•Prepares reports of data results, presenting and explaining findings to senior leadership.•Identifies and recommends reasonable short- and long-term goals, milestones, and benchmarks for key performance metrics.•Based on metrics and analysis, makes recommendations for policies and activities to improve the organizational culture including suggestions to attract and hire qualified candidates, to motivate and retain employees, to address staffing issues, and to maintain legal compliance.•Facilitates implementation of new training, development, recruiting, and other related initiatives.Skills",
    "Skills": [
        "•Excellent verbal and written communication skills.",
        "•Strong analytical and problem-solving skills.",
        "•Basic Management Skills",
        "Educational Qualifications",
        "Education Degree: Bachelor",
        "Major: Human Resources, Business Administration, Industrial Psychology, or related field.",
        "Experience",
        "Years of Experience: 3 - 5  Years",
        "Field of Experience: job classification and compensation, recruitment, selection, training, employee benefits, and/or equal opportunity compliance"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 6",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 31"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}