{
    "Job ID": "4712476",
    "Description": "We are seeking a creative and skilled Graphic and Animation Designer to join our team. He\\She will be responsible for creating visually compelling graphics and animations for various platforms, including websites, social media, marketing materials, and more.Responsibilities:1. Collaborate with internal teams to understand project requirements, objectives, and target audience.2. Develop creative concepts and design ideas that align with the project goals and brand identity.3. Design visually engaging graphics and animations for various platforms, including website, socialmedia, print materials, advertising campaigns, and presentations.4. Create and edit layouts, illustrations, logos, icons, and other design elements, ensuring consistencywith brand guidelines.5. Produce high-quality mockups and prototypes to effectively communicate design ideas and concepts.6. Work closely with the marketing team to ensure that the visual design complements the content andmessaging.7. Revise and refine designs based on feedback from internal teams to achieve the desired outcome.8. Manage and prioritize multiple projects, ensuring deadlines and expectations are met.9. Stay up to date with industry trends, best practices, and emerging technologies in graphic design andanimations to continuously improve skills and techniques.10. Maintain organized design files and project documentation for efficient collaboration and futurereference.11. Assist in the development and maintenance of brand guidelines and design templates to ensureconsistency across all visual materials.12. Provide support to other team members as needed, such as mentoring junior designers orcollaborating on cross-functional projects.Skills",
    "Skills": [
        "The ideal candidate will have a strong understanding of design principles, be proficient in various graphic and",
        "animation software, and have a keen eye for detail.",
        "1. bachelor's degree in graphic design, Animation, or a related field.",
        "2. Minimum of 3 years of experience in graphic design and animation.",
        "3. Proficiency in Adobe Creative Suite, including Photoshop, Illustrator, After Effects, and Premiere Pro.",
        "4. Knowledge of 2D and 3D animation techniques and software, such as Maya, Blender, or Cinema 4D.",
        "5. Strong understanding of design principles, typography, color theory, and layout.",
        "6. Excellent attention to detail and the ability to work efficiently in a fast-paced environment.",
        "7. Strong communication and collaboration skills, with the ability to present ideas and concepts",
        "effectively.",
        "8. A diverse portfolio showcasing a variety of graphic design and animation projects.",
        "9. Knowledge of video editing and motion graphics.",
        "10. Good photography skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}