{
    "Job ID": "4715240",
    "Description": "We are looking for an experienced Project Manager who will take on the management of key projects. Project management responsibilities include delivering every project on time, within budget and within scope. Responsibilities:Coordinate internal resources and third parties/vendors for the flawless execution of projects.\nEnsure that all projects are delivered on-time, within scope and within budget.\nAssist in the definition of project scope and objectives, involving all relevant stakeholders and ensuring technical feasibility.Ensure resource availability and allocation.\nDevelop a detailed project plan to monitor and track progress.\nManage changes to the project scope, project schedule, and project costs using appropriate verification techniques.\nMeasure project performance using appropriate tools and techniques.\nReport and escalate to management as needed.\nSuccessfully manage the relationship with the client and all stakeholders.\nPerform risk management to minimize project risks.\nEstablish and maintain relationships with third parties/vendors.\nCreate and maintain comprehensive project documentation.Skills",
    "Skills": [
        "Very good educational background, preferably in the fields of computer science or engineering.\nProven working experience in project management in the information technology sector.Solid technical background with understanding and/or hands-on experience in software development and web technologies.\nExcellent client-facing and internal communication skills.\nExcellent written and verbal communication skills.\nSolid organizational skills including attention to detail and multi-tasking skills.\nStrong working knowledge of Microsoft Office.\nPMP and SCRUM certifications are a plus."
    ],
    "Preferred": {
        "Career Level": "Mid Career"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}