{
    "Job ID": "4715214",
    "Description": "On site, carrying out and implementing Safety Plans and Recommendations that abide to ensure safety aspects for other employees and users.\nRecommend about any current problems that can be a cause of dangerous condition or other \"areas for improvement\" that added safety or ergonomics valuable practice that support operating effectiveness.\nReport or feedback about any inconsistency appeared throughout employees or working areas and provide with suitable solutions in according.\nCollaborate in scheduled or sudden Safety Audits and write down all examined features within the audit for further review and conclusions made on.\nCollaborate in training for a sample Fire Evacuation; by preparation, communication, resources availability, and or other needed features.\nCommunicate follow up records and requirements needed for implementation and managing a Disaster Management and Emergency Plan, through communicate and follow up accountable.\nCollaborate in Safety Awareness Issues; such as operating in systematic approach, implementing awareness sessions, soft copies of bulletin, flyers, leaflet…etc.\nMonitor, supervise, follow up and record fire extinguishers, fire fighting hoses and any other fire fighting equipments' validity, availability, maintenance and follow up getting back safe and normal condition for use.\nCollaborate in preparing the Safety Plans; through record, follow up and enquire about safety ladders, safety equipments and tools…etc.\nConduct on site sample checking for the fire alarms, and fire fighting system…etc.\nProvide the needed assistance for implementing personal safe equipments within the Job Nature requirements; air muffles, protective suits, protective hats, glasses, air plugs, heavy duty shoes…etc, as recommended by Safety Management System.\nRecommend methods to ensure Safe plant and machinery, and safe movement, storage and use of articles and substances, including consistent and regular mechanical and electrical checks on our rides and attractions.\nCheck out the readiness within operational unit that having adequate first-aid boxes and supplies, and record the number and shifts of first aid accountable, and provide with recommendations to train new employees on first aid.\nProvide suitable and current information concerning health and safety policies and practices to the business leaders.\nCollaborate in regular training programs for staff and tenants on Fire and Evacuation and general Health and Safety\nLiaise as necessary with other departments, organizations and relevant authorities and provide assistance and cooperation concerning audits and remedial actions.\nReview prevention and precautions against, or adequate control of, exposure to hazardous substances, and danger from flammable, explosive, electrical, noise, radiation and manual handling risks.\nImplement and train other employees on the outputs gained from risks assessments within all Operations and deliver a status report and recommendations for improvement.\nContinuously seek out and identify opportunities for improvement Safety processes.\nContinuously develop personal skills to coup with ever changing technological developments\nSurveillance and reporting on health and safety practices, systems and accident reportingSkills",
    "Skills": [
        "Working for international companies is advantage.\nFirst Aid Certificate or course.\nFamiliarity with NIOSH, OSHA, ISO 14000, ISO 18000.\nCertified in OSHA, NIOSH, ISO Lead Auditor from Certified Bodies.\nRisk and Hazard Analysis.\nTraining, Communication and Presentation.\nRoot cause analysis and investigation.\nImplementation of Kaizen Methodologies; especially 5s within Manufacturing Environment.\nFamiliarity with ISO14000 or ISO18000."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 0",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Certification / diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}