{
    "Job ID": "4715202",
    "Description": "We are seeking an experienced and highly skilled Construction Project Manager with expertise in Building Projects, Construction Project Management, and Royal Commission regulations. The ideal candidate will have a strong background in the field of infrastructure development, including commercial, industrial, and residential villas. This is a key leadership role where you will oversee all aspects of construction projects, ensuring they are completed on time, within budget, and to the highest quality standards.Responsibilities:Manage and oversee the entire construction project lifecycle, including planning, budgeting, scheduling, and execution.\nEnsure compliance with Royal Commission regulations and requirements throughout the project.\nCoordinate and collaborate with various stakeholders, including architects, engineers, contractors, and subcontractors.\nMonitor project progress, identify potential issues, and implement proactive measures to mitigate risks.\nDevelop and maintain project budgets, track expenses, and provide regular financial reports.\nSupervise and manage on-site construction activities, ensuring adherence to safety standards and quality control.\nReview and approve project designs, specifications, and construction plans.\nConduct regular inspections to ensure work quality and compliance with project requirements.\nManage project documentation, including contracts, permits, and change orders.\nProvide timely and accurate project updates to senior management and clients.Skills",
    "Skills": [
        "Bachelor's degree in Civil Engineering, Construction Management, or a related field.\nProven experience as a Construction Project Manager in building projects, preferably within the Royal Commission framework.\nStrong knowledge and understanding of Royal Commission regulations and requirements.\nExtensive experience in infrastructure development, including commercial, industrial, and residential villas.\nExcellent project management skills, with the ability to oversee multiple projects simultaneously.\nStrong leadership and team management abilities."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building; Construction & Building; Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}