{
    "Job ID": "4715086",
    "Description": "Job Title: Director - SalesKey ResponsibilitiesTo develop, implement, and manage sales strategies, plans, and programs needed to achieve targeted revenue and profit.\nTo maintain effective and cost efficient organization and staffing for Sales and Regional functions, providing each with on-going direction, training, and feedback to ensure productivity and motivation.\nTo produce a definitive business plan in conjunction with Regional Directors / Managers and to ensure Company strategic objectives are met.\nTo review market analyses to determine customer needs, volume potential, prices schedules and discount rates. Develops sales campaigns to accommodate goals of the Company.\nTo coordinate liaison between sales department and other sales related units.\nTo prepare periodic sales report showing sales volume and potential sales.\nTo work with the management team to satisfy consumer needs, develop and nurture new and existing customers, partnerships, strategic alliances, and other market opportunities\nEvaluate performance of executives for compliance with established policies and objectives of the company and contributions in attaining objectives.\nTo assist or ensure payments with respect to invoices are collected in time from customers.\nTo initiate evaluation and training programs for all personnel in order to meet Company business objectives and broaden individual and company skills base for career development\nTo monitor and control the budget and budget-awareness within the department to ensure objectives are met within agreed limitsSkills",
    "Skills": [
        "1.    Requirement open to all Arabs, Kuwaiti nationals will be preferable",
        "2.    A Bachelor’s degree in a relevant discipline (Preferred an MBA)",
        "3.    15 to 24 years in a management role and a total of 10 to 15 years of field sales experience or product line management experience with related products",
        "4.    Wide market exposure in the GCC regions, Asia pacific, African countries are all considered as plus points.",
        "5.    Strong experience in IT Solution selling",
        "6.    Knowledge and ability to apply advanced marketing and strategic consultative selling techniques.",
        "7.    Good grasp of financial management and the bidding process"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15 Max: 20",
        "Residence Location": "All Arab Countries; Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries; Kuwait",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "IT Services; Financial Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}