{
    "Job ID": "4716969",
    "Description": "Job Title: Contract Attorney/Lawyer/Legal Counsel/Location: DubaiAs an In-House Legal Adviser, you will primarily assist the management of the company with the corporate legal documents and processes, support commercial contracts for the provision of new and after-market goods and services.Responsibilities:Setting up entities in Dubai Mainland, DIFC, DMCC, DWTC and other free zones in the UAE;\nDrafting legal documents and commercial agreements in English and supporting throughout the entire process on management instructions;\nLiaising with various authorities (i.e. departments of economic development, free zone authorities, notary publics, and various other ministries and government departments) in order to implement various corporate transactions, such as incorporations, registrations, deregistration, share capital increases and decreases, share transfers, etc.to submit documents on behalf of the company management;\nConducting research on relevant laws and regulations;\nDrafting and amendments of Memorandum and Articles of Association of companies, legal documents, and commercial agreements;\nReview and drafting of internal policies;\nStay up to date with industry-specific legal developments, regulations, and best practices;\nProvide legal advice and guidance to internal teams on day-to-day operational matters.Skills",
    "Skills": [
        "Required Skills and Competencies:",
        "Experience in UAE Corporate Service Provider firm for at least 1 year.\nAcademic and professional legal qualifications (Degree in law)\nUnderstanding and awareness of corporate/commercial law in the UAE.\nKnowledge of actual procedures for UAE mainland, free zones and offshore companies registration and administration;\nFamiliarity with business practices and cultures in in the Middle East.\nProficient technical skills in MS Office Suite;\nGood command of English and precise communication abilities;\nPro-active, analytical and pragmatic mindset and approach.\nLanguage Preference: Russian, English."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Nationality": "Belarus; Kazakhstan; Moldova; Russian Federation; Ukraine; Uzbekistan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Business Support Services; Corporate Management Office; Management Consulting",
        "Company Type": "Unspecified",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}