{
    "Job ID": "4716952",
    "Description": "1. All preventive maintenance works are planned for all equipment in the company's production lines. 2. Follows up the performance of all heads of maintenance departments, coordinates work between them, and overcomes all difficulties for them.  3. Senior management participates in setting specifications for replacement, renewal and development of equipment and new projects  4. Organizes all available resources for the maintenance department to achieve the tasks and responsibilities of the department.  5. The first responsible for the continuity of the work of machines and devices in the factory with full technical competence.  6. Organizes the repair work of equipment and devices, and works on stopping times  Unintentional as little as possible. 7. Develops plans for the needs of spare parts and raw materials for maintenance.8. Responsible for carrying out any other work assigned to him by the factory manager in the field of work. 9. Responsible for implementing the occupational safety and health system in the administration. 10. Participate in the risk analysis of management and the work environment to reduce injuries and spread awareness within Administration.Skills",
    "Skills": [
        "graduates of engineering faculties and experience in the field of maintenance of used equipment and production lines.\nHave a clear vision of project goals and know how to delegate effectively.\nAbility to solve complex issues without any hesitation.\nPortraying clarity on the completion of goals through effective task allocation.\nWell-versed in utilizing technical knowledge and tools as per requirement."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "FMCG; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}