{
    "Job ID": "4716897",
    "Description": "We are searching for a reliable and compassionate home care nurse to join our team. The home care nurse’s responsibilities include performing patient visits and monitoring their conditions, conducting tests, and writing reports for the physician. You should be able to address all the caregivers’ concerns and make appropriate adjustments to the patients’ in-home management plan.To be successful as a home care nurse, you should be a nurturing individual who can handle a wide range of tasks without being squeamish. Outstanding candidates possess the mental strength and resilience to care for patients and are also able to provide emotional support to family members if required.Home Care Nurse Responsibilities:Traveling to patients’ homes and managing their care plans according to physicians’ instructions.\nAdministering medication and insulin, and completing blood pressure, glucose, urine, and stool tests.\nInspecting wounds, changing dressings, and handling personal grooming and hygiene.\nTesting for muscle weakness, bedsores, and any signs of infection.\nListening to the concerns of family members and answering their questions.\nEducating caregivers and family on the aftercare or ongoing care of the patient.\nProviding suggestions for improved healthcare to physicians and family members of the patient.\nMonitoring patient recovery and compiling reports for the physician.\nKeeping abreast of developments in healthcare and attending workshops and lectures as required.\nCollaborating with doctors and other healthcare professionals to develop improved diets and healthcare plans for patients.Skills",
    "Skills": [
        "Home Care Nurse Requirements:",
        "Bachelor’s degree in nursing or similar.\nAdditional courses in biology, anatomy, and science may be required.\nRelevant license and certification.\nA completed apprenticeship or experience in a similar role.\nExcellent observational and problem-solving skills.\nThe ability to follow instructions but also to act independently if necessary.\nExcellent report writing skills.\nActive listening skills and empathy.\nPhysical and mental strength.\nA valid driver’s license and reliable transport may be required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}