{
    "Job ID": "4716618",
    "Description": " Conduct thorough dermatological consultations and assessments of patients. Diagnose and treat various skin conditions, including but not limited to acne, eczema, psoriasis, dermatitis, and skin infections. Perform dermatological procedures such as biopsies, excisions, and cryotherapy. Prescribe appropriate medications, topical treatments, and skincare regimens. Provide cosmetic dermatology services, including Botox, dermal fillers, chemical peels, and laser treatments. Perform skin cancer screenings and provide treatment for skin cancer patients. Educate and counsel patients on skincare practices, preventive measures, and treatment options. Stay updated with the latest dermatological advancements, research, and treatment modalities.Skills",
    "Skills": [
        "Position Title - Dermatologist",
        " Department/Division: Healthcare",
        " Reporting Line Medical Director- Director",
        " Experience Range 5-6 Years",
        "Expected Salary Range TBD",
        " Medical degree from a recognized institution.",
        " Residency or specialized training in dermatology.",
        " Valid medical license and board certification in dermatology.",
        " Proven experience as a Dermatologist, preferably with a minimum of [2] years of",
        "experience.",
        " Proficiency in diagnosing and treating various dermatological conditions.",
        " Strong clinical skills and the ability to provide accurate and effective treatments.",
        " Excellent communication and interpersonal skills to interact with patients and",
        "colleagues."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 6"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}