{
    "Job ID": "4717978",
    "Description": "Write “clean”, well-designed code.\nUtilize appropriate resources to develop efficient PHP modules that can be used again for various applications.\nCollaborate with the company's professionals to plan and implement a streamlined PHP application lifecycle.\nTroubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality.\nExamine the client requirements for adding the required features to the existing software or application.\nSolve complex performance problems and architectural challenges.\nA PHP ecommerce web developer is responsible for designing, developing, and maintaining ecommerce websites using PHP, MySQL, HTML, CSS, and JavaScript. They collaborate with clients or project managers to understand requirements and create functional and visually appealing online stores. They integrate payment gateways, implement security measures, optimize website performance, and troubleshoot issues. Strong problem-solving skills, attention to detail, and knowledge of ecommerce principles are essential for this role.\nFront end: html,css,bootstrap Back end: php or any framework related to php Database: MYSql ,MS Sql Graphic designing: Photoshop, illustrator Additional Skills: C#, Crystal reportSkills",
    "Skills": [
        "Proven software development experience in PHP.\nIn-depth knowledge of website technologies like frameworks, databases, HTML, browsers, and protocols.\nProficient in using third-party application programming interfaces offered by renowned companies like Facebook, Google, or Twitter.\nSkilled developer well-versed in research and utilization of the latest PHP knowledge.\nExhibiting a phenomenal grasp of OOP concepts and the practical utility to develop simple and ergonomic digital applications.\ndegree in Computer Science, Engineering or a related subject."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 20 Max: 35"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "2"
    }
}