{
    "Job ID": "4717075",
    "Description": "1.     تخطيط مسار البيع.\n2.     عرض المنتج للعميل بطريقة احترافية وجذابة.\n3.     دراسة وضع السوق مع الالتزام بخطة المبيعات الخاصة بالقسم.\n1.     التزام المندوب بتجهيز التقرير البيعي في اخر يوم العمل والمطلوب من قبل مدير القسم.\n2.     الالتزام بإتمام الإجراءات البيعية الكاملة حسب سياسات الشركة الخاصة لغايات تحقيق اهداف القسم.\n3.     عند استلام أي طلب من عميل يجب ان يتم خدمته خلال مدة أقصاها 27 ساعة عمل.\n4.     التزام المندوب بتحضير مسودة خطة الشهر اللاحق وتسليمها لمدير القسم لاعتمادها قبل نهاية كل شهر ب 4 أيام عمل.\n5.     متابعة الدفعات الخاصة بالعملاء.\n6.     ابلاغ الجهة المعنية بجهوزية الدفعة لاستلامها.\n7.     الالتزام بتعليمات وتوجيهات الإدارة.\n8.     الالتزام بالتقارير الفنية والإدارية الدورية المطلوبة حسب الإدارة.\n9.     إجراء دراسة السوق ووضع خطة تسويق.\n10. زيارات العملاء حسب جدول الزيارات المعتمد وعرض الخدمة على العملاء المستهدفين.\nبناء العلاقات والتواصل الدائم مع العملاء الحاليين والمحتملين.\nالتجهيز والإعداد المسبق لأي أوراق أو مستندات قد يحتاج إليها العميل لإجراء الاتفاقات وإبرام العقود.\nشرح تفصيلي لكافة منتجات وخدمات الشركة العامل بها، وتشجيع العملاء على اقتنائها.\nالاهتمام بمشاكل العملاء والمساعدة في حلها، ونقل الشكاوى والاقتراحات إلى إدارة الشركة.\nإعداد خطط عمل واضحة (يومية/أسبوعية/شهرية) وإجراء التحسينات الدورية عليها.Skills",
    "Skills": [
        "– اللباقة وحسن الحديث مع العملاء، فلا تنسى أنك تمثل الواجهة الخاصة بالشركة العامل بها.\n– مهارات التواصل والقدرة على بناء العلاقات مع مختلف العملاء.\n– القدرة العالية على الحفظ والتذكر لعدم السهو عن ذكر تفاصيل مهمة عن المنتج أو الخدمة للعميل.\n– سرعة البديهة ومعرفة أفضل الطرق لإقناع العميل بالمنتج أو الخدمة التي تقدمها الشركة.\n– تحمل الضغوط الخاصة بالعمل، فأنت مطالب برسم ابتسامتك أثناء عملك أياً كانت الظروف."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing; Human Resources Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}