{
    "Job ID": "4717467",
    "Description": "A Cost Control Engineer is a professional responsible for managing and monitoring the financial aspects of running projects. Their primary role is to ensure that projects are completed within budget and to minimize financial risks. Here is a typical job description for a Cost Control Engineer:Responsibilities:1. Develop and implement cost control procedures and policies for projects.2. Monitor project budgets, expenditures, and commitments to identify cost variances and potential risks.3. Collaborate with project managers, engineers, and other stakeholders to establish and track project budgets and forecasts.4. Conduct regular cost analysis and cost forecasting to identify potential cost-saving opportunities.5. Review and analyze contractor/subcontractor invoices and change orders to ensure accuracy and adherence to contract terms.6. Participate in project cost estimation and budgeting processes.7. Prepare and present cost reports, including cost performance analysis and variance explanations, to project stakeholders.8. Identify cost trends, risks, and opportunities and make recommendations to project management for corrective actions.9. Monitor procurement activities to ensure compliance with budgetary constraints and cost control objectives.10. Collaborate with the procurement team to evaluate and negotiate contracts with suppliers and vendors to optimize cost-efficiency.11. Maintain accurate and up-to-date project cost data, records, and documentation.12. Stay updated with industry best practices, regulations, and technologies related to cost control and implement them as appropriate.Skills",
    "Skills": [
        "1. Bachelor's degree in engineering, construction management, finance, or a related field.",
        "2. Proven experience in cost control, cost analysis, or a similar role, preferably in a construction or engineering environment.",
        "3. Strong knowledge of cost management principles, budgeting, and forecasting techniques.",
        "4. Proficiency in cost control software and tools.",
        "5. Excellent analytical and problem-solving skills, with attention to detail.",
        "6. Effective communication and interpersonal skills to collaborate with cross-functional teams and present cost-related information.",
        "7. Ability to work independently, prioritize tasks, and meet deadlines.",
        "8. Familiarity with project management methodologies and software is a plus.",
        "9. Knowledge of relevant industry standards, regulations, and compliance requirements.",
        "10. Certification in cost control, project management, or a related field is advantageous."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building; Project & Construction Planning; Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}