{
    "Job ID": "4717068",
    "Description": "Job Responsibility:- Quality Officer reviews the quality control protocols to be implemented on-site or off-site. They perform the QC activities defined in approved QC documents (e.g. ITPs) such as inspection, testing, sampling.- They have the authority to accept or reject the works and produced the QC reports in accordance with Quality Control Plan and associated QC documents- Quality Officer closely coordinates with (RST/DWE, TRW/TRD, COM/SCADA, SIG/PSD, and REL) Section Managers regarding quality-related items.- Quality Officer's main function is assisting the QEHS Section Manager in supporting maintenance entities (RST/DWE, TRW/TRD, COM/SCADA, SIG/PSD, REL). Section Managers in establishing Inspection and Test Plans- Quality Officer must assist the QEHS Section Manager in terms of implementation of approved Inspection and Test Plans- Support Maintenance Team regarding the preparation of Method Statements and ITPs.- Ensuring that materials always meet Project requirements.- Provision of continuous daily monitoring, checking and reporting against approved construction documentation and materials.- Coordinating and cooperating with the site maintenance teams and sub-contractors.- Prepare Non-Conformance Reports, report to the responsible person and follow up for close out.- Report and inform QEHS Section Manager of all requested information.- Raise NCRs as works do not comply with requirements.- Respond to Inspection Requests in a timely manner.Skills",
    "Skills": [
        "Candidate must have a Railway Mobility background",
        "Job Experience:          5-6 years",
        "Industry:                   Traction Power (33kV & 750V DC) System Railway Industry or Sub-station Industry"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7"
    },
    "Data": {
        "Job Location": "Al Muhammadiyah, Riyadh , Saudi Arabia",
        "Company Industry": "Electrical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}