{
    "Job ID": "4718901",
    "Description": "Job DescriptionOur Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary:As an Executive Analyst to the Chief Digital Services Officer, you’ll be working in a strategic team that will act as one of the main catalysts for the organization. The main premise of the job is to work very closely with our Chief Digital Services Officer on project and task management. This position requires someone with good attention to detail and strong administrative skills who is looking for a position that allows them to constantly challenge themselves. The Executive Analyst will be responsible for handling daily administrative support in a well-organized manner. Knowledge in project management, change management, time management and organizational management is required. The Executive Analyst for the DXS Division will also be responsible for logging corporate risks and maintaining a log of Enterprise Updates to ensure synergy and strategic focus among the company.Job Responsibilities:● Dealing with correspondence emails and phone calls.● Responding to/forwarding emails and correspondence as fit.● Managing calendar and organizing meetings and appointments often controlling access to the manager/executive.● Keeping CDSO up-to-date on all pending tasks and deadlines.● Attending all key meetings with CDSO to track action items and next steps.● Determine matters of top priority and handle accordingly.● Booking and arranging travel transport and accommodation.● Organizing executive/company/team events.● Producing reports, presentations and briefs.● Preparing monthly expense reports.● Researching and collecting financial statistical technical and specialized data from multiple sources for assigned research and special projects including the compilation and completion of a variety of complex and time-sensitive reports.● Performing data analyses and comparisons.● Designing, developing and/or maintaining specialized databases using standard spreadsheet software.● Translating concepts and information into images.● Keeping a log of Enterprise Updates.● Logging and tracking key action items for the CDSO.● Flagging corporate risks to the Internal Consultants.● Assisting departments when needed.● And other tasks requested by the supervisor.Skills",
    "Skills": [
        "The right person for this job would have to have strong written and oral communication skills in English and exceptional interpersonal skills.",
        "Needed Competencies:",
        "Analytical minded - There will be many times where you will be asked for support in market research data analysis and situation analysis.\nGreat communication skills (written and spoken) - There will be many times where you will be needed to support content creation that will be targeting executives of multi million/billion-dollar companies, government officials, internal global staff and more.\nCreativity - There would be times you need to support the creation of PowerPoint presentations for investors the board external customers internal teams and other key stakeholders\nBrand mind- You will need to support the building of the executive's brand. Putting together a marketing plan to layout social media and event calendars\nTime management - Your direct manager is one person playing key roles of the company that is in hyper-growth mode. We need someone that can really help manage his time and deliverables.\nTechnically capable - There will be an expectation of data entry tasks like helping CDSO enter leads opportunities, sales quotes and orders in our internal ERP.",
        "Education:",
        "BA/BS degree in Computer Science, Business Administration, or any other related field",
        "Experience:",
        "3+ years of experience in Administrative Project Management Marketing Sales HR or familiar fields.",
        "Knowledge, Skills and Abilities:",
        "Excellent research skills\nPast experience in a tech role is highly preferable\nNative or excellent written and verbal English skills is a hard must",
        "Preferences:",
        "Experience in the technology or utility industry\nPreferably holder of an American or EU passport",
        "Travel:",
        "Upon request by Executives",
        "Work Schedule:",
        "Flexible."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}