{
    "Job ID": "4718902",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary:As Avertra’s Internal Financial Consultant, your mission would be ensuring company wide synergy with the corporate goals and strategy, as well as working towards achieving operational harmony in the Financial space. You would be working with the Executive team to provide financial guidance and ensure that the CEO has all of the data and analysis necessary to make detrimental company decisions. The ideal candidate for this position would be proactive, data driven, bright with numbers, and highly organized. Job Responsibilities:Internal Project Management:Kickoff of internal projects to stabilize, enhance, and optimize operational gaps and processes where there is a financial impact (Finance, Budgeting, Tax, Financial Planning, Treasury, Accounting, AR/AP, etc)\nManage the internal projects by issuing tasks and ensuring timely and effective completion with KPIs\nPerform “post project closing” activities to ensure proper change management and maintenance\nTrack and assess impact logging of related new policies (if any) or change to existing\nLooking for areas of improvement and adding them to process optimization logFinancial Report Audits:Auditing income statements\nAuditing cash flow statements\nAuditing cost tracking\nAuditing budget trackingFinancial Analysis:Analyzing financial impact of delayed projects\nAnalyzing financial impact of benched or un-utilized resources\nDetermining ROI on upcoming projects \nReporting on financial ratios to indicate corporate health metrics\nFlagging financial risks and bleeders\nDriving the creation of drill down dashboards\nDriving the creation of a CEO dashboard\nAssisting CEO with financial reportsSystem Upkeep:Review and understand existing system and how different modules feed into Finance\nEnsure and govern correct use of Avertra’s ERP system in the financial capacity\nEscalate and deal with misuse of Avertra’s ERP system in the financial capacity\nResearch potential areas of improvement or automation of system interactionCorporate Goals Governance:Track progress against financial goals\nFlag risks where non-completion could be a possibilityResearch: Entering new countries and creating new entities\nKeeping track of laws to track financial exposure for each country we operate in\nBrainstorm and research capital-raising insights and opportunities.Skills",
    "Skills": [
        "Needed Competencies:",
        "Financial Competency: Knowledge in what reports and ratios are needed to indicate corporate health as well as how to generate them is a must. \nAttention to Detail: Excellent analytical skills, along with the ability to create detailed reports\nInterpersonal Communication: It is imperative that you are able to connect and develop relationships with various stakeholders in the organization at various seniority levels, all the way from Chiefs to juniors. \nRisk & Impact Assessment: Ability to assess and manage risks and impact in the process of decision making. \nCreativity: Since this role goes beyond reporting, creativity is key in order to be able to develop the best solutions that are unique to the context at hand. \nData Visualization: Data visualization is a must have",
        "Education:",
        "A bachelor’s degree in finance, economics, business, accounting, or a related major is required.\nA master’s degree in finance, economics, business, accounting, or a related major is a plus.",
        "Experience:",
        "3+ years of experience in a Finance or Research related role",
        "Knowledge, Skills and Abilities:",
        "Excellent research skills\nNative or excellent written and verbal English skills are a hard must",
        "Preferences: ",
        "Experience in the technology or utility industry\nPreferably holder of an American or EU passport\nExperience in one of the Big Four companies \nExperience with US GAAP and IFRS",
        "Travel:",
        "Upon request by Executives",
        "Work Schedule:",
        "Local Jordanian office hours with flexibility."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}