{
    "Job ID": "4718332",
    "Description": "Job Purpose:As an IT System Administrator, you will be responsible for supporting the IT team in managing and maintaining the AMF's IT infrastructure, ensuring optimal performance and security. You will work closely with the IT team to design, implement, and support various systems, including VMware, Linux, and Windows Server environments. Additionally, you will be responsible for providing Oracle database administration support as needed.Key Responsibilities:Install, configure, and maintain VMware, Linux, and Windows Server environments, ensuring optimal performance and security.\nProvide system administration support for Linux, Windows Server, and VMware platforms, including monitoring, troubleshooting, and resolving technical issues.\nImplement and manage virtualization technologies, including VMware vSphere, vCenter, and ESXi.\nDesign and maintain server infrastructure, including storage, network, and backup systems.\nManage system and data backups, ensuring data integrity and availability.\nPerform regular system updates, upgrades, and patch management to maintain the security and stability of the IT infrastructure.\nMonitor system performance and capacity, recommending and implementing necessary improvements.\nAssist in the administration and maintenance of Oracle and/or SQL Server databases, providing support for performance tuning, security, and backup/recovery processes.\nCollaborate with the IT team on IT projects and initiatives, providing relevent technical expertise and support as needed.\nDevelop and maintain system documentation, including policies, procedures, and technical guides.\nProvide training and guidance to other team members on IT-related matters.\nMaintain up-to-date knowledge of industry trends and emerging technologies to ensure the IT infrastructure remains competitive.Skills",
    "Skills": [
        "Required Skills & Qualifications:",
        "Bachelor's degree in Computer Science, Information Technology, or a related field.\nIndustry certifications, such as VMware Certified Professional (VCP), Linux Professional Institute Certification (LPIC), or Microsoft Certified Solutions Associate (MCSA), are highly desirable.\nMinimum of 5 years of experience in IT system administration, with a strong focus on VMware, Linux, and Windows Server environments including installation, configuration, and administration. knowledge of virtualization technologies, particularly VMware vSphere, vCenter, and ESXi.\nFamiliarity with Oracle database administration, including performance tuning, security, and backup/recovery processes.\nKnowledge of networking concepts and protocols, such as TCP/IP, DNS, and DHCP.\nExperience with storage technologies, including SAN and NAS.\nStrong problem-solving and troubleshooting skills, with the ability to diagnose and resolve technical issues and document resolutions promptly. \nGood communication and interpersonal skills, with the ability to effectively collaborate with team members and stakeholders.\nHighly organized and detail-oriented, with the ability to manage multiple tasks and priorities simultaneously.",
        "The AMF offers competitive terms of service in accordance with the applicable employment policy, which includes tax free salary, housing allowance, furniture allowance, air ticket allowance, education allowance, and defined life and medical insurance.",
        " Only short-listed candidates will be contacted."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}