{
    "Job ID": "4718906",
    "Description": "Job Summary:The Personnel Lead will oversee global personnel aspects that include, but are not limited to labor law compliance in countries we are currently established in, providing comprehensive opinion based on research and analysis of labor law in countries we are looking to become established, and managing, creating, updating and implementing company policies and procedures. In addition, the candidate will manage the documentation of Avertra's employees, as well as liaising with other internal departments to review areas of non-compliance or required enhancements.. This position requires someone with a persistent and motivated personality, extremely detail-oriented, excellent verbal and written communication skills, and strong administrative skills.Job Responsibilities:Oversee personnel records and document compliance (e.g. Employee Contracts)\nManage/create/update/implement/communicate policies and procedures.\nWork with Operations Lead/Legal Counsel to maintain and circulate documents related to Avertra’s policies and procedures that impact the personnel of Avertra.\nOversee onboarding/off-boarding from a compliance perspective only\nWork with the Operations Lead/Legal Counsel to keep abreast of Labor Laws and collective bargaining in countries we are establishing in\nParticipate in meetings between labor and management\nLiaising with Talent Management to develop and onboarding documentation l from a compliance perspective\nResearch best practices in human performance designs and systems.\nLiaise with the other departments to facilitate processes and procedures.\nAssist management during crisis situations, such as labor strikes or high risk employee liability issues, to facilitate effective negotiations and resolve issues quickly\nPerforms miscellaneous job-related duties as assigned.Skills",
    "Skills": [
        "Needed Competencies:",
        "Expert attention to detail\nOrganizational skills\nNegotiation skills\nExcellent research skills\nExcellent documentation skills in English and Arabic\nExcellent Communication skills\nLeadership skills\nTeam player\nMotivated and determined \nProven ability to meet deadlines\nObjective, fair-minded person to mediate disputes\nAbility to make initiatives\nFirm understanding of legal contract language",
        "Education:",
        "Law degree.",
        "Experience:",
        "2-5 years of Labor Law experience",
        "Knowledge, Skills, and Abilities:",
        "Ability to handle multiple issues and conflicts.\nKnowledge of Jordanian Labor and SSC laws and legislations\nAbility to multitask, prioritize and manage time efficiently\nStrong interpersonal communication skills\nExcellent verbal and written English language.\nMust be willing to be hands-on",
        "Preferences:",
        "Have worked in a multinational company\nKnowledge or ability to learn of US/UAE/India culture and labor laws",
        "Travel:",
        "Might need to travel to the US, India, or UAE as internal tasks dictate but not probable",
        "Work Schedule:",
        "Flexible hours to cover all Avertra branch locations",
        "Benefits",
        "What can we promise you: ",
        "You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}