{
    "Job ID": "4718856",
    "Description": "Job Summary The Chief Internal Audit Officer serves as the Head of Internal Audit Activity and as a member of the executive management team. Performs advanced level professional internal auditing workaday component ofSCC’sgovernancestructure.Work involves directing a comprehensive audit program including performance, financial, and compliance audit projects; providing consulting services to SCC’smanagement and staff; providing direction to the development of the annual audit plan; and providing ongoing training, coaching, and supervision to internal audit staff. Maintains SCC’s professional ethical standards and works independently with extensive latitude for initiative and independent judgment. Duties & ResponsibilitiesPrimary Duties & Responsibilities Directs audit staff in the planning, organizing, directing, and monitoring of internal audit operations, including assisting in hiring, training, and evaluating staff;and taking corrective actions to address performance problems. \nDirects the identification and evaluation of SCC’s risk areas and oversees the development of the annual audit plan. \nDirects the overall performance of audit procedures, including identifying and defining issues, developing criteria, reviewing,and analyzing evidence,and documentingauditee’s processes and procedures. \nDirects the audit staff in conducting interviews, reviewing documents, developing,and administering surveys, composing summary memos,and preparing working papers. \nDirects the audit staff in the identification, development,and documentation of audit issues and recommendations. \nDevelops and maintains productive relationships with the auditee, staff, management,and Audit Committee through individual contacts and meetings. \nPursues professional development opportunities, including internal and external training and professional association memberships,and shares information gained with co-workers. Represents internal audit management and Audit Committeemeetingsand with external organizations. \nPerforms related work as assigned by the Audit Committee. \nCommunicates the results of audit and consulting projects via written reports and oral presentations to management and the Audit Committee. \nLeading the Risk team effectively to perform a Risk assessment as per the approved Risk Plan. Define and evaluate proper controls for each risk mentioned in the Risk Plan. \nProvide quarterly report about Risk activities to Audit Committee. \nCommunication Channel Internal Communication Saudi Ceramics Corporate Divisions Heads. Saudi Ceramics Business Units Heads External Communication External and contract auditors/consultants Other industry organizations. Skills",
    "Skills": [
        "Education ",
        "Bachelor’s degree (in accounting, business administration, public administration, or a related field) from an accredited college or university \nMaster’s degree (in accounting, business administration, public administration, or a related field) from an accredited college or university \nRequirements\nCertification as a Certified Internal Auditor (CIA), Certified Public Accountant (CPA) or (SOCPA), Chartered Accountant (CA), or equivalent. \n10 years of full-time experience in auditing, accounting, business analysis, or program evaluation, including seven years of supervisory or project management experience. \nExtensive knowledge of and skill in applying internal auditing and accounting principles and practices, and management principles preferred business practices. \nConsiderable knowledge of the standards for the professional practice of Internal Auditing and the Code of Ethics developed by the Institute of Internal Auditors. \nKnowledge of management information systems terminology, concepts,and practices. Considerable knowledge of program policies, procedures, regulations,and laws. \nConsiderable skill in conducting quality control reviews of audit work products. \nSkill in collecting and analyzing complex data, evaluating information and systems,and drawing logical conclusions. \nExtensive skill in planning and project management,and maintaining composure under pressure while meeting multiple deadlines. \nConsiderable skill in negotiating issues and resolving problems. \nSkill in using a computer with word processing, spreadsheet,and other business software to prepare reports, memos, summaries,and analyses. \nConsiderable skill in effective verbal and written communications (English and Arabic), including active listening skills and skill in presenting findings and recommendations. \nAbilityto establish and maintain harmonious workingrelationships with co-workers, staff,and external contacts,and to work effectively in a professional team environment. \nCompetencies \nAnalytical Thinking \nCoaching & Mentoring \nCrisis Management & Resolution \nDecision Making \nExecutive Development \nImpact and Influence \nLeading and Managing Change \nLoyalty & Dedication \nManaging People \nRelationship Building \nVisioning and Alignment \nWork Ethics and Values \nKey Performance Indicators"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}