{
    "Job ID": "4718884",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary:The SAP BYD Support Associate will be responsible for improving the SAP ByD solution through proposing and implementing enhancements along with reflecting various departments requirements on the system. He/she will also be responsible for required system documentation, knowledge transfer, training and support for stakeholders and users.The SAP BYD Support Associate will be expected to keep up with changes in available BYD functionality or associated technology and will be given the appropriate support to do this.Job Responsibilities:Responsible for gathering Business Requirements.\nWorking on scoping and fine-tuning.\nStrong knowledge on adding extension field s and reports.\nTesting scenarios as per the stakeholders requirement.\nWorking on dashboard.\nGiving training to the end user.\nWorking on support ticket on HRM, CRM, PM, Finance module.\nCreating customized reports as per the requirements sent by Business Users.\nSolving support tickets raised by the end users.\nKeep the end users updated about SAPs new releases and document its highlights relevant to our Business processes.Skills",
    "Skills": [
        "Needed Competencies:",
        "communication skills.\nsystems thinking.\nquantitative skills.\ncomputer skills.\ninterdisciplinary thinking skills.",
        "Education:",
        "BSC degree / IT Degree.",
        "Experience:",
        "6+ years of experience as SAP (ByD(CRM, SRM, SCM, HRM, PM).",
        "Knowledge, Skills and Abilities:",
        "Excellent working knowledge of SAP BYD.\nBYD project lifecycle experience and be comfortable with.\nSystem demonstrations and participation in pre-sales activities.\nRunning workshops & interacting with the customer to resolve issues.\nBYD solution design, configuration and testing.\nKnowledge Transfer to customer project teams.\nTools and methodologies to promote efficient data handling and migration.\nCreation of solution and other project required documentation.\nStrong verbal and written communication skills.\nA commercial awareness of activities associated with consultant project delivery.",
        "Preferences:",
        "Certified in BYD by SAP.",
        "Travel:",
        "Depending on project needs.",
        "Work Schedule:",
        "12am - 9pm (India)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6"
    },
    "Data": {
        "Job Location": "New Delhi, India",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}