{
    "Job ID": "4718908",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary:Responsible for leading the development and implementation of marketing strategies for Avertra’s Digital Experience Products (DXP) business lines.Job Responsibilities:Conduct market research to understand target audiences, competitive landscape, and market trends.\nDevelop and execute marketing plans for Avertra’s DXP, including positioning, messaging, pricing, and go-to-market strategies.\nCollaborate with cross-functional teams, including Customer Success management, and sales, to ensure alignment and effective execution of marketing plans.\nAnalyze customer feedback to improve marketing strategies.\nManage DXP business line launches, including planning, execution, and post-launch analysis.\nDevelop and execute, presentations, and other marketing materials to support sales and business development efforts.Skills",
    "Skills": [
        "Needed Competencies:",
        "Strategic thinking and planning.\nAnalytical and problem-solving skills.\nCustomer focus and relationship management.\nCommunication and interpersonal skills.\nProject management and organizational skills.\nCreativity and innovation.\nResults orientation and accountability.\nAdaptability and flexibility.",
        "Education:",
        "BSc degree in Marketing or relevant field.",
        "Experience:",
        "Minimum 8 years of experience in software design usability, and Product Management.",
        "Knowledge, Skills, and Abilities:",
        "● Strong understanding of marketing principles and techniques, as well as the service industry.",
        "● Ability to manage multiple projects and priorities in a fast-paced environment.",
        "● Proficient in using marketing tools and software such as CRM, email marketing, and analytics platforms.",
        "● Knowledge of market research and analysis techniques.",
        "● Ability to analyze market trends, competition, and customer feedback to improve marketing strategies and service offerings.",
        "● Excellent communication, interpersonal, and relationship-building skills.",
        "● Results-oriented.",
        "● Creative and innovative thinking skills to develop new and effective marketing strategies.",
        "Preferences:",
        "● Strong project management skills",
        "● Analytical skills",
        "● Master's degree or higher",
        "● Knowledge of digital marketing",
        "● Experience with software marketing",
        "Travel:",
        "Travel to the US, UAE, and other locations as needed for marketing events",
        "Work Schedule:",
        "Flexible schedule per Marketing Director and team needs"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}