{
    "Job ID": "4718141",
    "Description": "Responsibilities:Oversee and manage all operational aspects of the perfume brand in Riyadh, including retail stores, inventory management, logistics, and customer service.\nDevelop and implement operational strategies to optimize efficiency, productivity, and profitability.\nEstablish and maintain strong relationships with suppliers, distributors, and partners to ensure timely delivery of products and services.\nMonitor and analyze key performance indicators (KPIs) to identify areas for improvement and implement appropriate measures.\nCollaborate with the marketing team to plan and execute promotional activities and campaigns to drive sales and brand awareness.\nManage and motivate a team of employees, providing coaching, training, and performance feedback to ensure high levels of productivity and customer satisfaction.\nEnsure compliance with company policies, procedures, and legal regulations at all times.\nConduct regular market research to stay updated with industry trends and competitor activities.Skills",
    "Skills": [
        "Are you an experienced and dynamic professional looking for an exciting opportunity in the world of perfumes? We are currently seeking a talented Operation Manager to join our prestigious perfume brand in Riyadh. As an Operation Manager, you will play a crucial role in ensuring the smooth and efficient operation of our business, contributing to its growth and success.",
        "Requirements:",
        "Bachelor's degree in Business Administration, Operations Management, or a related field. A master's degree is a plus.\nProven experience of at least 5 years in operations management, preferably in the retail or perfume industry.\nStrong leadership skills with the ability to effectively manage a diverse team and foster a positive work environment.\nExcellent problem-solving and decision-making abilities to handle operational challenges and meet business objectives."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}