{
    "Job ID": "4718894",
    "Description": "Full-time Workforce Planning LeadJob DescriptionOur Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.We are seeking a highly experienced and strategic Workforce Planning Lead to join our People & Culture division. In this role, you will be responsible for developing and implementing strategies to optimize the organization's workforce. This includes forecasting workforce needs, identifying skills gaps, and developing plans to address them. The Lead will also be responsible for monitoring and analyzing workforce data to identify trends and make recommendations for improvement.Main Job Responsibilities:Workforce Planning:Develop and implement workforce planning strategies to optimize the organization's workforce.\nForecast workforce needs and identify skills gaps.\nDevelop plans to address skills gaps and improve workforce performance.\nMonitor and analyze workforce data to identify trends and make recommendations for improvement.\nCollaborate with People & Culture and department managers to implement workforce plans.\nMonitoring current skill sets, creating necessary resource gap analyses, and sharing findings with the Talent Specialists and Leads to formulate hiring needs\nOverseeing all resources, optimizing the allocation of existing resources and understanding the need to bring in new resources based on project demand intake\nCommunicating and collaborating with the PMO in regards to resource management plans,needs and appropriate allocationCommunication:Communicate workforce plans and progress to senior leadership.\nCollaborate with the Talent Specialists, Talent Leads and department managers to ensure alignment of workforce plans with departmental and organizational goals.\nProvide regular reports and updates on workforce planning to senior management and the Talent Manager.Project Management:Lead and manage the workforce planning process.\nCoordinate with other departments and functions to ensure alignment of workforce plans with overall organizational goals.\nManage and prioritize multiple projects and initiatives related to workforce planning.\nMonitor progress and make adjustments to plans as needed.General Responsibilities:Continuously monitor workforce performance and make recommendations for improvement\nIdentify and implement best practices in workforce planning\nStay current with new trends and developments in workforce planning and analysis\nProvide guidance and support to department managers on workforce planning issues\nEnsure that data used for workforce planning is accurate and up-to-date\nEnsure that all workforce plans are in compliance with company policies and proceduresSkills",
    "Skills": [
        "Needed Competencies:",
        "Strategic thinking and planning: The ability to think strategically and develop long-term workforce plans that align with organizational goals and objectives.\nAnalytical and data analysis: The ability to analyze workforce data, identify trends, and make recommendations for improvement.\nCommunication and interpersonal skills: The ability to effectively communicate workforce plans and progress to senior leadership and collaborate with HR and department managers to implement them.\nLeadership and project management: The ability to manage and direct the workforce planning process and ensure it aligns with organizational goals.\nProblem-solving: The ability to identify and solve problems related to workforce planning, such as skills gaps and retention issues.\nKnowledge of workforce planning tools and technologies: Familiarity with software and tools used in workforce planning and analysis, such as SuccessFactors, Workday, SAP, etc.\nOrganizational and time-management skills: The ability to manage multiple projects and priorities simultaneously.\nAttention to detail: The ability to work independently and with minimal supervision and ensure data used for workforce planning is accurate and up-to-date.",
        "Education:",
        "Bachelor's degree in Human Resources, Business Administration, or a related field",
        "Experience:",
        "5-7 years of experience in workforce planning and analysis\nExperience with data analysis and reporting tools",
        "Knowledge, Skills and Abilities:",
        "Knowledge of workforce planning and analysis, including forecasting, data analysis, and learning and development needs.\nKnowledge of human resources principles and practices, including recruitment, selection, training, and development.\nExcellent communication and interpersonal skills\nProficient in Microsoft Office and HR-related software\nStrong organizational and time-management skills, including the ability to manage multiple projects and priorities simultaneously.\nStrong attention to detail and ability to work independently and with minimal supervision.",
        "Preferences:",
        "Any form of HR certification (SHRM, CIPD…etc)\nPMP certified\nMBA"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}