{
    "Job ID": "4718041",
    "Description": "3D Designer / SaudiResponsibilities:Collaborate with clients and project stakeholders to understand project requirements and objectives.\nCreate detailed 3D models, textures, and animations based on provided specifications or conceptual designs.\nDevelop 3D visualizations, renderings, and animations to effectively communicate design concepts.\nIncorporate client feedback and make necessary revisions to achieve the desired final product.\nEnsure that all 3D designs are accurate, visually appealing, and adhere to project deadlines.\nWork closely with the design team to integrate 3D elements into multimedia presentations, videos, and interactive applications.\nStay updated on industry trends, new technologies, and advancements in 3D design software.\nCollaborate with other designers, artists, and animators to maintain consistency and quality across design projects.\nProvide creative input and contribute to the ideation and concept development process.\nParticipate in design reviews, presentations, and client meetings to showcase and explain design concepts.\nMaintain organized files and documentation of 3D assets, including models, textures, and project specifications.\nEnsure compliance with copyright and intellectual property regulations in the use of reference materials and assets.المسؤوليات:التعاون مع العملاء وأصحاب المشاريع لفهم متطلبات المشروع والأهداف.\nإنشاء نماذج ثلاثية الأبعاد مفصلة وتكوينات وتحريكات بناءً على المواصفات المقدمة أو التصاميم المفهومية.\nتطوير تصورات ثلاثية الأبعاد وصور مرئية وتحريكات للتواصل بشكل فعال لمفاهيم التصميم.\nدمج تعليقات العملاء وإجراء التعديلات اللازمة لتحقيق المنتج النهائي المرغوب فيه.\nالتأكد من أن جميع تصاميم ثلاثية الأبعاد دقيقة وجذابة بصريًا وتلتزم بالمواعيد النهائية للمشروع.\nالعمل بشكل وثيق مع فريق التصميم لدمج عناصر ثلاثية الأبعاد في العروض المتعددة الوسائط ومقاطع الفيديو والتطبيقات التفاعلية.\nمتابعة أحدث الاتجاهات والتكنولوجيات والتقدم في برامجي تصميم ثلاثي الأبعاد.\nالتعاون مع فرق التصميم الأخرى والفنانين والرسامين للحفاظ على التسلسل والجودة في مشاريع التصميم.\nتقديم المساهمة الإبداعية والمشاركة في عملية الابتكار وتطوير المفاهيم.\nالمشاركة في استعراضات التصميم والعروض واجتماعات العملاء لعرض وشرح مفاهيم التصميم.\nالحفاظ على ملفات منظمة ووثائق لأصول ثلاثية الأبعاد، بما في ذلك النماذج والتكوينات ومواصفات المشروع.\nضمان الامتثال لحقوق التأليف والملكية الفكرية في استخدام المواد والأصول المرجعية.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Bachelor's degree in Graphic Design, Animation, Computer Graphics, or a related field. Equivalent work experience will also be considered.\nProficiency in 3D modeling software, such as Autodesk 3ds Max, Maya, Blender, or similar.\nStrong artistic and creative skills with a keen eye for detail and aesthetics.\nExcellent understanding of 3D design principles, texturing, lighting, and rendering techniques.\nKnowledge of animation principles and techniques, including keyframing and rigging.\nFamiliarity with virtual reality (VR), augmented reality (AR), or other interactive 3D technologies is a plus.\nStrong portfolio showcasing 3D design skills and previous work samples.\nExcellent communication and presentation skills, with the ability to effectively communicate design concepts and ideas.\nAbility to work both independently and collaboratively in a fast-paced, deadline-driven environment.\nStrong problem-solving skills, with the ability to find creative solutions to design challenges.\nKnowledge of graphic design principles, composition, and color theory.\nUnderstanding of project management principles and the ability to manage multiple projects simultaneously.",
        "درجة البكالوريوس في تصميم الرسومات، والرسوم المتحركة، والرسومات الحاسوبية، أو مجال ذي صلة. ستُنظر الخبرة المعادلة أيضًا.\nإجادة استخدام برامج تصميم ثلاثي الأبعاد مثل Autodesk 3ds Max، Maya، Blender، أو برامج مماثلة.\nمهارات فنية وإبداعية قوية مع القدرة على التركيز على التفاصيل والجماليات.\nفهم ممتاز لمبادئ تصميم ثلاثي الأبعاد، وتكويناته، وتوضيحه، وتقنيات الإضاءة والتقديم.\nالمعرفة بمبادئ وتقنيات الرسوم المتحركة، بما في ذلك التحريك الأساسي والتجهيز.\nالمعرفة بتقنيات وتقنيات الواقع الافتراضي (VR)، والواقع المعزز (AR)، أو تقنيات ثلاثية الأبعاد التفاعلية الأخرى تعتبر مالإضافة.\nحافظ على ملف شخصي قوي يبرز مهارات تصميم ثلاثي الأبعاد ونماذج العمل السابقة.\nمهارات اتصال وتقديم ممتازة، مع القدرة على التواصل بشكل فعال لمفاهيم التصميم والأفكار."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}