{
    "Job ID": "4718903",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.We are seeking a highly experienced and strategic Talent Management Lead to join our People & Culture division. The Talent Management Lead will be responsible for leading the development and implementation of talent management strategies and programs that support the overall business objectives of the organization. This includes managing the talent acquisition process, leading employee engagement initiatives, and creating opportunities for professional development and advancement.Main Job Responsibilities:Develop and implement effective recruitment strategies that align with the organization's business objectives.\nManage the talent acquisition process, including recruiting, interviewing, and onboarding new employees.\nDevelop and maintain relationships with universities and other sources of potential candidates.\nMaking sure roles are being closed in a timely manner.\nAlignment with set KPIs and benchmarks and set up scorecards per Talent Specialists.\nCreating monthly and quarterly recruitment reports to be shared with the Talent Manager.\nEnsuring all data on the ATS is up-to-date.\nMentorship and training of Talent Specialists as needed.\nProvide support to the Talent Specialists in distributed roles as needed and required.Skills",
    "Skills": [
        "Requirements",
        "Needed Competencies:",
        "Strong leadership and management skills.\nExcellent communication and interpersonal skills.\nStrong problem-solving and analytical abilities.\nProven ability to create and implement effective talent management strategies and programs.\nKnowledge of HR laws and regulations.\nStrong Project Management skills.",
        "Bachelor's degree in Human Resources, Business Administration, or related field",
        "Experience:",
        "5-7 years of experience in talent management and/or human resources.\nPrevious recruitment experience (either as a senior or a lead) is a must.\nProven ability to create and implement effective talent management strategies and programs.",
        "Knowledge, skills and abilities:",
        "Proficient in using HRIS and Applicant Tracking Systems.\nStrong understanding of recruitment trends and best practices.\nStrong knowledge of performance management and employee engagement strategies.",
        "Preferences:",
        "Any form of HR certification (SHRM, CIPD…etc)\nPMP certified\nMBA"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}