{
    "Job ID": "4718900",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer-centric industries, like Utilities, Financial Services, Logistics, and commerce. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.As the MiCustomer UI designer, you will be working with customers to understand real requirements from a UI point of view, defining potential UI changes from experience, prototyping quick mockups for any initial design, getting customer feedback to iterate, and designing high-quality UI according to modern design principles.Job Responsibilities:Translate concepts into user flows, wireframes, mockups and prototypes that lead to intuitive user experiences\nIdentify design problems and devise elegant solutions\nEnsure a standard of style, typography, colors, and imagery is maintained\nDesign mockups that will serve as prototypes for sales demos of the MiCustomer product\nTake a user-centered design approach and rapidly test and iterate your designs\nCollaborate with other team members and stakeholders\nCreate prototypes for testing to ensure the design meets business and user objectives\nRecommend user experience improvement opportunities \nDesign UI elements such as input controls, navigational components and informational components\nDesign UI following industry best practices that applies under the Avertra’s methodology\nAssist with managing multiple projects under tight deadlines across a broad variety of product categories and audiences\nKeep the line of products design’s consistent and up-to-date\nInvestigate and keep himself/herself up-to-date with new tendencies and practices\nSupport the company’s departments in UI efforts\nWork with UI developers during construction/code of User Interface to ensure the design is as developed as plannedSkills",
    "Skills": [
        "Needed Competencies:",
        "Entrepreneurial and innovative mindset\nQuality-Based Thinking\nDesign-thinking\nProblem-solving\nAttention to detail\nGreat written and verbal communication skills\nCritical thinking skills\nTime management",
        "Education:",
        "Bachelor's degree in Graphic Design, User-Centered Design/Human-Computer Interaction, or the equivalent combination of education, training, and experience",
        "Knowledge, Skills, and Abilities:",
        "Ability to work with remote team\nAbility to work for multiple agile projects\nAbility to manage tough clients and stakeholder\nHuman Centric Design Methodology \nRequirements Analysis \nAbility to iterate designs and solutions efficiently and intelligently.\nClearly and effectively communicate design processes, ideas, and solutions \nUser-centred design and design thinking.\nInformation Architecture\nInteraction Design\nUsability Engineering\nVisual Design\nPrototype Engineering\nStrong experience using Figma, Lucidchart",
        "Preferences:",
        "Graphic Design Certificates\nAgile certification from a reputable methodology provider (Scrum Alliance, SAFe)",
        "Travel:",
        "Depending on project needs.",
        "Benefits",
        "What We Can Promise You:",
        "You’ll join a global family of people working together to build an ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cali, Colombia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}