{
    "Job ID": "4718981",
    "Description": "Working with the team to design, document, build, secure, and maintain Elasticsearch, Logstash, and Kibana (Elastic Stack) Enterprise solutions deployed in the cloud or at customer Datacenter to support non-production and production deployments.\nWorking closely with architects, engineers, and integrators to assess customer requirements and to design and support an Elastic Stack solution to ensure compliance with data requirements.\nFollow life cycle processes to move solutions from Dev to Test to Pre-Staging to Production.\nConfiguring and maintaining Linux-based Operating system files in support of the Elasticsearch products (yum updates and product version upgrades).\nInstalling and configuring an Elastic Cloud Enterprise (ECE) or ECK.\nFinding solutions in non-production and production environments and ensuring communication and integration among the Elasticsearch products and data sources.\nDocumenting the installation and configuration for deployment into production\nSecuring the solution by being familiarity with TLS, certificates, SSO/PIV authentication, and encryption technologies\nDeveloping and applying quantitative and qualitative analytic methods to identify, collect, process and analyze large data sets for specified purposes\nWorking with data lifecycle management.\nTesting data flows, troubleshooting issues, and monitoring the health of the solution and servers to maximize performance and minimize downtime.\nParticipating in group sessions as well as attend and share in agile meetings to track progress to ensure development of solutions is in support of Acuative project and customer requirements\nServing as a trusted advisor, providing subject matter expertise, guidance, and best practice recommendations.Skills",
    "Skills": [
        "Fresh graduate engineers are required for this project:",
        "Any experience in the field is a plus\nDegree in Data Science and AI"
    ],
    "Preferred": {
        "Career Level": "Fresh Graduate"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}