{
    "Job ID": "4718899",
    "Description": "This is a remote position.Job Summary:As the MiCustomer Portfolio Product Manager (experience)n, you will handle a client or group of clients during the inception, delivery, and transition phases. You will build the portfolio Vision and strategy by analyzing the client’s initiatives, defining goals, evaluating KPIs, analyzing market and competitive trends, and ultimately making product and project decisions based on evidence and insights.You will lead a team of Software Product Managers and Product Owners, providing them with alignment with business priorities and client needs from concept to launch, focusing on timely delivery, holistic product quality, development, software architecture and an effective user experience.Job Responsibilities:Core Responsibilities:Define the Portfolio Vision in collaboration with client executives and key stakeholders (Understanding the longer-term viewCollect and articulate new necessities from client key stakeholders in collaboration with the Customer success,Development and Product Management teams\n Ensures the entire portfolio is aligned and funded to create and maintain the solutions needed to meet business targets\n Coordinates and supports decentralized program execution and fosters operational excellence\nUnderstand the portfolio’s current state and develop a plan to evolve\n Adjust the vision and the plan to address the changing business context\nTranslating the business vision and strategy into effective technology plans (Enterprise Architecture) in collaboration with Tech Directors\nTranslating the business vision and strategy into effective project plans and product capabilities\n Translates business goals into portfolio strategy;communicates direction and product priorities across the organization\n Define Portfolio Roadmaps aligned with clients initiatives, goals and expectations\n Managing portfolio limiting the number of significant and typically cross-cutting initiatives in progress to match the portfolio’s capacity\nSelect and track the portfolio KPI’s and OKR’s to be measure the portfolio successful\n Communicating portfolio progress to client executives\nIdentifies pros, cons, issues, obstacles, dependencies, and value associated with the portfolio inside the client and the Avertra’s team (Product, X, Development)\n Owns the Strategic Portfolio Review, Portfolio Sync and the Participatory Budgeting meetings\n Work closely with Product Managers, Account Executives and Technology Director on new and existing client engagements\n Work closely with the sales and pre-sales team to offer our customers quantitative and qualitative assessments of existing products and opportunities \nGuide and mentor team members in all areas of responsibility,including Product management, speech recognition,professional communications, implementing process improvements, customer interactions,Negotiation, so on\nGains a thorough understanding of customer and client needs, both existing and potential, and uses that knowledge to help deliver products that provide Avertra\n Partners with account manager and client sponsors to understand client needs and assists in the creation of business account plans\nEnsure the products are aligned with client priorities to drive sales, improve efficiency, and improve customer satisfaction\n Documents, reviews and ensures that all quality and change control standards are met\n Condenses complex technical concepts into non-technical language for stakeholders\nAct as the Platform Executive for projects and new clientsSkills",
    "Skills": [
        "Knowledge, Skills and Abilities",
        "Ability to work with remote team\n Ability to manage tough clients and stakeholder\n Product Management Mindset\n Project Management knowledge\n People Management\n Competitive Analysis\n Financial Planning and Strateg",
        "Needed Competencies:",
        "Strategist and tenacious in delivery\nHighly motivated\n Strong troubleshooting and Conflict resolution skills\n Strategic thinking\n Client oriented\nEntrepreneurial and innovative mindset\n A well-organized team player\n Great written and verbal communication skills\nCritical thinking skills\nTime management\nLeadership\n Negotiation",
        "Education:",
        "Bachelor of Science, Engineering, technology, business,management information systems\nAgile certification from a reputable methodology provider(Scrum Alliance, SAFe)",
        "Experience:",
        "6+ years of experience as a software Product Manager (or similar)\n 4+ years in the Utilities industry (Gas, Energy, Water, Waste Water)\n 3+ years in leadership\n2+ years of working knowledge of agile methodology,techniques, and frameworks, such as Scrum or Kanban, to deliver software solution",
        "Preferences:",
        "Certified Product Management (SAFe) or similar\n Certified SCRUM Product Owner (CSPO)\nAgile Project Management Certified",
        "Travel:",
        "At least one week per month in the client’s office (USA)",
        "Work Schedule:",
        "US working hours preferred",
        "Benefits",
        "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer-centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.",
        "What can we promise you:",
        " You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}