{
    "Job ID": "4719415",
    "Description": "Position Overview: As a Sales Partnerships Development Consultant, you will focus on establishing strategic partnerships and executing programs to drive sales for a prominent real estate project. Your role will involve building relationships with brokers, developing referral systems, and expanding the project's sales network in the GCC region. Responsibilities:1. Sales Partnerships Strategy:• Develop and implement a sales partnerships strategy to expand the project's reach and generate leads.• Identify and prioritize potential brokerage firms and strategic partners in the GCC region.• Define partnership models and collaboration frameworks to maximize mutual benefits.2. Broker Program Execution:• Execute the brokers program by identifying and onboarding reputable real estate brokers.• Provide brokers with necessary training, marketing materials, and ongoing support to effectively promote and sell the project.• Develop and implement incentives and rewards programs to motivate brokers and drive sales performance.3. Referral System Implementation:• Establish a referral system to incentivize existing customers and partners to refer potential buyers.• Develop referral program guidelines, track referrals, and ensure timely rewards and recognition.4. Sales Network Expansion:• Actively network and build relationships with key stakeholders in the real estate industry, including developers, brokers, and industry associations.• Attend industry events, conferences, and exhibitions to promote the project and explore new business opportunities.Skills",
    "Skills": [
        "• Bachelor's degree in Business Administration, Marketing, or a related field.",
        "• Proven experience in sales partnerships development, preferably in the real estate industry.",
        "• Strong network of contacts within the GCC real estate market, particularly with brokerage firms and industry professionals.",
        "• Excellent negotiation and relationship-building skills.",
        "• Ability to identify and seize business development opportunities.",
        "• Familiarity with referral systems and incentive programs.",
        "• Strong organizational and project management abilities.",
        "• Results-oriented mindset with a track record of achieving sales targets.",
        "• Excellent communication and interpersonal skills"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}