{
    "Job ID": "4719041",
    "Description": "* Estimates costs for construction, engineering, manufacturing, quantity take-offs, or other implementation projects based on an analysis of project technical requirements.* Provides group support with others in researching wage/equipment rates, production rates, construction materials, means, and methods.*Collects data and analyzes all project costs, including raw materials, labor, equipment and tooling to ensure estimates are accurate.* Provides group support with others in maintaining schedule and cost data and references.*  Identifies and quantifies potential cost uncertainties to ensure costing models capture the full range of potential costs.* Updates costs as necessary based on new information and project scope changes.* Gather proposals, specifications and related documents and liaise with stakeholders in order to convert specifications to cost estimates for new and current constructions.*  Coordinates with project management, engineering, procurement and other project stakeholders.*Schedule and attend field walk-downs with customer, subcontractor, and construction personnel to understand and determine construction ability requirements.* Compare various project documents for accuracy and consistency data entry.* Additional duties as determined by Chief Estimator.Skills",
    "Skills": [
        "* Requires an (Architectural/Civil/Mechanical / Electrical) engineering bachelor's degree (site supervision/ technical office duties.",
        "• Bachelor's degree in (Architectural/Civil/Mechanical / Electrical) engineering.",
        "• Minimum Experience of 7-15 years (preferred minimum of 3 years of his experience in KSA)",
        "(Saudi Arabia resident).",
        "Experience in Construction Projects.",
        "Understanding of engineering codes and safety standards",
        "Excellent English Language Skills.",
        "(Architectural/Civil/Mechanical / Electrical)"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 7",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}