{
    "Job ID": "4719416",
    "Description": "Position Overview:As a Sales Operations Consultant, you will be responsible for monitoring the execution and executing sales plans, managing CRM systems, overseeing showrooms, and measuring key performance indicators (KPIs) for a prominent real estate project. Your role will be instrumental in ensuring the smooth functioning of sales operations and optimizing sales performance.Responsibilities:1. Sales Plan Execution:• Implement and execute the sales plans developed by the project manager.• Coordinate with the sales team to ensure adherence to sales targets, timelines, and strategies.• Monitor sales progress and identify areas for improvement or adjustment.2. CRM Management:• Oversee the implementation and management of a customer relationship management (CRM) system to track leads, customer interactions, and sales activities.• Ensure the CRM system is properly utilized, and data is accurate and up-to-date.• Provide training and support to the sales team on CRM usage and best practices.3. Showroom Management:• Supervise the operations and activities of the project's showrooms, including staffing, inventory management, and customer service.• Collaborate with the marketing team to create an engaging and informative showroom environment that showcases the project's offerings.4. KPI Measurement and Reporting:• Develop and implement KPIs to measure sales performance, including lead conversion rates, sales velocity, and revenue targets.• Generate regular reports on sales metrics, analyze data, and provide actionable insights to drive sales effectiveness.• Monitor market trends, customer preferences, and competitive activities to identify opportunities and challenges.Skills",
    "Skills": [
        "• Bachelor's degree in Business Administration, Sales, or a related field.",
        "• Real estate expertise, preferably from developer role.",
        "• Proven experience in sales operations and management.",
        "• Familiarity with CRM systems and sales analytics tools.",
        "• Strong organizational and multitasking abilities.",
        "• Analytical mindset with the ability to interpret sales data and generate meaningful insights.",
        "• Excellent communication and interpersonal skills.",
        "• Attention to detail and a high level of accuracy in data management.",
        "• Proficiency in sales software and Microsoft Office Suite"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}