{
    "Job ID": "4719417",
    "Description": "Position Overview: As an Advertising and Communication / Go-to-Market Execution Consultant, you will be responsible for developing and executing effective advertising and communication strategies to promote a prominent real estate project. You will play a crucial role in ensuring the successful launch and market positioning of the project. Responsibilities:1. Advertising and Communication Strategy:• Develop a comprehensive advertising and communication strategy aligned with the project's objectives and target audience.• Identify key messaging and value propositions to effectively promote the project.• Select appropriate advertising channels and media outlets to maximize reach and impact.2. Campaign Execution:• Coordinate and manage the execution of advertising campaigns across various channels, mainly social media• Collaborate with creative agencies and media partners to develop compelling and engaging campaign materials.• Monitor campaign performance, measure key metrics, and optimize strategies based on insights.3. Go-to-Market Execution:• Ensure the seamless execution of the go-to-market plan, including the timing and coordination of sales and marketing activities.• Develop and implement launch events and promotional activities to generate buzz and attract potential buyers.• Coordinate with internal teams and external partners to align messaging and branding across all touchpoints.4. Brand Communication:• Create and manage content for various communication channels, including website, social media platforms, press releases, and marketing collaterals.• Maintain brand consistency and ensure that all communication materials accurately represent the project.Skills",
    "Skills": [
        "• Bachelor's degree in Marketing, Advertising, Communications, or a related field.",
        "• Proven experience in developing and executing advertising and communication strategies, preferably within the real estate industry.",
        "• Strong understanding of different advertising channels and media platforms.",
        "• Excellent written and verbal communication skills.",
        "• Creative mindset with the ability to think outside the box.",
        "• Proficiency in project management and the ability to meet deadlines.",
        "• Knowledge of digital marketing tools and platforms is a must"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}