{
    "Job ID": "4719640",
    "Description": "❖  Job Title:Warehouse Associate.❖  Industry:Telecommunications and Satellite Communication.❖  Essential Duties and/or Responsibilities:Receive, process and organize warehouse stock and merchandise within the warehouse by properly unboxing and storing goods in their designated location.Maintain accurate records of products that have been stocked and provide management with an accurate representation of all goods shipped and received.Verify all incoming shipments to be accurate by comparing the invoice to the order and ensure all goods are in excellent condition.Monitor and report any missing or lost inventory to managementAchieve high levels of customer satisfaction through excellence in receiving, identifying, dispatching and assuring quality of goods.Ensuring cleanliness, tidiness and safety of work environment.Loading and unloading delivery vehicles.Organize and maintain inventory and storage area.Follow quality service standards and comply with procedures, rules and regulations.Performs other related duties as necessary or assigned.Skills",
    "Skills": [
        "❖  Qualifications / Skills:",
        "Knowledge working with Microsoft Office Tools.",
        "Familiarity with modern warehousing practices and methods.",
        "Ability to lift heavy objects.",
        "Current Saudi Driving licence.",
        "Exceptional verbal and written communication skills.",
        "Language Skills-Proficiency in English and Native or Bilingual Proficiency in Arabic.",
        "❖  Education, Experience, and Licensing Requirements:",
        "High school degree.",
        "Proven working experience as a Warehouse Worker."
    ],
    "Preferred": {
        "Residence Location": "Riyadh, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}