{
    "Job ID": "4719263",
    "Description": "Primary Duties and Responsibilities: As discipline engineer responsible for provision of the required quality technical services. \nCarry-out Concept definition and engineering studies, design, scopes, and preparation of engineering documents as per approved standards / procedures. \nVerify and sign-off technical designs and bids in accordance with approved standards. \nDeliver timely service to meet the project requirements. \nAdvice and support in the discipline engineering matters around expertise through all stages of projects. \nPlan and co-ordinate activities of a team of engineers for providing technical services to project executing departments, including review of execution strategies. \nSupport discipline head/lead to manage our client discipline standards. Participate in technical assurance and standardization activities to ensure compliance to approved discipline standards. \nApprove / endorse technical deviations / waivers/ variations to approved guidelines, codes, standards and practices. \nSupport to ensure that all applicable environmental and process and other safety technical policies are fully implemented.Skills",
    "Skills": [
        "Qualification: ",
        "Bachelor degree in discipline engineering. Chartered Engineer status or equivalent is preferable. \nExperience: 10 years relevant post graduate experience, of which 6 years in Oil & Gas industry. \nSkill / knowledge of International, Shell DEPs and/or cleint standards related to his area of expertise. \nExperience of managing time, cost and quality in engineering projects within multiple project environment. \nExperience to offshore site environment and associated physical fitness to get HEUT and T-BOSIET certificate is desirable. \nGood Communications and Presentation skills and be fluent in English. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}