{
    "Job ID": "4719886",
    "Description": "Business Intelligence Specialist (Tableau and Alteryx) - Riyadh || Arabic Speaking Must || ImmediateCollaborate in cross-functional teams to translate business requirements into technical ones.\nCollect, refine, and prepare complex datasets for analytics and visualization.\nIdentify patterns and meaningful insights from data by analyzing it.\nCreate wireframes and beta dashboards with a focus on user experience, correctness, and visibility ·\nDevelop interactive business intelligence dashboard using tools such as Tableau and Alteryx.\nTest and publish dashboards and reports and schedule refresh.\nSolve any data or performance issues related to workbooks and data sources.\nDeliver complex and actionable reports that show KPIs, identify areas of improvement into current operations, and display root cause analysis of problems.\nEnsure data quality, adherence to guidelines, business impact, and other risk-related metrics.\nCreate technical documentation for BI tools and solutions.Skills",
    "Skills": [
        "Minimum 3 years of Business Intelligence experience.\nMust be a native Arabic speaker\nBachelor’s degree in computer science, Information Systems or Data Science or Applied Mathematics\nProfessional experience with: BI tools, data visualization, Javascript, D3, Python, Excel and writing highly-optimized SQL queries across large datasets.\nTechnical knowledge of Tableau products and versions including Tableau Server, Tableau Public, Tableau Online, Tableau Desktop.\nFamiliar with database management systems, data modeling, ETL, visual design principles"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "2"
    }
}