{
    "Job ID": "4719178",
    "Description": "Responsibilities:· Dealing with escalations from Tier 1 and carrying out investigations and response· Provide proactive defense of customers’ digital and technology solutions against cyber security threats.· Track incidents as per priority and take remediation actions as per the playbooks to address incidents within the SLA periods· Escalate incidents to the DFIR team based on defined criteria in the incident response playbooks. · Communicating the findings to stakeholders in a clear and actionable fashion, focussing on real-world impact andwith pragmatic options for resolution.· Work closely with departments across the organization to ensure threats and vulnerabilities areremediated effectively. · Monitor a range of security systems, resolving and documenting findings accurately.· Conduct Peer review of incident triage and finding of L1. Peer review will also include an analysis ofincidents flagged as false positives. · Continuously enhance the incident monitoring and response process. Have an eye for the process that canbetter be orchestrated and automated. · Periodic review of detection use cases that either need enhancements, tuning, etc and coordinate with the C&P Team.· Shift handover review and validation. · Generate weekly and monthly stats as per the agreed schedule. Skills",
    "Skills": [
        "Qualifications:",
        "· 3+ years of experience in Security monitoring or MSSP operations",
        "· Equivalent industry certifications ",
        "· Security +, CYSA+ , E-learn Security ecir, ecthp ",
        "· Ability to work shifts (including unsociable hours and public holidays where these fall into your shift pattern) as part",
        "of a 24x7 team",
        "Desirables:",
        "· BSc/MSc degree in Cyber Security, ",
        "· Information Security or a related degree/qualification.",
        "· GIAC, GCIA,GCIH, or similar Minimum 1 Year in a SOC",
        "Soft skills:",
        "· Clear and concise oral and written communication in English.",
        "· Highly motivated individual with a genuine enthusiasm for cyber security and technology.",
        "· Good understanding of cyber security principles and best practices.",
        "· Ability to prioritize workloads and know when to seek guidance.",
        "· Ability to operate calmly and efficiently in fast-paced situations."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}