{
    "Job ID": "4720944",
    "Description": "Seeking an internal medicine specialist who holds to the highest standards of medical practice, professionalism, and ethics. If you wish to be a part of an interdisciplinary health care team with a passion for helping people, you may be the perfect candidate for our facility. We are looking for a motivated, educated, licensed, a detail-oriented and driven internist who has experience working with patients in a community health setting.Job ResponsibilitiesPerform physical evaluations on adult patients who are seeking medical attention for injuries, illness or other medical concernsOrder screening tests and other measures that aid in the diagnostic process, and review reports, labs, x-rays, EKGs and all other screening methodsCustomize a treatment plan unique to each patient’s symptoms and diagnosisPerform minor procedures, both surgical and non-surgical, as neededAvoid any drug and/or therapy conflictsAttend regular meetings involving professionals who are a part of the health care teamFollow protocol set by the directors of the health clinic, adhering to medical ethics and standards, and provide recommendations in updating protocol if needed.Skills",
    "Skills": [
        "Job Skills & Qualifications Required",
        "Specialization degree or successful 4-5 years of residency",
        "Valid licensure to practice",
        "Ability to communicate clearly with patients and team members",
        "Ability to perform effectively and accurately in an often chaotic environment",
        "Preferred",
        "At least 3 year’s experience."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Medical Clinic",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}