{
    "Job ID": "4720474",
    "Description": "On behalf of a Fortune 500 client,Reporting to the Director of Digital Marketing you will deliver CRM in line with an agreed strategy and manage a team, driving the business KPIs by optimizing offers, email, push, and SMS campaign performance.Liaising with product teams and other internal stakeholders to deliver business objectives.\nTechnical campaign planning.\nCRM Calendar planning.\nAnalysis and report generation.\nOperating broadcast tools on a day-to-day basis e.g., Identifying business opportunities, creating audiences, setting up campaigns, reporting, etc.\nWorking with wider agencies and global teams to deliver best-practice campaigns and strategic projects.Skills",
    "Skills": [
        "BS or MS degree.\n7 + years experience of marketing, CRM or loyalty analytics in a leadership role.\nLoyalty or membership experience is a huge bonus.\nAgency side/consulting or Client side will be considered.\nSalesforce, Responsys (or comparable ESP) experience is a must.\nMartech experience with Particle and GetResponse is preferable.\nCRM experience within a digital environment is required.\nUp-to-date knowledge of marketing technologies ( MarTech) and digital experience. platforms spanning Owned, Paid, and Earned /Social Media.\nInterpersonal skills managing and coordinating various stakeholder requests and objectives.\nAbility to make recommendations and suggestions to improve existing campaigns and always strive for continuous improvement."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4 Max: 12",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 32"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "FMCG; Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}