{
    "Job ID": "4720536",
    "Description": "Lead of Transportation and Installation Engineering (Pipelines / Cables)Key Job Accountabilities:As T&I Engineering Lead, provide full function T&I engineering to EPC teams to ensure each of the EPC meet objectives - including all aspects of T&I engineering, marine warranty requirements, procedural compliance, execution safety and integrity and project execution effectiveness and efficiency.\nProvide core technical and execution expertise to ensure consistent and quality application of T&I systems, processes, and procedures for T&I engineering scope.\nProvide demonstrable competency and experience to advise, make recommendations and decisions for T&I regarding transportation and installation engineering requirements and activities including load-out, sea fastening, transportation, heavy lift, float-over, pipelay and cable lay installation analysis, methods and procedures.\nProvide knowledge and experienced technical and execution input to engineering designs and installation procedures\nSupport the delivery of all Transport and Installation Engineering scope based on Contractor installation vessels and barges in accordance with agreed schedule and budget.\nReview of transportation and installation procedures from engineering perspective such as heavy lifts, jacket launches, topside floatovers, pipeline, cable, umbilical, crossings, post installed risers including stalk ons, freespan correction, pilling, load out, float on, float off, trenching, burial, beach pull, transpooling and othersSkills",
    "Skills": [
        "Experience required:",
        "QualificationsPreferred Engineering Degree or relevant on the job experience\nExtensive project engineering experience in a senior role\nRequired to have offshore survival certificate and be able to pass an offshore medical evaluation.\nOPITO certification is considered a plus.",
        "Knowledge and/or Experience:Recommended 15+ years of experience with at least 10 years demonstrated T&I engineering experience\nExperience in multiple T&I engineering aspects including offshore heavy lifts, float-over, pipeline, and cable installations, load-out and transportation; with float-over installation engineering and execution experience considered an advantage\nProficiency in using various installation analysis software such as Moses, Gmoor, Mars, Sacs, Staad, Offpipe, Orcaflex and others\nWorldwide experience with contractors in particular those involved in the Offshore projects\nExcellent interpersonal and communication skills with a focus on teamwork and the ability to communicate and interact within a PMT\nApplication and in-depth knowledge of stakeholder specifications and a working knowledge of Industry standards",
        "Technical and Business Skills:A high level of proficiency in written and spoken English\nComputer literacy involving the regular use of professional office applications and some technical applications\nAbility to work on or be based on a platform or vessel"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}