{
    "Job ID": "4720923",
    "Description": "About the Company:qusah stores is a leading tissues and cleaning supplies company that specializes in E-commerce . We are looking for a Digital Marketing Manager who will be responsible for developing, implementing, and managing our digital marketing campaigns.Job Description:As a Digital Marketing Manager, you will be responsible for:- Developing and executing digital marketing strategies that drive website traffic, increase leads, and improve customer engagement.- Managing and optimizing all digital marketing channels, including email, social media, search engine optimization (SEO), pay-per-click (PPC), and display advertising.- Conducting market research and analyzing customer data to identify trends and opportunities for growth.- Collaborating with cross-functional teams to develop and execute integrated marketing campaigns.- Tracking and analyzing website traffic using Google Analytics and providing regular reports on performance.- Implementing conversion rate optimization strategies and conducting A/B testing to improve website performance.- Managing marketing automation and CRM systems to improve lead generation and customer retention.- Developing and executing content marketing strategies that align with overall marketing goals.- Staying up-to-date with the latest digital marketing trends and technologies.Skills",
    "Skills": [
        "If you are passionate about digital marketing and have a proven track record of driving results, we would love to hear from you. Please submit your cover letter and resume for consideration.",
        "Media Advertising",
        "- Email Marketing",
        "- Google Analytics",
        "- Conversion Rate Optimization",
        "- A/B Testing",
        "- Marketing Automation",
        "- Content Marketing",
        "Qualifications:",
        "- Bachelor's degree in marketing, communications, or a related field.",
        "- 5+ years of experience in digital marketing, with the last experience being in a digital-based business (e-commerce, online services, or digital-marketing agency).",
        "- Proven track record of developing and executing successful digital marketing campaigns.",
        "- Strong knowledge of digital marketing channels, including SEO, PPC, email, and social media advertising.",
        "- Experience with Google Analytics, marketing automation, and CRM systems.",
        "- Excellent communication and project management skills.",
        "- Ability to work independently and as part of a team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}