{
    "Job ID": "4720869",
    "Description": "Evaluate and understand financial statements to streamline your daily processes.\nDevelop internal processes and accounting policies to strengthen internal control.\nMaintain accurate month-end and year-end records by examining all financial statements.\nFacilitate a smooth yearly audit process through an independent evaluator by providing accurate transactions and balances of the company.\nUnderstand and perform the financial closing activity on a monthly, quarterly, and annual basis.\nAssist the top-level management in making critical business decisions by providing accurate financial assessments.\nCoordinate with the management and uphold the standard laws and regulations for monitoring, updating, and maintaining fiscal activities.\nManaging & supervising subordinates with strong leadership skillsSkills",
    "Skills": [
        "Bachelor's degree in finance, accounting, economics, or business administration or related field. Post graduate degree and/or Professional certification such as CFA, CIMA, ACCA, CA will be a plus.\nEnthusiastic candidate with an Accounting background, ready to tackle the challenges in the core Finance domain.\nExpertise in handling financial activities by implementing the latest management and cost reduction trends.\nStrong communication and negotiation skills in partnership management and inter-department coordination.\nAdept in data analysis, interpretation, and use of modern accounting techniques.\nSound knowledge of different types of financial reports and balance sheets.\nProficient User of Microsoft Office – MS-Word, MS-Excel, Powerpoint, Access [Advanced Excel skills – Power BI, Dashboards, Macros, VBA will be a plus].\nERP Knowledge: Proficient user of any ERP system (Preferable SAP B1)."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading; Distribution, Supply Chain & Logistics; Perfume & Cosmetics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}