{
    "Job ID": "4720328",
    "Description": "مدير مستودع\n\nإدارة المستودع بشكل استراتيجي وفقًا لسياسات الشركة ورؤيتها.\nالإشراف على عمليات الاستلام والتخزين والتوزيع والصيانة.\nتخطيط الإعداد وضمان الاستخدام الامثل للمساحات المتاحة.\nالتنسيق والمتابعة على تنفيذ السياسات التشغيلية بشكل جيد.\nالالتزام بجميع متطلبات تشريعات التخزين والشحن.\nتزويد إدارة الإنتاج / الدوائر الأخرى بكافة الطلبيات اليومية.\nاستلام المواد الموردة وتسليم نسخة وفق الإرسالية لدائرة المشتريات.\nتوثيق المواد الداخلة إلى المستودع والخارجة منه.\nترتيب المواد الأولية بالشكل الصحيح داخل المستودعات ووضع بطاقة بيان عليه بحيث يسهل الوصول إليها دون عناء.\nالتأكد من سلامة التخزين في المستودعات ووجود وسائل السلامة ضد الحريق.\nالتأكد من تهوية المستودعات للبضائع التي تلزم ذلك.\nوضع بطاقات تعريف للمستودعات ومحتويات كل مستودع.\nتطوير نماذج إدارة / دائرة المستودعات.\nبناء قاعدة بيانات عن الموجودات / أماكن تواجد البضائع في كل مخزن.\nالتأكد من استخدام طريقة الوارد أولا صادر أولاً.\nاستلام وترتيب البضائع بالشكل السليم تجنباً للتلف أو الكسر.\nإدارة وتنظيم وقت عمال المستودعات وتدريبهم.\nالمحافظة على نظافة المستودعات والتأكد من سهولة الوصول إلى البضاعة.\nوضع مخططات للمستودعات وأماكن تواجد البضاعة.\nالتأكد من وجود وسائل السلامة / طفايات الحريق.\nالاستخدام الأمثل للمساحات المتاحة في المستودعات. \nالحفاظ على معايير الصحة والسلامة والنظافة والأمن.\nإدارة مراقبة المخزون باستخدام برامج تخزين البيانات المختلفة.\nإعداد الميزانية السنوية و التواصل مع العملاء والموردين وشركات النقل.\nإعداد خطة العمل وتعيين المهام بشكل مناسب وتقييم النتائج.\nالاشراف على اختيار وتوظيف الكفاءات وتقديم التدريب والتحفيز المناسب للموظفين.\nإعداد التقارير والاحصائيات بشكل دوري مثل تقارير الدخول والخروج وتقارير الكميات المتاحة.\nالتعاون مع قسم الجودة ومتابعة الملاحظات الخاصة بالجودة.Skills",
    "Skills": [
        "مهارات عملية:\nالقدرة على استخدام برامج إدارة المخازن والمستودعات وقواعد البيانات.\nالقدرة على إدارة الموظفين وإجادة مهارات القيادة.\nالقدرة على اتخاذ القرارات وتقديم الحلول المناسبة للمشكلات المختلفة.\nالمعرفة القوية بمؤشرات الأداء الرئيسية.\nقوة الملاحظة واجادة عملية توزيع المساحات.\nالقدرة على التواصل مع موظفين القسم وباقي الادارات.\n\nمهارات شخصية:\n\nمهارات القيادة والتنظيم.\nالقدرة على تحفيز وتدريب الموظفين وتوضيح توقعات العمل.\nمهارات إدارة الوقت.\nفهم اللوائح والبروتوكولات الأمنية.\nامتلاك المهارات رقمية المهارات التقنية.\nمهارات تقنية المعلومات والقدرة على تعلم حزم تقنية جديدة.\nمهارات التنظيم والحفاظ على تدفق جيد للمخزون.\nالمهارات العملية، مثل القدرة على تشغيل المعدات.\nالتعامل الجيد وتحقيق مستويات عالية من رضا العملاء.\nمهارات التقييم وتقرير أداء الموظفين.\nتحديد المجالات التي يمكن تحسينها.\nالحفاظ على سجلات المخزون.\nمهارات التفكير النقدي والتحليل.\nمهارة تنسيق الأنشطة مع الإدارات الأخرى.\nمهارات الاتصال القوية سواء الكتابية أو الشفوية."
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Selay, Al, Riyadh , Saudi Arabia",
        "Company Industry": "Events Management",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}