{
    "Job ID": "4720338",
    "Description": "البحث القانوني: إجراء بحوث قانونية معمقة باستخدام مصادر متعددة مثل القوانين والأحكام القضائية والمستندات القانونية الأخرى. تحليل وتفسير القوانين والتشريعات المعمول بها.\nإعداد التقارير والمذكرات: إعداد تقارير ومذكرات قانونية تلخص نتائج البحث القانوني وتوضح التطبيقات القانونية والتدابير المقترحة.\nالدعم القانوني: تقديم الدعم القانوني للمحامين والفرق القانونية في إعداد الوثائق القانونية والمرافعات والاستشارات القانونية.\nمتابعة التطورات القانونية: متابعة التغيرات والتطورات في القوانين والتشريعات والأحكام القضائية ذات الصلة بمجال العمل القانوني وتحديد التأثيرات المحتملة.\nالتوثيق والبيانات: الحفاظ على سجلات دقيقة للبحوث والتقارير القانونية والمصادر المستخدمة. تنظيم وإدارة البيانات القانونية بشكل منهجي.\nالتواصل: التواصل مع العملاء والمحامين والجهات القانونية الأخرى لجمع المعلومات وتبادل الأفكار والتعاون في المشاريع القانونية.\nالتحليل والتقييم: تحليل القضايا القانونية المعقدة وتقييم الأدلة القانونية والمصادر ذات الصلة.\nالامتثال للقوانين والأخلاقيات: الالتزام بالمعايير القانونية والأخلاقية المتعلقة بالبحث القانوني والحفاظ على سرية المعلومات القانونية.\nLegal Research: Conduct in-depth legal research using various sources such as laws, case precedents, and other legal documents. Analyze and interpret laws and applicable legislations.\nReport and Memo Preparation: Prepare legal reports and memos summarizing the findings of legal research and outlining legal applications and suggested actions.\nLegal Support: Provide legal support to lawyers and legal teams in drafting legal documents, pleadings, and legal consultations.\nLegal Development Monitoring: Stay updated on changes and developments in laws, legislations, and relevant case precedents in the legal field, identifying potential impacts.\nDocumentation and Data Management: Maintain accurate records of research and legal reports, as well as the sources used. Organize and systematically manage legal data.\nCommunication: Communicate with clients, lawyers, and other legal entities to gather information, exchange ideas, and collaborate on legal projects.\nAnalysis and Evaluation: Analyze complex legal issues and evaluate legal evidence and relevant sources.\nCompliance with Laws and Ethics: Adhere to legal and ethical standards related to legal research and maintain confidentiality of legal information.Skills",
    "Skills": [
        "خبرة عمل في المجال العقاري\nدرجة علمية في القانون: حاصل على درجة البكالوريوس أو الماجستير في القانون أو مجال ذي صلة.\nالبحث والتحليل: مهارات قوية في البحث القانوني وتحليل القوانين والأحكام القضائية والتشريعات.\nالقدرة على التواصل: مهارات اتصال ممتازة شفهية وكتابية للتفاعل مع الفرق القانونية والعملاء وتوصيل المعلومات القانونية بشكل فعال.\nالمهارات البحثية: القدرة على تحديد المصادر القانونية المناسبة واستخدام الأدوات والتقنيات المناسبة لإجراء البحث القانوني.\nالتنظيم والإدارة: القدرة على التنظيم وإدارة المهام وتحقيق المواعيد النهائية.\nاللغة: إجادة اللغة العربية والإنجليزية بشكل ممتاز، بما في ذلك القدرة على التعبير القانوني بشكل واضح ودقيق في كلا اللغتين.\nCandidate should have work experience in real industry industry.\nLaw Degree: Bachelor's or Master's degree in Law or a related field.\nResearch and Analysis: Strong skills in legal research and analyzing laws, case precedents, and legislations.\nCommunication Abilities: Excellent oral and written communication skills to interact with legal teams and clients and effectively convey legal information.\nResearch Skills: Ability to identify relevant legal sources and use appropriate tools and techniques for legal research.\nOrganization and Management: Ability to organize and manage tasks and meet deadlines.\nLanguage: Excellent proficiency in both Arabic and English, including the ability to express legal concepts clearly and accurately in both languages."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}