{
    "Job ID": "4720073",
    "Description": "o Responsible for obtaining an understanding of key business activities and operations, identification of risk areas and control gaps as a part of ‘Audit Planning’ process.o   Conduct regular audits on company operations and functions, review effectiveness of internal controls and compliance with company policies and procedures and Recommend actions enhance control weaknesses and improve operations.o Develop ‘Audit Programs & Forms’ for audit engagements (including field visits).o Execute and finalize ‘Audit Scope’ for planned audit engagements and make appropriate modifications, based on inputs from business units to ensure its adequacy.o Assist in developing audit plans and defining the scope of audits and audit programs and ensure an on-target implementation of the same.o Report ‘significant risk exposures and control issues’, including fraud risks, governance issues, and other matters needed or requested by the audit director.o ‘Supervises’ the work performed by junior auditors and provide necessary guidance in execution of fieldwork.o Organize working papers and notes for ‘Discussion Meeting’, with completion of fieldwork to ensure ‘Audit Conclusions’ are based on complete understanding of the activity or process and identified risks; and to ensure audit conclusion are well documented.o Review and discuss draft of ‘Internal Audit Reports’ with Internal Audit director upon completion of fieldwork.Keep track of working papers for all completed engagements for ‘Archiving’.o Reporting the ‘Progress’ of the assigned engagements/ tasks to audit director on periodic basis.o Perform follow-up of engagements and report its results to audit director.o Conduct ‘Performance Evaluation’ of Junior Auditors on monthly basis to analyze productivity relative to assigned tasks and validate that staff is achieving the desired performance levels.Perform other related duties as assigned by the audit director.Skills",
    "Skills": [
        "Education:",
        "Bachelor’s degree in accounting, Finance, or equivalent.\nPreferred CIA certificate.",
        "·        Experience:",
        "·        At least five years of experience in internal audit for Contracting business, with high level of contemporary theories and practices related to Internal Audit and Risk Management",
        "Strong technical Audit skills.\nStrong analytical ability.\nCapable of giving strong attention to details.\nStrong problem-solving skills.\nGood presentation skills.\nConversant with Microsoft Office applications and Audit Management Analysis tools and software.\nGood written and oral communication skills in English."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}