{
    "Job ID": "4721367",
    "Description": "Under the direction of an assigned Administrator, liaise between the school and the Supreme Education Council regarding all essential issues which have a direct or indirect impact on the running of the school and to keep the Administration fully updated on all SEC directives and maintain SEC registers and data base systems.Job ResponsibilitiesDeal with all communiques from the SEC (written/verbal/visiting SEC).\nContact SEC by phone regarding school queries and parental complaints.\nCheck the school's official SEC email on a daily basis and respond to all e mail communications.\nFile up / document important emails, fax and any other written communications.\nLiaising between schools/sections regarding SEC requirements and collecting required data to be sent the SEC. \nData entry for SEC student registers and staff information.\nPresenting Heads and Principal with updates regarding SEC requirements, policies, memos and directives.\nCheck the SEC events' calendar and keep SMT updated and informed in timely manner.\nAttend official SEC training sessions regarding official data entry requirements, procedures and software training.\nAttend SEC meetings with Principal or SMT member as required.\nInform Mandoob, in writing, two months before the expiration of the school’s Education Licence.\nUse Word processing and spreadsheets and database software such as Access when and where required.\nMaintain appropriate protocol when visiting SEC offices and receiving SEC personnel and VIPs in the school’s premises.\nEffectively communicate through written or spoken English and Arabic with all SEC representatives and other visitors to the school.\nWork according to the rules, expectations and guidelines of the SEC.\nBe available by phone or e-mail almost any hour of the day or night to help solve any problems related to school issues. Skills",
    "Skills": [
        "Communication Skills: Strong written and verbal communication skills are essential to effectively deal with various communiques from the SEC, handle phone inquiries, respond to emails, and liaise with different stakeholders.\nOrganization and Documentation: The ability to file, organize, and document important emails, faxes, and written communications is crucial for maintaining accurate records and complying with SEC requirements.\nAttention to Detail: Being meticulous in data entry for SEC student registers and staff information is important to ensure accuracy and compliance with regulatory standards.\nInterdepartmental Coordination: Ability to work collaboratively and liaise between different schools and sections to gather required data and meet SEC requirements.\nKnowledge of SEC Policies and Procedures: Familiarity with SEC policies, memos, directives, and official data entry requirements is necessary to keep the school updated and compliant.\nTime Management: Staying on top of the SEC events' calendar, attending meetings, and providing timely updates to the School Management Team (SMT) requires effective time management skills.\nTraining and Adaptability: Willingness to attend official SEC training sessions to stay updated on procedures, data entry requirements, and software training, and being adaptable to changes in regulations and procedures.\nBilingual Proficiency: Proficiency in both written and spoken English and Arabic is important for effectively communicating with SEC representatives and other visitors.\nCompliance and Adherence: The ability to work according to the rules, expectations, and guidelines of the SEC is crucial for maintaining the school's regulatory standing.\nCustomer Service Orientation: Being available by phone or email to address school-related issues and parental complaints requires a strong customer service orientation.\nConfidentiality and Professionalism: Handling sensitive information, protocol when visiting SEC offices, and dealing with VIPs demand professionalism and confidentiality.\nComputer Skills: Proficiency in word processing, spreadsheets, and database software like Microsoft Word, Excel, and Access is essential for various administrative tasks.",
        "Overall, the ideal candidate should possess excellent communication and organizational skills, attention to detail, knowledge of SEC policies, and the ability to adapt to changing requirements while maintaining professionalism and confidentiality."
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}