{
    "Job ID": "4721180",
    "Description": "To lead Strategy formulation and execution for achieving growth & increasing Width & Depth of Distribution for sustainable growth in Al-Tawfiq company for plastics & sacks industries Ltd. and to enhance customer delight by introducing high quality yet value-for-money products.• To Identify Green Fields accounts for the Products and services of ALTawfiq company and ensure that Sales Pipeline is Robust.• To Manage existing customers.• To Engage with the Customers and Build long-termrelationships.• Prepare Annual Sales Plan.• Work on increasing & growing export sales.To Build various channels to exhibit Products Services.• To Participate in various Conferences /Seminars.• To Identify Online Channels.• To Involve in any New Product Development To Generate Revenue in line with the Budgeted Sales.• To Generate Profitability to feed the Business.• Identify Gaps/Leakage in the Revenue and recommend an actionPlan.• Ensure that APWS collections are as per the approved Plan.To visit customers and give them quality time by sharing the product and company reputation available in the market, to share other information which shall be useful for their company business.Skills",
    "Skills": [
        "Bachelor’s Degree in Business Administration or any related field",
        "At least 10 years of Sales & Marketing in leading companies in the Middle East, specializing in exportsales and packaging industries.",
        "Preferred who has sales experience & background in Plastics / Packaging Industries only. ",
        "Perfect in using MS Office, ERP and others.",
        "Ability to Read, Write & Speak English fluently.",
        "Analytical Skills.",
        "• Ability to work under stress.",
        "• Detail oriented.",
        "• Relationship Management.",
        "• Negotiations SkillsCommunications and networking skills"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}