{
    "Job ID": "4721176",
    "Description": "The preparation, review and reporting of accurate project schedules and plans in support of the robust control of projects throughout their lifecycle.\nResponsible for the development of project schedules and plans, ensuring they are prepared to the required level of detail and accuracy and accordance with contractual requirements and client policies, procedures, and standards. The Principal Planner shall be responsible for identifying areas of best practise and driving continuous improvement within the Planning team.\nSupports the management and development of the Planning team, the management of project schedules and plans, and the preparation and filing of project planning documentation.\nMay act as the focal point for several project scopes. May deliver the role as a standalone position or as part of a team as defined by the requirements of the project organisation.Responsible for ensuring that:Project schedules are maintained in accordance with approved contract and project Work Breakdown Structure.\nProject plans and schedules are issued in accordance with contract reporting calendar and on an as required basis.\nAll project schedules are fully logic linked and show the critical path and total float for all.\nThe project schedule is baselined at the time of approval by the client of funding for the\nAll project schedules contain resources in accordance with the corporate standards.\nWork packs delivery milestones are clearly identified within the project.\nA standard set of agreed milestones are maintained within both the schedule and the cost reporting database.ResponsibilitiesActs as Planning focal point for specific project scopes.\nReview and maintain planning control structures are developed and maintained in alignment with approved project Work Breakdown Structure (WBS).\nReview and maintain baseline project plans and schedules using appropriate scheduling.\nMonitor and control planning activities through all phases of project lifecycle.\nLiaise with engineering, procurement and construction functions, and others as required, including third parties, to maintain awareness of project activities, their status, and their impact on the project schedule and manpower requirements.\nProvide copies of project plans and schedules in accordance with project reporting\nProvide copies of project progress and performance status reports in accordance with project reporting requirements.\nReview and issue updates to project plans and schedules\nReview and issue updates to project manpower requirements\nMonitor and assess schedule impact of change notifications.\nMonitor and review overall project progress status, achievement of major milestones, and evaluate project performance in relation to planned performance.\nAttend internal project progress and performance status meetings as required.\nLiaise with cost discipline to ensure accurate and timely control and forecasting of man-hour budgets and ensure that the impact of all change requests is properly assessed and included in the schedules.\nParticipate in schedule risk analysis as required.\nParticipate and lead Project Controls Compliance and Continuous Improvement Reviews\nPlay an active role in the mentoring and career development of Planning personnel.Skills",
    "Skills": [
        "Senior Planner"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}