{
    "Job ID": "4721177",
    "Description": "Onshore / Offshore Oil and Gas.\nDirect and supervise a team of relevant discipline engineers and designers.\nResponsible for providing expertise and ensuring the application of correct standards in all pre-FEED/FEED / EPC deliverables in the design and development of projects associated with Oil and Gas processing, production, and export, as well as carbon capture processing, transportation, and storage.\nSupervise the work of relevant discipline Engineers and Superintendents and ensure that quality and standards are maintained, and cost-effective solutions are adopted\nFully understands the COMPANY HSE policy, procedures, regulations, and objectives as they relate to his area of responsibility.\nEnsures that work under his/her control is performed in a safe and environmentally sound manner\nReview any design work carried out by third parties (vendors) and participate, in HAZOP, HAZID, IPF, reliability studies, and Safety and Facilities Technical Audits.\nEstablish the actual (as opposed to design) capacities/capabilities of existing field facilities and pipelines to identify potential bottlenecks and scope for optimization.\nIdentify potential applications for new technology.\nDevelop actively the local staff to fulfill engineers and roles.\nKnow the environmental aspects (ISO14001) of oil and gas project design.\nKnow the safety aspects of design in relation to the project cycle (e.g. HAZID, HAZOP, HAZAN, IPF classification methodology and implementation, QRA, reliability studies, Fire and Gas mapping, and risk analysis techniques).\nConduct life cycle cost analysis.\nPrepare RFQ (request for quotation) technical packages for pipelines-related scopes\nPrepare engineering, construction, and material estimation, schedule, and resource planning and update resource capacity planning half-yearly.\nProvide first-class engineering in one or more of the following fields; risers, subsea pipelines, landfalls, subsea manifolds, piping design, and onshore/subsea pipelines.\nBe familiar with working with construction engineers and installation schemes.Skills",
    "Skills": [
        "Minimum Qualification:",
        "Bachelor's degree in relevant engineering from an accredited university\nMinimum of 10 years of relevant experience in the offshore/onshore Oil and Gas / Petrochemical and Marine industry.\nMust have at least five years of experience in a similar position for international major Oil and Gas / Petrochemical / Marine projects including a minimum of three years in ENGINEER's / CONTRACTOR's organization.\nExperienced in using ASME, API, ISO, DNV, and Shell DEP codes and standards in pipeline design and construction.\nExperienced in the use of pipeline software (AutoCAD, Microstation, MathCad, CAESAR II, Abacus, ESRI/GIS) is preferred\nProficiency in Microsoft Excel, Word, Outlook, and PowerPoint is required"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}