{
    "Job ID": "4721179",
    "Description": "Job Accountabilities:Execute engineering Design, FEED and detail Engineering experience and Costing estimation for proposal in Telecom systems.\nResponsible for complete engineering document activities like preparing block diagram, functional design specification, datasheets, MR, equipment layouts, interconnection drawings, termination drawings, cabinet drawings.\nDevelop specifications and prepare material requisitions for Telecoms systems.\nTake part in technical bid evaluations, Vendor document reviews and approvals.\nManagement of third-party suppliers in the execution of engineering delivery.\nPrepares and develops material take off, participates in project reviews, design reviews, audits and other workshops as requiredSkills",
    "Skills": [
        "Minimum Qualifications and experience required:",
        "MSc, MEng or equivalent professional qualification or BSc, BEng or equivalent with extensive relevant experience\nMinimum of 10 years' experience in IT / Telecom field including Security & Safety, wired & wireless communication in Oil & Gas Projects and extensive knowledge in LAN & WAN, ACS, UHF/VHF Radio, CCTV, FOC, IDS, PAGA, Hotline systems, Fire Alarm, and IP telephone.\nExperience of working in a variety of projects and phases, including greenfield and brownfield, on and offshore, Pre-FEED through to EPC, with a focus on offshore upstream.\nIdeally has experience with Qatar O&G customer design standards including Shell DEPs.\nExperience with management of vendors, able to complete Technical Bid Evaluations and oversee development of vendor scope.\nConstruction and site experience is desirable."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}