{
    "Job ID": "4721420",
    "Description": "Create accurate 2D and 3D drawings based on architectural and civil engineering designs and specifications.\nPrepare detailed architectural drawings including floor plans, elevations, sections, and details.\nCollaborate with architects, engineers, and project managers to understand project requirements and ensure drawings align with project objectives.\nUse computer-aided design (CAD) software to create and modify drawings, ensuring adherence to industry standards and best practices.\nIncorporate revisions and changes into existing drawings as required.\nAssist in the development and maintenance of drawing standards and templates.\nReview drawings for accuracy, completeness, and adherence to project requirements.\nCoordinate with other team members to ensure drawings are delivered on time and meet project deadlines.\nStay updated with industry trends and advancements in architectural and civil engineering drafting techniques and software.Skills",
    "Skills": [
        "Bachelor's degree in Architectural or Civil Engineering from a well-known university.\nMinimum of 5 years of experience as a Draftsman in architectural or civil engineering projects.\nProficient in creating 2D and 3D drawings using CAD software (e.g., AutoCAD, Revit).\nStrong knowledge of architectural and civil engineering principles, standards, and practices.\nExperience in creating architectural drawings (floor plans, elevations, sections) and civil engineering drawings.\nFamiliarity with operation and maintenance projects is preferred.\nExcellent proficiency in both English and Arabic languages, both verbal and written.\nAttention to detail and a high level of accuracy in producing technical drawings.\nStrong analytical and problem-solving skills.\nGood time management skills and ability to prioritize tasks.\nAbility to work effectively in a team environment and collaborate with cross-functional teams."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}