{
    "Job ID": "4721586",
    "Description": "Performing geospatial modeling, analysis, and data manipulation using ArcGIS\nCreating, updating, and maintaining geodatabases, attributes, maps, and graphs using ArcGIS.\nAnalyzing geo-spatial data for geographic statistics to be incorporated into documents and reports.\nCompiling geographic data from a variety of sources including censuses, field observation, satellite imagery, aerial photographs, tabular data, databases, and existing maps\nEntering map data through use of a digitizer or by direct input of coordinate information using the principles of cartography including coordinate systems, longitude, latitude, elevation, topography, and map scales\nDeveloping GIS web applications and deploying them on ArcGIS platform\nAadministering and configuring ArcGIS platform on multiple operating systems like Windows and Linux.Skills",
    "Skills": [
        "Experience in performing geospatial modeling, analysis, and data manipulation using ArcGIS\nExperience in creating, updating, and maintaining geodatabases, attributes, maps, and graphs using ArcGIS.\nExperience in analyzing geo-spatial data for geographic statistics to be incorporated into documents and reports.\nExperience compiling geographic data from a variety of sources including censuses, field observation, satellite imagery, aerial photographs, tabular data, databases, and existing maps\nEntering map data through use of a digitizer or by direct input of coordinate information using the principles of cartography including coordinate systems, longitude, latitude, elevation, topography, and map scales\nExperience of developing GIS web applications and deploying them on ArcGIS platform\nExperience of administering and configuring ArcGIS platform on multiple operating systems like Windows and Linux."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}