{
    "Job ID": "4722907",
    "Description": "Accountant - Events & AdvertisingRoles and ResponsibilitiesHIRING an Accountant for our client who is a full-fledged integrated advertisement agency with an international presence capable of delivering mid- to large-scale events, content creation, and film production.Handle full spectrum of financial and cost accounting role eg. AR, AP, GL, forecasting, budgeting etc .\nResponsible for day-to-day finance and accounts operations.\nPerform full set of accounts and ensure timely closing of accounts.\nCreating events briefs and regular planning with the events team and communication with the client.\nAssisting the Business Development team with research on potential clients.\nManagement with the creative team on deadlines and priority of projects.\nResponsible for timely monthly consolidated financial statements, payments, cash-flow management reporting for submission to the head of finance.\nReview & approve payment vouchers & journal entries.\nPerform cash flow forecasting, budgeting and working closely with the operations and project teams in analysing margins, variances and cost analysis.\nIssue project cost reports for review and approval.\nDevelop and maintain internal control and effective accounting system and policies for the set up.Skills",
    "Skills": [
        "Bachelors in Finance or Accounting Discipline with a minimum of 2 years of experience in Events/Advertising or service industry in an Accounting role.\nShould be a Saudi National\nCandidate must be based in Riyadh, Saudi Arabia\nStrong English communication skills\nDemonstrate intermediate to advanced skills and knowledge of Excel, as well as other Microsoft Office applications"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Gender": "Male",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Advertising",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}