{
    "Job ID": "4722974",
    "Description": "Assisting the Executive Chef, Culinary Sous Chef and Team Leader Culinary Chef to develop standard recipes which allow the kitchen department to operate at an acceptable cost. Plan, prep, set up and provide quality service in all areas of restaurants, but not limited to all menu items supplied by outlet kitchen. Displays and presentations of all items designated by Sous Chef for service. All mise-en-place completed to the satisfaction of supervisor and or Sous Chef. You will be able to follow established recipe and plating guide provided, to exact specification Maintain and organize the station and equipment in a neat and orderly fashion to meet the Chef’s expectation. Maintain and contribute to a positive work environment.\nExercise the “duty of care”, i.e., the moral and legal obligation to protect the guests, staffs, contractors, vendors, suppliers and all other persons within our care from harm or loss when they are exposed to our activities or using our services, with watchfulness, attention, caution and prudence that a reasonable person in all circumstances would.\nProvide, as far as reasonably practicable, the highest level of protection, against harm or loss from hazards and risks to the health, safety and welfare, of oneself and of the persons working under own’s authority.\nPractice due diligence through assessment and review such that all risks and hazards are controlled and maintained to acceptable level in any modification, introduction of new process, machine and/or even engaging new persons in the business to ensure that all aspects and considerations are sufficiently looked into prior to implementation or engagement.\nCommit to safe systems of work by adhering to agreed processes that are put in place, which can include, but not limited to those in the approved manuals, policies, procedures and SOPS and thus it shall be everyone’s responsibility to know and understand thoroughly these systems and processes, execute properly and avoid short cuts.\nTake ownership of own’s health and safety for the matters within one’s control or ability to influence, through leadership by example and ensure that the rest of the persons within one’s responsibility and influence, including contractors, follow through.\nBe prudent by adhering to the laws, regulations, applicable standards and guidelines imposed by the governing authorities by, including but not limited to, possessing and updating the necessary professional and other business-related licenses, securing and renewing timely the permits and certificates, and getting medical clearances, sufficient training and appropriate qualifications required for the performance of work or job.\nFollow strictly the rules and regulations set by the company to protect the lives and welfare of the persons involved in its business processes, including the protection of property and environment from damages and other forms of losses.\nPrevent accidents / incidents to happen by promptly reporting the presence of hazards and risks, unsafe acts and unsafe conditions, and escalate issues and concerns at the work place to immediate superiors or to persons in authority who can assist in addressing with appropriate and timely actions thus preventing them to worsen, complicate or magnify into unmanageable huge proportions. \nReport, investigate, cooperate and resolve incidences involving oneself and persons within own’s control and influence, timely and accurately.\nContribute to a healthy, illness-free work place by observing proper personal hygiene, high standard of cleanliness and observing consistent housekeeping as a part of one’s responsibility.\nReport sickness / illnesses that occurred to oneself or to any person in the team, including those unsanitary and unhygienic conditions, that may potentially affect performance and productivity, safety and welfare while performing the work, spread or infect others and/or cause inconvenience to others and guests.\nParticipate in company activities with the objective of improving the readiness to emergencies, awareness to health, safety and environment and enhancing the work-life and employee welfare.·        Organize the sections with regard to mise en place production and its service·        Work closely with the chef and execute directions as communicated following SOPs·        Responsible for completing the daily checklist regarding mise-en-place and food storage·        Maintain good colleague relations and motivate while directing them through designated SOPs·        Work to the specifications received by the respective Culinary Team regarding portion size, quantity and quality as laid out with recipes·        Attend meetings as requested by the Chef De Party.·        Check the main information board regarding changes in any Events or other information regarding the organization·        Report any problems regarding failure of machinery and small equipment to Commis I/ Demi Chef De Party/ Exec Sous Chef / Culinary Sous Chef and to follow up and ensure necessary work has been carried out·        Pass all information to the next shift about functions, product levels or other related business needs.·        Performing daily spot checks of all portioning tools and providing daily documentation and record keeping of product spoilage. ·        Cooking duties and related functions as well as ensuring high food quality levels per Motiongate Dubai Park standards.·        Maintaining a clean work area and ensuring compliance with the municipality HACCP Program.·        Understanding and actively participating in Environmental, Health & Safety responsibilities by following established DPR policies, procedures, training and Team Member involvement activities·        Able to follow all Motiongate Dubai Park standards and HACCP guidelines.Any other duties as may be reasonably requested by the Management TeamSkills",
    "Skills": [
        "Food Preparation: Proficiency in basic food preparation techniques, such as chopping, slicing, and peeling ingredients, and following recipes accurately.\nCooking Skills: Ability to cook various dishes, sauces, and accompaniments with guidance from senior chefs.\nTime Management: Effective time management to handle multiple tasks and prioritize duties in a fast-paced kitchen environment.\nAttention to Detail: Meticulousness in following recipes, ensuring proper seasoning, and presenting dishes attractively.\nFood Safety and Hygiene: Knowledge of food safety standards and hygiene practices to maintain a clean and safe kitchen environment.\nTeamwork: Collaboration with other kitchen staff to ensure smooth operations and timely service.\nAdaptability: Ability to work well under pressure and adjust to changing demands in a dynamic kitchen setting."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}