{
    "Job ID": "4722660",
    "Description": "Job Purpose Summary:The incumbent is primarily responsible for managing and controlling development projects as required by the assigned Application Pool Project and analyzing user requirements and provide the best solution to cater for these requirements.Communications and Working Relationships:-         Directly reports to the assigned Application Group Leader which would vary depending on the assigned project.-         Divisional and departmental officers of project’s business units, units providing support operations and all other related divisional/ departmental officers.Supervisory Responsibilities:Solid line reporting: System Analyst (Web/.Net/Java); Programmer (Web/.Net/Java)Framework and Boundaries:-         Group’s overall strategic plan.-         Budgetary targets.-         Applicable policies and procedures.-         Relevant regulatory pronouncements of the applicable local and international regulators and related best practices.-         Delegated authorities as per the delegation of authorities’ structure.Operating Environment/ Location:-         Located in headquarters with periodic visits to branches and subsidiaries, if and when required.Skills",
    "Skills": [
        "Education/Experience Requirements:",
        "-         Bachelor’s degree in Computer Science.",
        "-         7+ years’ experience in financial services with a specialization in IT related design, analysis, development, and maintenance.",
        "-         Experience in case tools and RDBMS- Regional Database Management System",
        "-         Training courses and certification in systems technology, programming and banking.",
        "Required Special Skills:",
        "-         Strong programming and analysis skills in development tools and languages.",
        "-         Ability to identify need for change, adaptable and flexible in anticipating and realizing improvement opportunities.",
        "-         Excellent oral and written communication skills in English and Arabic (preferable).",
        "-         Strong analytical, problem solving and decision-making skills.",
        "-         Self-driven with well-developed leadership, motivational and team-building skills.",
        "-         Good interpersonal and networking skills."
    ],
    "Preferred": {
        "Nationality": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services; Economics & Financial Consulting; Banking",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}