{
    "Job ID": "4722835",
    "Description": "Carry out relevant duties of managing incoming and outgoing calls as per the assigned schedule.\nProvide accurate information to the caller, catering to all the necessary inquiries.\nElaborate on the features, specifications, and details of the company's product to convert the potential prospect into a consumer.\nContribute to the company's growth by improving the number of connections using pleasant and informative conversations.\nMaintain necessary call log details using the latest technology available in the company's cloud or digital database.\nEnhance customer satisfaction by reducing call waiting and offering a delightful telephonic conversation.Work conditions:• Location: Gesr El Swiss, Alf Maskan, Cairo• Working Days: 6 days + 1 days off• Working Hours: 9 Hours (10 am – 7 pm) - Office based• Salary: competitive salary + Mobile allowance Skills",
    "Skills": [
        "Proven track record of handling all the duties and responsibilities of a call center agent or associate.\nGood command of verbal communication skills to intrigue the listener and provide accurate information.\nA passionate individual with the potential to handle multiple activities while attending a call simultaneously.\nStrong command of handling relevant computer operation activities to boost overall work productivity.\nRefined communication skills with an ability to persuade customers.\nReady to adapt and elevate existing skills based on improvement feedback."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 6",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 33"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Fashion & Apparel; Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}