{
    "Job ID": "4722488",
    "Description": "Our client is a Leading Banking Company. They are now looking for a Relationship Manager in Investment Banking to join them. Roles & Responsibilities Develop and manage client relationships to meet client needs and achieve desired objectives of the bank in line with the required standards and identify new clients and ensure the proper articulation of services/products\nManage the daily interactions with clients and provide superior client service to improve clients’ experiences and maximizes the bank’s profitability\nMonitor and control customer portfolios to achieve desired quality through cross-selling, upselling, and retention\nDeliver the financial target as agreed with the business whilst adhering to the required standards, policies, and procedures\nImplement approved departmental policies, processes, and procedures, and ensure employee adherence so that work is carried out to the required standard while delivering the required standards of service to customers and stakeholders Skills",
    "Skills": [
        " Preference",
        "At least 3 years of relationship management experience in the banking/financial services industry\nWorking knowledge and experience in banking operations and ability to prioritize and handle multiple tasks\nStrong planning, analytical, and time management skills in-depth knowledge of global financial markets and trends Understanding of wealth management products and service",
        "Qualifications:",
        "Good time-management skills\nGreat interpersonal and communication skills\nMust be from the same relationship management banking industry\nMBA in Marketing/ BBA/ B.com etc.",
        "Benefits:",
        "Air ticket\nInsurance"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}