{
    "Job ID": "4722648",
    "Description": "1.Operate, control and adjust the Clinker production unit in accordance with operatingprocedures and approved safety and environment procedures to ensure achievement of targeted production capacity with desired quality2. Maintain constant contact with local operators to provide work direction to ensure equipment, instruments and the process are properly controlled3. Maintain an accurate log and record keeping ensuring all information on the status of the operation is documented and keep superior informed on operating conditions to enable monitoring of production progress and for the co-ordination of overall shift activities and effective co-ordination with maintenance activities4. Provide incident response in the event of emergencies or major incidents in order to eliminate or limit potential loss or damage to UACC personnel, assets and theenvironment5. Abide by and observe Safety and Health regulations in all activities ensuring thepreservation and safety of human life, machinery and company assets6. Develop further expertise and understanding of the production process through on-the-job training, formal training programs and guidance provided by Senior Operator andShift Supervisor7. Housekeeping of CCR and maintain cleanliness of control room desk.8. Diagnose and troubleshoot potential operating problems, either in consultation with seniors or independently when immediate action is necessary to ensure continuity of production9. Support and guide New CCR Operators and Operators providing on the job directions as required to ensure transfer of knowledge and expertise10. Co-ordinate with the maintenance crew during stoppage including conducting physical inspection of production unit and recommending needed maintenance work11. Assist in the maintenance jobs with respect to refractory lining to ensure quality quantity of lining.meets or exceeds required standards): Shows Concern to Get things Right – produces\nwork to the standard required and checks information for accuracy; learns from\nmistakes and maintains a clean/tidy work area.\nensure continuity of production) Takes Personal Responsibility\nDeveloping others: (Support and guide new CCR Operators and providing on the job\ndirections as required to ensure transfer of knowledge and expertise). Impart training to\noperators Develop further expertise and understanding of the production processSkills",
    "Skills": [
        "Independent Analysis of Cement Operational Problems\nKnowledge of Control &amp; Instrumentation systems parameter.\nAbility to conduct technical operation training new CCR Operator.\nAbove average computer knowledge\nCan Read, Write and Speak in English.\nAchievement Drive (the drive to beat targets and seek performance improvement\nopportunities.) Works Hard – focuses on the task and in doing things to a high standard;\ndoes all that is possible to get the desired result and places importance upon completing current tasks.\nConcern for Order &amp; Quality (the drive to produce accurate, high quality work which\nExpertise: (the ability to break down issues into logical steps and solve problems).\nIdentifies Process Steps – breaks down an activity into logical steps and sees.\ninterdependencies; thinks things through and sets priorities.\nTeamwork (the drive to work together and to co-operate in the achievement of a\ncommon goal). Supports the Team – talks about team achievements to others outside\nthe team; expends energy to ensure that team members receive benefit from team activities.\nProfessionalism (the focus on standards and efficient performance with regard to self\nand others). Focuses on Efficiency – examines ways in which work may be performed\nmore quickly or to a higher standard; is concerned with the cost implications of own actions.\nSelf-confidence: (Diagnose and troubleshoot potential operating problems, either in\nconsultation with seniors or independently when immediate action is necessary to\nthrough on-the-job training, formal training programs and guidance."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "Altaif, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Altaif, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}