{
    "Job ID": "4722493",
    "Description": "Our client is a Electrical/Electronic Manufacturing company. They are now looking for a Electrical Sales Engineer to join them.Roles & Responsibilities (Max 5 points)Develop and execute sales strategies to meet or exceed sales targets for MV/LV products and services.\nIdentify and prospect new customers while maintaining existing customer relationships.\nConduct market research and analysis to identify customer needs, competitor activity, and new business opportunities.\nProvide technical expertise and guidance to customers regarding MV/LV products and services.\nPrepare and deliver sales presentations, proposals, and demonstrations to customers.\nCollaborate with engineering and technical teams to ensure that product and service offerings meet customer requirements.\nAttend events and trade shows to network and stay up-to-date on the latest trends and technologies in the electrical engineering field.\nMonitor and report on sales performance, including revenue, margins, and customer satisfaction metrics.Skills",
    "Skills": [
        "Preference (Max 5 points)",
        "Arabic/English Speakers\nImmediate Joiners",
        " ",
        "Qualifications: (Top 3 Points)",
        "English fluency is required.\nBachelor's degree in Electrical Engineering or a related field.\n2 to 5 years of experience in electrical sales in the Saudi Arabia Market.\nProven track record in sales, preferably in the panel builder or contracting industry.\nStrong technical knowledge of electrical engineering principles and practices is necessary.\nExcellent communication and interpersonal skills are essential to build and maintain customer relationships.\nAbility to understand customer needs and provide technical solutions to meet those needs.",
        " ",
        "Benefits: (Max 3 points)",
        "Air ticket\nInsurance",
        "Salary: SAR 12000 - SAR 16000"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}