{
    "Job ID": "4722594",
    "Description": "This role would suit some-one who enjoys helping others get things done swiftly and effectively and who will gladly take the initiative to carry out anything and everything from the smallest day-to-day tasks to the more complex tasks. You work in a detailed, timely and professional way. You are experienced in presenting research in a visually clear and informative manner. You pride yourself in negotiating the best value and proactively suggest ways to earn and redeem loyalty benefits. You are positive, punctual, and self-motivated. Reporting to a senior PA on the team, this role will involve a mixture of working from your home as well as being out-and-about running errands or helping out at a property. Admin/ResearchResponding to requests straight away and with a \nsense of urgency.\nRenewal of licenses\nSourcing services\nResearching products and finding best prices\nArrange couriers and deliveries \nCollection/delivery of paperwork\nFollowing up with suppliers and achieving result \n(e.g. flight refund, utilities, paperwork)\nWeekly ReportingErrandsCoffee/lunch runs\nOrganizing services with 3rd parties (e.g., tailors, \ncontractors, maintenance) \nPurchasing gifts \nSupermarket runs\nDry Cleaning FinanceCash debit card reconciliation (for team purchases) \nReview and process supplier paymentsPropertyAssisting at property with any property-related task\nBeing the eyes and ears for the Property Manager\nProviding access and supervising 3rd parties\n(maintenance, snagging company)\nEnsuring all equipment at property is working, (AC, \nprinter, shredder, white goods, small electrical \nitems).\nProcurement of household, pantry & cleaning \nsuppliesSkills",
    "Skills": [
        "You have proven in past roles that you are flexible and have a 24/7 mindset (i.e., responsive out of hours as needs ",
        "arise) although the regular working schedule is Monday to Friday. You are a driver and own your own car.",
        "Based in Dubai within a 30-minute drive of Palm Jumeirah.\nValid [UAE] Driving Licence and familiar with driving in Dubai. \nMinimum 8 years’ proven experience in similar roles.\nExcellent level of spoken and written English with outstanding accuracy in written work.\nTech savvy and highly skilled in MS Office as well as competent in trouble-shooting tech issues.\nDiplomatic, discreet, and confidential"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Virtual Assistant Services; Personal Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}