{
    "Job ID": "4722485",
    "Description": "SALES AND APPLICATION ENGINEERPosition Title:             Sales and Application EngineerEmployment Type:     Full TimeSalary:                        up to 10K AED all-inclusive, depending on experience and qualifications plus medical insurance, annual airfare ticket, company carJob Location:             Abu Dhabi, UAEAbout the Client:They are one of the leading retail office equipment suppliers in the regionJob Description:Develop and execute sales strategies to achieve revenue targets and expand the customer base.\nProvide pre-sales and post-sales technical support, including product demonstrations, training sessions, and troubleshooting assistance.\nStay abreast of industry trends, competitor activities, and technological advancements in Test Measurement & Pressure Calibration Equipment.\nWork closely with the sales team, marketing department, and product development team to relay customer feedback, identify areas for improvement, and contribute to the development of marketing strategies and product enhancements.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Asian nationals\nMale, 35 years old and below\nAt least 2 years of UAE experience in the same role\nMust have UAE Driver’s License\nCandidates coming from the following industries are much preferred: Oil & Gas maintenance services workshops, Power Generation & Transmission, Desalination Plants and Steel fabrication companies\nImmediate joiners will be prioritized\nDemonstrate in-depth knowledge of Test Measurement & Pressure Calibration Equipment, particularly with brands like DRUCK and FLUKE. Understand the intricacies of various equipment models, their features, applications, and benefits to effectively communicate and recommend appropriate solutions to customers."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}