{
    "Job ID": "4722156",
    "Description": "IT Application Manager ( Arabic Speaking)Skills",
    "Skills": [
        "Min of 12 years of experience in computer software development, management and planning work\nAbility to design systems and guide on technical stack and roadmap\n3yrs+ of Business User facing experience, with sensitivity and commitment to business problem solving\nDemonstrated experience in leading a team\n3- 6 years’ experience in application development\nA minimum of 5 yrs of demonstrated competency in a junior or assistant project",
        "management role involving the execution of multiple projects or a large project preferably in Human Resource",
        "2 +years Microsoft SQL server experience.\nPrevious development and/or administrative experience with with VB.NET, HTML, CSS,",
        "JavaScript experience",
        "Strong background in most of the following: C#.NET, XML, Flash Design, SEO, usability, Content Management, technical writing; intermediate background in the following: W3C,Compliance, 508 Compliance\nFamiliarity with the following technologies: IIS, relational databases, Active Directory, Azure, VSTS, SSO,\nWeb Services, FTP, RSS, Facebook, Twitter.\nStrong communication skills with a proven ability to understand key concepts and",
        "communicate effectively with technical staff, business stakeholders and senior management.",
        "Proven ability to communicate technical concepts to non-technical people to enhance",
        "understanding and drive decisions that lead to positive outcomes.",
        "Proven ability to collaborate, build relationships and influence individuals at all levels in a",
        "matrix-management environment (as well as external vendors and service providers) to",
        "ensure that segregation and overlapping roles are identified and coordinated.",
        "Strong organizational skills, the ability to perform under pressure and management of",
        "multiple priorities with competing demands for resources.",
        "Strong analytical, data processing and problem-solving skills.\nProficiency in process formulation and improvement.\nAbility to lead and motivate others; demonstrating empathy and knowledge of personality types\nFamiliar with project management methodologies (for example, PMI and Agile)\nDemonstrated sensitivity to working in a political environment and to interacting with senior leadership\nKnowledge of project planning tools\nExceptional verbal and written communication skills; expertise in setting and managing customer expectations\nDistinctive blend of business, IT, financial and communication skills, as this is a highly",
        "visible position with substantial impact",
        "Effective influencing and negotiating skills in an environment where this role may not",
        "directly control resources",
        "Strong knowledge and understanding of business needs, with the ability to establish and",
        "maintain a high level of customer trust and confidence",
        "Good understanding of current and emerging technologies and how other enterprises are",
        "employing them to drive digital business",
        "Demonstrated ability to develop and execute a project resource plan that ensures that the",
        "right people are in the right place doing the right things at the right time"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 15",
        "Gender": "Male",
        "Nationality": "All Arab Countries; All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}