{
    "Job ID": "4722631",
    "Description": "-Develop demand forecasts (operational forecasts) at multiple levels of aggregation for multiple time horizons as part of a demand planning function.-Review historical sales trends, research demand drivers, prepare forecast data, develop statistical forecast data.-Coordinate cross-functional research activities to reconcile significant variances and refine the forecast model to reflect updated sales and marketing assumption.-interact with sales, marketing and customer finance to understand demand forecast drivers.-Use maintain the demand planning software as the primary forecasting system tool.-Utilize a collaborative and consensus approach by working with sales, Marketing and customer finance to obtain and ensure that current and accurate information is used for demand forecasts.-Provide input to material planning team in developing inventory strategies on existing items, new products, and product phase-outs.-Closely coordinate and communicate customer action plans with material planning team.-Develop effective forecast models based on industry trends and demand patterns.Skills",
    "Skills": [
        "-Bachelor's degree or equivalent experience with emphasis in demand planning management.",
        "-Minimum 3 years experience in demand planning department.",
        "-Solid understanding of inventory management practices and procedures.",
        "strong mathematical and statistical knowledge.",
        "-capability to multitask in fast-paced environment.",
        "Excellent written and verbal communication skills."
    ],
    "Preferred": {
        "Nationality": "Egypt"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}