{
    "Job ID": "4722760",
    "Description": "A leading Real Estate Developer is hiring a Quantity Surveyor. Based in Riyadh and reporting to the Director – Design & Engineering.     You will be responsible to calculate all quantities for items related to the costs of construction and civil engineering projects, from the initial calculations to the final figures, and make sure that construction costs are managed efficiently.Execute all types of quantities taking off, including but not limited to development drawings, tender drawings, and any requested quantities taken off by the TS team during the project life cycle.\nReview BOQs according to Project specifications and Drawings, assure tender documents are matching, and include all items.\nVerify submitted bidding BOQ by contractors; assuring quantities and specifications are matching with the Tender document shared with them.\nCreate a BOQ template with QC for all upcoming projects.\nVerify any submitted final payment – quantities & amount. Assure all supporting documents/as-built drawings & quantities sheets are attached & accurate to issue the Final Cost Summary.\nReview & endorse progress payments whenever requested while recording accumulative amounts till the final payment receiving.\nRegularly Preparing and updating projects’ payment status report with time schedule. The report should be updated on a biweekly or monthly basis, according to work needs.\nReview submitted Variation Orders / assure claimed quantities accuracy, supporting documents are attached. Verifying claimed amount is part of the contractor’s Scope of Work as per contract documents.\nTo execute any task related to quantity surveyors, design, and engineering requested by the management.Skills",
    "Skills": [
        "Bachelor’s degree or diploma in Engineering or Quantity Surveying.\n3-4 years of experience in the real estate field.\nEffective Communication skills\nMicrosoft Office.\nAutoCAD\nCivil 3D\nFocus\nNumerical skills\nGood Working Knowledge of Software."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 7",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Certification / diploma",
        "Age": "Min: 24 Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Real Estate",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}