{
    "Job ID": "4722249",
    "Description": "Clientele ExecutiveAbout The Job Role:Clientele Executive should be charismatic and skilled to approach potential clients and inform them of our products and design services by building good relationships with new and existing clients to help building brand loyalty with excellent interpersonal skills and global brand awareness experience.Duties & Responsibilities:Approach clients as they enter the showroom, collaborate with them to understand their design needs, preferences, budget constraints, and mood boards, by offering professional guidance and assistance in selecting appropriate furniture pieces that align with their design vision.\nDevelop a deep understanding of furniture brands, product features, materials, and design styles to effectively advise clients and assist them in making informed purchasing decisions.\nProvide exceptional customer service by actively listening to clients, addressing their concerns, and ensuring their satisfaction throughout the entire design and purchase process.\nOffering clients with superior service and cultivates relationships to sell and develop future business utilizing effective selling techniques and providing assistance when called upon in rotation to ensure appropriate order procedures and processing. Such as Processing quotes, sales orders, issuing receipts and invoices.\nManage sales process by having a polite response to questions/inquires raised by clients to ensure achieving sales goals, as well as creating and maintaining a client base.\nMeet and exceed sales targets set by the retail store management. Actively pursue sales opportunities, negotiate pricing, and prepare sales quotations to secure orders from clients.\nUtilizes strong interpersonal skills, selling skills, active listening, professional attitude, and represents the company with integrity and professionalism.\nMaintain a clean and organized appearance of the showroom.\nParticipates in showroom functions including but not limited to training and mentoring others, weekly sales meetings, working reports, maintaining showroom appearance, tagging, wrapping and loading light furniture and accessories for clients, answering phones, greeting, catalogue / price list upkeep, cleaning, and inventory.\nConduct outbound lead follow-up calls to potential and existing clients via telephone and E-mail to maintains client contact from order writing through delivery to ensure client satisfaction.\nCollaborate with the design and sales teams to ensure smooth project execution and timely delivery of products and services.\nAttend industry events, trade shows, and networking opportunities to expand client base and promote our brand.\nMaintain accurate and up-to-date client records, including contact information, preferences, and project details, using appropriate customer relationship management (CRM) software.\nMeet or exceed sales targets and contribute to the overall growth and profitability of the company.We offer a competitive salary package, including commission and performance-based incentives, along with opportunities for professional growth and development in a fast-paced and exciting industry with an innovative solution.If you have a passion for interior design, a talent for building relationships, and a drive for customer satisfaction, we would love to hear from you. Apply now and join our team as a Clientele Executive in the interior design and furniture sector.Skills",
    "Skills": [
        "Minimum of 2-3 years of demonstrable experience in sales, marketing, merchandising or related field, preferably within the retail industry related to interior design or furniture industry.\nStrong understanding and/or motivation to learn about interior design concepts, furniture styles, and materials is an advantage.\nAbility to Multitask, integrity, discipline, excellent communication, and interpersonal skills\nCritical thinking, negotiations skills, service orientation, decision making\nExcellent English verbal and written communication skills. (Arabic is an advantage)\nComputer literacy with proficiency in using MS. Office package, CRM/ERP software, and other relevant tools.  \nShould have transferable residency 18.\nDriving licence + Car is an advantage."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "6"
    }
}