{
    "Job ID": "4722741",
    "Description": "§ يحلل ويراجع تقارير حوادث التأمين الشامل (مطالبات انتظار اذن الدخول – مطالبات بانتظار تعميد الإصلاح – مطالبات الخسارة الكلية التي لم يتم التعويض عنها).\n§ يوجه المعقبين لإنهاء حالات الحوادث عن طريق طباعة تقارير الحادث سواء عن طريق نجم او المرور أو شرطة أو الدفاع المدني.\n§ يقدم مطالبات الحوادث للتأمين سواء شامل أو طرف ثالث.\n§ يتابع الحوادث والمطالبات بشكل يومي ويعد التقارير الأسبوعية والدورية وحسب الطلب.\n§ يوجه مسؤول التقديرات لتقدير المركبات بشكل يومي وبدون تأخير ويراجع التقديرات بالتنسيق مع الصيانة\n§ يتابع حالات الحوادث الشاملة من إذن دخول أو تعميد اصلاح أو إصدار خطاب الخسارة الكلية.\n§ ينهي تقدير أضرار المركبات التي يتم استلامها من العملاء وعليها ضرر ويرسلها إلى التحصيل.\n§ يشارك في اعداد التقارير اللازمة بإدارة التحصيل كشف الحوادث والتأمين الطرف الثاني (حوادث قيد الاجراء – حوادث جاهزة للتأمين – حوادث مسلمة الى تأمين الطرف الثاني – حوادث وقف الخدمات).\n§ يمتثل للمعايير الخاصة بالتقييم أضرار المركبات من الهيئة السعودية للمقيمين المعتمدين ويراجع التقييم ويدعم الاعتراض على التقييم بالمستندات والوثائق التي تضمن تجنب الهدر في التكاليف.\n§ يتابع عودة المركبات بعد الإصلاح ويقيس الانحرافات الخاصة بالمدة المقدرة لعودة كل مركبة لتجنب وقوف المركبات خارج التشغيل.\n§ يعد كشوفات الحوادث ويقيس المؤشرات الخاصة بمعدلاتها في الفروع ويناقش أسبابها للاتخاذ الإجراءات اللازمة.\n§ يرفع الحوادث الغير نظامية أو المرفوضة وكذلك التلفيات للمدير المباشر لمراجعة إجرائتها وتحويلها لقضايا التأجير.\n§ يتسلم ويراجع كافة المستندات المتعلقة بالحوادث ويتأكد من اكتمالها ويخاطب الفروع والوحدات ذات العلاقة في حال نقصان أية وثائق ويتأكد من أنها مقبولة وأن المتطلبات مكتملة.\n§ ينهي كافة الحوادث المرورية سواء كانت (نجم – مرور – شرطة –دفاع مدني) والتي تحتاج إلى مراجعات لتكملة الأوراق وتعويضات التأمين.\n§ يحلل ويراجع تقارير حوادث التأمين الشامل (مطالبات انتظار اذن الدخول – مطالبات بانتظار تعميد الإصلاح – مطالبات الخسارة الكلية التي لم يتم التعويض عنها).\n§ يوجه المعقبين لإنهاء حالات الحوادث عن طريق طباعة تقارير الحادث سواء عن طريق نجم او المرور أو شرطة أو الدفاع المدني.\n§ يقدم مطالبات الحوادث للتأمين سواء شامل أو طرف ثالث.\n§ يتابع الحوادث والمطالبات بشكل يومي ويعد التقارير الأسبوعية والدورية وحسب الطلب.Skills",
    "Skills": [
        "تقييم الحوادث: القدرة على تحليل الحوادث المختلفة التي تحدث في مكان العمل أو في أي جانب آخر يتعلق بالشركة. يقوم مدير الحوادث بتقييم الأسباب المحتملة للحوادث وتحليل البيانات لتحديد الاتجاهات والأنماط الرئيسية.\nوضع السياسات والإجراءات: تطوير سياسات وإجراءات فعالة للحد من الحوادث والحد من الأضرار الناتجة عنها. يهدف ذلك إلى تعزيز السلامة وتحسين الأداء العام للشركة.\nالتدريب والتوعية: تقديم التدريب والتوعية للموظفين والعاملين بالشركة بشأن ممارسات السلامة وكيفية التعامل مع الحوادث والمخاطر المحتملة.\nالتحقيق: القدرة على إجراء التحقيقات المعمقة للحوادث وتحديد الأسباب الجذرية والتوصل إلى توصيات لمنع تكرارها في المستقبل.\nالتعاون مع الجهات الخارجية: التعاون مع الجهات الحكومية والمنظمات ذات الصلة وشركات التأمين عند الحاجة للتعامل مع الحوادث الكبيرة أو المعقدة.\nإدارة التأمين والمطالبات: إدارة التأمين والمطالبات المتعلقة بالحوادث التي يتم التعامل معها. يتضمن ذلك التنسيق مع شركات التأمين وتقديم المستندات والتقارير اللازمة."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}