{
    "Job ID": "4722889",
    "Description": "JOB PURPOSEResponsible for working on bids and tender compilation and submission. The person will work independently or jointly on major bids and support the company's participation and success in tender or prequalification submissions. The person is required to organize and express complex solutions in a clear, concise, and logical way.KEY RESPONSIBILITIESUnderstand the workings and roles for the compilation of a complex bid or tender opportunity.\nDesign and apply bid and presentation templates, working predominately in PowerPoint to create innovative and visually inspiring professional tenders and panel presentations.\nWork closely and coordinate with internal and external stakeholders, including but not limited to finance, commercial, technical, and operational, to create compelling and compliant tender or pre-qualification submissions.\nMaintain accurate records of all submissions. Track important bid dates and outcomes, and maintain tender statistics for the Major Bids Team and for CCO analysis. Create, administer and coordinate the execution of a complex tender compliance matrix\nInvestigate and gather a detailed understanding of the industries targeted by the Commercial Team.\nWork with external partners, when required, to draw together and capture synergy values and create compelling joint bids depending on Company’s role (prime, sub, or partner).\nSupport Company’s participation and success in the pre-Qualification processes. Proactively gather company evidence and collateral to answer PQQs (Pre-Qualification Questionnaires) in detail.\nConduct detailed research and analysis of the sectors or services for which you will be writing tenders.\nCollate and organize data for bids, like financial records and past-performance statistics.\nCreate and develop case studies, including past-performance references. Update the content library for inclusion in future bid submissions. Support in developing and improving exemplar frameworks.\nApply quality assurance and quality control checks to all bid submissions, ensuring information is accurate, company-branded and compliant in support of Company’s goals and reputation\nSupport the Sales and KAM teams on any aspect of administration and coordination necessary to enable business growth.\nPresent highly technical information in an easy-to-understand, succinct, and creative way.\nSupport the delivery of quarterly major tender training to commercial and operational stakeholders.Skills",
    "Skills": [
        "Graduate degree in engineering, business management, or project management. Proven exposure and understanding of Bids and Tenders of industries such as Waste management, FM and Manpower Supply\nMS PowerPoint and other MS Office Suite software, as well as MS Visio MS Projectsnd MS Power BIwill be an advantage\nEnglish(Fluent)\nUAE Driving license (which will be an advantage)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Waste Disposal & Recycling; Safety & Environment; Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}