{
    "Job ID": "4722531",
    "Description": "Our Amman office is looking for a VIP/Cargo Charter Sales to assist with all aspects of jet charter flights.The ideal candidate will have knowledge of the air charter industry and relevant marketing experience including research marketing opportunities, analyzing specific projects and using e-marketing software / CRM campaigns.Job purpose:To generate and manage a portfolio of clients and actively develop new business through initiative including following up on new leads, client recommendations and networking opportunities.\nTo maximize business opportunities by offering tailored solutions to meet client requirements within budgetary and operational restrictions whilst making suitable profit for the company.\nTo manage all aspects of a flight from initial request to putting offers together and working out schedules, then following up with client and carrying through to booking and flight set.\nTo expose MEGA to a wider audience, enhance the company’s image as a market leader and provide a broad range of support for sales staff in their daily activities.\nTo proactively identify, target and secure business opportunities.\nTo build strong, productive relationships with new clients to ensure business objectives are achieved.Flight QuotingCommunicate effectively with aircraft providers for offers .\nUse established in-house systems and formats to log and generate quotes .\nNegotiate with aircraft providers when necessary to procure best value for clients\nEvaluate suitable commission schedule.\nEnsure timely offer with detailed and accurate information is provided for clients\nFollow up regularly and work towards confirmationFlight BookingEnsure all contracts, insurance and regulatory matters are accurate, legally compliant and that company requirements are met\nVerify supplier contract in detail and ensure all terms comply with MEGA charter agreement\nIssue flight brief with all flight related information\nCommunicate with suppliers at all times to ensure clients’ requirements are met\nUse established in-house systems and formats to log and generate operational documentationClient Relationship ManagementLiaise with clients to identify requirements and source suitable, competitive aircraft charter solutions\nMaintain and develop relationships with key clients to maximize business opportunities and increase client loyalty in an industry where client retention is never guaranteed\nEnsure client is always kept informed of any development linked to specific bookings\nUse established in-house systems to document client relationship management\nBuilding up strong relationships when making cold calls to new clients Business Development\nUse initiative to identify new potential areas for business development\nProvide support for sales activity for new business development\nCold-calling prospect clients to help build on our successful portfolio of existing clients\nMaintain and develop relationships with new business leads to maximize business opportunities and increase client loyalty in an industry where client retention is never guaranteed.InvoicingVerify supplier(s) invoice(s).\nCommunicate with accounts to issue invoice(s) to client(s) and ensure accuracy\nFollow payment schedule and ensure payments are made/receivedSkills",
    "Skills": [
        "Candidates must be fluent in English. Salary is commensurate with the position and experience.",
        "Desired Skills and Experience",
        "previous VIP Sales and / or Business Development work experience of 2-5 years.\nprevious work experience within the Aviation Industry and /or the On-Board-Courier sector\nsound knowledge of the Aviation Industry in particular of the On-Board-Courier market\nverbal and written fluency in English/Arabic\nto be flexible and able to travel on short notice\nstrong interpersonal, influencing and negotiation skills\nself-motivated and able to work with high degree of autonomy\npro-active approach to work and a ‘will to win’"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Aviation Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "3"
    }
}