{
    "Job ID": "4722118",
    "Description": "We are currently seeking a highly skilled and experienced Internal Audit Manager to join our team in Riyadh. As the Internal Audit Manager, you will be responsible for overseeing and managing all internal audit activities within our organization. This role requires a strong understanding of audit principles, risk management, and the ability to lead and develop an audit team.Responsibilities:Define audit priorities and policies each year: You will work closely with senior management to determine the annual audit priorities based on the organization's objectives and risks. Additionally, you will establish and enforce audit policies and procedures to ensure compliance with regulatory requirements and industry best practices.\nDevelop the audit plan and facilitate its completion: Using your expertise in internal audit methodologies, you will develop a comprehensive audit plan that addresses key risks and controls across all business functions. You will lead the execution of the audit plan and ensure timely completion of audit engagements.\nRecommend risk management guidelines and policy definition: As an Internal Audit Manager, you will provide recommendations and guidance on risk management practices and policies. Your expertise will be crucial in identifying potential risks, assessing their impact, and proposing strategies to mitigate them effectively.\nManage fraud investigations across the group: You will be responsible for overseeing and coordinating fraud investigations within the organization. This involves collaborating with relevant departments and functions to ensure thorough investigations are conducted, and appropriate actions are taken to prevent and detect fraud.\nManage and oversee the audit team: You will lead a team of auditors, providing guidance, support, and mentorship. You will ensure the team's productivity and performance by setting clear expectations, conducting regular performance evaluations, and identifying opportunities for professional development.Skills",
    "Skills": [
        "Bachelor's degree in Accounting, Finance, or a related field .\nProven experience as an Internal Audit Manager or a similar role.\nStrong knowledge of internal audit principles, practices, and methodologies.\nExcellent understanding of risk management principles and the ability to develop and implement effective risk mitigation strategies."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}