{
    "Job ID": "4722735",
    "Description": "Responsibilities:Develop and implement operational strategies to enhance the efficiency and effectiveness of the food service department.\nLead a team of dedicated professionals, including chefs, kitchen staff, and service personnel, providing guidance, support, and training as required.\nPlan and coordinate daily food production, ensuring that all meals are prepared in a timely manner, meet quality standards, and comply with dietary requirements.\nManage inventory and ordering processes to maintain optimal stock levels while minimizing waste.\nOversee the development and implementation of menu planning, taking into consideration client preferences, dietary restrictions, and seasonal availability of ingredients.\nEnsure compliance with health and safety regulations, as well as food hygiene standards, across all food service operations.\nBuild and maintain strong relationships with clients, addressing any concerns or requests promptly and professionally.\nMonitor customer feedback and satisfaction levels, implementing corrective actions when necessary.\nConduct regular performance evaluations of staff members, providing feedback and guidance to support their professional growth.\nStay up-to-date with industry trends, emerging technologies, and best practices in food service management.Skills",
    "Skills": [
        "Bachelor's degree in Hospitality Management, Culinary Arts, or a related field (preferred but not required).\nProven experience in foodservice management, including menu planning, culinary operations, and team leadership.\nStrong knowledge of food safety regulations and compliance.\nExcellent organizational and problem-solving skills, with the ability to multitask and prioritize effectively.\nExceptional communication and interpersonal abilities, with a customer-centric approach.\nProficiency in computer systems and software applications related to foodservice operations.\nDemonstrated leadership skills and the ability to inspire and motivate a team."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 4 Max: 8",
        "Residence Location": "All GCC Countries"
    },
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Sales Outsourcing; FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}