{
    "Job ID": "4722141",
    "Description": "نعلن عن شاغر وظيفي مدير مبيعات لمصنع يختص بصناعة السيراميك والبورسلانمقر العمل: الرياضالوصف الوظيفي:تسويق المنتجات وتحليل سلوك المنافسين لزيادة المبيعات.التأكد من تسليم المنتجات المشتراة بطريقة آمنة وصحيحة.الحفاظ على سجلات المبيعات والتسليم، وكذلك تحقيق أهداف المبيعات.We announce a job vacancy as a sales manager for a factory specialized in the manufacture of ceramics and porcelainWork location: RiyadhJob Description:Marketing products and analyzing competitor behavior to increase sales.Ensure that purchased products are delivered in a safe and correct manner.Maintain sales and delivery records as well as achieve sales targets.Skills",
    "Skills": [
        "المهارات المطلوبة:",
        "القدرة على تحفيز وتشجيع الفريق لتطوير الأداء.",
        "القدرة على فهم متطلبات الزبائن وتقديم العروض المناسبة والمتوافقة مع احتياجاتهم",
        "اجادة مهارات التفاوض وتقديم الحلول للمشكلات.",
        "الإلمام بمهارات البيع المختلفة وإعداد الخطط الدورية لتعزيز المبيعات.",
        "القدرة على التواصل بكفاءة وفعالية مع الآخرين.",
        "الشروط:",
        "خبرة لا تقل عن 5 سنوات في مجال صناعة السيراميك والبورسلان.",
        "إجادة اللغة الإنجليزية.",
        "required skills:",
        "The ability to motivate and encourage the team to develop performance.",
        "The ability to understand customers' requirements and provide appropriate offers that are compatible with their needs",
        "Proficiency in negotiation skills and providing solutions to problems.",
        "Familiarity with various selling skills and preparing periodic plans to enhance sales.",
        "The ability to communicate efficiently and effectively with others.",
        "the conditions:",
        "At least 5 years of experience in the ceramic and porcelain industry.",
        "Proficiency in English."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Riyadh, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}