{
    "Job ID": "4722658",
    "Description": "Handle the official company page on social media platforms like Facebook, Instagram, LinkedIn, and Twitter to generate leads and entice the target audience.\nCollaborate with the required professionals to generate up-to-date and captivating content on digital media.\nPlan a comprehensive social media strategy for improving the outreach of the organization.\nAnalyze the impact of different online campaigns on the target customer for in-depth evaluation.\nMonitor SEO and user engagement and suggest content optimization.\nTake the initiative to understand modern trends and social media platforms to aim at a high level of user engagement.\nStudy design briefs and determine requirements\nSchedule projects and define budget constraints\nConceptualize visuals based on requirements\nPrepare rough drafts and present ideas\nDevelop illustrations, logos and other designs using software or by handSkills",
    "Skills": [
        "Proficient in analyzing Key Performance Indicators that define the effectiveness of social media campaigns.\nSkilled in handling content planning, ideation, creation, and delivery for platforms like Facebook, LinkedIn, Instagram, and Twitter.\nPassionate social media handler with a thorough understanding of search engine optimization and key online promotional activities.\nProficient in creating original content as per the requirement of the company and target audience.\nAbility to effectively communicate information and ideas in written and verbal format.\nAdept at understanding market trends, consumer requirements, and company capabilities to plan customer-centric online campaigns.\nProven graphic designing experience\nA strong portfolio of illustrations or other graphics\nFamiliarity with design software and technologies (such as InDesign, Illustrator, Dreamweaver, Photoshop)\nA keen eye for aesthetics and details\nExcellent communication skills\nAbility to work methodically and meet deadlines\nDegree in Design, Fine Arts or related field is a plus"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}