{
    "Job ID": "4723810",
    "Description": "Sales Strategy: Develop and implement effective sales strategies, plans, and tactics to achieve sales targets and revenue growth in the electrical supplies sector.\nTeam Management: Lead, coach, and motivate the sales team, setting clear objectives and providing guidance to ensure high performance and goal attainment.\nClient Relationship Management: Build and maintain strong relationships with key clients, understanding their needs, and ensuring high levels of customer satisfaction.\nBusiness Development: Identify new business opportunities and potential clients to expand the customer base and increase market share.\nSales Forecasting and Reporting: Prepare sales forecasts and periodic sales reports, providing insights into performance, trends, and opportunities.Salary and Benefits:Salary shall be Qr. 7000.00 negotiable.\nCompany car shall be provided.\nYearly leave and leave salary.\nTarget shall be fixed on mutual discussion.\nSales commission shall be fixed on mutual discussion.\nAny other concerns to be discussed.Skills",
    "Skills": [
        "Must be Electrical Graduate.\nMust have Qatar Driving Licence.\nMust have not less than 5 years’ experience in the same field.\nMust have extensive knowledge of the products.\nMust have pleasant personality.\nAge must be less than 30 years.\nVisa must be transferable, if available or visa shall be provided by the company.\nAny nationality meets above criteria shall be considered.",
        "Electrical Graduate",
        "Must have not less than 5 years’ experience in the same field."
    ],
    "Preferred": {
        "Age": "Min: 25 Max: 30"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Electric Power Production & Transmission",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}