{
    "Job ID": "4723019",
    "Description": "Implement and maintain QPM’s HSE program on client project sites; Ensure HSE training, compliance, tracking and control at project sites and collate and analyze HSE reports to provide safe and environmentally responsible project management services to clients.Manage timely and effective compliance to HSE policies on client project site•Coordinate with HSE Director to maintain knowledge of QPM’s HSE policy, procedures, tools and templates to be used on client sites.•Interface with Client and advise on HSE standards and Laws applicable to the state of Qatar.•Coordinate Supervision Consultants and ensure activities are conducted following Contractual obligations, standards and all applicable Laws.•Implement QPM’s HSE policy and program on client projects.•Coordinate with project team members, consultants and contractors to ensure compliance with HSE policies.•Prepare letters detailing HSE shortfalls in Contractor systems and ensure that these are followed through to conclusion.•Conduct regular site inspections to monitor compliance to HSE requirements.•Prepare and submit regular update reports on HSE aspects on site.•Monitor deviations from HSE requirements and coordinate with all parties to correct the same.•Ensure adequate safety equipment on site for QPM staff at all times.•Coordinate with government bodies as may be appropriate•Develop and maintain a Health and Safety Management system in compliance to ISO Contractual and legal requirements•Develop and maintain an Environmental Management system in compliance to ISO Contractual and legal requirements•Prepare and update Project Safety Management plan. •Develop and update Project specific HSE procedures.Coordinate with various project parties to monitor and ensure full HSE compliance•Develop and update project environmental management plan.•Develop and update environmental metrics and environmental checklists for projects. •Establish Environmental baseline assessments for QPM offices / activities. •Establish Safety risk review for projects.  •Conduct meetings with client on HSE aspects at all stages of project to keep updated.•Conduct regular meetings with project team and consultants and contractors to monitor and control HSE compliance.•Review the relevant construction method statements for HSE aspects on Projects such as Safety Hazard Analysis, Environmental Hazard, and Risk Analysis etc. as may be appropriate. Manage HSE team on site and provide awareness and training on HSE to all parties on site•Mobilize project safety team along with Project Director and or Project Manager and Director HSE. (Project Specific)•Establish project KPI’s for HSE team.•Conduct appraisals of team members.•Develop training and skill development opportunities on HSE aspects to team members on an ongoing basis.•Coordinate Safety induction and toolbox meetings. •Coordinate Safety audits and environmental audits on projects.  •Develop project-specific emergency response management plan. •Conduct environmental impact assessments on projects. Skills",
    "Skills": [
        "BSc or equivalent in civil engineering or construction related field. Must be a Certified Safety Practitioner registered, HSE Diploma qualification with an internationally recognized institute. Attended recognized safety related training courses.",
        "15 years of experience in the field of Construction Health, Safety and Environmental Management. Thorough knowledge of international safety standards and procedures. Good written and oral communication skills. Indepth understanding of safety management systems and procedures. Makes appropriate decisions based on knowledge."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building; Fit-Out & Joinery",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}