{
    "Job ID": "4723877",
    "Description": "Job DescriptionJob Summary:The Business Analyst is responsible for developing products by identifying potential initiatives, conducting market research, generating product epics, time-integrated plans for development, and designing product strategies aligned with the client's business goals. You will partner with seasoned teams to plan, drive, and execute key product initiatives that cover multiple features.Job Description:Requirements Gathering: Collaborate with stakeholders, including business users, product owners, and IT teams, to understand and document business requirements for banking systems and processes. Conduct interviews, workshops, and analyses to elicit and prioritize requirements.\nBusiness Process Analysis: Analyze current banking processes and workflows to identify inefficiencies, bottlenecks, and areas for improvement. Propose streamlined processes and system enhancements to optimize operational efficiency.\nData Analysis: Analyze large datasets related to banking operations, customer behavior, risk management, and financial performance. Identify trends, patterns, and insights to support data-driven decision-making.\nSystem Analysis and Design: Assess existing banking systems and applications to identify gaps and propose enhancements or new solutions. Collaborate with IT teams to define functional specifications, conduct feasibility studies, and support system implementation and testing.\nRegulatory Compliance: Stay updated on banking regulations and compliance requirements. Ensure that proposed solutions and system changes align with regulatory guidelines and industry best practices.\nRisk Assessment: Identify and assess risks associated with banking operations, processes, and systems. Collaborate with risk management teams to develop strategies for risk mitigation and compliance.\nUser Acceptance Testing (UAT): Define UAT scenarios and test cases. Collaborate with business users to conduct UAT, ensure system functionality meets business requirements, and validate end-to-end processes.\nDocumentation and Reporting: Prepare comprehensive documentation including business requirements, process flows, functional specifications, and user manuals. Generate reports and presentations to communicate findings, recommendations, and project status to stakeholders.\nStakeholder Management: Build strong relationships with business users, project managers, IT teams, and other stakeholders. Facilitate communication and collaboration to ensure alignment between business needs and IT solutions.\nContinuous Improvement: Monitor system performance, gather user feedback, and identify opportunities for continuous improvement in banking processes, systems, and customer experiences.Project Definition & Design:Participate in exploratory discussions regarding desired business operations performance improvements.\nReview and analyze current IT systems, documentation, and work process requirements to identify system capability gaps.\nDocument current – and future–business/system/data flows.Development & Testing:Work with the development team in an advisory capacity to produce new systems.\nWork with the testing team to develop relevant test scenarios and testing plans.Implementation, Maintenance & Monitoring:Facilitate implementation or roll-out of new functionality (e.g. assist with the design, development, and sometimes delivery of training for end users).\nPlan and develop strategies to convert data from the current system to the new structure, if required.Process Review & Enhancement:Perform continuous reviews of a process or system to align processes with changing business conditions and new products and service offerings.Skills",
    "Skills": [
        "Needed Competencies:",
        "Strategist and tenacious in delivery.\nEntrepreneurial and innovative mindset.\nA well-organized team player.\nQuality-Based Thinking.\nGreat written and verbal communication skills.\nCritical thinking skills.\nTime management.\nNegotiation.",
        "Knowledge, Skills and Abilities:",
        "Ability to work with remote teams.\nAbility to manage tough clients and stakeholders.\nProduct Management Mindset.\nProject Management Skills.\nPlanning and Pricing knowledge.\nAgile Mindset.\nRequirements Analysis.\nFinancial Planning and Strategy.",
        "Preferences:",
        "Professional certifications such as CBAP (Certified Business Analysis Professional) or CCBA (Certification of Capability in Business Analysis)\nKnowledge of project management methodologies and tools is a plus.",
        "Education:",
        "Bachelor of Science, Engineering, technology, business, management information systems, economics\nAgile certification from a reputable methodology provider (Scrum Alliance, SAFe)",
        "Experience:",
        "5+ years of experience as a software Business Analyst\n3+ years in the Banking industry\n3+ years of working knowledge of agile methodology, techniques, and frameworks, such as Scrum or Kanban, to deliver software solutions",
        "Travel:",
        "Dependent on project commitments.",
        "Work Schedule:",
        "As per the office schedule"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}