{
    "Job ID": "4723056",
    "Description": "Responsibilities vary across industries and companies, but the main tasks include testing systems and procedures to ensure they meet technical standards and creating quality and safety documentation. Quality Engineers are responsible for identifying technical issues and getting to the root of the problem, too. They also proactively recommend solutions that’ll improve product durability and overall performance..Set detailed guidelines on what needs to be checked and what the quality standards are\nUpdate our Quality Management System (QMS) with incidents, fixes, and improvements\nAudit our systems based on ISO 9001:2015 requirements.\nDetermine quality metrics for all manufacturing procedures.\nMonitor the entire production cycle and perform regular tests to identify potential malfunctions as early as possible.\nContribute to the development of maintenance budget and ensure compliance\nMonitor inventory of materials and equipment\ninspect product materials and electrical systems for defects and durability\nPrepare reports on malfunctions and corrective actions (e.g. number of defective raw materials per order)Skills",
    "Skills": [
        "Education: Bachelor's Degree in Industrial   Engineering or related ",
        "Experiences: at least 2 years in the same position.",
        "Skills : ",
        "Previous work experience as a Quality Engineer or similar role.\nPrevious work experience as a Quality Engineer or similar role\nKnowledge of health & safety practices and regulations.\nIn-depth understanding of technical documentation\nGood analytical skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}