{
    "Job ID": "4723233",
    "Description": "IT - Project Manager - (Offshore / Remote) Responsibilities:·       Discussing potential projects and their parameters with clients, executives, and software developers.·       Planning out the blueprints for software projects, including defining the scope, allocating resources, setting deadlines, laying out communication strategies, and indicating tests and maintenance.·       Assembling and leading the project team.·       Participating in and supervising each stage of the project.·       Ensuring each project stays on schedule and adheres to the deadlines.·       Creating a project budget and ensuring the project adheres to the budget as closely as possible.·       Determining and overseeing consistent testing, evaluation, and troubleshooting of all products in all stages of completion.·       Tracking milestones, deliverables, and change requests.·       Serving as a liaison to communicate information regarding changes, milestones reached, and other pertinent information.·       Delivering completed software products to clients and performing regular checks on the products' performance.Skills",
    "Skills": [
        "Requirements: ",
        "·       Bachelor's degree in IT domain.",
        "·       Solutions, Systems, Software background and software development.",
        "·       7 - 12 years of experience.",
        "·       Ability to manage multiple projects at a time.",
        "·       Excellent communications skills.",
        "·       Business & IT strategy experience.",
        "·       Customer-focused mindset",
        "·       PMP Certified.",
        "·       Available for immediate hiring is a must."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 12"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$5,000 - $6,000",
        "Number of Vacancies": "1"
    }
}