{
    "Job ID": "4723894",
    "Description": "Teller OperationsExecute branch cash and other teller-related transactions and ensure compliance with the approved policies/ procedures and the applicable regulatory guidelines.\nHand over the cash and balance the same at the end of the day so that the total cash held conforms to the general ledger.\nSubmit teller end of day reports and ensure accuracy and completeness of processing.\nHighlight instances of excess/ short cash noted in accordance with the duly approved policy and procedures.\nResolve teller transaction related customer complaints timely and effectively in order to ensure customer satisfaction at all times.\nDirectly engage in the resolution of common recurring customer problems, referring to other internal stakeholders if deemed necessary, so that customer service levels are continually improved.\nReport to the Head Teller any customer problems along with suggestions related to problems resolution in order to keep them informed on the branch activities and seek assistance for unresolved issues.Policies, Systems, Processes & ProceduresFollow all relevant functional policies, processes, standard operating procedures and instructions so that work is carried out in a controlled and consistent manner.Continuous ImprovementContribute to the identification of opportunities for continuous improvement of systems, processes and practices taking into account ‘international leading practice’, improvement of business processes, cost reduction and productivity improvement.Policies, Systems, Processes & ProceduresRecommend improvements to departmental procedure and direct the implementation of instructions and controls covering a specific area of activity so that all relevant procedural/legislative requirements are fulfilled while delivering a quality, cost-effective service.Statements and ReportsAssist in the preparation of timely and accurate departmental statements and reports to meet CBQ and department requirements, policies and standards.Quality, Health, Safety, & EnvironmentEnsure all relevant quality, health, safety and environmental procedures, instructions and controls are adhered to so that the safety of employees, quality of products/services and environmental compliance can be guaranteed.Related AssignmentsPerform other related duties or assignments as directed.       Skills",
    "Skills": [
        "Competencies",
        "Integrity/Ethics",
        "Interpersonal Skills",
        "Planning",
        "Quality",
        "Risk Management",
        "Education",
        "Diploma in Business or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}