{
    "Job ID": "4723757",
    "Description": "The E-Mobility Solutions Specialist is responsible for providing expertise, guidance, and support to stakeholders, including businesses, governments, and the public, across various sectors.Key Duties & ResponsibilitiesResearch and Analysis: Conduct comprehensive research on current e-mobility trends, EVtechnologies, charging infrastructure, and regulatory frameworks. Analyze market needs, identifypotential opportunities, and evaluate the feasibility of e-mobility solutions in different contexts.• Strategy Development: Collaborate with cross-functional teams to develop innovative strategies andaction plans for the implementation of e-mobility solutions. This includes identifying keystakeholders, defining project goals, and providing guidance on integrating EV technologieseffectively.• Partnership Building: Cultivate and maintain relationships with key industry players, such as vehiclemanufacturers, charging infrastructure providers, and energy companies. Collaborate with externalpartners to develop joint initiatives, pilot projects, and funding opportunities to drive the adoption ofe-mobility solutions.• Project Management: Initiate, oversee, and coordinate projects related to e-mobility. This involvesdefining project scopes and objectives, creating work plans, allocating resources, monitoringprogress, and ensuring timely and quality deliverables.• Technical Expertise: Leverage technical knowledge to support the design and implementation of emobilityprojects. Provide guidance on charging infrastructure requirements, vehicle-to-gridintegration, energy management, and related topics to ensure optimal performance andcompatibility.• Stakeholder Engagement: Engage with businesses, governments, and the public to raise awarenessabout e-mobility benefits and facilitate knowledge-sharing opportunities. Deliver compellingpresentations, workshops, and training sessions to key stakeholders to encourage their activeparticipation in e-mobility initiatives.• Monitoring and Evaluation: Develop metrics and criteria to assess the effectiveness and impact of emobilityprojects. Regularly monitor, evaluate, and report on key performance indicators, providingactionable insights to drive continuous improvement and policy recommendations.Skills",
    "Skills": [
        "Qualifications",
        "Engineering degree, Electrical is preferable",
        "5 Years’ experience",
        "Specific Technical Expertise: E-Mobility",
        "English"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Industrial Engineering & Automation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}