{
    "Job ID": "4723504",
    "Description": "We are hiring for a Business Development MangerLocation - DubaiA Business Development Manager is responsible for identifying and acquiring new clients for a recruitment agency in Dubai, UAE. The ideal candidate should have at least 1-5 years of experience in a similar role and have a strong track record of achieving sales targets. They will be responsible for generating leads, conducting market research, and building relationships with potential clients. The Business Development Manager will work closely with the recruitment team to understand client requirements and ensure a smooth onboarding process.Responsibilities:Generate new leads and identify potential clients through various channels such as networking events, social media, and cold calling.\nConduct market research to identify industry trends, competitor analysis, and potential opportunities for business growth.\nBuild and maintain strong relationships with key stakeholders, including HR managers, hiring managers, and decision-makers within client organizations.\nUnderstand client requirements and provide tailored recruitment solutions to meet their needs.\nPrepare and deliver persuasive presentations and proposals to potential clients.\nNegotiate contracts and terms of agreement with clients.\nCollaborate with the recruitment team to ensure a smooth onboarding process for new clients.\nTrack and analyze sales data to identify areas for improvement and develop strategies to achieve sales targets.\nStay updated with industry trends and market changes to identify new business opportunities.\nAttend industry events, conferences, and exhibitions to promote the recruitment agency and build a network of contacts.Skills",
    "Skills": [
        "Sales and business development\nClient relationship management\nMarket research and analysis\nNegotiation and persuasion\nExcellent communication and interpersonal skills",
        "Preferred Candidate:",
        "1-5 years of experience in business development or sales, preferably in the recruitment industry.\nProven track record of achieving sales targets and acquiring new clients.\nExcellent communication and interpersonal skills.\nStrong negotiation and persuasion skills.\nAbility to build and maintain relationships with key stakeholders.\nSelf-motivated and target-driven.\nAbility to work independently and as part of a team.\nKnowledge of the recruitment industry and understanding of client requirements.\nProficiency in Microsoft Office and CRM software.\nAbility to multitask and prioritize effectively."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Eastern European Countries; All Western European Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}