{
    "Job ID": "4723082",
    "Description": "Excellent construction site management skills\nHave a thorough knowledge and proven ability in construction and erection techniques with emphasis on HV electrical including HV motors, switchgear and transformers, MV electrical equipment and LV electrical and building services including small power and lighting.\nKnowledge of CEN ELEC, IEC, NEC and BS and International electrical Codes. \nKnowledge of KSA electrical standards\nHave a thorough knowledge of the international industry codes and standards related to intrinsically safe systems and electrical\nTeam Player\nStrong communicator written and oral\nStrong and effective coordinator\nOrganized, disciplined, able to perform under pressure and manage multiple priorities and parallel tasks\nStrong Microsoft software skills, particularly Excel\nReport writing skills\nExperience of working in a multicultural project team\nKSA experience\nThe successful execution of all the instrument and electrical scope in accordance with the project schedule, cost and other KPIs.\nResponsibility for the safe execution of the work being supervised.\nThe in-direct management of a team of instrument and electrical sub-contractor’s Construction Foremen and Chargehands as agreed at site. These contracts will cover all aspects of:\nHV equipment installation, cable pulling and terminations, all aspects of MV and LV equipment, junction box, MCC installation, lighting and small power distribution and services installation and the QC testing and pre-commissioning of all these pieces of equipment and systems.\nQC inspection to include pre-commissioningJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}