{
    "Job ID": "4723545",
    "Description": "Full Time EMS Fitness/Personal Trainer (Female only)We are seeking a motivated and experienced Personal Trainer and Sales Associate to join our team (Fitness Journey) in Dubai. The successful candidate will be responsible for providing personalized training programs and EMS to our clients while also promoting and selling our training courses.Responsibilities:Conduct one-on-one training sessions and group fitness classes.\nDesign customized workout plans for clients based on their fitness goals and needs.\nMonitor clients' progress and adjust their workout plans as necessary.\nPromote and sell training courses to new and existing clients.\nReach out to potential clients through various marketing channels and persuade them to enroll in our training courses.\nProvide excellent customer service to ensure customer satisfaction and retention.\nKeep track of sales and maintain accurate records.If you are a self-motivated individual with a passion for fitness and sales and want to join a dynamic team, please apply now. We offer a competitive salary, commission on sales, and ongoing training and development opportunities.Skills",
    "Skills": [
        "Certified Personal Trainer with a minimum of 1 years of experience in commercial gym.\nStrong communication and interpersonal skills.\nSales experience with a proven track record of achieving targets.\nExcellent customer service skills.\nA positive attitude, energetic and passionate about fitness.\nAbility to work independently and as part of a team.\nKnowledge of the latest fitness trends and techniques.\nProficient in using fitness equipment and software."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Gender": "Female",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Sports & Outdoor Activities; Personal Services; Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "2"
    }
}