{
    "Job ID": "4723120",
    "Description": "Handle and ensure organizing, managing and keeping the offices running by providing the necessary support to the office staff and office related vendors. Execute and manage a smooth day to day administrative and clerical operations across Roche offices in KSA.DUTIES & RESPONSIBILITIES :Act as First point of contact and supervise front desk / receptionist coverage within the office facilities during working hours to ensure all different types of queries are dealt with in a timely and effective manner.\nHandle all incoming and outgoing mail to offices.\nHandle both soft and hard filing systems, ensuring consistency and support management team where required in accordance with COREMAP policies.\nEnsure office etiquette and visitor’s policies and guidelines are adherence to and is in compliant.\nManage office tasks such as “but not limited to” filing, generating reports, meetings arrangement, reordering supplies, real-time scheduling support by booking appointments, travel arrangements (such as booking flights, cars rentals, hotels bookings, etc…) are systematic and well organized.\nHandle optimal operations, including office supplies purchasing, equipment, property inventory, building, and disposal with preventive maintenance.\nManage complete stock of all office supplies and accuracy of inventory.\nManage the financial administration of the office including: raising purchase orders, reconciling invoices, monitoring expenditure against budget, follow up outstanding payments, and liaise with the finance team upholding accurate financial record keeping.\nLiaise with third party suppliers / contractors handling office facility management, monitoring performance against Key Performance Indicators (KPIs) and Service Level Agreements (SLAs), including attending monthly suppliers review meetings.\nEnsure all Planned Preventative Maintenance (PPM) schedules are up to date and that any remedial works are undertaken quickly.\nAct as the last point of contact in the emergency chain communication (to contact Facility emergency office when established or Fire/Emergency department) [thread handling / Fire Warden and First aid trainings to be provided in due course].\nHandle overall administrative support and coordinate with total facility management service providers.\nMonitor iREMS events system to ensure completeness of pre and post event documentation as well as follow up with requesters within the organization\nCompiling vendor creation forms to be set up on SAP system.\nCreate and follow up on purchase requisitions for all functions within the affiliate.\nCoordinate due diligence tasks for HCPs and healthcare organizationSkills",
    "Skills": [
        "Written and verbal communication/interpersonal skills.\nHigh level of observation, attention to details, and numerical skills ability.\nProven ability to maintain a high level of accuracy.\nDemonstrable team working abilities and skills.\nFlexible and adaptable under multicultural environment.\nProficiency in Microsoft Office and/or Google Workspace.\nHigh level of time management and problem-solving.\nOrganized with the ability to cop up with quick changes.\nArabic and English Languages proficiency",
        "Educational background and Qualifications :",
        "Bachelor’s or Diploma degree in Business Administration or similar.\n1-2 years of experience in office administration and facility management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Pharmaceutical Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}