{
    "Job ID": "4723209",
    "Description": "JOB SCOPE Perform professional quality spa treatments including facials and / or body massages. Treatments and products recommendations in accordance with client’s needs. Maintain treatment rooms tidy and clean after use.Build up a good and caring relationship with guests. JOB RESPONSIBILITIES ·      To perform professional massage therapy, body treatments, facials, manicures, pedicures and waxing (aesthetic services)·      To perform duties in a safe and professional manner to guests ·      Provide excellent guest service by completing services promptly in the time allotted while maintaining professional and courteous behavior to all guests·      To maintain health and sanitation standards. Clean instruments, materials and work areas whenever possible and after use·      To maintain appointment calendar and schedule appointments·      To maintain a working knowledge of all products and provide guests with current information involving the latest techniques and procedures·      To monitor the stock and inform management of necessary inventory needing replenishment and requisitionTo undertake other jobs assigned by supervisor from time to time Skills",
    "Skills": [
        "JOB REQUIREMENTS",
        "Minimum 1 year experience as a Beauty Massage / Spa therapist\nGood communication in spoken English, Cantonese and Mandarin\nHigh standard of personal hygiene and grooming",
        "·       Friendly personality, welcoming manner, self-motivated and a team player",
        "·       ITEC (International Therapy Examination Council) accredited is an advantage",
        "·       Shift duty is required",
        "Work location : Airport"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Airlines",
        "Company Type": "Unspecified",
        "Job Role": "Beauty and Fashion",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "20"
    }
}