{
    "Job ID": "4723223",
    "Description": "The job duties of a dental assistant generally include the following:Prepare treatment rooms for patient examinations and procedures, including sterilizing instruments and ensuring that all necessary supplies and equipment are available.\nAssist the dentist during dental procedures, including passing instruments, suctioning oral fluids, and providing other support as needed.\nTake and develop dental x-rays as ordered by the dentist.\nPerform basic laboratory procedures, such as preparing dental impressions and pouring and trimming models.\nProvide patient education on proper oral hygiene techniques, including brushing and flossing.\nSchedule patient appointments and maintain patient records.\nManage inventory of dental supplies and equipment, and order as needed.\nPerform basic administrative tasks, such as answering phones and filing paperwork. In addition to these basic duties, dental assistants will also be responsible for managing infection control procedures, maintaining dental equipment, and assisting with dental billing and insurance claims.\nPerform other projects or duties as assigned.Skills",
    "Skills": [
        "Education and Licensure: Minimum of Diploma degree in Dental Assistant program from accredited National/International University or College.",
        "Professional experience: Preferred with at least 1 year experience in same field.",
        "Other Skills:",
        "Demonstrated Clinical Dental Abilities.\nProblem Solving and Organizational Skills.\nVery good oral and written Communication Skills.\nAbility to work effectively as part of a team.\nGood Interpersonal Skills.\nComputer Literate.\nEnglish and Arabic Capability.\nFlexible, Adaptable and Energetic.",
        "Confident, competent, and Personable"
    ],
    "Preferred": {
        "Residence Location": "Jeddah , Saudi Arabia ; Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}