{
    "Job ID": "4723691",
    "Description": "Reviews monthly weekly daily progress, deficiency, progress, productivity reports etc. for Construction and Management\nReviews Contract baseline programmes and updates same in accordance with contract obligations and progress monitoring project procedures.\nPrepares look ahead programmes to cover work planned for the immediate future.\nPrepares detailed programmes for items requiring more details than level IV schedule for better planning of work and follow up of progress.\nAdvises management of future requirements for mobilization of manpower and equipment.\nMonitors site construction progress and recommends means to improve the progress. Prepares progress deficiency reports highlighting activities where improvement is required.\nLiaise with client's planning staff for the finalization and agreement of weekly progress percentages. Negotiates with client's planning staff the final progress figures to be used for the monthly payment application.\nReview and assess existing relevant documentation at the project outset i.e. tender documentation, specifications, contract particulars, and co-ordinate the development and creation of detailed plans, schedules to enable the production of the Construction Schedule to the level of detail deemed appropriate, to allow for the overall coordination and implementation of the project resources.\nLiaise with relevant project management, planning to ensure they are properly briefed on all aspects of the planning stages with responsibilities for implementation and modification of the project monitoring system as defined in company procedures.\nEstablish along with relevant Managers, the resourcing requirements for relevant parts of the project, including staffing, to ensure that these are accurate and realistic that any necessary steps needed to supply resource have been arranged with reference to critical path.\nCo-ordinate in conjunction with relevant staff, the development and establishment of the Construction Schedule together with the mechanisms for monitoring subsequent progress against that schedule. Ensure that corrective action is agreed and implemented at the appropriate level where variation from plans occur.\nLiaise with relevant staff to ensure that the Project Monitoring System is implemented properly and that output on financial performance is reviewed at the appropriate level and frequency to ensure effective control of the project finances.\nMonitor performance of suppliers and subcontractors to determine compliance with contractual obligations. Resolve issues arising from disputes or sub-standard performance.Skills",
    "Skills": [
        "Minimum 15 Years of experience in Oil & Gas Industry.\nMust have experience in construction / building projects.\nAt least 5 years experience in a Managerial role."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}