{
    "Job ID": "4723636",
    "Description": "Job Description:We are currently seeking a dynamic and driven Sales Manager (Saudi national) to join an esteemed digital solutions company in the KSA market. If you have a passion for SAAS/HCM solutions and possess a strong background in enterprise solutions or SAAS with system integration experience.Responsibilities:Identify and pursue new business opportunities within the KSA market, focusing on SAAS/HCM solutions for enterprise clients.Build and maintain strong relationships with key decision-makers and C-Suite individuals to understand their business needs and present tailored digital solutions.Schedule and conduct meetings with potential clients, deliver compelling presentations, and prepare and negotiate proposals to close deals successfully.Collaborate with the technical team to ensure seamless system integration and delivery of solutions that meet client requirements.Drive revenue growth and achieve sales targets through strategic planning and effective execution of sales strategies.Manage and cultivate client accounts, providing exceptional post-sale support and ensuring customer satisfaction.Skills",
    "Skills": [
        "Requirements:",
        "3 to 4 years of experience in selling SAAS/HCM solutions in the KSA market.\nMinimum Bachelor's degree in Business, Marketing, or a related field.\nStrong background in enterprise solutions or SAAS with experience in system integration is a plus.\nExceptional communication skills, both verbal and written, with the ability to confidently engage with C-Suite individuals.\nProven track record of meeting and exceeding sales targets and driving business growth.\nSelf-motivated, results-oriented, and able to thrive in a fast-paced, dynamic environment."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 6"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}