{
    "Job ID": "4723799",
    "Description": "We are hiring a Secretary to provide secretarial, reception, and administration services for our Head of Primary. Your role will be essential in maintaining an organized and efficient school office while supporting the Head of Primary with administrative tasks. If you are detail-oriented and have excellent organizational skills, we invite you to join our team and contribute to the smooth functioning of our educational institution.Responsibilities:Prepare various documents and reports for the school and instructional programs.\nAct as a liaison between the school and the public, addressing inquiries and providing information.\nAssist in scheduling appointments and coordinating meetings.\nSupport overall site/program activities.\nPerform general clerical duties and maintain office orderliness.\nParticipate in staff training and professional development activities.\nUndertake additional duties as needed to support the school community.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in a relevant field.\nProficiency in both written and spoken English and Arabic.\nExcellent communication and interpersonal skills.\nPrevious experience in administrative or secretarial roles is a plus.\nProficiency in using computer applications and office equipment.\nStrong organizational abilities and attention to detail.\nAbility to handle sensitive information with confidentiality.",
        "If you are a proactive and organized individual with a passion for supporting educational environments, we encourage you to apply for the position of Secretary. Join our team and contribute to the success of our school community.",
        "We look forward to welcoming a motivated and efficient School Secretary to our team."
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}