{
    "Job ID": "4723139",
    "Description": "Duties & responsibilities but not limited to:Monitor the level of stock in store/warehouse locations and consumption in each outlet and central kitchen on an ongoing basis.\nGenerate consumption reports to monitor the inventory stock level and compare them with the inventory transfer requisition made by the outlets.\nReview physical inventory adjustments by the store locations and investigate any abnormalities.\nMonitor the weekly inventory closing in the system in relation to the consumption, item movement, and requisitions calculated in the system.\nMonitor the purchasing price of raw materials from the suppliers and report any increase in the prices rather than the contracted/agreed prices.\nOversee closure of PO across the company\nOversee closure of transfer requests across the company\nEnsure goods in transit do not exist at the closing period.\nSet inventory levels for food and beverage products.\nTrack inventory levels of food and beverage products.\nReconcile inventory records to ensure accuracy.\nManage inventory costs.\nReport on inventory levels to management.\nEnsure compliance with food safety regulations.\nDevelop and implement inventory management policies and procedures.\nConduct inventory audits.Skills",
    "Skills": [
        "3-4 years of experience in a similar role.\nShould have good knowledge of Office 365, ERP, Oracle, and Net suite.\nGood communication & Organization skills.\nStakeholder Management & Vendor management.\nProblem solving skills"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}