{
    "Job ID": "4723016",
    "Description": "Update and manage employee master data in system. Ensure the Transfers, promotions and employee contract changes are done Manage attendance and leave data of employees.Process annual vacation arrangements like vacation salary, Travel Ticket etc.Ensure validity of employee resident permits and passports.Oversee all activities related to Payroll, assists in all aspects of employee compensation, preparation, planning, and analysis and monitoring.Responsible for preparing monthly salaries of all types of employees, including overtime payments, leave settlements; insurance dues for Saudi staff, salary deductions, end of service benefits and GOSI required cheques and other payroll related transaction.Responsible for calculating and processing the part time employee’s payments by reviewing the outcomes value as per contract.Monitoring employee performance.Prepare various letters and certificate related to employees.Prepare various HR reports like Head count, turnover, Localization, New hire etc.Ensure employee safety welfare, wellness and health.Answering employee questions and addressing employee concerns with company.Handling of disciplinary investigations, hearings, appeals and grievances.Ongoing review and enhancement of Company HR Policies and Procedures.Ensure the confidentiality of all HR matters across CARE.Receives and responds to inquiries relating to HR operations issues as directed by the Head of department.Meets current objectives and positions the organization for future growth. Completes daily tasks and assignments and processes large volumes of work associated with the operation of the department.Meets and exceeds expectations of internal and external customers. All organizational and departmental standards regarding quality of performance are met. Demonstrates a strong commitment to confidentiality. Participates in quality improvement programs as directed.Follows all facility guidelines outlining standards of attendance and punctuality. Responsible for reporting to and completing work at assigned times.Perform additional tasks and duties as assigned by SuperiorsSkills",
    "Skills": [
        "Ability to conduct interviews in a clear and concise manner.\nStrong analytical thinking and problem solving skills;\nDepicting excellent command over meeting the dynamics of workspace.\nProven work experience as a Senior HR Officer\nBachelor Degree in HR or any related field."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}