{
    "Job ID": "4723509",
    "Description": "We are hiring a Logistic CoordinatorLocation - DubaiSalary - AED 2500 -3000/-We are currently seeking a highly organized and detail-oriented Logistic Coordinator to join our client in industrial manufacturing industry. As a Logistic Coordinator, you will be responsible for coordinating and overseeing all logistical operations within our company. This includes managing the movement of goods, coordinating with suppliers and customers, and ensuring timely delivery of products.Responsibilities:Create and maintain detailed schedules and plans for all logistical operations.\nCoordinate with suppliers and customers to ensure timely delivery of goods.\nMonitor inventory levels and track the movement of products.\nManage and organize all necessary documentation related to logistics, including shipping and customs documentation.\nResolve any issues or delays in logistics operations, and escalate to appropriate parties when necessary.\nCollaborate with internal teams to ensure seamless coordination and communication.\nEnsure compliance with all relevant laws, regulations, and standards related to logistics.\nImplement and improve logistics processes to optimize efficiency and reduce costs.\nPerform data analysis and generate reports on logistics performance.\nStay up-to-date with industry trends and best practices in logistics.Skills",
    "Skills": [
        "Strong organizational and time management skills\nAttention to detail and problem-solving abilities\nExcellent communication and interpersonal skills\nProficiency in logistics software and MS Office applications\nKnowledge of customs regulations and international shipping procedures",
        "Preferred Candidate:",
        "Minimum 1-5 years of experience in logistics coordination or a related field.\nExcellent organizational and time management skills.\nStrong attention to detail and problem-solving abilities.\nAbility to work under pressure and meet tight deadlines.\nExcellent communication and interpersonal skills.\nProficient in using logistics software and MS Office applications.\nKnowledge of customs regulations and international shipping procedures.\nAbility to work well in a team and collaborate with cross-functional teams.\nStrong analytical and data management skills.\nFlexibility and adaptability to changing priorities and requirements."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}