{
    "Job ID": "4723906",
    "Description": "Marketing Manager (Trade Marketing) - JeddahResponsible in the management and development of marketing activities through effective communication, marketing campaigns and promotional events by ensuring to maintain the branding image of the company.Manage the objectives and KPIs laid down by the line manager.\nManage the development and implementation of marketing activities according to the plans laid down by the management\nManage spending budgets and ensure maximum ROI is generated and no over spending is done.\nMonitor competition activities and recommendation of appropriate responses.\nImproving brand presence with developing/updating the fitting POSM and campaign execution across trade through excellence in in-store planning, execution and tracking in alignment with the annual marketing priorities.\nLeading activation programs with partners to improve brand visibility\nVisiting the points of sales regularly to ensure that the brand is visible, and guidelines are respected.\nSupervise/lead the field marketing team across regions while ensuring a proper operation plan including quarterly evaluation and career development path.\nAnalysing the success of marketing campaigns and creating reports.\nPlan a yearly event calendar and ensure the best presence.\nDevelop and execute the new channels marketing plan.\nReport all marketing efforts monthly.\nControl the assigned budget and update quarterly.\nAssist the management on devising a marketing/ business plan on an annual basis.\nWorking closely with agencies and suppliers to ensure business continuity in terms of promotional/ marketing campaigns and general administration.\nWorking closely with the team in fulfilling internal customer requirements.\nCommunicate the campaign & product details to Management, Sales Team, and Operations Teams.\nCommunicate Campaign brief & present proposals for the agency & management for the campaign creative layouts and channels selection and schedule.\nDiscussion on the legal terms & conditions which are required for the campaign promotions & events with the legal Advisor's team.\nWorks safely at all times, observe all quality and housekeeping policies and keeps own work station clean and hygienic\nEnsuring 100% compliance with both the local and international partners for effective results.\nAny other related tasks put by the managementSkills",
    "Skills": [
        "Business Development DNA and commercial minded\nStrong sense of need for achievement of goals and success\nHigh level of motivation, determination and commitment.\nSound ability and knowledge to develop standards of operations and strategic processes\nAbility to work under own initiative in a highly pressured environment\nCapacity to read situation, understand environments and respond accordingly\nCapable of prioritizing between revenue generating actions and time consuming tasks with low yield impact\nMentality of customer service and taking responsibility beyond direct duties\nBachelor's Degree in Marketing or any related filed.\n+5 years of experience within brand management ideally from the Lubricants/Tires/Battyeries.\nGood analytical and numeric skills for fast data crunching\nGood listening skills and the ability to anticipate business needs\nWell-developed interpersonal, adaptive influencing and supervisory management skills\nWillingness to travel and ability to interact professionally with other cultures\nAble to develop relationships with 3rd parties and the hotel teams"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 0",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}