{
    "Job ID": "4723503",
    "Description": "We are hiring for an IT InchargeLocation - DubaiSalary - AED 8000-10000/-We are seeking an experienced IT Incharge to join our client in Industrial Manufacturing industry in Dubai, UAE.The ideal candidate will have a minimum of 5 years of experience in IT management and possess strong technical skills. As an IT Incharge, you will be responsible for overseeing the day-to-day IT operations, managing the IT team, and ensuring the smooth functioning of the company's IT systems. This role requires a proactive and hands-on approach, as well as excellent problem-solving and communication skills.Responsibilities:Manage and oversee the company's IT systems, including hardware, software, networks, and servers.\nEnsure the smooth functioning of all IT operations, including troubleshooting and resolving technical issues.\nLead and manage the IT team, providing guidance, training, and support to ensure the team's success.\nDevelop and implement IT policies and procedures to ensure the security and integrity of the company's data and systems.\nMonitor and evaluate the performance of the IT systems, identifying areas for improvement and implementing solutions.\nManage and coordinate IT projects, ensuring they are completed on time and within budget.\nCollaborate with other departments to understand their IT needs and provide effective solutions.\nStay up-to-date with the latest trends and technologies in the IT industry, making recommendations for improvement.Skills",
    "Skills": [
        "Project management\nNetwork Administration.\nDatabase management\nIT security\nTechnical troubleshooting",
        "Preferred Candidate:",
        "Bachelor's degree in Computer Science, Information Technology, or a related field.\nProven experience in IT management, with a minimum of 5 years of experience.\nStrong technical skills, including knowledge of hardware, software, networks, and servers.\nExcellent problem-solving and troubleshooting skills.\nStrong leadership and management abilities.\nExcellent communication and interpersonal skills, with the ability to effectively communicate technical information to non-technical stakeholders.\nAbility to work under pressure and meet deadlines.\nKnowledge of IT project management methodologies and tools.\nExperience in implementing and managing IT policies and procedures.\nKnowledge of IT security best practices."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}