{
    "Job ID": "4723238",
    "Description": "Reporting to the Director of Construction Services you will beresponsible for planning and managing construction services in terms of project management and SLA.Manage the implementation of the strategic initiatives and objectives, as applicable to the construction Services function, and ensure it is communicated properly to all project engineers.\nResponsible to hand over the anchors and retail units to the tenant’s coordination team within the target time and in line with the approved handover policy.\nCoordinate the completion and clearance of MEP more than 90% of the tests are passed before the physical inspection by the FM team.\nManage a smooth and flawless transfer of the site responsibilities between the technical services department and Property Management operation while ensuring that the quality of the property delivered matches the high standards of associated policy.\nDetermine project responsibilities by identifying project phases and elements; assigning contractors and sub-contractors’ personnel to phases and elements; reviewing bids from contractors.\nPrepare Project documents, contracts, Budgets, and reports as required.\nFollowing up with Government relations regarding Sewer, Water, SCECO, Civil Defense, and Municipality related issues within the target time.\nManages the site on a day-to-day basis that includes monitoring the labor force and subcontractors.\nControls project costs by reviewing expenditures; administering contractor contracts.\nAssist the Director of Construction Services in all related construction issues, and requests.\nTo execute any task related to the construction services assigned by the management.Skills",
    "Skills": [
        "Bachelor’s degree in Civil or Structural Engineering.\nMaster’s degree in Civil or Structural Engineering.\nMinimum of 5 years of experience in Schools Projects.\nExperience in developing and reviewing project quality plans and project specifications.\nProject Management.\nPMP.\nProblem-Solving Skills\nExcellent negotiating Skills\nStrategic Planning\nEffective Communication skills\nBudgetary Control\nRisk Management\nTeamwork\nCustomer focus\nContract Management\nBilingual – English and Arabic"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 12",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Real Estate; Construction & Building",
        "Company Type": "Recruitment Agency",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}