{
    "Job ID": "4723813",
    "Description": "Manage the day-to-day operations of the Finance Department by providing expertise, encouraging teamwork, and aligning work processes in order to achieve high-performance standards, achieve established targets and objectives, and ensure employee engagement in a motivated work environment.\nManage the development of a sound financial plan for the purpose of managing financial and physical capital.\nOversee the updated financial planning and reporting functions, sales budgets, and other financial information in the ERP system.\nReview budgeted sales, validate edited budgets, and ensure that new budgets are continuously updated on the ERP system.\nProvide accurate, comprehensive, and timely information regarding the financial status through practical accounting concepts, principles, procedures, and systems.\nOversee the finance and accounting functions in line with leading practices.\nOversee verification of contract documentation to ensure clarity of payment terms and other financial terms in line with business objectives.\nEnsure that bank reconciliations are done accurately and timely in coordination with the Accounts Supervisors.\nManage payment-related activities: purchasing, staff payroll, and salary-related issues, manage local and foreign accounts and supervise the daily activities of the Bill collectors.\nAdvise top management on the financial implications of new projects in order to protect the corporate interests and minimize financial liabilities and adopt a robust due diligence exercise to ensure that all financial provisions are adhered to.\nLiaise with external auditors to ensure all relevant financial information has been provided.\nProvide input and recommend the continuous improvement of financial practices considering ‘international best practice’, changes in international standards, and changes in the business environment which demand proactive action plans.\nPerform ad-hoc and other duties related to the job as assigned by management.Skills",
    "Skills": [
        "Minimum of 5-7 years of experience preferably in Retail.\nBachelor’s Degree in Finance or a related field.\nA Master’s degree in Finance or Accounting would be an advantage.\nCertified Management Accountant (CMA) certification, Chartered Financial Analyst (CFA), is preferred."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}