{
    "Job ID": "4723007",
    "Description": "Job Summary:The Jira Developer will be responsible for the development, implementation, and maintenance of Jira software for the organization. The developer will work closely with cross-functional teams to design, develop, and maintain Jira workflows, custom fields, screens, dashboards, and plugins that support the organization's business processes and requirements.Key Responsibilities:Develop, customize, and maintain Jira workflows, custom fields, screens, dashboards, and plugins to support the organization's business processes and requirements.\nCollaborate with cross-functional teams to gather requirements and design Jira solutions that meet business needs.\nDevelop and maintain Jira integrations with other systems and tools, such as Confluence, Bitbucket, and Jenkins.\nConfigure and maintain Jira permissions, roles, and security settings.\nProvide technical support and troubleshooting for Jira users and administrators.\nStay up-to-date with Jira software updates, new features, and best practices.\nDevelop and maintain Jira documentation, including user guides, technical documentation, and training materials.\nParticipate in Agile ceremonies, such as sprint planning and retrospectives, and contribute to the continuous improvement of the development process.Skills",
    "Skills": [
        "Jira certification (e.g., Atlassian Certified Jira Administrator, Atlassian Certified Jira Developer).\nExperience with Atlassian tools, such as Confluence, Bitbucket, and Bamboo.\nFamiliarity with DevOps practices and tools, such as Git, Jenkins, and Docker.\nExperience with cloud-based Jira solutions, such as Jira Cloud and Jira Service Management.\nFamiliarity with project management tools, such as Trello and Asana",
        "Requirements:",
        "Bachelor's degree in Computer Science, Information Technology, or a related field.\nAt least 3 years of experience in Jira development and administration.\nStrong knowledge of Jira workflows, custom fields, screens, dashboards, and plugins.\nExcellent programming skills in Java, JavaScript, and Groovy.\nExperience with Jira APIs and integrations with other systems and tools.\nFamiliarity with Agile methodologies, such as Scrum and Kanban.\nStrong analytical and problem-solving skills.\nExcellent communication and collaboration skills.\nAbility to work independently and as part of a team in a fast-paced environment."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}