{
    "Job ID": "4723876",
    "Description": "Job DescriptionOur Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.As Avertra’s Internal Operational Consultant, your mission would be ensuring company wide synergy with the corporate goals and strategy, as well as working towards achieving operational harmony in the operational space. You would be working with the Executive team to create internal project plans around optimising our processes and way of work in the operational division, which includes but is not limited to Operations, Sales, People & Culture, Customer Success, and Delivery. The ideal candidate for this position would be proactive, data driven, passionate about operational excellence, and highly organised.Main Job Responsibilities:Internal Corporate Operational Enhancement:Determine gaps and risks in the areas of: Delivery, Customer Success, Sales, Operations, Executive Management, and People & Culture.\nPropose internal projects plans to amend gaps and inefficiencies.\nKick off internal projects to enhance defined areas of required improvement.\nManage the internal projects by issuing tasks and ensuring timely and effective completion with KPIs.\nPerform “post project closing” activities to ensure proper change management and maintenance.\nTrack logging of related new policies (if any) or changes to existing ones.Risk Identification:Flag and maintain log of risks through analyses using various tools depending on situation.\nConduct monthly analyses to assess potential opportunities for improvement.Corporate Goals:Track corporate and departmental goal completion.\nAssess and flag any risks of non-completion and blockers to completion.Research & Analysis:Maintain knowledge of industry findings and trends that could be implemented internally.\nProduce a monthly report of organisational health with KPIs.\nReport against changes from internal projects and their impact.Internal Automation:Maintain the automation architecture.\nPrioritise applications, features, and modules based on company risk & needs.\nOversee the successful development and delivery of the applications.Sales Reporting:Generating Sales related reports for upcoming projects.\nGenerating reports about priority leads, opportunities, and accounts.\nMaintaining a log of key project updates.System Upkeep:Review and understand existing system and how different modules feed into the operational spaces.\nEnsure and govern correct use of Avertra’s ERP system in the operational capacity.\nEscalate and deal with misuse of Avertra’s ERP system in the operational capacity.\nResearch potential areas of improvement or automation of system interaction.Skills",
    "Skills": [
        "Needed Competencies:",
        "Attention to Detail: Excellent analytical skills, along with the ability to create detailed reports.\nInterpersonal Communication: It is imperative that you are able to connect and develop relationships with various stakeholders in the organisation at various seniority levels, all the way from Chiefs to juniors.\nRisk & Impact Assessment: Ability to assess and manage risks and impact in the process of decision making.\nCreativity: Since this role goes beyond reporting, creativity is key in order to be able to develop the best solutions that are unique to the context at hand.\nData Visualization: Data visualisation is a must have.",
        "Knowledge, Skills and Abilities:",
        "Excellent research skills.\nPast experience in an operational or HR role is highly preferable.\nNative or excellent written and verbal English skills is a hard must.",
        "Preferences:",
        "Experience in the technology or utility industry.\n3+ years of experience in a Consultancy or Research related role.\nPreferably holder of an American or EU passport.",
        "Education:  A bachelor’s degree in Business Administration, Economics, or any relevant degree",
        "A Master’s degree or MBA is a major plus.",
        "Travel:  Upon request by Executives.",
        "Work Schedule:  Local Jordanian office hours with flexibility.",
        "Location:    Jordan.",
        "Benefits",
        "What can we promise you:",
        "You’ll   join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}