{
    "Job ID": "4723667",
    "Description": "A leading Saudi Consulting is hiring a  Human Capital Manager.you will lead a team, and direct the routine functions of the Human Resource activities.\nPartner with the leadership team to understand and execute company HR and Talent strategy.\n Assisting the shared service director in setting the plans and goals for staffing, employee development and rewards system in alignment with company objectives.\nReviewing employees records to ensure compliance with policies and procedures.\nSupporting Managers in creating job descriptions, hiring new employees, and conducting performance evaluations.\nOverseeing benefit programs to ensure that employees are aware of their options and receive the appropriate benefits for their needs.\nManages the talent acquisition process, which may include recruitment, interviewing, and hiring qualified individuals.\nManage the employees’ disciplinary meetings and investigations.\nProviding services to employees such as counselling, coaching and mentoring to help them develop their skills and reach their goals.\nDeveloping and implementing employee training programs that align with  priorities and objectives. Working with Managers to create development plans for their employees who are underperforming. Assessing employee’s needs through performance reviews, satisfaction surveys, and exit interviews. Supporting department heads in handling employees’ complaints or grievances.\nRecommending solutions to issues that arise between employees, including conflicts or potential disciplinary action.\nManaging Files for Current and Terminated Associates.\nDocumenting, retaining and managing files for current and terminated associates.\nEnsuring Record Confidentiality.\nMaintains compliance with KSA Labour Law and regulations and recommends best practices. Maintain knowledge of trends, regulatory changes and new technologies in human resources and talent management.\nDeveloping progress reports and submitting them in a timely manner.\nProvide support and guidance to other team members in the department.Skills",
    "Skills": [
        "Bachelor degree in Human Resources, Business Administration, or related field required.\nWith 4-8 years experience in HR field\nHR Systems Experience.\nExcellent negotiation skills.\nExcellent conflict resolution skills.\nStrong analytical skills.\nAttention to details.\nProblem solving skills.\nAbility to act with integrity, professionalism and confidentiality.\nThorough knowledge of employment related laws and regulations\nEffective interpersonal and communication skills.\nDetail-oriented.\nDemonstrated leadership and organizational skills.\nAbility to prioritize effectively and manage deadlines.\nMicrosoft Office proficiency.\nProficient in English and Arabic verbal and written is highly desirable. \nBased in Riyadh"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 12",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Business Consultancy Services; Management Consulting",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}