{
    "Job ID": "4723932",
    "Description": "Analyze market and market intelligence in order to identify the company unique selling and pricing propositions and differentiators.\nScreen potential business deals and turn them into increased business through cold calling or setting meetings with prospect clients.\nDevelop and sustain strong customer relationships by making periodic visits and calls to explore specific needs and anticipate new opportunities.\nClose new business deals by proposing as per client technical requirements.\nFormulate and implement different tools and activities to promote services and attract new clients.\nCollect and thoroughly document client needs to propose appropriate service.\nPlan and develop winning technical and financial proposals based on client needs.\nMonitor and analyze clients’ preferences and requirements to determine focus of sales efforts and actions needed.\nEnsure client satisfaction through constant follow up regarding their needs and their fulfillment.\nResolve client complaints and objections regarding sales and service to work them into positive conclusions.\nCoordinate with the technical team to complete the technical file and prepare the financial file.\nBuild, develop and maintain relationships with new and potential clients.\nAchieve the set sales target assigned by the BD manager.\nCoordinate with Estimation to define the cost of implementation of all phases and elements (labor, materials, operating expenses, etc.), and any indirect costs anticipated required to complete the tender or proposal.\nArrange for demonstration, presentations, trial installations or samples when required.\nDevelop, present, or respond to proposals for specific customer requirements, including request for proposal responses and construction and contracting solutions.    \nParticipate in BD meetings and projects as required.\nAny other tasks related to the job assigned by the direct manager.Skills",
    "Skills": [
        "Handle problems quickly and efficiently.\nAbility to manage multiple tasks, organize priorities, and meet deadlines.\nCreativity and innovation.\nAbility to handle sensitive/confidential information professionally.\nProblem solving and analytical abilities.\nAttention to details.\nTime management skills.\n· Strong verbal and written communication skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}