{
    "Job ID": "4723214",
    "Description": "Act as a central controller for consumption, and sales functions of the organization.Duties & responsibilities but not limited to below:Develop and implement effective cost-control measures to optimize operational expenses within the company.\nTrack and analyze food and beverage costs, including inventory levels, portion control, and waste management, to minimize expenses and maximize profitability.\nEstablish and maintain budgetary guidelines (related to food and consumption) for each department within the company, ensuring adherence to financial targets.\nMonitor the weekly inventory closing in the system in relation to the consumption, items movement and requisitions calculated in the system.\nReport the issues that increase the cost of goods produced to relevant stakeholders upon identification.\nCompare store/outlet requisitions quantities for semi-finished goods over a certain period with outlet daily sales to identify any red flags.\nAnalyze central kitchen production processes and workflows to identify opportunities for efficiency improvements, waste reduction, and cost savings.\nUnderstand and investigate instances of cost increase above predefined matrices. \nOther tasks as assigned by the Line Manager.Skills",
    "Skills": [
        "3-5 years of experience in a similar role.\nShould have good knowledge of Office 365, ERP, Oracle, and Net suite.\nGood communication & convincing skills.\nStakeholder Management & Organization skills.\nProblem-solving skills & Strong personality."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}