{
    "Job ID": "4723066",
    "Description": "V. MINIMUM REQUIREMENTS AND QUALIFICATIONS Incumbent is expected to have bachelor’s degree or higher. Further Material Management education would be beneficial\nIncumbent is expected to have 15+ years’ work experience in a similar work environment, i.e., material management in Hydrogen/HyCO/ large ASU/electronic gasses/LNG/Coal Gasification/chemical/petrochemical industries project; 5 years working experience with Air products is preferred.\nGood track record as project material management in leading and managing all aspects of Hydrogen/HyCO/ large ASU/electronic gasses/LNG/Coal Gasification/chemical/petrochemical industries project\nIncumbent should have demonstrated skills in strategic thinking, resource planning and development.\nIncumbent is expected to have certain working knowledge of Air Products material management standard, specifications, and procedures, as well as a comprehensive understanding of Air Products safety procedures.\nStrong influencing skills are required to effectively manage site staffs. A proven ability to clearly communicate material issues with partners, as well as strong ability to handle multiple demands and commitments is essential to successfully fulfill this role\nExcellent command of oral and written English/Chinese\nWillingness to travel and be based in remote location in China and Saudi and/or other countries.\nOverseas experience is a must Advantages:Knowledge and experience of industrial gas projects such as Hydrogen/HyCO/ large ASU/electronic gasses/LNG/Coal Gasification/chemical/petrochemical industries project.\nKnowledge and experience on EPC management.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}