{
    "Job ID": "4723203",
    "Description": "F&B Associate / Hostess (Female candidates only)Purpose of the roleTo greet and serve the passengers as well as monitor the lounge condition. Ensure Smooth FoH operations, follow standard service techniques and sequences at all times Upsell where possible lounge facilities, such spa treatments, showers, premium beverages, sleeping facilities, to the passengers Support colleagues in the lounge when it is busy.Duties & Responsibilities:Assist Guests in a friendly manner.\nServe food and beverages to guests in the service areas.\nSet up and clearing of Food & Beverage service areas and stations.\nReplenish food and beverages in the food counters and refrigerators in a timely manner.\nEnsure sufficient stock levels of amenities are available. Ensure proper storage\nServe liquor or beverages to guests in the lounge with high pace to avoid queues,\nPrepare and mix beverages as per product specifications,\nMaintain opening and closing stock of bar and service areas, ensure par stocks are followed,\nCheck all service areas for equipment functionality such as dishwashers, ice machines, draught and soda dispensers, coffee machines,\nPrepare full bar and service mis-en-place.\nEnsure adequate stock for replenishment of cutlery, crockery, and condiments,\nWipe clean all table tops and collect soiled dishes in a time frame designated by Duty manager.\nWipe clean and disinfect all glasses, utensils, equipment, service areas, door panels, wall panels, counters, directory boards and other public surfaces\nCleans floors. including dust mopping, damp mopping, sweeping, vacuuming, dusting, picking up larger objects off the floor\nEnsure the services, hygiene, cleanliness and tidiness of the Lounge achieve total customer satisfaction and meet company standards\nCreate memorable experiences with professionalism and passion by engaging with the guest at every opportunity\nManage and anticipate guest expectations to provide a personalized service\nProvide knowledgeable menu advice offering suggestions and recommendations as per specific regimens, allergens and dietary requirements,\nEnsure timely delivery from order to service where applicable,\nOperate point of sales system,\nEffective and consistent communication,\nComply with licensing laws and other legal requirements and ensure responsible service of alcohol.\nThe days and times of work will be on rota basis over 7 days and decided by the manager\nTo follow cleaning procedures including use of equipment\nHealth & safety in the workplace including Control of Substances Harmful to Health (COSHH)\nAny other requests from the manager in charge within the scope of the positionSkills",
    "Skills": [
        "Qualifications / Essential Skills:",
        "Previous experience within a position in the hotel/hospitality sector\nExcellent interpersonal and presentation skills\nExcellent knowledge of F&B serving techniques\nAble to build and maintain relationships with internal and external guests\nEager to learn, positive and energetic personality\nBe organized and motivated\nAble to remain calm under pressure\nPossess a good command of English and have good communication skills, both written and verbal\nAble to work flexible hours\nPunctuality and regular and reliable attendance.\nHonesty and Integrity",
        "Health & Safety:",
        "  ______________________________________________________________________",
        "·       It is everyone’s responsibility to follow Health & Safety guidelines and report any issues to their manager or Health & Safety Officer.",
        "       Customer Service:",
        "______________________________________________________________________",
        "______________________________________________________________________",
        "·      It is everyone’s responsibility to follow the Plaza philosophy and our three values, Service Excellence, Innovation and Teamwork to ensure that every guest leaves satisfied.",
        "           _______________________________________________________________________________",
        "Your shifts will be agreed with your manager based on your contract of employment. \nYou may be asked to work in another Plaza location at any time without previous defined notice"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 8",
        "Residence Location": "Abu Dhabi, United Arab Emirates ; Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "20"
    }
}