{
    "Job ID": "4723912",
    "Description": "Job DescriptionEmployment Type: Full Time Live - In nurseMinimum Work Experience: 5-10 YearsDuties: - Provide in-home medical assistance to old female patient.- Assess the physical and emotional needs of patient.- Administer medications.- Assist with feedings.- Monitor patient vitals and take blood pressure readings.- Ability to change cathode, ability to give IV injection, knowing how to use NGT machine, giving injections (insulin), knowledge of handling patients with dementia, ability to move patient from bed to chair & vice versa- Assist with other total nursing care duties.- Complete patient care documentation and other paperwork.- Make independent clinical decisions when necessary.Candidates with the following skills may apply.- Applicants should be Female. Filipina lady preferred.- Diploma required /Bachelor degree in nursing preferred.- Previous Nursing experience of at least 5 years. International experience will be preferred.- Be able to work under pressure and stay calm in stressful situations.- Have good communication skills.Perks: Good salary + Accommodation + Food+ Medical Insurance + Leave + Flight Tickets.Salary 10000-120000 AEDSkills",
    "Skills": [
        "• Homecare nurse experience",
        "• DHA License",
        "• Ability 2 change cathoder, ability to giv iv injection, knowing how 2 use ngt machine, giving injections (insulin), knowledge of handling patients w demenshia, ability 2 mov patient from bed 2 chair & vis versa"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "India; Philippines"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}