{
    "Job ID": "4723021",
    "Description": "Develop, execute and manage project plan and delivery to ensure project completion in accordance with time, cost and quality objectives. Coordinate site to ensure smooth functioning of all departments; Ensure compliance with Quality and HSE requirements; Lead the project organizational unit throughout the project duration and be the focal point between client and QPM teamSkills",
    "Skills": [
        "BSc/BEng in Civil or Architecture engineering; Chartered Engineer from recognized professional body is preferable.",
        "Holding PMP certification or similar training certification.",
        "Minimum of 15 years overall postgraduate experience with the last 6 years as a project manager with the following:",
        "Good written and verbal communication",
        "Ability to identify potential problems and be able to successfully and productively resolve problems or propose solutions.",
        "Ability to demonstrate time management skills, and alignments of projects objectives.",
        "Sound knowledge of Works Programme build up, components, critical path review & analysis.",
        "Analytical & numerate skills",
        "Team building, ability to motivate and to work well within large team and show leadership skills.",
        "Experience in Microsoft applications",
        "Very good reporting skills",
        "Having worked in reputable projects during the Construction phase to completion",
        "Ability to elicit cooperation from senior management and other project management's team members."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building; Fit-Out & Joinery",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}