{
    "Job ID": "4723040",
    "Description": "Sales Executive (Shipping/Logistics/Vessel Operation/Marine Services)Identify business opportunities by finding prospective customers by evaluating their potential with respect to company’s services. Follow up on new leads and referrals resulting from field activity\nResponsible for securing new clients, maintaining, and developing existing clients if assigned.\nAchieve set individual revenue or gross profit targets and contribute positively to the overall revenue target of the company.\nIdentify potential clients and generate revenue from a set minimum number of new leads per month.\nCoordinate for accounts receivables with Finance team and follow up with clients for their timely payments.\nRigorous follow–up on quotations and close business, if lost revert with feedback/reasons for discussion.\nEnsure high level of customer satisfaction with all clients through proper follow up and timely response\nMaintain up-to-date products and services knowledge and the latest global trends and technological advancements for the area(s) within the scope of responsibility.·       Plan, develop and implement the daily operations and establish effective measures for the critical and long-term activities within the area(s) of responsibility in line with approved targets, standards and government guidelines.·       Review and evaluate the effectiveness of planned operations and recommend corrective measures for the area(s) within the scope of responsibility.·       Effectively partake in the Development and implementation of KPIs (Key Performance Indicators) that effectively monitor performance against targets within area(s) of responsibility.Partaking in the compilation of the annual budget for the area(s) within the scope of responsibility in support of the business plan, other operational activities, and statutory requirements.\nCreate a positive and supportive work environment that encourages performance excellence, and establishes result-oriented teams with common purpose, goals, and shared-values within the area(s) of responsibility.·       Perform data analysis and prepare timely and accurate departmental reports within the area(s) of responsibility.Ensure that the data, information, documentations and reports for the area(s) within the scope of responsibility are kept updated and archived physically and electronically in line with the approved policy.·       Ensure adherence to government regulations and relevant statutory requirements.Effectively liaise with relevant parties to assure the timely and optimal execution of the planned activities at the area(s) within the scope of responsibility.Skills",
    "Skills": [
        "Bachelor Degree in relevant field, preferably Marketing/ Sales. Master’s Degree is beneficial.\n04-06 years of experience in a similar industry, preferably 02 years in a similar field within the same industry, depending on academic qualification\nSales / Marketing Training certification is beneficial\nPractical knowledge of process mapping\n Strong numerical and analytical skills\nAbility to manage multiple tasks under deadline\nExcellent business communication & presentation skills\nExcellent ability to gather and analyze information\nProficient in Microsoft Office and familiar with Integrated ERP Systems.\n Fluent in English. Arabic is beneficial."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Shipping; Marine Transport Services",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}