{
    "Job ID": "4723155",
    "Description": "Project DirectorSkills",
    "Skills": [
        "Very strong experience with Telecom Operators, dealing with mid and upper level management, matured from in-depth engagement as a supplier, SI, or other advanced Operators\nExceptionally strong communication and presentation skills\nUniversity degree a must,\nSolid technical skills to be combined with a business acumen, and ability to create trustable business cases, making assumptions where data are not available\nAbility to work on short time schedules\nAbility to network also inside Saudi Telecom and with Vendors, and acquire information typically what other leading Operators are doing on advanced topics (LCC worldwide engagements will surely help here)\nSuccessful candidate will be directly reporting to the General Manager of Network Infrastructure Design and lead the consulting activities\nThe candidate will also liaise closely with leading individuals and experts in and take the leadership role in engaging LCC in providing differentiating value add to client.\nBy very nature of the day-day activities, the candidate will be in close touch with leading suppliers, perform in-depth technical discussions, drive the engagements and catalyze the supplier’s value add toward client\nExperience preferably acquired with advanced Western operators\nQualification:\nBE in Electrical/Telecommunications/Electronics or equivalent from a recognized engineering university\n10 – 15+ years of experience in Telecom Network Engineering Design and Planning\nSpecific advanced technical skills & experience in Network Design:\nKey Skills: 5G RAN, O-RAN, Mobile Core, in particular 4G/5G, NSA, Network Slicing, QoS, 5G Use Cases – working with partners, driving new value, End-end future network vision, and high level architecture view, Capex savings measures, Business Cases\nAt least 2 to 4 years experience on LTE Core side and at least 6+ experience on 3G-2G networks, LTE (design, planning).\nExperience with Cisco & Aruba Wi-Fi solution is highly desirable.\nPreferably a member of the Association for Project Management, qualified to be one or more of following PMP /PMI/CAPM/ IAPM / CSM/ MPM/ CPMP or Prince"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}