{
    "Job ID": "4723454",
    "Description": "In the role of Geoscientist, the candidate will be working within the Field Development Department which has overall responsibility for the development and transition of the current, and newly discovered, gas-condensate fields in the Emirates. The successful candidate will help to plan new development and appraisal wells by identifying drill locations from seismic data, maps and correlations. Working with the extended team the candidate will move these wells from the proposal-stage through to operations and also be involved in post-drill evaluation. The role may also require visits to the well site and completing wellsite geology tasks to assist the operations team.• Assist with well planning, drilling operations, and reservoir monitoring activities.• Prepare data and provide inputs for static modelling processes• Plan and conduct reservoir characterisation studies, including wireline log acquisition and core analysis programs.• Analyse and interpret geological and geophysical data, including well logs, seismic surveys, and production data.• Provide well site geologist duties when required• Make well correlations, generate & update all relevant maps for reservoir characterisation, management, and for infield drilling.• Regularly attend meetings including internal project discussions, meetings with third parties, contractors and service providers.• Utilise GIS packages for database management, mapping and analysing data• Presentation of geological material where necessary to Management Manage sample catalogue, including cuttings, core and thin sectionsSkills",
    "Skills": [
        "Education",
        "Bachelor’s degree in Geology, Geosciences or a related field.\n2-5 years of experience in a geoscience role, preferably in the oil and gas industry.\nPractical experience in reservoir characterization, reservoir modeling, prospect generation well planning, drilling operations, coring and logging. A knowledge of seismic acquisition and interpretation of 2D & 3D seismic data.\nBasic understanding of Reservoir Engineering information and Petrophysical evaluation with relevant software applications such as Petrel,\nKingdom, ArcGIS, QGIS etc. Experience with carbonate reservoirs."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5",
        "Gender": "Male",
        "Age": "Max: 48"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}