{
    "Job ID": "4724014",
    "Description": "Evaluates electrical systems, products, components, and applications by designing and conducting research programs and applying knowledge of electricity and materials.\nConfirms systems’ and components’ capabilities by designing testing methods.\nDevelops electrical products by studying customer requirements and researching and testing manufacturing and assembly methods and materials.\nDevelops manufacturing processes by designing and modifying equipment for building and assembling electrical components and by soliciting observations from operators.\nAssures product quality by designing electrical testing methods and testing finished products and system capabilities.\nPrepares product reports by collecting, analyzing, and summarizing information and trends.\nProvides engineering information by answering questions and requests.\nMaintains product and company reputation by complying with federal and state regulations.\nKeeps equipment operational by following manufacturer’s instructions and established procedures and requesting repair service.\nMaintains product database by writing computer programs and entering data.\nCompletes projects by training and guiding technicians.\nMaintains professional and technical knowledge by attending educational workshops, reviewing professional publications, and participating in professional societies.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Preferably with experience in Manufacturing Plant (Pasta Plants or other)\nElectronic testing design\nElectronic production technologies\nElectronic systems\nTechnical management\nManagement proficiency\nElectronics troubleshooting\nBasic safety\nQuality focus\nProcess improvement\nProject management\nDatabase design\nAnalyzing information\nReporting research results\nAttention to detail\nInnovation\nBudgeting",
        "Education, Experience, & Licensing Requirements:",
        "BS in electrical engineering or any equivalent\n3-5 years relevant work experience."
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Luanda, Angola",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}