{
    "Job ID": "4724473",
    "Description": "Personalized Internet Assessor Spain (Basque Language)What does the job involve?In this job you will be reviewing online search results in order to improve their content and quality.\nYou will be required to provide feedback and analysis on content found in search engine results and provide ratings on their relevance to the search terms used.\nAnother aspect of this role will involve reviewing the language used in the search results by examining grammar, tone and cultural relevance.\nThrough this work you will be making a valuable contribution by expressing your opinion on the quality and content of what is currently out there on the web.\nYou will play a part in improving the quality of one of the largest search engines in the world using both your PC and required Smartphone device.Skills",
    "Skills": [
        "Who is suitable for this role?",
        "We are currently seeking dynamic and creative people who have a strong interest in social media, specifically those who are active daily users of their Gmail accounts.\nWe also require suitable candidates to own & use a smartphone Android or iPhone and have a familiarity with other forms of social media and Google products.\nYou should also be flexible, reliable and have the ability to interpret and follow established guidelines.\nYou will have the flexibility and freedom to work from your own home, working your own hours.\nWe are currently seeking people who have a specific smartphone device (Android V4.2 or higher or iPhone running iOS version 14.0 or higher) to complete tasks.",
        "What are the main requirements for the role?",
        "You must have full professional proficiency in both written and verbal English & Basque\nYou must be living in Spain for the last 5 consecutive years\nYou must own and use a Smartphone (Android V4.2 or higher or iPhone running iOS version 14.0 or higher) to complete tasks.\nThe majority of the task types will require both a desktop/laptop and a Smartphone\nGmail must be your primary email account Active daily user of Gmail and other forms of social media.\nYou must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in Spain\nAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expense\nExperience in use of web browsers to navigate and interact with a variety of content"
    ],
    "Preferred": {
        "Residence Location": "Spain",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "San Sebastian, Spain",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}