{
    "Job ID": "4724177",
    "Description": "OVERVIEWResponsible for providing inspired leadership for the business. The role includes making important policy and strategic decisions, as well as the development and implementation of operational policies and procedures. Such procedures ensure the smooth and efficient running of all divisions within the company. It is the responsibility of the Operations Manager to promote a company culture that encourages recognition, morale and performance. Their decisions are key to the delivery of financial efficiency within the organization. They will ensure brand and franchise guidelines/rules are carried out successfully.RESPONSIBILITIES & DUTIESProvide inspired leadership for the organization.\nMake important policy, planning, and strategy decisions.\nDevelop, implement and review operational policies and procedures.\nAssist HR with recruiting the Operation team as necessary.\nHelp promote a company culture that encourages top performance and high morale.\nOversee budgeting, reporting, planning, and auditing.\nWork with senior stakeholders.\nEnsure all legal and regulatory documents are filed and monitor compliance with laws and regulations.\nWork with the board of directors to determine values and mission, and plan for short and long-term goals. \nIdentify and address problems and opportunities for the company.\nBuild alliances and partnerships with other organizations.\nSupport worker communication with the management team.Skills",
    "Skills": [
        "Minimum of 10 years experience in a director or senior executive role in the F&B industry with at least 3 years of experience in a Bakery Business\nExemplary financial and budgeting experience.\nIn-depth knowledge and understanding of current trading standards.\nAcute awareness and interest in the hospitality and ideally leisure education sectors. \nAdept at balancing sound fiscal decisions with brand reputation and customer expectation\nSolid understanding of financial management."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}