{
    "Job ID": "4724474",
    "Description": "Personalized Internet Ads Assessor – Italian Speakers in AlbaniaOur Company TELUS International AI-Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities for people with a passion for languages. The jobs are part-time, and there is no fixed schedule. Whoever you are, wherever you come from, come join our global AI community.Who is suitable for this work? We are looking for dynamic people who have strong communication skills and use the Internet daily.This is a freelance, independent contractor position. You will have the flexibility and freedom to work from your own home, working your own hours.What does the work involve?In this job you will be reviewing online advertisements in order to improve their content, quality and layout. You will be required to provide feedback and analysis on advertisements found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this opportunity will involve reviewing the language used in advertisements by examining grammar, tone and cultural relevance.As a Personalized Internet Ads Assessor your ultimate goal will be to contribute towards making internet search and online advertising more relevant and interesting for all Italian speakers in AlbaniaWhy join the TELUS International AI Community?Earn extra income\nAccess to our community well-being initiative    \nRemote work & Location Independence\nFlexible Hours to work around home life\nBetter Work-Life Balance\nBe a part of an amazing online communitySkills",
    "Skills": [
        "Requirements ",
        "You must be living in Albania for the last 3 consecutive years\nSuitable candidates must have full professional proficiency in English and Italian\nAccess to and use of a broadband internet connection and associated computer and antivirus software to perform the work, all provided at your own expense\nExperience in use of web browsers to navigate and interact with a variety of content\nAccess to and use of an Android (version 4.1 or higher) or IOS Smartphone (version 8 or higher) to complete tasks\nA Barcode Scanner application must be installed on your smartphone to complete certain tasks\nActive daily user of Gmail and other forms of Social Media",
        "Working on this project will require you to go through a standard recruitment process (including passing an open book assessment). This is a part time project and your work will be subject to our standard quality assurance checks during the term of this agreement."
    ],
    "Preferred": {
        "Residence Location": "Albania",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Tirana, Albania",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}