{
    "Job ID": "4724476",
    "Description": "SummaryThe Banquet Manager is responsible for overseeing all aspects of banquet operations within the hotel. This includes planning, organizing, and directing all banquet functions and staff and ensuring high customer service. The Banquet Manager must be able to anticipate the needs of customers, ensure quality services, and successfully manage banquet functions from start to finish. The Banquet Manager must be highly organized and able to manage multiple tasks simultaneously. It is also essential to have strong communication and interpersonal skills and the ability to work effectively with other departments. The successful Banquet Manager will be able to confidently and accurately respond to customer inquiries and complaints while ensuring all guests have a memorable experience. The Banquet Manager must understand food and beverage services, health and safety standards, and current hospitality industry trends. It is also important to be able to effectively manage and motivate staff, troubleshoot issues, and work within budgetary guidelines.DutiesOrganize and oversee banqueting events\nDevelop menus and coordinate catering staff\nHandle bookings and customer inquiries\nPlan seating arrangements\nPrepare event documentation\nEnsure health and safety regulations are met\nTrain and supervise banquet staff\nMonitor event budgets\nConduct quality control\nEnsure excellent customer serviceRequirementsProvide exceptional customer service\nOrganize and coordinate banquet events according to client specifications\nMonitor event progress and supervise staff\nLiaise with caterers, decorators, and other suppliers\nManage event bookings and payments\nDevelop and monitor banquet budgets\nKeep records and generate reportsSkills",
    "Skills": [
        "Skills",
        "Customer service\nPlanning and organizing\nNegotiation\nBudgeting\nIT literacy",
        "Personal Traits",
        "Organized\nPersonable\nExcellent communication skills\nAttention to detail\nProblem-solving abilities"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}