{
    "Job ID": "4724408",
    "Description": "Manage organizational sales by developing a business plan covering sales, revenue and expenses.\nExperience in planning and implementing sales strategies.\nAbility to manage relationships with customers and how they relate to the company's products.\nAbility to manage and direct the work team in more than one regional branch of the company\nMeet planned sales department targets and promote company products\nDevelop individual sales management strategies and objectives with the sales team\nTrack sales targets and report results as necessary\nSupervising the activities and performance of the sales team, and the continuous training of sales representatives\nCoordinating with the Marketing Department in the field of bringing in potential customers\nDevelop the sales force through motivation, counseling, and product knowledge education.\nThe ability to solve problems and develop appropriate solutions.Skills",
    "Skills": [
        "Minimum Bachelor's degree in Business Administration or a related field.\nMust have Transferable Article 18.\nKuwaiti driving license.\nPreferably to have experience in Luxury goods.\nAt least 10 years of experience in sales, including at least 3 years as a sales manager.\nExperience in the field of sales (jewelry and precious watches) is preferred.\nStrong focus on accuracy, detail and order skills.\nExcellent skills (social networking programs - online sales).\nAbility to listen, persuade and negotiate.\nProficiency in English.\nGood working knowledge of administrative procedures - and computer programmers."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Watches & Luxury Goods",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}