{
    "Job ID": "4724456",
    "Description": "Oversee the planning and execution of preventive maintenance programs for HVAC, electrical, plumbing, and other building systems.\nCoordinate with contractors and service providers to schedule repairs, maintenance, and renovations as needed.\nManage facility budgets and expenses, optimizing resource allocation for maintenance and improvement projects.\nMaintain accurate records of maintenance activities, work orders, and equipment performance.\nLead and supervise facility management staff, providing guidance and support to ensure their productivity and professional development.\nCollaborate with other departments and stakeholders to address facility-related issues and ensure seamless operations.\nImplement sustainable and energy-efficient practices to reduce the environmental impact of our facilities.\nKeep up-to-date with industry trends and best practices in facility management to continuously improve our operations.Skills",
    "Skills": [
        "Bachelor's degree in Civil Engineering, Mechanical Engineering, or a related field.\nProven experience in facility management, preferably in a supervisory or management role.\nIn-depth knowledge of building systems, equipment, and maintenance procedures.\nStrong leadership and communication skills to effectively manage a team and collaborate with various stakeholders.\nExcellent problem-solving abilities and attention to detail.\nAbility to prioritize tasks, handle multiple projects, and meet deadlines.\nFamiliarity with relevant laws, regulations, and safety standards in facility management.\nProficiency in computer software and facility management systems.\nA proactive and proactive approach to identifying and resolving facility-related issues."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7",
        "Residence Location": "Kuwait",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}