{
    "Job ID": "4724429",
    "Description": "Job Description & Role:Finishing Materials Engineer shall be a qualified Architect with sufficient experience in the selection of Finishing Materials in large-scale Commercial, Hospitality, Retail, and Residential Projects.Responsibilities:• Procure and submit samples on a timely manner and get the approvals in accordance with the Master Construction Schedule of the Projects.• Communicate with Project Management Teams and Design Consultants• Coordinate the submission of samples for various items with Commercial Team and Design Consultants• Interact with Suppliers and obtain suitable samples• Coordinate the preparation of Mockups as and when required• Obtain alternate materials and propose alternate solutions to Design Consultants• Coordinate the preparation of Mockups and get it inspected by the Design Consultants/ Clients• Obtain material approvals on time, in accordance with Project ScheduleSkills",
    "Skills": [
        "The person should have:",
        "• Good exposure in selecting suitable materials for flooring, ceiling, façade, wall finishes etc.",
        "• Sufficient exposure to the market",
        "• Familiarity with suppliers, sources and logistics involved in the procurement of these items.",
        "• Ability to work with the Design Consultants and propose alternate materials for various areas.",
        "Key Skills:",
        "- Construction Management",
        "- Architectural Drawings",
        "- Architecture",
        "- Procurement",
        "Additional Requirements:",
        "Qualification:",
        "• Should have a Bachelor of Architecture Degree",
        "• Should be familiar with AutoCAD, MS Office and other Architectural Softwares.",
        "• Should have strong interpersonal and communication skills.",
        "• Should be well versed in Microsoft Office and s",
        "• Should be able to prepare accurate reports to the Management.",
        "Experience:",
        "He should have:",
        "• At least ten (10) years of experience in the Construction of Large Commercial / Hospitality/ Retail and Residential / Mixed Use Development projects",
        "• Ability to communicate and present reports in English."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 19",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}