{
    "Job ID": "4724158",
    "Description": "Project Planning: Develop comprehensive project plans, defining project scope, objectives, timelines, and deliverables in collaboration with stakeholders and team members.\nResource Allocation: Identify and allocate resources, including human resources, equipment, and budget, required for the successful execution of IT projects.\nRisk Management: Conduct risk assessments and develop mitigation strategies to address potential project risks and issues proactively.\nProject Execution: Oversee the day-to-day execution of IT projects, ensuring adherence to the project plan and maintaining project documentation.\nStakeholder Communication: Communicate regularly with stakeholders, providing project updates, managing expectations, and addressing concerns or queries.\nTeam Leadership: Lead and motivate cross-functional project teams, fostering a collaborative and high-performing work environment.\nQuality Assurance: Implement quality assurance measures to ensure that project deliverables meet established standards and requirements.\nChange Management: Manage changes to project scope, timeline, or resources and assess their impact on project objectives.Skills",
    "Skills": [
        "Bachelor's degree in Computer Science, Information Technology, or a related field.\nPMP (Project Management Professional) certification.\nMinimum of 5 years of proven experience as an IT Project Manager, leading and delivering complex IT projects.\nIn-depth knowledge of project management methodologies, tools, and best practices.\nStrong understanding of IT systems, technologies, and software development processes.\nExcellent leadership and communication skills, with the ability to inspire and motivate teams.\nEffective problem-solving and decision-making abilities.\nExperience in managing projects through the full project lifecycle.\nProficiency in project management software and tools.\nStrong organizational and time management skills to manage multiple projects simultaneously."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}