{
    "Job ID": "4724622",
    "Description": "About TELUS International AIWe help companies test and improve machine learning models via our global AI Community of 1 million+ annotators and linguists. Our proprietary AI training platform handles all data types (text, images, audio, video, and geo) across 500+ languages and dialects. Our AI Data Solutions vastly enhance AI systems across a range of applications from advanced smart products to better search results, to expanded speech recognition, to more human-like bot interactions and so much more.Thank you for your interest in our Facial Video Data Collection Project!TELUS International is currently looking for participants to complete a simple video recording task.The task can be completed remotely from the comfort of your own home.If you are interested in participating, please complete this registration form below.We will review your registration and get back to you with the next steps regarding selection.SummaryParticipants will be asked to take 11 short videos of themselves, while wearing different props (e.g., sun glasses, face masks, hats) or without any props. Each video will be less than 40 seconds long.Project scheduleThe project is ongoing\nEstimated time to complete the task: 15 to 30 minutes\nPlease note each participant can only complete the task oncePayment rate$20 USD for completing the full task\nThis is an independent contractor opportunity and a one-time task\nPayment will be processed via PayPalSounds interesting? To participate and learn more details, submit your CV now!Skills",
    "Skills": [
        "Requirements",
        "A device with a camera (e.g., phone or tablet)\nStable Internet connection for the duration of the task\nPass an ID verification process"
    ],
    "Preferred": {
        "Residence Location": "Oman"
    },
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "80"
    }
}