{
    "Job ID": "4724760",
    "Description": "Responsibilities Deliver Civil, Structural and Architectural (CSA) engineering services as Site Engineer that meet our customer’s needs and applicable statutory and regulatory specifications, on time and within budget.Initiate, manage and if required supervise CSA engineering project requirements and activities at Site Engineering.\nPerform CSA engineering services such as:\nparticipate in relevant meetings, prepare progress reports and follow required checking procedures;\nensure the project scope is met and that changes comply with project change management processes such as Site Queries, Site Instructions;\nprovide required assistance and advice during procurement, construction and commissioning activities. \nindependently interact with our Home Office (HO) engineering, Contractors, Customer.\nAct as the CSA engineering responsible on Site in collaboration with HO Engineering.\nProactively resolve any discrepancies between us, Contractor and Customer requirements.\nKeep up-to-date with the latest developments and technical innovations in HO CSA engineering.\nCommunicate effectively with the HO CSA engineering Lead Engineer and team and other project stakeholders, including the Customer.\nIdentify issues and problems, develop appropriate solutions, and ask for assistance when required.\nCommitment to and promotion of our company and Project values and ensuring the realisation of health, safety, environmental, quality and ethics, systems, policies and procedures within Project.Skills",
    "Skills": [
        "What you will bring",
        "Technical and Industry Experience  Effective technical and practical engineering skills and ability to consistently deliver quality, accurate and timely work for the Project.\nA sound knowledge of the fundamental requirements of the CSA engineering:\nConcrete and foundation design including floors and slab design\nStructural steel design\nKnowledge on structural / platform steel and safety on equipment and machinery\nBasic knowledge of other engineering fields such as U/G Drainage Piping\nA sound knowledge of applicable local and international standards and statutory and regulatory requirements, such as Eurocodes, PBL, AMA.\nCompetent use of relevant engineering specific software as Navisworks (for viewing), Autocad 2020 (for drawing modifications etc.)\nCompetent use of relevant office software such as MS Office Suite.\nExperience in working in multi-disciplinary projects and engineering teams. \nSelf-initiative approach is a must.\nIdeally eligible to work in Sweden although not essential.\nExperienced in developing and maintaining good relationships with clients and construction contractors.",
        "Education, Qualifications, Accreditation, TrainingA recognised and relevant CSA engineering degree",
        "Preferred:Chartered Professional Engineer (CPEng) status (if applicable).\nRelevant postgraduate qualifications in engineering, management, project management or supervisory qualifications or equivalent.",
        "What the Project will support you with Our Engineering Team support both at HO Engineering and Site Engineering.\nHighly skilled professionals at Site Office in different functions such as Project Engineering, Construction, Procurement, HSE, Contracts.\nOpen and transparent atmosphere within our Site and Project Teams.\nWe support network of different functions."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}