{
    "Job ID": "4724654",
    "Description": "Position: Cost Control EngineerLocation: IraqIndustry: Construction / Real estateDuration: Long TermWorking hours: 8 Hours & 6 DaysBackground: Real Estate ProjectsOverview:As a Cost Control Engineer for our real estate project in Iraq, you will play a crucial role in ensuring the efficient management and control of project costs. You will work closely with the project team, including architects, engineers, and contractors, to monitor expenses, analyze budgets, and implement cost-saving measures. Your expertise in cost estimation, budgeting, and financial analysis will be essential in contributing to the successful execution of the project.Responsibilities:Cost Estimation and Budgeting:Collaborate with the project team to develop accurate cost estimates for different project phases, including pre-construction and construction stages.\nPrepare comprehensive project budgets, considering all relevant factors and contingencies.\nMonitor and update budgets regularly to reflect changes in project scope and specifications.Cost Monitoring and Reporting:Track all project expenses, including materials, labor, equipment, and subcontractor costs.\nCompare actual project costs against the budgeted amounts and identify areas of concern or deviation.\nGenerate timely and accurate cost reports for project stakeholders, highlighting cost performance and variances.Change Management:Evaluate change orders and variations to assess their impact on project costs.\nCollaborate with relevant teams to process change orders efficiently and ensure proper documentation.Cost-saving Initiatives:Suggest and implement cost-saving measures without compromising project quality and safety.\nIdentify opportunities for value engineering and propose alternative solutions to optimize costs.Vendor and Contractor Management:Collaborate with procurement teams to obtain competitive bids from suppliers and subcontractors.\nAssess vendor and contractor performance based on cost, quality, and adherence to schedules.Financial Analysis:Conduct financial analyses to support decision-making processes and provide recommendations to management.\nPrepare forecasts and cost projections for future project phases.Compliance and Audit:Ensure compliance with company policies and procedures related to cost control.\nAssist in internal and external audits, providing necessary documentation and explanations.Skills",
    "Skills": [
        "Bachelor’s degree in civil engineering, Construction Management, or a related field.\nProven experience as a Cost Control Engineer or similar role in real estate or construction projects.\nKnowledge of cost estimation techniques, budgeting, and financial analysis.\nFamiliarity with construction contracts and change order procedures.\nProficiency in relevant cost management software and tools.\nStrong analytical and problem-solving skills."
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Construction & Building; Real Estate",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}