{
    "Job ID": "4724164",
    "Description": "resolving design and development problems\nmanaging budgets and project resources\nscheduling material and equipment purchases and deliveries\nmaking sure the project complies with legal requirements\nassessing the sustainability and environmental impact of projects\nensuring projects run smoothly and structures are completed within budget and on time\nManaging, directing and monitoring progress during each phase of a project\nMaking sure sites meet legal guidelines, and health and safety requirements\nAssessing the environmental impact and risks connected to project\nReviews plan and shop drawings approval prior to installation at site\nEvaluate material submittal specifications in accordance with the project specifications\nInspect completed installations to insure conformance to design\nReview detail of contract agreement for consultants and contractors\nSchedules, assigns, plans and monitor the work of personnel performing a variety of projectsSkills",
    "Skills": [
        "Established track record of working in the Civil and Construction sector as an engineer.\nProficient in using 2D and 3D civil engineering software like AutoCAD, Revit, HEC-HMS, and BIMsight.\nShowing excellent performance in distinct setups to complete ongoing construction projects with high efficiency.\nExcellent report writing skills.\nProject management and supervision skills.\nProfessional technical education in Civil Engineering with expertise in Project Management.\nIt's mandatory to have a UPDA certificate (minimum Grade C).\nCan join immediately."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Qatar",
        "Gender": "Male",
        "Nationality": "Bangladesh; India; Nepal; Philippines; Sri Lanka",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building; Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}