{
    "Job ID": "4724418",
    "Description": "PaliRoots is seeking a Marketing Manager to join our growing team. The Senior Manager will lead and drive global campaigns to generate awareness and demand for our growing apparel and accessory brand. The successful individual will specifically lead the strategy, planning, management, deployment, and promotion of compelling customer-centric content marketing campaigns that drive new customer acquisition, deepen engagement, and motivate customers to act. CREATIVITY IS OUR SUPERPOWER! ⚡ PaliRoots is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.Duties + Roles:Managing a marketing department to complete compelling & successful projects and campaigns by brainstorming details for projects and promotions.\nManage team from other departments to complete task to launch successful campaigns\nConduct weekly entire team with all marketing departments\nContributing to PaliRoots strategic vision by offering creative marketing solutions\nTracking finished campaigns to evaluate and review successes and failures\nOrganizing events as a part of particular campaigns\nCommunicating with a marketing team to implement a budget\nRecruiting, hiring and training staff members within their department\nResearching and analyzing marketing trends to plan campaigns strategically\nBuilding brand awareness through their department's marketing efforts\nCommunicating with other directors to deliver the best possible campaigns\nAttaining updated technical knowledge to make informed decisions\nChanging Website Banners according to the sale or promo.Skills",
    "Skills": [
        "Qualifications:",
        "Preferred college degree in marketing\n3+ years of social media experience\nMust understand Palestinian Culture and Palestinian-American Culture\nMust work with Los Angeles, CA hours (9-5)\nGraphic Design Experience (Photoshop, Procreate, Illustrator, Canva)\nProven experience with social media platforms\nKnowledge of key trends and online influencers\nTeam player who takes initiative\nThe ability to work under pressure and in a fast paced environment\nPositive attitude and enthusiasm for fashion\nAbility to establish and build effective working relationships\nAbility to work independently and with a team\nOrganization and planning skills\nProficiency with marketing-related software\nFinancial skills, including budgeting\nAbility to multitask\nWrite creative copy in english and arabic\nLeadership skills",
        "Bonus Skills:",
        "Ads management\nEmail Marketing\nSocial Media Marketing\nGraphic Design\nVideo Editing"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Fashion & Apparel; Internet & E-commerce; International Humanitarian Organization",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}