{
    "Job ID": "4724391",
    "Description": "Provide administrative support for all request-for-proposal-related procurement activities, including document preparation, query collection, etc.\nDocument vendor relationships as required, including contract negotiations, purchase order creation, order tracking and management, and price dispute resolution.\nScope high-quality goods or services, as requested by the relevant directorate and within a certain budget, to meet the requirements.\nReceive and review bid requests, the scope of work, and the Bill of Quantities (B.O.Q.), ensuring their clarity.\nRecommend bidders list and prepare submission for approval by Tender Committee.\nFollow up on procurement-related actions to ensure prompt completion and ensure necessary Procurement & General Services escalations to prevent delays.\nCoordinate clarifications to end users as needed to ensure that requirements are accurately met.\nAssist in issuing RFQs (Request for Quotes) after obtaining all necessary approvals in accordance with the procurement manual.\nPrepare tender documents (invitation package) and send out invitations after End user and Insurance Department review.\nSchedule pre-bid and on-site meetings and provide bidders with clarifications requested during the bidding stage.\nParticipate in both technical and commercial bid openings.\nExamine the technical evaluation report and ensure that there are no deviations.\nConduct commercial evaluation of proposals and complete techno-commercial evaluation. Examine differences between unit rates and unit costs.\nProvide the Tender Committee with commercial reports.\nPrepare a recommendation for awarding, assisting with any risk assessment.\nPrepare award letters and purchase orders for authorized signature.\nPrepare Contract agreements in collaboration with the end user and collect the required signatures. Ensure that signed contracts are distributed to the appropriate parties.\nAttend and preside over kickoff meetings\nFollow up on documentation pertaining to vendor registration.\nAs a member of the Projects Management Team, participate in all contractual and commercial issues.\nEnsure that all pertinent stakeholder approvals are documented and signed by the appropriate personnel.\nAssist with the organization and maintenance of computerized records containing vendor and bid information.\nEnsure that the database is regularly updated.\nCoordinate and schedule requested meetings and appointments\nReceive and verify requests for variations and claims, participate in meetings to settle such claims, and submit variations for approval by the Tender Committee.\nContribute to the ongoing enhancement of the contracting procedure.\nHard Copy and Soft Copies filling in good manner.Skills",
    "Skills": [
        "Skills",
        "Bachelor's Degree in a relevant discipline.\nMinimum of 3 -5 years of experience in a relevant field.\nComprehensive knowledge of procurement best practice and norms.\nDeep understanding of procurement methods, tools, and techniques."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 7",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}