{
    "Job ID": "4724261",
    "Description": "Manage team of engineers on the site 4-5 ( mechanical engineer , hull, and outfitting engineer , ETO , interior coordinator )\nProvision of monthly build reports to summarize build progress.\nProvision of technical comment on design issues with the site team\nOversight of the plan approval process with Class and Flag.\nLiaise with the shipyard in regard to the delivery demarcation schedule.\nAssist with owner supply budgets and the selection of suitable suppliers.\nAssistance and logistics management of Owner supply items – tenders, toys, diving equipment, uniforms, crockery, cutlery, etc (note full Owner supply procurement services can be supplied subject to a separate contract).\nAppraisal of engineering system drawings.\nLiaise with Classification and Flag Authorities as necessary.\nSupervise all aspects of construction.\nApprove equipment purchases, within the context of the approved maker’s list in the technical specification.\nWork closely with project designers in selection of the luxury interior outfitting companies.\nWork closely with site team to manage all inspection and test during the building progress\nCoordinate with hull Painting specialist will be appointed by owner for hull painting schedule , to achieve best results for hull and superstructure paintingSkills",
    "Skills": [
        "Master’s degree (Captain ) or Naval Architecture or 1st Class Chief Engineer\n7-10 years’ ship building experience in (prefer with Yachts building experience ).",
        "Benefits:",
        "medical insurance, Leave 45 days paid leave and flight ticket to nearest home station of the candidate."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 7 Max: 10",
        "Gender": "Male",
        "Nationality": "European Union; Türkiye",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Izmit, Türkiye",
        "Company Industry": "Maritime & Marine Engineering",
        "Company Type": "Recruitment Agency",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "1"
    }
}