{
    "Job ID": "4724718",
    "Description": "Overview of the roleAs a member of R2R team – to support the Accounts Manager / Finance Manager on delivering:Robust, timely and accurate periodic book closing\nTimely Preparation of GL schedules for Certification & Substantiation\nSupport an Effective / efficient R2R framework covering Close, Certify & Compliance activities.\nEnsure financial records are correct and support external audit.\nTimely preparation and submission of Standard reporting / Management reports\nRegular Trial Balance review and Balance Sheet substantiation.\nProvide FS preparation support.\nExplore and support efficiency improvement initiatives by Identifying opportunities of Standardization & Automation of R2R processesWhat you will doGeneral Ledger Schedules / reconciliations:Prepare GL schedules (reconciliations) monthly.\nEngage with relevant stakeholders to gather information to ensure meaningful reconciliation of GL accounts.\nProvide actionable insights through schedules to pre-empt issues and take timely action to drive resolution of issues.\nReview trends, identify patterns & opportunities to strengthen controls.\nStandardize schedules and follow a quality review process.\nEngage with business unit finance teams to discuss findings from GL schedules.\nFollow IFRS/IAS and AFG policies in the accounting processMonthly / Yearly Book ClosingTo monitor and control closing of books monthly / yearly with other FSSC teams and ensure recognition of robust financials within the group timelines:Post accounting entries based on agreed principles and guidelines.\nReview recurring provision, accruals of expenses and amortization.\nIdentify gaps in provisions and accruals\nValidate amortization and provision entries.\nIdentify and post accounting entries that require reclassification. Post reclassification entries, cost allocations and any other entries required as per standard checklist.\nEnsure timely support in preparation of financials and take ownership for delivery.\nFollow checklists and ensure compliance.\nIdentify gaps in checklist and report new entries/edits to line manager.\nProvide necessary support in weekly stock forecast, posting necessary adjustment entries related to inventory as per agreed guidelines. Post month end stock provision entries based on reports and facilitated comprehensive review.\nSubmit relevant accounting information/data monthly, to facilitate AFG consolidation using the Business Planning and Consolidation (BPC) tool.\nWork for continuous improvement in monthly closing activities to ensure quality financials for business unitsBalance Sheet substantiation / Trial Balance ReviewsCarry out detailed review of key GL accounts in Trial Balance and ensure substantiation of balances appearing against it.Robust Record to Report processEnsure / Support robust R2R process through.Standardizing the accounting process,\nRegular key account reconciliations,\nImproved Fixed Asset management,\nImprove month-end process & related reporting.Monthly Standard Management ReportsTo prepare quality monthly management reports as per agreed templates / formats with comments for review with the Finance Manager / AGM Finance.\nSupport Business Finance Team in preparation of monthly management & Board packs by submitting standard reports on a timely basis.Finance Function / Overseas supportProvide support for overseas entities by reviewing the current processes and sharing best practices and processes in improving the standards.External AuditTo coordinate external Audit of the Divisional entity by providing relevant explanations and schedules to Auditors and ensure smooth completion.\nCoordinate with other teams in FSSC and ensure that auditor’s requirements are being provided in a timely and accurate manner.\nSupport standalone FS preparation of Divisional entities in accordance with the governance form Group Finance / Divisional ControllingSkills",
    "Skills": [
        "Required skills to be successful",
        "Strong Analytical\nProcess oriented\nGood communication\nPresentation skills\nExposure to ERP (Preferably SAP) and SAP BW/ BPC",
        "What equips you for the role",
        "Bachelor’s degree in accountancy/ACCA/CMA (or similar qualification)\nAt least 2-3 years relevant experience within a large organization"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}