{
    "Job ID": "4724081",
    "Description": "Apologies for the misunderstanding. Let's create a job description for the Sales and Customer Support position at Rival:About Rival:Rival Bank is a rapidly growing digital bank based in Lebanon, specializing in microlending and aiming to establish itself as the leading digital banking platform in the country. Our primary focus is on providing innovative financial solutions to the people of Lebanon, with a wide range of services, including stocks, forex trading, cryptocurrency trading, savings accounts, and prepaid and virtual cards. As we pave the way for a new era in banking, we are seeking enthusiastic individuals to join our team and play a pivotal role in driving the success of Rival Bank.Job Description:We are looking for a motivated and customer-centric Sales and Customer Support Representative to join our passionate team at Rival Bank. As a Sales and Customer Support Representative, you will be the face of our bank, interacting with customers and potential clients, addressing their inquiries, providing product information, and ensuring an exceptional customer experience.Skills",
    "Skills": [
        "Requirements:",
        "1. Previous Experience: Proven experience in sales, customer support, or a related field is an addition.",
        "2. Strong Communication: Excellent verbal and written communication skills in English and Arabic to effectively interact with customers.",
        "3. Customer-Centric Attitude: A passion for providing outstanding customer service and the ability to build rapport with customers.",
        "4. Financial Knowledge: Basic understanding of financial products and services will be advantageous.",
        "5. Tech-Savviness: Comfortable using digital tools and platforms, as Rival Bank is a digital-focused institution.",
        "6. Problem-Solving Skills: Quick and effective problem-solving abilities to resolve customer issues efficiently.",
        "7. Team Player: Ability to work collaboratively with colleagues and contribute to a positive work environment.",
        "8. Flexibility: Willingness to work in shifts, including weekends and holidays, as per the bank's operational requirements."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 2"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Banking; Financial Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "2"
    }
}