{
    "Job ID": "4724270",
    "Description": "Company ProfileHeavy Equipment Group (HEG), a reputable division within Mannai Corporation, we are specializing in sales and aftersales service of top-notch heavy equipment catering to the construction and industrial sectors. We offer a diverse product line that includes JCB, Grove cranes, TCM forklifts, Massey Ferguson agricultural tractors, generators, buses, sweepers, trucks, air compressors, transport refrigeration, automatic transmissions, safety valves, and industrial/marine engines.Job ProfileWe are seeking a highly motivated and results-driven individual to join our team as the Deputy General Manager – Heavy Equipment. In this key leadership role, you will be responsible for driving the growth and profitability of our Heavy Equipment Department. Your main focus will be to oversee the complete operation of the Sales Department while providing managerial direction and support to our sales team. Key Responsibilities:·        Lead and manage the Heavy Equipment Department, providing guidance and support to the sales team.·        Set clear objectives and targets for the sales team, monitoring their performance, and identifying areas for improvement.·        Advise and coach the sales team on strategies to improve performance and meet sales goals.·        Manage key accounts and identify opportunities to increase market share and revenue through new contracts.·        Stay informed about industry trends and competitors to understand the local market dynamics.·        Take charge of the Profit & Loss (P&L) of the Sales Department, collaborating with other company departments for effective operations.·        Build strong business relationships with strategic customers and Principals to enhance customer satisfaction and loyalty.Skills",
    "Skills": [
        "·        Minimum of ten years of direct sales team management experience is required.",
        "·        Excellent presentation and verbal communication skills.",
        "·        Bachelor’s degree in Mechanical Engineering or a related field OR equivalent work experience.",
        "·        Knowledge of the local market and industry trends.",
        "·        Strong work ethic and problem-solving skills.",
        "·        Ability to absorb product knowledge and engineering concepts.",
        " ",
        "Join our winning team and embody our core values of leadership, collaboration, customer-centricity, and strong partnerships, as we work together to deliver exceptional solutions and shape the future of the industry."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}