{
    "Job ID": "4724284",
    "Description": "Head of Business Development - RiyadhDevelop annual sales expansion plan and implement it for multi-sector B2B clients (Insurance, Fleet, Car Rentals, Vehicle Conversions, Government sectors, NAJM, Taqdeer, etc) in line with Co. growth & diversification strategy.\nDevelop and enhance sales teams as well as sales channels (Franchise Model, Service Outsourcing for potential clients, etc.) for every geographical location in order to achieve annual sales targets.\nActively participate in the creation and launch of new products & services that address B2B / B2C Customer needs in collaboration with Product Development teams.\nClosely monitor competitor's offerings and establish win-win pricing strategy for services offered meeting aspirations of all internal & external stakeholders.\nManage digital sales channels and support in implementing new initiatives such as Managed Market Place\nLiaise with Planning, Finance & Legal in creating win-win SLAs for all new / renewals of business deals.\nClosely monitor & achieve receivables & balance confirmation targets for all B2B clients.\nProvide market based knowledge and information to Marketing Team to update the promotional materials like company profile, brochures & handouts used to promote our offerings and to build a professional brand image.\nMaintain good relationship with all management hierarchy of current clients and continuously develop pipeline of new high potential B2B clients.\nOrganize engagement sessions with all Key Clients through major events, seminars & trainings.\nMotivate & Mentor Sales Teams and Service Center Teams to deliver the services to all Key Clients as per approved Service Level Agreements.\nCoach salespeople on best practices for closing more B2B deals and provide advice and guidance to improve sales performance\nCoordinate and lead all regular sales meetings with the sales staff\nCommunicate the campaign & product details to Management, ROGM's, and Service Manager & F.O.D - Field operation dept.\nDiscussion on the legal terms & conditions which are required for the campaign promotions & events with the ALJ legal Advisor's team.\nDevelop and manage platform to retain customers and seek out new prospective sales\nExecution of the yearly Marketing and Sales plan activities.\nProvide inputs based on market development to marketing team for for preparing customer education, awareness reading material.\nManaging of the customer experience on all journey type and across the different touch points.\nDeal with Legal Dept. for all the legal terms & conditions to launch a campaign.Skills",
    "Skills": [
        "Sales techniques and general knowledge of the market and competitors.\nExperience under managing end to end funnel into digital customer life cycle.\nHaving GCC automotive market knowledge with having working in the Automotive dealers in Saudi Arabia within Crash & Repair and General Service Business\nGood Understanding of motor insurance business and related transactions.\nAdvanced user of all Microsoft office applications with major fluency in Excel.\nFluent in speaking, writing and listening of the English language.\nBachelor's Degree in Business or any related filed.\nAt least 5 years.\nExperience in insurance sector or dealing with insurance companies\nSales Techniques: the ability to develop sales process and increase revune.\nDigital Analysis: the ability to interpret the results of many digital tools.\nTime Management: Preparing, Submitting & Presenting the projects as per the timeline.\nAchievement/Effort: Job requires establishing and maintaining personally challenging achievement goals and exerting effort toward mastering tasks.\nMathematical and Analytical: Ability to perform basic mathematical and analytical computation.\nProblem Sensitivity: The ability to tell when something is wrong or is likely to go wrong. It does not involve solving the problem, only recognizing there is a problem.\nInductive Reasoning: The ability to combine pieces of information to form."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 0 Max: 0",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}