{
    "Job ID": "4724626",
    "Description": "Establish connections with other government departments to ensure that the socioeconomic impact analysis of tariff/subsidy reform decisions is fully understood and accounted for in long-term reform plans.\nAssist, manage and develop, on an ongoing basis, the review and approval process for the Bulk Supply Tariff (BST), Transmission Use of System (TUoS) charge and Distribution Use of System (DuoS) statements\nAct as the economic affairs lead in all work related to demand forecasting, providing expert input, executing ad hoc orders, and quantitative analysis of customers as needed.\nPrepare high-quality, accurate written reports on all relevant matters.\nProvide advice on broader economic and regulatory issues affecting the sector.\nSupport the price control process including the review of OPEX/ex-ante and ex-post CAPEX; setting of Weighted Average Cost of Capital (WACC); identification and development of new incentives and Regulatory Instructions and Guidance (RIGs); tariff and subsidy development; review and approval of MAR and tariff information (MTI); and setting of ‘cost to serve’ e.g., metering.\nProvide economic input into new capacity tendering, pricing and commercial terms for PWPA’s / PPAs.\nContribute to the establishment of economic and technical principles for asset valuation of mega developments.\nAs requested by the Economic Affairs Directorate, assist / participate in the leadership of economic projects and work streams.\nDevelop excellent working relationships across the company and in other key Departments such as the Department of Finance and the Department of Economic Development.\nPromote and maintain a good image of the company, while conducting business in an ethical and professional manner.Skills",
    "Skills": [
        "Bachelor's Degree in a relevant discipline, e.g., Economics, Economic Policy.\n3-5 years of experience in Economist and/or Regulatory roles in the utility sector.\nAdequate knowledge of energy sector pricing and tariffs, including wholesale pricing, mechanisms for determining transmission and distribution charges for system use, retail tariffs for customers, pricing models for establishing a price control system, data analysis, and the tools used to determine prices.\nComprehensive knowledge of socio-economic analysis and associated tools and techniques.\nExperience in energy sector regulation, including preparation of regulatory submissions, regulatory consultations, and regulatory responses.\nKnowledge of the energy sector globally, regionally and in Abu Dhabi.\nGood understanding of the strategic direction of the Abu Dhabi energy sector, the objectives for the sector, the strategic direction of the Department and requirements of key stakeholders."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Recruitment Agency",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}