{
    "Job ID": "4724775",
    "Description": "Required Skills to be successful:Provide support to manager in various FX (Forex) related transaction for entity by preparing FX exposure, managing FX requirement with Group & banks, provide timely FX settling instruction to payments team & fixation of currency rate in system.\nSupport in preparing the Cash flow as per latest forecast and update key stake holders on Net Debt movements.\nSupport in preparing balance sheet during each forecast cycle and also analyze & provide key updates on variance against actuals & previous forecast.\nSupport finance team in balance sheet substantiation by reviewing all financial accounts and ensure that there are no misstatements under respective Balance sheet FS items.\nShould have minimum 3 year experience in managing the above roles and good communication skills.\nShould be proficient in MS excel & MS PowerPoint and SAP experience is an added advantageAbout the Team:In this role you will be working in a diverse and fast paced environment and reporting directly to the sales manager.What equips you for the role:Bachelor’s Master’s degree in Finance/accounting or equivalent.\nThree to five years of experience in a similar role with a large conglomerate or a large multinational corporation with a focus on cash, liquidity, FX risk management and working capital optimization.Job-Specific/Technical Skills required to complete the tasks: Microsoft Office, proficient in SAP or equivalent is a plus. \nPresent concepts, recommendations, and analyses to senior management in a clear, concise, and actionable manner.\nAble to manage competing priorities in a cross-functional environment\nWork independently with limited supervision. A Self-starter, with a passion to act while focusing on delivering results.\nExcellent analytical and problem-solving skills with attention to detail.\nAble to identify, act and implement ideas that drive continuous improvementJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}