{
    "Job ID": "4724402",
    "Description": "Review of distributions companies water 7 years planning statements/\nReview of water transmission annual performance reports.\nBe up to date with the sector electricity transmission networks operation and performance.\nProvide technical expertise and advice on water capital and operational engineering and process solutions.\nDevelop and maintain systems by which the department can measure comparative engineering and process performance.\nAs part of the Power Regulation Section, oversee the performance and development of the Transmission and Metering codes, as well as other codes and licenses where necessary.\nReview and provide guidance to the development of technical standards, regulations and measures.\nDevelopment of methodologies for assessment of relevant regulatory submissions for compliance purposes.\nManage all electricity transmission related incidents and ensure coordinated follow up is implemented.\nDevelopment of key performance indicators and monitor progress.\nSupport the economics team in the Price Control and Technical Assessor Reviews. As well as the Capex reviews.\nKeep up-to-date with developments in the water transmission and distribution systems and provides appropriate input to the sector overall water network issues.\nContribute to HSE issues arising with the Licensee in conjunction with the HSE Officer or Adviser.\nPerform any other duties that may occasionally be required by the department.Skills",
    "Skills": [
        "Bachelor’s Degree in a relevant discipline e.g Public Policy, Social Policy, or Communication.\nMinimum of 3-5 years of experience in a related field\nComprehensive knowledge of the economics of the energy sector; macro-economic principles, supply-demand balances, elasticities etc.\nDetailed knowledge of energy sector policymaking, including preparation of policy proposals, evaluation and collecting feedback.\nComprehensive knowledge and application of econometrics, socio-economic analysis and associated tools and techniques.\nDeep understanding of the strategic direction of the Abu Dhabi energy sector, the objectives for the sector, the strategic direction of the Department and requirements of key stakeholders.\nThorough understanding of the broader energy sector, including its strategic direction and developments, in the broader region and globally."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 7",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}