{
    "Job ID": "4724099",
    "Description": "Responsible for the recruitment needs of the Manpower Supply Business Units across the UAE with technical, un-skilled, and skilled requirements sourced from Sub-Continent and African countries into the hospitality, Aviation, construction, and Logistics Industries. Ensure the sourcing and recruitment of high-caliber candidates that meet the requirements of the business on time.KEY RESPONSIBILITIESResponsible for the full 360-degree lifecycle of blue-collar labor across Technical, General, Skilled, and Operator categories across the organization \nThe department is the point of contact for all agency liability cases for separation reported through the business, recording, verifying, and recording the outcome.\nManage the full cycle of the recruitment process to meet the various staffing goals across all levels within multiple business units.\nEnsure effective coordination, representation and sourcing of candidates from Overseas countries\nEnsure ethical and professional relationships are built and maintained with Recruitment Partners\nSupport and work with Heads of Departments for the recruitment of skilled and unskilled manpower\nEnsure effective coordination to make sure that documents of candidates are received post-selection\nActing as a point of contact for the recruitment trips and ensuring everything is in place and per the company policy (pre and post recruitment drive)Skills",
    "Skills": [
        "Bachelor’s degree or the equivalent combination of education and experience \n5+ years of relevant recruitment experience\nDemonstrated knowledge of U.A.E Labor Law\nPsychometric Assessment Certification (preferable)\nStrong recruitment and selection expertise\nFluency in English\nExperience and credibility in HR and Talent Acquisition"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}