{
    "Job ID": "4724771",
    "Description": " Position Overview:As an Architect, you will be responsible for designing and planning the creation of buildings, structures, and spaces that meet the functional, aesthetic, and safety requirements of clients and end-users. You will utilize your creative and technical skills to translate ideas into practical designs, considering factors such as building codes, regulations, environmental impact, and user needs. Your expertise will play a vital role in shaping the built environment and contributing to the improvement of communities..1. Design Development:  - Collaborate with clients and stakeholders to understand project objectives, requirements, and budget constraints.  - Create innovative and sustainable architectural designs that align with client visions and functional needs.  - Produce detailed architectural drawings, plans, and 3D models using computer-aided design (CAD) software, Revit is essential and other design tools.  - Consider environmental and energy-efficiency factors in design development, promoting green building practices.2. Project Planning and Coordination:  - Conduct site evaluations to assess the feasibility of projects and analyze environmental impact.  - Coordinate with engineering, construction, and other professionals to integrate various design components seamlessly.  - Develop and maintain project schedules and budgets to ensure timely and cost-effective project delivery.3. Building Codes and Compliance:  - Stay updated with building codes, regulations, and zoning laws, ensuring designs meet legal requirements and safety standards.  - Review and modify designs to comply with local, state, and national building regulations.4. Client Communication and Management:  - Act as the primary point of contact for clients, providing clear communication and updates throughout the project lifecycle.  - Present design proposals and progress reports to clients, incorporating feedback for design refinements.5. Construction Administration:  - Oversee construction activities to ensure adherence to design specifications and quality standards.  - Address any design-related issues or changes that arise during the construction phase.6. Innovation and Continuous Learning:  - Stay informed about architectural trends, materials, and technologies to incorporate cutting-edge elements into designs.  - Participate in professional development activities to enhance skills and knowledge.As an Architect, you will be at the forefront of designing spaces that inspire, enhance functionality, and positively impact the lives of users. Your ability to balance creativity with practicality will be crucial in shaping the built environment and contributing to architectural excellence.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "- Bachelor's or Master's degree in Architecture or a related field.",
        "- Proven experience in architectural design, with a strong portfolio showcasing successful projects.",
        "- Proficiency in computer-aided design (CAD) software, and other relevant design tools.",
        "-Revit is essential. ",
        "- In-depth knowledge of architectural principles, building systems, and construction methods.",
        "- Familiarity with sustainable design practices and green building standards.",
        "- Excellent creativity, problem-solving, and spatial visualization abilities.",
        "- Strong communication and presentation skills to convey complex ideas effectively.",
        "- Attention to detail and ability to manage multiple projects simultaneously.",
        "- Professional licensure or registration as an architect (varies by country/region) is desirable.",
        "design skills and knowledge.\nknowledge of building and construction.\npay attention to detail.\nanalytical thinking skills."
    ],
    "Preferred": {
        "Residence Location": "Lebanon"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}