{
    "Job ID": "4724044",
    "Description": "1) Review the estimates or the works prepared by estimators and QS to ensure accuracy, completeness, and compliance with the scope of work, including those developed by Cost Control Section or project site team.2) Hands-on in the review of all tender documents (SOW, drawings, Specifications, Contract, etc.); and prepare/submit Bid Review Report to Estimation Asst. Manager in order for Tender Committee to make a decision on “Bid or No Bid”.3) Prepare, when the situation requires, the commercial proposal of assigned project which covers detailed cost estimates from taking-off of quantities, RFQs, evaluation and negotiation of suppliers’/subcontractors’ proposals, building up of cost elements, pricing of pay items in Excel spreadsheet or proprietary software-based Estimation program, determine overheads, perform Contract Risk Assessment, request tender guarantee; and technical proposal.4) Represent SHADE in meetings (Job-Explanation Meeting / site visit and pre-contract and post Clarifications Meetings) with clients, consultants, subcontractors, governing agencies and other parties with respect to Estimation-related works.5) Verify/validate the complete compilation of all Estimation-related documents of each assigned project which includes original tender documents, all correspondences (letters/emails/faxes), Job-Explanation MOM, responses to clarifications, RFQs and quotations, commercial proposals, technical proposals, Method Statements, Estimation Section reports, and Estimation Section bid registers.6) Assist (when necessary) in the preparation of, and certifies prior to issuance to the client, of projects’ change orders; and assists the Project Control / Procurement Department in the evaluation of bids / offers of subcontractors and suppliers.7) Assist (when necessary) in the preparation of contractual claims to clients, defense against claims of clients, negotiations, dispute resolution; and in preparation of RFQs/FEED documents for subcontractors.Main Accountabilities :1) Ensure focus on competitive pricing in all aspects of every tender including the selection of correct supplier and subcontractor prices2) Provide overall estimating technical expertise and coordinates activities as group/team leader.3) Accuracy of estimates and secrecy of the assigned tenders, and efficiency of the assigned team.Skills",
    "Skills": [
        "Qualifications :",
        "1) BS in Civil Engineering Experience",
        "2)10 years of experience in construction including 5 - 8 years extensive/progressive experience in the field of quantity surveying and cost estimation.",
        "Skills :",
        "1) Strong analytical skills based on industry standards (of Estimating & QS), detail-oriented and substantive experience in all phases of quantity surveying and estimation; good working knowledge of contract administration.",
        "2) Ability to lead, motivate, develop and direct people as they work, and encourage and build mutual trust, respect and cooperation among team members including Estimation staff in foreign offices or outsourced.",
        "3) Excellent computer skills in the applications of spreadsheets (MS Excel), PlanSwift, Bluebeam or other proprietary-based QS/Estimating software and computer aided management.",
        "4) Good English communication skills - both in written and verbal and preparation of reports"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}