{
    "Job ID": "4724211",
    "Description": "Ensure the implementation of the Project Management function’s objectives, plans, policies & procedures and assure they serve as basis for all the function’s operations.\nMonitor the operating results of the Project Management function, compare them to established goals and objectives, and report results to the Project Manager.\nEnsure compliance of Project Management function’s operations to CEPCO’s policies and regulations in order to avoid any discrepancies or unsatisfactory results.\nLead project’s constructions from start to finish, with the specified specifications, budget, and time.Assist in the preparation of a time plan for project (including dependencies/ critical path) in coordination with the Project Manager & the Project Planning & Control function.• Assist in the preparation of a project budget in coordination with the Project Planning & Control function and coordinate cash flow with the Project Manager.• Liaise with the Resource Management function to confirm resources availability required for the duration of the project.• Prepare execution plan for project and monitor progress regularly.• Manage the process of setting up workplace and clearing obstacles to assure workforce Mobilization to site as per plan.• Supervise all on-site activities by monitoring the work performed; the material incorporated, and resource management including manpower and equipment.• Obtain work / traffic permits, issue C.A.R insurance, and follow-up on issue resolution.• Review of Shop drawing /IFC drawings / Route Map & Key Plan / Schematic and confirm its implementation at site according to the last approved copy.• Executes project as per the plan and provide solutions and recommendations to unexpected technical difficulties/obstacles in his area of expertise as needed.• Coordinate with all involved project stakeholders and resolve issues, including customer, consultants, subcontractors, agencies.• Supervise quality control and safety matters on the site and ensure project team members follow the agreed upon quality and safety procedures in coordination with Quality Auditor and HSSE Officer.• Prepare a written detailed report on daily basis to the Project Manager that details all the day’s activities including important verbal communications, external visits, employment and equipment check and other related fields.• Develop periodical progress report (weekly and monthly basis).Follow up the repair of any breakdown equipment with the Workshop Manager.Skills",
    "Skills": [
        "Bachelor’s degree in Electrical Engineering with a minimum of 6 years of related experience.",
        "• Project Management experience is required (2+ years).",
        "• Project Management Professional (PMP) or equivalent certification is preferred.",
        "• Proficiency with project management software including Primavera, MS Project, etc...",
        "• IT proficiency in particular Auto Cad & Microsoft Office Tools.",
        "• Proficiency in both English and Arabic Languages."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}