{
    "Job ID": "4724199",
    "Description": "To overview & manage all daily financial activities to be carried out within the given Country / Region\nGuiding , Monitoring and Controlling the accounting activities of the different units within the given region\nSupporting and ensuring the instructions issued by Regional Finance controller.\nReview of books/ MIS at least once in month & ensuring proper controls\nFA management & Control viz ensuring assets tagging once in year, up to date FA Register\nEnsure all compliances as per VFS Global Policy documents and guidance notes.\nEnsuring the smooth start up off all the new operations coming in the region like banking, SAP, online FF etc.\nRegular VAC visits and surprise audits so far as all the finance related activities are concerned.\nProper reconciliation reporting for AR/ AP / Salary and banks and intercompany\nMaintaining the Bank accounts and reconciliations & Paying off the taxes on time, VAT, Income tax TDS.\nSalary processing & Processing of perk payments as per company Policy\nBudgeting and MIS as per Regional requirement and support Regional finance controller with accurate numbers.\nTimely booking of expenses and income in the books. And issuing invoices to FMC\nManaging relationship with Facility management company, Bank, and other stakeholder for the data requirements Skills",
    "Skills": [
        "Proficient in English.\nHas work experience (3-4) Years.\nCommunication & Interpersonal Effectiveness.\nSkilled in using Finance software and Microsoft Office.\nProficient with Finance software and experienced in using Microsoft Office applications.\nProficiency in using Finance -related software and tools, including Microsoft Office suite."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}