{
    "Job ID": "4724533",
    "Description": "Role Objective:Detailed Roles and Responsibilities: OPERATIONAL Review technical drawings, specifications of electrical systems, and topographical maps to ensure that installation and operations conform to standards and QNCC’s requirements.\nOperate computer-assisted engineering and design software and equipment to perform engineering tasks.\nConfer with engineers and others to discuss existing or potential engineering projects and products.\nDirect and coordinate manufacturing, construction, installation, maintenance, support, documentation, and testing activities to ensure compliance with specifications, codes, and QNCC’s requirements.\nDecide on the type and arrangement of circuits, transformers, circuit-breakers, transmission lines and equipment, based on calculations.\nReview specifications, drawings and regulations for the use of electric power equipment.\nMake or improve products such as electric motors, parts, equipment and appliances.\nReview calculations done by the Electrical Engineers to compute and establish manufacturing, construction, and installation standards and specifications.\nEvaluate existing field installations and recommend design modifications to eliminate electrical or system malfunctions.\nDevelop solutions to problems that may arise to ensure non-recurrence and treatment.\nIdentify gaps in the electrical engineering plans and designs agreed and address the concerns for the related authorities to review and discuss.\nWork out delivery and installation schedules for machines, switchgear, cables and fittings.\nEnsure that completed works meet specifications and safety standards.\nEnsure that electrical activities are properly monitored and all quality records are established and maintained. \nReview specifications for purchase of materials and equipment.\nClosely monitor site inspectors/engineers’ performance.\nAnalyze information related to electrical works and prepare engineering reports on that regard to the management.\nEnsure high standards of confidentiality to safeguard commercially sensitive information.PEOPLE MANAGEMENT Allocate work to employees in the team, nominate for training as per QNCC’s guidelines in accordance with Electrical Engineer and HR Department, conduct performance reviews and manage leave and overtime of staff to ensure efficiency.\nSupervise employees in their day-to-day tasks and guide them in managing their performance by providing appropriate feedback and counseling. \nReport employee leaves and regular vacation to the Electrical Engineer.Skills",
    "Skills": [
        "Educational Qualifications: ",
        "Bachelor degree in Electrical Engineering, from a recognized university.",
        "Experience: ",
        "About 2-4 years of related experience of which a minimum of 1 year should be in a similar position/ responsibility, preferably in a similar Industry.",
        "Behavioral Competencies:",
        "Analytical Ability \nBusiness Acumen \nCommunication\nCreativity & Innovation\nCustomer Orientation  \nPersonal Motivation/ Productivity\nPlanning & Organizing\nProcess Excellence\nTeam Management\nTime Management",
        "Technical Competencies: ",
        "Customer Service (internal customers)\nNegotiation & Influencing\nPerformance Management\nQuality Management\nCrisis Resolution"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dukhan, Qatar",
        "Company Industry": "Hardware & Building Materials",
        "Company Type": "Unspecified",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}