{
    "Job ID": "4724623",
    "Description": "Evaluate new license applicants’ financial models/forms for Independent Power and Water Producers (IWPPs), Independent Wastewater Treatment Plants (ISTPs), and District Cooling Service Providers to ensure that tariffs are consistent with regulations and bid documents.\nFrom a financial and economic perspective, a review of the feasibility studies for the cooling options proposed by real estate developers.\nSet the criteria and conditions to enhance the competitiveness of any competitive bidding for DC services and IWPPs and evaluate tenders to ensure competitiveness in DC and IWPP markets.\nAssess the financial health of new license applicants by providing financial analysis and recommendations to internal licensing and compliance team to be used as part of the comprehensive evaluation process to approve the issue of the license to the applicant and seek required information, reports and guarantees.\nEstablish or approve suitable regulatory guidelines for the new license applicants in relation to the financial information and models.\nReview and approve the periodic financial reports submitted by the licensed companies operating in the sector identifying errors / discrepancies, if any and recommending any improvements.\nPrepare and submit to management annual financial performance review reports for price-controlled companies, independent power, and water producers (IWPPs), and independent wastewater treatment plants (ISTPs).\nEstablish or approve suitable regulatory guidelines for the licensed companies in relation to audited financial statements.\nManage preparation of reports for company’s leadership providing overview of the financial performance, financial risks and investment proposals of the licensed entities in the energy sector.\n Provide the necessary support for the implementation of any other financial and investment activities requested by the company in accordance with the Director of the Financial Department of the sector’s instructions.Skills",
    "Skills": [
        "Skills",
        "Bachelor's degree in Finance, Accounting, business Administration &/Economics\nAt least 3-5 years of related experience.\nDeep understanding of the financial activities of the licensed companies within the energy sector.\nDeep understanding of the energy sector, in Abu Dhabi and the UAE\nExtensive knowledge and experience in financial management, investment analysis and due diligence.\nComprehensive knowledge of best practice financial reporting, budgeting, and auditing."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}