{
    "Job ID": "4724228",
    "Description": "Position Title:              GeoscientistEmployment Type:      Full-time (1 year contract – renewable)Salary:                         Depending on experience and qualificationsJob Location:              UAEAbout the Client:A leading oil and gas company in UAEJob Description:Assist with well planning, drilling operations, and reservoir monitoring activities\nPrepare data and provide inputs for static modelling processes\nPlan and conduct reservoir characterisation studies, including wireline log acquisition and core analysis programs.\nAnalyse and interpret geological and geophysical data, including well logs, seismic surveys, and production data.\nProvide well site geologist duties when required\nMake well correlations, generate & update all relevant maps for reservoir characterisation, management, and for infield drilling.\nRegularly attend meetings including internal project discussions, meetings with third parties, contractors, and service providers.\nUtilise GIS packages for database management, mapping, and analysing data\nPresentation of geological material where necessary to Management\nManage sample catalogue, including cuttings, core, and thin sectionsSkills",
    "Skills": [
        "Qualifications:",
        "Male; 35 y/o and below\nBachelor's degree in Geology, Geosciences, or a related field\nMinimum 2 years of experience in a geoscience role, preferably in the oil and gas industry\nPractical experience in reservoir characterization, reservoir modeling, prospect generation well planning, drilling operations, coring, and logging\nA knowledge of seismic acquisition and interpretation of 2D & 3D seismic data\nBasic understanding of Reservoir Engineering information and Petrophysical evaluation\nExperienced with relevant software applications such as Petrel, Kingdom, ArcGIS, QGIS etc.\nExperience with carbonate reservoirs is preferred"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}