{
    "Job ID": "4724043",
    "Description": "المسمى الوظيفي: مشرف معمل\n\nنوع الوظيفة: دوام كامل (عقد لمدة سنة)\n\nالمسؤوليات:\n·        المشاركة فى تنفيذ رؤية ورسالة وأهداف الكلية.\n·        تنفيذ ومتابعة اكتساب الطلاب للمهارات العملية والسريرية للمقررات داخل المعامل.\n·        المشاركة فى تطوير برامج الكلية وإجراءات العمل فيها.\n·        المشاركة فى أعمال اللجان وأنشطة الكلية.\n·        حفظ النظام داخل المعامل.\n·        القيام بأعمال الجودة المطلوبة وإعداد التقارير اللازمة للتاكد من اتقان الطلاب المهارات العملية المطلوبة.\n·        القيام بكل مايوكل إليه فى الأعمال الإدارية أو الأكاديمية الأخرى بجانب العبء التدريسي المقرر.\n·        إذكاء روح التنافس البناء بين الطلاب وتشجيع الابتكار والإبداع بما يحقق التميز للكلية وطلابها.\n·        أن ينقل لطلابه أحدث ما يستجد فى مجال تخصصه.\n·        المحافظة على سمعة الكلية وممتلكاتها وحفظ النظام وسلامة الطلاب.\n·        التفرغ للعمل بالكلية.\n·        الالتزام بكافة الأنظمة والقوانين واللوائح والتعليميات النافذة فى المملكة العربية السعودية وعدم المساس بالدين أو التدخل فى السياسة.\n·        ملازمة الطلاب ومتابعتهم طوال ساعات التدريب اليومية، والمعتمدة حسب الخطة الدراسية والجدول الدراسي.\n·        التحقق من تطبيق المهارات العلمية والسريرية حسب مفردات المقرر بالخطة الدراسية.\n·        رفع تقارير أسبوعية إلى محاضر المقرر لاعتمادها وتزويد وحدة الجودة بالكلية بنسخة منها.\n·        حضور اجتماعات التهيئة والاجتماعات الدورية مع الطلاب بالتنسيق مع محاضر المقرر ورئيس القسم ومشرف وحدة التدريب بالكلية.\n·        رفع التقارير إلى رئيس القسم، واعتمادها وتزويد وحدة التدريب بالكلية بنسخة منها.\n·        المشاركة في تنفيذ ورش العمل بالقسم الأكاديمي (يلزم موافقة رئيس القسم).\n·        التحقق من اتقان الطلاب لتطبيق المهارات الإكلينيكية حسب خطة التدريب المعتمدة.Skills",
    "Skills": [
        "المؤهلات العلمية المطلوبة: درجة بكالوريوس العلوم في تخصص (الكيمياء/ الفيزياء/ الأحياء).\n\nالخبرة المطلوبة: يفضل من لديه خبرة أكاديمية في مجال التخصص."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}