{
    "Job ID": "4724403",
    "Description": "At VFS Global, we thrive when our people thrive. We’re currently looking for an executive assistant to be a supportive force who empowers our senior leadership. The ideal candidate will be a proactive problem solver with exceptional communication skills and meticulous attention for details. This person should have experience working in an office environment, performing administrative duties, and providing support to managers. Given the dynamic nature of the executive landscape, we rely on executive assistants to be flexible and consistent while maintaining the confidentiality of high-level systems and operations.Objectives of this roleSupport the Senior Member primarily and provide additional support to executive team members, as directed, to ensure that company goals and objectives are accomplished and that operations run efficiently\nMaintain and refine internal processes that support high-ranking executives companywide, and coordinate internal and external resources to expedite workflows\nManage communication with employees by liaising with internal and external executives on various projects and tasks\nPlan and orchestrate work to ensure that senior executives’ priorities are met, organizational goals are achieved, and best practices are upheldResponsibilitiesManage professional and personal scheduling for the senior member, including agendas, mail, email, phone calls, client management, and other company logistics\nCoordinate complex scheduling and calendar management, as well as content and flow of information to senior executives\nManage senior executives’ travel logistics and activities, including accommodations, transportation, and meals\nProvide administrative and office support, such as typing, dictation, spreadsheet creation, faxing, and maintenance of filing system and contacts database\nMaintain professionalism and strict confidentiality with all materials\nOrganize team communications and plan events, both internal and off-siteSkills",
    "Skills": [
        "Required skills and qualifications",
        "Four or more years of experience in an administrative role reporting directly to upper management\nExcellent written and verbal communication skills\nStrong time-management skills and an ability to organize and coordinate multiple concurrent projects\nProficiency with office productivity tools and an aptitude for learning new software and systems\nFlexible team player, willing to adapt to changes and unafraid of challenges\nAbility to maintain confidentiality of information related to the company and its employees\nProven experience as an executive assistant or other relevant administrative support experience.\nExcellent organisational, time-management and multitasking skills.\nProficient in handling MS Office tools like Word, PowerPoint, Excel, Outlook, and Teams.\nAdroit communicator willing to share insights with the admin department and deduce logical outcomes.\nFluent collaborator with a keen eye to analyze information from various sources.\nSkilled executive known for abiding by the organization's confidentiality rules and regulations."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}