{
    "Job ID": "4724159",
    "Description": "2- Prepare, and/or review the works of QS related to, commercial proposal of assigned project which covers detailed cost estimates from taking-off of quantities, RFQs, evaluation and negotiation of suppliers’/subcontractors’ proposals, building up of cost elements, pricing of pay items in Excel spreadsheet or proprietary software-based Estimation program, determine overheads, perform Risk Assessment, request tender guarantee; and technical proposal.3- Represent SHADE in meetings (Job-Explanation Meeting / site visit and pre-contract and post Clarifications Meetings) with clients, consultants, subcontractors, governing agencies and other parties with respect to Estimation-related works.4- Prepare a complete compilation of all Estimation-related documents of each assigned project which includes original tender documents, all correspondences (letters/emails/faxes), Job-Explanation MOM, responses to clarifications, RFQs and quotations, commercial proposals, technical proposals, Method Statements; and, as the situation requires, prepare Estimation Section Weekly Report/periodic report, and control and maintain the Estimation Section documents registers.5- Assist (when necessary) in the preparation of, and certifies prior to issuance to the Client, of projects’ change orders; and assists the Project Control / Procurement Department in the evaluation of bids / offers of subcontractors and suppliers.6- Assist (when necessary) in the preparation of contractual claims to clients, defense against claims of clients, negotiations, dispute resolution; and in preparation of RFQs/FEED documents for subcontractors.7- Accuracy of estimates and secrecy of the assigned Tenders, and efficiency of the assigned team (if any).Skills",
    "Skills": [
        "Communications Engineering Discipline.",
        "• Bachelor's Degree in Electronics and Communications Engineering.",
        "• Excellent communication skills.",
        "• Negotiation.",
        "• Able to join Immediately.",
        "• Able to work in Eastern Province."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Telecommunications; General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}