{
    "Job ID": "4724134",
    "Description": "Main Job PurposeThe Hubs and Projects Assistant is responsible for supporting project implementation in the region,\nsupporting quality and results, efficiency and effectiveness and assisting with planning, monitoring, and the evaluation of activities within the project, in conjunction with the Project Lead.\nMain Responsibilities\nThe Hubs and Projects Assistant will:\nProvide administrative, logistical, and operational support on implementation of project,\nincluding necessary travel bookings, arrangements for project meetings and workshops.\nSupport the project lead in financial reporting, budgeting, and bookkeeping for different project transactions, and ensuring activities are implemented according to ITF and partners’ financial requirements.\nProvide regular reporting of projects’ different meetings in line with ITF and TUSSO’s reporting requirements.\nFollow-up, on a regular basis, with project partners, affiliates, and sponsors to guarantee smooth implementation of administrative and operational activities of the project; and ensure the project team works towards achieving objectives.\nMaintain up-to-date files and records of project documentation.\nProvide logistical support for workshops and other meetings as tasked by the project lead.\nProcess project-related travel arrangements.\nPerform any other tasks assigned by the project lead and the Arab world regional secretary.\nSupport the elaboration of project work plans.\nSupport the elaboration of project applications.\nSupport the organization of project reviews/evaluation meetings.\nSupport the timely preparation and submission of progress reports, donor reports, project\nreviews, financial reports, audit reports and any other required project reports.\nPerform any other tasks assigned by the project lead and the Arab World Regional Secretary.Skills",
    "Skills": [
        "Other important requirements of the job not covered above: Fluency in English.",
        "PERSON SPECIFICATION:",
        "Education level, qualifications or equivalent: Degree in Business, Communications, or related field",
        "Knowledge ,experience and technical skills:",
        "Essential:",
        "Professional experience in administration or a project supporting role.\nExceptional organization skills and multitasking ability.\nProven written and verbal communication skills.\nProficient in Microsoft Office, with aptitude to learn new software and systems.\nProven ability to meet tight deadlines and work under pressure.\nSound strategic planning, analytical and problem-solving skills.\nSound research skills and proven experience in conducting and leading strategic research to support projects.\nExperience working on projects in a fast- paced environment",
        "Desirable:",
        "Experience either in the trade union movement or in a social movements’ context.\nExperience working within an international organization.\nExperience in a project management role, preferably within an NGO",
        "Personal attributes/skills:",
        "Excellent written and spoken English\nAbility to work as part of a wider team collaboratively as well as individually.\nAbility to work independently, including the use of initiative with minimal supervision.\nCommitment to trade union values.",
        "Practical requirements (hours, requirement",
        "to travel):",
        "Ability to work flexibly, including working out of office hours, as required."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jordan",
        "Company Industry": "Media Production",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}