{
    "Job ID": "4724008",
    "Description": "As an accommodation Supervisor, you'll be responsible for the efficient running of your establishment. This includes ensuring standards of cleanliness and maintenance are upheld, budgets are controlled and any problems are quickly rectified. You must also make sure your staff are well trained and managed.As an accommodation manager, you'll generally need to:ensure the smooth running of accommodation facilities, including the safety and well-being of guests, tenants and residents\ndevelop and build positive relationships with residents, tenants and guests\ncontrol a budget and finances, manage stock levels and order supplies\ncommunicate with reception services to coordinate and plan the allocation of accommodation\nliaise with other departments within the organisation, such as catering for conferences, and relevant external agencies\narrange repairs and maintenance of the facilities\ninspect the accommodation to ensure that hygiene and health and safety regulations are met, carrying out risk assessments as necessary\nsupervise the work of cleaning staff and ensure standards are maintained\nmake sure adequate security for the building is provided\nget involved in the building and refurbishment of residential accommodation.When managing staff, you'll need to:recruit and train new members\nmake sure staff are aware of policies and procedures\nplan staff rotas and cover duty roster slots\nfacilitate staff development\ndeal with any HR-related issues and ensure health and safety processes are followed by all staff.Skills",
    "Skills": [
        "Leadership: Ability to lead and manage a team of accommodation staff, providing guidance, support, and direction.\nCommunication: Excellent communication skills to effectively interact with guests, staff, and management, ensuring smooth operations and guest satisfaction.\nCustomer Service: Strong customer service orientation to address guest inquiries, concerns, and special requests promptly and courteously.\nProblem-Solving: Quick and effective problem-solving skills to handle guest complaints, maintenance issues, and other accommodation-related challenges.\nOrganizational Skills: Strong organizational abilities to manage room assignments, check-ins, check-outs, and housekeeping schedules efficiently.\nTime Management: Effective time management to meet deadlines, handle multiple tasks, and maintain optimal occupancy rates.\nConflict Resolution: Capability to handle conflicts among staff or with guests in a diplomatic and professional manner."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}