{
    "Job ID": "4724405",
    "Description": "Collaborate closely with the Director of Policy Development and other members of the Department of Policy Development to develop and implement timely, thorough, and precise strategic communications plans that engage all relevant stakeholders, facilitate buy-in, and address concerns about significant policy initiatives.\nOversee and collaborate closely with the Legal & Legislative Department to ensure that sector policies and plans are consistent with applicable legislation and laws.\nCollaborates with the quality team to conduct inspections and examinations to ensure compliance with the company’s quality standards.\nCollaborate with cross-directorate teams to develop communications strategies and ensure a consistent message for targeted audiences (both internal and external).\nCollaborate with the Communications Department to provide content on new policies and/or policy development to the Communications Department, which assists in the development of deliverables outlined in the company’s communications plans.\nManage the review and approval process for communication materials relating to new policy initiatives within the company’s and the water sector.\nEstablish positive working relationships with the company’s various departments and sections, as well as with stakeholders.\nPromote and protect the company’s image by conducting business ethically and professionally.\nPrepare reports and presentations on issues relating to water.Skills",
    "Skills": [
        "Bachelor’s Degree in a relevant discipline e.g Public Policy, Social Policy, or Communication.\nMinimum of 3-5 years of experience in a related field\nComprehensive knowledge of the economics of the energy sector; macro-economic principles, supply-demand balances, elasticities etc.\nDetailed knowledge of energy sector policymaking, including preparation of policy proposals, evaluation and collecting feedback.\nComprehensive knowledge and application of econometrics, socio-economic analysis and associated tools and techniques.\nDeep understanding of the strategic direction of the Abu Dhabi energy sector, the objectives for the sector, the strategic direction of the Department and requirements of key stakeholders.\nThorough understanding of the broader energy sector, including its strategic direction and developments, in the broader region and globally."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 7",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}