{
    "Job ID": "4724530",
    "Description": "Online Data Analyst - United KingdomTELUS International AI-Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities for people with passion for languages. The jobs are part-time, and there is no fixed schedule. Whoever you are, wherever you come from, come join our global AI community.We are hiring freelance (English-speaking) Online Data Analysts for a project aimed at improving the content and quality of digital maps, which are used by millions of users globally. The job would suit someone who is detail-oriented, likes doing research and has a good knowledge of national and local geography.This is a freelance position on a flexible schedule - you can work on your own time whenever work is available. You will be completing research and evaluation tasks in a web-based environment, eg verifying and comparing data, determining the relevance and accuracy of information. You will be provided with guidelines for each task, which need to be followed. The project offers a variety of tasks, and work is paid per task.Skills",
    "Skills": [
        "Requirements:",
        "Full Professional Proficiency in English\nYou must be living in the United Kingdom for the last 2 consecutive years\nAbility to follow guidelines and do research online using search engines, online maps, and website information\nYou must have familiarity with current and historical business, media, sport, news, social media, and cultural affairs in the United Kingdom\nBeing open to work across a diverse set of Task Types (e.g. Maps, News, Audio tasks, Relevance)\nApplicants must be 18 years or over.",
        "Working on this project will require you to go through a standard recruitment process (including passing an open book assessment). This is a long-term project and your work will occasionally be subject to quality assurance checks."
    ],
    "Preferred": {
        "Residence Location": "United Kingdom",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "London, United Kingdom",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}