{
    "Job ID": "4724430",
    "Description": "·        عمل كافة التقارير الإدارية التي تطلبها الإدارة المباشرة او ادارة االعمليات و الخاصة بأداء الأندية و جودة العمل في مختلف المجالات أو تزويد المعلومات.\n·        متابعة سير العمل اليومي في مختلف أقسام النادي حسب ادلة العمل التي تحددها الشركة.\n·        متابعة توفر عوامل الأمن و السلامة في مختلف مرافق النادي.\n·        الحرص والتاكد  من تطبيق كافة القواعد و الأنظمة و التعليمات التي تطلبها الشركة من العاملين فيها حسب النظام الداخلي وحسب السياسات والاجراءات .\n·        متابعة الدخل المالي و المبيعات لتحقيق ميزانية الفرع وايضا الحرص على زيادة عدد الاعضاء بالنادي .\n·        المحافظة على كافة موجودات النادي والتوجيه بالاستخدام الأمثل لها.\n·        متابعة شكاوى وملاحظات الأعضاء والرد عليها سريعا واحتواء الاعضاء.\n·        توفير بيئة العمل المناسبة للعاملين و والخدمة المناسبة للأعضاء.\n·        متابعة تواجد موظفي خدمة العملاء بأماكن عملهم وإلتزامهم بإتباع التعليمات للتعامل مع الاعضاء.\nالرد على جميع الشكاوى من قسم خدمة العملاء باسرع وقت للحفاظ على جودة الخدمة بالاندية.\nمتابعة الخدمة المقدمة للاعضاء من قبل كل من في النادي وعمل استبيان اسبوعي لمعرفة مدى رضا الاعضاء.\nمتابعة جداول الحصص الجماعية ومقارنته بسبورة الحصص ومتابعة تطور حضور الاعضاء للحصص بسجل الحصص.\n·        متابعة شؤون الموظفات بالاندية والعمل على انجازها بالتنسيق مع منسق العمليات وادارة الموارد البشرية.\n·        متابعة الاحتياجات الاسبوعية وطلبات الشراء للاندية بالتنسيق مع منسقة العمليات و المستودعات والاندية.\n·        متابعة التقرير الاسبوعي للصيانة والحرص على إرساله بالوقت المحدد له وايضا المتابعة بعد إرساله بما تم وبما لم يتم من قبل الصيانة والتنسيق مع المديرة المباشرة لإنهاء الأمر.Skills",
    "Skills": [
        "مهارة الحاسب الالي\nمهارة التسويق\nمهارة حل المشاكل"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sports & Outdoor Activities",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}