{
    "Job ID": "4725998",
    "Description": "Our client is a fast-growing consulting and advisory firm. They are now looking for an External Audit Director – BFSI to join them.Roles & Responsibilities:You’ll lead medium to large teams, primarily on the audits of our diversified portfolio of clients across various sectors in the region. You will also contribute to the running of the audit business unit, including business and people development\nYou’ll be responsible for the delivery of your engagements and ensuring the high quality of your team’s audit work and reporting. You will also lead and coach your team members and manage relationships with senior level clients. \nOffering a broad range of audit expertise including planning, controlling & completing a diverse range of engagements; \nProviding high quality service by managing work undertaken in connection with external audit reviews from strategy to execution; \nFocusing on building and maintaining strong relationships and networking with key clients; \nProven project management and business development skills; \nLeading external teams and client meetings;\nEnsuring that key deadlines are achieved;\nProactive approach to problem solving and delivering client solutions.\nSkilled in identifying and taking forward business opportunities \nMaintains an awareness of market trends, competitor activity and products/service;\nManaging the staffing of the job and the financial performance;\nAbility to research technical issues and analyze information into concise deliverables;\nCommunicate information at the Leadership level; \nProven experience in supervising and developing staff and managing the personal and professional training of the team; \nSound time management skills and proven ability to successfully manage multiple projects through to completion;\nDemonstrated flexibility to work to tight deadlines and demanding work environment;\nMotivating and empowering your team towards meeting company’s goals and living up to the culture and values; \nExceptional people skills and ability to communicate clearly with colleagues and clients at all levels; and\nLeads by example ensuring client needs, quality and integrity remain at the ground rule for decision making.Benefits:Competitive all-inclusive salary\nUAE mandatory benefitsSalary: AED 45000 - AED 50000Skills",
    "Skills": [
        "Preference:",
        "Arabic-speaker\nImmediate joiner",
        "Qualifications:",
        "9 or more years external audit experience, at least 4 of which are in a management role;\nAn internationally recognized accounting qualification (such as ACA, CA, CPA (US) or ACCA); \nA strong knowledge of IFRS and IPSAS;\nKnowledge and experience in Audit and Data analytics tools\nExperience in risk management, governance & internal control processes;\nArabic Language is a plus\nPrior experience in working with clients involved financial services\nKnowledge and experience in Audit and Data analytical tools\nExcellent presentation skills to produce and review complex financial reports and proposals; and"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}