{
    "Job ID": "4725191",
    "Description": " Ensure that all products produced are fit for purpose, are consistent and meetsboth internal and external customer requirements. Maintain the Alutec integrated quality system in accordance with therequirements of ISO9001, ISO14001 and ISO18001. Ensure the quality system is always audit ready. The Quality Manager will act as the company representative for the QualityManagement System. Promote a positive approach to Quality amongst employees, while fostering aBusiness Excellence and Continuous Improvement culture. Establish and implement policies and procedures throughout the organisationthat will ensure compliance in a robust and efficient fashion. Work with other senior managers to establish group KPI’s to monitorperformance against business objectives. Set and manage the Quality Team Goals and Objectives to align with delivery ofthe company KPI’s. Identify areas for improvement and lead improvement initiatives. Champion a structured approach to problem solving within the organisation. Facilitate investigation, trouble shooting and reporting on system failures andproduct defects. Ensuring release of product in accordance with approved company procedures. Final disposition of non-conforming product including MRB co-ordination. Management of the Quality Assurance Function and reporting on theeffectiveness of the Quality Management System to the senior managementteam. Management of the company Corrective and Preventive Action systems. Ensuring that products manufactured meet requirements of end users andregulatory authorities. Auditing (with other management personnel) of the quality system. Ensuring that all plant personnel are fully aware of quality requirements. Review of customer complaints. Complete internal and vendor/contractor audits to monitor the effectiveness oftheir quality system and check the level of compliance to the quality system. Maintaining records in accordance with the quality system and industryrequirements, which show that products manufactured meet the requirements ofend users, customers, regulatory authorities, and the company. Upkeep of the company’s calibration program for test and inspection equipment. Provide leadership and mentoring to company personnel. Establish programs to ensure plant training, upskilling and succession planningare in place to deliver both the short- and long-term business requirementsSkills",
    "Skills": [
        " BS or MS degree in Quality Management or Engineering",
        " 15+ years’ experience in a structured manufacturing Industry.",
        " At least 10 years’ experience in a management role.",
        " Façade manufacturing experience would be an advantage though not essential.",
        " Experience in Middle east or Gulf Region preferred.",
        " Strong people management skills.",
        " Strong sense of commercial awareness and project targets.",
        " Excellent working knowledge of MS Office suite.",
        " Experience of Production Management/ERP software."
    ],
    "Preferred": {
        "Years of Experience": "Max: 15",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}