{
    "Job ID": "4725302",
    "Description": "Developing and implementing marketing plans.\nUndertaking competitor research and analyses.\nConducting market research to establish customer trends and habits.\nEstablishing goals and objectives in order to reach our customers through appropriate marketing channels (digital and traditional).\nBuilding and maintaining relationships with new and existing customers through prospecting and networking.\nPromoting brand awareness through marketing efforts.\nCreating marketing materials for our website and other marketing platforms.\nSupporting the Sales team with marketing activities by demonstrating expertise in various areas, including optimization, advertising, social media, direct marketing, and event planning.\nAssisting with the analyses of marketing data, including campaign results, conversion rates, and online traffic in order to improve future marketing strategies and campaigns.\nPerforming other duties when needed.Skills",
    "Skills": [
        "Knowledge of modern techniques and their implementation to boost sales activities.\nProficient in creating sales records, client interactions, and developing precise reports.\nApproaching new and existing customers by following optimum consumer service standards.\nA high level of focus on driving sales with consistent performance and teamwork.\nPortraying superb soft skills during customer interaction and seminars as per requirement.\nDemonstrated ability to forge long-lasting work relationships by leveraging information, tactics, and excellent communication."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}