{
    "Job ID": "4725231",
    "Description": "This position is responsible for administering preparation of the KPI Reports, performance Manage initiatives to improve project’s performance management plans (PMPs), and evaluation system design and implementation.\nWork closely with HR and Planning department to ensure Performance KPIs are being measured and are incorporated in the business processes through the incentive system, org structure.\nAdminister preparation of the reports for the KPIs reports in each department in coordination with the Business managers.\nContribute to KPI automation through setup of data, designing the system automation Requirements.\nContinuously monitor and analyze the KPIs of the organization as well as the departments, ensuring developing of effective KPIs to measure the performance of the organization as well as continuously identifying to management KPIs lags and lack of conformance to benchmark metrics.\nMonitor Customer Related KPIs and ensure KPI benchmarks are always met.\nMonitor Performance, Record, analyze and distribute statistical information related to KPI Performance.\nMake suggestions for changes and improvements and how to implement KPIs.Skills",
    "Skills": [
        "Bachelor’s degree required.\nMinimum of five years of experience in Monitoring and evaluation systems design, performance measurement, indicator selection, quantitative and qualitative data collection and analysis, and database management required.\nSupervisory experience required along with PIP(performance Improvement plan knowledge)\nExpertise in qualitative and quantitative research and evaluation methodologies\nExcellent verbal and written communications skills\nAbility to draft and deliver timely, high-quality evaluation reports.\nAbility to work independently and in a team environment.\nDemonstrated leadership, versatility, and integrity.\nFluency in English required."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}