{
    "Job ID": "4725531",
    "Description": "Company profile:Our client is an entrepreneur in spirit, who truly believe that ordinary is the road to nowhere. They are an integrated communication company. They believe in concrete, palpable results. They are strategic thinkers yet street-smart. They are true believers that dedication leads to mastery. They are currently looking to hire an experienced GraphicThe Role:As a Graphic Designer, you will play a key role in conceptualizing and creating visually compelling designs for various advertising campaigns. Your responsibilities will include creating graphics for print and digital media, designing marketing collateral, and ensuring that all visual elements align with the brand guidelines. Strong portfolio of design work, excellent design skills, and a passion for delivering impactful and visually stunning creative solutions.1. Visual Conceptualization and Design:Collaborate with the creative team, including Art Directors, Copywriters, and 3D Designers, to develop innovative and impactful visual concepts for advertising campaigns.\nCreate visually-compelling designs for print and digital media, including posters, brochures, social media graphics, digital ads, and website banners.\nCutting and editing videos. As well as conceptualizing videos, and creating reels.2. Branding and Identity:Ensure that all visual elements adhere to brand guidelines, maintaining brand consistency across all marketing materials.\nCreate brand identity elements, such as logos and brand collateral, that effectively represent the clients' brand image.3. Layout and Composition:Develop creative and aesthetically pleasing layouts, considering typography, color palettes, and visual hierarchy to enhance readability and visual impact.\nIncorporate engaging imagery and graphics to bring concepts to life.4. Image Editing and Retouching:Edit and retouch images to enhance visual appeal and quality, ensuring that they align with the campaign's creative direction.5. Collaboration and Cross-Functional Communication:Collaborate with cross-functional teams, including marketing, account management, and production, to ensure design deliverables meet project requirements and timelines.\nCommunicate design ideas, progress, and any potential challenges effectively to team members and stakeholders.6. Industry Trends and Innovation:Stay updated on the latest design trends, emerging technologies, and best practices in the advertising and graphic design industry.\nIncorporate new techniques and design trends to deliver fresh and innovative creative solutions.Skills",
    "Skills": [
        "Qualifications, skills, and certifications:",
        "Bachelor's degree in Graphic Design, Visual Communication, or a related field.\nProven experience as a Graphic Designer within an advertising company or creative agency.\nOutstanding portfolio showcasing a diverse range of design work, including print and digital materials.\nProficiency in graphic design software, such as Adobe Creative Suite (Photoshop, Illustrator, InDesign).\nStrong understanding of design principles, typography, color theory, and layout.\nAttention to detail and the ability to work in a fast-paced, deadline-driven environment.\nExcellent communication and collaboration skills to work effectively with cross-functional teams.\nCreative thinking with the ability to develop innovative and impactful design concepts.\nFamiliarity with motion graphics and video editing is a plus but not required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}