{
    "Job ID": "4725365",
    "Description": "Job SummaryWe are looking for a Thai Therapist for our subsidiary company Synergy Healing Centre. A candidate who should be a passionate, professional, reliable and confident massage therapist with specialist skills and relevant experience in Thai massage therapy. You should offer a full range of treatments to fulfil different client needs and objectives. You should have good interpersonal skills, be empathetic and have the ability to put clients at ease.As a therapist, you will be responsible for ensuring outstanding treatment service delivered to the Synergy Healing Centre standards.Responsibilities:Promote a warm, relaxed feeling for guests and anticipate their needs\nPersonalize each treatment to accommodate the individual needs of our guests.\nProtect client data and ensure client confidentiality is maintained at all times\nFollow established protocol to provide consistent, excellent service\nBe extremely knowledgeable and able to accurately describe and sell services and products offered at Synergy Healing Centre\nProvide information to the clients on the benefits of Massage\nMaintain cleanliness, organization and restocking of treatment rooms\nResponsible for ensuring cleanliness, room ambiance, and overall spa experience\nPerform opening and closing responsibilities noted on the massage therapist/room checklist\nMaintain excellent communication between activity in the treatment rooms and receptionists\nProvide accurate information to the receptionists regarding the type and length of treatment provided to guestsSkills",
    "Skills": [
        "Requirements/Skills:",
        "Previous experience as a therapist in a reputable environment\nExcellent understanding of client care and treatment\nAbility to work for and as part of a dedicated and passionate team\nGood level of written and spoken English\nExceptional customer care skill\nExcellent personal presentation\nConfidence and professionalism when dealing with all profile clients\nKnowledge of the following: Thai Massage, Deep Tissue Massage, treatments with accredited and recognised experience of traditional Thai massage therapy\nUnderstanding and belief in the healing benefits of massage therapy and bodywork"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 4",
        "Gender": "Female",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Fujairah, United Arab Emirates",
        "Company Industry": "Personal Care Centers; Other Healthcare Services; Personal Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}