{
    "Job ID": "4725795",
    "Description": "Position Title: Art DirectorCompany profile:Our client is an entrepreneur in spirit, who truly believe that ordinary is the road to nowhere. they are an integrated communication company and they believe in concrete, palpable results. They are currently looking to hire an experienced Art Director to join their team in Beirut, LebanonThe Role:As an Art Director, you will be responsible for conceptualizing and executing visually compelling and innovative ideas for various advertising campaigns. Your role will involve leading the artistic direction, collaborating with copywriters and designers, and overseeing the creative process from inception to final execution.Skills",
    "Skills": [
        "Qualifications, skills, and certifications:",
        "Bachelor's degree in Design, Fine Arts, Graphic Design, or a related field. A Master's degree is a plus.\nProven experience as an Art Director or a similar creative leadership role within an advertising company or creative agency.\nOutstanding portfolio showcasing a diverse range of creative work, demonstrating expertise in various mediums, including print, digital, and video.\nProficiency in design software and tools, such as Adobe Creative Suite (Photoshop, Illustrator, InDesign) and other relevant applications.\nStrong leadership and management skills, with the ability to inspire and motivate a creative team.\nExcellent communication and presentation skills, with the ability to articulate artistic concepts and ideas effectively.\nA strategic thinker with a deep understanding of branding, visual storytelling, and the ability to translate client objectives into compelling artistic solutions.\nStrong attention to detail and a keen eye for aesthetics, composition, and visual impact.\nAbility to work in a fast-paced environment, manage multiple projects simultaneously, and meet tight deadlines.",
        "Soft & hard skills:",
        "1.    Conceptualization and Creative Direction:",
        "Lead the artistic direction and conceptualization of advertising campaigns, ensuring alignment with client briefs, brand guidelines, and campaign objectives.\nCollaborate with cross-functional teams, including copywriters, designers, and strategists, to develop cohesive and impactful creative concepts.",
        "2.    Visual Design and Branding:",
        "Oversee the development of visually stunning designs for various advertising materials, such as print ads, digital banners, social media content, and video campaigns.\nEnsure that all creative concepts effectively convey key messages, evoke emotions, and resonate with the target audience.",
        "3.    Team Leadership and Mentorship:",
        "Lead and mentor a team of designers and collaborate with copywriters, providing guidance, feedback, and support to foster their professional growth.\nFoster a collaborative and creative work environment, encouraging teamwork, experimentation, and excellence in design.",
        "4.    Client Presentations:",
        "Present creative concepts and ideas to clients, articulating the artistic vision and storytelling behind the designs.\nIncorporate client feedback and insights into the creative process, ensuring client satisfaction and alignment with their expectations.",
        "5.    Campaign Execution and Production:",
        "Oversee the execution of creative campaigns, ensuring that the final output meets the highest standards of quality and creativity.\nCollaborate with production teams and external vendors to ensure the smooth production and delivery of creative materials.",
        "6.    Innovation and Industry Trends:",
        "Stay updated on industry trends, emerging design technologies, and best practices to drive innovation and maintain a competitive edge.\nIntegrate new artistic techniques and tools to enhance the creative process and deliver cutting-edge design solutions."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}