{
    "Job ID": "4725208",
    "Description": "-To establish and maintain all expectations of project management and to define project guidelines and standards to ensure projects run smoothly, adhere to quality standards, meet guidelines,and follows project management policies, processes, methods and controls.-To ensure all team members uphold the company's standards throughout each project's development & execution.Responsibilities-Oversee projects/serve as project advisor to ensure project objectives and deliverables meet key and/ or strategic initiatives.-Planning PMO projects including timelines, budgets, tasks and staff.-Evaluating project costs, work progress and taking appropriate actions.-Creating project status reports for Top management.-Manage department and projects communication processes to ensure that all processes are applied and followed.-Compile presentations to summarize findings/recommendations and take part in reviews with Top management.Skills",
    "Skills": [
        "-Knowledge of project Management",
        "-Knowledge of planning, scheduling",
        "-Knowledge of Project Cost Controls",
        "-Knowledge of contracts and subcontracts management",
        "-Knowledge of current industry and technical deleopments.",
        "-Safety Rules and Regulations.",
        "Qualifications",
        "-Bachelor's and master's degree in project management ,Engineering, MBA, Computer science Information Technology.",
        "-Licenses or certifications required by the positions :PMP,ITIL, CSM,CQIA,SPC4",
        "-Minimum 15 years of experience in project controls for contracting industry operations."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}