{
    "Job ID": "4725881",
    "Description": "“Exciting Relocation opportunity!” Quest Search and Selection is currently partnering with a supermarket chain in Bermuda! The business operates both small supermarkets and convenience stores strategically situated across the island. Serving the community for over four decades they focus on quality and providing a premium choice in meats, seafood, and fresh produce. This is an opportunity to work in one of the friendliest islands in the Northern Hemisphere! An income tax-free salary and relocation support, this is a once in a lifetime opportunity!The Role:The role of Head of Food Service involves overseeing and managing the food service operations within the Food Service Department. Responsibilities include creating menus, purchasing food, and ensuring quality standards are maintained. Additionally, will oversee cost control, managing food costs, and supervising storage, stocking, and sanitation procedures.Roles and Responsibilities as Head of Food Service position:Develop long-term plans to enhance overall food service operations in alignment with the company's strategic goals.\nResponsibilities include recruiting, training, and managing food service associates.\nCreation of menu items, recipes, and dishes with correct costings to ensure gross profit percentage is achieved.\nOverseeing catering operations for special events and meetings.\nEnsuring food quality and maintaining excellent standards for all dishes prepared.\nResponsible for determining food inventory needs, stocking, and ordering.\nManaging the overall budget for the food service program, including labour and food costs.\nEvaluating, measuring, tracking, and reducing shrink in the department to achieve targeted gross margin percentages effectively.\nCreating training programs that maximize sales, margin, and minimize spoilage, with an emphasis on quality.\nOverseeing all department marketing plans and advertisements, collaborating with the marketing team to promote and deliver the brand successfully.\nRegularly meeting with vendors for deal negotiation and business updates.\nKeeping up to date with new industry trends and responding competitively to changes in the marketplace.\nCreating and executing a plan to deliver sales growth, margin performance, and bottom-line profitability.\nPromptly and courteously handling customer requests and complaints.Benefits that include this Head of Food Service position:Bonus potential guarantee of 5% of net profit (paid every quarter)\n10 days Paid holiday + 10 Bank holidays + 10 day sick pay\nContracts are renewed every year.\nReturn flight tickets\nRelocation allowance \nAccommodation for your 1st month\naccess to a vehicle for your 1st month (generally scooter, motorbike for ease to get around island) \nFull orientation once on the island \nPrivate healthcare (to buy into)\nWork Permit \nFriendly community and extensive expat community\nAmazing weather\nAlways close to a beach\nDuty Free shopping!This presents an excellent chance to relocate and be part of a progressive company offering exceptional career opportunities.Skills",
    "Skills": [
        "Key Requirements for this Head of Food Service position:",
        "Minimum of six years of experience + in a high-volume, multi-unit food service operation, preferably with catering or food service experience within the retail industry.\nYou must be operating as a Head of, Regional, Area Manager or Site Director level\nYou must have strong leadership experience, including hiring staff, coaching, performance management, daily operations supervision and conducting disciplinaries. \nBachelor's degree in food service management or hospitality or equivalent is desirable.\nHave an understanding of various cooking methods, ingredients, equipment, and procedures.\nDemonstrated track record of implementing innovative menu ideas and programs to drive sales and profits within the department.\nComprehensive knowledge of food safety standards and compliance.\nStrong financial acumen, with experience in developing and managing budgets.\nProficient in computer skills, including Microsoft Office, Excel, Word, PowerPoint, \nFlexibility to work weekends and maintain a flexible work schedule.\nThese are sill hands environments so you must be capable of lifting moderate to heavy loads and pushing and pulling fully loaded hand trucks/pallet trollies. \nKnowledge of pricing and costing policies in the food service department, ensuring the delivery of established targets."
    ],
    "Preferred": {
        "Residence Location": "Canada; South Africa; United Kingdom; United States"
    },
    "Data": {
        "Job Location": "Bermuda",
        "Company Industry": "Catering, Food Service, & Restaurant; Hospitality & Accomodation; Food & Beverage Production",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "1"
    }
}