{
    "Job ID": "4725463",
    "Description": "Assists in the establishment of schedules and methods for the testing and installation of assigned electronics and communications engineering projects; - Prepares acquisition and/or installation cost estimates; coordinates engineering work with that of other divisions and supply contractors; - Prepares preliminary engineering calculations, drawings, equipment specifications and other supporting data for new or potential projects; - Conducts tests on installed systems; evaluates failed components and failure trends; makes recommendations to resolve problems; - Evaluates and determines appropriate materials for use in electronics and communications equipment and systems; - Conducts on-site inspections of electronics and communications installations; - Coordinates engineering work with and provides engineering technical support to other departments and outside agencies; - Participate in relevant meetings, such as Model Reviews, Design reviews. Use suitable technology to increase efficiency - Progress reporting of assigned work tasks; identify and highlight potential issues. Advise management of variations in a timely mannerSkills",
    "Skills": [
        "Qualifications :Bachelor’s Degree in Electronics and Communications Engineering",
        "Experience :",
        "Bachelor Degree—5+ years minimum with 3 years’ experience as Electronics and Communications Engineer",
        "Technical Skills :",
        "- Working knowledge of Saudi Aramco Standards.",
        "- Understanding of FEED and Detailed design engineering work processes, cost control & scheduling.",
        "- Strong IT Skills",
        "- Strong interest in technology. Soft Skills :",
        "- Problem Solving Skills",
        "- Planning and prioritization skills",
        "- Communication/Coordination skills",
        "- Mentoring skills - Result orientation attributes",
        "- Integrity",
        "- Ability of effectively interface with all discipline"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 15",
        "Residence Location": "Western Province, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}