{
    "Job ID": "4725230",
    "Description": "As Mall Supervisor, you will be expected to manage the day to day relationship with investors. Provide extraordinary customer services to ensure a great customer experience is achieved.Conduct routine common area site inspection (internal & external) and communicate all findings to the concerned Department in order to ensure the highest quality assurance standards are maintained.\nMonitor and support Retail Design & Delivery plans, Marketing and Specialty Leasing activities in the Mall.\nConduct routine investor's inspections and follow up to make sure all relevant issues are resolved.\nConstantly conduct a mall walk to ensure all investors are operating as per the Mall rules and standards and that all compliance standards are met.\nSupervise and coordinate with security to ensure all loading docks are operated as per the Mall rules and standards.\nSupervise installation in common areas when needed in order to ensure that the contractor is implementing Mall rules and standards.\nInspect units that are fitting out to ensure all fire and safety requirements are followed.\nConduct proper induction for the contractor for all projects on site.\nPrepare inventory reports as per the frequency scheduled.\nEnsure all back service corridor, fire escape route and staircase are kept clean and free from any obstacles.\nMonitor contractual obligations of outsourced Security and Housekeeping staff and report any non-compliance issues.\nProvide professional customer Service to investors, employees and customers. Skills",
    "Skills": [
        " Minimum 5 years of experience with at least 3 years in a supervisory role in a guest service or hospitality related industries\nGood in MS Office\nAble to perform physical activities that include indoor and outdoor work\nMust have a strong sense of ownership to deliver department objectives and pursue professional development of self and team.\n6 days a week in 8-hour rotational shifts\nCandidate should be willing to Work At Al Khiran"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Other",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}