{
    "Job ID": "4725682",
    "Description": "Answers incoming telephone calls, determines purpose of callers, and forwards calls to appropriate personnel or department.\nAnswers questions about organization and provides callers with address, directions, and other information.\nGreet clients and visitors with a positive and helpful attitude and serve water and tea / coffee to guests.\nAnnounces visitors to appropriate personnel.\nAssisting clients in finding their way around the office/warehouse.\nMaintaining visitor logs.\nPreparing and organizing schedules of meeting rooms.\nTakes and delivers messages when appropriate personnel are unavailable.\nOrders, receives, and maintains office and pantry supplies.\nResponsible for booking flight tickets which includes amendments, cancellations, flight timing information and PO/invoice reconciliation.\nPerform other duties as assigned by HOD Procurement and Logistics.\nAssist and support with general administrative tasks and office duties as required.Skills",
    "Skills": [
        "Emirati - Receptionist",
        "Able to make decisions & work well under stress in a fast-paced environment\nOrganizational and office management skills\nRecord-keeping skills\nExcellent time management skills and the ability to prioritize work\nAttention to detail and problem-solving skills\nExcellent written and verbal communication skills\nStrong organizational skills with the ability to multi-task\nNumber of years of Experience: 2-3 Year as Receptionist in any industries\nEducation: High School degree minimum\nSystems: Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, Outlook, and Excel)\nLanguages: English & Arabic"
    ],
    "Preferred": {
        "Nationality": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}