{
    "Job ID": "4725443",
    "Description": "We are hiring Online Data Analysts in Thailand (Thai speakers)We are hiring freelance English and Thai-speaking Online Data Analysts for a project aimed at improving the content and quality of digital maps, which are used by millions of users globally. The job would suit someone who is detail-oriented, likes doing research and has a good knowledge of national and local geography. This is a freelance position on a flexible schedule - you can work in your own time whenever work is available. You will be completing research and evaluation tasks in a web-based environment, eg verifying and comparing data, and determining the relevance and accuracy of information. You will be provided with guidelines for each task, which need to be followed. The project offers a variety of tasks, and work is paid per task.  Why Join the TELUS International AI Community? • Earn extra income• Access to our community well-being initiative   • Remote work & Location Independence• Be your own boss• Flexible Hours to fit in with your lifestyle • Be a part of an online communitySkills",
    "Skills": [
        "Requirements:",
        "• Full Professional Proficiency in English and Thai",
        "• You must be living in Thailand for the last 2 consecutive years",
        "• Ability to follow guidelines and do research online using search engines, online maps and website information",
        "• You must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in Thailand",
        "• Being open to work across a diverse set of Task Types (e.g. News, Audio tasks, Relevance)",
        "• Applicants must be 18 years or over. ",
        "Working on this project will require you to go through a standard recruitment process (including passing an open book assessment). This is a long-term project and your work will occasionally be subject to quality assurance checks.  "
    ],
    "Preferred": {
        "Residence Location": "Thailand",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Bangkok, Thailand",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}