{
    "Job ID": "4725553",
    "Description": "Content Writer - Arabic SpeakerResearch industry-related topics (combining online sources, interviews and studies)\nWrite clear marketing copy to promote our products/services\nPrepare well-structured drafts using Content Management Systems\nProofread and edit blog posts before publication\nSubmit work to editors for input and approval\nCoordinate with marketing and design teams to illustrate articles\nConduct simple keyword research and use SEO guidelines to increase web traffic\nPromote content on social media\nIdentify customers’ needs and gaps in our content and recommend new topics\nEnsure all-around consistency (style, fonts, images and tone)\nUpdate website content as neededSkills",
    "Skills": [
        "Exceptional Writing Skills: Proficient in producing well-written, clear, and engaging content with proper grammar, punctuation, and sentence structure.\nCreativity: Ability to think creatively and generate original ideas for various types of content, such as blog posts, articles, social media posts, and website copy.\nResearch Skills: Capable of conducting thorough research on various topics to ensure content is accurate, informative, and up-to-date.\nAdaptability: Skilled at adapting writing style and tone to suit different audiences and content formats.\nSEO Knowledge: Familiarity with search engine optimization (SEO) principles and best practices to optimize content for better search engine rankings.\nTime Management: Effective time management to meet deadlines and handle multiple projects simultaneously."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}