{
    "Job ID": "4725695",
    "Description": " Lead the technical project management of electrical projects, overseeing the entire project lifecycle, from design and planning to execution and commissioning.\nDesign and develop complex electrical systems and components for a wide range of projects, ensuring compliance with industry standards and regulations.\nPerform detailed analysis, testing, and troubleshooting of electrical systems to identify and resolve technical challenges and ensure optimal performance for AC and telecom DC systems.\nMentor and provide technical guidance to junior electrical engineers, supporting their professional development and growth within the company.\nPrepare comprehensive project documentation, including technical drawings, schematics, specifications, and operation manuals.\nReview and approve electrical designs, calculations, and engineering reports prepared by other team members or external consultants.\nManage project budgets and timelines, ensuring projects are completed on time and within budget constraints.\nCollaborate with clients and stakeholders to understand their needs and provide expert advice on electrical solutions to meet their requirements effectively.Skills",
    "Skills": [
        "Bachelor's degree in Electrical Engineering.\nMinimum of 5 years of experience in electrical engineering with a proven track record of successful project management.\nIn-depth knowledge of electrical systems, power distribution, control systems, and related engineering principles.\nProficiency in engineering software such as AutoCAD, Revit, Ecodial, or similar tools.\nStrong leadership, communication, and interpersonal skills to effectively lead project teams and collaborate with stakeholders.\nDemonstrated ability to solve complex engineering challenges and make informed decisions in a fast-paced environment.\nExperience in telecom DC systems ( recertifies and batteries ).\nBusiness writing skills , prepare technical RFP response & compliancy sheet."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 4",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 37"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}