{
    "Job ID": "4725739",
    "Description": "1.1         Decontamination of soiled instruments and equipment received from clinical areas as per the organization policies and procedures1.2         Wraps and prepares trays, instruments and supplies prior to sterilization, utilizing appropriate quality control and labeling systems.1.3         Proper methods of cleaning, disinfection and sterilization process including running of the machines and recall process of sterilized items1.4         Inspects sets and maintains all instruments and devices to determine that they are in good working condition.1.5         Maintains the inventory of supplies, stocks and rotates stored supplies, dispenses supplies per requisition and records changes.1.6         Inventories and stock exchange carts and delivers cart to appropriate nursing units.1.7         Demonstrates knowledge of CSSD equipment, policies and procedures. Understands and follows instructions. Conscientious with regard to procedures.1.8         Performs clerical duties as indicated by assignment.1.9         Able to prioritize tasks and work under pressure.1.10      Attends in-services and staff meetings, training and education sessions1.11      Performs other applicable tasks and duties as assigned within the realm of his/her knowledge, skill and abilities.1.12      Operating and monitoring steam autoclaves, sonic washers, and other sterilizing equipment1.13      Organizing surgical instrument trays.1.14      Act as guide for the CSSD practices of technician B1.15      Recording sterilizer test results an retain the records for at least 1 YearSkills",
    "Skills": [
        "1.1         Sterilization Services Diploma/ Internship post High School or general equivalency diploma",
        "1.2         Certified as Sterile Processing and Distribution Technician by the Certification Board for Sterile Processing and Distribution (CBSPD) /Or having any other Comprehensive CSSD program or training course that is accredited by the Saudi Commission for Health Specialties",
        "1.3         2 years' previous experience in sterilization/surgery preferred.  "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}