{
    "Job ID": "4725530",
    "Description": "Role SummaryJob title: Brand Operation ManagerFunction: OperationScope: Across 15-20 Restaurants or as agreed on span of controlReporting to: Brand GM ManagerSubordinates by title: Area Managers Career Path Next Level:  Operation Manager (Multi – Brand)Location: As agreed/ and assigned Purpose of the positionTo manage, lead and support a Brand restaurants team, and to deliver against the key business indicators as laid out in the Annual Operating Plan and measured against Balance Scorecard targets in the 4 main areas:·        Teams·        Customer and Restaurant Excellence·        Sales·        ProfitPrimary Responsibilities:Manage all F&B and day-to-day operations within budgeted guidelines and to the highest standards\nPreserve excellent levels of internal and external customer service\nOperate menus, purchase goods and continuously make necessary improvements\nIdentify customers’ needs and respond proactively to all of their concerns\nLead F&B team by attracting, recruiting, training and appraising talented personnel in coordination with the HR Team.\nEstablish targets, KPI’s, schedules, policies and procedures.\nProvide a two-way communication and nurture an ownership environment with emphasis in motivation and teamwork\nComply with all health and safety regulations\nReport on management regarding sales results and productivitySkills",
    "Skills": [
        "Job Requirements",
        "Proven food and beverage management experience\nWorking knowledge of various computer software programs (MS Office, restaurant management software,",
        "POS)",
        "Ability to spot and resolve problems efficiently\nMastery in delegating multiple tasks\nCommunication and leadership skills\nUp to date with food and beverages trends and best practices\nAbility to manage personnel and meet financial targets\nGuest-oriented and service-minded\n10 Years’ Experience in Food and Beverage or Food Services is a must.\nFluency in English (Spoken & Written).",
        "Bachelor degree in Business, F & B, Hospitality industry or similar degree"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 10",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Food & Beverage Production; FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}