{
    "Job ID": "4725502",
    "Description": "شركة تعمل في مجال تصنيع الامونيوم والحديد وبيوت الجاهزه والحاويات والخيام والاثاث\n\nاستخدام استراتيجيات مناسبة لشراء احتياجات المؤسسة بأسعار مناسبة.\nاكتشاف الموردين وبدء التعاقد وعمل شراكات تجارية وتنظيمية.\nالتفاوض مع البائعين لتأمين شروط جودة وسعر مناسب.\nالموافقة على طلب السلع والخدمات اللازمة من الاقسام المختلفة.\nوضع اللمسات الأخيرة على تفاصيل شراء الطلبات والتسليم.\nفحص واختبار العقود الحالية والتأكد من مواعيد تجديد العقود.\nمتابعة المتطلبات وتقديم التقارير الخاصة بالمشتريات والمتطلبات.\nالتعاون مع الإدارات المختلفة لضمان وضوح المتطلبات والميزانيات.\nبناء وتطوير قسم المشتريات ووضع خطط الشراء ورسم السياسات والإجراءات.\nتقديم احتياجات كل قسم من المواد الأولية ووضع الموازنة الملائمة.\nبناء وتطوير خطة سنوية الاحتياجات من المواد الأولية اللازمة.\nالبحث الدائم عن موردين جدد للمواد الأولية المستخدمة في التصنيع أو التشغيل.\nبناء وتطوير علاقات متينة من الموردين والحفاظ عليها.\nعمل خطة دورية مع نهاية كل عام وتحديث السياسات والإجراءات.\nبناء الهياكل والنماذج المختلفة المستخدمة في دائرة المشتريات.\nالاحتفاظ بملفات طلبات الشراء الداخلية والخارجية, وعروض الأسعار والعقود.\nالتواصل الدائم مع إدارة المستودعات بشأن نقص المخزون ومدى استيعاب المخازن وحركة معدل دوران المخزون.\nإعداد الطلبيات الواردة من الأقسام المختلفة وإرسالها إلى الموردين المعتمدين ومتابعتها حتى استلامها.\nمراجعة عروض الموردين والرد عليها بالإيجاب أو الرفض.\nمتابعة التغيرات التي تظهر على أسعار المواد الخام بشكل دوري.\nالاتصال مع الجهة الطالبة للبضاعة والمتابعة المواد المطلوبة في الوقت المناسب والطريقة المناسبة.Skills",
    "Skills": [
        "لمهارات اللازمة لوظيفة مدير المشتريات:\nالقدرة العالية على التخطيط .\nالقدرة العالية على التواصل باللغة الانجليزية والعربية.\nالقدرة العالية على إجراء عمليات التفاوض.\nالمعرفة الجيدة بإجراءات صياغة العقود والمراسلات التجارية وإبرام الصفقات التجارية.\nاجادة استخدام برامج MS Office واستخدام الانترنت.\nاجادة التعامل مع فريق العمل.\nالقدرة على إعداد التقارير بشكل دوري.\nمتطلبات العمل في وظيفة مدير مشتريات:\nالحصول على درجة البكالوريوس في التجارة أو إدارة الأعمال.\nالمعرفة الجيدة بالتعامل مع الموردين.\nالخبرة العملية في مجال المشتريات.\nالخبرة في إجراءات جمع وتحليل البيانات."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Age": "Min: 35 Max: 45"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}