{
    "Job ID": "4725674",
    "Description": "• Prepare and update the Procurement Plan, providing regular reports to management.• Ensure timely awarding of subcontractors and suppliers in line with the Procurement Plan.• Coordinate with the projects team on dates, quantities, and technical matters.• Conduct investigations and research to identify new sources.• Implement corporate procurement processes and procedures.• Schedule and prioritize procurement activities effectively.• Carry out cost and technical analysis of submitted quotations, ensuring compliance with project requirements.• Negotiate prices, payment terms, contract conditions, delivery schedules, and technical issues with vendors.• Develop and maintain a comprehensive database of materials, suppliers, and subcontractors.• Collaborate with other departments and site management teams.• Handle problem-solving related to late deliveries, shortages, etc.• Manage relationships with suppliers and subcontractors.• Prepare procurement reports to keep stakeholders informed.Skills",
    "Skills": [
        "Mandatory Requirements:",
        "• Bachelor’s degree in civil engineering or architecture.",
        "• Minimum of 12 years of experience, including at least 5 years in procurement within the Construction Industry, preferably with Main Contractors.",
        "• Experience in Residential, Hotel, Commercial, and Civil Construction projects.",
        "• Proficient in Microsoft Office Suite (Excel, Word, Outlook).",
        "• Excellent verbal and written communication skills in English and Arabic.",
        "• Strong organizational skills, ability to work to deadlines, and handle pressure effectively.",
        "• Good negotiation skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering; Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}