{
    "Job ID": "4725252",
    "Description": "Doha Academy is a growing group of schools situated in the heart of Qatar’s cosmopolitan capital city. Founded in 2000, Doha Academy currently consists of three schools and offers a KG-13, British-based and Qatar national curriculum. The Academy’s Mission is to develop outward-looking, lifelong learners via a broad educational provision founded on local cultural values and traditions.Doha Academy is an ambitious organisation, governed by Al Faleh Educational Holding that includes AFG College with the University of Aberdeen. Working at Doha Academy provides excellent career progression opportunities to staff who are themselves ambitious, forward-thinking, and student-centred in their decision-making.This is an exciting time to join the Academy. Granted full Qatar National Schools’ Accreditation (QNSA) earlier in 2022, Doha Academy was also awarded full international accreditation with the New England Association of Schools and Colleges (NEASC) in November 2022 and has embarked on its highest “ACE Learning” pathway.We are currently recruiting for August 2023The school is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment.Our renumeration package includes:A tax-free, competitive salary;\nAnnual return flight to your home country (or equivalent travel allowance);\nFree bus transportation to and from school;\nFully furnished two-bedroom apartment with shared lounge and kitchen and on-site security;\nMedical cover.\nEnd of service gratuity.Skills",
    "Skills": [
        "As the group expands, we are keen to meet suitably qualified and experienced Secondary practitioners for whom teaching is a vocation. Candidates must possess a Bachelor’s degree (face-to-face study) in their subject specialism, and a recognized teaching qualification. Doha Academy predominantly recruits teachers from the UK and Ireland, although teachers with a teaching qualification from other parts of the world will also be considered.",
        "Married teaching couples are very welcome to apply. We do recruit NQTs (ECTs), although we do not currently provide the ECT support program.",
        "Ideal candidates will be:",
        "First language English speakers;\nPassionate about their subject and how it is best taught;\nDetermined to support the needs of all students;\nAdaptable to life abroad, and resilient;\nPositive team players;\nCulturally respectful and sensitive;\nCommitted to their own professional development."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Nationality": "Australia; Canada; Ireland; New Zealand; South Africa; United Kingdom"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}