{
    "Job ID": "4725433",
    "Description": "Job Purpose:To manage and execute the digital and social media strategy, it's properties and subsidiaries and to ensure that the social media platforms are updated with the latest developments. To manage the website, digital branding and advertising across all digital platforms and its regional offices.Key ResponsibilitiesØ Develop creative social media platform content regarding marketing plan that promote the company and its products & services.Ø Develop, implement and manage multiple social media platforms (Instagram, LinkedIn, Facebook, Twitter, etc.).Ø Build and execute social media strategy through competitive research, platform determination, benchmarking, and messaging and audience identification.Ø Set up and optimize company pages within each platform to increase the visibility of the company’s social content, including content marketing-based strategies that organically increase engagement with targeted audience.Ø Stay up-to date with social media trends and best practices and implement the same across the various social media platforms.Ø Monitor SEO and web traffic metrics and ensure integration between social media campaigns and the website and/or landing pages by working closely with the Development team.Ø Perform research, monitor analytics and analyses current benchmark trends and audience preferences.Ø Maintain social media presence and ensure consistent audience engagement takes place across all digital channels.Ø Brainstorm new and creative growth ideas for product development and management.Ø Measure and report on the performance of all digital marketing campaigns and accounts' performance.Ø Enhancing brand awareness within the digital space as well as driving website traffic and acquiring leads/customers.Ø Work closely with the Head of Sales to ensure unified campaign messages throughout the customer conversion pipeline from the generated leads.Ø Work closely with the Design team in order to provide direction and constant feedback to the team that is in alignment with the marketing strategy.Ø Work closely with the Sales team to ensure that inquiries on different platforms are answered in a timely manner and according to a joint strategy between the marketing and sales team, also ensure the team is given a regular brief on the currently active campaigns.Skills",
    "Skills": [
        "1.    Requirement open for all Arab nationals",
        "2.    Required Bachelor's degree equivalent in Marketing, Business Administration or Social Science",
        "3.    3-5 years of prior experience",
        "4.    Knowledge of online marketing channels.",
        "5.    Previous experience in a similar digital marketing role.",
        "6.    Experience in Kuwait marketing strategies.",
        "7.    Relevant experience including CMS, SEO, PPC, e-marketing, social media and analytics",
        "8.    Knowledge of current online marketing trends and best practices.",
        "9.    Proven track record of managing and executing campaigns using native platform tools such as Facebook Ads Manager/Power Editor, Google Ad Words, and Twitter Ads"
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}