{
    "Job ID": "4725764",
    "Description": "We are looking for an experienced Chief Financial Officer for our company in KSA. The CFO will work remotely from the company offices in Jordan and conduct visits to the company offices in KSA whenever is required.The CFO will guide the financial systems that empower the group. Our client is searching for an experienced CFO to join its team of high-performing professionals to help keep the group finances insightful and instrumental to its continued success. The CFO will have both a day-to-day and ongoing impact on group operations, helping to analyze, strategize, and grow its financial position. This seasoned strategist not only understands current accounting practices and trends, but has proven experience raising capital and adapting to change–both in growth and downsizing. As a member of its senior management, CFO will be comfortable in a leadership role that demands clear communication and presentation skills.ResponsibilitiesResponsible, either directly or by managing staff, for all cash management, investments, insurance, budgeting, and financial reporting, helping to drive the company’s financial strategy and hiring needs\nCoordinate the development of the annual operating, capital, and program budgets, and reporting against the same\nEnsure cash flow is compatible with company operations, by overseeing the day-to-day accounting, recording, reporting, and internal control activities of the organization\nLead the development and use of best-practice policies, practices, and tools that ensure a well-controlled yet flexible organization with strong fiscal management, project management, cross team communications and workflow\nEnsure compliance with the law and company’s policies\nComply with laws and local financial requirements by studying existing and new legislation, enforcing compliance, and taking action\nPerform risk management by analyzing the organization’s liabilities and investments\nDecide on investment strategies by considering cash and liquidity risks\nManage vendor relationships\nWork with the senior management to efficiently develop proposal budgets, provide access to project finance information, and manage contract/grant compliance and reporting\nResearch revenue opportunities and economic trends, analyze internal operations, identify areas of cost reduction and process enhancement\nMonitor performance with tracking, establish corrective measures as needed, and prepare detailed reports, both current and forecasting for earnings calls, the management team, and the rest of the companySkills",
    "Skills": [
        "BSc/BA in Accounting, Finance or relevant field; MSc/MBA is a plus\n10+ years of experience working with diverse jurisdictions / markets in big companies having a multicultural environment\nIn depth knowledge of corporate financial law and risk management practices\nExperienced in complex structures and diverse industries\nStrong leadership and organizational skills\nExcellent communication and people skills\nExcellent knowledge of data analysis and forecasting methods\nExceptional verbal, written, and visual communication skills\nUnderstanding of advanced accounting, regulatory issues, and tax planning\nCPA is a strong advantage"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Telecommunications",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}