{
    "Job ID": "4725209",
    "Description": "Handle all communication channels of the organization in a fluent and efficient manner.\nTrack the touring requirements and costs of the company's employees with the help of relevant reporting tools and software.\nDiscuss a detailed timetable of current and upcoming meetings with the top-level management to maintain timely addressed of crucial decisions.\nReceives incoming communication or memos on behalf of senior staff, reviews contents, determines importance, and summarizes and/or distributes contents to appropriate staff.\nProvides high-level administrative support and assistance to the Executive Director and/or other assigned leadership staff.\nPerforms clerical and administrative tasks including drafting letters, memos, invoices, reports, and other documents for senior staff.\nArranges travel and accommodations for executives.\nSchedules and attends meetings on behalf of executives, taking notes and recording minutes. \nPerforms office tasks including maintaining records, ordering supplies, and performing basic bookkeeping.\nPerforms additional duties as assigned by executives.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Excellent verbal and written communication skills.\nExcellent organizational skills and attention to detail.\nExcellent time management skills with a proven ability to meet deadline.\nBenefits other than salary in medical insurance , child education allowances.\n5 days of working and 2 days-off."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "Iraq; Sudan; Syria",
        "Degree": "High school or equivalent",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}