{
    "Job ID": "4725350",
    "Description": "Job SummaryWe are looking for an Aesthetician for our subsidiary company Synergy Healing Centre. You will be responsible for performing a variety of non-invasive facial and body treatments designed to increase, improve, and maintain the skin's appearance. Your work will be focused solely on skincare as it relates to general health and beauty. You should be well qualified to detect skin problems that may require medical attention and refer them to a dermatologist or medical professional. You will perform a wide range of services, from simple facials, exfoliations, chemical peels, microdermabrasion, moisturising treatments and pore cleansing.As an Aesthetician, you will provide exceptional services to the clients keeping their skin, face, and body healthy and attractive allowing them to enjoy an indulgent spa experience. To ensure success you should meet revenue goals, ensure client retention, and build a solid client base.Responsibilities :Provide high-quality facial treatments that address skincare concerns\nAdvise clients and suggest treatments related to their individual needs\nPerform skin assessments to identify problems and the right course of action\nWelcoming clients in a warm, friendly manner, accompanying them to and from treatment rooms, and thanking them sincerely on departure\nPerform face massages for therapeutic or relaxation purposes\nPerform facial extraction for blackhead removal\nMaintain confidentiality of client reports and notes\nEnsure safety, sterilisation of equipment and sanitation procedures are followed\nProvide information to clients on salon therapies, services and products\nRecommend skincare products to clients\nRecommend a daily routine to clientsSkills",
    "Skills": [
        "Requirements/Skills:",
        "Diploma in Beauty Therapy or Cosmetics from an accredited institute\nAt least 3 to 4 years of experience as an Aesthetician or similar role\nMust have MOH Certified Licence\nMust adhere to all applicable local licensing laws and regulations related to the aesthetic services provided\nAble to provide consistent services and treatments\nAbility to communicate effectively with clients\nDeep knowledge of skincare technique\nAbility to make a client feel comfortable\nAbility to maintain client confidentiality"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 4",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Fujairah, United Arab Emirates",
        "Company Industry": "Other Healthcare Services; Hospitality & Accomodation; Personal Care Centers",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Beauty and Fashion",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}