{
    "Job ID": "4725563",
    "Description": "Developing and implementing creative strategies: Collaborating with the marketing team to develop and execute creative strategies that align with the marketing objectives and target audience.\nConceptualizing and designing marketing materials: Creating visual content, including advertisements, brochures, social media graphics, website designs, and other promotional materials that effectively convey the brand's message and engage customers.\nManaging and leading the creative team: Overseeing a team of designers, illustrators, photographers, and other creative professionals, providing guidance, feedback, and support to ensure high-quality deliverables.\nBrand management: Ensuring visual consistency and brand recognition across all marketing channels, maintaining brand guidelines, and monitoring the use of the brand's assets to maintain brand integrity.\nCollaborating with cross-functional teams: Working closely with marketing managers, copywriters, web developers, and other stakeholders to understand project requirements, meet deadlines, and deliver cohesive marketing campaigns.\nStaying updated with industry trends: Keeping up-to-date with industry trends, emerging technologies, and design best practices to bring fresh and innovative ideas to marketing campaigns.\nManaging budgets and resources: Planning and managing budgets for design projects, allocating resources efficiently, and maintaining cost control.\nMonitoring and optimizing the effectiveness of marketing materials: Analyzing and measuring the impact and effectiveness of marketing designs and materials, making data-driven decisions to improve future campaigns.\nEnsuring compliance: Ensuring that marketing materials comply with relevant legal, industry, and advertising regulations, including copyright laws, trademark guidelines, and data protection regulations.\nProviding creative direction: Working closely with internal stakeholders and external agencies to provide guidance and supervise the creative process, from concept development to final execution.\nThese responsibilities may vary depending on the size and structure of the organization, as well as the specific role of the marketing art director.\nSelect artistic elements needed for a project including photographs, illustrations, fonts, sound, etc.\nManage design staff, including graphic designers, illustrators, and set designers\nCoordinate project activities with workers in other departments\nCreate timelines and budgets for design projects\nApprove photographs, illustrations, and designs created by other professionalsSkills",
    "Skills": [
        "Creative Vision: Possess a strong and innovative creative vision to conceptualize and execute visually compelling marketing campaigns and materials.\nGraphic Design Expertise: Proficiency in graphic design tools and software (e.g., Adobe Creative Suite) to create stunning visual assets, including digital and print advertisements, brochures, social media graphics, and more.\nBranding and Identity: Ability to develop and maintain a cohesive brand identity across all marketing materials, ensuring consistency and brand recognition.\nMarketing Strategy: Collaborate with marketing teams to align creative concepts with overall marketing strategies and objectives.\nArt Direction: Direct and guide the creative team, including graphic designers, photographers, and videographers, to bring marketing campaigns to life.\nStorytelling: Skill in using visual elements and design to tell compelling stories that resonate with the target audience and communicate the brand's message effectively."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Hamra, Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}