{
    "Job ID": "4725151",
    "Description": "Key Responsibilities:Utilize your Interior Design expertise to assist customers in making informed decisions about our products and services.\nDemonstrate a solid understanding of the retail process and maintain a good knowledge of our product range.\nProficiently calculate prices, discounts, and any additional costs accurately.\nAchieve the required sales targets and work towards improving sales ratios.\nCultivate strong communication skills to establish trust-based relationships with customers.\nGreet and welcome customers into the store, offering guidance across different departments.\nProvide customers with precise information about product features, pricing, and after-sales services.\nAddress customer inquiries and concerns promptly and professionally.\nEffectively present comparisons between products, highlighting additional features and benefits to encourage purchase decisions.\nContribute to the preparation and implementation of various promotional activities to boost sales.\nOversee product recovery and replacement procedures as needed.\nCollaborate with the retail sales team to deliver excellent customer service, particularly during peak business periods.\nKeep customers informed about the latest offers, special discounts, and new product arrivals.\nRegularly report customer feedback to the store manager, enabling the continuous improvement of services.\nStay updated on the latest products and services, maintaining a high level of product knowledge.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Interior Design or a related field is preferred.\nProven experience in retail sales or customer service is an advantage.\nExcellent interpersonal skills and ability to establish rapport with diverse customers.\nStrong numerical and calculation skills to handle pricing and sales targets.\nDemonstrated ability to work in a fast-paced retail environment.\nProficiency in utilizing various software applications, including point-of-sale systems.\nFluent in English (additional language skills are a plus).\nFlexible schedule, including the ability to work weekends and holidays as needed."
    ],
    "Preferred": {
        "Residence Location": "Lebanon; Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}