{
    "Job ID": "4725872",
    "Description": "تنظيم المستودع: تنظيم تخزين المواد والمنتجات في المستودع بشكل مناسب وفقًا للإرشادات المحددة.\nاستلام الشحنات: استلام المواد الواردة من الموردين والتحقق منها وفقًا للفواتير والأوامر.\nإعداد الطلبات: تجهيز الطلبات الصادرة وتجهيزها للشحن والتسليم.\nإدارة المخزون: متابعة الكميات المتاحة في المخزون وتحديث السجلات والنظم بشكل منتظم.\nضمان الجودة: التحقق من جودة المواد والمنتجات وفقًا للمعايير المحددة.\nتوزيع المنتجات: تنظيم عمليات التوزيع وضمان تسليم المنتجات بأمان وفي الوقت المحدد.\nالتواصل: التواصل مع الفرق الداخلية والشركاء الخارجيين لضمان تنفيذ الطلبات بشكل سلس.\nإجراءات السلامة: الامتثال لإجراءات السلامة أثناء عمليات التخزين والتوزيع.\nحل المشكلات: التعامل مع أي مشاكل متعلقة بالمستودع وتقديم الحلول الفعالة.Warehouse Organization: Organize the storage of materials and products in the warehouse according to specified guidelines.\nReceiving Shipments: Receive incoming materials from suppliers and verify them against invoices and orders.\nOrder Preparation: Prepare outgoing orders and package them for shipment and delivery.\nInventory Management: Monitor available quantities in the inventory and update records and systems regularly.\nQuality Assurance: Check the quality of materials and products according to specified standards.\nProduct Distribution: Organize distribution operations and ensure safe and timely delivery of products.\nCommunication: Communicate with internal teams and external partners to ensure smooth order execution.\nSafety Procedures: Comply with safety procedures during storage and distribution operations.\nProblem-Solving: Handle any warehouse-related issues and provide effective solutions.Skills",
    "Skills": [
        "خبرة سابقة كمنسق مستودع أو وظيفة ذات صلة.\nمهارات تنظيمية وإدارة الوقت لإدارة العمليات اليومية بكفاءة.\nالقدرة على العمل بفعالية تحت ضغط وتنفيذ المهام بدقة.\nمعرفة جيدة بإدارة المخزون وإجراءات اللوجستيات.\nمهارات اتصال جيدة وقدرة على التفاعل مع الفرق الداخلية والعملاء.\nقوة بدنية للتعامل مع الحمولات الثقيلة والعمل في بيئة المستودع.\nمعرفة أساسية بأنظمة إدارة المستودعات وبرامج الحاسوب.",
        "Previous experience as a Warehouse Coordinator or in a related role.\nOrganizational and time management skills to efficiently manage day-to-day operations.\nAbility to work effectively under pressure and execute tasks accurately.\nGood knowledge of inventory management and logistics procedures.\nExcellent communication skills and the ability to interact with internal teams and customers.\nPhysical strength to handle heavy loads and work in a warehouse environment.\nBasic knowledge of warehouse management systems and computer programs."
    ],
    "Preferred": {
        "Residence Location": "Jeddah , Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}