{
    "Job ID": "4725347",
    "Description": "Sourcing and Vendor Management: Identify and evaluate potential suppliers, establish relationships, and negotiate contracts to ensure the best terms and conditions for the company.\nPurchase Requisitions: Review and process purchase requisitions, ensuring they are properly authorized and in compliance with company policies and budgetary guidelines.\nPrice and Quality Comparison: Conduct market research and price comparisons to select the most cost-effective suppliers without compromising product quality.\nPurchase Orders: Prepare and issue purchase orders to selected suppliers, confirming order details, delivery dates, and quantities.\nOrder Tracking: Monitor and track the status of purchase orders, ensuring timely delivery of goods and services.\nSupplier Performance Evaluation: Evaluate supplier performance based on quality, delivery, and service, and provide feedback to improve future partnerships.\nInventory Control: Coordinate with the inventory management team to maintain optimal stock levels and avoid stockouts or overstock situations.  Skills",
    "Skills": [
        "Over 2 Years of working experience in purchasing positions,\nvery professional skills in equipment, fittings, valves, instruments, engineering equipment and other products related to petroleum pipelines, or employees who have worked in the production plant of petroleum pipeline materials above 2 years. (Have related vendors sauces and skills to sauce material vendors).\nGood English speaking, if can speak Arabic is perfect\nGood communication skills and office soft skills;\nWell-educated and good behaviors.\nHave Car License,\nfamiliar with WORD, EXCEL & related basic Office Software."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Dammam, Saudi Arabia ; Khobar, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 26 Max: 48"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Hardware & Building Materials; Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "2"
    }
}