{
    "Job ID": "4725388",
    "Description": "Taiba Hospital invites qualified candidates to apply for the position of 'Radiology Technician' with sound experience and training in CT & Mammogram proceduresResponsibilities:Works independently, performs all routine and specialized Radiography procedures, and associated responsibilities, as dictated by the workload in the roistered area. Ensuring the necessary patient care is provided to patients of all ages.\nActs independently in the assessment of referrals for Radiography examinations, taking full responsibility to reduce unnecessary ionizing radiation exposure of patients and utilizing skills to assess a patient's condition, often acute, decide on an appropriate method to obtain a diagnostic image from a range of options.\nKeep track of and organize patient records.\nAdheres to departmental and applicable organizational policies, procedures and regulations relevant to the Radiography patient care team. Maintains accurate and concise records of all imaging received by the patient using the appropriate systems.\nParticipates in and complies with quality improvement programs and competency assessment initiatives for the Diagnostic imaging services.\nArranging with the regulatory authority for inspections, seminars, training courses or any other activity related to radiation safety.\nEducational Requirements\nPreferably an associate's or bachelor's degree or Diploma in Radiation Technology\nTraining Certifications in Mammogram & CT will be an assetSkills",
    "Skills": [
        "Extensive functional knowledge and clinical experience in Diagnostic Radiography, Mammogram and/or CT\nKnowledge and experience of Radiography Information Systems (RIS) and Picture Archiving Communications Systems (PACS)\nMinimum of 3+ years clinical experience in diagnostic Radiography imaging\nStrong Communication skills\nExcellent analytical skills ",
        " "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 20",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}