{
    "Job ID": "4725706",
    "Description": "متابعة أجهزة الشبكة ومبيعاتها وايداعاتها يوميا في الفروع المحددة من الإدارة المالية، وفي حالة حدوث اي خلل في الايداعات الخاصة بها يتم التواصل مع مدير الفرع اولا للتأكد من كافة الادخالات ثم يتم اعادة مراجعة الايداعات الخاصة بها وإذا كان الخطأ من البنك يتم التواصل معهم\nايداع النقدية الخاصة بالأنشطة المحددة من قبل الإدارة المالية\nمراجعة يومية للمبيعات حسب ملفات الاكسل للفروع (الرياض + القصيم + خميس مشيط) ومقارنتها بالنظام الإلكتروني وتحديد الفروقات بينهم وتعديل اي خلل بها وعمل التسويات اللازمة لذلك\nمراجعة الحوالات البنكية الواردة للبنوك يوميا لكافة الفروع حسب تحديد وتوزيع الإدارة المالية\nمتابعة حركة الصناديق (للمناديب والمعارض والمستودع الرئيسي) والتأكد من توريد النقدية كاملة الى الصندوق الرئيسي في الفرع الرئيسي (دعاية الرياض) وفي فرع (دعاية القصيم وخميس مشيط)\nمراجعة تقرير مدراء المنتج/ فروع المرسل يومياً\nمتابعة الشيكات المستلمة من العملاء وادراجها بحافظه الايداع ثم عمل ايداع لها بالبنك\nإعداد أوامر الصرف (عهد+ مصاريف + تسديدات مستحقة على الشركة + حوالات خارجية وداخلية) ثم السداد على البنك، ويرسل بريد الالكتروني بذلك.\nإعداد الشيكات المنصرفة خارجيا على الاكسيل وطباعتها\nادخال المدفوعات على النظام المالي بعد تعميد اوامر الصرف وتحويلها وعمل اي تسويات إذا لزم الأمر\nادخال المقبوضات البنكية على النظام المالي وعمل اي تسويات في حال وجود خطأ بعد التفاهم مع المدير المالي.\nادخال المشتريات الخارجية والداخلية على السيستم وتحميلها بكافة المصاريف التي تم صرفها عليها بعد مراجعة كل تفاصيلها وتعديل اي اخطاء بسندات الاستلام\nإعداد الخصومات والتسويات التي تخص العملاء والتي تم تعميدها\nادخال العمليات التي تتم بين الفروع\nرفع تقرير بنتيجة مراجعة تقرير المبيعات يوميا\nمطابقة حسابات الموردين والدائنون وعمل قيود التسوية الخاصة بذلك\nإعداد مصادقات العملاء ومطابقة حسابات العملاء وعمل قيود التسوية الخاصة بذلك ومتابعة اجراءات المطابقة مع مدير المبيعات كل ثلاثة أشهر\nتسوية حسابات المخزون ومطابقته مع الحسابات\nإعداد قيود تسوية الحسابات الجارية ومطابقتها مع كافة الفروع\nتسوية المصاريف المقدمة والمستحقة كل ثلاثة أشهر\nادخال قيود مخصص نهاية الخدمة\nادخال اهلاك الأصول\nتوزيع المصروفات الشاملة والمركزية على الفروع كرواتب المحاسب (نسبة وتناسب) والتأمينات الاجتماعية والمصاريف التي تخص النشاط .... الخ\nمطابقة ميزان المراجعة وعمل كافة التسويات لتطابقه\nتسهيل عمل المراجع القانوني بتوفير التقارير او الخطابات او أي طلبات من اي فروع / منتج.\nتنفيذ تحليلات مالية للعملاء والمخزون وايفاد مدير المبيعات او مسئول المستودع في حالة ظهور اي خلل وكذلك تفيد في عملية المتابعة\nالمشاركة في الجرد نصف سنوي وجرد أخر العام وادخال الجرود على النظام\nاعادة مراجعة حوالات العملاء الواردة على البنوك والتأكد من ورودها للبنك\nمطابقة نقاط بيع تحت التحصيل وعمل التسويات اللازمة وعمل مصادقة له\nمطابقة الشيكات تحت التحصيل وعمل التسويات اللازمة وعمل مصادقة له\nمطابقة الحسابات الجارية شهريا\nإعداد عمولات المبيعات بعد مراجعة تقرير المبيعات على الاكسيل الخارجي ومطابقته مع السيستم\nإعداد الاقرار الضريبي بعد مراجعة كافة تفاصيل المشتريات والمبيعات والمصروفات\nمتابعة الايجارات وتسديدها\nإعداد التقارير الخاصة بفحص الضريبة والميزانية التي تطلب من هيئة الزكاة\nإعداد مسير الرواتب وخصم السلف واي فواتير مستحقه او جزاءات او حسميات على الموظف وادخال الرواتب بعد اعتمادها على ملف رواتب البنك\nادخال سداد الرواتب لكافة الفروع\nتسجيل التامين الطبي على الموظفين\nتصفية العهد خارجيا وعمل امر الصرف الخاص بها والشيكات او التحويلات وادخالها على السيستم\nتصفية العهد خارجيا وعمل امر الصرف الخاص بها والشيكات او التحويلات وادخالها على النظام\nإعداد التقارير المالية والمحاسبية والعروض التقدمية حسب الطلب والحاجة\nالعمل ضمن فريق العمل بالإدارة والتعاون على انجاز الأعمال\nالحفاظ على سرية وخصوصية المعلومات المالية\nالمشاركة في اعمال لجان الشركة بهدف الانخراط في عمليات التطوير\nالقيام بأية مهام ومسؤوليات أخرى مماثلة وتقع ضمن نطاق اختصاصه وبناء على تكليف من الرئيس المباشرSkills",
    "Skills": [
        "بكالوريوس محاسبة | ترخيص SOCPA\nالمهارات الشخصية - مهارات الابتكار - مهارات تقنية - مهارات التواصل - مهارات التنظيم - حس المسئولية"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}