{
    "Job ID": "4725720",
    "Description": "Role & Responsibilities:Select and implement internationally recognized Project Management Information Systems required to support project controls reporting.\nEnsure the timely preparation and exchange of project information between the project functional groups including engineering, procurement, logistics, accounting, individual Project Sites, sub-contractors.\nActively participate on the Project Management Teams and take a lead role in the following:-         Planning and managing project schedules and budgets.-         Monitoring all sub-contractors performance and actual progress against the project schedule.-         Identifying all cost and/or schedule trends that may adversely affect project progress, contractual commitments, cost and earned value forecasts.-         Regularly updating the project schedule and providing 6-8 weeks schedule forecasts/ outlooks.-         Assisting the Project Manager, Contracts Specialist, and Site Managers to resolve change orders and critical path issues with the sub-contractors.-         Where appropriate, recommending remedial measures to resolve project variances.Actively participate in site meetings and provide proactive ongoing support to the site management teamsSkills",
    "Skills": [
        "Candidate Profile:",
        "Engineering degree supplemented with specific training in project scheduling and related software such as Primavera., dBase 4 or equivalent.\n10 to 15 years experience of construction and project planning experience, ideally on large scale commercial, residential and industrial projects",
        "-         A portfolio of skills in areas such as:",
        "-         Cost control and scheduling.",
        "-         Project Management Information Systems.",
        "-         Project Scheduling and Tracking Software.",
        "-         Project Documentation Processes.",
        "Capable of providing technical leadership in an multi-disciplinary construction environment.\nExcellent communication skills (written reports).\nAbility to work with a diverse, multi-cultural workforce."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Residence Location": "Qatar",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Fit-Out & Joinery",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}