{
    "Job ID": "4725690",
    "Description": "Job Summary:The Employee Relations Unit Head will facilitate and manage employee relations on behalf of the company.Supervisory Responsibilities:Trains and oversees the work of assigned staff.\nConducts performance evaluations that are timely and constructive.Duties/Responsibilities:Analyzes information and data necessary to define and discern cost and policy implications of negotiations and disputes. This may include management and union proposals, pay scales and wages, benefits, working conditions, and other mitigating circumstances.\nUses surveys, interviews, and other studies to conduct research regarding human resource policies, compensation, and other employment issues. After analyzing the information, makes recommendations on changes.\nResearches and explains laws and legal affairs concerning employment to managers, supervisors, and employees.\nAdvises and trains managers and supervisors in best employee relations practices and strategies for managing supervisor problems and employee grievances. Develops further training as needed.\nRepresents organization in contract negotiations, meetings, and negotiations with employee and labor organizations.\nCollaborates with leadership on matters of policy and terms of memoranda of understanding before and throughout negotiation process.\nCollaborates with legal counsel and departments in the preparation for and participation in negotiation with employee and labor groups.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Education and Experience:",
        "Bachelor's degree in Employee Relations, Human Resources or related field required.\nFour years of professional human resource administration, including two years in employee relations preferred OR its equivalent through training, education, and other experience.\nSHRM-CP or SHRM-SCP preferred.",
        "Required Skills/Abilities:",
        "Excellent oral and written communication skills.\nThorough understanding of state and federal laws concerning labor relations.\nAbility to comprehend, interpret, and apply the appropriate sections of applicable laws, guidelines, regulations, ordinances, and policies.\nThorough understanding of negotiation techniques.\nThorough understanding of dispute resolution and compensation administration.\nAbility to remain tactful, calm, and persuasive in controversial and/or confrontational situations."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}