{
    "Job ID": "4725582",
    "Description": "Sales Director FMCG Leader - Global BrandsLooking for a unique opportunity, bored of the standard commercial role selling sugared water or starchy snacks? If so eMagine FMCG have a fantastic opportunity to join global powerhouse who have disrupted the global FMCG market. The company are known for carrying some of the world's favourite brands are known for bringing moments of joy to millions across the world daily.Due to growth and expansion they are scaling up their Dubai operation and this is your chance to grow alongside them. You will be managing a global team from the heart of Dubai and will be in charge of driving revenue and long term profitability for the company.We are looking for commercially astute business leader who can manage a team as well as be the 'pace setter' for business opportunities.Strong Strategic Planning with the ability to develop and execute effective sales strategies. This includes analyzing market trends, identifying growth opportunities, setting sales targets, and devising plans to achieve them. is key, we are looking for a thinker as well as a doer. A proven track record of sales team leadership which involves providing clear direction, setting performance expectations, coaching, and fostering a positive sales culture to maximize team productivity and results.Additionally understanding Market Analysis and Consumer Insights, Key Account Management an Sales Forecasting and Budgeting are all needed to succeed in this role.For a full and private consultation reach out today. Only shortlisted candidates will be contacted.Skills",
    "Skills": [
        "You will work cross functionally to create and invest for the growth strategy that includes all elements of the customer requirements. You will have a large team of direct reports, so a large part of this role will be leading and coaching the team to ensure best in class performance!"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "1"
    }
}