{
    "Job ID": "4725254",
    "Description": "QA/QC Inspector (Night Shift) Job Responsibilities:Perform quality control checks and generate QC reports for incoming and outgoing products to ensure that they meet quality and safety standards in accordance with GSO's regulations.\nAnalyze possible reasons for product defects and quality lapses.\nAnalyze possible reasons into process deviations and for product defects and quality lapses.\nDevelop SOPs and infrastructure requirements for laboratories and optimal calibration standards in line with good laboratory practice (GLP) requirements.\nDevelop inspection and testing protocols for materials, products, and packaging.\nDevelop methods for the testing quality of materials, products, and packaging.\nDevelop product and process quality metric reports.\nDevelop sampling plans for quality control purposes.\nDevelop standard operating procedures (SOPs) that are align with regulatory requirements, industry guidelines and organization’s policies.\nEstablish SOPs and conditions for handling, storage, and preservation of samples.\nImplement plans and strategies to support provision of safe food products.\nInspect facilities, equipment, products, or production lines to ensure food is prepared according to safety regulations and situational health sections.\nInvestigate technical faults and practices that impact laboratory equipment operations.\nLead quality and food safety related audits in factory and outlets.\nLead traceability investigations on the source of quality lapses and other product issues.\nOversee corrective and preventative actions (CAPA) implementation and documentations with other departments.\nParticipate in quality management system reviews and promote quality and food safety policies to all personnel.\nReview reports and develop guidelines and standard practices for data documentations and analysis.\nSpecify the protocols and laboratory infrastructure and equipment to be inspected and tested.\nVerify alignment of sampling documentation, testing activities and procedures with established protocols to identify issues.\nVerify quality control (QC) records, test results and reports for regulatory authorities.\nConduct training for the employees on different food safety, HSE and GMP topics.\nInspect the received and dispatched raw materials and finished products and hold whatever is not within safe specifications.\nConduct checkups on dispatching trucks verifying the safe food transporting parameters.\nConduct QC inspection for customer feedbacks.\nCompile/archive QC report related documents.\nAssist sales or other departments with product specification, certification, and quality related document requests.\nPerform sensory evaluation for incoming raw materials to ensure consistent quality and for product improvement.\nPerform audits on raw material suppliers.Skills",
    "Skills": [
        "Must have a transferable visa 18.\nMinimum 1 year of experience.\nFluent in English.\nMust have a degree in the related field."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}