{
    "Job ID": "4726113",
    "Description": "Project ManagerLocation: KazakhstanSalary: Competitive market relatedOur Client is Construction Company established in more than 5 decades ago and offer all types of services related to the installation of pipelines and relevant ancillary facilities for the transmission and distribution of oil, gas and water on an international basis.Reporting to the Country Manager yo will be responsible for coordinating all the activities and information concerning the project, cooperating with HO Offices and Project staff. Additionally, having hierarchical responsibility over the Engineering, Procurement and Construction Manager.Required to ensure that the Job Orders acquired are executed in full compliance with the project’s technical objectives, the contractual objectives in terms of costs and times.Assist in the management and supervision of all the construction activities of the project and ensure that the contractual commitments are met.ResponsibilitiesInterface with Construction Manager and Clients, including attending project meetings.\nMaintain relationships with Top Management of the Clients.\nEnsure the correct application of the terms and conditions of the ongoing contracts.\nMonitoring of project resources identifying potential optimizations.\nPrepare reports, consolidating progress and highlighting areas of concern.\nMonitor the overall project/s performance in terms of scheduling, cost, quality and HSE requirements.\nOversee budget and ensure financial accountability.\nIdentify potential contractual Change Orders and Claims, and coordinate their preparation: negotiate with\nClient and control the pricing variations of the contract.\nForesee clients’ requirements and be able to provide appropriate and precise solutions.\nSupport the Procurement and Engineering Teams.Skills",
    "Skills": [
        "Requirements",
        "Certified Project Management Professional PMP.\nEngineering degree.\nGood knowledge (written and spoken) of English and preferably Italian too.\nAt least ten years' experience in a similar position in Oil & Gas sector for an EPC project.\n15 years relevant experience in the oil & gas or petrochemical industry\nPrevious experience in gas compressors would be considered as an advantage\nGood interpersonal, strong communication skills and a results-orientated individual is a must.\nAbility to motivate Team and manage personnel.\nStrong Organizational Skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Aqsay, Kazakhstan",
        "Company Industry": "Construction & Building; General Engineering Consultancy; Industrial Engineering & Automation",
        "Company Type": "Unspecified",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}