{
    "Job ID": "4726192",
    "Description": "Drive sales initiatives for a fast-growing global SaaS tech product companyNOTE:We are currently accepting applications only from people with full working rights to live and work in the UAE or KSA.About Anchanto:Anchanto helps all businesses to exploit the full potential of e-commerce. Our suite of SaaS Products enables companies globally to springboard omnichannel sales, scale fulfilment operations, and use intelligent data to grow their e-commerce, logistics & warehousing activities. Leading, brands, distributors, retailers, and logistic enterprises such as L’Oréal, Decathlon, HP, or DHL Supply Chain rely on our technology to scale their local and global e-commerce operations.Headquartered in Singapore and with more than 10 local offices across Asia-Pacific, Middle East and Europe, we are growing rapidly and looking for ambitious people to join our teams to build the future successes of Anchanto.The role: Business Development Manager – Middle EastYou will manage the Business Development operations in Middle East with ownership of generating and converting pipeline of customer for Anchanto’s products.As a Business Development Manager, you will focus on the Enterprise segment in the Retail and Logistics sector: Brands, eCommerce Sellers & Retailers, 3PLs, Warehouses and Postal Associations looking to equip themselves with eCommerce capabilities.Responsibilities:Direct sales Development for software sales to enterprises (Brand Principals, Distributors, 3PLs, Warehousing Companies, E-distributors, Retailers) to build strong B2B SaaS business in Middle East\nLead generation for a funnel pipeline: Manage entire sales cycle (as individual contributor) steps such as cold call, LinkedIn emails, personal networking etc.\nUnderstand Customers' current Business and Operational processes to propose the right fit of SaaS products, Understanding the customer pain points, Map to Solutioning\nDemoing the Product/Solution: Product introduction SaaS platform demonstration, explanation of key technical and functional capabilities, Understand and consult on a strategic and business level, available integrations and flows\nCompile reports for management showing results (ROI) reports on customer needs, problems, interests, competitive activities, and potential for new products and services.\nAssist with Contract Closure: follow-up call, sharing updates and assisting with proposal, pricing negotiation, contract signing, on-boarding and account handover to global account management teams\nStructured and organised to manage and update the CRM tool for effective Sales Pipeline managementSkills",
    "Skills": [
        "Fluent in both Arabic and English\nMinimum 3-5 years of experience in B2B Business Development in IT and SaaS enterprise solutions,\nExperience with E-commerce Sellers, 3PL, Brands and Retailers in Middle East\nDemonstrated ability to engage and influence C-level executives\nExcellent verbal and written communication skills in Arabic and in English\nStrong presentation skills and the ability to articulate complex concepts to cross-functional audiences.\nProactive to source leads from partners, own research and other channels.\nAbility to generate qualified leads and excellent cold calling skills to engage accounts\nPossess the technical ability to explain Cloud/SaaS Solutions, Integrations, Retail, Omni-channel and eCommerce Fulfilment flows.\nUnderstanding of Value Based Selling and translate it into Commercial Agreements\nDemonstrable research skills along with excellent Listening skills\nSelf-starter and should be able to proceed with minimal supervision"
    ],
    "Preferred": {
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Internet & E-commerce; Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}