{
    "Job ID": "4726114",
    "Description": "Prepare accurate cost estimates for construction projects based on architectural drawings, specifications, and other relevant documents. Collaborate with the project team to establish project budgets and monitor expenditures throughout the project lifecycle.• Perform detailed quantity takeoffs from construction drawings and specifications to determine the quantities of materials required for each project. Measure and record quantities accurately to inform cost estimates, bill of quantities, and procurement activities.• Prepare and analyze tender documents, including bills of quantities, specifications, and contract terms. Assist in the procurement process, which may involve obtaining quotes from suppliers and subcontractors, evaluating bids, and negotiating prices to ensure competitive pricing and cost-effectiveness.• Prepare and issue requests for quotations (RFQs) or requests for proposals (RFPs) to potential suppliers. Coordinate the bidding process, evaluate received quotes/proposals, and analyze the commercial and technical aspects to select the most suitable vendors.• Negotiate contracts, pricing, and terms with suppliers to secure favorable agreements. Ensure that contracts align with project requirements, legal considerations, and company policies. Collaborate with legal and finance departments to review and finalize contract terms and conditions.• Monitor project costs and provide ongoing cost analysis to ensure adherence to budgets. Identify cost-saving opportunities, value engineering options, and potential risks that may impact project profitability. Implement effective cost control measures to manage variances and optimize project financial performance.• Assist in contract preparation, review, and negotiation. Provide advice on contractual matters and assist in contract administration activities, such as change order management, variation assessment, and claims analysis. Ensure compliance with contract terms and conditions.• Prepare and review payment applications from subcontractors and suppliers. Evaluate progress claims and validate the quantities and costs claimed against project milestones and deliverables. Coordinate with the finance department to process timely payments and resolve payment-related issues.• Generate accurate and timely cost reports for project stakeholders. Prepare cost forecasts, cash flow projections, and financial statements. Provide financial analysis and reports on project performance, including cost deviations, risks, and potential impacts on profitability.• Collaborate with the project team to identify value engineering opportunities without compromising quality. Propose alternative materials, construction methods, or design modifications to optimize cost-efficiency while maintaining project requirements and standards.• Identify and assess potential risks and uncertainties related to project costs. Develop risk mitigation strategies and contingency plans to minimize the impact of unforeseen events on project budgets and timelines.Skills",
    "Skills": [
        "Understanding of engineering science and technology.\nProficient in building long-lasting relations along with a knack for developing a productive team.\nIn-depth knowledge of forecasting, project management, and surveying by effective evaluation of client-side requirements.\nWell-versed in quantity surveying and all the vital parameters associated with the field."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}