{
    "Job ID": "4726864",
    "Description": "RPA UI Path developer UiPath developer\nWeb based, Desktop, SAP\nDomain automation\nKnowledge on Document understanding\nExperience on webservice, API calling form UiPath\nOrchestrator –Experience on orchestrator\nREFramework – Good Knowledge\nEmail – Having experience on email automation\nQueue\nDynamic schedule\nPdf extractionSkills",
    "Skills": [
        "RPA UI Path developer ",
        "UiPath Development: Proficient in using UiPath's RPA platform to design and develop automation workflows, bots, and robots.\nProcess Automation: Experience in identifying, analyzing, and automating business processes using RPA technologies to achieve efficiency and scalability.\nTechnical Acumen: Strong understanding of RPA concepts, workflow design, integration, and customization within the UiPath ecosystem.\nBusiness Analysis: Ability to analyze business processes, gather requirements, and translate them into technical specifications for automation.\nProblem-Solving: Aptitude for identifying automation opportunities and implementing effective solutions to optimize workflows and overcome process challenges.\nUiPath Orchestrator: Proficient in managing and deploying bots using UiPath Orchestrator, including scheduling, monitoring, and exception handling.\nProcess Optimization: Capability to review existing processes, identify inefficiencies, and suggest process improvements for automation.\nScripting and Coding: Knowledge of programming languages like C#, VB.NET, Python, or JavaScript to enhance and customize automation workflows.\nIntegration Skills: Experience in integrating UiPath with other applications, databases, and APIs to enable seamless data flow."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 11",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}