{
    "Job ID": "4726940",
    "Description": "Key AccountabilitiesResponsible to follow and monitor operations plan across the various projects.\nMonitor LPOs for all repairs and maintenance works in CB Alternative assets buildings and properties.\nReviewing all FM reports (Technical report, completion report, damage report, incident report, etc...).\nMonitor and keep records of all contracts.\nMonitor OPEX and CAPEX budget utilization.\nHandle the coordination with Procurement.\nSubmission of monthly financial reports such as but not limited to budget utilization, accruals, spend category and payment schedules/status.\nProcess vendor invoices for all completed maintenance and repair works.\nOversee and supervise the QHSE. Ensure that all employees are performing their tasks safely, correctly, efficiently, and effectively.\nExperience in QCD permit requirements and Renewal process.\nMeet and exceed targets set by upper management.\nReview and monitoring of current processes to optimize efficiency.\nReviewing and approving the PPM plan with making sure to meet the standards.\nReview commercial and technical proposal.\nMonitor and report on budgets to the line manager as per the agreed timelines and reporting formats.\nEnsure thorough monitoring and control of the FM documentation in order to secure the compliance with quality standards and meeting the stakeholders’ needs.\nMonitor KPI for various vendors and make sure are met as a minimum.\nContribute to the identification of opportunities for continuous improvement of processes and practices considering ‘international leading practice’, improvement of business processes, cost reduction and productivity improvement.\nFollow all relevant departmental policies, processes, standard operating procedures, and instructions so that work is carried out in a controlled and consistent manner.Skills",
    "Skills": [
        "Education",
        "Bachelor’s degree in Engineering or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}