{
    "Job ID": "4726944",
    "Description": "Key AccountabilitiesReceiving the transferred files along with original documents from related business, check it, sign the hand over form, and send it to Paralegal officer.\nDrafting, reviewing and initiating all the legal cases filing by CB against the customer or third party from handing over step until closing the case by either full recovery or amicable settlement including all grievance and Appeal before all type of court and committees.\nInvestigating, reviewing and responding all the cases and claims filed against CB to protect CB’s right and avoid any legal risk could be raised against CB.\nProviding sound legal advice to all Business unites.\nNegotiating the amicable settlement with customers and ensure that the best outcome will be in CB’s favour and obtain the required approvals to do so.\nRepresting CB before all governmental and semi-governmental authorities, public prosecution , police station, court,committees and expert appointed by the court etcOther AccountabilitiesHandling and managing the recovery process before the Enforcement court to ensure that the Judgment has been executed and the full recovery has taken place.Managing and supervising the External Law Firm deliverables to ensure the best outcome.\nConsulting the head of Litigation for recommendation for all the above tasks.\nPreparing monthly report for all cases assigned to him in the format requested by the Head of Litigation.\nLiaise with Business Unit to Collect and analyse required information mandatory for our defence.\nFollowing up and assisting the external lawyer by providing required information & documents.Skills",
    "Skills": [
        "Education",
        "Bachelor’s Degree, in Business-related major"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}