{
    "Job ID": "4726939",
    "Description": "Key AccountabilitiesWork closely with internal stakeholders and/or external service providers to ensure successful execution of assigned project(s).\nManage project issues taking actions to ensure their quick resolution and escalate the major issues to superiors to maintain project continuity and efficiency.\nDevelop, share and ensure compliance with the project plans developed for managed projects in order to ensure that projects are executed profitably and yield the required results.\nManage the process of design review of project layouts and any changes that would come up within the project lifecycle in order to ensure effective project execution.\nImplement the project management standards methodology and process from project initiation to the close out, in order to ensure that the execution of projects is in line with the desired results.\nEnsure effective project information management so that it is easily accessible to other concerned parties / individuals.\nEnsure cost effectiveness of projects while retaining the design concept guidelines.\nMonitor and report on project progress and budgets to superiors as per the agreed timelines and reporting formats.\nOversee the work of external service providers on an ongoing basis and throughout the life cycle of the projects in order to ensure that CBQ optimize external support.\nCommunicate with the contractors for pricing of minor layout changes and managing the process till the completion stage.\nEnsure thorough monitoring and control of the project’s quality in order to secure the compliance with CBQ quality standards and meeting the stakeholders’ needs.Skills",
    "Skills": [
        "Education",
        "Bachelor’s Degree, preferably in Business-related major"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}