{
    "Job ID": "4726582",
    "Description": "Start up Financial consulting office is looking for an experienced Financial consultant in Jeddah. Job descriptions:•Provide strategic financial advice and consulting services to small and medium-sized businesses•Develop financial plans and strategies to help clients achieve their business goals•Analyze clients' financial statements and operations to identify opportunities for improvement•Recommend and implement financial solutions like expense management, cash flow optimization, and budgeting•Recommend investment options and manage investment portfolios for clients•Guide clients through financing options like loans, lines of credit, and equity financing•Help clients streamline bookkeeping and accounting systems•Assess risks and implement strategies to mitigate financial risks•Forecast future financial needs and develop pro forma financial models•Advise on compliance with financial regulations•Act as a trusted advisor for clients on all financial matters affecting their businesses•Build and maintain long-term relationships with clients•Stay up to date with financial and accounting industry best practices, standards, and technologies•Produce reports, presentations, budgets and other materials to communicate findings and recommendations to clients•Maintain accurate records of client accounts and transactions•Develop and implement plans to improve profitability, reduce costs, and boost efficiency•Coordinate with other professionals like bankers, accountants, and attorneys on behalf of clients•Work with clients throughout succession planning, exit strategies, and business transitions•Grow client base by developing new business through networking, referrals and prospecting•Maintain and expand professional network to generate new opportunities and clients•Have established relationships and connections within the small business and entrepreneur communities.Important note: This is a commission-based role where income is generated from success fees, commissions and markups rather than a traditional salary.Skills",
    "Skills": [
        "Time management skills: You should have excellent time management skills to manage your workload effectively and prioritize tasks.\nHave 5+ years of experience in finance, accounting, or related field OR a relevant degree \nExcellent analytical skills, research skills, communication skills and people skills\nStrong work ethic, good judgment, and ability to prioritize and manage multiple clients simultaneously\nMust have microsoft office and financial modeling skills.\nDemonstrating excellent time management skills to effectively manage workload and prioritize tasks.\nExhibiting exceptional customer service skills to provide excellent service and support to clients.\nUtilizing strong financial analysis skills to evaluate investment opportunities and identify potential risks."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Accounting; Financial Services; Business Consultancy Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}