{
    "Job ID": "4726096",
    "Description": "Are you curious by nature? Do you have a knack for fact-finding? Are you passionate about diving deep into details? Come join our team as an Investigation Specialist! Amazon is looking for a sound-judgment individual to join us as an Investigation Specialist! You will evaluate transactions and safeguard Amazon's global customer base, profitability, and brand while maintaining a high bar of customer experience. We are specifically seeking applicants fluent in English to support our global operations teams. Our Mission is to strive to guarantee customers a delightful shopping journey on Amazon by safeguarding listings discoverability and guaranteeing that when customers do place an order, they can have a worry-free experience and receive authentic and safe products. In this role, you will investigate suspicious activity and behavior that could pose a risk to the company and its customers. Using your excellent domain depth on the investigation’s lifecycle, you will be expected to take the appropriate actions on both micro and holistic investigations. By working with your peers, managers and support teams - you will be able to address both ambiguous investigations scenarios and situations that are not clearly defined in your SOPs. You will also be provided opportunities to calibrate with peers, formulate improvement ideas and make meaningful contributions to your team in the form of projects or ad hoc tasks. The job has specific and cascading performance goals which aim to keep you sharp and challenged. This role requires commitment to maintain data confidentiality and abidance towards Amazon and country specific security standards. Flexibility with working hours and work on weekends and holidays as part of your normal 5-day shift. Please let us know if you need any adjustments or accommodations to participate in the interview process.Skills",
    "Skills": [
        "1+ years of customer service experience\nExperience with Microsoft Office products and applications\nWork a flexible schedule/shift/work area, including weekends, nights, and/or holidays\nExperience in payments or e-commerce"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "New Cairo, Cairo , Egypt",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "30"
    }
}