{
    "Job ID": "4726067",
    "Description": "We are seeking a highly organized and professional Receptionist In Charge to join our team at our recruitment agency in Dubai, UAE.Salary - AED 10,000/-Location - DubaiResponsibilities:Welcome and greet visitors in a friendly and professional manner\nAnswer and direct phone calls to the appropriate department or individual\nManage the reception area, ensuring it is clean and presentable at all times\nReceive and sort mail and deliveries\nProvide administrative support to the team, such as scheduling appointments and organizing meetings\nMaintain office supplies and placed orders when necessary\nAssist with data entry and filing as needed\nHandle sensitive and confidential information with integrity\nPerform other duties as assigned by managementSkills",
    "Skills": [
        "The ideal candidate will have a minimum of 1 year of experience in a similar role and possess excellent communication and customer service skills. The Receptionist In Charge will be responsible for managing the front desk, greeting visitors, answering phone calls, and providing administrative support to the team. This is a fast-paced and dynamic role that requires multitasking and the ability to prioritize tasks effectively.",
        "Preferred Candidate:",
        "Prior experience as a receptionist or in a similar role\nExcellent verbal and written communication skills\nStrong organizational and multitasking abilities\nProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook)\nAbility to remain calm and composed under pressure\nAttention to detail and high level of accuracy\nProfessional appearance and demeanor\nAbility to work independently and as part of a team\nFlexibility to work occasional evenings or weekends if required",
        "Excellent communication and customer service skills\nStrong organizational and multitasking abilities\nProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook)\nAttention to detail and high level of accuracy\nAbility to remain calm and composed under pressure"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}