{
    "Job ID": "4726914",
    "Description": "Fares & Retail Manager KSA - Darb Al Watan TransportationDarb Al Watan Transportation, a newly established company and a fully owned subsidiary of Hafil Transportation, is looking for a Fares & Retail Manager to join our team in Dammam, Saudi Arabia.We were recently operate intercity transportation in the north and east of KSA, with operations set With a fleet of 130 buses, we will be managing 26 routes, providing 80 round trips daily and employing 400-450 people, including around 350 drivers.This newly created role will report directly to the Chief Marketing Officer/Marketing Director and manage a team of four, including a customer service lead, social media & website administrator, ticketing system administrator, and communications administrator.Role Objective:To develop and implement a strategy focused on generating, maintaining, and increasing revenue.Key Responsibilities:Create a ticket pricing strategy together with the management\nIdentify means to increase the revenue and to generate additional revenue streams\nDevelop and implement plans to integrate and align functions across the organization such as Sales, Marketing, Customer Service\nDevelop and maintain partnerships with third-party business partners that lead to incremental revenue growth (e.g. rent out spaces at stations such as shops, cafes, etc.)\nwith a proven track record of revenue generation and are eager to take on a challenging new role, please apply.Skills",
    "Skills": [
        "Outstanding written and verbal communication skills.\nSound managerial skills with a knack for leading diverse teams.\nExcellent managerial attributes and strong leadership skills.\nProficient in managing a team of enthusiastic and skilled professionals.",
        "Key Selection Criteria:",
        "Previous revenue management experience within the intercity transportation sector\nOpen on nationality\nGood English communication skills, Arabic is an advantage\nWhile the role can initially start in Jeddah, it will require relocation to Dammam. If you are a strategic thinker"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}