{
    "Job ID": "4726077",
    "Description": "Salary - AED 6000-8000/-UAE Driving list is a mustAs a Sales Business Development Executive, you will be responsible for generating new business opportunities and building strong relationships with potential clients. The ideal candidate will have a strong sales background, excellent communication skills, and a proven track record of achieving sales targets.Responsibilities:Identify and generate new business opportunities through cold calling, networking, and referrals.\nBuild and maintain a pipeline of potential clients, and actively pursue new leads.\nConduct market research to identify potential target industries and clients.\nDevelop and deliver sales presentations and proposals to potential clients.\nNegotiate and close sales deals to achieve monthly and quarterly sales targets.\nBuild and maintain strong relationships with clients to ensure customer satisfaction and repeat business.\nCollaborate with internal teams to ensure smooth project delivery and client satisfaction.\nStay up-to-date with industry trends and developments to identify new business opportunities.\nAttend industry events and conferences to network with potential clients and promote our services.Skills",
    "Skills": [
        "Preferred Candidate:",
        "1-5 years of experience in sales or business development, preferably in the recruitment industry.\nProven track record of achieving sales targets and generating new business.\nExcellent communication and presentation skills.\nStrong negotiation and closing skills.\nAbility to build and maintain strong relationships with clients.\nSelf-motivated and target-oriented.\nAbility to work independently and as part of a team.\nKnowledge of the recruitment industry and market trends.\nProficient in MS Office and CRM software.\nFluency in English, both written and spoken.",
        "Proven track record in sales and business development.\nExcellent communication and presentation skills.\nStrong negotiation and closing skills.\nAbility to build and maintain strong relationships with clients.\nSelf-motivated and target-oriented."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}