{
    "Job ID": "4726033",
    "Description": "DANWAY group of companies have a long and successful record of delivering expert engineering products, technical services, and Trading, established in the UAE that tenders diversified interests in Power, Water, Oil and Gas, Infrastructure, Industrial projects as well as Renewable Energy sectors across the GCC and African region. We are looking for high calibre “GENERAL MANAGER” for the KINGDOM OF SAUDI ARABIA.Roles & responsibilities: - Responsible for Company’s overall Management, Operations, Business Development and P & L for the Kingdom of Saudia Arabia.\nHandling accountability of complete project management involving client communications, coordination, planning, logistics, contract & sub-contract management, Liaison with Ministry & Government authorities.\nReview and evaluate the pre-qualification documents, securing, and closing large capacity projects in Saudi Arabia bringing in technical, commercial, legal, and financial value.\nStrategizing to ensure completion of projects within the time & cost parameters to maximize the output.\nParticipating in project review meetings for evaluating project progress providing technical inputs to commissioning methodology. Liaising with consultants on determining technical and contractual matters.·        Liaising with Head Office, Performance Reviews, Recognition & Appreciation ·        Organising several promotional campaigns / technical presentations to facilitate new product development with major focus on brand establishment; market penetration and ameliorate business.Building key customer relationships. Finding potential new customers, ultimately converting them into clients and continuing to grow business in the future.\nManage key supplier relationships negotiations on strategically significant contracts and negotiation and management of third-party service providers.\nPromoting quality achievement and performance improvement throughout the organization.\nComply with all relevant safety, health & environmental procedures to ensure a healthy and safe environment.Skills",
    "Skills": [
        "Required Qualification & Skills",
        "·        The candidate should be a senior engineering professional with min. 25 years of cross-functional, cross-cultural, cross-continental experience and exposure in the EPC Projects & Contract Management and Electrical & Mechanical Products Trading, out of which at-least 15 years in similar roles in the Kingdom of Saudi Arabia.",
        "·        Must be an Electrical / Mechanical Engineering graduate from recognized University.",
        "·        Excellent analytical skills, interpersonal skills at all levels, including people-management, leadership, and both written and verbal communication skills, preferably with Arabic communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 20"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Electrical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}