{
    "Job ID": "4726959",
    "Description": " leading and managing the team and stockholder are working with him in his projects\n Determine and define project scope and objectives\n Predict resources needed to reach objectives and manage resources in an effective and efficient manner\n Prepare budget (CAPEX) based on scope of work and resource requirements\nTrack project costs in order to meet budget\nDevelop and manage a detailed project schedule and work plan\nUtilize industry best practices, techniques, and standards throughout entire project execution\nMonitor progress and adjust as needed\nMeasure project performance to identify areas for improvement\nManage a portfolio of complex initiatives that span one or multiple lines of business\n Provide on-site leadership for project team by building and motivating team members to meet project goals, adhering to their responsibilities and project milestones\n Full project life cycle ownership: successful project delivery will include full implementation from initiation to deployment for one major or several minor initiatives simultaneously\nManage all aspects of multiple related projects to ensure the overall program is aligned to and directly supports the achievement of strategic objectives\n Report on project success criteria results, metrics, test and deployment management activities\nWork creatively and analytically in a problem-solving environment demonstrating teamwork, innovation and excellenceSkills",
    "Skills": [
        " A degree in business management, project management, Engineering or a related field.\nPrior experience in working with different projects\nExcellent communication and interpersonal skills.\n A minimum of 5+ years of relevant experience in Fit-out projects.\nSpecialized into a specific function as project manager for the F&B projects in Qatar"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}