{
    "Job ID": "4726889",
    "Description": "Job Summary:The Executive Secretary will provide high-level administrative support to the chairman.Duties/Responsibilities:Provides high-level administrative support and assistance to the Chairman and other assigned leadership staff.\nPerforms clerical and administrative tasks including drafting letters, memos, invoices, reports, and other documents for senior staff.\nArranges travel and accommodations for the chairman.\nSchedules and attends meetings on behalf of executives, taking notes and recording minutes.\nReceives incoming communication or memos on behalf of senior staff, reviews contents, determines importance, and summarizes and/or distributes contents to appropriate staff.\nPerforms office tasks including maintaining records, ordering supplies, and performing basic bookkeeping.\nPerforms additional duties as assigned by the chairman.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Education and Experience:",
        "Bachelor's degree in Business Administration or related field preferred.\nAt least two years of related experience is required.",
        "Required Skills/Abilities:",
        "Excellent verbal and written communication skills.\nExcellent verbal and written English.\nExcellent organizational skills and attention to detail.\nExcellent time management skills with a proven ability to meet deadlines.\nAbility to function well in a high-paced and at times stressful environment.\nExtensive knowledge of office administration, clerical procedures, and recordkeeping systems.\nExtremely proficient with Microsoft Office Suite or similar software and able to learn new or updated software."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Ar Rabi, Riyadh , Saudi Arabia",
        "Company Industry": "Investment, Securities & Funds",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}