{
    "Job ID": "4726941",
    "Description": "Key Accountabilities• In conjunction with the functional head, formulate/provide inputs and lead the implementation of the strategy in line with CBQ’s vision, mission and corporate objectives.• Ensure effective cascading of the functional strategy into business plans to ensure vertical alignment and horizontal integration with other interfacing departmental strategiesLeadership• Manage the effective achievement of objectives through the leadership of the department and the setting of individual objectives, recruiting qualified staff, managing performance, developing and motivating staff, provision of formal and informal feedback and appraisal – in order to maximize subordinate and departmental performance.Organization Structure• Define an optimum organization structure for the department in coordination with the Human Capital function so that resources are optimally utilized and communication can take place in an efficient manner.Budgets and Plans• Oversee the consolidation and recommend the Corporate Real Estate work plan and budget and monitor financial performance versus the budget so that the business is aware of anticipated costs/revenues, areas of unsatisfactory performance are identified and potential areas of cost reduction or performance improvement opportunities are capitalized upon.Project Management• Review and approve project plans and timelines to ensure projects are executed in a structured and time-bound manner• Lead the management of Corporate Real Estate projects ensuring that all aspects of the project are executed as per the expectations of the client (internal and / or external).• Manage the process of design and review of occupancy layout changes as requested by the stakeholders.• Supervise and manage the consultants and contractors for the delivery of assigned projects in a timely and efficient manner.• Oversee the procurement management process of Corporate Real Estate projects according to the bank’s policy.Projects Monitoring• Oversee the development of SOPs, policies and guidelines for the execution of projects and property management activities.• Direct the project management team to monitor the progress of projects to ensure that they are executed as per the approved project plans.• Provide advice to internal clients during property transactions from a real estate perspective to assess the profitability and facilitate decision-making.Alternative Assets• Ensure adequacy of support is provided by FM and Projects teams to Alternative Assets team in managing acquired properties and provide guidance where necessary in order to ensure effective operations in line with agreed protocol and SOP’s.Other Accountabilities• Manage the relationship with the concerned Government authorities to obtain necessary approvals and fulfil other Corporate Real Estate requirements.• Lead the appointment of various external service providers to facilitate the execution of Corporate Real Estate activities (projects, property management etc.)• Manage the relationship with internal key stakeholders and Corporate Real Estate external third party partners and vendors for delivery of efficient and quality services.Change Management• Lead and direct the management of change through continuous improvement of departmental systems, processes and practices taking into account ‘international leading practice’, changes in international standards and changes in the business environment which demand proactive action plansPolicies, Systems, Processes & Procedures• Develop and oversee the implementation of functional policies, procedures and controls in order to ensure that all activities are conducted in compliance with risk, audit, and regulatory requirements while delivering a quality, cost-effective service.Quality, Health, Safety, & Environment• Ensure compliance to all relevant quality, health, safety and environmental management policies, procedures and controls across the department to guarantee employee safety, legislative compliance, delivery of high quality products/service and a responsible environmental attitudeMIS and Reports• Ensure that all departmental reports are prepared timely and accurately and meet CBQ department requirements, policies and standards.Related Assignments• Perform other related duties or assignments as directed.       Skills",
    "Skills": [
        "Minimum Qualifications:",
        "• Bachelor’s degree in Engineering or equivalent.",
        "• PMP certificate or M.Sc. in Project Management or MBA is preferred",
        "Minimum Experience:",
        "• 12 - 14 years’ relevant experience in real estate construction and development with exposure to real estate financing, cost management and facility management including at least 6 years in positions of progressively increasing managerial responsibilities.",
        "Knowledge, & Other skills:",
        "• Extensive knowledge of real Estate financing.",
        "• Extensive knowledge of the banking sector in Qatar and the region.",
        "• Strong project management skills.",
        "• Ability to collaborate and communicate effectively.",
        "• Ability to drive and achieve desired results within the defined time duration.",
        "• Ability to interact with internal and external customers in a multi-cultural environment.",
        "• Business acumen.",
        "• Negotiation skills.",
        "• Experience in coaching and mentoring.",
        "• Arabic and English speaking preferred.",
        "• Key decisions having significant impact on the function are referred to the position in the authority matrix in charge, for approval before implementation.",
        "• The jobholder exercises financial authority as per the level established by the CBQ management and stipulated in the authority matrix.",
        " ",
        "Key Interactions",
        "Internal",
        "• Alternative Assets",
        "• Finance",
        "• Risk",
        "• Retail Banking",
        "• Corporate Banking",
        "• Other CBQ departments, as necessary",
        "External",
        "• Government authorities",
        "• External service providers"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 14"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}