{
    "Job ID": "4727064",
    "Description": "Rewards & BenefitsWe offer an excellent package that includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin.Skills",
    "Skills": [
        "Requirements",
        "B.E / B. Tech or M.E / M. Tech Mechanical/Electrical Engineering degree from a recognized University.\n15 years of experience in projects\nThe ability to think laterally and possess a sound understanding of engineering principles. Ideal candidates will be able to demonstrate strong interpersonal skills and will be able to build and develop relationships, both internally and externally.\nExperience on major projects would be advantageous.\nStrong communication skills will be required to interact with project stakeholders, where necessary explaining our designs and providing direction to our design team.\nCommercial awareness essential with an understanding and ability to administer Change Control.\nPrevious experience of leading multi-disciplinary design teams and responsibilities for budgets and programming\nCommercial awareness essential with an understanding and ability to administer Change Control.\nStrong communication skills will be required to interact with project stakeholders\nExperience on design would be advantageous.",
        "The Individual",
        "Demonstrable track record of technical achievement and client satisfaction\nAbility to apply technical knowledge in analyzing problems and creating solutions\nAble to work and communicate effectively within multidisciplinary teams\nFlexible approach to work\nAbility to work on your own initiative\nStrong attention to detail and ability to make correct judgments\nAbility to adapt to different cultures and working environments.\nAspiration to grow with responsibility and to manage a growing team of skilled engineers\nAbility to build rapport with customers and colleagues\nWell-motivated and able to work as part of a team or on individual assignments when required"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}