{
    "Job ID": "4727062",
    "Description": "ResponsibilitiesTo undertake Public Health Services, GAS and Fire Protection systems design on international projects;\nPreparing technical mark ups/sketches for modelling by the BIM team;\nRepresenting Atkins at meetings with Clients and Contractors;\nLiaise with Local Statutory Authorities;\nTechnical Report writing;\nPreparation of design calculations using industry standard software;\nPreparation of technical specifications in Master format CSI and NES;\nMaintaining records and archives to company standards;\nManage own workload and workload of others;\nPreparing and managing project budgets;\nEngage in Multi discipline coordination and workshops;\nEnsure Quality Assurance/Quality control processes have been incorporated in the design;\nRaise enquiries during PHE+Fire+Gas design development;\nReview and develop established standard details and specifications with current market trends;\nManage production of standard PHE+Fire+Gas details/specifications;\nResource management across the PHE+Fire+Gas package;\nStrategic technical decision making;\nTechnical responsibility for quality associated with PHE+Fire+Gas design deliverables;\nReview of all PHE+Fire+Gas submissions to ensure consistency of approach across package.SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of originSkills",
    "Skills": [
        "Job Details & Requirements:",
        "Fully qualified professional and conversant with relevant market knowledge.\nMinimum BEng or equivalent in Electrical or Mechanical Engineering from a recognised institute with 10-15 years of industry experience post qualification.\nChartered Engineer or working towards with Membership of IPA, CIBSE, NFPA etc.\nSignificant experience working in a design consultancy, preferably in the Middle East.\nExperience in delivering projects in conjunction with remote design centres.\nProven experience working in a design consultancy in the capacity of designer and technical authority. Applied broad professional knowledge and experienced judgement.\nExceptional skills and knowledge of working in a design consultancy with good knowledge of Local and International Codes and Regulations.\nHigh level of technical skill in Public Health Services and Fire Protection Systems design is essential.\nAbility to develop technical specifications in Master format CSI and NES.\nGood level of computer literacy in Windows, HASS, HEVACOMP, NES and Microsoft packages - an understanding of AutoCAD/Revit is beneficial.\nWider knowledge of integrated design and collaboration with other disciplines highly desirable.\nCapable of working under pressure and on several projects simultaneously.\nFinancial awareness is preferred but ability to develop this skill is required.\nAble to understand and express technical concepts in written and verbal language with high standard of written and verbal communication skills.\nAble to innovate new solutions as well as applying existing solutions to problems.\nAble to make decisions, act on own initiative and operate in a pro-active way.\nGood report writing skills, experience of making presentations to and attending meetings with clients is essential.\nForming and managing relationships with Clients, networking and promoting the company.\nStrong team management skills.\nGood leadership qualities to work in harmony with the team."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}