{
    "Job ID": "4727528",
    "Description": "Position Title:             Centre ManagerEmployment Type:     Full TimeSalary:                         up to 18K AED all-inclusive depending on experience and qualificationsJob Location:            Abu Dhabi, UAE About the Client:A prominent group based in Abu Dhabi, with international collaboration and successful track records in the areas of F&B, Retail and Entertainment. Job Description:  Exceed the operating profit as projected with your General Manager for your location by maintaining floor occupancy levels above 85% as well as by assisting client in settling in and prompt query resolution within 24 hours.\nManage people by assisting with recruitment and training of team members and working with Marketing team for events and guest speakers.\nKeep CRM up to date with correct sales notice details & Agreements uploaded along with all sales opportunities as per the system standards.\nHandle finance such as reviewing monthly profit and loss statements, ensuring precise charging and invoice issuance, accurately recording payments, and timely collection of payments.\nManage overall aspects of operations such as execution of signed Agreements with clients, recording rents and rent reviews, ensuring floor equipment is maintained, coordinating with Cloud Spaces IT for record and equipment upkeep, and attending at least one networking event per month.Skills",
    "Skills": [
        "Qualifications:",
        "28 to 40 years old and below\nMinimum 5 years of UAE experience in the similar role\nWith relevant experience in a management level from a co-working space industry, hospitality or similar\nWith experience in sales or business development\nImmediate joiners are preferrable"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}