{
    "Job ID": "4727319",
    "Description": "Responsibilities:To implement all aspects of the quality management systems and site supervision activities provision related to the landscape Works across the project, perform inspections to deliver quality installations in accordance with the contract documents, relevant international standards and local authorities’ requirements.Keep, monitor and follow up as necessary and maintain complete record(s)\nconcerning the execution of the works.\nInspection, sampling and testing of materials to assure that compliance with the contract specification.\nIdentify non conforming work or materials, notify contractor and keep a record. Follow up corrective and preventive measure taken by the Contractor.\nAssist in the review and forward comments on the contractor’s method statement for execution of the works.\nAssist in the review and forward any comments on the contractor’s technical submittals.\nAttend site technical coordination meetings to discuss contractor (s) submissions, shop drawings, material submittals and construction related matters\nCarry out the final inspection for certification of final completion and handing over of the works.\nAssist in the review and forward comments on the Technical Query raised by the contractor.\nInspect the work done by the contractor(s) to ascertain that work is executed in accordance with the Contract Documents and accepted practice\nInspect the on-site and off-site materials to be used in the project and organise field and laboratory tests, conducted by others, on construction materials to ascertain their compliance with the specifications and determine it acceptability for use on the project.\nIdentify potential safety concerns and inform the contractor (s).\nReview the site progress and assist in the review of the contractor’s interim payment application.\nLiaise with the RE for the effective implementation of the quality management systems and site supervision provision activities.\nImplement the site supervision quality procedures, and review submission requirements of the project, along with the contractor.\nReview all construction documents and highlight any design and contractual discrepancies with the concerned RE.\nEnsure that all statutory authority NOC’s / permits / design approvals are available on site for construction.\nExtend the maximum possible effort to avoid contractor(s) claims for cost and/or delay.\nConduct regular (daily) site visits and supervise, verify the installation of civil /\narchitectural works ensuring compliance with the contract documents.\nReview and forward any comments on the contractor’s method statement for installation, execution of the works.\nReview and forward any comments on the contractor’s technical submittals.\nAttend site technical coordination meetings to discuss contractor (s) submissions, shop drawings, material submittals and construction related matters\nRaise non-conformance notices (NCNs)/reports; site inspections notices (SINs)\nidentify quality deficiencies in conjunction with the RE.\nReview the corrective actions proposed by the contractor, respond / follow ups and close out procedure\nAny potential safety concerns identified at site shall be reported to site SHSEE / RE.\nMonitor the progress of the work against the approved contractor programme of works.\nVerify the accuracy of the contractor’s “As-Built” drawings reflecting in details the as- built conditions and approve the As-Built drawings.\nAssist in the review and approve the contractor’s operations & maintenance manuals.\nLiaise with the Statutory Authorities and follow up all final inspection and approvals as required.\nCarry out the final inspection for certification of final completion and handing over of the works.\nAssist RE in the supervision of the works to ensure compliance with the contract documents.\nAssist/support the site team and the respective RE with the implementation of Quality\n/ HSE management systems.\nAssist in the site team in the external and internal audits to ensure the effective implementation of quality management systems and work with the site team for resolution of non-conformance issues.\nLiaise with the project supervision team, coordinate and resolve any issues of concern.\nAnalyse current methods of site supervision and provide recommendations for\ncontinuous improvement\nImplementation of all quality audits, surveillance audits and work with site team for resolution of non-conformance issues.\nCompile Site Feedback and forward to the RE.\nAssist the site team in the satisfactory close out of the project including snagging /\ndesnagging of the works and related documentation.\nReview and assist the project team to compile all documents at handing-over for submission to the Client.\nAssist the RE in compilation of all documents for the issuance of the Taking-Over\nCertificate.\nReview the Contractor’s Inspection Test plan and review all QA/QC documentation.\nInspect the works carried out by the contractor(s) and ensure the quality of the works meets the project requirements.\nFollow up inspections of the works and material delivered at site is as per the Contractor’s Inspection Test Plan.\nCoordinate leave request and discuss leave cover with the SITL.\nLiaise with OMSOD for all HR / Finance / Administrative issues.\nMonitor performance of the contractor / sub-contractor and identify, raise any quality /\nworkmanship concerns with the SQE / RE.\nReview quality procedures and effectively implement QA/QC plans across the project.\nIdentify any particular site safety issues and bring to the notice of the contractor / SHSEE / RE.\nCarry out, witness all tests carried out by the contractor on-site and off-site tests.\nInspect the works, on-site material, off-site material to be used in the project\nUpdate and maintain the latest revision of all project documents\nReview, coordinate and forward submittals, inspection requests, technical query to the project team and/or discipline engineers.\nAssist the project site team during internal, external and site surveillance audits.\nCoordinate leave request and discuss leave cover with the SITL.\nPrepare and regularly (daily) submit reports and maintain records.Skills",
    "Skills": [
        "Requirements:",
        "Minimum bachelors in Architecture/Landscape\nMinimum of 8 years experience in Landscape (Soft/Hard ) for Landscape Architect, and minimum of 13 years experience for Senior Landscape Architect\nPrevious site inspection experience\nUnderstanding of British, American and International design standards. Working knowledge of ICAO standards would be a distinct benefit.\nGood communication skills in written and spoken English essential\nExperience from site supervision background\nMust have integrity, be flexible and proactive\nMust demonstrate ability to act independently as part of a team\nGood team player, able to communicate effectively with colleagues",
        "Rewards and Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}