{
    "Job ID": "4727864",
    "Description": "Client and stakeholder management.\nExecutive level reporting.\nInternal project and financial management.\nInternal governance management.\nResource management.\nManaging and assisting technical teams to prepare task orders/ work packages.\nDesirable Internal Accounting Experience;\nMaintaining rolling revenue, cost, margin and headcount forecasts.\nReporting on project performance.\nLeveraging project commercial performance – revenues and costs.\nEnsure time charge hours properly captured and invoiced on time.Rewards & Benefits:We offer an excellent package which includes:\nA competitive salary\nTransportation allowance\nMedical and life insurance cover\nAnnual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of originSkills",
    "Skills": [
        "Essential Criteria;",
        "Middle East construction market experience in last 4-5 years preferable.\nMiddle East construction experience added benefit, delivery experience in UAE would be a differentiator.\nGood common law, contract, commercial and fiduciary understanding, minimum 15 years post qualification experience.\nExcellent written English for preparation of contracts, task orders, contract letters, notices and communications.\nGood negotiation skills to agree contracts with clients, contractors, and sub-contractors.\nPrevious experience in government departments/ client-side and or contractor roles.\nLarge company project financial control systems use and understanding.\nLarge company internal governance procedures will be an added factor.\nGood attention to detail and ability to review invoices and contracts prior to issue.\nIn-depth knowledge and experience in cost and commercial management of projects at both pre contract, tender/procurement and post contract stages.\nBachelor’s Degree in Quantity Surveying or Commercial Management from recognised University or Bachelor of Laws.\nMust have previous experience of FIDIC Contracts.\nStrong contractual, commercial and financial knowledge.\nMinimum 15 years pre and/ or post-contract relevant capacity in cost and commercial management.\nMust have consultant and/ or client background for minimum of 10 years.\nMust have minimum of 4 years Middle East experience preferred.\nProject management acumen.\nGood communication skills.\nAt ease with Client presentations/ reports.\nTeam player, team leader",
        "Desirable Criteria;",
        "Degree in relevant discipline (quantity surveying).\nProfessional Membership (MRICS, MCIOB, MCIPS, MCIArb).\nKnowledge of UAe  common/ government/ contract law.\nMust have experience in Infra/ Residential/ Mixed use projects\nKnowledge of PMIS systems.\nContract interpretation and advice/ action.",
        "Technical Knowledge and experience",
        "Contracts and sub-contracts- preparation, review and evaluation\nKnowledge of the design process in the project lifecycle\nKnowledge of the site operations process\nContract and commercial correspondence\nPreparation of financial models and pricing proposals\nUnderstanding and experience of project planning, programme and delay claim preparation and evaluation\nManagement of variations and claims processes, claims preparation\nSenior level commercial experience on at least one major design and construct project\nNegotiation skills\nRisk management process and practice\nExcellent ability to develop successful client relationships"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}