{
    "Job ID": "4727877",
    "Description": "ResponsibilitiesThe Quantity Surveyor will report to either Associate Director / Senior Commercial Manager.\nWill be responsible for organizing measurement tasks when preparing estimates / cost plans\nDraft estimates / cost plans for review and finalization with senior management.\nPreparation of BOQ including drafting Preambles / General Requirements.\nUndertake market review / research for compiling and updating unit rates for estimating.\nResponsible for on-site and off-site quantity verifications and confirmation with regards to payments and variation works.\nResponsible for checking and verification of all invoices of the said sub packages on site.\nMaintain a register of payments\nCheck the materials on and off site and verified delivery and acceptance from the client’s representative for payment approval.\nPrepare and maintain records of all sub-contractors agreement and payments.\nOn site verification of Final Accounts submitted by the Contractors and selected Sub Contractors and Suppliers, adjusting as necessary and providing recommendations to the Client.Skills",
    "Skills": [
        "Key Requirements",
        "Must have Mixed-use development and Infrastructure experiences\nCommercial Contract Administration and Change management\nInterim valuations and payment certificates\nVariations analysis and recommendations, Contractor’s claims\nPerforming risk and value management and cost control functions\nUndertaking costs analysis project work, preparing estimates of variation works.\nIdentifying, analyzing and developing responses to commercial risks\nPreparation of cost report and monitor the cash flow.\nReporting to Client Representative on all commercial issues\nClient facing and involvement in commercial meetings\nManaging workload with minimal supervision\nUnderstanding the implications of health and safety regulations",
        "Experiences and Qualifications:",
        "Must have previous experience of FIDIC contracts\nDegree in Quantity Surveying from recognized university\nMin 5 years post-contract experience\nMust have consultant and/or client background for minimum of 2 years\nKnowledge of the use of QS software or similar is required\nDemonstrate strong interpersonal, communication and presentation skills\nTeam and /or independent worker\nPossess good project background and proven English language technical writing ability and skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}