{
    "Job ID": "4727273",
    "Description": "Responsible for the site supervision of Contractor’s architectural and interior design works. Duties include inspection of the Contractors works, Review and commenting on submittals, forwarding submittals to the concerned designer for response, obtaining samples and quotations when required, preparing reports and recommendations and coordination of all architectural / ID works with other disciplines.Skills",
    "Skills": [
        "Requirements:",
        "Degree in Architecture.\nMinimum 12+ years experience in detail design, production of drawings, able to analyse technical/construction build-ability issues and provide drawings and specifications coordinated with engineering and other disciplines. Site execution of Interior design works\nAble to work on their own initiative with minimum supervision, within a multi-disciplinary team.\nExperience in a variety of buildings and sectors such as multi residential, leisure, hotels, retail, offices, mixed-use developments.\nAble to interpret project specifications client requirements and constructability requirements.\nAble to prepare project specific quality plans and record and implement essential coordination issues in accordance with Atkins quality procedures\nDesirable Middle East experience.",
        "Rewards and Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}