{
    "Job ID": "4727773",
    "Description": "For thousands of years, maps have provided humans with the knowledge they need to make decisions. As a Maps Evaluator, you will have the opportunity to provide ground truth for your town, city or country.At Peroptyx, we are looking for Data Analysts who will review mapping data for digital mapping applications. Your research capabilities will validate and ensure that the navigation of certain routes are accurate and safe.As part of this role you will verify that business names and opening hours are correct. You will check that the distance from a starting point to an end destination is listed accurately resulting in better user experiences.With this job you can plan your days around this highly flexible working schedule, work weekends or late evenings, all from the comfort of your own office. The flexibility of our roles minimizes the impact on your daily routine.So, whether you are a student looking to earn as you learn, a retiree looking for a new challenge a part-time/full time professional or a work from home parent, Peroptyx has the right role for you!Skills",
    "Skills": [
        "Ideal Candidate",
        "Fluent in English\nExcellent research skills.\nExcellent local knowledge of your home country.\nGood understanding and general knowledge of the geography and culture of Saudi Arabia.\nAnalytical mindset. ",
        "Job Requirements",
        "Must be living in Saudi Arabia for a minimum of 5 consecutive years.\nMust pass an online open-book exam that can verify your full understanding of the material and concepts.\nMust be willing to work a minimum of 10 hours and up to 20 hours per week depending on task availability.\nGood working knowledge of search engines, map applications and familiarity with social media platforms.\nStrong ability to learn, understand and apply multiple sets of different instructions.\nAll work must be of an independent nature.  ",
        "Technical requirements to perform the work",
        "Access to a laptop or computer which uses:",
        "-       A logon account unique to you",
        "-       Anti-virus solution that is kept up to date, with regular scans performed",
        "-    Only one member per household may apply",
        "  NB. All products should be provided at your own expense.",
        "Benefits",
        "· Work up to 20 hours per week.",
        "· Earn a competitive rate of pay.",
        "· Develop your research skills.",
        "· Avoid the long commute.",
        "· Work from the comfort of your home office.",
        "· Enjoy the flexibility of setting your own working hours!",
        "This is a freelance, independent contractor position."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "50"
    }
}