{
    "Job ID": "4727074",
    "Description": "يتضمن العمل توقيع اتفاق مع مزود خدمة الهاتف المحلي مثل Mobily و Zain و STC إعداد جهاز مخصص ، تدفعه شركة جسر المعلومات ، والدعم اليومي للجهاز. سيتم توفير مزيد من التفاصيل عبر الهاتف.\n\nيشمل العمل - - إعداد جهاز في مكتب مخصص - كل المعاملات مع شركة الاتصال تتم عن طريق الموظف - وجود اتصال ثابت بالإنترنت - دعم العمل اليومي بما في ذلك إصلاح مشاكل الاتصال والمزيد\n\nسيتم توظيف شخص عن طريق شركة جسر المعلومات , الموظف الثاني سيكون عمله متعلق بتركيب الاجهزة والحفاظ عليها , سيعمل مع مالك المؤسسة , وياخذ راتبه من شركة جسر المعلومات\n\n*الراتب يرتفع بشكل تلقائي بعد مرور 6 شهور من العمل\n\nيجب أن يكون لديك مؤسسة محلية حتى تتمكن من العمل معنا. ستدفع الشركة جميع النفقات بما في ذلك الاشتراك السنوي والضرائب والإعداد مع مزود محلي وأي نفقات ذات صلة.\n\nإن جسر المعلومات هو مزود تكنولوجيا بصعيد الخليج العربي ويتطلع الآن إلى التوسع! مهمتنا هي تقديم أعلى جودة من الخدمة لجميع منتجاتنا ونحن نبحث الآن عن شركاء محليين جدد! هذه فرصتك لاتخاذ خطوتك الأولى في عالم التكنولوجيا العالية.\n\nمعنا ستحول تطلعاتك إلى حقيقة. سنساعد في تشكيل رحلتك من خلال إثراء الخبرات وفرص التعلم والتطوير والتعرض لمهام مختلفة ضمن دورك أو من خلال التنقل الداخلي. تقدم مجموعتنا مسارات وظيفية متنوعة لاناس استثنائيين ، كل يوم.Skills",
    "Skills": [
        "لا تتطلب الوظيفة اي خبرة مسبقة , التدريب كامل على حساب الشركة ومدفوع\n\nمتطلبات - - \n- مواطن سعودي فقط (يجب أن تكون صاحب مؤسسه) - - اذا لم يكن لديك مؤسسة/شركة يوجد إمكانية فتح مؤسسة عن طريقنا وكل التكاليف علينا - التوفر خلال النهار لدعم الجهاز - الاستعداد للعمل من المنزل والحصول على دخل ثابت ومستقر.\n- مهارات تنظيمية وإدارة الوقت ممتازة لتحديد أولويات المهام بشكل فعال.\n- إتقان اللغة العربية (كتابة وتحدثاً) أمر ضروري للتواصل الفعال.\n\n*الراتب يرتفع بشكل تلقائي بعد مرور 6 شهور من العمل"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia",
        "Age": "Min: 20"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Business Support Services; Call Centers & Customer Care Outsourcing",
        "Company Type": "Unspecified",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "5"
    }
}