{
    "Job ID": "4727094",
    "Description": "In addition to these responsibilities, the Project Director manages project risk, develops contingency plans, and ensures that health and safety standards are adhered to. They are responsible for managing project documentation, ensuring that projects are compliant with regulatory requirements, and maintaining Atkins’ project management methodology.Key ResponsibilitiesProject Delivery                   Accountable for the end-to-end leadership, management and delivery of all aspects of this project. This includes project management, timeliness, quality, risk management, project financial performance and scope management of the projects, in line with the Atkins methodology.\nAccountable for successful close out of commercial fee and contractual negotiations with the Client and their representative.\nAccountable for the establishment of the project, including resourcing from Delivery Centres and Offices, project set up, work breakdown structure (WBS), program development, milestone establishment, scope changes and variations\nDemonstrate care about the well-being of themselves and others, through actively participating in and driving OHS activities.\nBuild and lead whole project delivery team, secure required resources.\nEnsure project delivery activity is in line with Company standards and client expectations\nEnsure effective closeout and debrief occurs with Client, Client Relationship Executive (CRE), People Manager and Project Leader.Financial Management  Accountable for the P/L of the project\nHave an excellent understanding of Risk and the need to use their commercial acumen\nReview and submit monthly PSR\nReview Project budget at the start of the project.\nConduct Monthly Financial Review with the team and present to Senior Management.         Client ManagementManage contract matters with Client\nEscalate issues in a timely manner to the PRB.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants.Skills",
    "Skills": [
        "Requirements",
        "20+ years post-graduate experience.\nDegree in a field of Engineering related to Infrastructure such as Civil Engineering or equivalent professional qualification\nExperience of working in the Middle East or other expatriate environments (Saudi Experience is preferred)\nCompetent professional that can work independently\nPossess knowledge of appropriate analytical and design aids (computer software) with respect to land development projects\nExcellent report writing and presentational skills\nConfident and professional manner and communication style, and the ability to communicate effectively with colleagues, clients and stakeholders\nProficient IT skills (Microsoft Office and specialist software)\nPrevious experience and an understanding of the Clients and markets in the region highly desirable\nArabic speaker desirable but not essential",
        "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.",
        "As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.",
        "We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.",
        "Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}