{
    "Job ID": "4727871",
    "Description": "Responsibilities:To understand and interpret Atkins rights and responsibilities across its portfolio of projects in Saudi Arabia\nOverall responsibility for supporting Project Directors in the delivery of projects to the contractual arrangements and the required commercial outcome (including the contracted profit margin) all in accordance with the agreed financial objectives\nCo-ordinate commercial appointments for services being provided by all parties, including other Atkins Business Sectors and sub-consultants.\nDeveloping and managing the commercial administration, monitoring and change control system requirements to comply with Atkins internal business processes and systems, inclusive of risk and variation registers\nDeveloping commercial understanding and competence within the Project Management and Design delivery staff in Saudi Arabia\nSupport the Project-based Commercial staff within the Country’s live projects\nEscalation and reporting on claims made against Atkins Professional Indemnity insurance or such circumstances\nCommercial review and audit of live projects in Country\nUnderstanding of and adherence to Atkins internal Business Management System (BMS) and other processes.\nMonitor compliance of the Service Delivery Process throughout the project delivery phase and respond to queries;\nReview monthly financial reports and review any actions in respect of the Risk Register and project contingency;\nInfluence improved risk management to ensure an appropriate approach to risk is considered with an objective of converting contingency to margin for live projects\nLiaise with finance and project teams on debt management with an aim of converting debt provisions to P&L profit.\nProvide guidance to project teams to ensure a consistent approach to billing in line with contractual arrangements is maintained to maximise positive cash flow.\nInfluence behaviours to provide early warnings of risk to projects financial healthRewards & Benefits:We offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\nAnnual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of originSkills",
    "Skills": [
        "Requirements:",
        "The individual: ",
        "Business minded, commercially astute\nExternal focus and awareness of market influences\nClient friendly, relationship building, emotionally intelligent\nSelf-motivated with a winning attitude\nGood team leader and team worker\nExcellent communicator in written and spoken English\nStrong influencing skills\nMobile, willing to make regular travel in region\nCommitted and persistent can-do qualities\nStrong numerical and analytical skills",
        "Qualifications",
        "BEng /BSc in an appropriate engineering discipline or Quantity Surveying. ",
        "Technical Knowledge and experience",
        "Essential:",
        "Contracts and sub-contracts- preparation, review and evaluation\nKnowledge of the design process in the project lifecycle\nKnowledge of the site operations process\nContract and commercial correspondence\nPreparation of financial models and pricing proposals\nUnderstanding and experience of project planning, programme and delay claim preparation and evaluation\nManagement of variations and claims processes, claims preparation\nSenior-level commercial experience on at least one major design and construct project\nNegotiation skills\nRisk management process and practice\nExcellent ability to develop successful client relationships",
        "Highly desirable:",
        "Design and build project experience, especially contractor-side design\nMulti-disciplinary design and engineering process and controls\nMiddle East experience.\nCommercial experience with the delivery of projects in the entertainment sector  "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}