{
    "Job ID": "4727255",
    "Description": "As a Jewelry sales associate, you will be providing product knowledge, features and benefits to all customers when presenting merchandise. Also, you will perform different functions to ensure customers are happy with their purchases.ResponsibilitiesGreets and meets customers on arrival at the shop\nListens attentively to a customer’s needs and gives explicit explanation to satisfy such a customer\nPresents the customer with the needed jewelry and provides information, such as product details, pricing etc.\nHelps to facilitate payments after every purchase\nTakes charge of all the inventories in the shop or kiosk by entering them into the computer system\nHelps in the daily display of all items that are available for sale in the shop\nAchieves goals set by the employer\nEnsures that products are well arranged in orderly manner\nProperly operates a cash register and maintains all financial transaction effectively and efficiently too\nStrictly adheres to company policies\nHelps customers to make the right decisions so they can make the right jewelry purchases\nExplains warrantees and guarantees on each piece purchased by a customer\nEnsures all documents relating to the purchase of any jewelry are also bagged with the goods purchased\nSends appreciation messages to customers and keeps them informed concerning latest arrivals\nEnsures that all pieces of jewelry are returned to their secured places after the day’s businessSkills",
    "Skills": [
        "Proven work experience as Jewelry Sales Associate or in a similar role.\nExperience selling high end jewelry preferred\nStrong analytical skills and attention to detail.\nExcellent organizational and time management abilities.\nEffective communication and interpersonal skills.\nAbility to work independently and collaboratively in a team environment."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}