{
    "Job ID": "4727093",
    "Description": "The Brand Manager lead the transformation, strategy and all projects related to the respective brands and ensure proper planning with all related departments and monitoring activities by driving sales and market share• Manage and lead the transformational plans and new product launches and define the brand strategy to drive sales and gain market share.• Plan the calendar of the year and identify the upcoming campaigns to promote the products and increase the sales among the year• Lead the strategic communication with the stakeholders and internally with communication team and make sure to algin with them for better engagement and proper deployment• Ensure to have the right design of the packaging with communication team• Align all the marketing activities with Marketing must win battels and company strategy• Lead the new product development and ensure to select the best quality as per the customer need and company direction.• Manage the optimum Product Fixed Marketing Expenditure (PFME)Department Management:• Direct the development and update of the department’s SOPs, SLAs, processes…etc. through the alignment with the concerned departments to ensure that internal controls and proper documentations are in place.• Develop the department’s KPIs through cascading the division’s SMART objectives and monitoring the implementation to ensure the achievement of the set KPIs.• Manage the department’s performance through providing performance feedback, conversations, appraisals, coaching, knowledge transfer …etc. to ensure the achievement of the set objectives and employees’ career development.Skills",
    "Skills": [
        "Education",
        "• Bachelor's degree in Marketing",
        "• Master is a plus",
        "Experience",
        "10-15 Years of experience and a minimum of 5 years in a managerial role.",
        "Computer Skills",
        "• Project Management is a plus",
        "• Product Management",
        "• Microsoft Office",
        "• Pricing knowledge",
        "• Digital Marketing",
        "Languages",
        "• English",
        "• Arabic"
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}