{
    "Job ID": "4727336",
    "Description": "This position will be responsible for handling cash transactions, processing invoices and quotations, and ensuring smooth operations within our showroom. The role holder would need to have excellent organizational skills and a strong attention to detail.Job Responsibilities-Process sales transactions accurately and efficiently using the cash register or point-of-sale system.\nHandle cash, credit card, and other payment methods while maintaining strict cash handling procedures.\nCount cash at the beginning and end of each shift, ensuring accuracy and adherence to company policies.\nPrepare daily cash reconciliation reports and assist with financial reporting as required.\nGenerate and process invoices for customer purchases, ensuring accuracy and proper documentation.\nPrepare and provide quotations to customers as per their requirements.\nMaintain records of invoices and quotations, ensuring they are filed and organized appropriately.\nCoordinate with the sales team to ensure timely delivery and follow-up on outstanding payments.\nGreet and welcome customers entering the showroom, providing a positive and professional first impression.\nAssist customers in locating products, answering their questions, and providing product information when needed.\nHandle customer inquiries and complaints, providing timely and satisfactory resolutions.\nMaintain a high level of customer service standards and ensure customer satisfaction.\nProvide general administrative support to the showroom, including filing paperwork, organizing documents, and maintaining records.\nAssist in managing inventory by monitoring stock levels, restocking shelves, and notifying the appropriate departments of any shortages or discrepancies.\nCollaborate with other departments to ensure seamless operations and efficient customer serviceSkills",
    "Skills": [
        "Omani national\nHigh school diploma or equivalent; additional education in business administration or finance/accounting in a related field is a plus.\nProven experience as a cashier or showroom coordinator, preferably in a retail environment.\nStrong numerical and cash handling skills with a high level of accuracy.\nExcellent organizational and multitasking abilities.\nCustomer service-oriented mindset with excellent communication and interpersonal skills.\nProficiency in using cash registers or point-of-sale systems.\nFamiliarity with invoicing and quotation processes.\nAttention to detail and ability to work under pressure.\nProficient in using MS Office applications (Word, Excel, Outlook)."
    ],
    "Preferred": {
        "Residence Location": "Oman",
        "Nationality": "Oman"
    },
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}