{
    "Job ID": "4727163",
    "Description": "An Applications Project Manager oversees assigned application and systems development projects of moderate to high complexity. This position is responsible for assembling the project team, assigning responsibilities, and managing schedules and resources to ensure timely completion of assigned projects, and must be fully knowledgeable about Flutter and LaravelDevelop the project schedule and plan to ensure timely completion of the project.\nObtain management and client agreement with the project plan and timeline, and advise of any obstacles or resource needs that may affect completion of the project as planned.\nAssemble the project team, identify competencies, and assign resources to development tasks appropriate to each individual’s knowledge, skill, and abilities.\nCommunicate project goals, monitor project progress, and adjust resources as necessary to keep the project on track.\nApply project management tools and tracking systems to manage all aspects of project progress.\nUtilize project resources and serve as an individual contributor to develop programming code or software modifications using appropriate languages and tools to optimize resources and meet functional user requirements.\nUtilize project resources and serve as an individual contributor to analyze user system and application needs, determine and evaluate potential solutions, develop system specifications and requirements, and design application programs to meet the requirements.\nUtilize project resources and serve as an individual contributor to design integrated solutions which may include applications, databases, networks, and related systems.\nUtilize project resources and serve as an individual contributor to structure, implement, and maintain database systems.\nEstablish policies, standards and procedures to ensure useful and readily accessible data. Skills",
    "Skills": [
        "This position requires specialized knowledge of appropriate programming languages and development tools.\nThis is an intermediate to senior level professional position requiring the ability to complete complex application and systems development projects on a timely basis, using the talents of other Applications Developers, Associate Applications Developers, or other assigned staff.\nThis position may work in conjunction with, or consult with, a Senior Applications Developer with expertise in the project area.\nMust have handled projects with Flutter and Laravel and has knowledge of applications and websites based on those languages.\nBachelor’s degree in Computer Science, MIS or other field involving software and analytical training, and four years of IT related work experience\nOR a Bachelor’s degree with no specific required field and five years of IT related work experience\nOR a Master's degree and three years of IT related work experience\nOR a combination of eight years of IT related work experience and validated training.\nPreparation for a relevant IT certification is considered to be related training. "
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}