{
    "Job ID": "4727097",
    "Description": "Hope you are doing well. I am hiring an Oracle Fusion Finance Functional Consultant(Remote) for a Client of mine in Saudi Arabia. We are looking for someone who can join for 15 - 30 Days & ready to do Work From home holding a personal Laptop. This is a long-term engagement on a 1-year extendable basis. If interested, please share your cv with me and we can have a call to discuss furtherResponsibilities:1.      Client Engagement: Engage with clients to understand their finance-related business requirements, objectives, and challenges. Conduct workshops and meetings to gather information and analyse client needs.2.      Solution Design: Develop comprehensive Oracle Fusion Finance solutions based on client requirements, industry best practices, and Oracle's implementation methodologies. Design system configurations, integrations, and customizations to meet client-specific needs.3.      Project Management: Lead Oracle Fusion Finance implementation projects, including project planning, resource allocation, and milestone tracking. Ensure adherence to project timelines, budgets, and quality standards. Manage project risks and effectively communicate project status to stakeholders.4.      System Implementation: Oversee or actively participate in the implementation of Oracle Fusion Finance modules. Configure the system to align with client requirements, including chart of accounts, financial structures, workflows, and security settings. Collaborate with technical teams for data migration, integration, and customization activities.5.      Business Process Optimization: Assess and analyze clients' existing finance processes, identifying areas for improvement and optimization. Streamline workflows, enhance controls, and leverage Oracle Fusion Finance functionalities to drive process efficiency and effectiveness.6.      Change Management: Collaborate with clients to manage organizational change associated with Oracle Fusion Finance implementations. Develop change management strategies, including communication plans, training programs, and user adoption initiatives. Provide guidance and support to clients during the transition to the new system.7.      User Training and Support: Conduct training sessions to educate client end-users on the functionalities and best practices of Oracle Fusion Finance. Provide ongoing support and troubleshooting assistance to address user inquiries and ensure smooth system operation.8.      Stakeholder Collaboration: Collaborate with key stakeholders, including finance teams, IT departments, and executive leadership, to ensure alignment of business goals, manage expectations, and foster strong relationships. Provide regular updates and reports on project progress and outcomes.9.      Knowledge Sharing and Mentoring: Stay up to date with Oracle Fusion Finance releases, industry trends, and best practices. Share knowledge and expertise with the team and mentor junior consultants to foster professional growth and development.Skills",
    "Skills": [
        "•      Bachelor’s degree in finance, Accounting, Business Administration, or a related field. A Master's degree is a plus.",
        "•      Extensive experience in implementing Oracle Fusion Finance applications, including multiple full-cycle implementations.",
        "•      In-depth knowledge of finance and accounting principles, processes, and best practices.",
        "•      Strong understanding of Oracle Fusion Finance modules and their interdependencies.",
        "•      Proven project management skills with the ability to lead and manage complex projects from initiation to successful completion.",
        "•      Excellent analytical and problem-solving abilities to identify issues, recommend solutions, and mitigate risks.",
        "•      Exceptional communication and interpersonal skills to effectively engage with clients and stakeholders at all levels of the organization.",
        "•      Ability to build and lead high-performing teams, fostering a collaborative and inclusive work environment.",
        "•      Relevant certifications in Oracle Fusion Finance or project management (e.g., Oracle Fusion Financials Implementation Specialist) are desirable.",
        "•      Arabic speaker Mandatory",
        "•      KSA Government Experience - Mandatory (Or any Arabian Government)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 14 Max: 20"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}