{
    "Job ID": "4727660",
    "Description": "Job SummaryTo provide supportive operational assistance to all departments; interact with guests, assisting their queries and complains.Job ResponsibilitiesContribute to the development and execution of the department’s short to mid-term plans to ensure alignment with the division’s strategic priorities and contribute to the development of annual business plans for the assigned areas of responsibility to support the achievement of financial objectives.\nMonitor, control and report key performance indicators related to the department, to track performance and recommend corrective actions.\nManage the performance management, career progression and activities of direct reports by setting annual objectives, identifying training opportunities, mentoring, coaching and providing constructive feedback to improve their performance.\nAct for the achievement of the customer expectations and performance targets of the department.\nWork towards \"go the extra mile\" and deliver exceptional customer service, not just the minimum acceptable.\nReport and communicate on all pertinent matters affecting guest service and hotel operations.\nCoach the team so they can see how to meet the short term and longer-range plans of the business.\nSupport through the daily management activities of the company's and brands values and culture.\nImplement the operational and service standards set out in the Corporate Standard; mediation of these standards to line managers.\nClose work with leaders in the team to support other team members and ensure they have a strong sense of direction.Skills",
    "Skills": [
        "• Knowledge in Opera, Micros, Telephone Switchboard",
        "• Proficiency in Microsoft Office software: Word, Excel and PowerPoint",
        "• Strong presentation skills and communication skills.",
        "• Demonstrated capacity to work with an agile and open mind in a complex and multinational work environment alongside talented and strong-minded colleagues",
        "• Ability to work under pressure and be determined to meet calendar target",
        "• ERP knowledge preferably SAP functional skills are a requirement to be successful in this role."
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}