{
    "Job ID": "4727807",
    "Description": "Kodland today is an EdTech startup that teaches digital skills to children and teenagers around the world. For four years, we have been helping the young generation of programmers take their first steps into the computing environment and master the professions of the future.In Kodland you will be responsible for:Phone sales of online courses to parents who have attended a free introductory school session with their children in their chosen profession;As well as selling senior courses from the educational line to our graduates who have already taken one of the school's junior courses;Also have another position where you will present free complimentary lessons (Trial Classes) via Zoom to parents and children who are considering our company.You will work for italy market have to speak italian fluentlyApply and we will offer you:Competitive salary and a bonus depending on your sales plan.A convenient schedule: 25/30/40 hours per week, 2 days off per week, but not consecutive.Career development: we are developing a talent pool to support the growth of the school.Discounts on Kodland training and weekly company events.We value hard work and professionalism and are willing to invest in people who share our values. If you are interested in our challenges and want to try your hand at EdTech sales, come to us.Skills",
    "Skills": [
        "You are definitely a good fit for us if:",
        "You already have experience in telephone sales of any product or service or sales experience",
        "You speak Italian or polish fluently.",
        "You wish to try your hand at selling, starting with a simple product.",
        "You are not afraid of rejection and are prepared to deal with customer objections.",
        "You are a good communicator, with good diction and a friendly manner of speaking.",
        "You are willing to learn patiently, turning your own and others' mistakes into personal experience."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Egypt; Italy; Poland; Romania"
    },
    "Data": {
        "Job Location": "Nicosia, Cyprus",
        "Company Industry": "IT Services; Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "9"
    }
}