{
    "Job ID": "4727142",
    "Description": "Position: Senior Product Specialist (Gastroenterology,Urology ,General Surgery/Laparoscopy/Gynecology)Location: Jeddah/Riyadh/KhobarJob Description:To comply with the organization’s mission and value statements.\nTo spend 80% of his time \"effectively\" in the field…\"effectively mean: with influential end users\", influential could be a doctor, nurse, coordinator, purchaser etc.\nTo achieve his annual set sales Target including all financial & non financial indicators.\nTo maintain a good understanding of medical centers structure related to his daily work and their daily practice & present good skills in problem solving and negotiation skills with these personnel for the sake of the customer & Gulf Medical Co.\nActively/professionally excute a pre-assigned sales action plan to generate new sales leads away from competition.\nCoordinate with Superiors to do double calls, international site visits to centers of excellence & supplier visits to execute the sale\nTo prepare/submit/follow up \"submitted offers\" and tenders to generate orders. \nTo prepare sales reports and plan of actions in a timely manner. \nTo maintain healthy intra-office communication and team work spirit.\nHave all the required materials (Brochures, videos etc) available by ordering them from Suppliers.\nEnsure that the existing users are satisfied & well trained to operate on our equipment to maintain a exceptional level of satisfaction & positive reputation.\nUnderstanding & applies the basic principles of KOL management & lead the relation with them towards the grand benefit for the patient & the company.\nTo continuously enhance his product and market knowledge.\nTo spend atleast 70% of his time in the field.\nKnow all procedures in ordering products, delivering them to hospitals & finalizing the hospital acceptance.\nTo be responsible for executing sales and marketing plan in his assigned accounts and product range, Support in symposiums (i.e. setting the booth stand, having marketing materials, demo items & videos on an LCD monitor” etc) and doing demonstrations, workshops, presentations and any other activity related to his accounts as per market demand and/ or his direct manager’s request. \nTo conduct pre and post-sales activities to ensure maximum customer satisfaction including but not limited to: Installation, Training,In-service and all needed Sales actions to process his sales invoice to the final acceptance phase \"by the enduser\" to be collected by GMC finance.Skills",
    "Skills": [
        "Experience:",
        "To have at least 1-2 Years experience in Selling Gastroenterology products like ( Disposables -Endoscopy Towers -Endoscopes - etc..) .\nTo have at least 1-2 Years experience in Selling Urology products like ( Urology Disposables -Urology Towers -scopes - lasers - -etc..) .\nTo have at least 1-2 Years experience in Selling General Surgery/Laparoscopy/Gynecology products like ( Imaging Systems -Telescopes- Surgical Towers -Energy Solutions - Consumables - etc..) .\nAttended live cases & assisted Doctors/Nurses in the Operating room ."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}