{
    "Job ID": "4727258",
    "Description": "Every week we receive more than 100 new applications and calls for the purchase of real estate, spending tens of thousands of dirhams on advertising campaigns. As a result, each broker will be able to receive at least 50 new clients in the first quarter and all close 1-3 deals in the first month.The company has top clients, built relationships with leading bankers, a YouTube channel, working websites and decent growing advertising budgets. The broker himself does not need to look for clients, make cold calls and ring up old databases.Each E&L broker will be able to manage 30-70 clients. This is a great load, and customers are still arriving, so we are looking for new experts in the sale of expensive real estate in Dubai.The result of the broker's work:— an object sold to the client in a new house in Dubai and a decent reward received by the company for the transaction.What you need to do:— prompt processing of incoming customer requests according to the company's standards;— selection of properties and setting up appointments or meetings with clients;— coordination and supervision of the deal until the moment of payment by the client;— a reflection of data about your work in the company's CRM system.Skills",
    "Skills": [
        "The job will suit you if:",
        "— you have experience in real estate and you are proud of the results achieved;",
        "— you are ready to constantly learn and work on your mistakes;",
        "— you communicate coolly, quickly find a common language with people, confidently sell, work out objections, close deals;",
        "— you are considered a pleasant and adequate person, and you look nice;",
        "— you can work productively on several tasks at the same time, while being able to concentrate, carefully read the text of the vacancy and will start the cover letter with the words: \"I want to work in Dubai-Realty.com \". This way we will understand that you are an attentive candidate.",
        "Conditions:",
        "— The average monthly salary in this position: 50 000 - 150 000 dirhams /month (if you earn less than 15,000, we will fire you)",
        "— We pay 30% – 50% from each deal immediately (depends on experience and grade) and without delay on the day of receipt of money into company account;",
        "— Resident visa, insurance and registration under the UAE Labor Law from the first days of work",
        "— Flexible work schedule: two or three office shifts are provided per week;",
        "— We provide a daily volume of customer requests and a convenient CRM system and a complete database for all projects",
        "— Career growth: in 6 months you can grow into the head of the department, in 1.5 years into the head of the division.",
        "A special advantage for you will be:",
        "— Knowledge of English and other languages",
        "— Work experience in a real estate agency in the UAE for at least 3 years",
        "Job bonuses:",
        "— the company does not limit the size of the maximum income — strong brokers can easily earn a month of AED 50 000 - 200 000;",
        "— cozy offices in JLT;",
        "— after each transaction, brokers beat a big gong and receive recognition and congratulations, when fulfilling the monthly sales plan by the whole team at the expense of the company, we go to warm countries: Cyprus, Turkey, and when reaching the first place at the end of the quarter, the best broker receives super prizes from the company, and three strong brokers are invited to a cozy dinner with the founder;",
        "— In the future we plan to launch offices in London and New York, and you can join our team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}