{
    "Job ID": "4727317",
    "Description": "Responsibilities:Responsible for the site supervision of Contractor’s architectural and interior design works. Duties include inspection of the Contractors works, Review and commenting on submittals, forwarding submittals to the concerned designer for response, obtaining samples and quotations when required, preparing reports and recommendations and coordination of all architectural / ID works with other disciplines.Responsible for the site supervision of Contractor’s architectural and interior design works. Duties include inspection of the Contractors works\nReview and commenting on submittals, forwarding submittals to the concerned designer for response, obtaining samples and quotations when required, preparing reports and recommendations and coordination of all architectural / ID works with other disciplines\nReviewing and authorising his inspectors daily reports, preparing his portion of weekly report and giving relevant input to the monthly report of his section of the project.\nReview comments on Material submittals concerning constructability as support to the AOR and witness the field test.\nTo review As-built drawings\nTo report Quality Non-Conformances and to assist in closing out of the same.\nTo report safety violations to HSE Manager during his inspections on site.\nTo work with project site team.\nCoordinate and manage the technical input of other disciplines  during construction stage\nEnsure the satisfactory management and control of inward and outward documentation\nBe able to develop and build client relationships.\nRequired to supervise the work of other members of the team.Skills",
    "Skills": [
        "Requirements:",
        "Degree in Architecture.\nMinimum 14+ years experience in detail design, production of drawings, able to analyse technical/construction build-ability issues and provide drawings and specifications coordinated with engineering and other disciplines. Site execution of Interior design works\nAutoCAD competent and able to work on their own initiative with minimum supervision, within a multi-disciplinary team.\nExperience in a variety of buildings and sectors such as multi residential, leisure, hotels, retail, offices, mixed-use developments.\nAble to interpret project specifications client requirements and constructability requirements.\nAble to prepare project specific quality plans and record and implement essential coordination issues in accordance with Atkins quality procedures\nDesirable Middle East experience.\nGood interpersonal skills, telephone skills and customer focus.\nCreative, energetic and self-motivated.\nWill work as a member of a multi cultural team and be expected to contribute to team performance and demonstrate use of initiative.\nCoordination skills with other disciplines and consultants\nGood organisation skills.\nLateral problem solver.",
        "Rewards and Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultant."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}