{
    "Job ID": "4727897",
    "Description": "Pre-ContractManagement of bonds, insurance, and guarantee logs.\nVerifying interim valuations and preparing payment certificates.\nPreparing variations analysis and recommendations.\nPreparing cost report.\nAttendance and representation at commercial meetings\nAssisting in identifying, analyzing and developing responses to commercial risks.\nReporting to Associate Director on all commercial issues.\nUnderstanding the implications of health and safety regulations.Pre-ContractFeasibility studies (cost per key, cost per m2 etc.).\nCost Planning and estimating (BCIS and NRM1).\nValue Engineering, cash flow forecasts, Whole Life Costing, risk management.\nBills of Quantities production (NRM 2, POMI and CESSM).\nTender services including compilation, tender analysis, negotiations and recommendations.\nContract drafting as per standard formsRewards & Benefits:We offer an excellent package that includes:A competitive salaryTransportation allowanceMedical and life insurance coverAnnual leaveMedical and life insurance coverCompany gratuity schemeDiscretionary bonus schemeAnnual flight allowance to point of originSkills",
    "Skills": [
        "Essential",
        "Bachelor Degree in Quantity Surveying or related\n15 years’ experience as a Quantity Surveyor including 10 years’ supervision experience on similar Projects and 5 years’ experience managing a team of Surveyors.\nExperience working with Cost X or other similar estimating programs is a must\nKnowledge and understanding of the following:\nCost planning (concept design, schematic design & detailed design)\nMeasurement / BOQ in POMI & CESMM\nCollation of Contract Documentation\nUnderstanding of FDIC Forms of Contracts\nLuxury Resorts and Conference Centres\nDemonstrate good understanding of compiling unit rates for estimating",
        "Desirable",
        "Cost Plus Contract Administration Experience\nChartered or working towards MRICS\nExperience in mass Rock Excavation or Mining Work",
        "Behavioral Competencies",
        "Essential (Planning & time management, influencing skills, customer focus etc.)\nSelf-starter\nTask orientated  \nTeam player but able to work independently with minimum supervision\nAble to meet set deliverables\nPunctual\nConfident\nGood communication skills, both oral and written\nAble to act on own initiative and proactive manner"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}