{
    "Job ID": "4727079",
    "Description": "Engineering a better future for our planet and its people.We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects. With offices around the world, we connect people, technology and data to shape the future of our industry and the world around us and because we cover everything from blueprint to delivery, across the entire lifespan of a project, you can count on us for a client experience that is smoother, smarter and more efficient. At Atkins, we’re not just embracing change – we’re driving it. Saudi Arabia continues to be an exciting location, with ambitious growth and transformational plans to support Vision 2030 and involvement with many of the mega projects including NEOM, AlUla, AMAALA, and more. Atkins is positioned to grow its position as a leading provider of technical solutions to many of the opportunities with ambitions to grow further in 2023.  Responsibilities:Lead projects with complete design and delivery ownership reporting to Practice Lead. \nTake ownership and lead urban design/pubic realm projects and work packages. \nDesign manage multi-disciplinary urban development projects in the wider context of key business sectors. \nLiaise with key clients and technical and non-technical stakeholders for positive project outcomes. \nDraft technical reports and contractual documents, of acceptable technical and presentation quality with minimum guidance. \nWork to a program for the project and proactively advise Senior leadership of any issue which affects the efficient completion of the project. \nEnsure the team is aware of the design standards, codes and compliances of countries within the ME region and the same are compiled to in the Design. As applicable to each country within the MENA. \nReview work of project teams within LUDP and ensure the quality of deliverables meet the Atkins standards of delivery and client expectations. \nDemonstrate strategic thinking to expand the landscape & urban design business across different regions and develop business within the practice. \nCan contribute to bids and proposals to win work. \nCan cross- over through design thinking between the three disciplines of the practice on large scale projects. \nDelegate & manage work to assigned project team Landscape Architects/urban designers/multidisciplinary proficiencies and obtain the necessary outcome for the projects as per contractual obligations of the project. \nUse business related software independently with ability to guide work of junior team members. \nSuccessful in identifying and following through on leads/suggestions associated with additional work prospects on the projects they are involved with. \nThe individual will be required to travel at times to the different Atkins office and sites globally and interface with the team based there. Rewards & BenefitsWe offer an excellent package which includes:A competitive salary \nTransportation allowance \nMedical and life insurance cover \n22 calendar days annual leave \nMedical and life insurance cover \nCompany gratuity scheme \nDiscretionary bonus scheme \nAnnual flight allowance to point of origin \nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants Skills",
    "Skills": [
        "Requirements",
        "Must have good experience delivering Urban Design/Public Realm projects in the public or the private realm for minimum of 12 years. \nMust be familiar with design, tender and construction processes. International experience specific to ME and beyond will be considered an added advantage. \nMust be proficient in design, project management, efficiency matrices. \nMust be conversant of the evolving standards of the profession primarily with respective to collaborative and multi-disciplinary design. \nMust be proficient in AutoCAD, REVIT, Adobe CS5, MS Office, Sketch up and Google Pro. Advanced experience of BIM related software in Landscape Design/Infrastructure works will be considered an added advantage. \nA Master’s Degree in Urban Design/Landscape Architecture from universities of International repute is a must. \nCMLI & ASLA qualified professionals shall have an added advantage \nExcellent communication skills in written and spoken English. \nCapable of working on own initiative or as part of a larger multidisciplinary team. \nHave a logical and organized approach to project delivery and able to follow instructions and guidance by senior team members. \nBe aware of the effect of delivery time on financial performance and proactively manage time, resources and budget on a project. \nAble to identify and communicate concerns of the project/team to immediate Line Manager. \nAble to mentor and help subordinates and peers to achieve career progression. \nAble to discuss career goals and aspirations. \nWillingness to share information and knowledge with team members. \nDemonstrate initiative and basic leadership skills to give directions to interdisciplinary work group. \nExperience of working in virtual teams is a plus "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}