{
    "Job ID": "4727050",
    "Description": "Responsibilities:Carry all roads design activities for projects and studies in various development stages: pre-feasibility, feasibility, concept design, basic design, detailed design and permitting.\nDesign of grade-separated interchanges and complex interchanges.\nDesign of junctions of roundabouts and signalized junctions both horizontally and vertically and the development of site grading.\nDesign the Roads in a 3D environment.\nDesign of road cross-sections and generating earthwork quantities from the 3D model.\nPavements design and pavement design reports.\nWork coactively with the design team, and collaborate closely with other disciplines ensuring their requirements are fulfilled.\nProvide design support during the construction stage.\nAttend team and project meetings.\nCascade information to the team as required.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor’s degree in Civil Engineering – Roads\n5-8 years of relevant roads design experience\nStrong knowledge of Authorities’ regulations in UAE and international standards\nKnowledge in Geometric design of roads and highways (horizontal alignments, vertical alignments, cross-sections, signing and marking) according to local and international standards (AASHTO, etc.)\nAbility to explain design ideas and plans clearly\nRevit, Civil 3D proficiency\nExcellent communication skills\nImmediate availability is preferred",
        "What We Offer:",
        "When you join Al Suweidi, you become part of a company that is consistently progressing. We ensure a workplace that encourages growth, flexibility and creativity supported by company leadership. Our teams are involved in innovative projects and programs of our time and addressing the big challenges today. Our core values define who we are and how we act. We believe in each person’s potential, and we’ll help you reach yours.",
        "Please note that only candidates meeting all specifications will be contacted.",
        "We recommend you follow us on LinkedIn and view our website to keep yourself updated regarding all our vacancies."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}