{
    "Job ID": "4727144",
    "Description": "Repairs\nPerform all type of mechanical repairs and maintenance works to the vehicle as per the write up provided in the Repair Order.\nPerform routine and scheduled maintenance services such as oil changes, lubrications and tune-ups.\nStudy the Repair Order with details of the customer complaints and diagnose the cause. Further prepare the proper repair estimate and submit to Team Leader / Job Controller for approval.Process\nEnsure to meet the accurate timescale given for each repair works.\nFollow the Manufacturer Service Process.\nInform Supervisor if any delay in the repair when the completion time cannot be met.\nEnsure all the repairs carried out are properly authorized including warranty repairs.\nPut forward suggestions to the Team Leader / Job Controller in relation with proper repairs to be done.Keeping\nFollow the safety and security standard of the company.\nMaintain the highest quality and dealer standards in all repair works carry out.\nEnsure proper maintenance of tools and equipment required to perform the repair job and keep correct record of tools in hand.\nMaintain the general cleanliness of the workshop and specific working bay at all the time.\nFollow the manufacturer warranty standard procedure for warranty repairs.Training:\nParticipate in the In-House technical training program.\nEnsure to complete all technical training as per the manufacturer curriculum standard.\nComplete technical certifications as per dealer standard.\nKeep up to date with technical information and Service Bulletin.KEY RESULTS AREAS / DELIVERABLES: (What are the areas or major activities which will produce the contributions that the company expects from the job?)KEY ACTIVITIES: (What are the essential actions and initiatives that are needed to be performed in order to achieve the mentioned KRA?)Hoc Activities\nCarry out other tasks and activities as and when requested by Management, within the context of the Division’s scope and requirements.\nCarry out instructions or request on time and to the satisfaction of the requestor.\nRespond to other tasks/instructions related to Maintenance work.·  Provide assistance to teammates in case of problems without sacrificing their own work.·  Carry out other tasks and assignments, besides the roles and responsibilities defined above, as assigned by the Division Management.Skills",
    "Skills": [
        "   5 years relevant work experience with the Automobile Dealer specifically in FCA Stellantis (Chrysler, Dodge, Jeep and Ram) only.",
        "Must have curriculum FCA level 2-3 certificate"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}