{
    "Job ID": "4727159",
    "Description": "Responsibilities:Carry out Building Services Electrical Engineering Design on Lighting and power design to British, and local Standards.\nCandidate shall review the Contractor Model, in managing the project controls (time and budget) through 4D and 5D models.\nCoordinate with Architects, Structural Engineers and Mechanical Engineers and any other design consultants.\nCoordinate with, instruct and supervise Electrical Engineers and Auto CAD Technicians.\nCarry out arithmetical checks and independent design checks of other Engineer’s design and design reviews.\nReport to Head of the MEP Department.\nResponsible for the correctness and accuracy of their own work and the work of the team. Complete engineering work within the agreed programme, or notify the Head of MEP Department if not.\nResponsible for the checking of CAD works done under their supervision.\nTo instruct CAD operators in all project related matters.\nTo adhere to QA procedures and advise Engineers/Technicians.\nTo coordinate on a day-to-day basis for which the design of projects they have been appointed with other members of the design team.\nCompile Tender Documents.\nManage Electrical project Local Authority (UPDA) DC1 and DC2 submittals.\nEvaluate Contractor submittals and write reports.\nAnalyse problems, develop solutions.\nMinute and Report writing skills.Rewards & Benefits:A competitive salary will be offered to the right candidate\nAccommodation allowance\nTransportation allowance\n26 working days annual leave.\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual return airfare to point of origin.Skills",
    "Skills": [
        "Requirements:",
        "Full-time degree qualified in Electrical Engineering or similar.\nA minimum of 11 plus years’ in capacity as a Electrical Engineer and 15 plus years’  in capacity as a Senior Electrical Engineer with site supervision experience of working in Theme Parks and Entertainment projects\nCandidate shall have experience/worked in Theme Parks and Entertainment Complexes.\nCandidate shall be experienced in handling projects using BIM models developed to 4D & 5D levels.\nMember of IET (or equivalent)\nCEng qualification preferred\nExperience in Middle East\nUnderstanding of district cooling principals"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}