{
    "Job ID": "4727900",
    "Description": "Performance:Effective delivery of site-wide logistics through the procurement of a site-wide Logistics management contractor. Define and monitor that the scope of services is delivered satisfactorily through setting and monitoring of measurable goals and objectives around the following broad key enablers:\nOrderly, safe and efficiently movement of labour, plant, and materials around site.\nPlanning the location of haul roads, laydown, external access and offloading zones to minimise obstruction and impacts to programme.\nCreation of a secure, well maintained site with regular (weekly) logistics meetings.\nEfficient and orderly management of any worker’s accommodation.\nDevelopment of processes, procedures and induction programmes.\nSupply chain management, movement plans and lookahead forecasting.\nEnsuring logistics activities are not a constraining factor on the program\nCreating of site-specific safety manual, with appropriate first aid cover and equipment present\nDevelop, maintain and update the Site Emergency Plan.\nEnsuring information is communicated effectively around the site.\nPlanning for effective signage in line with corporate branding\nEfficient management of any special public access roads – access to show houses/sales pavilions etc.\nProvision of an effective security management system that ensures all the above is achievable.Change Management:Variations and adjustments to Logistics Contractors scope, review the requirements and assess the impacts. Monitor construction change management process via the Engineer.Permitting:The Logistics Contractor’s acquisition of all necessary permits for smooth logistics operations.Cost:Review completeness of established budgets and review cost plans. Ensure that work is re-measured and work is signed off in accordance with the contract.Planning: The monthly detailed graphical time slice showing plot and infrastructure activities and how logistics will support. Review weekly plans, confirm the activities are accurate and coordinated across stakeholders.Risk:Review detailed risk register developed by logistics contractor and team coordinated with all site stakeholders, complete with implement mitigation plan.Interface:Provide coordination across all programme consultants and stakeholders related to logistics works. Provide support to plots in terms of external access and influences that impact plot activities.Communication:Through regular meetings, highlight issues, concerns and roll out weekly directions to stakeholder’s team managers. Seek resolution to any issues with the respective plot, infrastructure or logistics teams or escalate with the proposed mitigation plan.Reporting:Weekly issues through detailed logistics dashboards.Assurance: Submission of checklists of all logistics contractor self-audits (QA, Safety, Environmental, Welfare etc.) review and report on status.Salary and Benefits:A competitive salary \nAccommodation allowance \nTransportation allowance \nMedical and life insurance cover\nCompany gratuity scheme \nDiscretionary bonus scheme\nAnnual flight allowance to point of origin Skills",
    "Skills": [
        "Qualifications Required:",
        "Bachelor's Degree in Engineering, Real Estate Development etc.",
        "Beneficial qualifications:",
        "CSCS, SMSTS/SSSTS, Recognised safety program (qualified and up to date), First Aid, Lifting Supervisor Certification, Traffic management, Institutional membership.",
        "Experience Required:",
        "More than 15 years as a strategic and operations executive in a range of dynamic start-up, growth and stable corporate environments. Management of complex, matrixed team environments across multiple cultures. \nGlobal experience with the cycle of new business creation, investment analysis, portfolio creation and management and industrialised processing.\nLine management P&L experience including cashflow forecasting and management, financial reporting, review and structure of complex financial transactions.\nFluent in English (read, write and speak).",
        "Auxiliary Requirements:",
        "Professional/lead by example.\nPassion/can do attitude/constructive challenge.\nTo hold a proven track record of integrity and ethical behaviours\nOpen to change/new ideas\nShare information\nSupportive\nCustomer focused\nArabic speaking an advantage but not essential.",
        "Core Competencies:",
        "Analytical Thinking, Communication, Financial Management, Leadership, Management, Negotiating, Presentation Skills, Project Management, Technical Functional Knowledge, Written Communication."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}