{
    "Job ID": "4727452",
    "Description": "Oversee daily cafeteria operations, ensuring efficient food service and customer satisfaction.\nManage and train cafeteria staff, including cooks, servers, cashiers, and support personnel.\nMaintain food quality, portion control, and presentation according to established standards.\nCollaborate with kitchen staff to create and update the cafeteria menu.\nMonitor inventory levels and order supplies and ingredients as needed.\nImplement cost-control measures to optimize expenses without compromising quality.\nAddress customer feedback and complaints promptly and professionally.\nEnsure compliance with health and safety regulations and obtain necessary licenses and permits.\nAnalyze financial data, manage the cafeteria budget, and implement pricing strategies.\nConduct training programs for staff on food preparation, customer service, and safety protocols.\nImplement sustainable practices such as waste reduction and energy conservation.Skills",
    "Skills": [
        "Minimum of 5 years experience as a cafeteria/restaurant manager or in a related food service management role.\nStrong leadership and interpersonal skills.\nExcellent communication and problem-solving abilities.\nKnowledge of food safety and health regulations in cafeteria settings.\nUnderstanding of cost management and financial analysis.\nAbility to work in a fast-paced environment and handle multiple tasks.\nFlexibility to work during cafeteria operating hours, which may include early mornings, evenings, and weekends.\nA degree or diploma in hospitality management, food service, or a related field is preferred but not mandatory.",
        "As a Cafeteria Manager, your dedication to providing exceptional food service, ensuring customer satisfaction, and efficiently managing cafeteria operations will be critical to creating a positive dining experience for all patrons. Your ability to lead and inspire your team will be essential in maintaining the cafeteria's success and contributing to the overall well-being of the organization or institution it serves."
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}