{
    "Job ID": "4727666",
    "Description": "Organize internal audit in accordance with Company , QHSE Manual and ISO standards\nManagement of external ISO audits\nRecording and controlling of non-conformities observed in internal and external audits\nMaintaining the QHSE Manual\nConduct the Management Review Meetings, Arrange Customer Feedback\nController of plant policies and procedures\nEffective document organization structure that shall contain documents that satisfy the contractual, statutory and regulatory requirements\nReview of all the documents master list every 3 months\nReview of IMS documents for IMS management and audits\nEnsures necessary information to Company's Employees of any change in document organization structure or uploading of new documents / version in shared folder\nOnly approved latest version of documents is available in shared folder and referred\nReceiving all the contractors, Manufacturers technical Manuals and drawings according to Company's classification system procedures, incorporating updates as necessary under defined process.\nOrganizing all the documents and drawings according Company's classification systems in easy to use and reach the requirements of the power plant.\nManage Borrowing drawings and manuals for the staff and new contractors of the power plant with recording system.\nFiling all the inspection and testing reports.\nMaintain lists for all plant units\nManagement of data room\nPrepare the annual Internal Audit program and get it approved by Engineering Manager\nMaintain, follow-up and update the Audit program.\nPreparing the audit reports with relevant details (i.e., observations, potential impact, risk rating, recommendation, management response, etc.) for the review of the Engineering Manager.\nDiscuss the audit observations and recommendations with the relevant process owners.\nEnsure that sufficient & appropriate audit evidence are obtained, reviewed, and documented to support the audit conclusion.\nRegular follow-up with the action owner/Management for the implementation of recommendations action plan and validation/verification of the same.\nManage and monitor all audit findings included internal and external.\nMaintain, follow-up and update the internal auditors list and ensure the auditors are ISO and OSHAD certified.\nEnsure appropriate communication between auditors and auditee.\nLead by example to maintain and improve high safety standards in accordance to Company's QHSE procedures. Responsibility to enroll in safety tours and submit observation cards related to HSE frequently.\nPerform additional duties and responsibilities as required by Line Managers.Skills",
    "Skills": [
        "Bachelor’s Degree in a relevant field is essential.\nQualified Lead auditor for ISO and OSHAD\n5 years of experience in Internal Audit and External Audit.\n1+ year of experience in Operation and Maintenance functions.\nExpert skills in risk management, auditing best practice, accounting, process management, governance, and management principles.\nAbility to provide high level and detailed perspectives of audit issues.\nExperience in MS Office."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Electric Power Production & Transmission",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}