{
    "Job ID": "4727565",
    "Description": "Reports to: CEO Purpose Of Job:To be responsible to perform highly diversified administrative and secretarial duties and act as a liaison between the CEO office and outside departments / agencies ensuring the smooth administration of the CEO office, to involve in general office administration and perform other administrative assignments, as required.  Key ResponsibilitiesØ To manage priorities and track the CEO calendar, telephone calls / messages / emails and deliverables, to ensure that daily workload is balanced. To interpret requests and help implement action.Ø To provide day to day secretarial services, drafts and prepares non-routine letters, memos, documents and various reports requiring comprehensive knowledge of methods, procedures, policies and organization for the CEO.Ø To prepare and circulate minutes of meetings as instructions given, and to follow up on execution of decisions taken in the meetings, prepare special or one-time reports, summaries, or replies to inquiries, selecting relevant information from a variety of sources.Ø To make appointments, ensure and coordinate travel and all logistics arrangements and other administrative matters concerning the CEO and inform him of any emergency matters during his absence.Ø To assist the CEO in preparation of presentations and general correspondence related to the office activities.Ø To coordinate the signing and tracking of documents including approvals and delegation of authority. To review incoming memos, reports and other documents to determine their importance and plan for their distribution.Ø To provide accurate record and file maintenance and ensure that all facilities related to the CEO office are available and maintained.Ø To maintain office services by organizing office operations and procedures; controlling correspondence; designing filing systems. To maintain office efficiency by planning and implementing office systems, layouts, and equipment procurement.Ø To ensure security, integrity and confidentiality of data and to maintain security of all confidential documents.Ø To act as a focal point to meet and greet senior personnel arriving to meet the CEO at the office, also to take messages, respond to highly diversified inquiries from members of Company management, employees and the general public. Provide courteous responses to phone inquiries determining from experience and training the limitations on the extent and type of information, which may be provided.Skills",
    "Skills": [
        " ",
        "1.    Requirement open for all nationals",
        "2.    Bachelor’s degree.",
        "3.    Must be bilingual.",
        "4.    10 years of experience",
        "5.    Knowledge of office administration and office procedures.",
        "6.    Knowledge of Company policies and procedures  "
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}