{
    "Job ID": "4727538",
    "Description": "Responsibilities:Handling the design of electrical distribution network components for different types of buildings, previous experience in different types of projects; offices, residential, commercial buildings..etc.\nPreparation of Single line diagrams and distribution network strategy.\nPreparation of Electrical load Lists & Switchgear/Distribution Board Schedules.\nDesign of medium voltage networks.\nSizing of main electrical equipment, Cable sizing, breaker sizing, CT sizing, power factor correction, lighting, earthing & lightning system.\nPreparation of electrical systems layout drawings - Electrical equipment, interior and exterior lighting, street lighting, small power, cable routing, earthing, lightning protection, motor control centers schedules, experience in Fire Alarm system is preferred.\nAssist senior engineers in the technical works of the project.\nCommunicate efficiently with different stakeholders of the project.\nUndertake liaison with system engineers, third parties and specialist system suppliers and incorporate their requirements in the detailed design.\nCoordinate with all other disciplines and improve inter-discipline working with other disciplines such as Architecture, civil, structure and mechanical.Skills",
    "Skills": [
        "Requirements:",
        "2 to 5 years of proven experience in a similar role within engineering or consultancy firm.\nHave the ability to the well understanding and interpretation of international codes and standards (BS, IEC, IET, NEC, NFPA, CIBSE, IESNA, ISO,..etc)\nFamiliar with the local country codes of middle east and gulf countries.\nExperience in working with Revit, BIM 360, Navisworks, and other BIM tools is a must.\nProficiency in the following software list:\nDialux, Relux and Dialux Evo. ETAP. ProDesign. Generator sizing software. Lightning protection calculation software. (IEC, strikerisk,..etc) MS – office\nBachelor’s degree in electrical engineering from a reputable university with minimum overall grade of “Very Good”.\nExperience of working in Multi-D environment and good understanding of co-ordination and interfaces with other disciplines.\nAbility to work in multi-cultural multilingual environment.\nOpen to new ideas and innovative approaches.\nBe a competent user of IT tools in particular Word, Excel, Outlook and Electrical design tools e.g. Amtech, dialux etc.;\nProficiency in Revit , BIM 360, AutoCad is a must.\nWider knowledge of other disciplines is desirable;\nResponsible for completion of specifically assigned tasks to time and cost.\nAble to work as reliable and pro-active member of the team.\nExcellent command of English language. (Writing and speaking)\nGood communication, presentation and listening skills.\nWriting professional reports.\nIdentifies and communicates concerns to immediate supervisor.\nPossess capability to take individual responsibilities.\nWillingness to share information and knowledge with team members.\nShows flexibility in work tasks, locations and flexibility to work with teams in a different time zone."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}