{
    "Job ID": "4727314",
    "Description": "JOB RESPONSIBILTIES:-Prepare work sheet analysis and segregate category of work involved in the project proposal.\nEvaluate quotations obtained from different suppliers & subcontractors, ensure quantities and specifications are in line with tender and projects specifications.\nSubmit a consolidated (BOQ) Bill of Quantity in the format required by the client.\nAssist in preparing cost estimate for different phases of the project, advice the project management on possible cost over runs and on the action necessary to remain within the approved project budget.\nWork very close with the project team to ensure that measurements, variations and contractual matters are properly recorded and notified.\nPerform material take offs prior to the purchase requisitions for the projects and report any irregularities or discrepancies to the project management.\nInitiate contractual correspondence and attend meetings as required by the contract manager and project manager to ensure that company’s interests are protected always.\nPerform and implement all post contract duties including but not limited to measurements, preparation of variations orders, analysis of site design changes, interim valuation certificates, final accounts and evaluation reports.\nMaintain proper records of agreed measurement-oriented/Item rate variation with the client’s authorized representative and ensure compliance with such rates.\nExamine, control and evaluate sub-contractors invoices and ensure the contractual obligations are satisfied and advice the project management on payments of the same.\nAssist in collaboration with the Project Manager in collecting the data to prepare financial reports and cash flow forecasts and financial and contractual matters related to work on site.Skills",
    "Skills": [
        "QUALIFICATIONS & SKILLS:-",
        "Bachelor engineering in Electrical/ Mechanical Engineering with 5+ years’ experience in similar roles preferably in MEP Industry.\nWell versed with all QS computer programs to assist his calculations and must be familiar with ISO standards;\nStrong MS Office skills and advanced knowledge of estimating software programs.\nStrong verbal and written communication skills.\nExecution experience on few projects will be an added advantage.\nAble to read drawings, properly measure quantities, study contractual and tender documentations and prepare invoices, variation orders, control subcontractors invoices and work performed, quality and quantity of material ordered and supplied. "
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Electrical Engineering; Mechanical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}