{
    "Job ID": "4727315",
    "Description": "To implement all aspects of the quality management systems and control site supervision activities provision related to ICT, Security and Audio Visual Works across the project, to deliver quality installations in accordance with the contract documents, relevant international standards and local authorities’ requirements.Responsibilities Lead ICTS EngineerResponsible for site implementation of IT, Telecom, Security system (Access control, CCTV, Intercom, Gate barrier), Audio Visual system (Digital signage, IPTV, Meeting room/Training room requirement, Public Address and Background Music) and Guest Room Management system services as per project requirement.\nImplement the site supervision quality procedures, and review submission requirements of the project, along with the MEP and ICT&S contractor.\nReview all construction documents and highlight any design and contractual discrepancies with the concerned RE / SHOE.\nEnsure that all statutory authority NOC’s / permits / design approvals are available on site for construction.\nEnsure that the main contractor and nominated ICT&S contractor coordinate with all concerned authorities departments and ensure that their requirements are adequately and satisfactorily incorporated.\nExtend the maximum possible effort to avoid contractor(s) claims for cost and/or delay.\nPrepare process control sheet for ICT, Security and AV works in conjunction with SHOE during the Enabling Works / Main Contract Works.\nReview and forward any comments on all submittals including contractor design drawings, shop drawings, materials and alternative proposals submitted by contractors.\nConduct regular (daily) site visits and supervise, certify the installation of ICT&S related services ensuring compliance with the contract documents.\nReview and forward any comments on the contractor’s method statement for installation, execution of the works.Rewards and Benefits:We offer an excellent package which includes:A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSkills",
    "Skills": [
        ".Technical Expertise: Strong knowledge and expertise in various ICT areas, such as network infrastructure, systems administration, cybersecurity, software development, cloud computing, databases, and telecommunications.\nLeadership Abilities: The ability to lead and inspire a team of ICT professionals, providing guidance, direction, and support in achieving project objectives and goals.\nProject Management: Proficiency in planning, executing, and monitoring ICT projects, ensuring they are completed on time, within budget, and according to specifications.\nProblem-Solving Skills: The capability to identify and resolve complex technical issues and challenges that may arise during project implementation or daily operations.\nCommunication Skills: Excellent verbal and written communication skills to effectively interact with team members, stakeholders, and clients, as well as to convey technical concepts to non-technical audiences.\nAnalytical Thinking: The ability to analyze data, trends, and performance metrics to make informed decisions and optimize ICT processes and systems.\nTeam Building: Skills in building and nurturing a collaborative and productive team environment, fostering innovation and encouraging professional growth among team members."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}