{
    "Job ID": "4727086",
    "Description": "ResponsibilitiesConceptual Design: Collaborate with clients and project teams to develop innovative and creative architectural design concepts that meet the project requirements and align with the client's vision.\nTechnical Expertise: Apply your extensive knowledge and experience in architectural design principles, building codes, and regulations to ensure the feasibility and functionality of design concepts.\n3D Modeling and Visualization: Utilize Rhino software to create detailed 3D models and visualizations that accurately represent design concepts, enabling effective communication with clients and stakeholders.\nRevit Documentation: Develop comprehensive architectural drawings and documentation using Revit software, including plans, elevations, sections, and schedules.\nCoordination and Collaboration: Collaborate with multidisciplinary teams, including engineers, interior designers, and contractors, to integrate design solutions and ensure the successful implementation of projects.\nClient Interaction: Engage with clients to understand their design needs, present design proposals, and address any questions or concerns throughout the project lifecycle.\nProject Management: Manage multiple design projects simultaneously, ensuring adherence to project timelines, budgets, and quality standards.\nResearch and Innovation: Stay updated on emerging design trends, technologies, and materials, and integrate them into the design process to enhance the quality and efficiency of projects.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants.Skills",
    "Skills": [
        "Qualifications",
        "Education: Bachelor's or Master's degree in Architecture from an accredited institution.\nExperience: Minimum of 15 years of professional experience in architectural design, preferably with a focus on commercial, institutional, or residential projects.\nSoftware Proficiency: Excellent knowledge and proficiency in Rhino and Revit software is essential. Familiarity with other design tools such as AutoCAD, SketchUp, and Adobe Creative Suite is a plus.\nDesign Skills: Strong design sensibility, with the ability to develop innovative and aesthetically pleasing architectural solutions that align with project goals and client requirements.\nTechnical Expertise: Thorough understanding of architectural design principles, building codes, regulations, and construction processes. Experience in sustainable design practices is desirable.\nCommunication and Presentation: Excellent verbal and written communication skills, with the ability to effectively present and communicate design ideas to clients, stakeholders, and project teams.\nProject Management: Demonstrated ability to manage multiple projects simultaneously, prioritize tasks, and meet project deadlines.\nCollaboration: Proven experience collaborating with multidisciplinary teams and coordinating with various stakeholders to integrate design solutions effectively.\nProblem-Solving: Strong analytical and problem-solving skills, with the ability to identify and address design challenges and propose innovative solutions.\nPortfolio: A comprehensive portfolio showcasing your design skills, technical expertise, and experience in architectural design projects."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}