{
    "Job ID": "4727785",
    "Description": "Oversee and manage the Smart Repairs Business Unit, ensuring that all workshops conduct repairs to a high standard, within budget, and in a timely manner. Develop and implement strategies to improve the efficiency, productivity, and profitability of the business unit, while maintaining a high level of customer satisfaction. Build and maintain relationships with key stakeholders and ensure compliance with all relevant industry standards and regulations.OperationsDevelop, implement, and monitor repair procedures to ensure high-quality repairs and maximum efficiency.\nMaintain a thorough knowledge of all products and services that the business offers.\nMonitor repair progress, identify problems and make adjustments to repair plans as needed.\nEnsure that all work is completed within agreed-upon timeframes and meets the highest standards of quality.\nEnsure compliance with all relevant regulations and standards.\nDevelop the business by promoting the products and services to outside companies within KSA susceptible of requiring Smart repair solutions.\nOversee inventory management to ensure that the necessary products are available to achieve sales targets and fulfill both internal and external demand.\nEnsure good level of communication and cooperation with franchise partners. FinancialManage and control budget, including forecasting, budget preparation and monthly/quarterly budget reviews.\nDevelop and implement financial systems and procedures.\nTrack financial performance against targets.\nIdentify areas for cost savings and improvement.\nEnsure that all expenditures are authorized and recorded accurately. Customer ServiceIdentify customer needs and create processes to address them effectively.\nTrain staff to address and resolve complaints.\nDevelop control mechanism to maintain high standards of customer service and a healthy NPS score. Staff ManagementRecruit, hire, and train staff members based on departmental requirements and workload.\nDevelop and implement training programs to ensure staff members have the skills and knowledge required to perform their duties effectively.\nEstablish and maintain performance standards and KPIs for staff members.\nMonitor staff performance, provide feedback, and take corrective action where necessary.\nManage departmental resources and allocate workloads to ensure maximum efficiency and productivity.Skills",
    "Skills": [
        "Technical Background in Collision Repair, Auto Detailing, Paint Protection, Window Tinting,\nManaged P&Ls and budgets\nExtensive management/leadership experience\nOpen to All Nationality"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$8,000 - $9,000",
        "Number of Vacancies": "1"
    }
}