{
    "Job ID": "4727881",
    "Description": "Pre-Tender Activities:The Procurement Manager will provide insights and ideas into the creation of the procurement strategies based on the specific details and programme requirements of the Project. This process will be led by the Procurement Lead and/or Regional Procurement Director, however input will inevitably be required from the Procurement Manager.Process & Procedures Drafting and Implementation:The Procurement Manager will be responsible for the drafting and implementation of the Project specific standard procurement templates and procedures. This will be done in conjunction with both the Client and their appointed consultants and representatives. Once approved by the Client, the procurement policies and procedures created will then be packaged and disseminated to the PMC teams. The Procurement Manager will also be responsible for ensuring that the Project procurement processes and procedures are being effectively implemented at the PMC level. The standard templates and procedures manual will be reviewed with the Procurement Lead and/or Regional Procurement Director as required.PMO Procurement Packages:It is anticipated that there will be a variety of early start activities that will be procured directly by the procurement team rather than the specific PMC’s. The breakdown of these has not yet been confirmed but is likely to include the site set-up activities and any early appointments required to meet initial project milestones. For those packages that are required to be procured by the F+G procurement team, the Procurement Manager will be responsible for the successful delivery of the following procurement activities:Procurement Management for the full procurement lifecycle\nExpressions of Interest issuance & process management\nPre-Qualification of potential consultants & contractors and the issue of Non-Disclosure Agreements (NDA) if required by the Client\nIssuance of RFP or ITT to approved list of Tenderers\nCreate, agree and administer the Tender Evaluation Matrices\nTechnical evaluation reports for tenders returned (with Client and/or appointed representative assistance as required or instructed)\nCommercial evaluation reports for tenders returned\nPost Tender Negotiations\nFinal Tender recommendation based on the combined scores (Technical & Commercial)\nContract Award based on Client approval to proceedPMC Procurement Packages:It is anticipated that a variety of procurement activities will take place at the PMC level. The role of the F+G procurement team for these activities is in providing the process workflows, procedures manual and standard templates for each of the PMC’s to utilise during the procurement lifecycle. The Procurement Manager will be responsible for reviewing that these processes are being adhered to and will where necessary provide input and recommendations for any amendments.Post-Contract Activities:The Post Contract Activities undertaken by the F+G procurement team focuses around collecting live data on stakeholder performance as well as the administration of the various procurement related trackers being issued at the PMC level. The Procurement Manager will be responsible for ensuring that the procurement team gains up to date market knowledge from live projects as well as identifying processes & procedures and/or templates that may need revision to improve efficiency. This is a continuous process which will be undertaken with oversight from the Procurement Lead and/or Regional Procurement Director.Reporting and Performance Tracking:The Procurement Manager will be responsible for reporting procurement progress in the form of trackers and reports that are provided by the Procurement Specialist. The Procurement Manager will be responsible for motivating and administering the F+G procurement team effectively and ensuring that deliverables are being met in-line with Client expectations. The Procurement Manager will also review the updates on future workload regarding procurement deliverables, especially those that are on the critical path. This is to ensure that the procurement activity pipeline is being monitored and that any potential issues are escalated and resolved.Skills",
    "Skills": [
        "Pre-Qualification of potential consultants & contractors and the issue of Non-Disclosure Agreements (NDA) if required by the Client",
        "Rewards & Benefits:",
        "We offer an excellent package which includes:\nA competitive salary\nTransportation allowance\nMedical and life insurance cover\nAnnual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}