{
    "Job ID": "4727736",
    "Description": "تحقيق أهداف المبيعات: تحديد وتحقيق الأهداف الشهرية والربعية والسنوية للمبيعات بناءً على الخطط والاستراتيجيات المحددة من قبل الإدارة.\nالعمل على توسيع قاعدة العملاء: البحث عن عملاء جدد وإقناعهم بجودة منتجاتنا وفوائد استخدامها في مجالات الجمال والعناية.\nتقديم المشورة والتوجيه: تزويد العملاء بمعلومات تفصيلية حول المنتجات والمستحضرات المختلفة المتاحة وتقديم المشورة الشخصية لمساعدتهم في اختيار الخيار الأفضل لاحتياجاتهم.\nإدارة حسابات العملاء: بناء وصيانة قاعدة بيانات العملاء، وتحديث السجلات والمعلومات المتعلقة بالعملاء بانتظام.\nتنظيم فعاليات وعروض ترويجية: التخطيط والمشاركة في المعارض والفعاليات التجارية المختلفة للترويج للمنتجات والزبائن المستهدفين.\nمتابعة المبيعات وتقارير الأداء: تتبع أداء المبيعات وتحليل النتائج وإعداد التقارير الدورية للإدارة.\nتطوير العلاقات العملية: بناء والحفاظ على علاقات موثوقة مع العملاء ومعرفة احتياجاتهم وملاحظاتهم والعمل على تلبية تلك الاحتياجات بفعالية.Skills",
    "Skills": [
        "خبرة في مجال مستحضرات التجميل والعناية: يفضل أن يكون لدى المتقدم خبرة سابقة في مجال المبيعات المرتبط بمستحضرات التجميل والعناية.\nيجب وجود اقامة قابلة للتحويل.\nيجب وجود سيارة ورخصة قيادة سارية.\nمهارات الاتصال والإقناع: قدرة على التواصل بفاعلية مع العملاء وإقناعهم بقيمة المنتجات وفوائدها.\nالالتزام بالنتائج: القدرة على تحقيق الأهداف المحددة والعمل بجدية لتحسين الأداء وزيادة المبيعات.\nالعمل الجماعي: القدرة على العمل ضمن فريق مبيعات ودعم باقي أعضاء الفريق لتحقيق النجاح المشترك.\nالمعرفة التقنية: فهم عملية التسويق ومفاهيم المبيعات واستخدام التكنولوجيا لتعزيز أداء المبيعات والتواصل مع العملاء.\nالنظام والتنظيم: القدرة على التخطيط وتنظيم الجدول الزمني وإدارة الوقت بفعالية لزيارة العملاء وتلبية احتياجاتهم."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Dammam, Saudi Arabia ; Northern Province, Saudi Arabia ; Riyadh, Saudi Arabia ; Southern Province, Saudi Arabia",
        "Gender": "Male",
        "Degree": "High school or equivalent",
        "Age": "Min: 20 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Perfume & Cosmetics",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}