{
    "Job ID": "4727259",
    "Description": "Responsibilities:Responsible for the review of mechanical design contents as assigned together with its follow-up for Authority and Client's approval.\nResponsibilities include mechanical drainage, water supply, gas, HVAC, fire protection and as well as other related mechanical utility systems.\nResponsible for the preparation and review of mechanical design calculations, drawings, specifications, and tender documents for the design projects.\nResponsible for participation in the progress and coordination meetings of the design projects and the preparation of the meeting records.\nLiaison and coordination with all applicable Local Authority Departments to obtain approval on design projects.\nReview of works produced by the mechanical engineers and the necessary coordination with other Atkins discipline Engineers as applicable for the continuity of the design projects.Rewards & Benefits:A competitive salary will be offered to the right candidate\nAccommodation allowance\nTransportation allowance\n26 working days annual leave.\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual return airfare to point of originSkills",
    "Skills": [
        "Requirements:",
        "Full-time degree qualified in Mechanical Engineering or similar from a reputed university.\nA minimum of 11 plus years’ in the capacity of for a Mechanical Engineer and 15 plus years’ in the capacity of for a Senior Mechanical Engineer site supervision experience of working in Mechanical Building Services Engineering involving HVAC, Controls, Plumbing, PHE, Fire.\nAwareness of variety of concept, scheme and construction design schemes in a number of different sectors.\nAbility to adapt to different cultures and working environments to build rapport with customers\nExperience of using written and spoken English within a business environment"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}