{
    "Job ID": "4727351",
    "Description": "Job Purpose:Albabtain Group currently recruiting for a Dynamics 365 PSA/FinOps with Dynamics 365Supply Chain Techno Functional and Power BI knowledgeThe objective of this role is to maintain and support business processes in MicrosoftDynamics 365 environment for the diversified business verticals.Responsibilities:•Responsible for execution of tasks related to the support, maintenance and documentation of information systems running on Microsoft Dynamics 365 FinOps/PSA, Microsoft Azure DevOps, Microsoft Flows, Custom Portal, and Power Platform environments.•Perform system enhancements, platform upgrades, new solution or plugin implementations, Integrations and Flows.•Liaise with business departments and understand business processes and ensure these are correctly mapped with the system. Analyze business requirements and recommend an implementation approach. Web development methodologies, and development, experience with web-based technologies, including HTML code, CSS layout, Dynamics 365 APIs and CSS•Execute deployments in production and non-production environments and be willing to support deployments outside of normal working hours. D365 applications process design and configuration.•D365 application design, development, integration, testing and deployment.•D365 application technical architecture. Leading the D365 Supply Chain Workstream•Converting business requirements into the most efficient technical models•Breakdown business processes, to map out and link any functional and nonfunctional requirements.•Analyzing and designing solutions for applications, matching processes that fit application requirements seamlessly.•Manage gaps detected between during prototyping.•Leading the testing of the proposed system.•Documenting the process, informing, and preparing clients during critical moments in the project•Prototyping and configuring Microsoft Dynamics 365 processes that make the business systems run smoothly and swiftly.•Training users and explaining complex reasoning behind changes.•Create, configure, and support Power Apps, Power Automate workflows & Power Bi dashboards.•Translate abstract business requirements into actionable technical requirements which can be executed using Power Apps, utilizing best practices within the Power Platform Community•Supports users by developing documentation and assistance tools.Skills",
    "Skills": [
        "Characteristics:",
        "Is results-oriented and has a passion for learning.\nShould have completed at least 2-3 Dynamics 365 implementation life cycles.\nShould demonstrate skills to lead team of ERP as well as with team members in different locations.\nShould have strong technical and functional knowledge of Project Management and Financial Modules.\nShould have a strong understanding of Microsoft flows and integration between modules mainly PSA to FinOps. Should be able to create and resolve flows/integration errors.\nThrives in an unstructured environment.\nHas native client charm and presentation skills (A Customer Whisperer)\nCultivated a strong business acumen.\nTakes initiative and delivers outstanding performance.\nExcellent interpersonal skills (team player)\nManages customer expectations effectively.\nHas great time management skills.",
        "Experience:",
        "Minimum 5 years of experience in D365 (Finance and SCM) and Power BI",
        "Knowledge:",
        "Strong hands-on experience in the Microsoft Power Platform, including Power Apps,\nPower Automate (Flow), Power Apps, Power BI, Data Verse & SharePoint.\nMicrosoft Visio or other process flow application experience\nStrong problem-solving skills, with ability to translate application storyboards and use cases into functional applications.\nAbility to work in a complex environment with changing requirements.",
        "Preferred Skills:",
        "Dynamics 365,\nProficiency in DAX, Microsoft Office VBA\nWorking knowledge of Power Query\nAgile/Scrum experience\ndot Net development experience with familiarity with C#, ASP dot Net & JavaScript/jQuery\nExperience with R, Python\nPL-400 MS Power Platform Developer Certification"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "All GCC Countries; India",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}