{
    "Job ID": "4727051",
    "Description": "Position Title:             F&B Outlets Director- OperationsEmployment Type: Full-timeSalary:                        up to 40K AED, all-inclusive depending on experience and qualificationsJob Location:             Abu Dhabi, UAEAbout the Client:A prominent group based in Abu Dhabi, with international collaboration and successful track records in the areas of F&B, Retail and Entertainment.Job Description:Responsible for overseeing the day-to-day operations of the food hall. This includes coordinating with different outlets, ensuring they are following standard operating procedures, and addressing any operational issues that arise.\nControlling quality of all food and beverages served within the food hall meet the established quality standards from serving appreances, taste testing, monitoring food preparation processes, and addressing customer complaints related to the outlets.\nHands- on coordination to liaise with the individual outlets operating within the food hall to manage lease agreements, food hall's rules and regulations, and fostering a positive, professional working relationship with the outlet operators.\nComply with Health and Safety standards per law such as regular inspections, handling any food safety concerns, and implementing protocols to maintain a clean and safe environment\nPush profitability of food hall thru collaborating with outlets and internal finance department to manage budgets, track revenue, expenses, and profitability with recommendations on areas to improve on for customer satisfaction.Skills",
    "Skills": [
        "Qualifications:",
        "28 to 40 years old\nUniversity Degree in Business Marketing or other related fields\nMinimum 5 years experience as Ops Manager above in a food court/ food hall set up\nExperience in the operations of multiple brands/food outlets (food court/food hall) is a must\nOutstanding written and verbal communication skills in English"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}