{
    "Job ID": "4727223",
    "Description": "Job Purpose:First line of kitchens, starting of cleaning the workspace, preparing meal’s ingredients and to make sure it’s fresh and clean.Areas of Contribution and Related Responsibilities:Kitchen Workers is divided into (2) groups, a group which prepare salads, subs and sandwiches and a group which prepare the dough and the ingredients on top of it (Like Pizza) to be sent to the Oven Workers.\nPacks food items neatly into the proper package/bag.\nDesigns the food refrigerator and self-service sections periodically during the shift.\nCuts, slices, and shreds cold cuts.\nMaintains an attractive, neat, and clean kitchen always.\nSecures all required equipment, supplies, materials and/or items to carry on properly with his/her job duties.\nPrepares orders according to the customer's preference using proper portions and methods.\nKeeps workstation clean, sanitized, and well organized.\nObserves work schedules, and carries on all assigned duties conscientiously.\nDespite the repetitive nature of job tasks, tries to be as creative and enthusiastic as possible.\nPerforms other duties pertinent to this job as assigned.Communications and Working Relationships:Interacts with clients and shows willingness to serve them with a pleasant attitude\nCommunicate professionally with the supervisor in charge.Skills",
    "Skills": [
        "Education:",
        "Team player.\nEnjoys working with people.\nWarm, friendly personality.\nResponsible and conscientious personality.\nAbility and willingness to perform under stress.",
        "Experience:",
        "At least 3 years of experience that is directly related to the duties and responsibilities specified.",
        "Language and Computer Knowledge:",
        "English Language: Read, speak, and write."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}