{
    "Job ID": "4727550",
    "Description": "Responsibilities:Technically competent and ability to use engineering judgment independently to determine solutions\nPrepare Design Drawings and calculations\nPrepare Technical Reports and contractual documents of acceptable technical and presentational quality with minimum guidance.\nApply new ideas/digital idea to improve solutions and processes to improve efficiency.\nReceive on the job technical training through performing tasks with minimum supervision.\nResponsible for completion of specifically assigned tasks to time and cost.\nSupporting and mentoring, with the possibility of formal line management responsibilities.\nOpportunity to present your project work at company meetings or at conferences.Skills",
    "Skills": [
        "Requirements:",
        "A sound understanding of mechanical engineering principles and their application in (HVAC, Plumbing, Fire Fighting) and pumping stations.\nAble to work as a reliable and proactive member of the team, able to apply knowledge gained.\nAble to work on several projects, and to communicate clearly with a range of people, including making presentations. Flexible and enthusiastic; team player.\nConversant with MS Office tools.\nExperience working on MENA projects is a must.\nGood knowledge of work procedures and ensuring work adheres to procedures.\n5-10 years of experience, in the production of design documentations and drawings including optioneering reports and specifications of mechanical systems.\nExperience in producing design calculations of mechanical systems for (HVAC, Plumbing, Fire Fighting).\nFamiliar with working to design national and international codes as well as standards appropriate for (HVAC, Plumbing, Fire Fighting) industry.\nAbility to produce hydraulic calculations for mechanical equipment, equipment datasheets/specifications and schedules.\nHe/she should be conversant with various (HVAC, Plumbing, Fire Fighting) mechanical equipment\nPipe and Duct sizing calculations, pump sizing calculations, tanks calculations, cooling loads calculations, static pressure calculations.\nGeneral Arrangement drawings for piping and mechanical equipment. Isometric drawings. P&IDs, PFDs etc.\nSoftware - AutoCAD, Revit, HAP, Elite are essential and should have working knowledge of 3D Models etc such as Navis works.\nExcellent communication and listening skills.\nShould be flexible and positive attitude.\nWriting professional reports.\nIdentifies and communicates concerns to immediate Supervisor.\nDiscusses career goals and aspirations.\nAble to draft responses to straight forward queries\nActs in best interest of the team at all times.\nBeing able to adjust to changing priorities\nWillingness to share information and knowledge with team members\nWilling to participate and contribute to company social activities\nDisplays appropriate levels of assertiveness."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}