{
    "Job ID": "4727733",
    "Description": "Position Title:             BuyerEmployment Type:     Full TimeSalary:                         9K AED all-inclusive depending on experience and qualifications Job Location:            Abu Dhabi, UAE About the Client:One of the leading groups in Hospitality & Leisure based in Dubai, known for its finest amenities and world class service Job Description:Source, evaluate, and negotiate the purchase of products and materials at competitive prices.\nIssue purchase orders, review order confirmations, and maintain accurate records of purchases and related documents.\nBuild and maintain strong relationships with suppliers to ensure timely and quality deliveries, and monitor inventory levels and coordinate with relevant teams to avoid stockouts or overstock situations.\nConduct cost analysis and benchmarking to identify cost-saving opportunities, and work with the quality control team to ensure purchased products and materials meet established standards.\nEnsure compliance with company policies and industry regulations in all procurement activities, and assess supplier performance regularly, providing feedback to improve their service and performance.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Asian nationals\nMale, 40 years old and below\nMinimum 2 years’ UAE experience in the same role\nMust have an experience in renovation works, civil works and fit out works\nExperience with Quantity Surveyor and Building (Interior Designing knowledge, and background) is preferred\nMust have contractual knowledge and full understanding how to manage projects and requirements\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "Central Asia; East Asia; South Asia; Southeast Asia; West Asia",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Recruitment Agency",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}