{
    "Job ID": "4727415",
    "Description": "Job Purpose:Direct purchasing, warehousing, distribution and financial forecasting of services or activities to optimise cost control and improve efficiencies, customer service and HSEQ.  Examine existing procedures or opportunities for streamlining activities to meet product distribution needs. Direct the movement, storage, traceability, and processing of inventory & assets.  Provide support to projects in terms timely delivery of materials and logistics to project sites.Key Responsibilities:General ResponsibilityResponsible for all procurement activities for Saudi and UAE operations\nDesign or implement procurement strategies adapted to changing market conditions, new business opportunities, or cost reduction strategies.\nManage activities related to strategic or tactical purchasing, material requirements planning, inventory control, warehousing, or receiving.\nConfer with department managers to forecast demand and create supply chain plans that ensure availability of materials or products.\nEvaluate new and existing suppliers and subcontractors in order to select the most suitable suppliers who are able to deliver high quality products at competitive pricing.\nProcure materials and subcontract in a timely manner within the approved budget cost.\nNegotiate with suppliers on lead-time, cost and quality so as to obtain the maximum benefit for the company.\nLiaise with suppliers on delivery schedule so as to ensure on-time deliveries of final product.\nCoordinating with internal departments to ensure that required materials/tools are delivered on time.\nCreate monthly performance reviews and reports focusing on overall sourcing requirements\n Conducting spend analysis and consolidating the site requirements for shortage or missing materials and placement of LPOs or VOs to OEMs.\nMaintain company reputation and credibility by fair dealings and prompt payment.\nReviewing MR - Material Requisition.\nFloat RFQs ( Request for Quote) to Approved Vendors.Vendor Management:Review all contractual agreements for all sub-contractors & vendors.\nAgree critical KPI’s for vendors and implement quarterly reviews to go through performance \nWorking with QHSE and Engineering team participate in Vendor Audits & evaluation.Logistics:Evaluate and select freight forwarders and courier companies for the movement of shipments. Working with the Stores & Logistics Supervisor, Monitor their performance levels and actively seek new service suppliers to improve efficiencies and reduce costs where possible. Maintain information on export tariffs, licenses, and restrictions.\nEnsure the Stores & Logistics documentation meets customs/client requirements, packing specifications and compliance with overseas countries regulations.\nLiaison with various government and non-government departments Skills",
    "Skills": [
        "Qualifications / Experience (Essential (E) / Preferred (P)",
        "Bachelor’s degree in relevant discipline or equivalent Qualification in Purchase Management. (E)\nMinimum 5 years of experience in Purchase function in a construction or engineering industry (E)\nKnowledge and understanding of managing vendor audits (P)\nProficient use in IT, Microsoft Word, Excel (E) \nExperience in Purchase Role in Saudi and UAE (P)\nSaudi Driving License (P)",
        "Preference will be give to candidates currently in Saudi Arabia (with transferable iqama) or who are in UAE."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building; Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}