{
    "Job ID": "4727104",
    "Description": "Production Planning: Developing and implementing production plans, schedules, and workflows to meet production targets, ensuring optimal utilization of resources.\nQuality Control: Monitoring production processes to maintain product quality and implementing quality control measures to reduce defects and waste.\nTeam Management: Supervising, training, and motivating production staff to ensure a skilled and efficient workforce.\nResource Allocation: Allocating resources effectively, including materials, equipment, and manpower, to streamline production operations.\nProcess Improvement: Continuously analyzing production processes to identify areas for improvement, implementing strategies to enhance productivity and efficiency.\nBudget Management: Managing the production budget, ensuring cost-effective production methods while maintaining quality standards.\nSafety Compliance: Ensuring a safe working environment by enforcing safety regulations and promoting a culture of workplace safety.\nInventory Management: Overseeing inventory levels to ensure sufficient stock for production needs while minimizing excess inventory.Skills",
    "Skills": [
        "Leadership: Strong leadership skills to effectively manage and motivate a diverse production team.\nProblem-solving: Ability to identify production bottlenecks and implement effective solutions.\nCommunication: Excellent verbal and written communication skills to interact with teams, suppliers, and senior management.\nOrganizational: Highly organized with the ability to manage multiple tasks and prioritize effectively.\nTechnical Knowledge: Understanding of manufacturing processes, machinery, and production methods relevant to the industry.\nAnalytical: Proficiency in data analysis to monitor production performance and make data-driven decisions.\nBudgeting: Knowledge of budget management and cost control measures to optimize production expenses."
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Jeddah , Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}