{
    "Job ID": "4727686",
    "Description": "Position Title:             Control Room EngineerEmployment Type:     Full TimeSalary:                        up to 42K AED all-inclusive depending on experience and qualificationsJob Location:            Abu Dhabi, UAEAbout the Client: They are the largest electricity and desalinated water suppliers in Abu Dhabi.Job Description:Monitor and operate the control room equipment and systems to ensure the efficient and safe operation of the plant or facility.\nAnalyse data and alarms from various monitoring systems to detect anomalies or potential issues and take appropriate actions or notify relevant personnel.\nCoordinate with field operators and other departments to ensure seamless communication and smooth functioning of the plant.\nConduct regular inspections and tests of equipment to ensure they are in proper working condition and perform basic troubleshooting and maintenance tasks as needed.\nAdhere to safety protocols, standard operating procedures, and industry regulations to maintain a secure and compliant work environment.Skills",
    "Skills": [
        "Qualifications:",
        "Open to UAE Nationals\nMale, 40 years old and below\nMust be a bachelor’s degree in electrical or mechanical and Instrumentation equivalent.\nAt least have 3 years of experience in similar position.\nCandidate with Power plant experience is an advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Electrical Engineering",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}