{
    "Job ID": "4727901",
    "Description": "Responsibilities:1. Construction Logistics Planning: Collaborate with project teams, including architects, engineers, contractors, and construction managers, to develop comprehensive construction logistics plans using BIM and 4D visualization techniques.2. BIM Modeling: Utilize BIM software to create 3D models of construction projects, incorporating detailed information about building components, materials, and schedules. This involves accurately representing construction sequencing, logistics, and site-specific considerations.3. 4D Visualization: Integrate the BIM model with the construction schedule to create 4D visualizations that demonstrate the construction sequence over time. This allows stakeholders to visualize the progress and phasing of the project, identifying potential clashes or conflicts.4. Clash Detection: Identify and resolve clashes or conflicts between different building components, logistics operations, and construction activities using clash detection software. Collaborate with relevant teams to propose solutions and ensure the smooth execution of the construction plan.5. Communication and Coordination: Effectively communicate construction logistics plans to stakeholders, including project teams, subcontractors, and clients. Coordinate with various parties to ensure that construction activities align with the logistics plan and project schedule.6. Documentation: Maintain accurate and up-to-date documentation of construction logistics plans, revisions, and changes throughout the project lifecycle. Prepare reports, presentations, and visual aids to communicate project status and progress.This job requires a combination of technical expertise in BIM and 4D visualization, along with construction knowledge and effective communication skills. It plays a crucial role in optimizing construction operations, enhancing coordination, and minimizing risks in construction projects.Salary and Benefits:A competitive salary \nAccommodation allowance \nTransportation allowance \nMedical and life insurance cover\nCompany gratuity scheme \nDiscretionary bonus scheme\nAnnual flight allowance to point of origin Skills",
    "Skills": [
        "Requirements:",
        "1. Education and Qualifications:",
        "   - A bachelor's degree in architecture, engineering, construction management, or a related field is typically required.",
        "2. BIM and 4D Visualization Skills:",
        "   - Proficiency in BIM software tools such as Autodesk Revit, Navisworks, or similar industry-standard software is essential.",
        "   - Experience with 4D visualization tools like Autodesk Navisworks, Synchro, or Solibri is highly desirable.",
        "   - Strong understanding of BIM workflows, clash detection, and clash resolution processes.",
        "3. Construction Knowledge:",
        "   - In-depth knowledge of construction methodologies, sequencing, and logistics planning.",
        "   - Familiarity with construction codes, regulations, and industry best practices.",
        "   - Understanding of construction processes, materials, and building components.",
        "4. Technical Skills:",
        "   - Ability to create and manage BIM models, including the accurate representation of construction sequencing, logistics, and site-specific considerations.",
        "   - Proficiency in clash detection software to identify clashes or conflicts and propose solutions.",
        "   - Experience with project scheduling software and the ability to integrate construction schedules with BIM models for 4D visualization.",
        "5. Communication and Collaboration:",
        "   - Excellent communication skills to effectively collaborate with multidisciplinary teams, stakeholders, and clients.",
        "   - Strong presentation skills to communicate complex information and visualizations to non-technical audiences.",
        "   - Ability to coordinate and liaise with different project participants, including architects, engineers, contractors, and construction managers.",
        "6. Analytical and Problem-solving Skills:",
        "   - Strong analytical thinking and problem-solving abilities to identify and resolve clashes, conflicts, and logistical challenges.",
        "   - Attention to detail to ensure accuracy in BIM models, clash detection, and construction logistics plans.",
        "7. Time Management and Organization:",
        "   - Effective time management skills to meet project deadlines and handle multiple tasks simultaneously.",
        "   - Ability to prioritize tasks and manage workload efficiently.",
        "8. Experience:",
        "   - More than 8 years of experience in construction logistics planning, BIM modeling, clash detection, or related roles is typically preferred.",
        "   - Familiarity with construction project lifecycle and experience working on construction projects of varying complexity is advantageous.",
        "Auxiliary Requirements:",
        "Professional/lead by example.\nPassion/can do attitude/constructive challenge.\nTo hold a proven track record of integrity and ethical behaviours\nOpen to change/new ideas\nShare information\nSupportive\nCustomer focused\nArabic speaking an advantage but not essential."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}