{
    "Job ID": "4727672",
    "Description": "Your missions:- Manage all the financial accounting missions, ensure their compliance with IFRS, the bank’s accounting policies and regulatory requirements, as well of that of the financial statements and returns of the bank.- Develop the bank's budgeting and strategic plans, as well as management information reports.- Monitor the operational and capital expenditure programmes to adhere to budgeted limits.- Supervise ALCO reports, annual financial statements, monthly balance sheet, liquidity and balance sheet management analysis, P&L forecasting, as well as monthly deposits vs advances statement, profit vs loss statement, both for management information purposes.- Support three-year financial modelling exercise for business to understand long-term forecast and align it with the bank's strategy, as well as the bank’s plans to raise mid-term funding, working with consultants, lawyers and auditors.- Work with external auditors on auditing, and with the internal auditors to ensure that financial controls are observed in the financial division.- Support investor relations requirement and lead rating agency interactions and meetings to achieve rating upgrade.- Manage chart of accounts development for the bank (preferably in Temenos), as well as the bank’s Basel III readiness and support capital plan development.- Train, guide and motivate the employees in the team to develop their skills and enable them to contribute towards the achievement of the bank's goals.- Maintain and apply strict level of confidentiality to protect the bank’s business interests.Skills",
    "Skills": [
        "Your background:",
        "- You have a minimum experience of 10-15 years in the similar role.",
        "- You hold a relevant Bachelor degree, having Finance related MBA will be a plus.",
        "- You have the experience in business planning on organization-wide level.",
        "Your skills:",
        "- You are aware of data warehousing, reporting applications (i.e., business intelligence).",
        "- You have a good understanding of all critical areas of banking and of IFRS and its interpretation and application, as ell as of VAT concepts and tax recovery.",
        "- You have a good knowledge of MS Office (including Excel with Financial formulas).",
        "- You have proven communication skills and the ability to work effectively with others.",
        "- You are fluent in English and Arabic."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}