{
    "Job ID": "4727119",
    "Description": "STANDARD MINIMUM QUALIFICATIONSEducation: Completion of a University Degree (social science is preferable) Language: Fluency in both oral and written communication in English and Arabic languages  Experience: at least 4 years of relevant experience working in the field of Monitoring and Evaluation 4Ps CORE ORGANISATIONAL CAPABILITIESPurposeUnderstand and communicate the Strategic Objectives: Helps teammates articulate WFP’s Strategic Objectives.\n Be a force for positive change: Suggests potential improvements to team’s work processes to supervisor.\n Make the mission inspiring to our team: Explains the impact of WFP activities in beneficiary communities to teammates.\n Make our mission visible in everyday actions: Articulates how own unit’s responsibilities will serve WFP’s mission.PeopleLook for ways to strengthen people's skills: Trains junior teammates on new skills and capabilities.\n Create an inclusive culture: Seeks opportunities to work with people from different backgrounds.\n Be a coach & provide constructive feedback: Serves as a peer coach for colleagues in same area of work.\n Create an “I will”/”We will” spirit: Tracks progress toward goals and shares this information on a regular basis with supervisor.PerformanceEncourage innovation & creative solutions: Explores ways to consistently be more efficient and accurate in own areas of work and shares new methods of work with colleagues.\n Focus on getting results: Focuses on getting results and tracks trends in completion rates for own tasks to identify opportunities for efficiency.\n Make commitments and make good on commitments: Takes responsibility for own tasks and notifies supervisor as soon as possible of potential delays in meeting deadlines or commitments.\n Be Decisive: Independently decides what action to take when faced with critical choices in the workplace or in dangerous situations in the field.PartnershipConnect and share across WFP units: Suggests opportunities for partnering with other units to supervisor.\n Build strong external partnerships: Identifies opportunities to work with colleagues and partners in the field towards common goals.\n Be politically agile & adaptable: Develops an understanding of the value of WFP’s teams and external partners in fulfilling team’s goals and objectives.\n Be clear about the value WFP brings to partnerships: Aligns own activities with supervisor’s priorities to fulfill internal and external partner needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gaza Strip, Palestine",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}