{
    "Job ID": "4727069",
    "Description": "In this role, you will be responsible for planning, co-ordination, execution and monitoring of a range of projects & solutions implementations. You will be managing business function accounts, ensure the delivery of assigned IT projects/solutions, co-ordinate with stakeholders, business users, IT colleagues and management, and vendors. This role involves technical understanding, stakeholder management, and cross functional support Ensure Project plans are realistic, maintained and properly resourced.Key responsibilitiesEnsure Defined scope is Delivered within time and cost.\nEnsure the project plan, quality standard, security standard related process are defined and tracked with the release of the solution.\nProjects are carried out through the defined phases fully complying with HIA IT processes and procedures.\nSolutions meet agreed requirements and business expectations, are maintainable and meet documented and agreed criteria. This requires that all solutions are adequately tested (functional, non-functional, performance and integration tested) before User Acceptance Testing.\nRisks are assessed and mitigation/management strategies are designed.\nTimely and accurate project information and reporting is provided to IT management and business.\nResponsible for working closely with vendor partners, business users, contract team and track product implementation project throughout the lifecycle (RFI, RFP/RFT, Technical Evaluation, Implementation, Go live etc.).\nEnsure that assigned systems/applications are adequately supported. Manage the systems/application support teams/suppliers.\nAnalyze system faults, assess severity levels, and provide solutions\nLink similar problems by users or systems to enable detailed reporting and trend analysis\nEnsure in service reviews for external suppliers\nPerform business analysis activities to analyze user requirements, define solutions requirements, and document system specifications.\nProvide fair and accurate feedback on the performance of resources assigned to projects and application support.\nContribute Business – IT strategy and IT budgeting of assigned business units.Skills",
    "Skills": [
        "A degree in Engineering/ Computer Science/ Mathematics/ Sciences with of 7+ years of Aviation project management experience\nSelf-starter, motivated team player and ability to influence others to perform in matrixed project teams\nProject Management Professional, Prince 2 Certification or equivalent experience\nProblem solving capabilities, Strong Analytical skills, personal flexibility and agility\nShould have excellent written and verbal communication skills.\nSolid organizational skills including attention to detail and multi-tasking skills.\nDesign and develop compliance reports from various data sources\nGood understanding of international frameworks such as ISO 20000 & ISO 27001"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 8",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Aviation Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}