{
    "Job ID": "4727614",
    "Description": "Administration Supervisor-BikfyaThis job targets an experienced candidate in administration. The Administration Supervisor is entrusted with the administration activities of the company, and the Central Services such as reception, office supplies, membership & permits renewals, filing & archiving, documentation, and workflows. The Administration Supervisor has to upkeep operations in compliance with the company’s systems and in alignment with its business strategy.Responsibilities: Essential duties and functions are included.Other duties may be assigned:• Plan & manage administration & central services activities, processes, and systems and suggest recommendations for continuous improvement to ensure a smooth and efficient operation• Manage administration team and provide them with training and coaching• Document & Organize workflows and ensure that employees understand their duties• Manage membership. contracts & permits renewals and deadlines• Overview employee benefit administration records such as attendance, insurance, transportation, National Social Security Funds (NSSF), etc• Overview employee’s recruitment and termination documents• Develop and carry out an efficient documentation and filing system• Provide reports on a regular basis, and as requested• Handle contacts and meetings with stakeholders and suppliers for issues related to administration• Draft slides, meeting notes and documents for executives• Conduct special studies• Conduct data analysis for proactive management and continuous improvement• Apply the Quality Management System• Perform any other duty assigned by the managementSkills",
    "Skills": [
        "Qualifications:",
        "• Bachelor degree in business management",
        "• 5-7 years of experience in administration",
        "• People oriented and results driven",
        "• Excellent communication and interpersonal skills",
        "• Strong organizational, critical thinking and communications skills",
        "• Attention to detail and good judgement, ability to multi-task with great follow-up skills",
        "• Analytical mind with problem solving skills",
        "• Languages: Arabic, English, French is a plus",
        "• Microsoft Office: - Excel, Word & PowerPoint Employment Type Full-time"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Lebanon",
        "Company Industry": "Paper & Paper Product Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}