{
    "Job ID": "4727268",
    "Description": ".Structural Design: Lead and participate in the design and analysis of various structures, including buildings, bridges, towers, and other infrastructure projects, ensuring structural integrity, stability, and safety.\nProject Management: Oversee and manage projects from inception to completion, including developing project plans, budgets, and schedules. Monitor progress and ensure that projects are delivered within agreed timelines and budget constraints.\nTechnical Expertise: Utilize your extensive knowledge of structural engineering principles and industry best practices to deliver innovative and efficient design solutions.\nCode Compliance: Ensure that all designs adhere to relevant building codes, standards, and regulations, taking into account environmental and seismic considerations.\nQuality Assurance: Implement quality control measures to verify the accuracy and completeness of structural drawings, calculations, and documentation.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor of Science degree in Engineering or equivalent.\nMinimum of 14 years of relevant experience Construction industry with comprehensive experience in Civil/Structural Engineering, associated technologies and facilities.\nShould have good experience in material submittals, method statement reviews.\nExcellent written and verbal communication skills. Excellent technical, team-working and interpersonal skills.\nExperience and detailed knowledge of relevant international codes and standards. Candidates with previous experience on  projects will be given priority.\nAbility to make independent decisions in the planning, organizing and coordination of solutions to complex problems.\nExperience as a Lead Engineer for a team of discipline engineers.",
        "Rewards & Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\nTransportation allowance\nMedical and life insurance cover\n26 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}