{
    "Job ID": "4727815",
    "Description": "Customer Acquisition - Search for new clients who will benefit from our products and services and maximize client potential in designated industries, applications, and regions.Client Relationship Management - Develop long-term and strong relationships with clients, through identifying customer needs and your knowledge of our products and solutions.Sales Management - Persuade clients that our products and services best satisfy their needs in terms of quality, performance, service, price, and delivery. Deliver presentations to key stakeholders and demonstrate how a product meets client needs. Calculate clients’ quotations and administer client accounts.Contract Management - Negotiate tenders and contract terms and conditions to meet both client and our needs. Assure tender specifications are met and match our product, solution, and service specifications.Customer Satisfaction - Provide pre- and post-sales technical and business support to customers, including product demonstrations, training, and installation support. Assure that order, project, or contract is fully executed to the satisfaction (timeline, quality, performance, specifications) of the client. When required engage with different internal departments to deliver a seamless sales process.Marketing - Conduct market and competitor research and analysis, evaluate customer needs, and develop customer-specific proposals. Monitor customer and market trends to develop and execute effective sales activities and develop new market opportunities in collaboration with the wider sales team.Targets & Reporting - Active contribution to the execution of our corporate strategy. Meet revenue goals (Drive, Soft Starter, Motor Control Solutions, Power Quality). Prepare sales plan to effectively identify new business opportunities within new and existing customers. Prepare and submit sales reports, forecasts, and update on sales activities.Skills",
    "Skills": [
        "Your Qualifications and Skills",
        "Bachelor, Master's degree or equivalent experience in Engineering, Sales, Business Development\n5+ years of relevant experience\nApplication know-how in LV, MV Drives, Soft Starters, Motor Control Solutions incl. Power Quality\nStrong negotiation skills\nInterpersonal skills\nSelf-driven personality"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}