{
    "Job ID": "4727264",
    "Description": "Responsibilities:Leads the delivery (time, cost, quality) of assigned package. Supervise the contractors to ensure the works are constructed as per specification and to established milestone dates.\nManage and direct the supervision team to undertake day to day inspections of the works.\nMaintain a very high level of Safety awareness and ensure the contractor complies with his obligations. Capable of administering the FIDIC based contract.\nResolves site issues Presents progress and package issues to client team.\nDiscuss changes to the scope of work with the Client and key subcontractors.\nResponsible for following up on instructions & commitments associated with the project.\nEstablishes Project Execution Plan, Health & Safety Plan, Quality Control Plan and other documents in relation to our scope.\nEstablishes the program requirements for all areas of the project and monitors site staff performance.\nPlans, directs, supervises and controls the execution of all technical, fiscal and administrative functions of the project and the site team.\nAssigns responsibility to key subordinates in their respective fields of expertise.\nProvides input to performance reviews and develop plans for subordinates.\nWork with other managers, project engineers and discipline Heads to develop budgets, schedules and plans for the various elements of the project.\nMonitors and reports to management on the progress of all project activities within the program, including significant milestones and any conditions, which would affect project cost, schedule, performance or Client relation.\nEstablishes internal weekly meetings to review project status and formulate action items.\nPerforms other responsibilities associated with this position as may be appropriate.\nRepresent the company in Client meetings.\nMonitor Health and Safety of the construction works and lead to address violations.\nManage, testing and commissioning and project close out.Skills",
    "Skills": [
        "Requirements:",
        "At least 10 years working in an Resident Engineer / Construction / Project Manager capacity\nExperience on large building projects (luxury hotels, High rise buildings) within MEA region\nBachelor’s degree in a relevant Engineering field and membership of a recognized Engineering institution.",
        "Rewards & Benefits:",
        "•    A competitive salary will be offered to the right candidate",
        "•    Accommodation allowance",
        "•    Transportation allowance",
        "•    26 working days annual leave.",
        "•    Medical and life insurance cover",
        "•    Company gratuity scheme",
        "•    Discretionary bonus scheme",
        "•    Annual return airfare to point of origin"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}