{
    "Job ID": "4727536",
    "Description": "•Effectively manage own time which may be necessary if allocated to more than one projectSkills",
    "Skills": [
        "Requirements:",
        "Please read these requirements carefully before applying and ensure they are evident on your CV if you have achieved them.",
        "•Degree in Civil or Structural Engineering",
        "•Knowledge of Revit will be an advantage.",
        "•Experience of 10+ years working in Design office, designing building structures.",
        "• Familiarity with Concrete codes IS/BS, ACI, SBC, ECP, AISC Codes of Practice.",
        "•Experience of working on multi-discipline projects",
        "•Practical experience of reinforced concrete design and RC detailing of reinforced concrete structures, to British Standards and American codes",
        "•Preferably also practical experience of structural steel design and detailing of steel structures, to British Standards and American codes",
        "•Have a desire to technically lead and collaborate within a technically orientated team",
        "•Established skill and delivery in the design and analysis of concrete and steel structures, and be familiar with current design standards and working practices",
        "•Excellent communication skills",
        "•A flexible attitude to both the type of work undertaken and the level of responsibility given",
        "•Flexible approach to work location",
        "•Have the ability to make decisions, act on your own initiative",
        "•You will have a proactive, co-operative and helpful attitude to colleagues and clients",
        "•A self-motivating, reliable and consistent approach to work is essential",
        "•Practically minded with a problem solving nature",
        "•You must be able to work independently and in teams",
        "•Acceptance of responsibility for work carried out",
        "•A flexible and adaptable approach to work is required",
        "•Excellent verbal and written communication skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}