{
    "Job ID": "4727256",
    "Description": "Responsibilities:To develop, lead and assist project teams in BIM project set up\nTo develop and deliver structured BIM models for projects within your discipline\nTo implement BIM training modules for key staff and maintain training courseware\nTo participate in the process of developing BIM standards for projects across Atkins\nTo develop and maintain Revit content libraries through creation of families, etc\nTo provide guidance and assistance with design projects to ensure they are setup and progress optimally, and teams are using Revit appropriately\nTo ensure that the implementation of Revit aligns with Atkins CAD-BIM strategy and links appropriately with the wider business\nDevelop procedures to facilitate sharing of content and knowledge throughout Atkins\nManaging a multi functional design team responsible for delivering a large number of varied infrastructure projects in accordance with the client’s requirements.\nManaging key stakeholder interfaces which will include all departments within the client organisation as well as other government departments.\nEstablish project controls and reporting and ensure timely delivery of projects to time, cost and quality.\nProgress reporting and monitoring in line with contract KPIs\nEnsure resources are appropriate to meet current and future commitments and to maximize opportunities.Rewards and Benefits:We offer an excellent package which includes:A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSkills",
    "Skills": [
        "Requirements:",
        "Demonstrate expertise in preparation of 3D BIM models and construction documents using Revit Architecture, Revit Structure or Revit MEP\nFor Revit MEP - Modeling HVAC, Plumbing systems, based on survey data, engineering calculations, specification sheets and other data\nClash detection and coordination of all services in Revit & Navisworks\nRevit content creation: Parametric families using formulae, nesting and type catalogs\nIntegration of Revit products with other applications (AutoCAD, Civil 3D, eSPEC, Quantity Takeoff, etc)\nBIM and associated software skills to automate routines to support standards and improve productivity\nBIM experience with 3D rendering and visualisation, BOQ & cost estimation, analysis and simulations, and specification linking etc.\nMust have computer experience in Microsoft Windows networked environments, and good working knowledge of word processing, spreadsheets, email, Web-enabled applications and database software"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}