{
    "Job ID": "4727100",
    "Description": "ResponsibilitiesMonitor the performance of all internal and external architectural and engineering work related to project, emphasizing on-time and on-budget performance and monitoring compliance with Design Guidelines and contract terms.\nMonitor the development of the overall design process from conceptual design through schematic and detailed/contract documents.\nPerform design reviews throughout the design process from conceptual design through schematic and detailed/contract documents.\nConduct ongoing constructability reviews to successfully meeting the schedules and program budgets.\nMonitor submittals by the design consultants to obtain approvals and permits necessary by all regulatory agencies and local authorities having jurisdiction.\nImplement Design to budget requirement in all appropriate RFP’s and contracts for design services. Monitor compliance with Design to Budget standards.\nPromptly inform in writing of any event or situation that the likely effect of which would be to vary the scope of the Program; and or change its quality, content or function.\nSchedule the submission of the design, in stages if appropriate, to Client and request his approval thereto. Advise Client in the event that the design indicates that compromises are necessary between particular objectives and requirements of Project. Schedule the Design activities in the Master Schedule to include reasonable periods Client approvals.\nMonitor the dissemination of design information among the Program Team in timely manner such that abortive work is avoided or minimized as much as practicable.\nMonitor the performance of the Design Consultant and other consultants in respect of the deliverables associated with the agreed Design Program and provide immediate advice to Client in the event their progress may affect the program overall completion date or milestone objectives together with recommended remedial action.\nMonitor statutory authority approval processes. Prepare a standard NOC (no objection certificates) register to be prepared and updated by all consultants and contractors.\nSchedule the Design to allow reasonable periods for Client approvals, any Municipality Permits, No objection Certificates, and other statutory approvals.Rewards & Benefits:We offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants.Skills",
    "Skills": [
        "Requirements",
        "Bachelor's Degree in Architecture or Engineering. \n15+ years full time paid professional experience managing the design coordination, the planning and scheduling activities of major projects. \nAbility to build consensus among multiple stakeholders.\nActive leadership style.\nExperience with LEED/Estidama.\nMiddle East experience required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}