{
    "Job ID": "4727084",
    "Description": "ResponsibilitiesDeveloped architectural design skills and understanding of the design process and interfaces between design disciplines..\nDevelop a thorough design philosophy, effectively contributing to the inception and the development of a project.\nLead the design work ensuring project objectives are met, design instructions are implemented and delivery is achieved within the set time and budget.\nResponsible for the correctness, accuracy and complete multi-disciplinary coordination of the design documentation prepared by the assigned team.\nResponsible, for the preparation and compilation of design presentations and design reports.Core AccountabilitiesArchitectural Design and Planning.\nClient Interface.\nDesign Coordination.\nInterface with Statutory Authorities.\nDesign research.\nSite back-up.Rewards and Benefits We offer an excellent package that includes:A competitive salary\nAccommodation allowance\nTransportation allowance\n22 calendar days annual leave (based on 5 day working week)\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants.SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Skills",
    "Skills": [
        "Requirements",
        "B.Arch or B.Sc in Architecture.\nMinimum 5+ years post-qualification experience (UAE/ KSA experience preferred)\nBe a registered member of an accredited RIBA or ARB\nHigh proficiency in: Rhino, Grasshopper, Sketchup, 3dsmax, Revit, Auto Cad, Photoshop, Indesign\nGraphic skills are a must (Adobe package)\nExtensive project experience.\nExcellent communication skills.\nFlexibility of attitude towards company objectives.\nUnderstanding of scope definition and scope interface.\nExcellent presentation skills.\nDeveloped knowledge of Fire & Life Safety Principles.\nDeveloped knowledge of Sustainable Design principles.\nAbility and will to mentor and provide support to junior staff members and spread knowledge across the wider architectural community.\nAbility and will to update knowledge.\nFull knowledge of Statutory Authorities requirements, knowledge of codes, regulations and submission requirements. ",
        "Qualities & Skills",
        "Talent and experience in working on the design process during the concept/ Schematic designs stages\nExperience of working in a recognised global/ design offices in Middle East\nCapable of leading large scale projects in Hospitality, Mixed use, Residential, commercial and High rise.\nExcellent design and technical capabilities\nProficiency in Rhino + Grasshopper\nProficiency in AutoCAD and REVIT, word processing and Adobe InDesign/ illustrator/ photoshop.\nSelf motivated and able to take responsibility\nFlexible attitude and works well under pressure and meet deadlines efficiently\nExcellent organisational skills\nAble to build good relationships at all levels internally and externally\nResilient to cope with conflicting demands, able to prioritise duties and work effectively under pressure while remaining calm and professional at all times.\nAbility to understand and formulate design decisions and present for discussion\nAbility to use a variety of media in the development and documentation of a design project."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}