{
    "Job ID": "4728854",
    "Description": "1. Provide top-notch customer service by greeting customers, understanding their needs, and assisting them in finding the right products.2. Maintain extensive knowledge of our luxury product line, including furniture and home accessories, to provide accurate information to customers.3. Utilize a consultative sales approach to guide customers through the buying process, from product selection to payment and delivery.4. Process transactions quickly and accurately.5. Monitor inventory and restock display areas as needed, ensuring all products are presented in an appealing and correct manner.6. Coordinate with the store manager and the interior design team, offering suggestions for in-store promotions or displays.7. Handle customer complaints professionally, providing suitable solutions to maintain customer satisfaction.8. Attend sales and product training sessions and meetings to improve product knowledge and sales skills.9. Maintain a clean and organized sales floor that meets both visual and operational standards.10. Assist in the planning and execution of in-store events.Skills",
    "Skills": [
        "1. High school diploma or equivalent. A degree in a related field (Interior Design, Marketing, etc.) is preferred.",
        "2. Prior experience in a luxury retail sales environment, preferably in the furniture and home accessories sector.",
        "3. Excellent communication and interpersonal skills, with the ability to build relationships with customers.",
        "4. Proficient in using POS systems and other computer software, including Microsoft Office.",
        "5. A keen eye for design and attention to detail.",
        "6. Ability to work a flexible schedule, including weekends, holidays, and evenings.",
        "7. Strong selling skills, with a proven record of achieving sales goals.",
        "8. Ability to lift and move heavy items when necessary.",
        "9. Demonstrated knowledge of current trends in luxury home furnishings."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale; Home Accessories & Decor",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}