{
    "Job ID": "4728623",
    "Description": "About the role:Are you passionate about cultivating the potential of employees and fostering a culture of growth and learning? Do you have a knack for designing innovative talent development programs that drive organizational success? If so, we invite you to join our dynamic team as a Talent Development Manager.As the Talent Development Manager, you will play a pivotal role in designing, implementing, and overseeing talent development initiatives that align with our company's vision and values. Your main responsibilities will include:Key responsibilitiesLeadership Development: Create and execute leadership development programs that enhance the skills and competencies of current and future leaders. Identify leadership gaps and develop strategies to address them. Provide coaching, and training to develop leadership capabilities within the organization. Support in development and implementation of coaching and mentoring programmes.\nInternal Mobility Management: Execute the internal mobility process that facilitates the movement of employees within the organization. Collaborate with managers and HR business partners to ensure a fair and transparent internal selection process is conducted.\nTalent Review: Lead talent review process to integrate performance, potential, and readiness of employees for key positions. Evaluate individual strengths and development needs, and identify high-potential individuals for future leadership roles. Collaborate with managers to create individual development plans and opportunities for high-potential employees.\nAssessment Centers: Plan, design, and facilitate assessment centers to assess the skills, competencies, and potential of employees for specific roles or career advancement opportunities. Collaborate with HRBPs and hiring managers to make informed talent decisions based on assessment center results.\nCompetency Framework: Maintain and manage competency framework. Ensure its utilization, continuous communication and adoption as a standard method to attract, develop, assess and retain knowledge and talent.\nCareer Development Programs: Design and implement career development programs to support employees' professional growth and advancement within the organization. Identify development opportunities, such as job rotations, cross-functional projects, and training programs, to enhance employees' skills and capabilities. Monitor and track the progress of employees in their career development journey.\nStakeholder Engagement: Collaborate with managers, HRBPs and senior leadership to ensure alignment and support for internal mobility, talent review, and assessment center processes. Provide guidance and support to managers in conducting talent reviews and making informed talent decisions. Build relationships with key stakeholders to foster buy-in and engagement in talent management initiatives.\nTalent Analytics: Utilize data and analytics to measure the effectiveness of talent management and leadership development programs. Track key performance indicators related to talent development, engagement, and retention. Use insights from data to make data-driven decisions and improve programs.\nStay Updated on Industry Trends: Stay abreast of industry trends, best practices, and emerging technologies in talent management and leadership development. Continuously enhance your knowledge and skills through professional development activities and networking with industry experts.Skills",
    "Skills": [
        "About you:",
        "Bachelors of Arts/Humanities/Business Management or similar\nMinimum 6 years of relevant experience\nTalent Management - Internal Mobility, Talent Review, Assessment Centers\nLeadership Development - Training Design and Delivery\nCoaching and Mentoring\nCompetency frameworks"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Ground Fleet, Aviation, & Marine Refuelling",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}