{
    "Job ID": "4728251",
    "Description": "We are looking for a dedicated and knowledgeable Assistant Supervisor to report to our Senior Supervisor. As an Assistant Supervisor, your duties will include recruiting new employees and conducting training sessions, monitoring job performance metrics, and relaying productivity concerns to the Supervisor. Your duties will also include developing training materials.Assistant Supervisor Responsibilities:Reporting to the Supervisor or other senior managers as required.\nLiaising between the Supervisor and other employees.\nHiring and training new employees.\nDeveloping training materials and conducting training sessions and workshops.\nEstablishing business knowledge and awareness of shared company goals.\nMonitoring both individual and team job performance metrics.\nProviding staff with technical guidance and assistance.\nRelaying productivity concerns to the Supervisor.\nPreparing job descriptions and work schedules.\nAssisting with other administrative tasks, when required.Skills",
    "Skills": [
        "Bachelor's Degree in business management, HR management, or similar.\n2-5 years experience in a similar Assistant Supervisor role.\nAbility to create candidate hiring profiles and to appoint suitable staff.\nExtensive experience in compiling training materials and facilitating training.\nAbility to enhance business knowledge among company employees.\nExperience in liaising between management and employees.\nExceptional ability to motivate employees and foster teamwork.\nProficiency in monitoring and reporting job performance metrics.\nExcellent interpersonal and communication skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}