{
    "Job ID": "4728308",
    "Description": "Key Responsibilities:Develop and execute social media strategies to align with our marketing objectives and brand identity.\nCreate engaging and compelling content for various social media platforms, including Facebook, Instagram, Twitter, LinkedIn, and others.\nSchedule and publish social media posts, ensuring consistent and timely updates.\nMonitor and respond to comments, messages, and interactions across social media channels to foster meaningful engagement with followers.\nAnalyze social media data and metrics to measure the performance of campaigns, track audience behavior, and identify areas for improvement.\nCollaborate with the marketing team to integrate social media into broader marketing campaigns and initiatives.\nStay updated with industry trends and best practices in social media marketing and implement new strategies accordingly.Skills",
    "Skills": [
        "skills:",
        "Bachelor's degree in Marketing, Communications, or a related field.\nProven experience (typically 2+ years) as a Social Media Specialist or in a similar role.\nStrong knowledge of social media platforms, best practices, and emerging trends.\nExcellent written and verbal communication skills with a flair for creative content creation.\nProficiency in using social media management tools and analytics platforms.\nAbility to analyze data and draw insights to improve social media performance.\nFamiliarity with social media advertising and experience in managing ad campaigns.\nUnderstanding of SEO and its application in social media content.\nStrong organizational skills and the ability to manage multiple social media accounts effectively.\nAbility to work collaboratively in a team and meet tight deadlines."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}