{
    "Job ID": "4728839",
    "Description": "Position Title:             Personal Assistant and DriverEmployment Type:     Full TimeSalary:                        up to 10K AED all-inclusive, depending on experience and qualifications plus annual flight ticket and medical insuranceJob Location:             Dubai, UAE About the Client:They are a start-up investments company that will launch 7 factories covering different industries namely in Construction and Plant Fertilizing Job Description:Provide comprehensive personal assistance to the company owner, including handling company tasks and ensuring seamless execution of personal errands.\nResponsible for safe and efficient transportation of family members, including airport meet and greet, and running errands for personal tasks.\nAdhere to road safety regulations while driving for the family and maintain a high standard of driving skills.\nSource requested items and make purchases in UAE malls and shopping centers, ensuring excellent shopping assistance, and taking in-charge, care and proper maintenance for the company vehicle, and owner’s vehicles.\nMaintain high availability and readiness for immediate assistance on a flexible schedule, including weekends. and maintain strict confidentiality of all the company’s business operations.Skills",
    "Skills": [
        "Qualifications:",
        "Open to CIS nationals\nMale, 35 years old and below\nAt least 2 years of of experience in the same role or in hospitality industry\nMust have knowledge in Russian and English language\nMust have a valid UAE Driver’s License\nImmediate joiners will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Eastern European Countries; All Western European Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}