{
    "Job ID": "4728082",
    "Description": "Maintaining and developing relationships with existing customers via meetings, telephone calls and emails;\nAssist in finding relevant clients and customers by collaborating with the company's many teammates.\nStudy company targets about sales activities and strive for the continuous implementation of the same.\nMaintain accurate records of all sales and prospecting activities to analyze the sales prospects.\nTake charge of promotional and sales activities by brainstorming new product or service launches with appropriate team members.\nUnderstanding and promoting the company’s Products & Services as assigned.\nReceiving the leads and contacting the customers\nCommunicate with all current and potential customers on a regular basis, providing solutions as needed, and oversee all sales activity in your assigned sales territory.\nCoordinate with other members of the sales team and team leaders as needed to generate sales and provide excellent customer service.\nSubmit reports on your sales activity regularly into the company’s CRM software, and maintain clean and updated records for all leads and customers.\nAdhere to all company procedures, values and policies so that you provide an accurate representation of the company to all potential and current customers.\nPerform your duties as efficiently as possible, reducing costs when possible, and maintain receipts for all job-related expenses and submit them to accounting.\nCoordinate with the accounts receivable department to ensure that all invoices are paid in full in a timely manner by your customers.Skills",
    "Skills": [
        "In-depth knowledge to convert leads into a final customer, thereby contributing to the company revenue.\nExcellent written and verbal communication skills.\nKnowledge of customer service principles and processes.\nTremendous enthusiasm to efficiently achieve sales goals under tight deadlines.\nProven command on improving conversion rate through modern communication channels and impressive presentations.\nStrong negotiation skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 4",
        "Residence Location": "Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "3"
    }
}