{
    "Job ID": "4728744",
    "Description": "Job SummaryThe Psychiatrist shall be a member of the Internal Medicine Department and shall provide psychiatric care to inpatients and outpatients with mental and psychological illnesses.Performs psychiatric consultations and handles referrals from other physicians. Engage in preventive care as part of an integrated program of curative and preventive medicine.Senior Registrar shall be responsible for providing the care of his/her patients maintaining a high-level of rofessional performance in accordance with: Evidenced-based medicine. Professional medical ethics and CBAHI / JCIA standards. Hospital medical by-laws. Laws of Ministry of health in kingdom of Saudi Arabia and any other applicableregulations according to the departmental quality plan.Major Duties and Responsibilities Ensures through his actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the NMC Hospitals and Clinics. Provides the full range of psychiatric diagnosis, treatment and patient care within the parameters of their professional competence as reflected in the scope of their clinical privileges for both in-patients and outpatients. Handles consultations cases referred to him from other services by offering clinical advice or assuming full responsibility of the care. Performs history taking, physical examinations, interpretation of common diagnostic tests and document patient condition on admission in the specified admissions. Admits patients from the hospital facilities (E.R., OPD) on his own or as determined by HOD upon appropriate discussion with the consultant. Evaluates new admission and coordinates a plan of investigation to establish a diagnosis and a management course with or without consultant assistance as determined by HOD. Conducts daily ward rounds to all inpatients in the department, on his own and/or as a team with other department staff as determined by HOD. Documents plan of patient management and maintains appropriate records of all patients with accurate, timely legible completion of patients medical records. Keeping an updated follow-up in the progress notes. Seeks the advice of or help of the Consultant whenever the condition of a patient merits further expertise. Prepares all discharge summaries, death reports and special reports on related patients when registrar is not available or when advised by Head of the Department.Skills",
    "Skills": [
        "EDUCATION:",
        "o Required",
        "University Master Degree or Equivalent",
        "Recognized as senior registrar by the Saudi Commission for Health Specialties.",
        "o Desirable",
        "Higher qualifications in his specialty, if any.",
        "EXPERIENCE:",
        " Required",
        "o Minimum of three (3) years in his/her specialty after obtaining Masters Degree.",
        "o Current valid license to practice medicine in the area of his specialty.",
        " Desirable",
        "o Additional experience in his/her specialty.",
        "o Academic affiliation.",
        "Competencies &amp; Skills:",
        " Fluent in verbal and written English.",
        " Communication in spoken Arabic is desirable.",
        " Exhibits professionalism and excellent interpersonal communication skills.",
        " Is knowledgeable of the Medical by-laws.",
        " Knowledge of computer applications."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}