{
    "Job ID": "4728745",
    "Description": "Job SummaryResident is responsible for providing the care of his/her patients maintaining a high-level ofprofessional performance in accordance with: Evidence based medicine. Professional medical ethics and JCIA/CBAHI standards. Hospital medical by-laws. Laws of Ministry of Health in Kingdom of Saudi Arabia and any other applicableregulations according to the departmental quality plan.Major Duties and Responsibilities Ensures through his actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the NMC Hospitals and Clinics. Provides patient care within the parameters of their professional competence as reflected in the scope of their clinical privileges. Performs history taking, physical examinations, interpretation of common diagnostic tests and formulation of a plan management; on admission. Conducts daily wards rounds, on all inpatients in the section. Liaises with the concerned consultant with regards to care of his inpatients. Assumes an active part in the On-Call Rotations in the Department and participates actively in the morning report together with this Consultant on-call and the moderator. Admits patients from the hospital referral facilities (e.g. ER and OPD) upon appropriate discussion with the Consultant under whose name the admission is done. Evaluates all new admissions and coordinates with the Consultant and Senior Registrar a plan of investigation to establish a diagnosis and a management course. Executes the plan, approved by the Consultant/Senior Registrar. Seeks the advice and guidance of his seniors whenever the condition of a patient merits further expertise. Documents all plans in the patient&#39;s charts and keeps an updated follow-up in the progress notes. Presents the previous day&#39;s admissions in the morning report when resident on duty. Participates in the On-Call Rota of the Department for patient care and admissions.Skills",
    "Skills": [
        "Qualifications:",
        "Minimum of:",
        " University Medical Degree i.e. M.B., B.S. (graduate in medicine) or a recognized",
        "equivalent.",
        " Recognized as a Resident by the Saudi Council for Health Specialties.",
        "Desirable",
        " Additional qualifications in his specialty, if any.",
        "Experience:",
        "Required",
        " Minimum of two (2) years after obtaining his/her degree.",
        " Current valid license to practice medicine in the area of his specialty.",
        "Desirable",
        " Additional experience in his/her specialty.",
        " Academic affiliation preferable.",
        "Special Competencies",
        " Demonstrates leadership and administrative skills.",
        " Fluent in spoken and written English.",
        " Communication in spoken Arabic is desirable.",
        " Exhibits professionalism and excellent interpersonal communication skills.",
        " Is knowledgeable of the Medical by-laws.",
        " Knowledge of computer application."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}