{
    "Job ID": "4728535",
    "Description": "The Partnership & Corporate Relation Section Head is responsible for leading collaborations and relations across the energy sector (locally, regionally, and internationally) in accordance with energy sector policies, plans, and strategies to effectively develop and maintain quality partnerships and relations that support the energy, water, wastewater, and district cooling sectors in Abu Dhabi and the United Arab Emirates.\nFurthermore, the Partnership & Corporate Relation Section Head is responsible for generating momentum within the sector to drive improvement opportunities and leverage synergies to increase the sector's efficiency and effectiveness.\nManage the development and implementation of partnerships and relations that focus on building and enhancing energy, water, wastewater and district cooling sectors in support of the policies, plans and strategies. This includes exploring new and further developing existing partnership opportunities and understanding their priorities and needs.\nDevelop the strategy for operations involving cross-border energy trade (e.g., The Emirates National Grid, The GCC Interconnection Authority (GCCIA), and specific bilateral agreements) and overseeing their implementation.\nCollaborate closely with the Ministry of Energy and Infrastructure to implement agreed projects and initiatives recommendations.\nDevelop pan-Arab and GCCIA collaboration on energy sector advancements and cross-border initiatives.\nDevelop partnership and corporate relations initiatives including with other regulatory bodies and associations supporting Company’s strategic initiatives.\nClassify the nature of collaborations required and identify appropriate means to establish and enhance key relations.\nRepresent Company’s in any energy sector affairs in coordination with the federal and local authorities.\nIn coordination with the Public & Media Relations Section, ensure appropriate external communications with existing and new relations are conducted as required.\nAssist other directorates to develop their international agendas and collaborations if required.\nReport the outcomes and impacts of collaborations, sharing outcomes and learning points with Company’s management.\nDevelop high standards of relationship management with existing partners, ensuring an outstanding experience to continue the growth of strong relationships.\nSupport with any other partnership and corporate relation initiatives that may be required by Company’s as directed by the Energy Policy Executive Director.Skills",
    "Skills": [
        "Bachelor's degree in energy relevant discipline, e.g., Engineering, Economics\nMinimum of 6 - 8 years of experience in the energy sector including:\nInternational relations across the energy sector\nProject and executive management\nGood understanding of the energy sector in Abu Dhabi, as well as regionally and globally\nDeep knowledge in identifying key governmental and private-sector relations in the energy sector\nDeep understanding of international relations theory and practice"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Energy & Renewables",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}