{
    "Job ID": "4728715",
    "Description": "Primary Duties and Responsibilities•   As discipline engineer responsible for provision of the required quality technical services. •   Carry-out Concept definition and engineering studies, design, scopes and preparation of engineering documents as per approved standards / procedures. •   Verify and sign-off technical designs and bids in accordance with approved standards. •   Deliver timely service to meet the project requirements. •   Advice and support in the discipline engineering matters in the area of expertise through all stages of projects. •   Plan and co-ordinate activities of a team of engineers for providing technical services to project executing departments, including review of execution strategies. •   Support discipline head/lead to manage client discipline standards. Participate in technical assurance and standardization activities to ensure compliance to approved discipline standards.•   Approve / endorse technical deviations / waivers/ variations to approved guidelines, codes, standards and practices. •   Support to ensure that all applicable environmental and process and other safety technical policies are fully implemented. •   Support development of competencies and skills in his area including structured training for Qatari Engineers under development. Skills",
    "Skills": [
        "--Minimum Requirements--",
        "Qualifications",
        "•   Bachelor degree in discipline engineering. Chartered Engineer status or equivalent is preferable",
        "Experience",
        "•   10 years relevant post graduate experience, of which 6 years in Oil & Gas industry. ",
        "•   Skill / knowledge of International, client DEPs and standards related to his area of expertise. ",
        "•   Experience of managing time, cost, and quality in engineering projects within multiple project environment. ",
        "•   Good Communications and Presentation skills and be fluent in English. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}