{
    "Job ID": "4728836",
    "Description": "Position Title:             Senior AccountantEmployment Type:     Full TimeSalary:                        up to 8K AED all-inclusive depending on experience and qualifications Job Location:            Dubai, UAE About the Client:A Dubai based stand-alone café restaurant, with multiple branches in UAE and KSA  Job Description:Prepare and maintain accurate financial records, including general ledger entries, bank reconciliations, and accounts payable and receivables, including vendor payments.\nPrepare and present monthly, quarterly, and annual financial reports to management.\nAnalyze financial data to identify trends and variances.\nDevelop and implement financial policies and procedures to ensure compliance with relevant laws, regulations, and accounting standards.\nOversee the preparation of VAT Filing and ensure compliance with laws and regulations.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Indian, Pakistani, and Sri Lankan nationals\n28 to 38 years old\nBachelor’s degree in accounting of any related field; Master’s degree preferred but not mandatory\nACCA/CA/CPA/CMA designation is preferred\nMinimum 5 years of experience in accounting or financial management, preferably in the restaurant industry\nStrong knowledge of accounting principles and practices, including GAAP\nProficiency with ERP i.e., Odoo Enterprise is preferred but not mandatory (or any ERP is fine) and Microsoft Office Suite\nExcellent analytical and problem-solving skills\nValid UAE drivers license is an advantage\nACCA/CA/CPA/CMA designation is preferred",
        " "
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "India; Pakistan; Sri Lanka",
        "Age": "Min: 28 Max: 38"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}