{
    "Job ID": "4728249",
    "Description": "Key AccountabilitiesThe Legal Admin Officer role is for a Limited Contract until the end of 2023 - Arabic Females under family sponsorship will be considered only!!Opens an investigation and identify whether there is a customer account.\nRecord the date and time of receipt of each Instruction on the related Instruction.\nOpen CRDB and search by QID number to check customer account as well as using Kapiti to identify any outstanding balance\nBlock Accounts: Where an Investigation identifies accounts held with Commercial Bank, checks the availability of funds in the relevant account (s) for purposes of ensuring that the specified amount to be blocked is available in the customer account.\nReceives email from FTU Operations to unblock the Account in order to make the transfer.\nInstruct FTU Operations to transfer the funds according to the Instruction. The FTU Operations team will inform the Legal Officer once the transfer is completed.\nFile a hard copy of the Investigation findings into the appropriate folder and retain in the department for two years and thereafter send to archiving.\nWhere an Investigation identifies a transfer is required but the account is in collections, email the Collections Team to release the funds in order to execute the transfer in each Instruction.\nReceives email from The Collections Team to unblock the customer account and to authorize release of the funds.\nScan each Instruction by E-mail to the relevant individuals in the Collections team within Operations. .The Collections Team shall be responsible for blocking the customer’s account for the amount specified in the Instruction and executing the transfer.\nFile a hard copy of the Investigation findings into the appropriate folder and retain in the department for two years and thereafter send to archiving.Skills",
    "Skills": [
        "Education",
        "Degree in Business Administration"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}