{
    "Job ID": "4728089",
    "Description": "HR Manager - IndustryThe Human Resources and Administration Manager will be responsible for the day-to-day managementof the HR department, including the recruitment, training and appointment of staff and the GeneralAffaires of the company, including communication, and administrative relationships with the SaudiAuthorities and Stakeholders.Key Responsibilities:The Human Resources and Administration Manager’s responsibilities will include but not be limited to:• Manage the Human Resources, Administration and Internal Communication• Attract, select and retain staff of the highest caliber appropriate to job requirements and toorganization standards of efficiency, competence, professionalism and integrity.• Get the Administrative and HR basics right and build from there a top‐class business support function.• Provide in‐depth, tailor‐made assistance to the managers in order to facilitate and support the HRdimension of their mission.• Guarantee all internal communications.• Supervise all administrative communications with Saudi Authorities andStakeholders, with the Owner Company and with Governmental labor departments.• Manage all office admin functions.•Create and work within the regional and international HR network and share best practices in his/herdomain: Staffing (recruitment &amp; selection), Training and Development, Human Resources InformationSystems, Performance Management, Reporting &amp; monitoring (KPI)• Build effective communication channels to ensure that the HR department is aware of andresponsive to the needs of the business units and individuals. Annual proposal of an HR action plan.• Periodically review the local compensation &amp; benefits package with support of the regional head officeand in line with group guidance.• Update/write local policies and procedures as required.• Respect of the HR principles, guidelines and rules of the Group• Internal Communication: staff and organization change announcements; support GM internalcommunication and propose/organize events and meetings aiming to cascade key information andcontribute to building a harmonious community of personnel in JOMEL.• Oversee the verification of Time Sheets, Leave and Vacation applications.• Manage and resolve employee issues and concerns and propose arbitration solution.• Manage Plant Transport and staff.• Ensure the liaison with community.Skills",
    "Skills": [
        "• 10 years of business experience of which at least 5 years in an HR &amp; Experience of working in an",
        "international environment, with a knowledge/awareness of the issues relating to secondments, e.g.",
        "work permits, visas, taxation.",
        "• Proven experience of recruitment and selection.",
        "• Proven management experience with the ability to embrace new initiatives.",
        "• Knowledge in IT management."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Industrial Production; Electric Power Production & Transmission",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}