{
    "Job ID": "4728534",
    "Description": "The Measurement, Insight, & Reporting Section Head is responsible for developing and implementing a measurement and verification program. This includes the Demand Side Management (DSM) portfolio's energy and water conservation programs, as well as related initiatives. It may include up to 70 initiatives with complex solutions, technologies, and changes such as demand response, street lighting, and district cooling, among others.\nThe Measurement, Insight, and Reporting Section Head's additional responsibilities include developing and measuring KPIs and analyses to establish baseline energy/water performance across commercial, institutional, government, industrial, and residential customers.\nThe Measurement, Insight, & Reporting Section Head collaborates with external stakeholders and representatives, certified consultants, and Company’s management.\nAs the Measurement, Insight, & Reporting Section Head is a technical role, this role will entail capacity building and knowledge transfer among peers.\nThe ideal candidate for the Measurement, Insight, & Reporting Section Head position should be well-versed in energy/water efficiency concepts, proactive, and detail oriented.Develop a set of Key Performance Indicators (KPIs) for each of the energy and water demand side management (DSM) programs across commercial, institutional, governmental, industrial, and residential segments of the customer base.\nDevelop a robust Measurement and Verification (M&V) system for calculating the energy or water savings associated with each DSM initiative in accordance with the International Performance Measurement and Verification Protocol (IPMVP).\nManage the implementation of the M&V programs for each initiative to ensure proper adoption and continued use of the DSM initiatives.\nUse energy modeling applications or energy analysis spreadsheets in conjunction with data from a verification and measurement system to calculate the benefits of proposed energy/water efficiency projects.\nIdentify cost-savings and benefit opportunities consistent with the demand-side management programs and policy requirements, including the development and implementation of verification and measurement plans.\nIdentify opportunities for energy/water efficiency improvement based on the results of the verification and measurement system\nEnsure compliance with applicable standards and specifications for work performed as part of demand side management (DSM) initiatives.\nProvide highly credible verification and measurement reports, as well as timely and structured program updates.\nDetermine and recommend the most effective methods for assessing the progress and benefits of the program.\nDefend the accuracy of reports in the face of challenges from regulators and other external bodies.\nCommunicate with key internal directorates/sections to collect data and information and to exert influence over capacity development and program needs.\nCollaborate with stakeholders, portfolio management and analytics, and Task forces, to identify opportunities, close gaps, and implement best practices, as well as to exchange information, resolve conflicts, and coordinate responsibilities.\nMaintain regular contact with management to provide updates on the verification and measurement system, as well as the program's Key Performance Indicators (KPIs).Skills",
    "Skills": [
        "A bachelor's degree in engineering, statistics, or a related technical discipline is required (a master's degree is preferred).\nCertification as a Certified Measurement and Verification Professional (CMVP).\nMinimum of 6 -8 years of experience in DSM, Energy and Water Efficiency program evaluation, measurement, and verification. Experience in energy modeling and cost/efficiency optimization"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All GCC Countries; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Energy & Renewables",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}