{
    "Job ID": "4728060",
    "Description": "Architect with a good understanding of drawing information & approved documents. Ability to execute instructions and mark-ups under minimal supervision. Ability to incorporate information from drawings of other disciplines.Core Responsibilities:Assist seniors in the production of the required documents and drawings.Locate the source and the information and carry out additional research as instructed.Assist senior team members in preparing the feasibility studies and possible documentation works.Develop options for concept designs under the supervision of seniors.Assist team in working out hours estimate per drawing.Take minutes of set up meetings etc.Produces area/ accommodation schedules etc.Read and understand client mark-ups and address them neatly with minimal supervisor support.Self-check and cross-check if all mark-ups have been incorporated.Takes initiative to carry out research on the materials and is enthusiastic about learning and exploring the materials under minimal supervision of seniors.Skills",
    "Skills": [
        "Core Requirements:",
        "Masters with 4 years of experience, or graduates (or equivalent) with 5-8 years’ work experience.",
        "Knowledge of RIBA Stages of Work/ Design stages.",
        "Knowledge of inter-disciplinary coordination.",
        "Aware of the standards and ability to analyze and understand the document.",
        "Aware of local planning authority procedures of work.",
        "Has good knowledge of a range of materials and their varied usages in construction.",
        "PROJECT TOOLS:",
        "REVIT",
        "Navis works – Dynamo",
        "AutoCAD, Sketch up, Photoshop, Indesign, Enscape (preferred)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "6"
    }
}