{
    "Job ID": "4728600",
    "Description": "Objective of DepartmentThe Administration and Finance Department (AFD) is responsible for all financial matters and financial-control functions of the Secretariat ensuring the organisation's financial integrity as stipulated in the GECF Financial Regulations. It also has the responsibility to develop and apply effective human resources management policies to enable the Secretariat to carry out its functions effectively with competent and motivated staff. Additionally, the AFD is responsible for providing services related to the GECF headquarters such as procurement, office supplies, travel arrangements, and logistics for the optimum functioning of the Secretariat.Objective of PostCoordinates logistical arrangements for all GECF internal and external meetings, including Ministerial, Executive Board, and TEC meetings, workshops, high-level working group meetings, and seminars.  Responsible for soft and hard facilities services of the Secretariat premises.  Responsible for procurement activities and delivery and quality control of services/goods necessary for the Secretarial operations.Main duties & responsibilities1.   Plans, coordinates, and supervises the logistical support of the Summits, Ministerial Meetings, Executive Board Meetings, and other events organised by the Secretariat. This includes management of transportation, booking accommodation, venue arrangement, arrival and departure services, catering services, and maintaining communication with delegates for logistics coordination.2.   Ensures the effective, efficient, and high-quality organisation of all meetings and events for which the Secretariat has a servicing responsibility, and that all applicable administrative procedures, rules, and policies are followed in accordance with Regulations, Directives, and other policy guidance of the Secretariat and meeting’s Host.3.   Participates in the development of policies and procedures related to all aspects of planning for servicing GECF’s events and meetings, procurement, and facilities management.4.   Provides support to all internal and external stakeholders in the organisation of meetings and related logistics support. Provides support services and technical expertise as a focal point for all matters related to office facilities and logistic services.5.   Supports the procurement process and ensures consistent and efficient use of standard procurement procedures. Issues Purchase Orders after receiving relevant approvals.6.   Analyses purchase requests, identifies service providers and evaluates information regarding vendors’ performance in the areas of quality, prices, and delivery of goods in view of the Forum’s best interests. Ensures the availability of a pool of qualified suppliers, vendors, and contractors to address the needs of the Forum.7.   Is responsible for the Administration and Finance Department procurement and contracting services.8.   Supports departments in purchase requirements, including suggestions of suppliers where required.9.   Ensures Secretariat facilities are clean and maintained to the highest standards.10. Ensures the maintenance and repair of office facilities and establishes agreements with competent maintenance service providers when it is feasible and determined to be cost-effective. Supervises contracted workforce during job execution to ensure effective repairs without disruption to the Secretariat operations.11. Ensures security and emergency procedures are implemented and Secretariat staff is trained on the emergency procedures. Communicates workplace safety procedures to employees. Acts as the first emergency contact point for the Secretariat. Is responsible for Civil Defense certification renewal and fulfillment of all safety requirements.12. Conducts and documents regular facilities inspection. Act as a focal point between the Tower Management and the Secretariat. Follows up with tower management/landlord for routine maintenance activities.13. Acts as a focal point for facilities-related activities with the representatives of the Host Country.14. Checks completed work by contractors and vendors, related to the maintenance and infrastructure.15. Recommends maintenance, mechanical, electrical, and facilities design modification. Initiates and supervises refurbishment and facilities upgrade projects.  16. Forecasts and proposes budget allocation for the facilities’ upkeep.17. Assists in fixed assets management, including its safety usage and timely inventory. Coordinates moves of furniture and equipment.18. Carries out any other tasks assigned to him/her by his/her relevant superiors (Secretary General / Department Head) as pertaining to his/her background, qualifications, and position. Skills",
    "Skills": [
        "Education: Advanced university degree in Business or Public Administration, Hospitality, Management, Logistics, Events Management, or Procurement Management.   ",
        "Work Experience: A minimum of 7 years of experience. Experience in managing facilities and procurement is a must. Experience in organising high-level events is an advantage. Experience in liaising with government offices is an advantage.",
        " ",
        "Language: Excellent command of English, both written and oral, is essential. Knowledge of the host country’s language is an advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7",
        "Degree": "Master's degree",
        "Age": "Max: 58"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}