{
    "Job ID": "4728639",
    "Description": "Media Search Analyst (Chinese Traditional Speakers)TELUS International AI-Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects.The position will allow you to work from home on a flexible schedule completing tasks in a web-based evaluation tool.What does the job involve? Evaluation of many different task types including Music & Video judgments across media domains \nEvaluation of App Store Content search results \nResearch using online tools to determine and judge the intent and accuracy of queries \nApplying market knowledge with provided guidelines to judge the relevance and intent of task information for your market Equal Opportunity EmployerAt TELUS International, we are proud to be an equal-opportunity employer and are committed to creating a diverse and inclusive workplace. All aspects of employment, including the decision to hire and promote, are based on applicants’ qualifications, merits, competence and performance without regard to any characteristic related to diversity.Skills",
    "Skills": [
        "Familiarity with current Applications, Music & Video trends \nStrong attention to detail and excellent communication are essential \nAbility to work independently and flexibility to new techniques/processes \nPreferred level of education/certification - High School degree or higher\nFurther opportunities may arise to contribute to other tasks on a freelance basis",
        " ",
        "What are the main requirements for the job?",
        "Fluency in English and Chinese Traditional is essential \nYou must be living in Taiwan for a minimum of 1 year \nPreferable candidates will have a keen interest in Music and Video\nYou must have familiarity with the App Store \nPass online evaluations to demonstrate capability of reading and applying the guidelines \nExperience/know-how of Apple products mandatory \nYour email address must have an associated Apple ID \nA keen interest in Internet research \nAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expense"
    ],
    "Preferred": {
        "Residence Location": "Taiwan",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Taipei, Taiwan",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}