{
    "Job ID": "4728590",
    "Description": "Leverage social media trends to advertise and highlight different ongoing activities of the company.\nIndulge in research and creation of engaging content for publishing on different online channels.\n\"Develop, implement and manage the company social media strategy \"\nAnalyze the impact of different online campaigns on the target customer for in-depth evaluation.\nIndulge in continuous efforts to improve online reader engagement by thorough SEO analysis.\nImplement new SEO and social media trends in the organization's existing digital activities for continuous improvement.\nManage social media presence, posting, moderation, and content management.\nMake simple designs for social media posts\nRun, and maintain basic ads on all major social media platforms\nAnalyze marketing needs and strategize with company stakeholders for proper marketing planning.\n- Communicate with 3rd party marketing partners to conduct any needed marketing needsSkills",
    "Skills": [
        "Thorough knowledge of social media indicators like clicks, profile visits, likes, reach, etc.\nExperience in social media content plan.\nFamiliarity with recent digital marketing trends and the best SEO practices.\nProficient in creating original content as per the requirement of the company and target audience.\nExcellent grasp of conventional and modern communication channels for conveying the desired message effectively.\nA cheerful individual with a zeal to understand the target audience and devise social media plans accordingly.\nSalary range from 6500 EGP - 8000EGP"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Saba Basha, Alexandria , Egypt",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}