{
    "Job ID": "4728869",
    "Description": " The Installation Manager is responsible to lead a team of engineers and technicians on the day-to-day responsibilities ensuring all the equipment are in best operational condition in their specified area of responsibility. In addition to overseeing the day-to-day activities the incumbent will coordinate between various labor resources to ensure adherence to the timelines and budgets. Furthermore, he/she will be responsible for on site management and HSE compliance.  \n Be the infield technical expert and participate in in-field diagnosis of technical issues as they arise. \nOversee all repairs and ensure that work is completed on time. \nKeep up to date with current installation skills & techniques. \nDelegate any Installation issues to be resolved on each shift and small projects to the right skills in the team, planning and managing effective works. \n Support and train the installation team to provide the necessary services of installation. \nDevelopment of the department’s operating budget and monitor expenditures\nAct as the Health and Safety representative within the standards and culture of the company \nEnsure all installation meet or exceed company’s, manufacturers and installation guidelines.\nSupport and feedback to third party providers in the delivery of their Service Delivery Targets for company to meet agreed terms with its customers and company’s KPIs. \nMonitor and perform annual performance review for Installation staff and conducts a performance evaluation report on a periodic basis or as and when required! Skills",
    "Skills": [
        " Minimum of a bachelor’s degree in engineering or equivalent. \n10 years plus experience in installation and technical operations across several countries with multiple Business Units. \nMust have experience in GCC. "
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Hardware & Building Materials",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}