{
    "Job ID": "4728605",
    "Description": "Reporting to: ManagerPurpose of Job:To be responsible for designing and applying an appropriate project management framework for the project to ensure project completion within the agreed scope, cost, quality, and time to customer’s satisfactionKey ResponsibilitiesØ To prepare and maintain the Project Plan and the project schedule and be responsible for the budgeting, execution of the plan, monitoring and controlling the project.Ø To liaise with program management (if the project is part of a program) and related projects to ensure that work is neither overlooked nor duplicated.Ø To track actual project performance and costs against project plan, to ensure there is no deviations from plan.Ø To proactively determine and manage risks to the project including the development of contingency plans.Ø Managing the project team and the production of the required project deliverables.Ø To apply the change control process and any required configuration management.Ø To report through agreed reporting lines on project progress through status reports.Ø To adopt an appropriate technical and quality strategy to ensure the successful completion of the project to customers satisfaction.Ø To conduct end of project evaluation, team performance evaluation to assess how well the project was managed and preparing the end-of-project report.Ø To prepare a project Lessons Learned report and also to prepare any follow-on action recommendations as required.Skills",
    "Skills": [
        "1.    Requirement open for Kuwaiti nationals.",
        "2.    Bachelor’s degree in a relevant discipline and a PMI certification.",
        "3.    Knowledge of how to apply standard project management approaches to the specific requirements of the project.",
        "4.    4 to 6 years of relevant experience, of which 2 to 3 years of Project Management experience is required."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}