{
    "Job ID": "4728232",
    "Description": "Job Description:HORECA salesman is responsible for conducting the field sales operation. He applies sales knowledge and techniques to achieve his sales target and collection. He manages customer relationships through outstanding customer service and timely issue resolution.Key Responsibilities & Accountabilities:Follow the daily route plan to make customer visits.\nDiscuss the sales order requirement with customer and take sales order. Make an audit of customers stock to identify requirements. \nProvide inputs on competitor’s promotions, pricing and trends to Sales Supervisor.\nSubmits orders by referring to price lists and product literature.\nImplement the sales promotions effectively as per direction.\nPrepare and share the daily status report to Sales Supervisor.\nHandle customers professionally and address their queries efficiently.\nCoordinate with logistics team to ensure timely delivery of customer orders.\nHandle customer’s complaints regarding return goods by gathering required and submitting it to the logistics team for necessary action.\nFollow up with customer regularly for achieving the collections goal.\nRaise concerns to the supervisor in case of overdue or collection issues.\nPrepare and share the collection status report.\nContact new and existing customers to discuss needs.\nMeeting or exceeding sales goals.\nContributes to team effort by accomplishing related results as needed\nSubmit cheques & bank transfer along with supporting to ensure accurate accounting of collections.Skills",
    "Skills": [
        "Qualification and Experience:",
        "High school and above. .\n+3 Year experience in sales FMCG sector\nHORECA sector experience is a must. \nUnderstanding of the sales process and dynamics.",
        "Skills:",
        "Excellent knowledge of MS Office.\nProficiency in written and verbal Arabic & English language \nExcellent time management and ability to handle workload. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Western Province, Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}