{
    "Job ID": "4728302",
    "Description": "Key Responsibilities:Collaborate with the marketing team to understand project requirements and objectives for 3D design projects.\nCreate high-quality 3D models, animations, and visual assets for use in marketing materials, including social media, websites, presentations, and print collateral.\nDevelop 3D product renderings and visualizations to showcase products and concepts in a realistic and appealing manner.\nUse software tools like Autodesk Maya, Cinema 4D, Blender, or other 3D modeling and animation software to bring creative ideas to life.\nDesign and execute 3D motion graphics and animations for videos, online ads, and interactive content.\nCollaborate with the graphic design team to integrate 3D elements into 2D marketing materials seamlessly.\nEnsure that all 3D designs are aligned with brand guidelines and consistently represent the brand's visual identity.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Bachelor's degree in Graphic Design, Animation, Multimedia, or a related field.\nProven experience (typically 2+ years) as a 3D Designer, preferably in a marketing or advertising setting.\nProficiency in 3D modeling, texturing, and rendering using software such as Autodesk Maya, Cinema 4D, Blender, or similar tools.\nStrong skills in 3D animation and motion graphics, creating visually appealing and dynamic content.\nKnowledge of lighting, shading, and visual effects to create realistic and visually stunning 3D visuals.\nFamiliarity with Adobe Creative Suite (Photoshop, Illustrator, After Effects) for post-production work.\nAbility to conceptualize and execute creative ideas into compelling 3D designs.\nStrong attention to detail and the ability to maintain quality and consistency in all 3D assets.\nEffective communication skills to collaborate with cross-functional teams and present design concepts."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}