{
    "Job ID": "4728043",
    "Description": "Job SummaryThe Marketing Manager strategically creates marketing strategies, plan, and campaigns and undertake all duties necessary to deliver strategies and achieve marketing objectives. This position develops and implements the organization’s global advertising, marketing, and communications program in order to build brand awareness and increase sale. Supports all internal communication initiatives and events to ensure clear communications regarding a variety of mattersPrincipal AccountabilitiesLeads and provides strategic direction to the communications team and taking responsibility for all marketing activities in the organization.\nManages an internal and external team in the delivery of successful marketing strategies\nDevelops and implements marketing campaigns and programs that will continue to establish and increase the growth of the company’s business.\nImplements a marketing and communications strategy to build brand awareness, market services, promote income generation, communicate programs, activities, and impact.Job Responsibilities 2Creates and implements marketing/media plans that include print, online, video, tradeshows, and social networking opportunities.\nLeads, manages and plans key organizational marketing initiatives.\nImplements a marketing and communications strategy to build brand awareness, market services, promote income generation, communicate programs, activities, and impact.\nConcepts and writes branded advertising campaigns, white papers and other technical content.\nConducts market research to identify effective promotional methods and negotiate media contracts.\nCreates, maintains and strengthen organization overall brand in all forms of media (creative and technical writing, online, print, and academic).\nGenerates regular sales reports against marketing plans to demonstrate return on investment against activities, key findings, learnings and recommendations\nOrganizes and streamlines service offerings into customer friendly concepts.\nManages and ensures consistent branding across all office locations.\nEstablishes and maintains successful relationships with media agencies, ensure best value for money and report on effectiveness of the media to help guide on future campaigns.\nOversees brand management, including brand awareness and adherence to brand and corporate identity guidelines.\nManages marketing processes, staff, and vendors to ensure timely delivery of outcomes. Manage and forecast assigned marketing budget.\nTracks, monitors, and evaluates results for specific marketing programs and campaigns, to determine ROI and support the development and refinement of future marketing plans.\nReports on and analyze all aspects of marketing, and ensure effective evaluation mechanisms are in place to measure success.\nEnsures direct reports are providing high levels of service and meeting or exceeding service standardsSkills",
    "Skills": [
        "• Strong understanding of social media and digital marketing",
        "• Understanding and experience in event marketing",
        "• Strong budgeting, business planning and financial monitoring skills",
        "• Experience in implementation of successful integrated marketing campaigns",
        "• Demonstrated background in content management, creative writing, technical writing, advertising concepting, social media, print, media negotiations, and digital advertising",
        "• Proven experience in developing, creating and analyzing marketing campaigns",
        "• ERP knowledge preferably SAP functional skills are a requirement to be successful in this role."
    ],
    "Preferred": {
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}