{
    "Job ID": "4728579",
    "Description": "Support the line Manger in leading and enhancing Boutiqaat marketing bands or reputation in the public’s eye while ensuring uniformity and brand consistency\nCollect data related to customer insight and experience analysis, assess the areas of unsatisfactory performance, brainstorming campaign ideas and draft an action plan accordingly in order to refine Boutiqaat brand.\nAssist in the development and refinement of uniform graphic standards and visual brand strategies.\nAssist in brainstorming of all elements in advertising, media, promotions, and owned/sponsored events from concept creation to execution to ensure Boutiqaat brand is well recognizable and well-spread.\n Assist in designing, planning, and executing relevant promotion plans of campaigns, and relevant activities.\nAssist in preparing content for the publication of marketing material.\nSupport in handling all campaigns related to specific categories in coordination with digital marketing and social media like beauty and international fragrances, fashion and sports, Korean beauty, oriental fragrances, and fashion tech campaigns\nOrganize marketing calendars for men and women on Asana system\nPrepare product launch presentations for new and current suppliers furthermore coordinating with internal marketing sections\nAnalysis and evaluate effectiveness existed and launched campaigns output that reflect on improving Boutiqaat brand\nReporting on trends and statistics across all digital media platforms.\n Review brand analysis and successfully drive sales through various marketing strategies\n Distribute workflow from the purchasing department into other departments to achieve a common goal\nConduct weekly meetings with category managers of all categories to conduct products lunches or campaigns\n Responsible for all in-app activities, including but not limited to: Visuals, Texts, Homepage Layouts)\n Continually seeking and researching new sources of prospective customers while providing recommendations to marketing and sales leadership\n Prepare daily push notifications and marketing slogans. Skills",
    "Skills": [
        " Bachelor’s degree in marketing, business, or related field.\n2-3 years’ experience in marketing/ social media field.\nProfessional marketing certificate is preferred.\nExcellent in bilingual communication skills.\nDetail oriented and ability to focus on achieving required results.\nGood understanding of market research techniques, statistical and data analysis methods.\nAbility to think creatively to develop unique marketing ideas that deliver positive results to boutiqaat clients.\nAware with social media and content management system.\nEffective analytical thinking ,and problem solving.\nAble to prepare presentations, and publicly speaking"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}