{
    "Job ID": "4728522",
    "Description": "JOB RESPONSIBILTIES:-Responsible for performing intermediate design/engineering calculations and collaborating with project leads/engineers/designers to ensure drawings and accurate and complete.\nEngage integrated design teams with the development of BIM strategies.\nHelp develop, document and communicate interdisciplinary BIM Project Plans.\nSetup and monitor the effective development of CAD and BIM based projects.\nCreate and organize CAD and BIM content and templates.\nSupport project teams through clash detection and constructability reviews.\nReceive, prioritize and respond to requests for assistance with design technologies.\nResearch, evaluate and recommend emerging design technologies.\nPrepare work and resource breakdown structure for smooth execution of project.\nMake sure that all drawings are prepared in time and as per the specification and quality requirement.\nMonitors the models for quality and content throughout the project delivery process and at specific project milestones.\nEvaluation and development of BIM processes, policies, protocols and workflows.Skills",
    "Skills": [
        "QUALIFICATION &SKILLS:-",
        "Bachelor’s Degree or High Diploma in engineering  with 10+ years’ experience in similar role in MEP Industry.\nStrong verbal and written communication skills.\nExcellent understanding of BIM procedures, strategies, and workflow.\nProficient in Revit and AutoCAD family is a must.\nHas good experience in different types of projects such as mechanical facilities, Hotels, Office buildings, Shopping malls, etc.\nExperience of large scale and complex projects would be desirable."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Mechanical Engineering; Electrical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}