{
    "Job ID": "4728547",
    "Description": "About the Company:With over two decades of industry excellence, Goldiama Diamond provides a comprehensive platform to transform the Gold & Diamond Supply Value Chain. Operating in Dubai and more than 40 countries worldwide, we offer a robust network, expertise, and essential services to more than 80 partners and new entrants to the industry. Our holistic approach ensures a rewarding experience as we guide clients towards prosperity.Target Audience:Our distinguished clientele includes investors and business partners eager to explore lucrative opportunities in the gold and diamond industry. They value transparency, ethical practices, and long-term sustainability, attributes we prioritize and offer through our extensive network, expertise, and strategic global positioning.Position Overview:GOLDIAMA, a pioneer in revolutionizing the Gold & Diamond Supply Value Chain through Blockchain Technology, is currently seeking an experienced and innovative Senior Web Developer with a specialized focus in Graphic Design. This exciting opportunity is ideally suited to a talented individual passionate about creating visually striking and user-friendly websites. The role of the Senior Web Developer & Graphic Design Specialist is a critical part of our creative team. The successful candidate will be responsible for designing and developing websites, creating engaging graphics and content for marketing and social media platforms, and producing captivating video content for various media platforms.Key Responsibilities:As a Senior Web Developer & Graphic Design Specialist, you will:Possess a thorough understanding of front-end and back-end programming languages such as JavaScript, CSS, and HTML.\nDevelop visually appealing communication and content assets in line with best web design practices.\nCollaborate with teams to support overarching media goals.\nTake initiative on projects to deliver innovative design solutions while adhering to brief guidelines.\nCreate graphic templates, website layouts, presentation designs, and more for the Company and its subsidiaries.Success Metrics:The success of this role will be measured based on the following key performance indicators:Project completion timelines\nCreativity and innovation in design\nWebsite traffic and user engagement metrics\nWebsite security and uptime\nReturn on Investment (ROI)Skills",
    "Skills": [
        "Qualifications:",
        "The ideal candidate should have a minimum of two years of experience in a similar role, be proficient in HTML, CSS, and JavaScript, and have a thorough understanding of Adobe Creative Suite. Experience as a PHP Developer, with a strong sense of design aesthetics in the Technology and Blockchain industry, is preferred. We also value a continuous learning mindset and a willingness to stay updated with emerging technologies and techniques.",
        "Required Skills & Experience:",
        "2-3 years of professional design experience in a design firm, advertising agency, or in-house graphic designer role with an impressive portfolio.\nStrong conceptual skills, high-level sense of design, color, layout, proportion, and typography.\nAbility to provide a variety of design solutions efficiently.\nExpert knowledge of Adobe Creative Suite.\nProficiency in HTML, CSS, and JavaScript for rapid prototyping.\nExcellent written and verbal communication skills.\nDetail-oriented, level-headed, and proactive attitude.",
        "Industry:",
        "Marketing, Supply Chain, Blockchain, and Emerging Technologies.",
        "Employment Type:",
        "Full-time",
        "We look forward to receiving applications from qualified and enthusiastic candidates."
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Corporate Management Office",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}