{
    "Job ID": "4728054",
    "Description": "Responsibilities:We are currently looking for a Risk Manager to form part of our Project Management Consultant (PMC) project team, based in Al Ula, Saudi Arabia.The Risk Manager is responsible the following:Develop and monitor a risk issue and opportunity management process\nDevelop and maintain a risk matrix identifying dependencies and the impacts of not meeting scheduled dates.\nIdentify, monitor and managing dependencies, and for resolving related issues.\nIdentify opportunities to arrange and co-ordinate any necessary discussions and agreements to realize benefits.\nMonitor projects and ensure that an adequate and robust Risk Management process is under active management.\nImplement an internal Risk Management Plan, Risk Log and associated governance processes.\nTrack significant risks to ensure that they are being systematically identified, recorded, evaluated, actively managed and regularly re-evaluated, and communicated across the program.\nIdentify, communicate and manage inter-program or external risks.\nIdentify and manage internal MOI & MOI PMO program-related risks.\nReview and update Risk Log against Program Status Reports & MeetingsSkills",
    "Skills": [
        "Qualifications:",
        "Graduate in Engineering / Business or equivalent\nPostgraduate qualifications or equivalent\nRisk Management qualification or equivalent would be preferred",
        "Essential Criteria:",
        "Understanding and experience of complex projects\nStrong leadership, communication and management skills\nTrack record of risk management\nGenerally you will have 12+ years total experience in PMC",
        "Rewards & Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\nTransportation allowance\nMedical and life insurance cover\nAnnual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants;"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}