{
    "Job ID": "4728103",
    "Description": "تنفيذ الإجراءات المحاسبية اليومية لتسجيل المعاملات المالية بشكل دقيق وفي الوقت المناسب.\nمراقبة ومراجعة الحسابات المالية وضمان تطابقها مع المعايير المحاسبية واللوائح المالية المعمول بها.\nإعداد التقارير المالية الدورية، مثل قوائم الدخل والميزانيات وقوائم التدفقات النقدية، وتحليل النتائج المالية.\nالتأكد من الامتثال للضرائب والتزاماتها وإعداد الإقرارات الضريبية اللازمة.\nالمشاركة في عمليات التدقيق الداخلية والخارجية والتعاون مع المدققين للتحقق من صحة المعلومات المالية.\nتحليل المعلومات المالية واكتشاف الاتجاهات والتباينات وتقديم التوصيات لتحسين الأداء المالي.\nإدارة دورة الحسابات المستحقة والمستحقة وضمان تسوية الحسابات المتأخرة في الوقت المناسب.\nالحفاظ على مستوى عالٍ من السرية والأمان فيما يتعلق بالمعلومات المالية والحسابات الحساسة.\nالاستجابة للاستفسارات المالية والضرائب وتقديم التوجيه والدعم للإدارة وفرق العمل الأخرى.\nمتابعة التطورات في مجال المحاسبة والضرائب وتطبيق التغييرات المناسبة على عمليات المحاسبة.Skills",
    "Skills": [
        "حاصل على درجة البكالوريوس في المحاسبة، المالية، أو مجال ذي صلة.\nخبرة مثبتة في العمل كمحاسب في مؤسسة أو شركة.\nمعرفة عميقة بالمعايير المحاسبية والضرائب والقوانين المالية المعمول بها.\nإلمام ببرامج المحاسبة ونظم إدارة الموارد المؤسسية (ERP) والأدوات ذات الصلة.\nمهارات تحليلية قوية والقدرة على فهم وتفسير البيانات المالية.\nقدرة ممتازة على استخدام برامج الحاسوب، بما في ذلك جداول البيانات وأدوات المعالجة النصية.\nالالتزام بالدقة والدقة في التفاصيل وقدرة على إدارة الوقت بفعالية.\nمهارات تواصل جيدة والقدرة على العمل بشكل مستقل وكجزء من فريق.\nالقدرة على التعامل مع مشاكل مالية معقدة والبحث عن حلول فعالة."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Home & Office Furniture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}