{
    "Job ID": "4728053",
    "Description": "The Reporting Specialist will summarize and analyze data to produce visual and graphical summaries, dashboards, and reports in various formats in order to communicate Project performance, progress, and other topics to various audiences.Core Role Responsibilities/ Accountability:Analyze performance metrics and data.\nSummarize data and information in various formats, including reports and dashboards, for multiple audiences.\nComprehensively assess and evaluate reporting deliverables.\nPrepare and manage preparation of data summaries and reports.\nDevelop and implement protocols and processes to extract, summarize and report data.\nTrack progress towards goals and monitor trends.\nIdentify unusual trends and anomalies for further investigation.\nIntegrate data into reporting software as needed.\nSupervise data analysts and reporting staff as required.\nAssess system performance and identify areas for improvement and innovation to increase quality and efficiency of data-gathering, analysis and reporting systems and methods.\nOversee integration of new technologies and initiatives.\nEnsure data and information security by integrating and maintaining digital security systems as required.\nPerform data management and reporting for other teams and functions as required.Skills",
    "Skills": [
        "Required/Desired Qualifications:",
        "Bachelor’s degree in Engineering or related field. Advanced degree or qualifications preferred.\nProfessional certifications related would be an asset.\nManagement qualifications (PMP, MBA, other) would be an asset.",
        "Required/ Desired Skills and Experience:",
        "At least 8 years of experience, a significant component of which involves data management and reporting.\nDatabase development or programming experience.\nSkilled in analyzing, interpreting, organizing, summarizing and presenting large amounts of data.\nSkilled in organizing findings and data retrieved into information for reports, dashboards and other communication tools.\nThorough understanding of management and data administration duties such as collection, analysis and distribution.\nExcellent communication skills and ability to translate complex problems using non-technical terms.\nSkilled in written communication in English, as well as visual communication methods.\nExcellent problem-solving and analytical skills.\nIn-depth understanding of modern database and information technologies.\nExcellent time management skills and ability to work towards meeting multiple deadlines simultaneously.\nExperience with supervising and mentoring direct reports"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}