{
    "Job ID": "4728599",
    "Description": "Russian Personalized Internet AssessorTELUS International AI-Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities for people with passion for languages. The jobs are part-time, and there is no fixed schedule. Whoever you are, wherever you come from, come join our global AI community.In this role you will be reviewing online search results in order to improve their content and quality. You will be required to provide feedback and analysis on content found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this role will involve reviewing the language used in the search results by examining grammar, tone and cultural relevance.Through this work, you will be making a valuable contribution by expressing your opinion on the quality and content of what is currently out there on the web. You will play a part in improving the quality of one of the largest search engines in the world using both your PC and Smartphone.Why Join the TELUS International AI Community? Earn extra income\nAccess to our community wellbeing initiative    \nRemote work & Location Independence\nBe your own boss\nFlexible Hours to fit in with your lifestyle \nBe a part of an online communitySkills",
    "Skills": [
        "What are the main requirements for the role?",
        "You must be fluent in both written and verbal English & Russian\nYou must be currently living in Georgia\nYou must own and use a Smartphone (Android V4.2 or higher or iPhone running iOS version 14.0 or higher) to complete tasks\nThe majority of the task types will require both a desktop/laptop and a smartphone\nGmail must be your primary email\nActive daily user of Gmail and other forms of social media\nYou must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in Russia\nAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expense\nExperience in the use of web browsers to navigate and interact with a variety of content."
    ],
    "Preferred": {
        "Residence Location": "Georgia",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Tbilisi, Georgia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}