{
    "Job ID": "4728076",
    "Description": "Assist Product Manager in assigned segments including concept to end of life cycle while supporting on growth objectives including market share and revenue of their designated portfolio across assigned markets.Product Marketing and Portfolio ManagementHelp maintain the Product and Brand Matrices to be used for procurement and production purposes, measure and analyse KPIs for optimal brand health & sales results.\nPropose and forecast key products sales volumes, product mix and inventories\nMaintain Product Line Definitions and Products Categorization by working with Strategic Marketing and Account Management\nOversee the satisfactory resolution of all customer complaints by following up on agreed plan of action\nCoordinate with marketing business developers to convert identified priority target customer leads. New Products\nSupport sales in product launches and introductions including the tracking and announcements of launch and availability dates\nSupport in servicing large customers on product management issues Market, Competitive and Customer Intelligence\nContinuously gather market and competitive intelligence related to the assigned product lines and recommend plans accordingly\nCollect and evaluate customer feedback related to assigned products via systematic procedures to ensure customer satisfaction at all times.  Skills",
    "Skills": [
        "Minimum Bachelor degree in business administration, Marketing, or related, MBA is a plus. A minimum of 1-3 years’ experience in FMCG. Preferably have held a brand/product management position for at least 1 year"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}