{
    "Job ID": "4728138",
    "Description": "Coordinate and monitor the end-to-end supply chain process, from procurement to distribution, ensuring timely delivery of products to customers.\nCollaborate with various departments, including procurement, production, logistics, and sales, to align supply chain activities with overall business objectives.\nAnalyze and forecast demand trends, inventory levels, and sales data to optimize inventory management and prevent stockouts or overstock situations.\nManage supplier relationships, negotiate contracts, and maintain open lines of communication to ensure reliable and cost-effective sourcing of materials and services.\nEvaluate supplier performance and conduct regular supplier audits to maintain quality standards and identify areas for improvement.\nDevelop and implement supply chain strategies to enhance operational efficiency, reduce lead times, and minimize costs.\nIdentify and address supply chain bottlenecks and inefficiencies, implementing process improvements to enhance overall supply chain performance.Skills",
    "Skills": [
        "Bachelor's degree in Supply Chain Management, Business Administration, Logistics, or a related field.\nProven experience (typically 2+ years) in supply chain management, logistics, or procurement.\nStrong understanding of supply chain principles, including demand forecasting, inventory management, and supplier relationship management.\nProficiency in using supply chain management software, ERP systems, and other relevant tools.\nAnalytical mindset with the ability to interpret data and make data-driven decisions to improve supply chain performance.\nExcellent communication and negotiation skills to effectively collaborate with suppliers and internal stakeholders.\nProblem-solving abilities and the capability to address supply chain challenges creatively.\nStrong attention to detail and organizational skills to manage complex supply chain processes."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Eastern Province, Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}