{
    "Job ID": "4728050",
    "Description": "Assist in the preparation and management of overview and strategic programmes, including design, procurement and construction schedules together with supporting information required schedules\nInclude all project stages from initiations to completion in the baseline and identify stage gates accordingly.\nCoordinate and manage the preparation and development of master planning, engineering, procurement, and construction schedules together with associated information required schedules\nEstablish and agree project reporting procedures, prepare and present monthly project progress. Develop project and programme dashboard templates to be used across the programme by designer and contractors.\nReview the schedules and related documents from the designers and contractors including monthly reports and analyse the content to ensure compliance with project objectives\nReview schedule trends to identify problem areas and recommend corrective action to management.  Monitor actual progress against planned progress\nMonitor engineering design progress, material and equipment procurement and construction and commissioning status\nPrepare progress monitoring tools using earned value for the management and monitoring of the above mentioned schedules.  Monitor progress both on and off site.  Identify deviations (progress trends) in both construction and procurement progress and suggest possible courses of corrective action\nWorking closely with the Project Controls Manager and Project Team to ensure that the ‘programme’ is feasible, complies with the Project Master Plan and contractual documents\nInterface on a daily basis with the designers, PMCs, main contractor sub contractors and internal management.\nCarry out studies into scheduling, manpower, cash flow, and material flow as needed\nAttend offsite meetings as requested by the client\nReview schedules for slippage of key dates\nAssist in the defence / approval of any claim for time extension or major change to the schedule\nOther duties as requested from time to time\nEnsuring that each Planning Engineer runs his or her section to the highest professional standards, that all information is current, and that every member of the team is receiving the information he or she needs to fulfil their responsibilities.\nEstablish and maintain consistent and adequate administration procedures, in their field.  These procedures will be followed across the project by the respective planners working under the Construction Managers.\nParticipate with the project management team, as directed by the Project Director, to achieve project deliverables.\nInvolve key stakeholder requirements and approvals in the baseline\nIssue high-level schedule weekly updates\nIdentify and report main issues interfering with progress\nIdentify and report on measures for improving schedule performance\nEstablish Scheduling, reporting procedures, tools, templates, instruction, etc. to standardise the work across the program.\nMonitor the timing of submittals against schedule requirements\nDevelop and monitor program KPIs.Skills",
    "Skills": [
        "Requirements:",
        "Ideally, you should possess a degree in construction management and / or civil engineering and hold a membership/chartership from a construction related professional body.\nGenerally you will have 15+ years total experience and have a track record of working on heritage/ hotels/master planning/ museum / cultural / pavilion projects for 10+ years, ideally with 5+ years’ experience of working in the region.\nArabic speaking and writing an advantage",
        "Rewards & Benefits:",
        "We offer an excellent package which includes:",
        "A competitive salary\nTransportation allowance\nMedical and life insurance cover\nAnnual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants;"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}