{
    "Job ID": "4728833",
    "Description": "Safety Manager - Red Sea ProjectOne of the leading business Groups in Saudi Arabia is looking for Safety Manager & Dy. Safety Manager for their upcoming Hotel Construction Project at Red Sea.Skills",
    "Skills": [
        "Engineering Degree or Diploma certified by a body of Internationally recognized safety professionals\nNEBOSH certification - Level 6,\nFirst Aid /CPR/AED certification, ISO 45001\nLead Auditor certificate\nMinimum 10-15 years experience in Hotel Construction / Mega Malls / High rise building construction etc with Consultants / Contractors, of which at least 5 years at the Managerial level.\nCandidates with ME experience would be preferred.\nFluent in the English language.\nDevelop and execute a robust safety strategy and program for the Red Sea Project, aligned with international best practices, local regulations, and project objectives.\nLead, mentor, and manage a team of safety professionals to ensure the effective implementation of safety policies and procedures.\nConduct thorough risk assessments and identify potential hazards across project sites, facilities, and operations.\nDevelop and deliver safety training programs to ensure all project personnel are well-informed and equipped to follow safety protocols.\nCollaborate closely with project managers, contractors, and relevant stakeholders to integrate safety considerations into project planning and execution.\nMonitor safety performance and compliance metrics, analyze data, and provide recommendations for continuous improvement.\nInvestigate incidents, accidents, and near misses, and develop corrective and preventive action plans to mitigate future risks.\nMaintain a strong working knowledge of relevant safety regulations, codes, and industry standards, and ensure their application across the project.  "
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 20",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Unspecified",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}