{
    "Job ID": "4728785",
    "Description": "Expert Fittings: conduct precise fittings for clients to ensure perfect measurements and an impeccable fit for luxury evening wear garments.\nAlterations and Customization: skillfully alter and customize designer gowns and outfits according to individual clients' requirements, ensuring a flawless finish.\nSewing and Embellishments: proficiently handle sewing machines and perform intricate embellishments, ensuring the utmost attention to detail and craftsmanship.\nPattern development: creating and developing new items patterns \nFabric and Material Knowledge: possess extensive knowledge of luxury fabrics, textiles, and materials commonly used in evening wear, ensuring the ability to handle delicate and luxurious fabrics with care.\nQuality Assurance: maintain the highest standards of quality and craftsmanship, ensuring all garments meet our boutique's exacting standards.\nTime Management: efficiently manage workload and meet tight deadlines without compromising on the quality of work.\nClient Interaction: communicate effectively with clients\nTeam Collaboration: work closely with the boutique's sales and customer service teams to ensure a seamless customer experience from selection to fitting.\nEquipment Maintenance: take responsibility for the proper maintenance and care of sewing equipment and tools.\nProfessionalism: possess a professional and customer-focused attitude at all times and a genuine passion for luxury eveningwear and high-quality craftsmanship\nProvide personalized bridal assistant service in collaboration with the Alteration Team.Skills",
    "Skills": [
        "Proven experience as a Tailor, Seamstress, or similar role, with a track record of garment construction and alterations.\nExperience in evening wear, bridal and couture.\nIn-depth knowledge of garment patterns, fabric properties, and various sewing techniques.\nStrong proficiency in hand-sewing and machine-sewing methods.\nExcellent attention to detail and precision in tailoring tasks.\nAbility to interpret and adjust garment patterns for various body types and styles.\nLeadership and mentoring skills to guide and train junior tailors.\nStrong communication skills to interact with clients and team members effectively.\nTime management and organizational abilities to manage multiple tailoring projects.\nFlexibility and adaptability to handle unique tailoring requests and design challenges.\nHigh degree of professionalism and commitment to delivering exceptional tailoring services."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Fashion & Apparel; Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}