{
    "Job ID": "4728334",
    "Description": "To ensure that the company's materials and products meet the specifications and negotiating with vendors as needed to get higher quality goods at the lowest prices possible.Analyzed purchase and regional monthly/quarterly RFPs and negotiated accordingly.\nResearch potential vendors.\nFollow up with suppliers, as needed, to confirm and track the demand changes. \nMaintain update records for vendor contact details. \nUpdating price changes and comparing them with the global benchmark.\nEnsures that contract manufacturers are dealing with all the selected vendors with the agreed terms according to the timeline identified\nIdentify new chemical manufacturers and following up with R&D for approvals and documents needed.\nMentor and evaluate vendors every quarter.\nCommunicate among contract manufacturers purchasing, planning and quality departments to resolve internal and external issues for vendor’s challenges… e.g. defects materials, different rates, delay in supply and provide status updates in a timely manner. \nPush vendors for the materials that may run out on short notice and ensure that they are procured and delivered before the company suffers loss. Success Metrics (desired) Drives Ownership and High Performance: Takes ownership for ensuring goals and targets are consistently achieved or surpassed. \nFosters a culture of that promotes high performance, initiative and achievement. \nPlans and manages resources effectively to deliver on goals. \nTackles goals with enthusiasm and removes barriers to success. \nDisplays an ‘owner mentality’ for the business and takes responsibility for ensuring its success Delivers Value and Results:Constantly seeks opportunities for growth and adding value to the business \nHas a clear understanding of key factors that drive profitability, competitive advantage and organizational value\nEnsures the delivery of a high quality service that fully meets customer and business needsBuilds Collaborative Relationships:Acts with diplomacy and maturity in intense interactions, ensuring any tension is resolved tactfully \nCreates and encourages a climate of team work and collaboration across Sealed Air and acts as a visible role model for these behaviors \nRelates well to people at all levels, quickly building credibility and respect \nConsults with others to achieve mutually beneficial outcomes Is Decisive and Mobilizes Action:Conducts an in-depth analysis of available information prior to making decisions \nCan act promptly when urgent decisions are required, taking calculated risks and making clear decisions \nMoves promptly into action when decisions are made to keep plans on trackSkills",
    "Skills": [
        "Has no formal managerial responsibility, but may provide guidance to colleagues (e.g., provides coaching, assigns work, provides input into hiring decisions and evaluating performance). \nAdvanced business knowledge, analytical, problem solving, relationship management and leadership skills.\nExperience with contract drafting and negotiation skills.\nAdvanced expertise in procurement concepts and terminology. \nExperience with cost analysis.\nGood verbal and written communication, documentation, and planning skills. \nFluent in English and Arabic.\nExcellent interpersonal and communication skills (written and spoken). Solid demonstrated presentation skills with ability to convey complex information to a broad audience. \nStrong time management skills with the ability to multi-task while being flexible with changing demands.\nProficient in Microsoft Office applications, especially Word, Excel, and PowerPoint."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}