{
    "Job ID": "4728587",
    "Description": "Conception and execution of motion graphics animation-based projects;\nAnimation of design assets;\nUI/Web design animation\nKnowledge of various social media platforms and how to use video to engage with different audiences;\nProvide creative vision to the editing process, bringing your own style to create beautifully composed work;\nDevelop creative, strategic ideas that solve specific marketing challenges;\nTake an initial concept to the next level with motion graphics and animations, including 2D and 3D animations;\nMaintain and troubleshoot video equipment;\nWorking knowledge of Photoshop and Illustrator, in addition to video editing software;\nAssist in live event and studio production, including setting a stage, lighting a set, and shooting footage w/video or still camera;\nWork in close collaboration with  Department heads, marketing managers and throughout all phases of project development.Skills",
    "Skills": [
        "Strong organizational skills to manage multiple projects simultaneously;\nExperience with 3D and Cinema 4D would be an added value\nAbility to work independently with minimal supervision; able to follow direction;\nBasic videography/production skills;\nExperience with After Effects, Premiere Pro, Illustrator, and Photoshop;\nBachelor of Arts – in Art Direction, Graphic Design, Motion Graphics or equivalent field. experience;\nAbility to work on multiple projects and brands simultaneously;\nAttention to detail and accuracy;\nAccuracy/attention to detail;\nUnderstanding of broadcast and digital distribution best practices including technical aspects of production;\nComfortable working under pressure with tight deadlines;\nProficiency in Adobe After Effects, Premiere, Illustrator, and Photoshop and in at least one 3D motion design tool such as Cinema 4D or similar;\nA strong demo reel;\nAt least 2 years and above experience with motion graphics film/video production house, agency or in-house environment.\nThe Candidates should be excellent at video production and photography in addition to graphic design."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}