{
    "Job ID": "4728499",
    "Description": "Responsible for the Operational Expenditure and ensuring it stays within the overall business targets for assigned contracts\nWork with Procurement to negotiate the best commercial and operational terms with vendors for defined elements of overall deals.\nConduct assessments of vendor technical and commercial capabilities and cultural compatibility\nResponsible for the Operational Contract governance, implementing changes as the business needs to evolve.\nAccountable for the financial operation of the contracts\nResponsible for supporting new contract definition\nResponsible for facilitating the resolution of contractual disputes and collecting any resulting value.\nProvide insightful analysis of Suppliers' performance, highlighting key aspects of their delivery.\nAct as the initial point of contact for the assigned support contracts.\nPromote health and safety through the defined governance structure\nEnsuring the Suppliers are aware of the impact of their performance against targets.\nContinually challenge the support costs and balance those costs against the overall delivery of the Shareholder's KPI.\nManaging the suppliers to move to the new contract mechanisms and way of working.\nMaintain control over any charges for services that are not covered by the scope of the contract.Skills",
    "Skills": [
        "FIDIC contracts knowledge\nEngineering Background with Experience in Roads, Bridges, and Tunnels\nClaims, Change Orders, variations and Disputes\nExperience in a Managed Service Environment\nPlanning and Organization: Knowledge of Project Management, Prince 2 would be an advantage\nMust be structured and organised\nExperienced in dealing with confrontation to gain win-win situations\nA team player with strong interpersonal skills and excellent oral, and written communication skills, including extensive presentation and reporting skills.\nMust be able to build and maintain key relationships with customers, suppliers, and vendors.\nNumerate with good commercial acumen\nA can-do attitude and be able to start and complete assigned tasks in isolation or within a team environment."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}