{
    "Job ID": "4728580",
    "Description": "Position title: Photographer/ VideographerCompany Brief:Our client is an entrepreneur in spirit, who truly believe that ordinary is the road to nowhere. They are an integrated communication company. They believe in concrete, palpable results. They are strategic thinkers yet street-smart. They are true believers that dedication leads to mastery. They are currently looking to hire an experienced are currently looking to hire an experienced Photographer/ Videographer to join their team in the UAE.Responsibilities:Collaborate with the creative team to develop captivating advertising concepts.\nCapture and process images and videos skillfully to achieve desired results aligned with campaign objectives.\nMaster the art of shooting natural and engaging poses for both photographs and videos.\nEnhance image and video quality using various editing methods to meet industry standards.\nUtilize a wide range of modern and traditional technical equipment, including cameras, lenses, and audio recorders.\nSkillfully arrange objects, scenes, lighting, and backgrounds to meet specific campaign requirements.\nDirect and guide participants during photo and video shoots to capture authentic expressions and emotions.\nOrganize and archive photographic images and videos to maintain a well-organized database.\nStay updated with the latest photographic and videography best practices and techniques.\nEdit and enhance photographs and videos using industry-standard software for print, web, and other mediums.Skills",
    "Skills": [
        "Requirements and Skills:",
        "Proven professional shooting experience in advertising or marketing campaigns.\nEye-catching portfolio showcasing visually compelling and persuasive advertising content.\nProficiency in using both traditional and modern photography and videography equipment.\nSolid knowledge of photo and video editing software like Photoshop, Capture One, Premiere, After Effects, etc.\nExcellent shooting, lighting, and printing skills to produce high-quality images and videos.\nFamiliarity with the production process for online publishing and various printing applications.\nAbility to multitask and manage multiple photography and videography projects simultaneously.\nA degree or equivalent qualification in photography, videography, or a related field is preferred."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}