{
    "Job ID": "4728052",
    "Description": "Responsibilities:Your role as Primavera P6 Lead will be as follows:Act as a single point of contact to the Programme Manager regarding all Primavera P6 Enterprise Software matters.\nAct as a single point of contact regarding P6 interface / integration matters.\nAdvise the Programme Manager on best use of coding / user access / templates / reports.\nAdvise the Programme Manager on best use of the P6 Dashboard and viewing Programme / Portfolio data.\nLiaise with all Planners to ensure that agreed best practice is being implemented.\nManage all P6 web administration.\nDevelop and maintain Programme / Portfolio reports.\nPerform maintenance and issue resolution tasks in order to ensure performance continuity of the Primavera System\nReview and analyze schedules in accordance with programme governance procedures.\nReview and analyze cost and resource loading data in accordance with programme governance procedures.\nParticipate in management meetings\nCommunicate clear and concise data to the program team.Skills",
    "Skills": [
        "Qualifications:",
        "A self-starter who needs minimal supervision to fulfill their primary role & responsibilities\nAbility to monitor compliance and to give constructive feedback.\nAssertiveness and technical ability to challenge proposals to achieve results.\nLogical approach to developing processes, procedures and best practice.\nAbility to identify and implement continuous improvement.\nStrong relationship management skills and the ability to influence others and gain their commitment and enthusiasm.\nSensitive and accommodating of all cultures.",
        "Desirable Criteria",
        "Experience of working on major projects\nManaged teams in a dynamic project / programme environment.\nDemonstrate senior management / stakeholder engagement\nExperience in Primavera Risk Analysis Software\nOracle University qualification: P106-A Administration in Primavera P6 and P6 Web Access.\nOracle University qualification: P801 Primavera P6 Rel 8 Fundamentals\nMiddle East Experience",
        "Essential Criteria",
        "Relevant years of experience working within a Project Controls environment.\nExpert user of Primavera P3e/P5/P6 with minimum 8 years extensive experience.\nExperience must include familiarity with both the P6 Client (Rel 7) and P6 Web Access ( Rel 8) applications.\nHighly skilled at setting up and maintaining Primavera P6 Enterprise Software.\nSkilled at designing and implementing robust Project Control Frameworks.\nExcellent understanding of other IT Systems and how Primavera P6 interfaces with other IT Systems .\nExperience of creating Project Workspace’s to communicate Portfolio / Programme information to team members and Senior Management . i.e. Viewing portfolio data on a dashboard, customizing dashboards and creating project templates.\nWorking knowledge of all other Primavera P6 functionality; configuration, database maintenance, data storage, report generation, user security.\nWorks independently with the ability to interpret and deliver management intent.\nExtensive experience of using Microsoft Products\nExcellent report writing and presentation skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}