{
    "Job ID": "4728723",
    "Description": "Primary Duties and Responsibilities:Responsible for overseeing all engineering aspects of LNG Storage Tanks with the EPC Contractor including design, materials, equipment, fabrication, and execution. Ensures all technical requirements such as tank specifications, data sheets, design, and construction procedures, etc. developed during EPC fully comply with project requirements and EPC schedules.\nProvide clear guidance to the EPC contractor and facilitate resolution of all technical issues associated with the LNG tanks design and construction to meet project objectives and milestones.\nProvides engineering knowledge, design, quality assurance, leadership and expertise on LNG tanks while supervising EPC Contractor’s design in accordance with design specifications, industry standards, project procedures and requirements.\nResponsible for overseeing all engineering aspects of LNG Storage Tanks with the EPC Contractor including design, materials, equipment, fabrication and execution. Ensures all technical requirements such as tank specifications, data sheets, design and construction procedures, etc. developed during EPC fully comply with project requirements and EPC schedules.Skills",
    "Skills": [
        "Qualification:",
        "Bachelor’s degree in engineering (Mechanical or Civil – preferred)\nMinimum 12 years’ experience at a senior engineering or advisory level with specific knowledge in LNG tank technology and design and a broad knowledge of engineering execution of onshore LNG facilities design, construction, and operations. \nFamiliarity with applicable industry codes e.g., API 625 & 620 & ACI 376"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}