{
    "Job ID": "4728659",
    "Description": "Technical Engineer (Civil Engineer)Position Summary:We are seeking a highly skilled and motivated Technical Engineer (Civil Engineer) to join our organization. The successful candidate will be responsible for overseeing and managing the technical aspects of construction projects.Responsibilities:1. Provide technical expertise and guidance during the planning, design, and construction phases of civil engineering projects.2. Review project plans, IFC drawings, and specifications.3. Conduct on-site visits to monitor construction progress and resolve any technical issues that may arise.4. Supervise and coordinate the shop drawings and material with subcontractors and suppliers to ensure their work aligns with project specifications.5. Manage and document project changes, including updating drawings, specifications, and other project-related documentation.6. Prepare Program Baseline, Monthly Progress reports, including project status updates, technical analysis, and recommendations.Skills",
    "Skills": [
        "Qualifications:",
        "1. Bachelor's degree in Civil Engineering",
        "2. Minimum of 8 years of experience working as a Technical Engineer with tier 1 Main Contractor in high rise projects.",
        "3. Strong working knowledge of civil engineering principles, building codes, and regulations.",
        "4. Proficiency in engineering software, such as AutoCAD, Civil 3D, Premivira or similar tools.",
        "5. Demonstrated ability to manage multiple tasks/ Projects and prioritize workload to meet project deadlines",
        "6. Familiarity with project management principles and construction methodologies.",
        "7. Having UAE driving License"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 8",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}