{
    "Job ID": "4729445",
    "Description": "ArchitectureMaterials engineers will test and assess the materials used in design and construction. They ensure that building and infrastructure materials are suitable and offer guidance on the best materials to use for a project, based on their individual properties, project costs and timeframes.Responsibilities:• Developing, testing, and evaluating materials.• Advising about the suitability of different materials for their products.• Identifying and resolving faults or defects.• Planning and advising on inspections, maintenance, and repairs.• Monitor material performance and evaluate material deterioration.• Evaluate technical specifications and economic factors relating to process or product design objectives.• Analyze product failure data and laboratory test results in order to determine causes of problems and develop solutions.• Conduct or supervise tests on raw materials or finished products in order to ensure their quality.• Review and approve appropriate methods for fabricating and joining materials.• Review new product plans and make recommendations for material selection based on design objectives, such as strength, weight, heat resistance, electrical conductivity, and cost.• Conduct training sessions on new material products, applications, or manufacturing methods for clients and their employees.• Plan and evaluate new projects, consulting with other engineers and corporate executives as necessary.• Perform managerial functions such as preparing proposals and budgets, analyzing labor costs, and writing reports.Skills",
    "Skills": [
        "BS Engineering in related discipline with 5 years experience on mega infrastructure projects.",
        "• Analytical skills",
        "• Excellent verbal and written communication skills",
        "• Should have good hands-on experience is MS office and reporting."
    ],
    "Preferred": {
        "Years of Experience": "Min: 6 Max: 10"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Architecture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}