{
    "Job ID": "4729643",
    "Description": "Assist the Manager in Planning the Marketing Activities.Promotions.\nPOSM.\nSocial Media.Follow-up & monitor the execution of planned marketing activities.\nSubmission of report with analysis on the executed activities.\nMonitor the approved budget vs the spending.\nDistribution of POSM to all the GCC or sharing the POSM designs with all the concerned people of GCC.\nIn Market Sales Analysis of all countries and to be present monthly.\nAnalyze the market data internal and external as an when advised and present as agreed.\nAssist the Brand Manager in sales analysis (by category / by channel), planning.\nVisiting the market in association with the Brand Manager and report the findings.\nCommunicate with agencies to get the required data / information / POSM designs as per the company requirement and guidelines. It has to be shared with the manager for approval.\nPeriodic (every six months) competitors price analysis in all GCC.\nAssisting in preparation (orders from all countries, Co packing, Promo stickers) of promotions orders as that it reaches the GCC in agreed time line.\nSearch and update the manager with the exhibition / events and plan / arrange for the agreed exhibition / events requirements.\nTraining of sales / merchandiser / promotors.\nSupport and coordinate with product development team- GCC countries.Updating planogram and merchandising techniques with brand managers.Skills",
    "Skills": [
        "Arabic Speaker (Native) with Excellent English (Read/Speak/Writing).\nMS office (Advance Level).\nAbility to resolve problems in an efficient manner.\nA complete understanding of manufacturing processes.\nSuccessful application of health and safety practices.\nGood leadership skills and a desire to work in a team environment.\nEffective communication, analytical & interpersonal skills.\nGood Planner with time Management Skills.\nMicrosoft Office Suite."
    ],
    "Preferred": {
        "Career Level": "Fresh Graduate",
        "Years of Experience": "Min: 0 Max: 2",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22 Max: 25"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}