{
    "Job ID": "4729884",
    "Description": "Greet vendors, customers, job applicants and other visitors and arrange for transportation services when needed.\nDirect visitors by maintaining employee and department directories.\nOperate a switchboard to route incoming calls and place outgoing calls.\nMaintain professional etiquette to welcome visitors and guide them as per requirement.\nMaintain security by following procedures, monitoring logbook and issuing visitor badges.\nMaintain smooth functioning of the company by supporting in-house members with general organizational tasks as per requirement.\nGreet clients as soon as they arrive and connect them with the appropriate party.\nMaintain fluent communication by conveying important messages arriving through phone calls to the respective staff member.\nMaintain a systematic record of the company calendar, including up-to-date data on upcoming events and meetings.\nProvide basic and accurate information in-person and via phone/email\nStay prompt in conducting all the essential tasks and responsibilities expected from a corporate receptionist.Skills",
    "Skills": [
        "An optimistic individual able to interact with the desired person through written and spoken communication modes.\nHands-on experience in operating MS Office Suite and relevant software.\nSound command on effective management of existing tasks to enhance work output and create a smooth flow of in-house operations.\nPrior exposure as a receptionist in a professional corporate setting or company.\nAn enthusiastic professional with an ability to perform multiple tasks after analyzing various company parameters.\nGood understanding of formal requirements, portraying eloquent communication skills and appearance."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Gender": "Female",
        "Nationality": "Kuwait",
        "Degree": "High school or equivalent",
        "Age": "Min: 23 Max: 35"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Installation & Technical Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}