{
    "Job ID": "4729796",
    "Description": "• Ensure EH&S work processes, standards and procedures are effectively applied within the units and functions through role assignment and training.• Support site-wide EHS&S systems as needed.• Ensure that the Management of Change for EHS&S matters is implemented.• Able to lead and participate in Site initiatives and teams in order to drive EH&S improvements.• Able to lead and participate in Incident and EH&S Investigations.• Lead and champion management system reviews in order to drive toward the value of continuous improvement offered by the assessment and audit processes.• Identify, escalate and resolve as appropriate potential EH&S risks.• Lead incident reduction efforts.• Leads the mgmt system/plant so that the EH&S MOC process is implemented• Organizes and manages the EH&S standards, requirements etc. for was of access and up-to-datedness• Provide functional coaching to people performing EH&S related roles.• Address incident and audit corrective actions that involve systems deficiencies.• Work with Site leadership to plan resources and determine specific business needs.• Coach to the EH&S Technicians to determine specific unit EH&S needs.• Assure that the compliance process in the units is in place and functioning.• Accountable for cost-effective implementation of EH&S systems through standard work processes and common systems.• Ensure waste-management process and environmental license to operate requirements are in place and being followed. Assist in non-routine waste disposal as needed.• Participate and provide data to EH&S audits as defined by the audit process.• Works with Site leadership to determine the applicability of regulatory requirements to their units• Act as focal point for Agency Visits• Own and implement the Site’s EH&S work processes, tools and procedures and ensures effective execution in order to attain and maintain an effective EH&SSkills",
    "Skills": [
        "Ability to transmit knowledge (teaching, coaching, communicating, documenting) as well as exhibit and instill commitment, passion, culture change behaviors. Must be effective at organizational management, specifically leading, mentoring, coaching, and developing EHS&S talent.",
        "• Knowledgeable on the Site’s EH&S standards & procedures and can coach others appropriately",
        "• Is able to maintain the good relationship with all Site personnel and across all functions",
        "• Is able to coach the Site personnel on EH&S",
        "• Can evaluate process changes for potential risks",
        "• Can identify incident reduction issues",
        "Can implement incident reduction and preventive actions",
        "• Can describe the corrective action process and coach others on it",
        "• Is able to use track and manage key action items stemming from investigations and audits to input data and pull reports and constantly monitor the application and progress of them",
        "• Can effectively coach / influence others",
        "• Should have good understding of the RC requirements and experience in communicating and dealing with RC authorities."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Manufacturing; Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}