{
    "Job ID": "4729739",
    "Description": "Recruitment / Talent Acquisition§ Ensures the implementation of policies, procedures and programs on recruiting, selection, performance evaluation, promotion and transfers.§ Ensures proper implementation of Manpower planning procedures in the sector across the business functions.§ Work with department heads within the company to understand their manpower requirements and reach mutual agreement on implementing recruitment plans to meet those requirements in the most effective and efficient ways and ensure timely onboarding of candidates.§ Identify and develop the right sourcing and network of high calibres and talented candidates inside/outside Saudi Arabia.§ Designs and launches effective recruitment campaigns for different job groups; suggests appropriate recruiting channels for different job groups.§ Receives all employment requests and produces short lists for each vacant position.§ Contributes to develop online career portal to attract and manage a database of suitable potential candidates.§ Develop & manage relations with educational institute, event organizers, and advertising media agencies.§ Monitor and control hiring vs. approved manpower plan§ Performs background and reference checks prior to hiring of candidates.§ Communicates with applicants regarding processing & status of employment applications.§ Managing Self, Others and Resources: organize self and work effectively. Provides support and guidance, either formally or informally, to help others achieve objectives. Makes best use of resources and maintains. Standards and integrity;Skills",
    "Skills": [
        "§ Hold a Bachelor degree in HR management or related major.",
        "§ Time commitment.",
        "§ Strong teamwork.",
        "§ Excellent interpersonal and communication skills",
        "§ Ability to work under pressure",
        "§ Fluent in English & Arabic.",
        "§ 2 – 5 years working experience in Recruitment and HR projects."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}