{
    "Job ID": "4729598",
    "Description": "Job DescriptionOur Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.Main Job Responsibilities:Accounting Operations:Manage team that performs day-to-day accounting operations and ensure timely and accurate recording of financial transactions.\nDevelop and implement accounting policies, procedures, and internal controls to safeguard company assets and maintain compliance with relevant regulations.\nCoordinate and oversee the month-end and year-end closing processes, including reconciliations and accruals.\nMaintain accurate and up-to-date general ledger accounts, ensuring proper classification of revenues, expenses, and assets.\nMonitor and reconcile bank accounts, credit cards, and other financial accounts.Financial Reporting:Design and manage all standardized cyclical reporting processes, including management reporting, investor reporting, and financial statement reporting.\nPrepare, review and publish and analyze standard financial statements, including income statements, balance sheets, and cash flow statements.\nSupport downstream reporting and analysis activities by ensuring that enterprise systems are configured in a manner that ensures scalability and maximizes transparency.\nGenerate regular financial reports and provide insights to support strategic decision-making by management.\nEnsure compliance with accounting standards and regulatory requirements in financial reporting.Accounts Receivable & Accounts Payable:Oversee the accounts payable function, including invoice processing, payment approvals, and payment run preparation. \nOversee the accounts receivable process, including invoicing, collections, and revenue recognition. Monitor and analyze customer accounts, ensuring timely payment and resolution of outstanding balances.Payroll Management:Oversee the payroll process, ensuring accurate and timely payment to employees in compliance with applicable laws and regulations.\nCollaborate with HR to maintain employee records, update payroll information, and manage payroll-related deductions and benefits.\nPrepare payroll reports, including tax withholding, deductions, and contributions, and ensure payroll compliance with local tax authorities.Other:Tax Compliance: Understand taxes applicable to the Company’s activities in all jurisdictions in which it operates, and ensure continued compliance with respect to local tax laws in each jurisdiction.\nFinancial Strategy and Risk Management: Collaborate with senior management to develop and execute financial strategies aligned with the organization's goals and objectives.\nFinancial Systems and Processes: Continuously improve financial systems, processes, and controls to enhance efficiency, accuracy, and scalability. Evaluate and implement appropriate financial software and tools to streamline operations and reporting.\nTeam Leadership and Development: Lead and mentor a team of finance professionals, fostering their growth and development. Provide guidance and support in financial analysis, reporting, and decision-making.\nStakeholder Management: Collaborate effectively with internal stakeholders, including executive management, department heads, and cross-functional teams. Provide financial insights and recommendations to support strategic initiatives and business development opportunities.\nExternal Relationships: Manage relationships with external stakeholders, such as auditors, financial institutions, and regulatory bodies. Ensure compliance with external reporting requirements and facilitate external audits as needed.\nContinuous Learning and Professional Development: Stay updated on industry trends, best practices, and regulatory changes in finance and accounting. Pursue professional development opportunities to enhance knowledge and skills.Skills",
    "Skills": [
        "Job Summary:",
        "We are seeking a highly motivated and analytical Financial Manager to join our growing team. As the Finance Manager, you will lead mission-critical efforts to provide financial transparency into all enterprise activities on an ongoing basis and will be responsible for overseeing all aspects of accounting operations, bookkeeping, financial reporting, accounts payable, and accounts receivable.",
        "The ideal candidate will be enterprise-minded, solution-oriented, collaborative, and will possess strong English communication skills, pay great attention to detail, and have a knowledge of basic accounting rules & principles.",
        "Needed Competencies:",
        "Ability to thrive in a dynamic, fast-paced, multi-cultural environment.\nProven experience leading key components of a monthly, quarterly, and annual accounting close function.\nExperience as a Lead or Manager level in an accounting operations function.\nStrong knowledge of financial management principles, accounting practices, and financial analysis techniques.\nSolid understanding of financial reporting, budgeting, and forecasting processes.\nProficiency in financial software and ERP systems, with advanced Excel skills.\nExcellent analytical and problem-solving skills, with keen attention to detail.\nStrategic thinking and business acumen, with the ability to align financial goals with overall organizational objectives.\nStrong leadership and team management abilities, with excellent communication (English) and interpersonal skills.\nExperience in risk management, financial strategy, and stakeholder management.\nProfessional certifications such as Certified Public Accountant (CPA), Certified Management Accountant (CMA), or Chartered Financial Analyst (CFA) are highly desirable.",
        "Education:",
        "Bachelor's degree in Finance, Accounting, or a related field. MBA or advanced degree is preferred.",
        "Experience:",
        "5 years of experience.",
        "Knowledge, Skills and Abilities:",
        "Enterprise minded.\nAbility to visualize data and tell a story through presentation of information & data.\nSolution-oriented.\nAttention to detail.\nMotivated and pursue constant improvement.\nKnowledge of US GAAP.\nExcellent proficiency with Microsoft Excel / Google Sheets.\nExcellent written and communication skills in English.",
        "Preferences:",
        "Certified Public Accountant (CPA).\nCertified Management Accountant (CMA).\nChartered Financial Analyst (CFA).\nFinancial Risk Manager (FRM).\nCertified Treasury Professional (CTP).",
        "Travel:",
        "None",
        "Work Schedule:",
        "Avertra local office schedule + frequent US hours.",
        "Benefits",
        "What can we promise you:",
        "You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}