{
    "Job ID": "4729847",
    "Description": "Job Purpose الغرض الوظيفي Oversee construction projects of Al-Tijaria and for ensure the timely completion of these projects according to specifications. The Project Manager is responsible for managing all aspects of the project work being performed by contractorsالإشراف على مشاريع البناء في الشركة التجارية وضمان إنجاز هذه المشاريع في الوقت المناسب وفقا للمواصفات. مدير المشروع مسؤول عن إدارة جميع جوانب أعمال المشروع التي يقوم بها المقاولونDisclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.تنويه: على الموظف الإلتزام بالسياسات وإجراءات الشركة التجارية وإتباعها.AccountabilitiesمسؤولياتOversee and supervise projects and perform field visits/inspections to ensure their the timely and cost effective completion\nالإشراف والمراقبة على المشاريع وإجراء الزيارات الميدانية/ التفتيشية لضمان الإنجاز بالوقت ولتكلفة فعالية\nConsult with architects, electromechanical engineers and other technical workers to make sure that project designs and contractor work meet set specifications\nالتشاور مع المهندسين المعماريين والمهندسين الكهروميكانيين وغيرهم من العاملين الفنين للتأكد من أن تصاميم المشاريع وأعمال المقاول تلبي المواصفات المحددة\nWork with Planning engineer to ensure that projects are on schedule as planned and to notify senior management of any deviations from plan as quickly as possible In accordance with PCD\nالعمل مع مهندس التخطيط لضمان أن تكون المشاريع في الموعد المحدد كما هو مخطط لها وإخطار الإدارة العليا بأي انحراف عن الخطة في أسرع وقت ممكن وفقا لإدارة ضبط المشاريع\nCoordinate with Al-Tijaria engineers working with contractors and professional services offices to ensure that suppliers contractors  understand Al-Tijaria project needs, requirements and standards and that work is cost effective and delivered to agreed upon deadlines and specifications\nالتنسيق مع مهندسي شركة التجارية الذين يعملون مع المقاولين ومكاتب الخدمات المهنية لضمان فهم الموردين و المقاولين لاحتياجات ومتطلبات ومعايير مشروع التجارية، وأن يكون العمل فعالا من حيث التكلفة ويتم تسليمه وفقا للمواعيد النهائية والمواصفات المتفق عليها\nReview consultant tender evaluation report and prepare final evaluation report for management approval.\nمراجعة تقرير تقييم مناقصة الاستشاري وإعداد تقرير التقييم النهائي للموافقة الإدارية.\nMake sure that building regulations, standards and by-laws are enforced in building operations for Al-Tijaria projects\nالتأكد من تطبيق لوائح البناء والمعايير واللوائح الداخلية في عمليات البناء لمشاريع التجارية\nCoordinate with other departments regarding an information for the projects.\nالتنسيق مع الإدارات الأخرى بخصوص المعلومات الخاصة بالمشاريع\nAssist in creating the licenses and project official documents.\nالمساعدة في إنشاء التراخيص والوثائق الرسمية للمشروع.\nConduct weekly meeting for follow up with project department\nعقد اجتماع أسبوعي للمتابعة مع إدارة المشروع\nFollow up with an government officer to resolve any issues\nالمتابعة مع المسؤول الحكومي لحل أية مشاكلDisclaimer:Other duties deemed necessary and assigned, might be part of the job.تنويه: قد تكون الواجبات الأخرى التي تعتبر ضرورية وموكلة جزءا من الوظيفةPerformance Indicatorsمؤشرات الأداءTimely completion of projectsإنجاز المشاريع في الوقت المناسب% Deviation from Project Budgetالنسبة المئوية للانحراف عن ميزانية المشروعNumber of deviations from specificationsعدد الانحرافات عن المواصفاتAccurate and timely project schedulingالجدول الزمني للمشروع بدقة وفي الوقت المناسبEffective working relationship with offices/contractors suppliers• علاقة عمل فعالة مع المكاتب/موردي المقاولين Suppliers understand and deliver to Al-Tijaria standards and needsالموردين يفهمون ويعملون حسب المعايير واحتياجات الشركة التجارية Projects are according to specifications and permitsالمشاريع وفقا للمواصفات والتصاريحTimely procurement and disbursement of informationالحصول على المعلومات وتوزيعها في الوقت المطلوبAll official documents and licenses are available on time.جميع الوثائق الرسمية والتراخيص متوفرة في الوقت المحدد.Skills",
    "Skills": [
        "Ability for Supporting with multi tasks",
        "القدرة على دعم المهام المتعددة"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}