{
    "Job ID": "4729782",
    "Description": "Job DescriptionResponsible for answering incoming calls from customers to take orders, answer inquiries and questions, and handle complaints. Troubleshoot problems and provide information.Major Duties and ResponsibilitiesEnsures through his/her actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the NMC Hospitals and Clinics.Meet/assist all incoming calls, answer them, connect and take down messages when necessary. Answering calls with a polite telephone manners.Prompt response to telephone inquiries.Enter Physicians ROTA into the system after approval of Dept. Head & monitor by CMS their availability in clinics. Fixing appointment in the available slots.Opening temporary files for patient and informing the patient about his/her temporary medical record number.Opening files for new patients and recording the pertained data of the patient.Checking the financial coverage of the patient and required documents.Contacts patients those are in waiting list and book them with physicians and new schedules become available, contacts and books new appointment for patient whose original appointments have been canceled. Calls patients who missed their when there is a need for them to be seen by their physicians.Calls patients to remind them of their appointment two (1) days ahead of time.Work is conducted in a professional manner maintains patients confidentiality.Follows all departments’ policies and procedures.Participates in on-going education program developed by the department, e.g. department policy and procedures, Fire safety, Risk management, Environmental control.Manage and resolve costumer complaints.Provide costumer with product and services information.Update existing costumer’s information.Complete call logs.Work flexibly as part of a team to provide an effective and efficient Appointment Service.Ensure the procedures for security, safety and confidentiality are complied with all times.Attend annual mandatory training including infection control, health and safety training, Departmental training & etc.Ensure a systemic filing of all records is being organized for easy access by all concerned staffResponsible to read, understand and familiarize himself / herself with, and comply with hospital and departmental rules, policies and proceduresPerform additional tasks as assigned by his/her superior.Monitor Physicians vacations/leaves to be reflected on schedule after approval of Dept. Head & Director of Medical Services.Reporting toSupervisor Call centerSupervisesNoneSkills",
    "Skills": [
        "Qualifications:",
        "A minimum of:",
        "Education:",
        "Diploma/ College graduate in general administration or any related field.",
        "Experience:",
        "Minimum of two (2) years’ experience in a similar position preferably in healthcare facility.",
        "Customer service course/experience is preferred",
        "Skills",
        "Tact, courtesy and public relations skills are a must.",
        "Good communication & interpersonal skills.",
        "Fluency in verbal and written English & Arabic is required.",
        "Good communication skills, telephone answering techniques etiquette.",
        "Computer literate."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}