{
    "Job ID": "4729551",
    "Description": "Reporting to Project Director, has shared responsibility and accountability for both company CAPEX expenditures and operational plant upgrades & improvements.• Responsible for the successful delivery of all procurement activities and processes related to company CAPEX and plant upgrade expenditures initiated by company management.• Responsible for preparation of request for proposals related to supply and/or installation of mechanical, electrical, instrumentation and control equipment.• Responsible for procurement bidding process including suppliers & vendors proposals’ technical and commercial in addition to supporting their negotiations as application and appropriate.• Provide support to and coordinate with company project management for all procurement issues.• Ensures all procurement processes & activities are carried out in accordance with the Company policies, procedures, and core values including Code of Ethics conducts.• Ensure positive contributing to company value creation and commercial gain related to procurement processes.• Ensure that all procurement technical and commercial processes are documented and auditable.• Ensure and monitor the delivery of the procured items and equipment within the agreed upon time frame, including coordinating the same with the company management and ensure corrective actions are taken where and when required.• Responsible for preparation of progress reporting, schedule updates, and invoice verifications related to procurement activities.• Responsible for preparation and maintaining proffered suppliers/vendors list in coordination with the company and plant management.• Maintain good and professional business conduct relationship with suppliers and vendors.Skills",
    "Skills": [
        "Strong communication skills.",
        "• Good motivational skills.",
        "• Strong technical knowledge.",
        "• Excellent oral and written English communication skills.",
        "• Excellent understanding of Project Management principles and techniques.",
        "• Fully conversant with manual and computerized business control applications and processes."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}