{
    "Job ID": "4729920",
    "Description": "IC agent must know how to handle & communicate with all types of customers at the same level.\nIC agent must cope with stressed, angry, and confused customers or callers, must know how to deal with tasks like call backs, disconnects, call transfers, messages and holds.\nIC agent must use & follow the corresponding etiquette on the telephone to satisfy and please customers.\nCapability & ability to deliver knowledge on both products and services which will help to serve the customer and process customer’s calls.\nIC agent must use specific skills related to questioning and listening to maintain an effective communication on the phone.\nMaintain correct customer’s information (data entry).\nProcess inbound calls: being able to classify the incoming calls and select proper process as per the following:o Maintenance Calls: create service orders or check the order status.o Complaint call: create customer complaint using CRM.o Enquiry call: provide information to the customer about our products and create lead using proper lead type.·      Conduct outbound calls to promote Eng. group products.Attending and managing formal calls and provide accurate and concise information without any delay.\nIdentify customers’ needs, clarify information, research every issue and provide solutions and/or alternatives.\nProvide information to the customer about our products and create lead using proper lead type.\nDevelop long-term contacts through qualitative telephonic discussions and conversations.\nBack up all the call history details by effectively utilizing the company's call center database.\nOffer optimum call support service by initiating conversations in a respectful and welcoming tone.Skills",
    "Skills": [
        "Verbal Communication, Phone Skills, Listening, Data Entry Skills, People Skills, Informing, Customer Focus, Customer Service, Attention to Detail, Professionalism, Multi-tasking\nExpertise in working as a call center professional in a professional agency or BPO.\nGood command of verbal communication skills to intrigue the listener and provide accurate information.\nA passionate individual with the potential to handle multiple activities while attending a call simultaneously.\nStrong command of handling relevant computer operation activities to boost overall work productivity.\nSmart communicator with the potential to elaborate practical advantages of the company's products.\nExhibiting the eagerness to innovate and enhance the existing work output by working on constructive feedback."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Installation & Technical Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}