{
    "Job ID": "4729898",
    "Description": "We are looking for a sales representative to carry out sales in the market. You will be responsible for acquiring and maintaining key long-term clients by understanding their requirements.Responsibilities:- Developing trusting relationships with a range of key clients to ensure they do not turn into competition.- Gain a comprehensive understanding of key customer needs and requirements.- Expanding relationships with existing clients by constantly proposing solutions that meet their goals.Skills",
    "Skills": [
        "Qualifications:",
        "- Direct sales experience of at least two years.",
        "- Experience in sales and providing solutions based on customer needs.",
        "- Strong communication and interpersonal skills with proficiency in building relationships with professionals of all organizational levels.",
        "- Excellent organizational skills.",
        "- Ability to solve problems and negotiate.",
        "Knowledge of modern techniques and their implementation to boost sales activities.\nAdept at communicating with the in-house team, clients, and management through formal documentation and discussions.\nPerformance-driven and capable of achieving targets under pressure.\nApt in dealing with clients and engagingly presenting product data for potential leads.\nStrong negotiation skills.\nTelecom Giant, Selling Skills, Retail Products Knowledge, Branch Support, Lead in, Retail Sales, Sales Abilities"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Manufacturing; Retail & Wholesale; Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}