{
    "Job ID": "4729785",
    "Description": "Job DescriptionClinical documentation specialists assess medical records and documents for compliance with national-international regulations. Their duties include analyzing medical information to assist healthcare providers, ensuring the accuracy of clinical documentation, and training staff on medical record procedures.Clinical Documentation Specialist Responsibilities:Verifying the accuracy of patient medical information and obtaining missing information.Monitoring diagnoses, treatments, and follow-up entries in medical records.Interpreting and preparing clinical reports for healthcare professionals.Meeting with healthcare stakeholders to explain findings and facilitate actions.Training medical and administrative staff in standard medical procedures.Skills",
    "Skills": [
        ".Skills",
        "Clinical Documentation SpecialistRequirements:",
        "Bachelor’s degree in Health Information Technology.",
        "Registered Health Information Technician (RHIT) preferred.",
        "Registered Nurse (RN) will be advantageous.",
        "Proficiency in Electronic Medical Record (EMR) software.",
        "A minimum of three years’ experience in a similar role.",
        "Advanced knowledge of best practices in medical record.",
        "In-depth knowledge of medical terminology, coding, and procedures.",
        "Extensive experience in collecting and interpreting medical information, as well as training staff.",
        "Ability to keep informed of advancements and regulations in clinical documentation.",
        "Excellent organizational and communication skills",
        "Applying knowledge of medical terminology and procedures to evaluate clinical documents."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}