{
    "Job ID": "4729950",
    "Description": "- Design, develop, and implement complex systems according to project requirements and specifications.- Perform comprehensive system analysis to identify and resolve technical issues and ensure seamless system functionality.- Engage in collaborative efforts with cross-functional teams to determine system requirements and establish project milestones.- Establish and update system documentation, comprising system specifications, user manuals, and technical reports.-Design, construct, and maintain fire fighting and fire alarm systems in compliance with NFPA standards and the Saudi code for fire systems.Oversee and execute fire fighting and fire alarm system projects, ensuring timely completion and adherence to standards.Participate in tendering processes by preparing technical proposals and reviewing bid documents.Review fire protection system designs and provide recommendations for improvement.Coordinate with main contractors, consultants, and clients throughout the project lifecycle.Adhere to industry best practices and stay updated on the latest fire safety regulations.Assist in the recruitment of technicians and provide training to staff.Conduct inspections, audits, and ensure compliance with safety regulations.Maintain accurate project documentation and prepare reports.Continuously identify opportunities for process improvement and cost savings.Skills",
    "Skills": [
        "- Familiarity with hardware, software, and network components.",
        "- Hands-on experience with system modeling and simulation tools.",
        "- Practical exposure to system modeling and simulation tools.",
        "- Proficient in utilizing system modeling and simulation tools.Bachelor's degree in Fire Engineering, Mechanical Engineering, or a related field.3 to 5 years of experience in fire fighting and fire alarm systems design and construction.Solid understanding of NFPA standards and the Saudi code for fire systems.",
        "Familiarity with fire protection system design software and AutoCAD.",
        "Strong analytical and problem-solving skills.",
        "Excellent communication and interpersonal skills.",
        "Ability to work collaboratively in a team environment.",
        "NFPA certification is preferred.",
        "CFPS certification.",
        "If you meet the above criteria and are passionate about ensuring fire safety in buildings and facilities, we invite you to apply for the position of Fire Engineer.",
        "Join our team and contribute to creating safer environments for our communities."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 20",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}