{
    "Job ID": "4729600",
    "Description": "Our Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary: The Senior Accountant will collaborate with cross-functional teams to ensure that all company activities and transactions are recorded and accounted for properly.Main Job Responsibilities:Accounting Operations & Bookkeeping:On a recurring monthly basis, collect information relating to all Company transactions and activities from various internal and external sources and process transactions in internal accounting systems.\nPerform critical accounting close activities on a monthly, quarterly, and annual basis.\nAssist in the preparation of financial statements, including Income Statement, Balance Sheet, and Cash Flow Statement.\nPerform variance analysis and identify trends, risks, and opportunities in financial performance.\nOversee the general ledger and ensure accurate and timely recording of financial transactions.\nMaintain and reconcile balance sheet accounts, investigate and resolve any discrepancies.Project Accounting & Accounts Receivable:Understand all contracts with customers & vendors, working closely with sales & delivery teams.\nAct as primary liaison with project & delivery teams to understand project activities past & present, to ensure that company financial records & forecasts incorporate accurate information about ongoing projects.\nMonitor project profit & loss, obtain commentary from delivery teams.\nObtain and validate project data needed for billing, and ensure that invoices are produced accurately.\nLead the accounts receivable process, including invoicing, collections, and revenue recognition. Monitor and analyze customer accounts, ensuring timely payment and resolution of outstanding balances.Payroll Management:Execute payroll process, ensuring accurate and timely payment to employees in compliance with applicable laws and regulations.\nCollaborate with HR to maintain employee records, update payroll information, and manage payroll-related deductions and benefits.\nPrepare payroll reports, including tax withholding, deductions, and contributions, and ensure payroll compliance with local tax authorities.Process Improvement and Systems Enhancement:Identify opportunities to streamline and automate accounting processes, enhancing efficiency and accuracy.\nCollaborate with cross-functional teams to implement process improvements and system enhancements.\nProvide training and support to team members on accounting processes and systems.Skills",
    "Skills": [
        "We are seeking a highly motivated and detail-oriented Senior Accountant to join our growing Finance team. The Senior Accountant will play a critical role in creating financial transparency for internal and external stakeholders by ensuring accurate financial reporting.",
        "The ideal candidate is solution-oriented, possesses a collaborative mindset, and has great English communication skills. Additionally, the ideal candidate has a strong understanding of accounting principles, attention to detail, and the ability to work independently.",
        "Needed Competencies:",
        "Ability to thrive in a dynamic, fast-paced, multi-cultural environment\nComfortable obtaining, understanding and interpreting data from various sources\nAbility to work successfully with various stakeholders across multiple departments\nHigh level of integrity, ethics, and commitment to accuracy in financial reporting.\nMotivated and pursue constant improvement\nTeam player",
        "Education:",
        "Bachelor's degree in Accounting, Finance, or a related field. CPA certification is highly preferred.",
        "Experience:",
        "At least 2 years of experience.",
        "Knowledge, Skills and Abilities:",
        "Enterprise minded\nSolution-oriented\nExcellent analytical and problem-solving skills\nStrong English communication and interpersonal skills\nAnalytical Thinking\nUnderstanding of accounting principles, preferably US GAAP\nComfort with reading and understanding contract payment terms\nProficiency in accounting software and ERP systems\nExcellent proficiency with Microsoft Excel / Google Sheets\nExcellent written and communication skills in English",
        "Preferences:",
        "Certified Public Accountant (CPA)\nCertified Management Accountant (CMA)\nChartered Financial Analyst (CFA)\nFinancial Risk Manager (FRM)\nCertified Treasury Professional (CTP)",
        "Travel:",
        "None",
        "Work Schedule:",
        "Avertra local office schedule + frequent US hours."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}