{
    "Job ID": "4729788",
    "Description": "Job SummaryThe HR officer will be responsible for providing a full range of HR services to a designated group of employees in accordance with relevant policies and procedures.Maior Duties and ResponsibilitiesEnsures through his actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the NMC hospitals and clinics.\nEnsures the full range of personnel operations services and actions are carried out in an efficient and timely manner.\nUpdate and manage employee master data in system. Ensure the Transfers, promotions and employee contract changes are done as per CARE policy.\nManage attendance and leave data of employees.\nProcess annual vacation arrangements like vacation salary, Travel Ticket etc.\nEnsure validity of employee resident permits and passports.\nPrepare various letters and certificate related to employees.\nPrepare various HR reports like Head count, turnover, Localization, New hire etc.\nEnsure employee safety welfare, wellness and health.\nAnswering employee questions and addressing employee concerns with company.\nHandling of disciplinary investigations, hearings, appeals and grievances.\nOngoing review and enhancement of Company HR Policies and Procedures.\nEnsure the confidentiality of all HR matters across CARE\nPrepares recruitment request forms, ensuring accurate coordination of recruitment criteria and salary/benefit information.\nLiaises with recruitment section regarding recruitment of staff, new hires, and transfer of sponsorship requirements.\nMeets and greets new employee, processes paperwork related to contracted employees and rotating physicians from other hospitals.\nCreates and maintains comprehensive and accurate files for each employee as per Labor Law, JCIA/CBAHI and company requirements.\nEnsures that access to such files is limited to authorized personnel.\nPage 1 of 3\nReceives and responds to inquiries relating to personnel operations services issues as directed by the Head of Personnel Operations.\nMaintains establishment control records for each department, ensuring that staffing levels remain within the approved limits.\nPerforms typing, clerical tasks and other related activities.\nMeets current objectives and positions the organization for future growth. Completes daily tasks and assignments and processes large volumes of work associated with the operation of the department.\nMeets and exceeds expectations of internal and external customers. All organizational and departmental standards regarding quality of performance are met. Demonstrates a strong commitment to confidentiality. Participates in quality improvement programs as directed.\nFollows all facility guidelines outlining standards of attendance and punctuality.\nResponsible for reporting to and completing work at assigned times.\nPerform additional tasks and duties as assigned by Superiors\nReporting to\nBusiness Unit — HR Manager\nSupervises\nNoneSkills",
    "Skills": [
        "Qualifications:",
        "A minimum of:\nUniversity degree in Business / Public Administration.\nWorked for at least three (3) years in Human Resources field in a service industry.\nExcellent interpersonal communication skills, fluent in both verbal and written English.\nGood knowledge of Microsoft Excel and Word as well as computerized accounting applications.",
        "Skills",
        "Good recruitment experience in a medical environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}