{
    "Job ID": "4729781",
    "Description": "Job Description:The HR officer will be responsible for providing a full range of HR services to a designated group of employees in accordance with relevant policies and procedures.Major Duties and Responsibilities• Ensures the full range of HR operations and actions are carried out in an efficient and timely manner.• Preparing job descriptions, advertising vacant positions, and managing the employment process.• Responsible for coordinating all recruitment activities of the NMC & assigned Business Unit; liaising with relevant Department Heads and local recruiting agents.• Participate in new employee orientation and onboarding process. Orientating new employees and training existing employees.• Creates and maintains comprehensive and accurate files for each employee as perLabor Law, JCIA/CBAHI and company requirements.• Ensures that access to such files is limited to authorized personnel.• Update and manage employee master data in system. Ensure the Transfers, promotions and employee contract changes are done as per CARE policy.• Manage attendance and leave data of employees.• Process annual vacation arrangements like vacation salary, Travel Ticket etc.• Ensure validity of employee resident permits and passports.• Oversee all activities related to Payroll, assists in al aspects of employeecompensation, preparation, planning, and analysis and monitoring.• Responsible for preparing monthly salaries of al types of employees, including overtime payments, leave settlements; insurance dues for Saudi staff, salary deductions, end of service benefits and GOSI required cheques and other payroll related transaction.• Responsible for calculating and processing the part time employee's payments by reviewing the outcomes value as per contract.• Monitoring employee performance.• Prepare various letters and certificate related to employees.Prepare various HR reports like Head count, turnover, Localization, New hire etc.• Ensure employee safety welfare, wellness and health.• Answering employee questions and addressing employee concerns with company.• Handling of disciplinary investigations, hearings, appeals and grievances. •Ongoing review and enhancement of Company HR Policies and Procedures.• Ensure the confidentiality of al HR matters across CARE.• Receives and responds to inquiries relating to HR operations issues as directed bythe Head of department.• Meets current objectives and positions the organization for future growth. Completesdaily tasks and assignments and processes large volumes of work associated with the operation of the department.• Meets and exceeds expectations of internal and external customers. All organizational and departmental standards regarding quality of performance are met. Demonstrates a strong commitment to confidentiality. Participates in quality improvement programs as directed.• Perform additional tasks and duties as assigned by Superiors.Reporting to • HODSupervises• NoneSkills",
    "Skills": [
        "Qualifications: A minimum of:",
        "Education:",
        "• University degree in Business / General Administration.",
        "• Bachelor degree in HR Management is preferred.",
        "• CIPD/SHRM certification is preferred",
        "Follows all facility guidelines outlining standards of attendance and punctuality",
        "Responsible for reporting to and completing work at assigned times.",
        "Experience:",
        "• Worked for at least two (2) years in Human Resources field in a service industry",
        "preferable in healthcare industry. Skills:",
        "• Excellent interpersonal communication skills, fluent in both verbal and written English.",
        "• Good knowledge of Microsoft office as well as other required HRIS computerized applications.",
        "• Familiar with multinational environment work.",
        "• Knowledge of Saudi Labor Law.",
        "Skills",
        "English\nExcel\nPowerPoint\nReport skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}