{
    "Job ID": "4729138",
    "Description": "Prepare and maintain accurate financial records, including financial statements, general ledger, and trial balance.\nProcess and reconcile various financial transactions, such as invoices, receipts, payments, and bank statements.\nPrepare and submit VAT returns, ensuring compliance with relevant tax laws and regulations.\nPerform bank and cash reconciliation and monitor cash flow to ensure adequate funding is available.\nMonitor accounts payable and accounts receivable to ensure timely payments and collections.\nPrepare and analyze monthly, quarterly, and annual financial reports, highlighting variances and trends.\nConduct periodic financial audits to ensure accuracy and identify potential discrepancies.\nAssist with budgeting and forecasting activities, providing input and recommendations as necessary.\nLiaise with auditors, tax authorities, and other stakeholders to ensure compliance with statutory requirements.\nStay updated with changes in accounting standards, tax laws, and regulations to ensure compliance.\nSales order update, vendor payment review & control, and receipts controls (e.g., Posting of Receipts, Issuance of Customer Statements & Debt Chasing)\nProvide support to senior management in decision-making processes by analyzing financial data and providing insights.\nSupport the administrative functions of the company including managing office supplies, coordinating travel arrangements, organizing meetings, and handling correspondence as needed.Skills",
    "Skills": [
        "Bachelor's degree in Accounting, Finance, or a related field.\nProven experience working as an Accountant in Dubai, with a background in administration.\nQualification of CA/CPA and experience in furniture/consumer goods industry are plus.\nExcellent knowledge of accounting principles, practices, and procedures.\nProficient in using accounting software such as QuickBooks, SAP, or Oracle.\nAdvanced skills in Microsoft Excel and other MS Office applications.\nStrong organizational and time management abilities, with exceptional attention to detail.\nExcellent communication and interpersonal skills, with the ability to work effectively in a team environment.\nKnowledge of UAE tax laws and regulations, including VAT.\nExperience in conducting financial audits is preferred.\nAbility to prioritize and multitask in a fast-paced environment.\nWilling to travel for any external duties"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading; Home & Office Furniture; Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}