{
    "Job ID": "4729395",
    "Description": "MarketingThe post-holder should develop the yearly marketing strategy\nManage the production of marketing materials such as brochures, application packs, prospectus etc. along with collaterals. This Includes proof reading and liaising with designers and printing shops.\nThe post-holder should effectively manage multiple projects at a time, prioritizing where necessary and providing updates where relevant\nTo monitor marketing activities and news that are executed at other companies, to make sure we are ahead of them.\nTo plan and execute advertisement campaigns with local and regional media agencies.\nTo update the marketing calendar according to our monthly activities and events\nTo monitor the content on the webpages.\nPrepare content and layout of the monthly email campaigns according to the communication plan.\nContinuously update the marketing expenses and marketing budget\nEnsure efficient communication of marketing activities to the management\nStudying the market demands\nFollowing up with tasks to the marketing team members\nDevelop and implement strategies for Sales & marketing aligned with the Prime business objectives.\nImplement catering marketing plans to achieve revenue goals.\nDevelop promotional events to market catering operations to individuals and organizations\nDevelop positive working relationship with existing customers for repeat business.\nWorking effectively on social media platforms in developing brand awareness and ensuring it will reach the targeted customers. SalesExplore new business opportunities with potential customers\nPerform catering price negotiation with customers based on the established company guidelines.\nEnsure quality services and operations by building trustful and positive relationships with customers and co-workers.\nMaintain accurate and complete sales operational and transaction records.\nAddressing customer grievances accurately and timely\nPrioritize sales tasks based on revenue goals and deadlines.\nDevelop strong customer relationships to widen customer base and marketing opportunities.\nMaintain a database of prospective and current customers.\nAlways taking feedback by Interact with customers about the products and services rendered and ensuring complete compliance towards companies standards.\nSupervise staff members during all aspects of catered events to ensure high quality service, while clearly communicating pertinent information to staff of all event needs and requirements\nMaintain a skilled staff by properly coaching, counseling and redirecting employees in their duties\nInspect supplies, packing sheets, equipment, and work areas to insure efficient service and conformance to CUISINE standards\n Oversee and ensure proper Personal Protective Equipment (PPE) use by all staff members. Will conduct a wellness check for all catering team members in compliance with the Safety Plan Skills",
    "Skills": [
        "Skills",
        "Critical thinking and Decision making\nTeam work\nLeadership Qualification\nBachelor’s degree Experience\n5-6 years of relevant experience"
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}