{
    "Job ID": "4729813",
    "Description": "Handling and resolving customers’ complaints and inquiries in a timely and accurate manner.\nHandling incoming phone calls and attending to customers’ requests accordingly.\nHandle & communicate with all types of customers at the same level.\nProvide customer service support.\nMaintain customer details and files.\nMaintaining a good relationship with customers.\nIdentify and assess customers’ needs to achieve satisfaction.\nProvide accurate, valid, and complete information by using the right methods/tools.\nHandle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution.\nCompile in-depth data of each customer in a segregated database containing detailed info about each interaction.\nCollaborate with the technical team to solve ongoing issues with a product or service.Skills",
    "Skills": [
        "Creativity: Being able to think of new systems and new ways to work. Being able to think creatively and ask the right questions.\nGood training skills.\nProblem-Solving Skills: Ability to develop new solutions to problems. Having the skills to identify the source of the problem, create, and test solutions.\nCommunication Skills: Being able to communicate plans, thoughts, and rationale in the job.\nGood communication skills will greatly help in accomplishing the job.\nProven customer support experience.\nKnowledge of online tools and platforms that enhance customer experience by leveraging appropriate features.\nAdept in addressing client questions through effective telephonic conversation.\nExcellent communication and presentation skills.\nAbility to multi-task, prioritize, and manage time effectively.\nFluent in operating the latest computer software and online tools."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Kuwait",
        "Degree": "High school or equivalent",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Installation & Technical Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}