{
    "Job ID": "4729407",
    "Description": "Job Description: Esol EducationFairgreen International SchoolAV Specialist Technician Please note that this job description is intended to be an accurate reflection of the job requirements. Management reserves the right to modify, add or remove duties and to assign duties on a day to day basis as necessary.  Role Description The role is to ensure the stable operation of school AV technology. To set up, operate, maintain, and repair equipment used to enhance live events, such as microphones, video recorders, projectors, lighting, and sound mixing equipment. Set up A/V equipment for meetings and various functions around the school. Troubleshooting A/V equipment when there are technical questions or problems related to A/V equipment and identifying appropriate solutions. To assist with rigging and plotting of lighting and sound and set design and construction for large productions as required. Serve as on-sight A/V support for events that take place in the school. They will be the first line of school AV support responsible for problem resolution. Perform preventative maintenance on audiovisual equipment. Schedule and documents bi-monthly routine maintenance on all assigned AV systems. A person who is eager to learn and come up with new and innovative approaches to problem-solving with technology.  equipment. Must be willing to work after-school operational hours and weekends as needed.AV Technician ResponsibilitiesCohesive Team Worker with strong problem-solving, troubleshooting, & communication skills.\nSet up A/V equipment for meetings and various functions around the school.\nConducting sound, visual, and performance quality checks on AV equipment.\nTroubleshoot technical issues, pinpoint faults, and offer remedies during events.\nPerforming inventory management on equipment, wiring, and accessories.\nCarrying out any cleaning, maintenance, or repairs on audiovisual equipment.\nLaying electrical and sound cables.\nInspecting mountings and electrical equipment to ensure they conform to health and safety regulations.\nStrong customer service orientation and maintaining positive relationships with end users.\nLiaise and build a network of AV equipment vendors as needed for preventive maintenance and planning for future requirements\nProvide on-call support after hours and on weekends as necessary.\nAssist to identify, plan and procure AV assets and consumables.\nDisassembling audio and visual equipment and packing up after the event.\nTransporting, setting up, and installing media equipment and audiovisual support tools, including speakers, monitors, cameras, and equipment racks.August 2023Skills",
    "Skills": [
        "AV Technician Role Requirements",
        "An associate or bachelor’s degree in audio visual technology or a related field.\nPrevious experience working as an AV technician (minimum 3 years).\nAdvanced knowledge of modern filming and sound mixing techniques.\nExperience with Audio/Visual Equipment for supporting events in Multi-Purpose Hall (QSC, Digital Mixer, Extron 4K Matrix Switcher, Stage Speakers (Bose), Wireless and Wired Mics (Shure), Stage Lighting Control (Zero 88).\nIn-depth working knowledge of audio and visual techniques.\nStrong working knowledge of audiovisual editing equipment and software.\nStrong communication, customer service, and organizational skills.\nThe ability to sit or stand for long periods of time.\nExperience with Audio/Visual Equipment for supporting events in Multi-Purpose Hall (QSC, Digital Mixer, Extron 4K Matrix Switcher, Stage Speakers (Bose), Wireless and Wired Mics (Shure), Stage Lighting Control (Zero 88). ",
        "August 2023"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Dubai, United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}