{
    "Job ID": "4729820",
    "Description": "Electrical Technician (PLC & SCADA) Jeddah , Saudi Arabia As an Electrical Technician (PLC & SCADA) in Jeddah, you will be responsible for installing, maintaining, and repairing electrical equipment and systems, with a focus on Programmable Logic Controllers (PLC) and Supervisory Control and Data Acquisition (SCADA) systems. You will work closely with engineers and other technicians to ensure that electrical systems are operating efficiently and effectively.Responsibilities:Install, maintain, and repair electrical equipment and systems, with a focus on PLC and SCADA systems\nPerform regular inspections and preventive maintenance on electrical systems to ensure optimal performance and minimize downtime\nTroubleshoot and diagnose electrical problems, using specialized tools and equipment\nRepair or replace faulty components and parts, such as relays, sensors, and circuit boards\nCalibrate and program PLC and SCADA systems to meet specific requirements and ensure accurate data collection and control\nCollaborate with engineers and other technicians to design and implement electrical systems for new projects\nEnsure compliance with safety regulations and electrical codes\nMaintain accurate records of maintenance and repair work performed\nProvide technical support and training to other team members and end-users\nCheck, inspects all the electrical parts/equipment in the whole plant. Reports all abnormalities observed, notification generation against abnormalities.\nVerify electrical system compatibility and safety by testing circuits in wiring, equipment, and fixtures with ohmmeters, voltmeters, and oscilloscopes.\nUse testing devices such as ohmmeters, voltmeters, and oscilloscopes to test the continuity of circuits in electrical wiring, equipment, and fixtures, ensuring system safety and compatibility.\nVerify compliance with codes, identify hazards and defects, and determine the need for adjustments or repairs during inspection of electrical systems, equipment, and components.Skills",
    "Skills": [
        "Skills",
        "Strong knowledge of PLC and SCADA systems\nProficiency in programming and configuring PLC and SCADA systems\nExperience with troubleshooting and repairing electrical equipment and systems\nAbility to read and interpret electrical schematics and technical drawings\nKnowledge of safety procedures and regulations related to electrical work\nPLC & SCADA\nControl system\nVFD & VSD\nWell thought Troubelshooting Skills\nLeading project and team",
        "Preferred Candidate:",
        "Diploma or Bachelor's degree in Electrical Engineering or a related field\n3-5 years of experience as an Electrical Technician, with a focus on PLC and SCADA systems\nStrong knowledge of electrical principles, codes, and standards\nExperience with troubleshooting and repairing electrical equipment and systems\nProficiency in programming and configuring PLC and SCADA systems\nAbility to read and interpret electrical schematics and technical drawings\nExcellent problem-solving skills and attention to detail\nEffective communication and teamwork abilities\nAbility to work independently and prioritize tasks\nKnowledge of safety procedures and regulations related to electrical work"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Manufacturing; Food & Beverage Production; FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}