{
    "Job ID": "4729835",
    "Description": "Job PurposeProduce detailed financial models and investment write-ups, conduct necessary industry and business research analysis complying with Al-Tijaria’s strategy and objectives.Disclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.إعداد نماذج مالية مفصلة والإكتتابات الاستثمارية ، وإجراء التحليلات اللازمة و البحث في قطاع الصناعة والأعمال بما يتوافق مع استراتيجية وأهداف الشركة التجارية العقارية.إخلاء المسؤولية: يجب على صاحب العمل الامتثال واتباع السياسات والإجراءات المعمول بها في التجاري.Key Accountabilities & Performance IndicatorsAccountabilitiesASSET MANAGEMENT Evaluate investment opportunities proposed either internally or externally\nGather information and data from different public and private sources, by conducting relevant market surveys or third party sources.\nAnalyze and evaluate gathered information\nPrepare report on market research findings and analysis\nPrepare full due diligence covering at macro, micro and operational levels for proposed investment opportunity prepare final recommendation.\nInvestment Portfolio Management \nGather information and data from different sources on Al Tijaria / Subsidiaries’ owned securities.\nEvaluating Al Tijaria investments.\nCalculate actual and expected returns, overall portfolio returns and risks supported by variance analysis on the portfolio, prepare report on findings and analysis for Board review.\nAnalyze feedback of the Board on the strategic direction of Al Tijaria.\nPrepare list of requisites for clarification on performance concerns for discussion with board representatives prior to and after board meetings.\nGather information on underperforming investments not befitting Al Tijaria’s long term strategy.\nAnalyze and evaluate exit strategies suggested by the management.\nFollow up and update comprehensive report on regular basis.\nAnalyze feedback of the Board on the strategic direction of Al Tijaria.\nPrepare list of requisites for clarification on performance concerns for discussion with board representatives prior to and after board meetings.\nGather information on underperforming investments not befitting Al Tijaria’s long term strategy.\nAnalyze and evaluate exit strategies suggested by the management.\nFollow up and update comprehensive report on regular basis.إدارة الأصولتقييم الفرص الاستثمارية المقترحة داخلياً أو خارجياً.أ. جمع المعلومات والبيانات من مختلف المصادر العامة والخاصة ، من خلال إجراء استطلاعات السوق ذات الصلة أو مصادر الطرف الثالث.ب. تحليل وتقييم المعلومات التي تم تجميعها.ج. إعداد تقرير عن نتائج أبحاث السوق والتحليل.د. إعداد العناية الواجبة الكاملة التي تغطي المستويات الكلية والجزئية والتشغيلية للفرصة الاستثمارية المقترحة و رفع التوصية النهائية.2. إدارة المحافظ الاستثماريةأ. جمع المعلومات والبيانات من مصادر مختلفة حول الأوراق المالية المملوكة للشركة التجارية العقارية / الشركات التابعة.ب. تقييم إستثمارات الشركة التجارية العقارية.ج. احتساب العوائد المحققة والمتوقعة ، وعوائد المحفظة الإجمالية والمخاطر الموزعة عن طريق تحليل التباين في المحفظة ، وإعداد تقرير عن النتائج والتحليل لمراجعة مجلس الإدارة.د. تحليل ملاحظات مجلس الإدارة على التوجه الاستراتيجي للشركة التجارية.ح. إعداد قائمة بالمتطلبات لتوضيح مخاوف الأداء لمناقشتها مع ممثلي مجلس الإدارة قبل وبعد اجتماعات مجلس الإدارة.هـ. جمع المعلومات عن الاستثمارات ضعيفة الأداء والتي لا تتناسب مع استراتيجية الشركة التجارية العقارية طويلة المدى.و.  تحليل وتقييم إستراتيجيات الخروج المقترحة من قبل الإدارة.ي. متابعة وتحديث التقارير الشاملة بشكل دوري.Performance IndicatorsThoroughness and accuracy of research\nConsistency of reports with agreed investment frame works and templates\nAccuracy in financial models and valuation methods.\nUse of financial /accounting practices.\nApplication of finance and valuation methodologies.\nAnalysis of financial statements and reports producedSkills",
    "Skills": [
        "دقة البحث ودقته.\nتناسق التقارير مع الأعمال والقوالب الاستثمارية المتفق عليها.\nالدقة في النماذج المالية وطرق التقييم.\nاستخدام الممارسات المالية / المحاسبية.\nتطبيق منهجيات التمويل والتقييم.\nتحليل البيانات المالية والتقارير المنتجة.\nAbility for Supporting with multi tasks\nالقدرة على دعم المهام المتعدد"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}