{
    "Job ID": "4729839",
    "Description": "2.Job Purpose الهدف من الوظيفة                                                                                           Managing the receiving of Direct Store Deliveries Disclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.إدارة المتجر من استلام وتسليم المباشريلتزم مساعد أمين مخزن بالسياسات والإجراءات المتبعة داخل الشركة التجارية ويقوم بتنفيذهاAccountabilitiesالمسؤولياتInspect consignments to verify if they are in order and as per agreed terms.\nفحص الشحنات للتحقق مما إذا كانت سليمة ووفقًا للشروط المتفق عليها.\nMaintaining a filing system in the purchase section and updating appropriate records when required.\nالاحتفاظ بنظام حفظ في قسم المشتريات وتحديث السجلات المناسبة عند الحاجة.\nControlling inventory stock levels\nالسيطرة على مستويات المخزون\nInspect contents to ensure they are undamaged\nفحص المحتويات للتأكد من أنها غير تالفة\nMaintain accurate records and assist in inventory control\nالاحتفاظ بسجلات دقيقة والمساعدة في مراقبة المخزون\nDelivers product to appropriate personnel – insures all pathways are kept clear. \nيسلم المنتج للأفراد المناسبين - يؤمن أن جميع المسارات نظيفة. \nPerforms other duties as assigned to meet business needs. \nيؤدي واجبات أخرى كما تم تعيينها لتلبية احتياجات العمل. Maintaining a register of funds, constantly checking the numbers, maintaining them, and informing them in case of any discrepancy.\nالإحتفاظ بسجل الأموال و التدقيق الدائم على الأعداد وصيانتها و الإفادة في حال اي اختلاف.\nAbility for supporting with multi tasksالقدرة على دعم المهام المتعددةDisclaimer:Other duties deemed necessary and assigned might be part of the job.ملاحظة : قد يتم إضافة بعض المهام الأخرى التى يتعين على شاغل الوظيفة الالتزام بها.Skills",
    "Skills": [
        "Education",
        "High School / Diploma",
        "شهادة الدراسة الثانوية",
        "Experience",
        "2-4 years’ experience in similar role",
        "2-4 سنوات خبرة في دور مماثل",
        "Functional Skills",
        "Knowledge of inventory management ",
        "معرفة إدارة المخزون",
        "Managerial Skills",
        "Not Applicable",
        "غير قابل للتطبيق",
        "General Skills",
        "Fluent in Arabic. Working knowledge of English desirable\nGood working knowledge of computer\nStrong data entry skills\nيجيد اللغة العربية ومعرفة العمل باللغة الإنجليزية \nمعرفة جيدة للعمل بالكمبيوتر\nمهارات قوية في إدخال البيانات"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}