{
    "Job ID": "4729924",
    "Description": "Roles and Responsibilities:Profit and Customer-base maximization ∙Drive accountability of net sales and day-to day business for e-commerce. Full understanding of sales situation through sales and customer behaviour analysis ∙Responsible for selling analysis  ∙Responsible for short and long-term actions to increase selling based on relevant analysis and do follow up on actions ∙Identify opportunities, threats and set priorities for the company based on biggest sales/customer impact ∙Drive total conversion based on customer need and behaviour to optimise daily profitable selling ∙Responsible for reduction strategy to optimise profitable short and long term selling and customer growth ∙Drives selling with logistical capacity as key focus area ∙Responsible to set OMNI and processes for collaborating with planning and assortment team in the best way ∙Follow up the final customer offer for the markets, apply learnings of coming actions Customer Centric  ∙Know and understand customer behavior and expectations to drive customer base growth ∙Set OMNI commercial plan based on the overall commercial plan for the company, together with relevant counterparts (e.g. Senior director of product strategy & planning) ∙Follow up and conclude the final customer offer, key learnings and commercial reviews for the region, apply learnings of coming actions to improve customer offer ∙Collaborate in decisions when it comes to customer demand vs pushing assortment, find the right balance between product and customer activation. ∙Secure product and assortment exposure in media channels in collaboration with marketing to optimize stock performance and customer experience. ∙Benchmarking from both product and commerciality aspects. Know the customer’s needs, competitor overview and analysis ∙Manage and building successful cooperation with e-commerce logistic and customer activation function Assortment and stock management  ∙Assortment management to achieve stock freshness with appropriate reductions cost and commercial planning ∙Plan, manage and follow up sales, stock and reduction levels in your region ∙Full accountability for buying levels for e-commerce per store ∙Full accountability of setting a growth driving buying strategy for e-commerce ∙Responsible for moves and allocation within the e-commerce and omni channel ∙Secure total commercial product/category/assortment range perspective in operations to optimize sales and stock performance.  ∙Balance assortment performance and product lifecycle with customer demand. ∙Set Sale strategy to adapt from for the sales market Budgets and Plans ∙Recommend the department’s budget and monitor financial performance versus the budget so that the business is aware of forecast cost and revenues; areas of underperformance are identified and opportunities to improve performance are capitalised upon. ∙Participate in the development and roll out of manpower planning and forecasting activity, ensuring that one’s department is sufficiently resourced and appropriately structured to deliver on its objectives. Systems and Processes∙Develop and oversee the implementation of department’s policies, procedures and controls covering all areas of the department’s activity so that all relevant procedural/ legislative requirements and standards are fulfilled to ensure that the company delivers a world-class service.   ∙Manage the cost-efficient usage of all applicable resources to reduce wastage and unnecessary expense. Change Management & Continuous Improvement∙Contribute to managing change in own team by providing inputs for and taking part in change initiatives, programmes and projects that reflect international best practice and changes in the competitive environment. Continuous Improvement ∙Promote and drive continuous improvement across one’s department as whole to achieve the Organization’s mission, vision, and strategy. People Management ∙Provide on-the-job training and constructive feedback to subordinates to support their overall development. ∙Manage the achievement of objectives by setting individual objectives, managing performance, developing staff and providing formal and informal feedback in order to maximise overall performance and engagement.Skills",
    "Skills": [
        "∙Considerable knowledge of the MENA electronic retail Market ",
        "∙Solid understanding of e-commerce frameworks ",
        "∙Experience building effective multi-channel marketing strategies, including affiliate ",
        "marketing, PPC, SEO, social media and other digital channels. ",
        "∙Solid expertise in campaign and channel analysis and reporting, including Google ",
        "Analytics experience. ",
        "∙Possess excellent analytical skills and leverage data, metric, analytics and ",
        "consumer behaviour trends to drive actionable insights & recommendation"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 9",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 48"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Consumer Electronics; Consumer Electronics",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$6,000 - $7,000",
        "Number of Vacancies": "1"
    }
}