{
    "Job ID": "4729837",
    "Description": "1. Role Objective:To develop, organize, and manage legal services Section, with the capability to provide advice and efficientservices with respect to litigation and legal opinion. The Head of Legal Section is the Primary and initialSource of legal Knowledge throughout QNCC.2. Detailed Roles and Responsibilities:STRATEGIC:· Prepare section’s annual budget and discuss it with the Chief Executive Officer (C.E.O) to obtainapproval.· Ensure that the QNCC’s legal plans are within agreed budgets and timescales· Lead the formulation and implementation of legal strategy, policies and procedures of the Section tosupport organizational business strategy.OPERATIONAL:· Supervises the provision of reliable and efficient legal services.· Provide advice on litigation, disputes and administration.· Plans the workload and assigns work and responsibilities to the section staff.· Submit periodic status reports to the Chief Executive Officer (C.E.O) on section performance.· Prepare and submit section budget to the Chief Executive Officer (C.E.O) for approval.· Develop staff capability either by directives or training without work interruption.· Report to Chief Executive Officer (C.E.O) on staff performance and participate in staff appraisal inliaison with Chief Executive Officer (C.E.O).· Approve staff leaves in manner that does not affect section performance.· Performs other related duties as needed upon request by the Chief Executive Officer (C.E.O).· Supervising and reviewing the preparation of all necessary applications and documents forobtaining registrations, renewals, licenses, approvals, and completing incorporationformalities, and other legal/administrative procedures for the company.· Liaising as necessary with external lawyers and supervising the handling of files· Resolving legal problems related to lands acquired by the company which relates to titleissues, trespass, nuisance, sale and purchase agreements etc.· Drafting, reviewing and managing general commercial contracts for the company.PEOPLE MANAGEMENT:¨ Allocate work to subordinates, nominate for training as per QNCC’s guidelines in accordance with theHuman Resources Policies and Procedures, conduct performance reviews and manage leave andovertime of staff to ensure efficiency.¨ Supervise direct subordinates in their day-to-day tasks and guide them in managing their performanceby providing appropriate feedback and counseling. Provide recommendations for hiring andpromotions.¨ Take decisive action to ensure speedy resolution of unresolved grievances or conflicts within theSection.¨ Approve regular vacation scheduling, business leave and emergency leave of security employees inaccordance with Finance and Administration Manager.ACCOUNTABILITIES:· Oversee and provide guidance on corporate governance, legal and compliance aspects and development of plans and policies.· Oversee and spearhead critical negotiations.· Verify that contracts are inherently risk-free.KEY INTERACTIONSInternal: External:· Chief Executive Officer (C.E.O) · External auditors· Departments/Sections Heads · Governmental bodies· QNCC’s Committees (as and when required) · Consultants· All other employees (as and when required) · Clients· Internal Audit · Suppliers· Compliance and Risk · Regulatory AuthoritiesSkills",
    "Skills": [
        "1. Educational Qualifications:",
        "· University degree in Law with specialization in Corporate Law, from a recognized university. Professional",
        "Certification is preferable. A Master’s degree in law is a plus.",
        "2. Experience:",
        "· About 8-10 years of related experience of which a minimum of 2-4 years should be in a similar position /",
        "responsibility, preferably in a similar Industry.",
        "3. Behavioral Competencies: 4. Technical Competencies:",
        "· Analytical Ability ·Compliance & Regulatory Requirements",
        "· Business Acumen ·Computer Literacy",
        "· Communication ·Crisis Management & Resolution",
        "· Creativity & Innovation ·External Sensitivity/Market Awareness",
        "· Customer Orientation ·Qatar Labor Laws & Regulations",
        "· Personal Motivation/ Productivity ·Investigation & Enforcement",
        "· Planning & Organizing ·Operations Controls",
        "· Process Excellence ·Legal, Financial, and Business Fundamentals",
        "· Teamwork ·Planning & Organizing",
        "· Time Management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 10",
        "Age": "Max: 50"
    },
    "Data": {
        "Job Location": "Dukhan, Qatar",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}