{
    "Job ID": "4729937",
    "Description": "KEY RESPONSIBILITIES:· Responsible for the maintenance of the company Quality Management System and ensuring that company license are upheld.· Assist the Head of Quality in hosting Regulatory inspections and Customer audits.· Ensure that corrective actions identified as a result of observations raised during regulatory & customer audits are implemented in a timely manner.· Ensure that all GMP related documentation is regularly reviewed and updated in accordance with Company policy.· Review and approve company standard operating procedures.· Ensure adherence to all relevant Standard Operating Procedures (SOP’s), with reference to pharmacopoeia’s, specifications, regulations and industry standards.· Provide monthly measurements on Key Performance Indicators (KPI’s) to reflect the performance of the Quality Assurance function.· Conduct performance reviews with QA personnel in accordance with the Company performance management system.· Identify training and on-going development opportunities for the QA personnel and training records maintained.· Ensure that the need for extra resources is identified and that adequate resources i.e. Equipment and appropriately trained personnel are available such that the department and ultimately the company can meet its contractual requirements and that product quality and conformance are assured· Assist in the selection and recruitment of personnel in conjunction with Human Resources.· Ensure that continuous improvement initiatives are identified and implemented in the department as appropriate.· Ensure suggestions for Quality Improvements, problem solving etc. made by members of the Quality Assurance department are discussed with the appropriate personnel and taken on board if feasible.· Initiate appropriate action such that non-conformities relating to the product, process and quality system are prevented.· Initiate, recommend and if possible provide solutions to problems through the designated channels. Verify the implementation of these solutions.· Control further processing, delivery or installation of non-conforming, product until the deficiency or unsatisfactory condition has been corrected.· Manage customer complaints and implement corrective action where appropriate.· Manage the introduction of new products within the quality management system.· Assist in new product development by recommending and /or establishing the necessary quality/quality control functions.· Review and monitor the validation of production processes and equipment qualifications in cooperation with Production and QC Lab Supervisor and Maintenance & Engineering Manager.· Conduct internal audits in areas for which the Quality Manager is not directly responsible.· Conduct external audits of suppliers and contract manufacturers in line with company audit schedule· Ensure that training records are maintained and a training plan prepared for each member of the Quality Assurance Department.· Interface with customers to ensure concerns / complaints are communicated and effective corrective and preventative actions are implemented in a timely manner· GMP training preparation and execution as required; Annual GMP Training (site and supplier) and Training in the QMS processes as required· Any other duties assigned by the Head of QualitySkills",
    "Skills": [
        "Competencies:",
        "· Organisational skills, personal efficiency, time management skills and the ability to prioritise competing demands.",
        "· Ability to lead a team and manage diverse personalities and viewpoints.",
        "· Ability to build relationships and collaborate with others.",
        "· Excellent communication skills, both verbal & written.",
        "· Ability to prioritise decision making differentiating between urgent and non-urgent.",
        "· Maintains the highest standards of ethical behaviour. Escalates issues appropriately.",
        "· Practical, action-orientated approach to managing priorities.",
        "· Takes a methodical, systematic and structured approach to organising work",
        "· Strong Technical and troubleshooting ability",
        "· Strong Report Writing and presentation skills",
        "The above is not intended to be construed as an exhaustive list of all responsibilities, duties and skills required and may be subject to change."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}