{
    "Job ID": "4729783",
    "Description": "Job Summary:Responsible to register patient admission. open files for new patients and collects the services fee as per their entitlements and under the clear directives of Insurance policy they have.Major Duties and ResponsibilitiesEnsures through his actions. either directly or indirectly. that a superior quality of medical treatment, compassion and understanding is given to every patient served at the Hospital and Clinies.Opening files for new patients and recording the pertained data of the patient. Checking the financial coverage ofthe patient and the required documents.Collecting payments from patients and sending them to the cashier on daily basis.Answering the inquiries of patients and visitors.Receives requests for physician time from patients, physicians. nurses and other clinic personnel.Schedules and manipulates professional time for patients with objective of optimizing utilization of time and schedules.Operates computer using Patient Care System for scheduling patients and checking their eligibility for treatment.Ensure to maintain patient confidentiality when required.Follows all departmental policies and procedures.Participates in ongoing education programs developed by the department. e.g. Department Policy and Procedures. Fire Safety. Risk Management. Environmental control.Performs other clerical duties inherent in the function relevant to scheduling and receiving of patients.Performs additional tasks and duties as assigned by the management.Skills",
    "Skills": [
        "Qualification:",
        "Secondary school certificate",
        "• Two (2) years' Experience",
        "• Customer Service Experience and educational course",
        "• Excellent communication skill Arabic and English •",
        "Tact, courtesy and public relation skills are a must ",
        "Skills",
        "Excellent English language."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}