{
    "Job ID": "4729778",
    "Description": "eMagine Solutions have been retained by a FMCG company who are expanding their presence in the region and undergoing a massive scale-up. We are now looking for a Head of Marketing to work on the marketing plan and go to market (GTM) for private label and creation of new brands to launch in the Middle East, Asia and Africa. The company are a mission-led business that have a huge focus on bringing happiness to their customers. They have a presence in North America as well an internationally and are looking to significantly increase awareness and availability.The key responsibilities for this role include:• Establish a long term strategic plan for the GCC, Middle East, Asia, Africa & Europe• Manage investment levels by market,• Establish KPI’s that's define in market investment levels• Monitor GCC and Global performance KPI’s and provide corrections where necessary• Lead the implementation of consumer plans in market• Be up to date with market brand activity• Develop instore launch plan for the GCC which can be deployed globally• Grow and develop a team focused on the UAE and North AmericaSkills",
    "Skills": [
        "Strong written and verbal communication skills.\nPotential to solve practical challenges in real time using appropriate techniques.\nProfessional expertise as a Senior Marketing Manager / Head / Director in a recognized agency or company.\nEstablished record of marketing products or services in a professional setup.",
        "The key skills and requirements include:",
        "• Highly entrepreneurial with the ability to work in an unstructured environment",
        "• Previous experience in a senior marketing role",
        "• Experience working within the FMCG industry",
        "• Highly commercial, comfortable talking about trade collaborate with other internal teams to develop and monitor strategic marketing initiatives. Discuss trending marketing activities with the in-house team members to achieve optimum results. Find appropriate marketing channels to promote the company's products through in-depth market research. Examining the marketing tactics for further improvement and effectiveness."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "1"
    }
}