{
    "Job ID": "4729849",
    "Description": "Job Purposeالهدف من الوظيفةto support the Property’s to maintain the assigned properties. Responsible for the smooth operation of all electrical, in order to achieve high quality service for the building and tenants. To ensure sub-contractors and specialist contractors carry out the planned and reactive works within assigned building.Disclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.لدعم الممتلكات للحفاظ على الخصائص المعينة. مسؤول عن التشغيل السلس لجميع الأجهزة الكهربائية ، من أجل تحقيق خدمة عالية الجودة للمبنى والمستأجرين. لضمان قيام المقاولين من الباطن والمقاولين المتخصصين بتنفيذ الأعمال المخطط لها والتفاعلية داخل المبنى المخصص.إخلاء المسؤولية: يجب على صاحب العمل الامتثال واتباع السياسات والإجراءات المعمول بها في التجاريةAccountabilitiesالمسئولياتEnsure the physical condition of the property according to Al-Tijaria.\nRespond to all kinds of emergencies at properties under the site supervisor’s responsibility \nHandle emergency and regular repairs.\nCo-ordinate Electrical maintenance.\nReview and assign service requests.\nInspect preventative maintenance schedules and quality of work performed is effective.\nFacilitate quotes for reactive repair works.\nPersonally inspect property on a regular basis to ensure all the works are being done properly, safely, and in a timely manner.\nEnsure reactive work requests are actioned via the helpdesk and works closed down when works are completed.\nEnsure fire safety equipment is operational.Co-ordinate maintenance and repairs to appliances including refrigerators and washing machines where applicable.Ensure in-house technician carry out their work as instructed and monitor their work and performance.\nEnsure all works is carried out in a safe manner.\nEnsure plant rooms are maintained and secure\nAbility for Supporting with multi tasksالعمل على ضمان سلامة المبانى وفقاً لمعايير الأمن والسلامة المتبعه داخل الشركة التجارية الاستجابة لكافة حالات الطوارىء داخل العقارات والتواجد الفعلى بالمواقع.\nتنسيق وترتيب عمليات الصيانة الطارئة وكذلك عمليات الصيانة الدورية لعقارات الشركة.\nتنسيق عمليات الصيانة الكهربائية \nمراجعه وتوزيع أوامر العمل\nالتأكد من القيام بعمليات الصيانة الوقائية بشكل صحيح وفعال.\nمتابعه عروض الأسعار الخاصة بأعمال الصيانه المطلوبه.\nيقوم بفحص مبنانى العقارات بنفسة للتأكد من القيام بالإصلاحات اللازمة بشكل صحيح وآمن وفى الوقت المحدد.\nمتابعه تسجيل الأعمال الموقعية المطلوبه على نظام ال helpdesk وإغلاقها بعد الانتهاء من الأعمال.\nالتأكد من تشغيل معدات الأمن والسلامة بالمبانى دون أى فشل \n تنسيق ومتابعه صيانة الأجهزة الكهربائية الموجودة بداخل كل عقار من الأجهزة حيثما وجدت\nمتابعه أداء الفنيين التابعين لإدارة المرافق للقيام بالأعمال المطلوبه حسب التعليمات المعطاه لهم وتقييم أدائهم\nالتأكد من القيام بجميع الأعمال بطريقه آمنه\nالحفاظ على سلامة غرف المعدات الميكانيكية والكهربائية وصيانتها باستمرارSkills",
    "Skills": [
        "Disclaimer:Other duties deemed necessary and assigned might be part of the job.",
        "ملاحظة : قد يتم إضافة بعض المهام الأخرى التى يتعين على شاغل الوظيفة الالتزام بها.",
        "القدرة على دعم المهام المتعددة"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}