{
    "Job ID": "4729484",
    "Description": "• Represent company services professionally and successfully that results in repeat business and a positive customer service experience.• Identify lead opportunities as well as the potential for upsells.• Achieve agreed-upon sales targets and outcomes within a set schedule.• Implement and control sales programs• Develop a strong salesforce• Coordinate sales activities using various techniques that enable salesforce to improve their saleOrganize and coordinate sales representatives’ schedules• Research potential leads from business directories, web searches, or digital resources• Assist sales representatives and team to meet and exceed goals• Interact regularly with customers to understand their needs and recommend the right solution for them.• Establish, develop, and maintain positive business and customer relationships.• Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new services.• Resolves customer complaints by investigating problems, developing solutions, preparing reports, and making recommendations to managementSkills",
    "Skills": [
        "Ability to motivate, inspire, and lead a team to achieve sales and marketing targets.\nEffective communication to provide clear directions and guidance.\nConflict resolution and problem-solving within the team.\nDelegation and time management to prioritize tasks and responsibilities.\nProven track record in sales, with a deep understanding of sales techniques and strategies.\nAbility to set sales goals, track performance, and drive the team to meet and exceed targets.\nStrong negotiation skills to close deals and handle complex sales situations.\nCustomer relationship management to foster client loyalty and retention."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO); Call Centers & Customer Care Outsourcing; Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}