{
    "Job ID": "4729789",
    "Description": "Job DescriptionPrepares financial statements and consolidated accounting reports on a monthly, quarterly, annual and special request basis in coordination with business units.Makes and maintains all financial entries including journal entries, postings, prepares all related ledger entries in financial books as well as computerizes the foresaid details.Prepares budget formats and maintain analytical reports to control performance.Ensures adherence to generally accepted accounting standards and principles; as well as company policy & procedure.Ensures maintenance of proper audit trails and verification and reconciliation actions for all processed work.Supervise Payable section, payments transaction, and ensure periodically reconciliation with all suppliers.Control accounting activities and reports related to inventory, fixed assets, receivables, treasury and cash flows.Review and files all appropriate tax forms (ZAKAT) and reports with government agencies.Prepares financial analysis & reports for both internal and external audit purposes and replies all Governing bodies inquiries.Performs additional tasks and duties as assigned by Superiors.Reporting to:Head of FinanceSupervises:Accounting SectionSkills",
    "Skills": [
        "Skills",
        "Familiar with ERP system.",
        "Computer literate (Excel and Word).",
        "Strong leadership skills.",
        "Excellent communication skills both written and verbal",
        "·        Arabic & English language",
        "Qualifications:",
        "Education:",
        "Bachelor of Business, Accounting Major",
        "MBA-Finance or equivalent.",
        "Professional certificate (i.e. CPA or CA) is preferable.",
        "A minimum of:",
        "Five (5) years experience in preparing year-end Financial Statements including Balance Sheet.",
        "Experience in similar field and supervising post."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}