{
    "Job ID": "4729990",
    "Description": "Graphic Designer Job Description We are seeking a new graphic designer to join our team. You will be designing a wide variety of things across digital and offline media. To be successful in this position, you’ll be a self-starter, capable of delivering brilliant creative ideas, and showing amazing attention to detail. Graphic Designer Responsibilities:Planning concepts by studying relevant information and materials.\nIllustrating concepts by designing examples of art arrangement, size, type size and style and submitting them for approval.\nPreparing finished art by operating necessary equipment and software.\nCoordinating with outside agencies, art services, web designer, marketing, printers, and colleagues as necessary.\nContributing to team efforts by accomplishing tasks as needed.\nCommunicating with clients about layout and design.\nCreating a wide range of graphics and layouts for product illustrations, company logos, and websites with software such as photoshop.\nReviewing final layouts and suggesting improvements when necessary.Skills",
    "Skills": [
        "Bachelor’s degree in graphic design or related field.\nExperience as a graphic designer or in related field.\nDemonstrable graphic design skills with a strong portfolio.\nProficiency with required desktop publishing tools, including, and not limited to Photoshop, InDesign, and Illustrator.\nA strong eye for visual composition.\nEffective time management skills and the ability to meet deadlines.\nAble to give and receive constructive criticism.\nUnderstanding of marketing, production, branding, website design, corporate identity, product packaging, advertisements, and multimedia design.\nExperience with computer-aided design.",
        " "
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}