{
    "Job ID": "4729613",
    "Description": "We are seeking a highly motivated and experienced Recruitment Manager to lead our event staffing recruitment efforts. The Recruitment Manager will be responsible for developing and executing recruitment strategies, managing the recruitment team, and ensuring that the company attracts and hires top talent for long and short term event staffing positions.Duties and Responsibilities:Develop and execute recruitment strategies to meet the high volume recruitment needs of the company.\nManage the recruitment team and provide leadership, coaching, and mentoring to ensure that the team is motivated and achieving its goals.\nWork with the Operations team to identify staffing needs, job requirements, and candidate profiles for various events.\nDevelop job descriptions and job postings that accurately reflect the position requirements and attract top talent.\nSource, screen, and interview candidates to ensure that they meet the job requirements and are a good fit for the company culture.\nConduct reference checks and negotiate job offers.\nDevelop and maintain relationships with external recruitment agencies, job boards, and other talent sources.\nEnsure compliance with all employment laws and regulations.\nDevelop and maintain recruitment metrics to measure the effectiveness of the recruitment process.\nContinuously improve the recruitment process to enhance the candidate experience and increase the efficiency of the hiring process.\nIdentify and implement new recruitment technologies and tools to improve recruitment outcomes.Skills",
    "Skills": [
        "Bachelor's degree in Human Resources, Business Administration, or a related field.\nMinimum of 5 years of experience in recruitment, with at least 2 years of experience in a high volume recruitment or event staffing role.\nStrong knowledge of recruitment best practices, employment laws, and regulations.\nExcellent communication, interpersonal, and negotiation skills.\nAbility to effectively manage a team and work collaboratively with other departments.\nStrong problem-solving and decision-making skills.\nAbility to work in a fast-paced environment and manage multiple priorities.\nProficiency in Microsoft Office and recruitment software.",
        "If you are a dynamic and results-driven Recruitment Manager with a passion for high volume recruitment and event staffing, we encourage you to apply for this exciting opportunity."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}