{
    "Job ID": "4729928",
    "Description": "BASIC QUALIFICATIONSRequired qualifications and skills:- Relevant qualification in loss prevention, security management, administration of justice or a related field; equivalent experience could suffice as an alternative,- Demonstrable loss prevention program exposure, including experience in a distribution environment at senior level,- Decision-making and problem-solving: [li]You can proactively gather the right data from appropriate sources, while considering all of the facts and other perspectives,- You’ll conduct root cause analysis and draw sound conclusions,- You’ll prioritise key factors and act decisively, promptly and confidently,- Be agile and flexible in your approach,- Be able to operate with limited guidance from management,[/li] - Communication and influencing: [li]Demonstrate ability to identify the customer expectation, adjusting language and style to suit the listener,- Structure information using correct terminology and grammar,- Remain articulate and well-reasoned at all times,- Be solutions-focused, customer-focused, and always deliver excellent follow-up.PREFERRED QUALIFICATIONS- Higher academic degree or relevant qualification would be advantageous,- A grasp of Kaizen and Lean methodologies and techniques would be advantageous.We’re looking forward to receiving your application, preferably in English.Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.Amazon takes your personal data protection seriously and respects EU and local data protection laws. Unless you express otherwise, by submitting your CV you authorize the hiring Amazon company to store your personal data in the electronic database maintained by Amazon Corporate LLC. in the USA or one of its affiliates for the purpose of assessing your suitability for this and future job vacancies and to pursue your recruiting process.If at any time you want your personal data to be deleted, you simply need to notify the hiring Amazon company. Amazon will not share your personal data with any third party without your prior consent. As part of your interview process with Amazon you may be asked to authorize the hiring Amazon company to separately verify your application data and personal background through a third party service provider.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Security",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}