{
    "Job ID": "4729865",
    "Description": "Position DetailsJob Titleالمسمى الوظيفىOracle Developerمطور برامج 2.Job Purpose الهدف من الوظيفة                                                                    To be in-charge of all software related initiatives in Tijaria. To ensure software system implementation, application software development and coordination with the vendors and the users so that the desired software is implemented. Continuous active database management & responsible for maintaining the application, database and data management. Disclaimer: The job holder has to comply with and follow the established policies and procedures of Al-Tijaria.أن يكون مسؤولاً عن جميع المبادرات المتعلقة بالبرمجيات شركة التجاريه لضمان تنفيذ نظام البرنامج وتطوير برامج التطبيق والتنسيق مع البائعين والمستخدمين بحيث يتم تنفيذ البرنامج المطلوب. إدارة نشطة مستمرة لقواعد البيانات ومسؤولة عن إدارة التطبيق وقاعدة البيانات والبيانات.يلتزم مهندس الشبكات بالسياسات والإجراءات المتبعة داخل الشركة التجارية ويقوم بتنفيذها . 3.Key Accountabilities & Performance Indicators المسئوليات الرئيسية ومؤشرات     الأداء             AccountabilitiesPerformance IndicatorsFinancial Accounting, Operations Management, Fixed Assets, Payroll, Property Management, Business Intelligence, MIS and other utilities development المحاسبة المالية ، إدارة العمليات ، الأصول الثابتة ، كشوف المرتبات ، إدارة الممتلكات ، ذكاء الأعمال ، نظم المعلومات الإدارية وتطوير المرافق الأخرىFollow up of the application software & coordination. Requirement specification, implementation and full in-house user support from time to time on all the ERP modules.  متابعة البرامج التطبيقية والتنسيق. مواصفات المتطلبات والتنفيذ ودعم المستخدم الداخلي الكامل من وقت لآخر على جميع وحدات تخطيط موارد المؤسسات.Change management & control for user requestsإدارة التغيير والتحكم في طلبات المستخدDevelopment of reports, refining the functionality of forms, new development of applications based on user requirements تطوير التقارير ، وتحسين وظائف النماذج ، وتطوير التطبيقات الجديدة بناءً على متطلبات المستخدمAll the MIS needs of the users to be documented and plan forيجب توثيق جميع احتياجات MIS للمستخدمين والتخطيط لتطوير الأدوات المناسبة لتعزيز عملية الأعمال وتلبية متطلبات المستخدم.Ability for Supporting with multi tasksالقدرة على دعم المهام المتعددةDisclaimer:Other duties deemed necessary and assigned might be part of the job.ملاحظة : قد يتم إضافة بعض المهام الأخرى التى يتعين على شاغل الوظيفة الالتزام بها.Skills",
    "Skills": [
        "Education الخبرة   ",
        "Relevant Bachelor Degree or equivalent",
        "درجة البكالوريوس ذات الصلة أو ما يعادلها",
        "Experience  المهارات الوظيفية ",
        "15 years working experience in IT",
        "15عاما من الخبرة العملية في مجال تكنولوجيا المعلومات",
        "Functional Skills",
        "Excellent knowledge of IT related issues",
        "معرفة ممتازة بالقضايا المتعلقة بتكنولوجيا المعلومات",
        "General Skills مهارات عامة ",
        "Excellent communication and inter-personnel skills",
        "Excellent problem solving and decision making skills",
        "Excellent planning and organizing skills",
        "Customer services oriented",
        "Excellent oral and written English and Arabic",
        "Excellent PC skills",
        "مهارات اتصال ومهارات ممتازة بين الموظفين",
        "مهارات ممتازة في حل المشكلات واتخاذ القرار",
        "مهارات تخطيط وتنظيم ممتازة",
        "موجهة لخدمة العملاء",
        "اللغة الإنجليزية والعربية تحدثا وكتابة ممتازة",
        "مهارات ممتازة في استخدام الكمبيوتر"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}