{
    "Job ID": "4729797",
    "Description": "Job Role: The function of the Welfare Officer is to address grievances of employees and follow up with the respective team to close within a limited turnaround time. Handle employee welfare by providing necessary assistance in the development of employees and making a better workforce. Apply policies and procedures to provide effective employee relations and encourage harmonious industrial relationsKEY RESPONSIBILITIES:  Overall responsibility in ensuring welfare activities for employees are effectively managed and implemented\nHandle employee complaints, counseling, and grievances.\nIdentify and address issues, concerns, the root cause of an employee's behavior, and any matter that needs escalation to management.\nVisit all Dulsco employee accommodations and camps to conduct welfare-related activities\nHandle resignation cases to understand the reason and possibility of retaining a separating employee\nProvide support to Operations team in handling late leave return cases and disciplinary cases\nInitiate disciplinary actions, including recommendations of warning, suspension or termination\nMaintain welfare-related MIS, reports, and updates.\nDeliver employee welfare-related trainings\nEnsure necessary assistance and care is given to employees who have undergone medical treatment and residing at our accommodations and coordinate with DMC on the same\nEngage idle employees through various activities, including trainingOther responsibilities may maybe assigned from time to timeTraining and InductionAccommodation VisitsReports, and PresentationsSeparation and exit interviewsSkills",
    "Skills": [
        "Required Qualifications and Experience:",
        "MSW/ MA Sociology \nPrior experience in welfare will be preferable\nTraining multicultural groups",
        "Job-specific skills and requirements:",
        "Language Proficiency (mandatory): English (Read, Write, Speak), Hindi and other local languages will be an added advantage\nIT Proficiency: MS Office (Word, Excel)\nValid UAE driving license"
    ],
    "Preferred": {
        "Residence Location": "Abu Dhabi, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}