{
    "Job ID": "4729777",
    "Description": "Job DescriptionJOB SUMMARY:A Coordinator is an operation professional, who is responsible for developing, coordinating and implementing all tasks that relate to a specific project by overseeing all manner of assignment. A coordinator confers with his/her director to understand the scope of a project.Then meets with the project team, ensuring that each team member understands their responsibilities and accountabilities. The coordinator serves as the point person for the project.MAJOR DUTIES and RESPONSIBILITIESEnsures through her actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the CARE Hospitals and Clinics.Working closely under the guidance and direction of the Director and the organizations systems and methods.Assist in plan and specific analysis in order to provide clear, trackable and coordinated interpretations of the design/drawings for construction and act as liaison with subcontractors in expediting drawings and related information.Maintain accurate and up-to-date logs (RFI, Vendor/Subcontractor, Purchase, Owner etc.), track responses and advise the Director of the status of RFIs.Monitor field work, including contract work, to ensure compliance with company standards, procedures, specifications and codes.Participate in the continuous updating and accurate generation of as-built documents.Assist with the research and preparation of field change requests to resolve design issues. Conduct quality control activities in accordance with instructions, inspection programs, using specified control measuring and testing equipment.Understand and perform document control functions in accordance with on-site policy and procedures, including tracking and creating of RFIs, transmitting and tracking of submittals, compose agreements, and maintain project expediting list.Attend project coordination and owner/contractor/architect/engineer meetings as requested or required.Coordinate periodic job-related photographs for records.Present oneself as a candidate for promotion by learning and understanding construction methods and developing good construction management skills.Perform additional assignments and responsibilities as assumed or requested by supervision.REPORTING TO:Department Director/HeadSUPERVISES:Department StaffSkills",
    "Skills": [
        "QUALIFICATIONS:",
        "Education",
        "RequiredUniversity Degree and post-graduation",
        "Experience",
        "RequiredTwo (02) years of responsible coordination experience, or an acceptable equivalent combination and experience.",
        "Good knowledge of Hospital operations and specifically of the assigned department.",
        "SPECIAL REQUIREMENTS / SKILLS:",
        "Should type error-free approximately 70 wpm.",
        "Ability to read and interpret documents such as governmental regulations, legal documents, operating instructions, and proceduremanuals.s",
        "Ability to speak effectively with the public and employees of the organization and requires good knowledge of the English language and spelling.",
        "Ability to assume responsibility and to interface and communicate effectively with others. Effective oral and written communication skills and ability to represent the company and project team in a professional manner to the Owner, Architect, related project staff and the community.",
        "Skills",
        "Excellent English language.",
        "Excellent Communication skills",
        "Very good Microsoft Application skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}