{
    "Job ID": "4729516",
    "Description": "Act as the primary point of contact and build long-term relationships with celebrities.\nWorking & dealing closely with celebrities to conduct paid Ads and marketing campaigns.\nSelect a suitable product for each celebrity and further clarify its details to them before signing the contract and announcing it.\nTrack and check the campaign calendar and identify appointments in coordination with the branding and marketing division and celebrities.\nOrganize campaign appointments with the branding and communication division and inform the celebrities about it.\nTrack celebrity performance and achievement rates regarding products, exclusive products.\nfilling the needed sheet & recording Videos and to be submitted to the Team Leader.\nDetermine applicable time with the celebrities for visiting the store on monthly basis.\nMonitor celebrities' advertisements to ensure that they announce products as per the required details.\nDeal with micro bloggers for advertising products based on required specifications.\nEnsure that all micro bloggers include the buying link in the advertisement for each post on the social media platform.\nAchieve the required sales target and maintain the company's customer segment and development based on product availability from purchasing department.\nRecommend PL products to the purchasing department based on the celebrities' needs, season, and budget.Skills",
    "Skills": [
        "Bachelor's Degree in marketing, business administration, or equivalent certificate.\n1-3 years of experience as an Account Manager, Key Account Manager, Sales, social media or relevant role.\nExperience in delivering client-focused solutions based on customer needs.\nExcellent Microsoft Office skills (Word, PowerPoint, Outlook, and Excel)\nAbility to manage multiple accounts at one time while paying attention to details.\nExcellent negotiation and presentation skills.\nProfessional previous experience in the Retail/Sales field.\nStrong writing and verbal communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}