{
    "Job ID": "4729791",
    "Description": "Job Summary  Responsible for carrying-out all procedures as they relate to the organization of all patient medical record files.  Responsible for assembly and analysis (OP / IP), loose report filing, creating new folders after the discharge of the patient. To ensure that each in-patient medical records contains necessary documentation, reports, tests results, or other required elements as per departmental policy based on CBAHI & JCIA standards.  Retrieve record as requested.  Responsible for notifying all physicians of their incomplete medical records monthly to comply with hospital policy. All queries from Physicians are referred to this policy.  Proper file maintenance has to be maintain in the master record filing area.  Auditing of files will be carried-out.  Is able to work independently with minimal direct supervision.  Maior Duties and ResponsibilitiesOutpatient Record Retrieval / Filing  Retrieves all medical records upon request (walk-in patients and ER patients)  Retrieves pre-appointment records for next day outpatients visits and filing of the visited patients record in permanent filing area.( 1 st & 2nd shift, i.e. 08:00 — 16:00 & 16:00 -  Reviews and assembles all patient files after retrieval.  Prepares medical record folders for new patients.  Inserts all incoming reports throughout each shift to prevent backlog.  Maintains all shelving areas in accurate terminal digit order by periodically performing file audits.  Complies with all departmental the policies and procedures.  Routing the records to the outpatient and inpatient departments when it's urgently needed for the patient care.  Maintains accurate, neat files in a timely manner.  Maintains confidentiality, security and personal privacy of all patient information and files.  Places records on appropriate shelving area, i.e. permanent filing area, incomplete, coding and etc.  Assembly and Analysis  Responsible for collection of medical records discharges not forwarded to Medical Record Department.  Assemble the unorganized document according to the standard assembling order (CBAHI & JCIA standard) of the discharged patient's records.  Analyze the medical record file for missing documents as per policy.  Assigned to every physicians responsible for dictation of Surgical Procedure Report and Discharge Summary.  Maintains accurate, neat files in a timely manner.  Maintains confidentiality, security and personal privacy of all patient information and files.  Maintains the computerized Medical Record Deficiency system.  Work is conducted in a professional manner maintains patient / staff confidentiality when required.  Participates in on-going education program developed by the department, e.g. department polices and procedures, Fire and Safety, Risk Management, Environmental control.  Re-analyzes all medical records determined to be completed before filing in the permanent file area.  Submits a weekly and monthly report on the number of delinquent records by physician department and type of deficiencies, i.e. signature, H & P's, operation notes and discharge summaries as per policies.  Performs applicable tasks and duties assigned within the realm of the employee's knowledge, skills and duties.      Skills",
    "Skills": [
        " ",
        "Skills",
        "Experience:",
        " ",
        " ",
        "At least three (3) years experience working in Medical record department performing Technical tasks.",
        " ",
        " ",
        "Special requirements/skills:",
        " ",
        " ",
        "Fluency in verbal and written English.",
        " ",
        " ",
        "Must possess complete familiarity with required medical record documentation, medical terminology, Anatomy, Physiology and Pathology.",
        " ",
        " ",
        "Must possess thorough comprehension of the HMIS system as it relates to the medical records department and utilize that knowledge for practical applications.",
        " ",
        " ",
        "Ability to operate computerized health information system as required by departmental functions.",
        " ",
        " ",
        "Ability to understand diverse documentation styles.",
        " ",
        " ",
        "Exhibits professionalism and excellent interpersonal communication skills.",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}