{
    "Job ID": "4729786",
    "Description": "Job SummaryTo ensure emergency preparedness to meet uneventful fire disasters and to make familiar to all staff and their roles and responsibilities within their specific area in time of emergency.Major Duties and ResponsibilitiesEnsures through his actions, either directly or indirectly, that a superior quality of medical treatment, compassion and understanding is given to every patient served at the NMC Hospitals and Clinics.Standby Alert and to monitor equipment’s at the \\\\\\\"Building Monitoring System Room\\\\\\\" and to inform all emergency calls to concern technician. Inspect fire/smoke detection & protection and warning system quarterly. Inspect, test and maintain fixed fire suppression system and all other firefighting tools/equipment’s in full operational condition at all times. Maintain written, dated and authenticated records of all inspection and maintain program as required.Maintain control valves for the sprinkler system and ensure automatic alarm to the facilities, control maintain main valve source.Inspect fire extinguisher daily and maintain as necessary. Provide equipment replacement for portable fire extinguishers removed for servicing.Install fire extinguishers at appropriate location to ensure that the maximum traveling distance does not exceed 75 feet in any work area and are easily accessible.Hydrant flushing monthly. To ensure fire exit sign and emergency power system are operational. Conduct fire prevention inspection, identifies deficiencies and provides recommendation relating to fire safety. Conduct fire and safety orientation to newly arrived hospital employees.Conduct fire and safety orientation to newly arrived hospital employees. To implement Hospital “Code Red” Procedure. To respond emergency calls at all times pertaining to Fire/Safety and when required. Performs other applicable tasks and duties assigned within the realm of the employee’s knowledge, skills and abilities.Reporting toSafety ManagerSupervisesNoneSkills",
    "Skills": [
        "Qualifications",
        "A minimum of:",
        "Safety Technology college level or Technical Graduate is preferred.",
        "Two (2) years’ experience in fire prevention and protection.",
        "Fluency in verbal and written English and computer literate.",
        "Managing safety programs implementations.   ",
        "Exhibits professionalism and excellent interpersonal communication skills.",
        "Excellent English language"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}