{
    "Job ID": "4730743",
    "Description": "Ensures that the personel safety maintaned within GCCIA premisses, through monitoring of equipment and perfoming audits and safety checks Summarized Attend and Investigate accidents to identify causes in order and determine how such accidents might be prevented in the future.\nPrepare the safety inspection reports, accident investigation report, weekly safety reports (resolved & pending safety issues) and monthly reports.\nEnsure fire suppression, firefighting and fire alarm systems are operational.\nEnsure that all employees and visitors to sites and plants are briefed on risks, hazards and safety policies.\nEnsure that monthly or quarterly inspection of all Fire Fighting systems, Fire Alarm system, Fire Extinguishers, Exit Lights and Emergency Lighting, are carried out.\nProvide first line support on enquiries from employees and be available for technical support on site issues.\nPerform Health Safety Environment & Security  audits on sites and GCCIA premises and carry out safety checks, on sites and plants.\nFollow up on any deficiencies noted during inspections, and ensure that they are corrected.\nConduct risk assessment and enforce preventative measures.\nAssist in eliminating incident injuries risk and minimize property damage and adverse environment impact.\nSupport the development of OHS (occupational health and safety) policies and programs.\nReview existing policies and measures and update according to legislation.\nInitiate and organize OHS training of employees and executives.\nStop any unsafe acts or processes that seem dangerous or unhealthy.\nPrepare reports on occurrences and provide statistical information to upper management.·        Any other reasonable duties which may be required by management from time to time related to the HSE Department in GCCIA.Adherence to the code of conductSkills",
    "Skills": [
        "Deploma in safety engineering or relevant field is preferred. (BSc / BA is prefered).\nExcellent communication skills with the ability to present and explain health and safety topics.\nAccredited Certificate in occupational health and safety."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Gender": "Male",
        "Age": "Max: 42"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Safety & Environment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}