{
    "Job ID": "4730018",
    "Description": "Key AccountabilitiesMember of IT Service Desk Team.\nDealing with incoming faults in a professional, courteous manner over the phone ,via email & On site.\nTaking ownership of faults and managing them in a logical and methodical manner.\nCorrectly logging incidents and faults, categorizing and prioritizing them in line with team procedures.\nConducting full and through diagnostics with end users to enable first point of contact fault resolution.\nEnsuring all faults are progressed & cleared within SLA – escalating to other internal and external teams as appropriate.\nManaging faults through their entire lifecycle from the first point of contact through to resolution, proactively keeping the customer informed of progress.\nDiagnosing and resolving problems to the customers satisfaction\nMaintain and develop own knowledge and skills to assist with first time fault resolution.\nIdentify and escalate repeat issues or service risks into service management teams.\nSharing knowledge with team colleagues.\nManage a number of scheduled tasks for customers, designed to ensure that the customers systems remain operationalSkills",
    "Skills": [
        "Required Experience",
        "At least 3 years or above relevant IT related experience.\nWorking knowledge of event, incident & problem management processes and tools.\nFamiliar with working on Windows operating systems environment and a keen interest in networking.\nThe ability to liaise and communicate confidently and professionally with customer representatives at all levels.\nHave solid experience in a helpdesk or technical support environment.\nHighly organized and able to work on own initiative to complete the range of tasks required\nHas a network support experience or background (CCNA equivalent).\nHas a Windows OS and Microsoft Applications support experience or background (MCP equivalent).\nHas a Windows Administration support experience (MCSA equivalent)\nHas a Citrix support experience or background on Thin-Client implementation.\nSCCM basic knowledge& experience is a must.\nTeam player, flexible on work shift timing schedule.\nWilling to work on demanding environment with minimal supervision",
        "Skills",
        "Ability to interact with internal and external stakeholders\nAbility to work under pressure",
        "Education",
        "Bachelor degree or equivalent"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}