{
    "Job ID": "4730504",
    "Description": "Overview:As a leading global provider of engineering, procurement and construction management expertise to the energy, chemicals, and resources sectors we are proud to be in a position to expand our team in Sweden, and have partnered with Airswift to support our recruitment plans in 2023.We are currently recruiting for an ‘CIVIL & ARCHITECTURAL OVERSEER’ to support the Northvolt Upstream 2 Battery Factory Project, located in Skelleftea, Sweden. The successful individual(s) will be engaged on a contract basis for an initial 12-month period, with the likelihood of a further 2 - 3 years of work on the project. This position is a site based role, hence the successful candidate is required to be based on site in Skellefteå, Sweden.Project BackgroundOur project will establish a large-scale lithium-ion battery factory in the Sweden (the “Battery Factory”). The Battery Factory will manufacture batteries for consumer and industrial products, including electric vehicles and solutions for energy storage systems. The Next Generation Upstream expansion is aimed at increasing the production of Cathode Active Material (CAM) for processing into battery cells in the different Downstream buildings. The first phase of the site is set to produce its first batteries by the end of 2022. The present scope of works concerns the expansion of the site to further enhance the battery production from 16 GWh to 61 GWh. In terms of CAM, the expansion takes the first phase production of 25,800 tonnes per annum to approximately 98,000 tonnes per annum.Position SummaryOversee all civil and architectural works performed by the contractor\nEnsure safe implementation of site works in accordance with Project Execution Plans, Legislation and Site Standards\nResponsible for related Quality Assurance and Project Construction procedures as in Construction Management Plan\nDetailed planning, coordination and interfacing of construction activities within continuous operating plant environment.\nProject tasks as directed by the Worley Construction Superintendent or equivalent.\nResponsible for nominated construction supervision following the engineering documentation, specifications, schedule, and budget.Specific Roles & ResponsibilitiesOversee all civil and architectural activities in a specific area of the project.\nFollow all the engineering documentation and\nPromote and adhere to the project Safety Management System (refer to PEP-02 Health, Safety, Security and Environment Plan)\nCoordinate between the contractors and disciplines to ensure smooth interface management\nEnsure the PTW work system process is followed by Contractors\nMethod statement and Task Risk Analysis review (PTW Process map).\nGet detailed involved in all contractors civil and architectural activities.\nReview all craft discipline work in area of responsibility.\nAccountable for productivity and quality targets established for the scope of work within area of responsibility.\nAssist in fostering a positive team culture that is focused on Worley business needs, excellence in project delivery and a high morale professional team\nParticipate and conduct contractors blue colour workforce performance reviews with the discipline leads.\nTroubleshoot construction issues in the field. Escalate to the Construction Superintendent if required.\nConduct any incident investigations within area of supervision as required.\nFollow the Management of Change process.\nSupport the Site Query process and provide construction knowledge input if required.\nPerform work-site inspections monitoring safety and quality of work.\nAttend and participate daily in Production and Construction meetings to ensure progress is being communicated across the project.\nAttend daily SIMPS meeting to support coordinating the works.\nReview and submit timesheets in timely manner and any other paperwork on behalf of the crew to appropriate internal personnel. Ensure any appropriate overtime approvals have been requested and approved prior to performing overtime.\nUnderstand and execute all aspects of a comprehensive safety program as it relates to supervision of direct force labor for pipeline installation\nInterface with QA/QC personnel to address quality issues/progress\nEnsure compliance with specifications, procedures, and plans\nProvide on-site support to the Construction Site Lead as required\nParticipate Quality Audits and other site surveillance activitiesSkills",
    "Skills": [
        "Person Specifications – Qualifications and Key Skills",
        "Essential:Minimum of 10 years’ experience required in construction projects with a further of 5 years as Construction Supervisor for major projects.\nCrafts man certificate in civil or higher\nExcellent communications skills\nAdvanced written and spoken English\nBasic Computer Skills\nCompetency in written/oral communication\nAttention to detail and high level of accuracy\nAnalytical and problem-solving skills",
        "Desirable:A strong communication, networking, collaboration and well-developed team-working skills, especially in multi-discipline and multi-cultural teams.\nA full knowledge of project specific execution strategies, and the ability to develop them to meet challenging project objectives and deliverables.\nAn ‘Incident Free’ mind-set, and be a role model for their project team (Direct/Indirect hires);\nHSSE and QA/QC leadership in managing and delivering large complex onshore construction projects.\nAn excellent teamwork skill being able to work with the various sub-teams to resolve issues and reach decisions that are in the best interests of the integrated project team.\nAn ability to work effectively in a diverse, multidisciplinary team environment, including Interface management experience, within facilities, and across other functions,\nStrong Team Building, Development and Mentoring skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Sweden",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}