{
    "Job ID": "4730451",
    "Description": "About the role:As an Airport Lounge Barista, you will be responsible for providing exceptional coffee and beverage service to passengers andvisitors in the airport lounge. You will work in a fast-paced environment, interacting with diverse customers, and ensuring thattheir coffee experience is of the highest quality. Your primary focus will be on preparing and serving a variety of coffee-basedbeverages, maintaining cleanliness and hygiene standards, and delivering excellent customer service.Responsibilities:Coffee Preparation:\nExpertly prepare and serve a wide range of coffee beverages, including espresso, cappuccinos, lattes, macchiatos, and specialty drinks, according to customer preferences and established recipes.\nEnsure consistent taste, presentation, and quality.\nBeverage Service:\nTake orders from customers and provide recommendations based on their preferences.\nServe beverages promptly, ensuring accuracy and attention to detail.\nHandle special requests or modifications professionally and efficiently.\nCustomer Service:\nCreate a warm, welcoming, and friendly atmosphere for passengers and visitors.\nGreet customers, answer questions about menu items, and offer suggestions.\nProvide outstanding customer service by addressing concerns, resolving issues, and ensuring customer satisfaction.\nEscalate all complaints to a supervisor or manager on duty and record in the logbook/DMR.\nCash Handling and Point of Sale (POS) Operations:\nAccurately process customer payments, operate cash registers or POS systems, and maintain proper cash handling procedures.\nHandle transactions efficiently, including cash, credit/debit cards, or mobile payments.\nCleanliness and Hygiene:\nMaintain a clean and organized work area, including the coffee bar, espresso machines, and brewing equipment.\nAdhere to health and safety standards, ensuring all food handling and preparation areas are sanitary.\nClean and sanitize utensils, cups, and other equipment regularly.\nFollow the monthly and daily maintenance schedule as per the machine.\nInventory Management:\nMonitor and manage inventory levels of coffee beans, milk, syrups, and other supplies.\nPlace orders to replenish stock when necessary, ensuring products are always available.\nAssist in receiving and storing deliveries, checking for quality and freshness.\nStay informed about different coffee varieties, brewing methods, and flavor profiles.\nEducate customers on various coffee options, explaining differences and recommending choices based on their preferences.\nUpsell additional menu items, such as pastries, snacks, or specialty drinks, where applicable.\nTeam Collaboration:\nWork collaboratively with other baristas and lounge staff to ensure smooth operations.\nCommunicate effectively with team members to coordinate workflow, assist with tasks, and maintain a positive work environment.\nHelp on the floor as and when needed.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Previous experience as a barista or in a similar customer service role, preferably in a fast-paced environment.\nProficient knowledge of coffee preparation techniques, including espresso extraction, milk steaming, latte art, and specialty drink creation.\nStrong understanding of coffee beans, flavor profiles, and brewing methods.\nExcellent customer service and communication skills, with the ability to engage and interact with customers from diverse backgrounds.\nKnowledge and Upselling:\nDemonstrated ability to handle cash transactions and operate POS systems.\nAttention to detail, accuracy, and efficiency in serving beverages and handling multiple tasks.\nAbility to work well under pressure and in a fast-paced environment.\nFlexibility to work varying shifts, including early mornings, evenings, weekends, and holidays.\nKnowledge of health and safety regulations, including food handling and sanitation practices.\nA positive attitude, passion for coffee, and willingness to continuously learn and improve.\nAny other service-related task assigned by the line manager.",
        "Requirements:",
        "Previous experience as a barista or in a similar customer service role, preferably in a fast-paced environment.\nProficient knowledge of coffee preparation techniques, including espresso extraction, milk steaming, latte art, and specialty drink creation.\nStrong understanding of coffee beans, flavor profiles, and brewing methods.\nExcellent customer service and communication skills, with the ability to engage and interact with customers from diverse backgrounds.\nDemonstrated ability to handle cash transactions and operate POS systems.\nAttention to detail, accuracy, and efficiency in serving beverages and handling multiple tasks.\nAbility to work well under pressure and in a fast-paced environment.\nFlexibility to work varying shifts, including early mornings, evenings, weekends, and holidays.\nKnowledge of health and safety regulations, including food handling and sanitation practices.\nA positive attitude, passion for coffee, and willingness to continuously learn and improve.\nGood command of spoken and written English.\nShift duty is required.\nWork location: Airport"
    ],
    "Preferred": {
        "Residence Location": "Abu Dhabi, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}