{
    "Job ID": "4730227",
    "Description": "Job PurposeMaintains and repairs industrial machinery and equipment using hoists, lift trucks, and hand and power tools. Troubleshoot problems and repairs or replace worn or broken parts as necessary. Performance is aimed at ensuring minimum downtime of the equipment.Main ResponsibilitiesAbility to read and understand electrical drawings.\nRe-wire, adjust, upgrade/install control panels and voltage regulators.\nDetermine necessary parts and special tools required to complete jobs.\nDiagnose issues with the Alternator.\nAdjust speed controls and various settings.\nRun load bank tests on the generator.\nWork closely with the Workshop Supervisor and Service Manager on project progress, estimates.\nMaintain a safe work environment at work sites.\nUse electronic software and tools to diagnose, repair and reprogram generator controllers and related parameters.\nInstall, maintain, and enhance electrical systems and components, including fuses, lights, and wiring.\nInspect, test, and diagnose issues with electrical systems and components.\nPerform all work in a manner that meets and follows electrical codes, blueprints and standards.\nTest electrical systems and components to ensure proper functioning.\nComplete required documentation of repairs and service information.\nEnsure adequate inventory of necessary supplies and parts.\nCalibrate equipment to provided specifications.\nPerform preventative maintenance on electrical systems and components.\nTroubleshoot problems and make timely repairs.\nThorough and timely completion of job documentation.\nProvide inputs to improve, update and add to the Work Instruction Manual.Skills",
    "Skills": [
        "Qualifications and Relevant Certifications",
        "Diploma in Mechanical/Mechatronics.\nTechnical training certificates from OEMs\nDriving License\nKnowledge Skills and Experience.\nWorking knowledge of Electrical components of genset like alternator, control panel.\nTroubleshooting and field repair of large sophisticated high or low speed diesel driven generators, low, medium, and high voltage 13.8KV as well as control devices e.g., auto-start, auto load share, auto-parallel, auto-stop, synchronizing.\nProgramming of controllers like Deep Sea and Synchronization systems.\nPractical knowledge of Mechanical, Thermal, Hydraulic, Electronics principles.\nPerform welding, fabrication, and calibration as needed.\nThorough knowledge of Diesel Engine, Fuel, Lubrication, Cooling and Exhaust systems particularly of the rating used for Power generation and applications in Oil & Gas industry.\nExperience in servicing and repairing alternators of different name brands like Stamford, Marelli, Leroy-Somer, Mecc Alte, and Marelli along with control panel components like ATS, MCCB, MCB, PLCs and busbars for applications like synchronization.\nHighly proficient in Technical English.\nProficiency with MS Office Suite particularly MS Outlook and Calendar.\nA strong commitment to all health and safety guidelines\nEffective communication in English\nAnalytical and systematic problem-solving approach.\nPrior experience in customer-facing roles is preferred.",
        " Personal Style & Behaviors",
        "Highly Motivated\nAttention to Detail\nOral Communication\nReasoning"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 3",
        "Gender": "Male",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}