{
    "Job ID": "4730688",
    "Description": "We are looking for a skilled Procurement Engineer to join our Supply Chain & Logistics team in Abu Dhabi, UAE. The ideal candidate should have a minimum of 5 years of experience in procurement and supply chain management. As a Procurement Engineer, you will be responsible for sourcing and purchasing materials, equipment, and services needed for our projects. You will work closely with the factory team to ensure timely delivery and cost-effectiveness. This role requires strong analytical and negotiation skills, as well as the ability to manage multiple suppliers and vendors.Responsibilities:Develop and implement procurement strategies to meet project requirements\nSource and evaluate suppliers and negotiate contracts and pricing terms\nMonitor supplier performance and ensure timely delivery of materials and services\nCollaborate with sales and production team to identify material requirements and ensure timely procurement\nManage relationships with suppliers and vendors to resolve any issues or disputes\nPerform cost analysis and identify opportunities for cost savings\nEnsure compliance with company policies and procedures\nMaintain accurate records of all procurement activities\nStay updated with industry trends and best practices in procurement and supply chain managementSkills",
    "Skills": [
        "Strong analytical and negotiation skills\nExcellent communication and interpersonal skills\nAbility to work well under pressure and meet tight deadlines\nProficient in using procurement software and tools\nKnowledge of local and international procurement regulations and best practices",
        "Preferred Candidate:",
        "Bachelor's degree in Engineering, Supply Chain Management, or a related field\nProven experience in procurement and supply chain management. GCC Experience in Building or Constriction Materials is plus.\nStrong analytical and negotiation skills\nExcellent communication and interpersonal skills\nAbility to work well under pressure and meet tight deadlines\nProficient in using procurement software and tools\nKnowledge of local and international procurement regulations and best practices\nAbility to manage multiple suppliers and vendors\nAttention to detail and strong organizational skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}