{
    "Job ID": "4730370",
    "Description": "Handle escalated customer complaints or issues, resolving them in a timely and satisfactory manner while maintaining a professional demeanor.\nHandling all clients meetings to address their needs and forward their cases to the head of concerned areas. - Develop initial ideas and acquiring key information, discussing requirements in detail with clients. - Following up the design stage process of clients through shared automated log. - Coordinate with head of areas sorting out the complete proposal of finishing. - Processing all the contractual process with clients. - Following up with clients the achievements of work scope at site by sending and updating reports. - Site visits with clients to get them fully updated. - Attending the final handing over with clients after finishing all required work. - Coordination between client, site, and office. - Establish and maintain project data files and minutes of meetingsSkills",
    "Skills": [
        "Strong problem-solving and decision-making abilities are essential, with the capacity to resolve complex customer issues and handle escalations promptly and efficiently.\nWe require evidence of achieving and exceeding customer satisfaction goals through the implementation of successful customer service strategies and initiatives.\nThe ideal candidate should possess strong problem-solving and decision-making abilities, enabling them to resolve complex customer issues and handle escalations promptly and effectively.\nThe ideal candidate should possess strong problem-solving and decision-making abilities, enabling them to resolve complex customer issues and handle escalations promptly and effectively."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28 Max: 35"
    },
    "Data": {
        "Job Location": "Mohandessin, Cairo , Egypt",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}