{
    "Job ID": "4730029",
    "Description": "Safety supervisors monitor the workers and ensure that they are working safely at all times.\nResponsible for assigning safety meetings and making provisions for all attendees. \nWhen work changes happen, the safety supervisors update the risk assessment and communicate the changes to the workers. \nConducts Job hazard analysis with others and provides the document for everywhere to read.\nWrites the risk assessment for jobs with others and submits the document for work use.\nMakes daily spot checks and inspections of work tools, equipment and site and takes the necessary actions towards correcting any seen hazards.\nEnsure that all workers under them are supervised regularly on health and safety matters.\nEnsures that all workers comply with the health and safety requirements of the organisation. \nThe safety supervisor should ensure that all workers are provided with the needed personal protective equipment for their work and replaced when damaged.\nCooperate with the safety committees in place to ensure the running of the safety programs in place.\nInvestigate unsafe actions and near-misses and profer corrective actions or corrections.\nConsult with workers and management on the best approach to deliver a safe working environment for all workers. \nEnsures that all employees abide by the health and safety rules existing in the workplace.\nTrains all workers in the emergency action plans in place \nEnsures that they conduct emergency drills at the workplace at specific times.\nSets up safety signs and signages at the designated place and ensures they are visible enough for all workers to see.\nEnsures that all injured personnel receives immediate treatment and attention and documents the report to the management.\nThe safety supervisor instructs all employees to inspect their tools daily and report the damaged ones to the appropriate channels for repairsSkills",
    "Skills": [
        "-Safety Regulations: A strong understanding of safety laws, regulations, and standards relevant to the industry, ensuring compliance and promoting a safe work environment.\nRisk Assessment: Ability to identify potential workplace hazards, conduct risk assessments, and develop strategies to mitigate risks effectively.\nEmergency Response: Knowledge of emergency response protocols and the ability to coordinate and manage responses during accidents, incidents, or crises.\nSafety Training: Designing and delivering safety training programs for employees, ensuring they are well-informed about safety protocols and best practices.\nIncident Investigation: Conducting thorough investigations into accidents, near misses, and safety incidents to identify root causes and prevent recurrence.\nCommunication: Clear communication skills to effectively convey safety procedures, policies, and guidelines to employees, management, and stakeholders.\nSafety Inspections: Conducting regular safety inspections and audits to identify potential hazards and areas for improvement."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}