{
    "Job ID": "4730541",
    "Description": "Job scope: Assist guests with luggage and place on assigned porter trolleys. Assist guests regarding the location of their terminal or flight schedule or any enquiries within the airportarea. Transport porter trolley as directed by the guests and the Meet & Assist Agent between, from or to thefollowing designated areas: Baggage Reclaim Hall in Arrivals, Drop-off Lanes and Check-in Counter inDepartures, Parking Area. Offer quality customer service to their guests. Provide general support to Meet & Assist Service Team on a range of daily operational tasks.Responsibilities: Greet, receive and bid farewell to guests in a professional manner. Provide porterage service to guests with baggage, whenever and wherever necessary, including but notlimited to loading and unloading baggage; transporting; placing baggage on airline check-in baggage belt; X-ray machine; identifying and collecting baggage from Baggage Reclaim Area. Handle guests’ baggage with care and efficiency. To possess basic knowledge in general information of the airport including facilities and their directions,flight schedules, etc. Determine the number of trolleys needed to carry baggage for the guest and inform additional charges toguest and service counter agent for proper handling. To ensure that proper cleaning procedures are adhered to and personal protective equipment (PPE) is wornat all times during the shift (where applicable). Employees are expected to follow all health and safetyregulations, enforced and updated by the company and local Airport Authorities.Skills",
    "Skills": [
        "Requirments:",
        " Baggage related experience in aviation or hospitality industry is highly preferable.",
        " Proficiency in English and local language, knowledge of other languages is a plus.",
        " Motivated, responsible, presentable and good communication skills.",
        " Positive attitude and a team player.",
        " Must be able to load and unload checked baggage, including oversized articles unassisted within baggage",
        "check-in and baggage reclaim area of the airport.",
        " Able to adhere to all safety requirements and applicable safety policies.",
        " Willing to work on Shift (rotational day/night and overnight shifts).",
        " Ability to work a flexible schedule with last minute schedule changes and overtime when required."
    ],
    "Preferred": {
        "Residence Location": "Abu Dhabi, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}