{
    "Job ID": "4730831",
    "Description": "We are looking to hire an Oncologist to work as radiation, paediatric, gynaecological, surgical or medical oncologists. The individual may be in charge of different duties. To diagnose cancer through different tests including CT scans, biopsies or MRI. Must be specialized on the surgical aspects to concentrate on performing surgeries in order to remove cancer tumors and prevent fatalities. Capable of offering radiation therapy to patients in order to shrink tumors or even eliminate the cancerous cells altogether. Radiation Oncologist Responsibilities: ●      Perform physical assessments to detect cancerous cells●      Develop treatment plans based on the nature of the cancer●      Carry out surgical procedures on the areas affected by cancer and cancer treatments●      Complete procedures such as mammograms and prostate exams that stop the malignancy from spreading.●      Provide treatment options such as chemotherapy or radiation therapy●      Collect medical information on patient histories●      Inform patients about the treatment options available for their cancer●      Provide support for cancer patients●      Carry out medical research Skills",
    "Skills": [
        "Radiation Oncologist Requirements:",
        " ",
        "●      Bachelor’s degree",
        "●      Specialization certificate in Radiation Oncology",
        "●      Completion of 3 years Residency program",
        "●      Up to 5 years of experience in the specialty field",
        "●      Must be licensed to practice",
        "●      Work with nurses and other healthcare professionals"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}