{
    "Job ID": "4730872",
    "Description": "Marketing Internship (Remote)We are seeking a motivated and creative Marketing Intern to join our dynamic marketing team. This internship offers a hands-on opportunity to gain valuable experience in various aspects of marketing, including social media management, content creation, and campaign coordination. The ideal candidate should be enthusiastic about marketing trends, possess excellent communication skills, and be eager to contribute to our overall marketing efforts.Responsibilities:Regularly create and curate engaging content for our social media platforms, including but not limited to Instagram and Tiktok\nSchedule and publish posts using social media management tools.\nCollaborate with the marketing team to develop social media strategies that align with company goals.\nIdentify potential content creators, influencers, and collaborators in the industry.\nMaintain a database of potential content creators and their contact information.\nCoordinate with various teams to ensure a consistent flow of content aligned with campaigns and promotions.\nStay updated with the latest marketing trends, industry news, and social media platform updates.\nProvide insights and recommendations based on market research to enhance our marketing strategies.Skills",
    "Skills": [
        "Current enrollment or graduated in a relevant degree program such as Marketing, Communications, Business, or a related field.\nStrong written and verbal communication skills with an eye for detail.\nFamiliarity with major social media platforms\nCreative thinking and the ability to generate engaging content ideas.\nWell-organized and capable of managing multiple tasks within deadlines.\nA proactive and self-driven attitude with the ability to work both independently and collaboratively.\nAn eagerness to learn and a genuine passion for marketing and staying up-to-date with industry trends."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Age": "Max: 26"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Internship",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}