{
    "Job ID": "4730300",
    "Description": "Our client is a Leading Company in Entertainment Industry. They are now looking for a Manager-Financial Reporting and Compliance to join them. Roles & Responsibilities:Ensure that the recording of day-to-day transactions and financial statements of the Group companies are in accordance with International Financial Reporting Standards (IFRS).\nCoordinating and providing all required document and information and liaison with external and internal auditors to ensure that the Group Audit activity is completed on time in accordance with the timelines agreed with different stakeholders.\nMonitor and update as and when needed the Group’s accounting principles and accounting policy manual in accordance with best practices.\nProactively research, resolve and document complex accounting issues, across all the Group’s business units, including the evaluation and implementation of any new applicable accounting pronouncements to ensure IFRS compliance.\nKeep abreast of changes in IFRS as well as local regulation and legislation etc.Salary:  AED 22000 - AED 23000Skills",
    "Skills": [
        "Preference:",
        "Must have experience in financial reporting under IFRS.\nMust Have experience in VAT implementation/management.\nMust have experience in managing the group audits, consolidation and reporting.",
        "Qualifications: ",
        "Bachelor’s Degree Preferred.\nExcellent command of both written and spoken English \nAdvanced knowledge of Microsoft Excel, Word and PowerPoint",
        "Benefits: ",
        "Air ticket\nInsurance\nEmployment Visa"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}