{
    "Job ID": "4730791",
    "Description": "We are looking for a compassionate Internist to provide long-term, comprehensive care to our patients and manage both common and complex diseases. You should be able to effectively diagnose patients and suggest a successful course of treatment. As an Internist you must be able to prescribe and administer medications, immunizations, and other non-surgical treatments. You should also be able to develop long-lasting, rewarding relationships with your patients. Job Responsibilities ●      Consulting with patients to understand their symptoms and health concerns.●      Diagnosing and treating acute illnesses, such as bacterial and viral infections, as well as chronic diseases and conditions, such as hypertension, heart disease, or diabetes.●      Prescribing or administering medication, therapy, and other specialized medical care to treat or prevent illness, disease, or injury.●      Explaining procedures and discussing test results or prescribed treatments with patients.●      Monitoring patients' conditions and progress, and re-evaluating treatments, as necessary.●      Providing health and wellness advice to patients, including diet, physical activity, hygiene, and disease prevention.●      Immunizing patients against preventable diseases.●      Maintaining detailed notes of appointments with patients, including comments, tests, and/or treatments prescribed, and test results.●      Referring patients to other medical specialists, when necessary.●      Providing support and advice to patients receiving long-term care.●      Preparing official health documents or records, when necessary.●      Conducting research into the testing and development of new medications, methods of treatment, or procedures to prevent or control illness, disease, or injury. Skills",
    "Skills": [
        "Required Qualifications and Skills:",
        " ",
        "●      Specialization degree and successful 5-years of residency",
        "●      Valid state licensure to practice",
        "●      Proven success with relevant procedures and treatments",
        "●      Compliance with all laws and hospital policies",
        "●      Minimum 3-5 years of experience in the specialty is preferred"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}