{
    "Job ID": "4730974",
    "Description": "MAIN PURPOSE OF JOBTo receive, store and control stock and delivery of materials to Project locations/Central Store facilities.JOB OBJECTIVESTo supervise material receipt, unloading and placement in assigned storage location.\nTo check material received quantities & specifications against order documents\nTo manage space and determine storage methods according to the manufacturer's guidelines and Company safety procedures.\nTo maintain stock level of materials to ensure continuous availability.\nTo maintain the filing system and stock records as per Company procedure.\nTo maintain supplies of materials, in compliance with storage safety regulations.\nTo issue or distribute materials, products, parts and supplies to customers or co-workers, based on Company procedure.\nTo recommend disposal of excess, defective or obsolete stock.\nTo control the fixed assets in the location assigned.SAFETY AND QUALITY RESPONSIBILITIESMaintain standards of safety and comply with Company’s Health, Safety and Environment Management System requirements.\nTake reasonable care of own health and safety and that of others in the workplace.\nFollow and maintain Company standards of Quality in accordance with Company Quality System requirementsSkills",
    "Skills": [
        "EDUCATION, SKILLS AND EXPERIENCE",
        "Bachelor degree in any discipline, Engineering back ground is preferable\n5 to 6 Years of work experience as a store keeper, preferably in oil & gas industry.\nQuantity measurements and conversions.\nMaterial Management Knowledge.\nComputer Literate."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}