{
    "Job ID": "4730341",
    "Description": "Liaison Coordinator Temporary roleCustomer Service & OperationsTo ensure accurate and prompt communication to internal and external customers to deliver the top-level logistics services as per the requirement of event participants.\nTo act as frontline representing the company in the best possible way.\nTo understand the customers by being aware of the different requirements, needs and services for each one.\nTo follow up requests and/ or problems that customers may experience and address.\nTo handle quotations to external customers and internal stations.\nTo be aware of services scope to be provided by company and offer relevant service solutions to customers and other stations considering their specific requirements (Service type, type of cargo, delivery requirements etc.)\nTo ensure that relevant customers are kept satisfied.\nTo coordinate with customs,sea freight, airfreight, warehouse and venue service team for the smooth handling of import and export shipments as per the customer demands\nTo check and confirm transport and customs documentation\nInvoice the provided services to customers\nTo be proactive in resolving  issues and problems before they occur by addressing requests to the internal departments and closely monitoring the respective tasks execution.\nTo handle customer complaints and claimSkills",
    "Skills": [
        "EDUCATION",
        "Minimum – Bachelor Degree / Diploma\nRelevant administration working qualifications\nAt least 2 years’ experience in the logistics industry\nSales background is advantage\nExperience with Microsoft Office Suite",
        "PROFESSIONAL EXPERIENCE",
        "Good communications skills both verbal and written\nOperational knowledge\nResults orientated\nOrganized\nAttention to Detail\nEnergetic\nTeam player\nAbility to work efficiently in high pressure environments\nExperience of working proactively to overcome operational challenges\nExperience of working to targets and deadlines.\nExcellent admin and organisational skills\nPositive & Self-motivated\nProblem solving skills\nExcellent collaboration and networking skills\nAbility to adapt to a fast paced constant change environment"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}