{
    "Job ID": "4730511",
    "Description": "Parisima Talent is hiring for the position of Sales Executive - Wholesale Channel with one of our clients.Our client is a leading multinational organization in construction and building material sectors.Position: Sales Executive - Wholesale ChannelJob location: Riyadh, Saudi ArabiaJob responsibilities:Business development in the wholesale channels through an intensive field presence: to grow the business and to sustain the market engagement in order to achieve the quarterly and the annual sales targets.\nMaximize and increase sales and margin whilst ensuring the company profile remains high across the relevant territory.\nWork closely with the dealers/partners and support in all the technical and commercials requests.\nDevelop and maintain strong relationships with wholesale customers, including distributors, wholesalers, and retailers.\nAttend needed Internal Sales calls or meetings and actively participate.\nEnsure a steady corporate reporting system is followed at all times.\nMake recommendations towards facilitating a more sustainable progress within the set sales strategy in order to maximize coverage, sales and increase market share.\nProvide exceptional customer service and support to wholesale customers, addressing their inquiries, concerns, and product-related issues in a timely manner.\nAct proactively with high level of credibility and responsibility towards management reporting.\nCollaborate with the marketing team to develop and execute effective sales and marketing campaigns targeted at wholesale customers.\nStay updated with industry trends, competitor activities, and market conditions to effectively position products and drive sales.    \nIdentify and target new business opportunities to expand the wholesale customer base.Skills",
    "Skills": [
        "Job specifications:",
        "Strong communication and socializing skills.\nBachelor’s degree in business administration/marketing.\n2+ years of building materials project sales experience.\nUnderstanding of local trade and market demands is important.\nAbility to multi-task and carry out multiple responsibilities.\nAbility to work and handle customers under stress and meet deadlines.\nWillingness to take on responsibilities, challenges and embrace team spirit as the most critical success factory notably with the distributors’ dominance."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}