{
    "Job ID": "4730910",
    "Description": "Position Title:             Marketing ManagerEmployment Type:     Full TimeSalary:                         up to 17K AED all-inclusive depending on experience and qualifications plus service charges, tips, and transportationJob Location:            Dubai, UAE About the Client:They stand as one of Dubai's esteemed 5-star hotels. Job Description:  Develop and execute comprehensive marketing plans, promoting the hotel’s offerings globally, including accommodation, dining, events, and facilities.\nLead digital marketing efforts, managing website, social media, email campaigns, and online advertising to maximize visibility and engagement.\nCollaborate with Sales to create targeted campaigns aligning with business goals, driving revenue growth.\nConduct market research, analyzing competitors and trends, identifying new opportunities.\nManage marketing budget, ensuring cost-effectiveness, and oversee events and partnerships to enhance reputation and guest loyalty.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Western, Eastern and CIS nationals\nFemale, 35 years old and below\nMust have at least 5 years of successful marketing management experience in the hospitality sector\nMust be an expert in comprehensive digital marketing, encompassing SEO, SEM, social media, email, and content strategies\nMust have strong experience in interpreting data and market trends for strategic decision-making\nMust possess marketing strategies differentiating the hotel from competitors, with proven budget management and F&B marketing proficiency",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}