{
    "Job ID": "4730876",
    "Description": "Position Title:            Commerce HeadEmployment Type:    Full TimeSalary:                        up to 40K SAR all-inclusive depending on experience and qualifications plus family benefitsJob Location:             Dubai, UAE/ KSAAbout the Client:They are one of the largest electronics and appliances retail companies in the region.Job Description:Create a KSA-specific, e-commerce strategy aligned with expansion objectives, pinpointing vital online platforms and digital channels for optimal brand visibility and audience engagement. Tailor the strategy to harness the potential of the KSA market while maximizing brand reach.\nDevise and execute brand-building strategies for robust online presence in Saudi Arabia, partnering with HQ Marketing to craft engaging campaigns and content tailored to the local audience. Drive brand awareness and engagement through effective online initiatives.\nDirect the choice and establishment of e-commerce platforms for an effortless Saudi Arabian online shopping journey, while supervising website design and enhancements to optimize conversions and customer contentment. Manage marketplace operations, online marketing, and platform modules encompassing listing, sourcing, fulfilment, and post-sales operations.\nExecute digital marketing campaigns for increased traffic and conversions, collaborating with Retail for seamless integration, and leveraging data analytics to track customer behaviour and generate actionable strategies. Ensure smooth order fulfilment and customer support by working closely with Finance and Operations and provide regular e-commerce performance reports for informed decision-making.\nLead and nurture a high-performing e-commerce team to drive growth and customer satisfaction while fostering an innovative and collaborative culture. Stay updated on e-commerce trends, digital technologies, and competition in Saudi Arabia, identifying opportunities and challenges to adapt strategies accordinglySkills",
    "Skills": [
        "Qualifications:",
        "Open to Saudian, Arabic, and Indian nationals\n40 years old and below\nBachelor’s Degree in Marketing, Business Administration, or any related field; Master’s Degree is a plus\nAt least 8 years of experience in E-commerce leadership roles, preferably within the Retail, E-commerce, or Marketplace sectors\nAdditional certifications relating to marketplace / e-commerce operations will be an added advantage\nMust have strong experience in digital product development and marketing\nStrong understanding of digital marketing, SEO, SEM, social media, and online advertising strategies"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Arab Countries; India; Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Internet & E-commerce; Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}