{
    "Job ID": "4730303",
    "Description": "Responsible for the maintenance, servicing and repairs for all equipment to ensure a safe operation. Focusing on repairs, construction, troubleshooting of the park rides and attractions and assist to establish preventive maintenance and inspection programs that maximise uptime and minimize cost. Maintaining the highest standards of safety on all rides and attractions. Perform daily safety checks on park attractions and rides and attend to any repairs. Communicate with the rides maintenance supervisor and operations team when equipment failures resort in attraction downtime or closures. Maintaining all appropriate documentation. Communicate with the rides engineering supervisor of any hazards that arises to ensure the safe completion of repairs.·        Maximise THRC for all equipment within the parks·        Perform preventive maintenance, repairs and overhauls on rides, equipment and facilities, ensuring complete compliance of the manufacturer’s specifications and park standards.·        Continually liaise with the manufacturers and vendors to ensure all the equipment are fully operational·        Effective servicing, preventive maintenance, annual testing and other programs are thoroughly carried out.·        Will always remain proactive towards making any necessary adjustments, ordering spare parts and identifying any problematic equipment.·        Ensure the Operations and Technical teams are operating all equipment safely and are always competent.·        Liaise with the teams for any quick services required under maintenance for Attractions and Buildings.·        Responding to all maintenance-related radio calls in a timely and appropriate manner.·        Communicate with the rides maintenance supervisor and operations team when equipment failures resort in attraction downtime or closures.·        Work with team members to ensure complete compliance of the manufacturer’s specifications and park standards.·        Maintaining all appropriate documentation.·        Communicate with the rides engineering supervisor of any hazards that arise to ensure the safe completion of repairs.·        Assist the parks Technical Services team with projects as needed.Any other duties as may be reasonably requested by the ManagementSkills",
    "Skills": [
        "Essential",
        "·        Must be able to troubleshoot clearly, calmly and safely in the presence of guest and fellow team members.",
        "·        Understanding/Maintaining of Electrical and Mechanical system",
        "·        Understanding/ Maintaining Hydraulics / Pneumatics",
        "·        Must possess strong safety sensitivity and ability to work with many different types of mechanical devices.",
        "·        Be a proactive member of the rides engineering team.",
        "·        Must be able to work varied shifts, including holidays and weekends",
        "Desirable",
        "·        Understanding/Managing heavy / light equipment",
        "Essential",
        "·        Worked in a theme-park environment, minimum 2 years",
        "·        Worked in a building facilities environment, minimum 2 years",
        "·        Worked in a system integration environment, minimum 2 years",
        "·        Worked in a plant environment, minimum 2 years",
        "Desirable",
        "·        Worked as an installer or service provider or maintaining of rides and attractions",
        "·        Worked as an installer or service provider or maintaining of systems integrations"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}