{
    "Job ID": "4730880",
    "Description": "Position Title:             Finance HeadEmployment Type:     Full TimeSalary:                        up to 45K AED, all-inclusive depending on experience and qualifications, plus family benefitsJob Location:            Dubai, UAE About the Client:They are one of the largest electronics and appliances retail companies in the region Job Description:Create a holistic financial strategy in line with KSA expansion goals, encompassing forecasts and risk management, while providing continuous evaluation and adjustments to plans for optimal financial outcomes and Senior Management guidance.\nLead commercial strategy development and execution for revenue growth and market expansion, guiding local Category teams in pricing, assortment, and promotions while ensuring smooth cross-functional collaboration, vendor negotiations, and contract oversight.\nOversee financial operations, including budgeting, cash flow, and reporting, while ensuring regulatory compliance, effective payables/receivables management, and implementation of necessary financial controls. Monitor performance, analyse variances, and take corrective actions as required.\nCreate and guide a successful finance and commercial team for KSA expansion, promoting a collaborative, innovative, and results-driven atmosphere aligned with the values of the company. Provide leadership that emphasizes trust, customer focus, and employee well-being.\nWork closely with internal HQ stakeholders and external partners in Saudi Arabia, ensuring communication alignment.\nEstablish a strong local presence by engaging with authorities and industry bodies, while implementing risk mitigation and adapting strategies based on geopolitical and economic changes. Skills",
    "Skills": [
        "Qualifications:",
        "Open to Indian, Saudian, and Arab nationals\nMale, 40 years old and below\nDegree in Finance Stream; MBA Finance / CA is preferred\nMust have at least 10 years in a senior finance and commercial leadership role, preferably within the retail or consumer goods sector\nMust have in-depth understanding of Saudi Arabian business regulations, tax laws, and market dynamics\nMust have financial acumen and experience in financial planning, analysis, and reporting with the use of of S4HANA (SAP) and MS Office",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Gender": "Male",
        "Nationality": "All Arab Countries; All GCC Countries; India",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}