{
    "Job ID": "4730236",
    "Description": "Drafting and Design: Create detailed technical drawings, plans, and diagrams based on specifications provided by architects, or interior designers. However, the knowledge in architectural, mechanical, electrical, structural, or civil engineering drawings is mandatory. CAD Software Operation: Utilize computer-aided design (CAD) software, such as AutoCAD, SolidWorks, Revit, or similar tools, to produce accurate and precise drawings. Proficiency in CAD software is essential to efficiently generate and modify designs.Accuracy and Precision: Ensure the accuracy and precision of all drawings by meticulously following design guidelines, industry standards, and project specifications. Draftsmen are responsible for translating ideas into highly accurate representations.Dimensioning and Annotations: Apply proper dimensioning, annotations, symbols, and notes to drawings to convey important information to engineers, manufacturers, and construction teams. This aids in clear communication and seamless execution of projects.Collaboration: Work closely with architects, interior designers, and project managers to understand project requirements, make revisions, and incorporate feedback into drawings. Effective communication is key to producing drawings that align with project objectives.Revision Management: Keep track of revisions and updates to drawings throughout the design and development process. Maintain organized records of versions to ensure that the latest information is readily available.Technical Documentation: Assist in the preparation of technical documentation, such as material lists, bills of quantities (BOQs), and assembly instructions, to support manufacturing and construction processes.Quality Control: Conduct thorough reviews of your own work to identify potential errors or inconsistencies in drawings. This ensures that final drawings meet quality standards and are ready for use by various stakeholders.Continual Learning: Stay up-to-date with industry trends, software advancements, and changes in drafting and design standards to enhance your skills and contribute to the efficiency of the design process.Adherence to Regulations: Ensure compliance with relevant building codes, safety regulations, and industry standards when creating drawings for construction and engineering projects.Skills",
    "Skills": [
        "Proficiency in computer-aided design (CAD) software, such as AutoCAD, SolidWorks, Revit, or similar tools.\nStrong attention to detail and a keen eye for accuracy.\nSolid understanding of drafting techniques, technical drawing conventions, and industry standards.\nKnowledge of relevant engineering disciplines (e.g., mechanical, electrical, civil) is advantageous.\nAbility to interpret engineering sketches, specifications, and design concepts.\nExcellent communication skills for effective collaboration with cross-functional teams.\nProblem-solving skills to address design challenges and optimize drawings for practical implementation.\nTime management skills to meet project deadlines and handle multiple tasks simultaneously.\nAssociate degree or vocational training in drafting, engineering. Architectural or Interior design degree is typically preferred."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}