{
    "Job ID": "4730448",
    "Description": "Summary of Position:To ensure that cleanliness and condition of each assigned area meets designated standards.Identify and report preventative or other maintenance issues. Request preventative maintenance ornon-urgent repairs using appropriate method. Contact other departments directly for urgent repairs.Clean, maintain, and store cleaning equipment, chemicals. To ensure adequate stock of all relatedsupplies. Document and report outstanding issues. Complete required housekeeping checklist andforms.Duties & Responsibilities:Assist guests in a friendly manner.\nVisit guests' toilets regularly, with visits taking place every 15 minutes.\nCarry out all cleaning duties in the shower rooms, toilets, suite rooms, massage rooms, and other areas indicated by the manager.\nReplenish guest amenities, toiletries, and towels in a timely manner.\nEnsure sufficient stock levels of amenities and toiletries are available, ensuring proper storage.\nEmpty and clean all litter bins regularly.\nEnsure the services, hygiene, cleanliness, and tidiness of the Lounge achieve total customer and manager's satisfaction and meet company standards.\nMaintain perfect personal hygiene and grooming as per company standards.\nUse cleaning products in a safe manner and ensure MSDS file/folder is kept correct and up-to-date.\nFollow standard cleaning and sanitizing procedures, including the use of equipment.\nHealth & safety in the workplace, including Control of Substances Harmful to Health (COSHH).\nAble to work individually and as part of a team.\nReport any damage or breakages to your supervisor at huddle meetings so that necessary repairs can be carried out.\nAlways keep public areas clean and tidy.\nBe considerate of guests' presence while cleaning or attending to ad-hoc tasks.\nConduct regular day-end and deep cleaning, including high dusting and detailed floor cleaning for both carpets and solid surfaces.\nReport in a timely manner if cleaning equipment and stock are running low.\nObserve, act, and/or report rodent and pest control issues.\nLearn and follow procedures for linen, security, keys, lost property, and stock.\nWork as part of a team, helping others out when required, and completing all tasks assigned by the manager in charge.\nAny other related duties assigned by direct superior.Skills",
    "Skills": [
        "- Previous experience within a position in the hotel/hospitality sector",
        "- Excellent interpersonal and presentation skills",
        "- Able to build and maintain relationships with internal and external guests",
        "- Eager to learn, positive and energetic personality",
        "- Be organized and motivated",
        "- Able to remain calm under pressure",
        "- Possess a fair command of English and have fair communication skills, both written and verbal",
        "- Able to work flexible hours",
        "- Punctuality and regular and reliable attendance.",
        "- Honesty and Integrity",
        "Health &amp; Safety:",
        "______________________________________________________________________",
        "It is everyone’s responsibility to follow Health Safety guidelines and report any issues to",
        "their manager or Health &amp; Safety Officer.",
        "Customer Service:",
        "______________________________________________________________________",
        " It is everyone’s responsibility to follow the Plaza philosophy and our three values, Service",
        "Excellence, Innovation and Teamwork to ensure that every guest leaves satisfied.",
        " Your shifts will be agreed with your manager based on your contract of employment.",
        " You may be asked to work in another Plaza location at any time without previous",
        "defined notice"
    ],
    "Preferred": {
        "Residence Location": "Abu Dhabi, United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Cleaning Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}