{
    "Job ID": "4730985",
    "Description": "Role:The Senior Internal Auditor is responsible for the overall execution and control of internal audit reviews and assignments consistent with the purpose, authority and responsibilities defined in the Company's charter.Duties and responsibilities:To conduct the audit assignments independently with minimum guidance and the ability of highlighting the inappropriate controls in the processes using ROOT CAUSE ANALYSIS technique and to draft the audit findings (observation\nComply to IPPF, Code of Ethics and all approved house Internal Audit methodologies.\nAnticipate emerging issues through research and interviews and decide how best to deal with them\nIdentify major risks and non-ethical business practices across business units\nPerform business cycles understanding and documentation i.e. document internal controls design.\nConsolidate data and perform analysis to assist the Internal Audit Manager in creating annual Audit Projects and Risk-Based Internal Audit Plan\nConduct meetings with auditees/ process owners (kick-off and closing meetings)\nAttend Pre-Audit , Audit and Post Audit meetings with all relevant functions during internal audit reviews\nPlan Internal Audit Reviews in advance to ensure that the auditee has a clear understanding of the purpose and scope of work, proper resources are allocated, auditors are briefed and adequate time is allocated for all audit stages\nDevelop and update Audit Programs having top management approval on scope of work\nSupervise and participate in different types of internal audit reviews (financial, operational, compliance, environmental) to appraise financials controls, reporting systems, and compliance processes, etc.\nExecute audit procedures to review and appraise the soundness, adequacy and effectiveness of the control environment\nResponsible for the development of Internal Audit Reports, and ensuring that all recommendations made are relevant, value-adding and supportable\nEvaluate the company’s financial actions and policies in reflection to its intentions and make judgment calls to improve the Company's trajectory if needed\nCommunicate with other departments to verify records and confirm the Company's policies\nOrganize and present meaningfully detailed reports to communicate the results of an audit to company management having reports with suggestions for changes in policy\nFollow-up on the status of previously raised Internal Audit Findings\nProvide on-the-job training for developing internal audit skills of junior staff\nComplying with Health, Safety and Environment regulations and working practices of ALNASSER and the country of my operation when carrying out duties.\nExecute Management directives when required.Skills",
    "Skills": [
        "3-5 Years Professional Experience\nBi-lingual English / Arabic (both required)\nBachelor’s Degree in Accounting, Finance or Business Administration\nCIA certified is preferred\nFashion Retail Background with ability to execute audit assignments according to the available man-days plan and develop Audit program / RCM (Risk control Matrix) within a defined audit scope. Carry out risk assessment methodology and practice Report writing / data analytics / communication skills given a solid proficiency in MS office (Excel, word, PP)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Nationality": "India; Pakistan; Philippines",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}