{
    "Job ID": "4730695",
    "Description": "Coordinator - Prince Turki Center for Creativity and EntrepreneurshipProgram Coordination: Successfully plan, manage, and implement various programs and initiatives offered by the Prince Turki Center, including workshops, conferences, mentoring programs, and startup accelerators.\nCollaboration and Partnership: Identify, establish, and maintain partnerships with relevant organizations, institutions, and industry experts to enhance program offerings and drive collaboration in the entrepreneurship and creative sectors.\nOutreach and Networking: Actively engage with diverse stakeholders, including entrepreneurs, artists, educators, and government agencies, to promote activities of the Prince Turki Center.\nEvent Planning and Execution: Organize and oversee events, both on-site and off-site, ensuring seamless logistics, participant registration, marketing, and post-event evaluation.\nAdministrative Support: Assist in administrative duties to support the effective functioning of the Prince Turki Center.\nData Management: Maintain accurate and up-to-date records of program participants, partners, and stakeholders utilizing effective dashboard.\nCommunication and Documentation: Prepare and distribute communication materials, including newsletters, reports, and website content, to highlight the achievements and impact of the Prince Turki Center.\nMonitoring and Evaluation: Conduct regular assessments and evaluations to measure the effectiveness and impact of the programs, seeking continuous improvement opportunities.Skills",
    "Skills": [
        "Bachelor’s degree in Business Administration, Marketing, Event Management, or a related field.\nProven experience (1-2 years) in coordinating events, programs, or projects.\nExcellent organizational skills\nStrong interpersonal and communication skills\nProficiency in Microsoft Excel\nKnowledge of the entrepreneurship and creative sectors in Saudi Arabia is preferred.\nAbility to work independently, taking initiative while also being a collaborative team player.\nFluent in Arabic and English, both spoken and written."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Scientific Research & Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}