{
    "Job ID": "4730986",
    "Description": "Role:The Internal Auditor is responsible for the overall execution of internal audit reviews and assignments consistent with the purpose, authority and responsibilities defined in the charter.Duties and responsibilities:Conformance to IPPF, Code of Ethics and the in-house Internal Audit Methodology in place\nConducting the audit field work and to be responsible for the data gathering phase as well as drafting the process understanding / notes.\nAnalyzing the daily expenses vouching process which shall be introduced as a part of the overall expenditure control.\nAnticipate emerging issues through research and interviews and deciding how best to deal with them\nIdentify major risks and non-ethical business practices facing the company\nPerform business cycles understanding and documentation i.e. document internal controls design.\nGather data and perform analysis to assist the Internal Audit Manager in the development of Audit Universe and the Risk-Based Internal Audit Plan\nConduct meetings with auditees/ process owners (kick-off and closing meetings)\nParticipate in different types of internal audit reviews (financial, operational, compliance, environmental) to appraise financials controls, reporting systems, and compliance processes, etc.\nSupport in the development of Internal Audit Reports, and ensuring that all recommendations made are relevant, value-adding and supportable\nFollow-up on the status of previously raised Internal Audit Findings\nSubmit on-going status updates to the senior-in-charge on the current progress of internal audit reviews being performed\nComplying with Health, Safety and Environment regulations and working practices of ALNASSER and the country of my operation when carrying out duties.\nExecute management directives when requiredSkills",
    "Skills": [
        "1-3 Years of Professional Experience\nBi-lingual English / Arabic (Required)\nBachelor’s Degree in Accounting, Finance, or Business Administration\nWorked in Audit Firm as an Internal Auditor (Not External Auditor), hands on Data analytics / communication skills, and Proficiency in MS office (Excel, word, PP)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 4",
        "Residence Location": "Kuwait",
        "Nationality": "India; Pakistan; Philippines",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}