{
    "Job ID": "4730230",
    "Description": "Job ObjectiveA warehouse specialist contributes to the success of the entity though managing the daily procedures and functions of the warehouse efficiently and effectively.Key ResponsibilitiesControl the process of unloading the trucks in the warehouse.\nAfter the offloading of each batch make a report of shortages/damages/ poor wrapping/ any other issues.\nControl the loading of daily orders from the warehouse (check the product that is being loaded in terms of pallets’ wrapping/damaged goods on the pallets, etc.,).\nControl the loading of daily orders from the warehouse according to the FEFO principle by daily reconciliation of stock reports of the warehouse and SAP.\nControl the complete loading of products from the warehouse in accordance with orders for the day.\nControl the damaged and near expiry stocks.\nControl stock replenishment.\nControl the timely delivery of vehicles to the warehouse for daily loading.\nProvide the daily report (dispatch report) to the transportation companies and warehouse on loading the goods for tomorrow.\nBook the trucks for deliveries (in case the delivery is on ad-hoc basis).\nFollow up on daily deliveries.\nControl the returns from the customers.\nPlan the routes in software.\nControl that all invoices are signed by the customers at the moment of delivery.\nCollect the invoices after the deliveries.\nControl timely receipt of primary documentation from transport companies (scanned copies of documents on a daily basis).\nAssist in solving issues arising in the course of daily activities (formation of orders, shipment from the warehouse, delivery to the point.Skills",
    "Skills": [
        "Behavioral competencies",
        "Teamwork\nFlexibility\nEmotional Smartness\nEffective follow-up to close tasks\nTeamwork\nGood communication skills\nFocus on results\nIndependence within the scope of work ",
        "Problem Solving",
        "Skills\nUsing Excel\nAttention to details.\nThe ability to work under pressure and handle challenges of work.\nComputer use skills and applications.\nKnowledge of Arabic and English discipline.\nCommitment\nConcentration / Professional appearance"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Gender": "Male",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}