{
    "Job ID": "4730924",
    "Description": "·  Assist in identifying and evaluating the organization’s risk areas and provides input to the development of the annual audit plan based on the output of a professional evaluation of internal controls.· Performs audit procedures as per audit programs, including identifying significant reportable issues based on relevant & sufficient documented audit evidences to support effective audit reports.· Adding value by providing practical recommendations in line with the goals & objectives of the organization.·  Conducts interviews, reviews documents, develops and administers surveys, composes summary memos, and prepares working papers to support the issues to be included in the audit report.· Identifies, develops, and documents audit issues and recommendations using independent judgment concerning areas being reviewed.· Communicates or assist in communicating the results of audit and consulting projects via written reports and oral presentations to management. and the board of directors.· Develops and maintains productive client and staff relationships through individual contacts and group meetings.· Pursues professional development opportunities, including internal and external training and professional association memberships, and shares information gained with co-workers.· Represents internal audit on organizational project teams, and at management meetings when required.· Performs related work as assigned by audit managementSkills",
    "Skills": [
        "·  Knowledge of and skill in applying internal auditing and accounting principles and practices, and management principles and preferred business practices. ",
        "·  Knowledge of the Standard for the Professional Practices of Internal Auditing and Code of Ethics developed by the Institute of Internal Auditors.",
        "·  Knowledge of management information system terminology, concepts, and practices.",
        "·  Knowledge of industry program policies, procedures, regulations, and laws.",
        "·  Skill in conducting quality control reviews of audit work products.",
        "·  Skills in collecting and analyzing complex data, evaluating information and systems, and drawing logical conclusions.",
        "·  Skill in planning and project management, and in maintaining composure under pressure while meeting multiple deadlines.",
        "·  Skill in negotiating issues and resolving problems.",
        "·  Skill in effective verbal and written communications, including active listening skills and skill in presenting findings and recommendations.",
        "·  Ability to establish and maintain harmonious working relationships with coworkers, staff, and external contacts, and to work effectively in a professional team environment"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 12",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}