{
    "Job ID": "4730490",
    "Description": "Our client is a reputed Insurance house that provides insurance services to GCC individuals/corporations is based the Kingdom of Bahrain.POSITION OPEN: TECHNICAL & GENERAL INSURANCE MANAGER (Bahrain)Oversee the technical operations of the insurance department, including underwriting, risk assessment, claims processing, policy issuance, and reinsurance.\nDevelop and implement underwriting guidelines and policies to ensure consistent and accurate risk evaluation.\nCollaborate with actuaries and analysts to evaluate pricing strategies and market trends for various insurance products.\nLead a team of insurance professionals, providing guidance, training, and performance evaluations to ensure high-quality service delivery.\nManage and mitigate risk exposure by analyzing and interpreting data related to claims, losses, and other relevant metrics.\nEstablish and maintain relationships with reinsurance partners, negotiating terms and coverage agreements as needed.\nStay updated on industry regulations, market trends, and emerging technologies to drive innovation and adapt to changing market conditions.Skills",
    "Skills": [
        "Insurance Professional with experience in:",
        "Reinsurance / Portfolio Management / Underwriting / Risks / Treaty terms and conditions",
        "Liaising experience with local and international insurance market segments, lawyers, agents/brokers.",
        "SKILLS:",
        "Excellent in verbal/written communication / an independent negotiator & decision maker / management capabilities / willingness for change to new concepts & ideas to grow / Team lead & a target achiever.",
        "MUST HAVE:",
        "10+ years of work experience in reputed Insurance companies",
        "A degree plus professional qualification in Insurance",
        "NOTE:",
        "Arabic language will be an advantage."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Bahrain",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}