{
    "Job ID": "4730808",
    "Description": "We are looking for a knowledgeable urologist to provide specialist care for urinary tract conditions as well as conditions affecting reproductive organs. The urologist's responsibilities include treating patients who have problems with their kidneys, adrenal glands, and bladders Urologist duties and responsibilities ●      Examining, diagnosing, and treating patient conditions and disorders of the genitourinary organs and tracts.●      Documenting and reviewing patients' histories.●      Ordering, performing, and interpreting diagnostic tests.●      Using specialized equipment, such as X rays, fluoroscopes, and catheters.●      Performing abdominal, pelvic, or retroperitoneal surgeries when necessary.●      Treating lower urinary tract.●      Prescribing and administering antibiotics, antiseptics, or compresses to treat infections or injuries.●      Providing Urology consultations or referring patients to specialists.●      Directing nurses, residents, or other staff. Skills",
    "Skills": [
        "Urologist requirements and qualifications",
        " ",
        "●      A Medical degree and the successful completion of a residency and fellowship in urology.",
        "●      A state license and certification to practice urology.",
        "●      The ability to keep updated on the latest medical technologies.",
        "●      The flexibility to work irregular hours and remain on emergency call.",
        "●      Strong decision-making, problem-solving, and analytical skills.",
        "●      Good communication and interpersonal skills.",
        "●      Good team working, leadership, and organizational skills.",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}