{
    "Job ID": "4730056",
    "Description": "Primary Duties :Assists with the administration of the day-to-day operations of HR functions and duties and carries out responsibilities in all the following functional areas:Recruitment, training and development,\nPayroll and benefits, Employee Relations and the organization and electronic system for human resources (MenaITech).\nProvides administrative support to all company team in all personnel matters and prepare payroll.Duties and Responsibilities :Inputting, following ups and maintaining employee’s information by entering and updating employment and their status in all HR systems.\nEffective assistance in the employment file in terms of searching and communicating to obtain the best candidates according to the job need, then coordinating to conduct personal interviews. Then preparing job offers.\nCompleting the hiring requirements and preparing work contracts and the necessary forms for this, ending with the entry of employees into the monthly Payroll movement.\nFollowing employment contract of employees, checking the expiry dates, and do the necessary action towards the decision of renewal or not.\nUpdating the organizational structure of the head office and other branches and working to update it on an ongoing basis.\nResponsibility for the social insurance file, registering and excluding employees according to the system, then obtaining the monthly invoice, following up the payment. procedures, and preparing and sending the monthly insurance movement report to the HR manager.\nIssuing employees letters such as introductions, Promotions, adjustment, transferring, disciplinary actions, notice of termination, suspension, and others.\nCompleting all types of employee leave procedures and the consequent visas and payment of wages until the employee returns to work.\nPreparing all required documents related to Business trips and coordinating with travel agencies for ticket and hotel booking and paying the per diems.\nProviding salary information through attendance and departure records and completing the procedures for entering any increases or deductions that affect the Monthly Payroll.\nContinually assists with roles and responsibilities as related to the Employee Services engagement program.\nIssuing contract annexes to expatriate employees in accordance with the expiry date of the work permit and then doing what is necessary to change the expiry date in the (MenaITech).\nUsing QIWA to do transfer expats services to Prestige company.\nUploading documents through the Chamber of Commerce portal for getting electronic attestation and verifying the wallet balance t, while retaining the original files for reference when needed.\nResponsibility for preparing and follow-up of all the procedures of the end-of-service employees, whether resigned, dismissed, or even those whose contracts have ended, to calculate their dues, prepare experience certificates, transfer their sponsorships, etc\nVisiting the company’s branches once a month and determining the extent of employees’ satisfaction with the environment, place, working hours, weekends and the way employees are assigned to overtime, as well as the way supervisors and managers deal with, and their sense of their importance and status, and what are the improvement proposals. Then share this report with the HR Manager.\nFollow ups the required report or tracking and keep it in updating status.\nPromote effective work practices, work as a member of the team, and cover colleagues' vacation periods in whatever tasks may be assigned to.\nSaving all documents in their specific files and maintaining the files in the proper situation.\nReceiving employees’ issues thru paper, emails, phone calls …. etc.\nCompletes special projects regarding various issues as needed.\nAny tasks that may be required of him/her in the future and that is within his/her qualifications, experience and capabilities, and that falls within the tasks of the human resources department.Skills",
    "Skills": [
        "Communication Skills: Clear and effective communication is essential for interacting with employees, management, and external stakeholders. HR Coordinators should have strong verbal and written communication skills.\nOrganizational Skills: HR Coordinators need to manage multiple tasks, deadlines, and priorities. Strong organizational skills are crucial for maintaining HR records, scheduling interviews, and coordinating various HR activities.\nAttention to Detail: Accurate data entry, record-keeping, and documentation are vital in HR. HR Coordinators must pay attention to details to ensure compliance and accuracy.\nProblem-Solving: HR Coordinators often handle employee inquiries and resolve issues. Strong problem-solving skills help them find solutions and address concerns effectively.\nInterpersonal Skills: Building relationships and working collaboratively with employees, managers, and colleagues is important. HR Coordinators should have good interpersonal skills to create a positive work environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}