{
    "Job ID": "4730308",
    "Description": "About the RoleWe are looking for a team of strong Business Development Representative to drive our business forward at this exciting time. Reporting into the Global Head of Business Development Representatives, you’ll work closely with the other BDRs, Account Executives and the broader Sales Operations team to increase Business. You will achieve this through acquiring new private & public sector customers.About the jobAs a Business Development Representative, you will be instrumental in customer acquisition for Business within the market.What you'll doBe responsible for generating revenue pipeline through outbound prospecting (cold calls/emails)\nBuild territory plans based on geography, industry, size etc.\nIdentify new business opportunities, prospect the right decision makers within a business.\nYou will be responsible for scheduling a Discovery Calls to qualify the prospect in/out using BANT, and schedule a follow up call/meeting for the Account Executives.\nMeet or exceed all assigned activity and pipeline creation targets.\nBring an innovative approach to prospecting and acquisition, with a customer-oriented mindset.\nWork with the Account Executives and Sales Managers within your region to develop and iterate on a prioritization model, operational infrastructure, and internal tools and processes.\nCommunicate effectively and efficiently via phone, email, video conferencing and in-person meetings.Skills",
    "Skills": [
        "Qualifications",
        "Bachelor's degree or equivalent\nMinimum 12 months of B2B sales/business development experience is required.\nA history of consistently exceeding KPIs and activity targets.\nExcellent communication and interpersonal skills, with the ability to obtain the necessary information from the prospect, while also ensuring a mutually beneficial conversation.\nTo be driven and excited about a fast-paced team environment.\nExcellent organization, project management and time management skills, and ability to take initiative.\nAdvanced proficiency in Arabic and English.\nSalesforce is a plus!"
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Nationality": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}