{
    "Job ID": "4730367",
    "Description": "Sales Manager (GCC)Are you tired of the typical corporate approach? Are you hungry for new opportunities?Are you open-minded and up for the challenge to bring ideas to life?Are you ready to get your hands dirty?HYPE is a functional drinks brand that was first launched in 1994 by Hard Rock Cafe founder Barry Cox. The current CEO, former international Sportsman, Formula One racing driver and 24 Hours of Le Mans winner, Mr. Bertrand Gachot, has been involved with the brand since 1997.HYPE is at the forefront in expanding its innovative functional products portfolio. The company is rapidly growing and looking for reliable, pro-active and outgoing individuals to join its dynamic team.AsSales Manager (GCC) your tasks will be as follows:Map potential customers and generate new leads and business opportunities for the organisation.\nMaintain and grow sales within existing countries of distribution, together with local partners. \nBuild and improve long-term relationships with customers.\nDevelop and execute strategic sales plan: annual sales forecast and regular reviews.\nDefine price strategy as per Management’s and CFO's input and create tools to keep pricing consistency.\nIdentify opportunities for sales process improvement. \nFollow up leads status and negotiations with new partners, or renewal of agreements, market visits.\nSupport customers, including preparation of contracts (EDA's, NDA's, Commission Agreements) & product registration processes, as well as daily customer problem solving with the support of Sales Administrators.\nDevelop and oversee implementation of sales analysis tools, or shared tools with other departments.\nWork with Trade - and Marketing team on the development of trade marketing and marketing tools.\nWork collaboratively with Innovation, Supply Chain & Marketing departments on product trends, competitor analysis, customised sales strategy per country of distribution.Skills",
    "Skills": [
        "Requirements:",
        "-Experience in food & beverage and/or inFMCG and sales of branded products.",
        "-Outstanding listening, negotiation, presentation and organisational skills.",
        "-Open-minded, diligent, concise, solution-driven, results oriented, with TEAM WORK attitude",
        "-Availability to travel and socialise with people from different backgrounds and cultures.",
        "-Used to work in B2B complex sales projects, with focus on building long term partnerships.",
        "-Excellent English & native Arabic skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}