{
    "Job ID": "4730585",
    "Description": "NOTE: The contract will be until March 2024-(renewable) - depending on the project scope & performance.Yearly Vacation - 21 Days paid leave after completion of 12mos/1 yr and a round trip ticket after 2 yrsEnd of Service - 3 weeks fixed basic salary for every yr (applicable after completion of 1yr)As a Business Psychologist at our recruitment agency in Doha, Qatar, you will be responsible for applying psychological principles and techniques to help organizations improve their performance and enhance the well-being of their employees. You will work closely with clients to understand their specific needs and develop strategies to address them. This role requires a deep understanding of human behavior, organizational dynamics, and the ability to apply psychological theories and methodologies in a business context.Responsibilities:Conduct assessments and evaluations to identify individual and organizational needs.\nDesign and implement training programs to enhance employee performance and development.\nProvide coaching and counseling to individuals and teams to improve their effectiveness.\nDevelop and implement talent management strategies, including recruitment, selection, and retention.\nConduct research and analyze data to provide insights and recommendations for organizational development.\nCollaborate with clients to design and implement organizational change initiatives.\nProvide guidance and support to managers and leaders on employee engagement and motivation.\nFacilitate workshops and group interventions to improve team dynamics and collaboration.\nStay updated on the latest research and trends in business psychology to ensure best practices.\nBuild and maintain relationships with clients to understand their needs and provide ongoing support.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Master's degree in Business Psychology or related field.\n5-10 years of experience in a similar role, preferably in a consulting or corporate environment.\nStrong knowledge of psychological theories and methodologies applicable to business settings.\nExcellent analytical and problem-solving skills.\nAbility to communicate complex concepts effectively to different stakeholders.\nStrong interpersonal skills and ability to build rapport with clients.\nExperience in conducting assessments and evaluations.\nProficient in data analysis and interpretation.\nAbility to work independently and manage multiple projects simultaneously.\nFluency in English, both written and spoken.",
        "Requirements: Master's or Ph.D. in Business Psychology, Industrial-Organizational Psychology, Human Resources, or related field. Proven experience in talent assessment, internal mobility, or organizational development. Strong understanding of industry trends in competency-based interviewing and psychometric assessments. Knowledge of various psychological assessments and tools commonly used in talent evaluation. Excellent analytical skills with the ability to interpret data and make data-driven decisions. Exceptional communication and interpersonal skills to engage with employees at all levels. Ability to maintain confidentiality and handle sensitive information with discretion. Proactive, self-motivated, and able to work independently and as part of a team. This role offers an exciting opportunity to play a pivotal role in nurturing internal talent, contributing to the company's growth and fostering a dynamic and inclusive work environment"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Airlines",
        "Company Type": "Recruitment Agency",
        "Job Role": "Training and Development",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "$5,000 - $6,000",
        "Number of Vacancies": "1"
    }
}