{
    "Job ID": "4730716",
    "Description": "On behalf of a Fortune 500 company, we are seeking an Information Technology (IT) Director for their Riyadh headquarters. A minimum of 15 years of hands-on experience in progressively senior IT roles, demonstrating expertise in strategy development, implementation, and executionOversee IT operations, supervise systems and IT staff.\nDevelop, implement, and evaluate IT projects in line with organizational objectives\nDevelop a strategy as it relates to the organization's IT infrastructure (computer and information systems, security, communication systems).\nDevelop, manage, and track the IT department's annual budget.\nConsult senior-level stakeholders across the entire organization to identify business and technology needs and optimize the use of\nEnsure smooth delivery and operation of IT services by monitoring systems performance.\nCreate processes and standards for selection, implementation, and support of systems.\nProvide direction, guidance, and training to IT staff\nEnsure the maintenance of current projects and technology systems.\nIdentify vulnerabilities, the need for upgrades, and opportunities for improvement.\nPropose strategic solutions and recommend new systems and software.\nBuild and maintain relationships with external advisors and vendors.\n Develop information technology strategies and services in line with the organisation's overall strategy and objectives.\nDesign, develop, implement and coordinate systems, policies and procedures.\nSafeguard the organization's data with adequate cyber-security measures.\nWork as a bridge to solve critical problems of important individuals within the organization through prompt address all of the issues.Skills",
    "Skills": [
        "Bachelor's degree in Information Technology, Computer Science, Information Systems, or a related field.\n8+ years of experience working in IT operations, supervising technology teams, and overseeing large information technology projects.\nExcellent understanding of computer systems, security, network and systems administration, databases and data storage systems, and telecommunications systems.\nStrong knowledge of project management principles.\nOutstanding leadership skills, a commendable track record, and an exceptional grasp of cutting-edge technologies.\nProfound knowledge and experience in project management, aligning IT endeavors with business goals and achieving measurable outcomes.\nDemonstrable competency in enterprise-wide system implementation and integration, cybersecurity, cloud computing, and data governance.\nStrong leadership capabilities with the ability to motivate and mentor teams, fostering a collaborative work environment.\nExcellent communication skills, both written and verbal, to effectively liaise with stakeholders at all levels of the organization."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 16",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 42"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}