{
    "Job ID": "4730788",
    "Description": "We are looking for a knowledgeable ophthalmologist to be responsible for repairing traumatic eye injuries, diagnosing eye ailments, and prescribing medications. The ophthalmologist's responsibilities range from simple duties, such as prescribing corrective lenses, to performing highly advanced duties, such as keyhole or laser surgery to join our team of specialists. Ophthalmologist duties and responsibilities ●      Providing routine care such as vision testing and prescribing glasses and contact lenses.●      Performing corrective surgeries, such as repairing injuries and corneas, and removing cataracts.●      Performing advanced surgical procedures, such as keyhole or laser surgery.●      Diagnosing and treating eye diseases and injuries.●      Managing emergency eye clinics, outpatient clinics, or other specialist eye clinics.●      Treating medical disorders that affect the vision through a holistic approach.●      Using therapeutic procedures and performing biopsies. Skills",
    "Skills": [
        " ",
        "Ophthalmologist requirements and qualifications",
        " ",
        "●      A medical degree in ophthalmology.",
        "●      Successful completion of an internship and residency in ophthalmology.",
        "●      A state license to practice ophthalmology.",
        "●      Expert working knowledge of the diseases, functions, and anatomy of the eye.",
        "●      Strong physics and math skills, and excellent medical knowledge.",
        "●      Good administrative and managerial skills.",
        "●      Good hand-eye coordination.",
        "●      Strong organizational, communication, problem-solving, and decision-making skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}