{
    "Job ID": "4730503",
    "Description": "Execution of offshore project work in accordance with the project execution plan, including client and/or Project Procedures on Safety and Quality Control within the man-hour, cost and the project schedule targets delivering across study, FEED, EPC and PMC scopes of work.\nResponsible for the. Reflecting the market focus for the office in both brownfield and greenfield opportunities, multi-skilled personnel are sought, in particular those with experience in: Offshore Oil and Gas Responsibilities Analysis and Design of steel and concrete structures to various International & Company codes and standards (e.g., European, American, British, Shell, Aramco, etc.).\nAnalysis and Design of structure and equipment foundations to static and dynamic loading Analysis and Design using engineering software such as STAAD.Pro, SACS, Matt 3D, etc Preparation of Basis of Design, Material Specifications, Material take offs, Scopes of Work, Technical reports, Inter discipline design coordination and supervision Competent in preparing design calculations for steel and concrete structure, seismic design and design to extreme wind loads, developing design sketches and pass relevant information to designers as required on assigned projects Performs preliminary sizing for structural members to provide preliminary input to Structural 3D and 2D modelling\nPrepares structural computer models using SACS for primary steel geometry and loadings, and undertakes structural analyses for all anticipated operating, installation, transportation, loadout and fabrication conditions Ensures structural compliance with structural specifications as well as applicable code requirements and national / international standards.\nPrepares structural engineering input for secondary and tertiary steel design, prepares structural design sketches for input to 3D modelling/ 2D drawing production and prepares computed aided or hand calculations for justification of structural configuration for compliance with specifications and relevant design codes Prepares or checks structural design reports to fully document structural primary and secondary steel design to demonstrate compliance with design codes and specifications.\nUndertakes structural weight estimation for input into the project weight report Reviews relevant client provided and vendor data for structural implications and requirements Liaise with Designers in the preparation of CAD drawings, typically using, MicroStation, Smart plant 3D, E3D, AutoCAD, PDMS, PDS, Tekla etc Liaise with other disciplines to accommodate their requirementsSkills",
    "Skills": [
        "Required qualification and experience:Degree in Structural or Offshore Marine Engineering with a minimum of 5 years of relevant experience\nProven core Structural Engineering skills, including design experience and preferably in the offshore Oil & Gas sector Experience of working in a variety of projects and phases, including greenfield and brownfield, on and offshore, Pre-FEED through to EPC, with a focus on offshore upstream.\nMust have extensive offshore structural analysis experience in particular jackets.\nHave demonstrable experience of working within a small project office, supporting cross discipline activities beyond their core discipline.\nHave demonstrable experience of recruitment within their discipline, including interviewing, candidate selection and team building within small discipline teams. Have demonstrable experience of working independently / remotely from technical leadership personnel."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}