{
    "Job ID": "4730502",
    "Description": "Job Accountabilities:Position provides execution leadership to COMPRESSION2 Project, with support from Shared Services Integrated T&I Organization, guided by the following principles:\nOne Team” project organization accountable and responsible for effective and efficient delivery of the various scopes in project Compression development\nWhile position may report to the Compression Project COMP2 Head of T&I Execution and supported by Shared Services Transportation and Installation Division Manager, position is accountable and responsible to EPC Leadership for safe and successful execution of respective T&I scopes to meet EPC and overall project objectives.Skills",
    "Skills": [
        "Required qualification and experience:Recommended 15+ years of experience with at least 10 years demonstrated T&I project management experience.\nPreferred Engineering Degree or relevant on the job experience\nExperience in multiple T&I execution and operational aspects including offshore heavy lifts, float-over, pipeline, and cable installations, load-out and transportation; with float-over installation engineering and execution experience considered an advantage.\nExperience with float-over installation is preferred.\nWorldwide experience with contractors in particular those involved in the Offshore projects\nExcellent interpersonal and communication skills with a focus on teamwork and the ability to communicate and interact within a PMT.\nApplication and in-depth knowledge of stakeholder specifications and a working knowledge of Industry standards \nOPITO certification is considered a plus."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}