{
    "Job ID": "4730564",
    "Description": "Who are we?At Bayt.com we are committed to empowering people to lead better lives by providing them with the tools and information to build their lifestyle of choice. We are passionate about our services and seek to deliver the best experience for our customers. Not only are we devoted to our work and customers but most meaningfully to each other's success. We want to better every life we come in contact with and have lasting positive impact on the community. What do we value?We strive to be the best \nWe obsess about empowering others to lead better lives\nCreate value by doing more with less\nEmbrace change with a positive attitude\nCommunicate openly, honestly, and oftenJob summaryBayt.Com is looking for a highly effective Customer Development Representative with excellent interpersonal skills. You will be an extension of the Sales team in providing after-sales services and training to the customers in person, via the telephone, and online. You will have exceptional customer service delivery skills; be personable, a good conversationalist, and an active listener. Problem-solving comes naturally to you. You are customer obsessed: You empathize with them; understand their goals, pains, needs, and wants; and you strive to empower them to reach their goals.Job DescriptionResponsible for improving customer retention through programs and services provided to the customer.\nActively listen to customers and provide them with solutions that meet or exceed what they need.\nExplain and demo all digital products of Bayt.Com in person or online.\nIncrease Bayt.Com's product portfolio per customer through active sales by constantly working to improve the customer care experience, create engagement and facilitate organic growth.\nTake ownership of customers' issues and follow problems through to resolution.\nCreate communications to keep customers in the know on current offers, pricing, support concerts, or any changes.\nDetermine customers' recruitment needs and prepare proposals to upgrade their experience.\nIdentify, up-sell, and cross-sell opportunities by building long-term relationships and providing quality customer service.\nEnsure coverage of your assigned stack through regular physical and telephonic meetings.\nCRM system should be used extensively.Skills",
    "Skills": [
        "Qualifications",
        "Bachelor's degree in Business administration or relevant field\n1+ years proven working experience as a customer service representative in a tech company or call center is preferred",
        "Required Skills",
        "Strong communication/ interpersonal skills. Responsive to customer and business requests.\nStrong client-facing communication skills (written, oral, presentation)\nHighly motivated self starter who possesses a desire to succeed and learn for future growth and development.\nCustomer-centric aptitude"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 2",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}