{
    "Job ID": "4730380",
    "Description": "Responsibilities:The chef's role encompasses a comprehensive engagement with the project's concept, involving the assessment of all kitchen systems, specifications, and equipment.This includes recipe development, kitchen setup, quality control, team collaboration, and fulfilling the standard chef duties.The chef is wholly accountable for cuisine and product quality, overseeing and directing the necessary actions for the successful implementation of the menu.This involves refining the procurement system, formulating new dishes, and adapting the menu to various information references, seasons, and special marketing initiatives.Furthermore, the chef's responsibilities encompass the creation of visually appealing, special dishes. Additionally, the chef will be involved in interviews and media engagements. Beyond the traditional chef responsibilities, there is also a gastronomic marketing aspect to the role. If specialized marketing skills are lacking, the company ensures the provision of training courses.Skills",
    "Skills": [
        "Requirements:",
        "Primarily, candidates must possess pertinent experience as a sous chef, head chef, or executive chef for a minimum of 2 years within Dubai or the UAE. Secondly, a firm grasp of suppliers and access to requisite connections for potential adjustments or enhancements to food costs is essential.",
        "Proficiency in managing food costs is also a prerequisite.",
        "A comprehensive understanding of restaurant business processes is crucial, accompanied by exceptional communication abilities. Confidence, attentive listening, creativity, attention to detail, and consistency are all indispensable traits for this role."
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}