{
    "Job ID": "4730112",
    "Description": "We are currently seeking an experienced, creative individual who thinks like a designer first and can then set a high bar for design and usability for our digital products. You will fully own the design process through research and then work closely with a creative team, software development team and other key stakeholders in building user flows, wireframes, and interactive prototypes for products that strongly reflect our brand. More than just UI designs, UX in our company means inventing, iterating, and honing in the best experience for our users.Primary Responsibilities:Provide concepts and designs that respond to the briefed objectives with a strong understanding of user experience, interaction design, and creative collaboration.\nThink out of the box and create original graphic designs and assets.\nOwn the full user experience of our games from blue sky to UX specs to polished UI designs.\nDesign UI/UX wireframes and high-fidelity prototypes with accurate user flows and mockup animations.\nBuild UI systems that can scale in production, owning them from concept to launch.\nAdvocate for trends and best practices in UI/UX and become our subject matter expert on all things UX.\nCreate original graphic designs (e.g., images, sketches and tables) and set high standards for style on fonts, colors and images.\nIdentify and troubleshoot UX problems (e.g., responsiveness)\nConduct layout adjustments based on user feedback.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor’s Degree in Design, UI/UX or other relevant designing field.\nWith more than 5 years professional experience in UI / UX Design, with an online portfolio of exceptional design and/or illustration projects.\nWith at least 5 years of CSS coding experience and able to code like frontend developer.\nKnowledge of wireframe tools (e.g., Adobe XD, Figma or Sketch) is a must.\nHas proven working knowledge of and highly skilled in Adobe Creative Suite (notably Photoshop, Illustrator).\nAbility to visualize innovative solutions beyond the simple use of software.\nMust be able to think and respond quickly while maintaining keen attention to detail\nExcellent creative, conceptual and critical thinking abilities.\nExcellent communication skills including ability to articulate creative concepts and rationale for stakeholders and team\nCollaborative mindset backed by a desire to help us make great decisions in an empathetic and respectful way\nAbility to meet deadlines while working independently and with a team",
        "Nice-to-haves:",
        "Having working knowledge of 2D animation using Adobe Animate, After Effects, etc.\nSkills in 3D Design using Premiere, Maya, Cinema 4D or Blender."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Graphic Design",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$7,000 - $8,000",
        "Number of Vacancies": "1"
    }
}