{
    "Job ID": "4730066",
    "Description": "Provide skilled service in the installation, repair, operation, and maintenance of Air Conditioning (AC) equipment and systems at various stations of the facility.Job Duties :Assemble, install, test, and maintain Air Conditioning wiring, equipment, appliances, apparatus, and fixtures, using hand and power tools.\nDiagnose malfunctioning systems, apparatus, and components, using test equipment and hand tools, to locate the cause of a breakdown and correct the problem.\nConduct the preventive, corrective and breakdown maintenance of all kind of Air Conditioning assets.\nPerform routine checks by inspecting Air Conditioning systems, equipment, and components to identify hazards, defects, and the need for adjustment or repair.\nHandle the daily Air Conditioning works in the mall.\nCoordinate with fit out contractors for installations.\nHandle the complaints on Air Conditioning system.\nMaintain the proper history of the equipment maintenance.\nExecute work orders from the supervisor.\nFill in the regular property inspections and checklists.\nPrepare material requests required for the smooth operation of the Air Conditioning equipment.\nReceive the materials and check the quality.\nPerform the necessary corrective works.\nAny other duties as assigned by the direct manager.Skills",
    "Skills": [
        "Minimum Requirements :",
        "Minimum Education :",
        "High school Diploma.",
        "Minimum Experience :",
        "3 Years of experience in a related field.",
        "Training & Certifications :",
        "Course certificate in Air conditioning.",
        "Languages :",
        ": English, Arabic.",
        "Minimum Skills Requirements :",
        "General Skills :",
        "Planning and managing projects.\nHandle problems quickly and efficiently\nAbility to manage multiple tasks,\norganize priorities and handle work pressure.\nAbility to work independently or within a team.",
        "Technical Skills :",
        "Installing equipment, machines, wiring, or programs to meet specifications.\nTroubleshooting skills.\nOperating equipment used in the repair and maintenance of Air conditioning systems.\nPreparing and maintaining accurate records.\nAdhering to safety practices and handling hazardous materials.\nAbility to follow written and verbal instructions.\nGood verbal and written communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}