{
    "Job ID": "4730369",
    "Description": "IT Application Analyst / Developer – Techno Funct. ERPROLE PURPOSE:The Applications Analyst / Developer will be responsible for gathering Business requirements from business units and end users, analysing these requirements, setting and designing solutions architecture, the development of software applications/solutions, testing, implementation and maintenance of AlKoot IT Applications and solutions portfolio.KEY ACCOUNTABILITIES: Deal and manage Budget & Planning is a must\nDeal and manage MIS QCB reporting and Borad, Profit, Loss, Actuals, /… reporting is a must\nDeal and manage IFRS17 Highly is a must\nDeal and manage Oracle BI analytic tool and MS Power BI\nDeal and manage BPM and process automation\nGeneral Insurance and Motor hands-on and full understanding and strong skills and background\nclaims, Insurance and Re-Insurance, policy and treaty issuance, finance, AP,AR, GLs, month end, year rend, )\nSystem integrations and APIs\nSystem requirements gathering, Analysis, Design, Development & Implementation\nSolution Architectures and design with align to the enterprise architecture\nWriting technical specifications documents and designing solutions resulted from the BRDs and Functional specifications documents and develop the solution/application\nFunctional and business knowledge in Finance and Insurance business\nData structure design, development and creation of packages, procedures and functions based on business requirements in Oracle Database 10G+.\nEnsures that data structure design is scalable and maintainable.\nPerformance monitoring, reporting, and tuning of Oracle reporting databases.\nProvision of support and assistance in the design, testing, tuning and implementation of database applications\nWriting / Tuning data ingestion procedures from external suppliers and partners using PL/SQL, SQL loader, 3rd party tools like Toad etc.Skills",
    "Skills": [
        "Knowledge & Experience:",
        "Bachelor Degree in IT or IT related field\nERP excellent knowledge all modules Finance, HR, PRO – Oracle EBS\nSDLC full project cycle experience \n6 minimum years’ experience in developing software applications, preferably, out of which at least 3 years with insurance applications.\nKnowledge of the Project Management and in the preparation of the document like Project Plans, WBS and Project Status reports.\nExcellent skill and knowledge of budgeting and board reporting and dashboards\nExperience of using Business Objects and report building functions from User through to Admin.\nExperience of BI reports creation and publishing, Reporting tools such as EPM / ECC/ Analytic Server / BI Publisher\nDesigning and development in Oracle forms and reports 10G+, In-depth knowledge and experience in Oracle 9i/10g+, 12c\nAPEX development strong skills\nIn-depth knowledge and experience in SQL and PL/SQL including tuning.\nWriting ad-hoc queries based on schema knowledge for various reporting requirements.\nExperience with Unix / Linux / Windows Server 2003 including basic commands and shell scripting.\nIn-depth knowledge and experience in Import/Export, SQL*Loader planning.\nOracle OCP Certification is a plus.\nFamiliarity with Oracle specific tools and utilities.\nKnowledge of Quest TOAD\nKnowledge of open source web development and Java is a plus\nExcellent Business intelligent and dashboard\nRelease Management and version control knowledge\nExcellent Business and system analysis skills\nProject management skills\nDesigning and development in forms and reports 12C+, Apex (From 20.2), BI Publisher 12C+.\nExcellent knowledge and skill in system integrations and APIs "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 6 Max: 15",
        "Gender": "Male",
        "Nationality": "All Arab Countries; Malaysia; Philippines; Singapore; Southeast Asia",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}