{
    "Job ID": "4730778",
    "Description": "As a well-recognized multi-speciality hospital, our team of general surgeons are at the forefront of their respective specialities, offering patients outstanding personalized care. We’re looking for an experienced general surgeon who is eager to join our team and use their superior surgical skills to help us continue to thrive. In this role, the successful candidate will be well-grounded in the basic science of surgery, using their exceptional clinical judgment to offer thorough and exemplary patient care. From early on, you will use the most advanced innovations, typically with minimal access (laparoscopic and endoscopic) techniques, supported by a team of compassionate experts to help you guide patients through their individual surgical experiences. We expect our general surgeons to possess a unique blend of technical knowledge and empathy, enabling them to improve the health of patients not just during the procedure, but well into the future. Job Responsibilities ●      Diagnose internal injuries and diseases, and prescribe medication or surgery;●      Order and analyse tests like X-rays, CT scans, and MRIs;●      Decide whether surgery is warranted, based on the patient’s records, tests, and examinations;●      Perform examinations to confirm that patients are strong enough to undergo surgery, explain the procedures, and discuss the risks involved;●      Determine the type of surgery that is needed, and the nurses, anesthesiologists, specialists, and others who will be required;●      Order antibiotics, special diets, sedatives, and other prescriptions for pre- and post-operative treatment;●      Schedule operations, coordinate the staff, plan the procedures, and order instruments and other supplies;●      Perform operations, in accordance with accepted methods;●      Create and update patient records;●      Consult with and assist other doctors;●      Refer patients to specialists and other professionals  Skills",
    "Skills": [
        "Job Skills & Qualifications Required:",
        "●      Must hold a Doctor of Medicine and Specialization degree",
        "●      Minimum 5 years of Residency in general surgery",
        "●      Stable experience in patient care and surgery",
        "●      Valid Country License to practice.",
        "●      Must be able to pass all required background checks."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Clinic; Medical Hospital",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}