{
    "Job ID": "4730906",
    "Description": "Participants for Data Collection Project \"Spoofy-Doo\"Would you like to participate in a fun, rewarding project that seeks to advance technology? TELUS International is currently looking for people with smart devices to participate in the data collection study \"Spoofy-Doo\". This project aims at helping artificial intelligence technology systems improve their recognition components. Sounds interesting? Check out the details and register below.Project DetailsCreate images and videos imitating security camera footage within specific scenarios following our guidelines and examples. The task includes moving around in a room with or without a disguise, such as a mask.The task takes approximately 3 hours per person to complete.CompensationYou will get paid by the number of completed tasks and sets (photos and videos) that meet the requirements and pass the quality assurance. Compensation is up to $100. Payments will be made via Hyperwallet on the TELUS International AI Community Platform, where you can choose PayPal, bank transfer or Venmo as the payment method. The payment methods available vary by country. Please note that your identity will be verified.Your Social Security Number (SSN) and Individual Taxpayer Identification Number (ITIN) will be verified and must match your name and address.Any information that you provide in connection with the Project will be kept confidential.Selected participants will be contacted by TELUS International with the detailed guidelines on how to get started.Skills",
    "Skills": [
        "Requirements",
        "You must reside or have the right to work in the US excluding the following states: Illinois, Texas and Washington\nAccess to one smartphone/device that meets the video quality criteria: minimum resolution 1080p with a preference for 4k videos",
        "Non-essential Requirements (but super useful to succeed in this study)",
        "Tripod, selfie stick or a phone stand\nBluetooth remote"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "New York, New York , United States",
        "Company Industry": "Translation & Document Processing; IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}