{
    "Job ID": "4730693",
    "Description": "On behalf of our client, we are seeking a highly experienced Senior Analyst to join the team.Key Responsibilities:Prepare financial reports for senior management review and perform company and projects financial analysis.\nFollow the progress of investments in order to make recommendations for the determination of optimum investment strategies.\nConduct comprehensive analyses of potential projects/ joint ventures and quantify risk/return relationships thereto.\nAnalyze the organization’s debt load and make recommendations for structuring and refinancing alternatives with banks and lending institutions.\nDevelop quantitative reports for presentation to senior management.\nBenchmark Company financial performance data and make recommendations.\nConduct commercial analysis of activities in local/area markets and gather and analyze business information from competitors.\nAnalyze financial information to forecast business, industry, and economic conditions for use in making investment decisions.Skills",
    "Skills": [
        "Bachelor's degree in Finance, Accounting, or a related field.\nMinimum of 3 years of experience as a Financial Analyst.\nShould have the following certifications: 1) International Introduction to Securities & Investment (CISI) or Chartered Financial Analyst (CFA), 2) CMA Kuwait Rules and Regulations (CISI)\nSkilled in Investment Banking, Financial Risk Analysis, Investment Analysis, Financial Forecasting, General Accounting practices, Financial Modeling, Data Analysis, Microsoft applications\nShould have good communication skills in both English and Arabic."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Financial Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}