{
    "Job ID": "4730462",
    "Description": "Position Title:             Procurement SpecialistEmployment Type:     Full TimeSalary:                         up to 7K AED all-inclusive depending on experience and qualifications plus annual airfare ticketJob Location:            Dubai, UAE About the Client:One of the leading retail distributors in the region. Job Description:Manage and supervise inventory activities and storekeeper responsibilities within the purchasing department, ensuring efficient day-to-day operations.\nCollaborate with the Floor Operations Manager to develop well-structured procurement plans for equipment, services, and supplies, aligning with company objectives.\nMaintain detailed records of past material prices to ensure cost-effectiveness of purchases, contributing to prudent spending and optimized procurement decisions.\nEnforce company-wide procurement policies and procedures, fostering a culture of compliance and transparency throughout the procurement process.\nCarefully assess and compare potential purchases, Sourcing needed products, seeking necessary approvals from the Reporting Manager and General Manager for equipment and materials procurement, while maintaining strict compliance with set guidelines.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Asian nationals\nMale, 40 years old and below\nMinimum 3 years’ of procurement experience from the trading industry in the UAE\nMust have good experience in MS office or any procurement software\nMust have a valid UAE driving license\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "Central Asia; East Asia; South Asia; Southeast Asia; West Asia",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}