{
    "Job ID": "4730862",
    "Description": "Job descriptionYour Mission:This is an Engineering position within the line of Smart systems business reporting to the Operations Manager. The primary job function is to manage, maintain and upgrade our customers control projects which may consist of one or many of the following but are not limited to these protocols KNX, DALI Control, BACnet, Modbus, Niagara, Desigo, TCP/IP, etc. As a Systems Engineers you would also be responsible for supporting other engineers or sales within the organizationYour responsibilities:Team Project ManagementCoordinating, preparing, and fault-finding project solutions and maintaining them:\nBeing able to design & engineer building control/automation systems and support others with theirs\nWorking with bus systems and technologies such as KNX, BACnet, Modbus & Tridium Niagara.\nBuilding and maintaining systems software & configurations (ETS)\nDelivery of Training to customers and other team members\nSupporting the execution of projects:\nScheduling equipment for projects (PPM critical Spares & minor works)\nPre-configuring and downloading equipment prior to delivery.\nCommunication with customers:\nLiaising with customers regarding queries for your own and other team members\nWriting and preparation of project-related documentation\nWorking with AutoCAD drawings in coordination with the Pre-sales engineer:\nUpdating of schematics, layouts, topology drawings, and other associated details\nReading and working from schematic and engineering drawingsSkills",
    "Skills": [
        "About you:",
        "Experience in a similar Engineering environment\nExperience with KNX, DALI Control, BACnet, Modbus, Niagara A,X or any other platform\nProject Engineering background - not essential but desirable\nIT /networking skills and Delivery of Training\nElectrical/Electronic qualification bachelor's or Masters\nKNX Partner qualification"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Telecommunications; Software Development",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}