{
    "Job ID": "4730406",
    "Description": "PURPOSEThe Humanitarian Affairs Adviser for Riyadh enables the KSA Mission to understand and influence the wider humanitarian environment in KSA. S/He identifies and maps relevant stakeholders and designs effective ICRC operational updates and policy briefs to deliver an engagement with humanitarian, multilateral and regional fora for the KSA stakeholders as in line with the GCC strategy.RESPOSNSIBILITIES INCLUDE BUT NOT LIMITED TO:Supports and advises the KSA Head of Mission and provides relevant inputs to the Regional Delegation on KSA national issues and the GCC affairs and how they impact/relate to humanitarian action, policy and fundraising through analysis and reporting.\nAdvises and supports the KSA Head of Mission in developing and maintaining the network of interlocutors in conjunction with other departments, participates in meetings, and does reporting.\nMaintains and develops the network of interlocutors and contributes to enhancing the acceptance of the ICRC in KSA and the GCC Region.\nProvides analysis of the national and regional issues of relevance for ICRC’s humanitarian work.\nActively contributes to advancing the ICRC Mission in KSA, enhancing the strategic dialogue and leads the organisation of high-level meetings.\nUses and develops tools and means of reporting and analysis, depending on internal requirements and the evolution of the situation (e.g., mapping of key stakeholders, monthly summaries of key information).\nProvides support and briefings to program coordinators, and informs on all social, political, and economic developments that might affect the implementation of the ongoing and future ICRC programs and activities in KSA and the region.\nContributes to specific analysis exercises jointly with other departments.\nProvides and maintains an updated stakeholder mapping for the ICRC strategic objectives in KSA and contributes to drafting an engagement strategy with the main actors among them in close collaboration with the strategic objectives’ lead persons in the Regional Delegation.\nContributes to drafting speeches, speaking points and briefing files for meetings between the ICRC senior leadership and key KSA stakeholders.Skills",
    "Skills": [
        "Certifications/Education Required",
        "University degree in relevant subject (e.g., international relations, social and/or political sciences)\nMaster’s degree or specialization in a related subject/policy issue an asset.\nFluent command of English and Arabic.\nComputer proficiency (Windows environment, Microsoft, and online collaboration tools).",
        "Professional Experience Required",
        "Typically, 6-9 years’ overall professional experience.\nAt least 5 years’ experience in humanitarian or political/diplomatic affairs.\nPeople management experience an asset.\nProven experience in cultivating networks and influencing others.\nSolid understanding of national/regional relations and their interplay with the humanitarian affairs.\nStrategic understanding of national/regional/global relations and their interplay with humanitarian affairs.\nKnowledge of multilateral organisations, agencies and platforms.",
        "Start of work: ASAP",
        "Only complete files matching with the profile will be considered.",
        "Only short-listed candidates will be contacted.",
        "CV’s received will be subject to the rules of the Data Protection of the ICRC (Data Controller)",
        "and will only be used for the purpose they were sent for and will not be kept after the end of the process or shared with third parties without consent of the sender."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}