{
    "Job ID": "4730132",
    "Description": "Operations Officer - LebanonDocument scrutiny and collection of applications for visa processing.\nHandle customer/applicant queries personally or via email, telephone.\nHandle cash and bank related transactions if assigned and ensure 100% accuracy.\nRecord & maintain all application data. Ensure accurate & timely data entry into the system with zero errors.\nEnsure all administration and logistics of passport delivery to consulate/ applicant / logistic company etc.\nMaintain compliance to the standard operating procedures, manuals etc. without deviation in process.\nInform the applicants about the available Value Added Services and ensure delivery of Value Added Service options to applicants/ customers.\nEncourage applicants to provide feedback on services provided and their overall experience at the application centre.\nEnsure that the entire process is completed within the mandated Turn Around Time.\nAssist Deputy Manager/Operations Manager in execution of WB Project.\nEnsure judicious use of natural resources.\nAdhere to the environment health and safety policy/objectives and guidelines of the organization.Skills",
    "Skills": [
        "Residents of Beirut (is a must)\nLebanese nationals are preferred\nBachelor’s Degree in business sciences or any related field\nExcellent Verbal and Written skills in Both Arabic and English\n2-3 years Proven Experience in leadership specially in customer service field\nProficiency in MS Office\nShowcase good leadership skills to carry team members along\nExcellent skills for communicating and relating with both staff members and customers\nGood interpersonal skills to create a cordial relationship with team members\nAbility to multitask\nHave good temperate to handle disputes and emergencies "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "6"
    }
}