{
    "Job ID": "4730817",
    "Description": "We are looking for a knowledgeable neurosurgeon to be responsible for performing surgeries to assist in rectifying medical conditions that affect the spinal cord, brain, and peripheral nerves. The neurosurgeon will oversee and coordinate a team of surgeons and nurses to perform surgeries to remove tumors, relieve chronic pain, and treat wounds, vascular disorders, and diseases. Duties and Responsibilities●      Overseeing and coordinating teams of surgeons and nurses in the operating theater.●      Operating microscopes for surgeries to perform microsurgeries.●      Ordering, performing, and interpreting results of diagnostic tests, such as MRIs, PET scans, and CT scans.●      Assessing and diagnosing patients, prescribing treatments, and monitoring the patients' progress.●      Meeting with families of patients in surgery and keeping them updated.●      Handling unscheduled emergency surgeries.●      Working with psychiatrists, therapists, and neurologists, and consulting with other departments.●      Performing basic administrative and business tasks, such as keeping records, writing prescriptions, and filling out paperwork.●      Keeping up with new discoveries and attending academic conferences.Skills",
    "Skills": [
        "Skills and qualifications:",
        " ",
        "●      A Medical degree and the successful completion of a residency in neurosurgery.",
        "●      A license and certification to practice neurosurgery.",
        "●      The ability to read and interpret diagnostic reports.",
        "●      A thorough knowledge of human anatomy and microsurgery techniques.",
        "●      Excellent hand dexterity and hand-eye coordination.",
        "●      Strong communication and interpersonal skills.",
        "●      The ability to handle physically and mentally demanding tasks, and work under intense pressure and stress.",
        "●      The flexibility to handle a constantly shifting schedule."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}