{
    "Job ID": "4730363",
    "Description": "ROLE PURPOSE:The Applications Analyst / Developer GI & Motor (U/W, claims, Insurance and Re-Insurance, policy and treaty issuance, finance, AP,AR, GLs, ) will be responsible for gathering Business requirements from business units and end users, analysing these requirements, setting and designing solutions architecture, the development of software applications/solutions, testing, implementation and maintenance of AlKoot IT Applications and solutions portfolio.KEY ACCOUNTABILITIES: General Insurance and Motor hands on and full understanding and strong skills and background\nclaims, Insurance and Re-Insurance, policy and treaty issuance, finance, AP,AR, GLs, month end, year rend, )\nOther insurance modules like Medical is a must\nBI and DWH analytic good experience and hands on\nBPM and process automation knowledge\nCoding and programming experience and hands on\nProject Management excellent experience\nSystems integrations and APIs\nSystem and Business analysis excellent experience\nData structure design, development and creation of packages, procedures and functions based on business requirements in Oracle Database 10G+ and others\nEnsures that data structure design is scalable and maintainable.\nProvision of support and assistance in the design, testing, tuning and implementation of database applications\nWriting / Tuning data ingestion procedures from external suppliers and partners using PL/SQL, SQL loader, 3rd party tools like Toad etc.\nBusiness intelligent and reporting and dashboard excellent skills and designing dashboards Skills",
    "Skills": [
        "Knowledge & Experience:",
        "Bachelor Degree in IT or IT related field\n6 minimum years’ experience in developing software applications, preferably, out of which at least 3 years with insurance applications.\nSolid experience in business intelligent\nSolid Experience in systems integrations and APIs\nExperience of using Business Objects and report building functions from User through to Admin.\nExperience of BI reports creation and publishing, Reporting tools such as EPM / ECC/ Analytic Server / BI Publisher\nOracle Developer EXPERT Designing and development in forms and reports 10G+, In-depth knowledge and experience in Oracle 9i/10g+, 12c\nIn-depth knowledge and experience in SQL and PL/SQL including tuning.\nWriting ad-hoc queries based on schema knowledge for various reporting requirements.\nExperience with Unix / Linux / Windows Server 2003 including basic commands and shell scripting.\nIn-depth knowledge and experience in Import/Export, SQL*Loader planning.\nOracle OCP Certification is a plus.\nFamiliarity with Oracle specific tools and utilities.\nKnowledge of Quest TOAD\nDesigning and development in forms and reports 12C+, Apex EXPERT (From 20.2), BI Publisher 12C+.\nExcellent knowledge and skill in system integrations and APIs\nExperience creating metadata, developing ETL processes, and using several reporting tools; and performing data cleansing functions"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 12",
        "Gender": "Male",
        "Nationality": "All GCC Countries; Malaysia; Philippines; Singapore; South Asia; Southeast Asia",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}