{
    "Job ID": "4730260",
    "Description": "Job DescriptionResponsible for smooth kiln operation.\nResponsible of the production quantity & the optimum quality as per the production plan.\nSmooth & clear communicating with the shift supervisor in jobs follow up.\nAuthorize to stop the section during uncontrolled abnormality in consent with shift supervisor.\nAuthorize to optimize the product quantity.\nResponsible for corrective measure & control of pollution control equipment.\nMaintain quality parameters as set by department time to time.\nMonitor kiln shell temperature to avoid any untoward incident.\nEnsure Power consumption as per set benchmark by company.\nSupervise quality work of refractory during shutdown & maintenance.\nTo generate work order in CCR for any equipment abnormal deviation.\nMonitoring equipment to ensure that the kiln is running properly and safely.Skills",
    "Skills": [
        "Kiln Operator Skills:",
        "Kiln operators need the following skills in order to be successful:",
        "Attention to detail: Kiln operators must be able to pay close attention to detail when monitoring and adjusting the kiln’s settings. This ensures that the product they’re working with is properly heated and that the finished product meets the company’s standards. Attention to detail can also help kiln operators notice any potential issues with the kiln before it damages the product or the equipment.",
        "Communication skills: Communication skills are essential for kiln operators, as they must be able to convey information to their coworkers and supervisors. They must also be able to listen to and understand instructions from their superiors. Communication skills can also help kiln operators convey information to their coworkers and supervisors about the status of the kiln.",
        "Mechanical aptitude: A kiln operator needs to understand how to operate machinery and equipment. This includes knowing how to read and understand mechanical diagrams, how to troubleshoot mechanical issues and how to operate machinery safely. Mechanical aptitude is a crucial skill for kiln operators because it allows them to perform their job duties efficiently and safely."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7",
        "Gender": "Male",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Dukhan, Qatar",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "Unspecified"
    }
}