{
    "Job ID": "4730508",
    "Description": "Parisima Talent is hiring for the position of Project Sales Executive with one of our clients.Our client is a leading multinational organization in construction and building material sectors.Position: Project Sales ExecutiveJob location: Riyadh, Saudi ArabiaJob Responsibilities:Projects Channel, Sales & business development\nMaximize and increase sales and margin whilst ensuring the company profile remains high across the relevant territory.\nWork closely with the dealers / partners and support in all the technical and commercials requests.\nWeekly / monthly and quarterly monitor Annual Target achievement.\nAttend needed Internal Sales calls or meetings and actively participate.\nEnsure a steady corporate reporting system is followed at all times.\nMake recommendations towards facilitating a more sustainable progress within the set sales strategy in order to maximize coverage, sales and increase market share.\nCreate Key Account data base with monthly monitoring and share the details with the Pre-Sales team.\nAct proactively with high level of credibility and responsibility towards management reporting.\nFollow Market Segmentation. Identify new opportunities within channels and suggest actions.\nDaily / weekly input and monitoring of CRM database.\nAccurate and complete information for all Projects.\nContinuous follow up on pending actions until a project is closed.\nProvide timely feedback on current market situation and sales outlook.Skills",
    "Skills": [
        "Job specifications:",
        "Bachelor’s degree in business administration/marketing.\n2+ years of building materials project / sanitary ware sales experience.\nUnderstanding of local trade and market demands is important.\nStrong communication and socializing skills.\nAbility to multi-task and carry out multiple responsibilities.\nAbility to work and handle customers under stress and meet deadlines.\nWillingness to take on responsibilities, challenges and embrace team spirit as the most critical success factory notably with the distributors’ dominance."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}