{
    "Job ID": "4730959",
    "Description": "Fun Begins When Professional Photography Meets Social Media!We are seeking a FREELANCE motivated and experienced Social Media Specialist to effectively manage and boost social media accounts of our clients and our own..Our objective is to achieve exceptional customer engagement, foster intimacy, drive website traffic, and increase revenue through strategic utilization of the social media marketing roadmap.The ideal candidate should possess a comprehensive understanding of various social media platforms (Instagram, Facebook, TikTok, Linkedin) and how to optimize content for maximum engagement.As a representative of our brand, and our clients brands, you will actively participate in relevant conversations, gently promoting our products/services while providing support to existing and potential customers.Your expertise in social media marketing will be essential in achieving our goals and establishing strong brand connections.This Job vacancy is open for Freelance Social Media Specialists, which paid per managed account.ResponsibilitiesBuild and execute social media strategy through competitive research, platform determination, benchmarking, messaging and audience identification\nGenerate, edit, publish and share daily content (original text, images, videos) that builds meaningful connections and encourages community members to take action\nSet up and optimize a company pages within each platform to increase the visibility of company’s social content\nModerate all user-generated content in line with the moderation policy for each community\nCreate editorial calendars and syndication schedules\nContinuously improve by capturing and analyzing the appropriate social data/metrics, insights and best practices, and then acting on the information\nMeet clients at their business locations when required.\nAttend our photoshoots to capture BTS (Behind the scenes) content for social media posting.Skills",
    "Skills": [
        "PONUS >> Successful candidates may have access of professional photography & videography practical training by an expert photographer at our studio and on different locations, using specialized photography equipment.",
        "Proven working experience in social media marketing or as a Digital Media Specialist (at least 2 years of experience).\nExcellent consulting, writing, on mobile editing (photo/video/text), presentation and communication skills.\nDemonstrable social networking experience and social analytics tools knowledge.\nPositive attitude, detail and customer oriented with good multitasking and organizational ability\nFluency in English\nMust be a resident of Amman."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 10",
        "Gender": "Female",
        "Age": "Min: 21 Max: 40"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Photography; Marketing; Video & Film Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}