{
    "Job ID": "4730812",
    "Description": "We as a well reputed facility have experienced a period of unparalleled growth, and we are looking to add an experienced orthodontist to our team. We are honored to provide our patients with the high-quality orthodontic care they expect with a focus on helping them realize their dreams of a beautiful smile. We are searching for a licensed orthodontist to help our growing practice achieve our mission of promoting healthy teeth and good oral habits from early childhood through adulthood. The right orthodontist for this job will be a master craftsperson, capable of collaborating with dentists and medical professionals to help patients achieve a healthy mouth, a more pleasing appearance, and teeth that will last a lifetime. Orthodontist duties and responsibilities: ●      Serve as a preventative care specialist, and provide educational and clinical services supporting overall health through optimal oral health●      Perform a variety of orthodontic procedures to diagnose, prevent, and treat conditions and help patients keep their mouths and teeth healthy●      Provide inspired leadership to a staff of assistants, technicians, and administrators, establishing a culture of teamwork, quality, support, and trust●      Nurture and grow relationships with local dentists who refer patients to our practice●      Analyze and evaluate dental needs to determine changes and trends in dental disease, treatments, and technology Skills",
    "Skills": [
        "Requirements and qualifications:",
        " ",
        "●      Degree from an accredited School of Dentistry",
        "●      Degree from accredited Orthodontic Specialty Program",
        "●      Board certification",
        "●      Valid license to practice",
        "●      1 – 3 years of orthodontic experience",
        "●      Ability to lead a staff and put patients at ease",
        "●      Strong attention to detail and accuracy",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}