{
    "Job ID": "4730824",
    "Description": "We are looking for an experienced Gynaecologist who can provide medical care related to pregnancy or childbirth and those who diagnose, treat, and help prevent diseases of women, particularly those affecting the reproductive system. May also provide general medical care to women. Duties and Responsibilities ●      Provides outpatient obstetrics and gynecology services throughout assigned clinic locations.●      Provides inpatient obstetrics and gynecology services, including infant delivery and related surgical procedures, at partner hospitals.●      Participates in the Clinical Outcomes Program and works towards meeting organizational targets for all metrics.●      Maintains the required productivity expectations for time spent in the clinic.●      Participates in administrative duties, including lab reports, charts, and medication refills reviewed and managed appropriately.●      Follows medical practice policies and procedures, including attending all mandatory meetings, minimizing incident reports, using resources efficiently, and practicing medicine in a cost-effective manner.●      Completes all required documentation accurately, timely, and thoroughly in accordance with department standards and to comply with electronic medical record requirements. Skills",
    "Skills": [
        "OB-GYN Requirements and Qualifications",
        " ",
        "●      Graduate of an accredited medical school",
        "●      Unrestricted license to practice medicine",
        "●      Specialization Certificate in Obstetrics and Gynecology",
        "●      Minimum two years of clinical experience in the direct delivery of primary care",
        "●      Good Communication skills",
        "●      Flexible to work on any time schedules"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}