{
    "Job ID": "4730834",
    "Description": "A renowned hospital in the UAE is looking for a skilled Critical care Doctor, who is involved in all aspects of care of the critically ill. This includes providing organ system support and the investigation, diagnosis, and treatment of acute illness. It also includes systems management and patient safety, ethics, end-of-life care and the support of families. As an intensivist or trainee in ICM, you will help to treat various conditions.Responsibilities●      To examine all patients on admission in ICU/ ER/other such Clinical areas as designated by Clinical Administration from time to time.●      To order investigations under the guidance of the departmental Head/ Coordinator●      To write and fill up all documents and patients history sheets and MLC and other such forms as ordered by Clinical Administration from time to time.●      To seek Consultation and do referrals to Specialists and Consultants from time to time as per Clinical protocol and company policies.●      To take and give written handover at the bedside at the beginning and end of the duty shift.●      To rectify or correct any clerical/other such errors committed by the retainer herein agrees to visit the hospital at the earliest irrespective of the next schedule of the duty shift.●      To document all administrative related policies and other such documents of similar nature as guided by the clinical Coordinator and general administration from time to time.●      To train nurses, paramedical and support staffs while on duty and as ordered by the clinical admin from time to time Skills",
    "Skills": [
        "Qualification and Skills.",
        " ",
        "• Specialization Degree",
        "• Minimum 5-10 years post specialization in Critical Care ",
        "• BLS certification ",
        "• ACLS certified ",
        "• Good communication skills ",
        "• Critical decision-making skills ",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}