{
    "Job ID": "4730596",
    "Description": "On behalf of the fastest-growing retail company in the Middle East, we are looking for an ambitious and results-oriented Head of Omni Commerce to unleash our client’s potential across the Middle East.This is a regional leadership role, leading current operations in Saudi Arabia and Kuwait, along with expansions into new markets.This is a unique leadership opportunity set at the intersection of brand building, marketing, growth, and analytics; perfect for someone who is looking to leverage their skills in taking on complicated challenges to unlock tremendous potential. You will lead the entire Omni commerce customer experience – incorporating website, mobile apps, and store fleet.Key Responsibilities.Develop and implement the eCommerce channel strategy, including geography roadmap, UX/UI, pricing, and promotional strategies in such a way as to avoid channel conflict with offline and allow for profitable growth in line with the brand and company strategy.\nManage all aspects of web analytics and ensure periodic business performance reporting to cross-functional and leadership teams focusing on actionable insights that can impact short/long-term strategy.\nAct as the custodian for the brand's E-commerce channel while ensuring that the offering is as close as possible across all the brand's consumer touchpoints, including eCommerce, physical stores, loyalty apps, and ticketing.\nBe the key point of contact for the category, sales/store, and commercial teams to support the continuous enhancement of the online execution's best practices.\nAct as the relationship manager for eCommerce solution partners, platforms, integrators, content providers, and hosting partners.\nDrive the project management, QA, and testing across maintenance and new developments, ensuring the buy-in and support of all stakeholders.\nAct as a partner with product teams to determine portfolio roadmap and establish successful platform strategies.\nPlan, oversee, and drive the launch of all-new eCommerce projects, including launches in the new market and new functionalities and programs in existing markets.\nConduct periodic reviews of customer insights data and translate the findings into platform enhancements and revenue growth opportunities.\nRecruit, train, motivate and evaluate your team.\nCompetencies for the Head of Omni Commerce, are drive for results, customer focus, interpersonal savvy, strategic agility, managerial courage, and building effective teams.Skills",
    "Skills": [
        "Competencies for the Head of Omni Commerce, are drive for results, customer focus, interpersonal savvy, strategic agility, managerial courage, and building effective teams.",
        "Bachelor's Degree.\n 5+ years of experience. Excellent oral and written communication skills, in Arabic and English.\nProven track record of influencing others to drive your key business KPI.\nStrong bias for data-driven decision-making and experience in distilling complex, analytically dense products into client-facing solutions.\nCreative thinking showing the fine tune artwork visuals and language.\n Analytical thinking to drive metrics and benchmarks to ensure continuous improvement in process and results.\nDemonstrated high attention to detail and proven ability to manage multiple, competing priorities simultaneously.\nExperience using data and metrics to measure impact and determine improvements.\nExperience using Microsoft Excel to cleanse and analyze data.\nDemonstrated ability to build, execute, and scale marketing communication programs.\nProven track record establishing program(s) end-to-end, from the ground up.\nRetail experience preferable."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 12",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 36"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}