{
    "Job ID": "4730487",
    "Description": "JOB REQUIREMENTSBachelor’s degree (or higher) in Chemical Engineering with minimum of 15 years’ experience, including in plant engineering or operating plant engineering and preferably with one or more of the processes and technologies used in the facility Have a good operating knowledge to understand the requirements of start-up, shut down, and load changes. Balanced multi-discipline understanding in process engineering, DCS controls, process safety and equipment design  Process Safety Management experience, fully understanding the requirements of process safety systems, including relief devices, and safety instrumented systems. Have experience of leading the management of change process for proposed modifications to a design or operating plant. Have experience with managing project process documentation, including P&IDs; functional logic tables; alarm and trip settings; critical safety tables; control strategies; and operating procedures/training manuals through commissioning. Critical thinking skills and problem-solving capability. Be a strong and effective leader of a team of process engineers or a dedicated multi-disciplinary technical task force with experience of planning your tasks/projects and delivering them to a budget and schedule. Effective communication skills and a willingness to seek out cross-functional technical expertise as required, with a proactive approach to problem solving The ability to provide written reports or presentations of technical work to a variety of audiences Have the ability to lead and mentor junior engineers Ideally have knowledge of Saudi Aramco specifications and standardJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Chemical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}