{
    "Job ID": "4730867",
    "Description": "We’re looking for an energetic individual, with the ability to learn and a positive attitude. Our ideal candidate will come from the paint industry, who has previously worked in Research and Development Department of a paint manufacturing company.Be part of an innovative team and get the opportunity to leave your mark In this role, you will be responsible to design, plan, and conduct projects on new and existing coating systems to meet product profile, performance parameters, test protocols, commercial targets, upscale batches in production, and achieve target as per committed milestone plans.As a Scientist you will be responsible to:Test products and raw materials in accordance to regional, international standard, Hempel procedures and support departments cross functionally to meet the strategic business objectives.\nSupport the business by working with cross functional teams in collaborative projects and be willing to travel internationally to support the business.\nComply with safety regulations and meet objectives related to sustainability, 6S, Quality, HSE Management Systems and continuous improvement.\nYou will report to the Head-R&D/Middle East.Skills",
    "Skills": [
        "Minimum graduation in Chemistry or related sciences.\nHave a minimum of 5 years experience in formulating, testing and applying Decorative,\nIndustrial, Sports Flooring and Coatings for Car Parks, Traffic and products related to chemical and corrosion resistance areas with waterborne, solvent borne and solvent free technologies.\nGood knowledge on Colour Management.\nShould have good presentation and report writing skills and knowledge of MSOffice.\nBe fluent in English (both spoken and written), knowledge of Arabic will be an added advantage.\nAbility to work on different software platforms for entry of formulations, raw materials and support safety and sustainability.\nBe a differentiated solution provider, have ability to mitigate risk, eye for details, good TEAM player and work across multi national diverse culture to meet KPI and create value for the business across the value chain."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Bahrain",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}