{
    "Job ID": "4730545",
    "Description": "Instructional Designer (Training)On behalf of the fastest-growing retail company in the Middle East, our client is hiring an Instructional Designer for their Human Capital – Training Department.Based in Riyadh and reporting to the Senior Talent Manager.You will play a crucial role in designing and developing engaging and effective learning materials for our organization. This role involves collaborating with subject matter experts and using instructional design principles to create training content that supports the development of employee skills and knowledge.Key Responsibilities:Collaborate with subject matter experts (SMEs) to gather content, identify learning objectives, and understand the target audience.\nDesign and develop instructional materials, including training manuals, presentations, e-learning modules, videos, and assessments.\nApply adult learning theories and instructional design best practices to create engaging and interactive learning experiences.\nUtilize authoring tools, graphic design software, and multimedia resources to enhance the quality and interactivity of training content.\nDevelop storyboards and prototypes for e-learning modules and other digital learning materials.\nEnsure that learning content is accurate, relevant, and aligned with organizational goals and objectives.\nIncorporate various instructional strategies, such as scenario-based learning, simulations, and case studies, to enhance learner engagement.\nConduct needs assessments to identify training gaps and recommend appropriate learning solutions.\nCollaborate with the Training Coordinator to schedule and coordinate training sessions and workshops.\nStay updated on emerging trends and technologies in instructional design and e-learning.\nReview and update existing training materials to ensure accuracy and relevance.\nWork with the L&D team to evaluate the effectiveness of training programs and make necessary improvements.\nCollaborate with the Technology and Systems Support team to ensure smooth delivery of e-learning content through the Learning Management System (LMS).\nProvide guidance and support to trainers and facilitators during training delivery.\nMaintain a portfolio of completed instructional design projects and showcase innovative solutions.Skills",
    "Skills": [
        "Bachelor's degree in Instructional Design, Education, Training, or a related field (Master's degree is a plus).\nProven experience as an instructional designer or in a related role.\nProficiency in instructional design methodologies, adult learning theories, and e-learning development tools.\nStrong expertise in using authoring tools, graphic design software, and multimedia resources to create engaging content.\nExcellent written and verbal communication skills.\nAttention to detail and ability to manage multiple projects simultaneously.\nStrong collaboration and teamwork skills to work effectively with subject matter experts and other team members.\nFamiliarity with Learning Management Systems (LMS) and e-learning platforms.\nCreative mindset with a focus on innovation and continuous improvement.\nProblem-solving skills and ability to adapt to changing requirements and technology.\nPortfolio showcasing previous instructional design projects is a plus."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 32"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale; Training & Education Center",
        "Company Type": "Recruitment Agency",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}