{
    "Job ID": "4730719",
    "Description": "• Greet customers and help interpret their service needs. Where necessary seek technical diagnostic advice from relevant service personnel.• Ensure customers receive price estimates at the time of receipt of vehicle or before.• Respond promptly to telephone queries from customers.• Liaise with customers of completion deadlines are unlikely to be met.• Liaise with Cashier to ensure due payment received prior to release of vehicle.• Ensure Reception area is maintained clean and tidy at all times.• Ensure all relevant information is clearly & correctly recorded on the Job Card.• Ensure that instructions on Job cards are clear and concise such that they cannot be misinterpreted by the technician.• Interpret any pertinent warranties and ensure customers are aware of their rights.• Ensure customers’ vehicles are neatly parked in the designated areas.• Liaise with Workshop Controller to plan future appointments and ensure optimum shop loading.• Together with Workshop Controller, manage customer appointment system.• Assist the parts department, wherever possible, to promote parts sales for repairs and with reducing dead stock levels.• Ensure compliance to DPR & other standards required by the company,• Perform other duties as assigned by immediate manager.Skills",
    "Skills": [
        "• Minimum 3 years of relevant experience",
        "• Good command of English Language",
        "Skills required:",
        "• Troubleshooting – Determining causes of operating errors and deciding what to do about it.",
        "• Reading Comprehension – Understanding written sentences and paragraphs in work-related documents.",
        "• Writing – Communicating effectively in writing as appropriate for the needs of the audience.",
        "• Speaking – Talking to others to convey information effectively.",
        "• Active Listening – Giving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Automotive Dealership & Distributor; Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}