{
    "Job ID": "4730034",
    "Description": "Supports the Top Management in the HSE Policy and Guidelines issue.\nSupports the Top Management in the Organization roles and responsibilities definition, for what concerns safety aspects.\nSupports the Top Management in the HSE Management System standard issue.\nEnsures, in accordance with the Corporate guidelines, the implementation, updating, review and auditing of the Company HSE Systems.\nMonitors the effective implementation of appropriate Safety and Environment System procedures and provide for their updating in line with changes in Legislation and Company Directives.\nProvides for motivation and familiarization of all Company personnel respecting the importance of complying with Company system procedures and all Safety equipment provided.\nAssists the Commercial, Engineering and Operations Department in their dealings with Clients in all issues concerned with Health and Safety at work.\nConducts safety audits both internal and external.\nTakes part in accident / incident investigation.\nCarries out analysis of accident / incident statistics, identifying trends and suggesting improvement plans.\nProvides technical support to Senior Management on any safety related subjects.\nCarries out any in-house safety training.\nCarries out safety audits on Sub-contractors.\nLiaises between Clients on safety related issues.\nSafeties related engineering input into new projects and modification programs.\nPerforms Risk Assessment.\nPreparation of Health and Safety documentation for new tenders.\nProvides Safety support and advice, including supervision on preparation of plans and procedures for initial contract start up activities.Skills",
    "Skills": [
        "Safety Management: A strong understanding of safety regulations, standards, and protocols is essential to ensure a safe working environment for employees.\nRisk Assessment: Ability to identify potential workplace hazards, assess risks, and develop strategies to mitigate them effectively.\nEmergency Response Planning: Developing and implementing emergency response plans to address various situations, including accidents, fires, or natural disasters.\nRegulatory Compliance: Staying up-to-date with local, national, and international safety and environmental regulations and ensuring compliance within the organization.\nSafety Training: Designing and delivering safety training programs for employees and management to increase awareness and promote safe practices."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}