{
    "Job ID": "4730501",
    "Description": "Job Accountabilities and Responsibilities:  1.   Execution of offshore project work in accordance with the project execution plan, including Client and/or Project Procedures on Safety and Quality Control within the man-hour, cost and the project schedule targets delivering across study, FEED, EPC and PMC scopes of work. 2.   Serves as the Lead Engineer and/or discipline technical authority when required on projects. 3.   When assigned as the lead, manages the piping scope of work within the agreed budget and timeframe, ensuring that key milestones are met for overall project delivery. 4.   Supervises less experienced piping engineers and, where required, be line manager for piping engineers within the Qatar office. 5.   Follows company standards and procedures to meet with schedule and budget as advised by the Engineering Manager 6.   Demonstrate appreciation of commercial and technical risks, managing these appropriately within own work and highlighting any significant issues to the Engineering Manager 7.   Provide piping input to tenders and project estimates in the development of method statements, deliverable lists, manhours, CTRs and risk take. 8.   Ensures the delivery of challenging corporate, project and client targets using sound technical knowledge and decision-making skills. 9.   Acts as Client’s technical representative for the piping discipline in design reviews such as HAZID, HAZOP, plot plan and 3D model reviews. In this capacity also closely coordinates with clients and third parties. 10.   As a technical specialist, demonstrate, provide and develop appropriate technical solutions for specific piping design issues, in accordance with relevant industry or project codes and standards. 11.   Proactively engages and interfaces with other disciplines and third parties to ensure delivery of work scope to meet project and client expectations. 12.   Produce, review, and take accountability for the accuracy of calculations, specifications and other piping deliverables to define the Piping and Plant Layout requirements of our projects. Such deliverables may include but are not limited to the following: 13.   Piping design basis, piping line list, interface schedule, valve list, special items list, support schedule, wall thickness calculations, stress analysis report, etc. 14.   Preparation and development of enquiry packages including Specifications, Datasheets, Request for Quotation and Technical Bid Evaluation relating to piping materials.  15.   Coordinate closely with Process and Material SMEs for selection and development of piping material specifications. 16.   Provide direction and guidance to designers in production of the 3D model and piping drawings such as plot plans, line shoots, general arrangement drawings, isometrics, tie-in details, etc. 17.   Reviewing, checking and approving of the piping deliverables to ensure accuracy and alignment with the scope of work prior to issue. 18.   Work closely with other disciplines, coordinating all input for the plant layout and 3D model. 19.   Manages the closeout of actions and clash, taking a leading role in the resolution of discipline interface issues. 20.   Collaborate with other disciplines in the resolution of pipe stress and equipment connection issues. 21.   Provide timely support and input in the completion of other discipline deliverables. 22.   Review and approve material take off for the Piping discipline. 23.   Complete technical reviews and audits within the Piping discipline for projects of varying complexity 24. Complete site surveys and data gathering activities for brownfield scopes of work. 25.   Remain up to date with the latest technical developments in fields of expertise. 26.   Takes a proactive approach to personal & professional development. 27.   Seeks and supports opportunities for department and project improvement, contributing to the development of solutions. 28.   Support recruitment, training and development of piping personnel.  Skills",
    "Skills": [
        "Required qualification and experience: ",
        " ",
        "•   Engineering Degree in Mechanical Engineering or similar. ",
        "•   Minimum of 15 years of relevant experience. ",
        "•   Proven experience in key piping competencies, including Piping Design/Routing, Plant Layout, Stress Analysis and Piping Materials for the Oil & Gas sector. ",
        "•   Skilled with the development of plant layout in both onshore and offshore environments, having a detailed understanding of design fundamentals and criteria relating to process flow, safety spacing, access/egress, operations and maintenance.  ",
        "•   Experienced in the design and selection of pipe supports and equipment connections for both onshore and offshore facilities. ",
        "•   Familiar with Piping 2D and 3D design tools such as Hexagon SP3D, Aveva E3D, Bentley AutoPlant, AutoCAD, Microstation, etc. ",
        "•   Familiar with piping stress analysis tools such as Caesar II, capable of representing the company in piping stress and pipe support design. ",
        "•   Must be highly experienced with plot plan and 3D model reviews, ideally having facilitated such reviews for both onshore and offshore facilities. ",
        "•   Familiar with Flow and Acoustic induced vibration studies, along with the impact to piping design. ",
        "•   Experienced with other design reviews such as HAZID and HAZOP, capable of representing the discipline as the technical authority in these studies. ",
        "•   Experienced with different technologies and techniques for tie-ins is desirable, hot and cold tapping techniques for example. ",
        "•   Experienced with management of vendors, able to complete Technical Bid Evaluations and oversee development of vendor scope. ",
        "•   Construction and site experience is desirable, with exposure to the management and resolution of pipe and pipe support issues. ",
        "•   Familiar with and experience in the application of international design codes and standards such as BS, API, ASME B31.3 and B31.8 ",
        "•   Ideally has experience with Qatar O&G customer design standards including Shell DEPs ",
        "•   A self-motivated, proactive individual with high achievement drive and initiative, excellent verbal and written communication skills and good organisational awareness ",
        "•   Ability to impact and influence fellow workers. ",
        "•   Display analytical and innovation skills to manage new technology. ",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}