{
    "Job ID": "4730885",
    "Description": "We are looking for an experienced Agricultural Engineering Manager to join our team in Dubai, UAE. As an Agricultural Engineering Manager, you will be responsible for overseeing all aspects of agricultural engineering projects, from planning and design to implementation and maintenance. You will work closely with cross-functional teams to ensure that projects are completed on time and within budget, while also ensuring compliance with local regulations and industry standards.Responsibilities:Lead and manage agricultural engineering projects, including site selection, design, and implementation.\nCollaborate with cross-functional teams, including farmers, agronomists, and contractors, to develop project plans and ensure successful project execution.\nOversee the construction and installation of agricultural equipment and infrastructure, ensuring quality and safety standards are met.\nMonitor project progress, identify issues, and implement corrective actions as needed to ensure project objectives are achieved.\nEnsure compliance with local regulations and industry standards, including environmental regulations and health and safety guidelines.\nManage project budgets, including cost estimation, tracking, and reporting.\nProvide technical expertise and guidance to team members and stakeholders.\nStay up-to-date with the latest advancements in agricultural engineering technologies and practices.\nIdentify areas for improvement and implement process enhancements to optimize project efficiency and effectiveness.\nCollaborate with external partners and vendors to source materials and equipment.Skills",
    "Skills": [
        "Project management\nAgricultural engineering\nTechnical expertise\nProblem-solving\nCommunication skills",
        "Preferred Candidate:",
        "Bachelor's degree in Agricultural Engineering or a related field.\nProven experience in managing agricultural engineering projects.\nStrong knowledge of agricultural practices, equipment, and infrastructure.\nExcellent project management and organizational skills.\nAbility to work effectively in cross-functional teams and collaborate with stakeholders at all levels.\nStrong problem-solving and decision-making abilities.\nExcellent communication and leadership skills.\nKnowledge of local regulations and industry standards.\nProficiency in project management software and tools.\nAbility to work in a fast-paced and dynamic environment."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}