{
    "Job ID": "4730467",
    "Description": "On behalf of the fastest-growing retail company in the Middle East, we are seeking an ambitious and results-oriented Head of Marketing to unleash the company’s potential across the Middle East, with a special focus on Saudi Arabia, through building a superstar team and executing to perfection. As Head of Marketing, this is an opportunity to join a team that is redefining what it means to shop for your home, in-store, and online. This is a unique leadership opportunity set at the intersection of brand building, marketing, growth, and analytics; perfect for someone who is looking to leverage their skills in taking on complicated challenges to unlock tremendous potential!To thrive as Head of Marketing, you will need to lead the core areas of the marketing department, including digital marketing, web-based content, offline and online media marketing, social media marketing and direct marketing.Evaluating and developing marketing strategies, planning and coordinating marketing efforts, communicating the marketing plans to those involved, and building awareness and positioning for the company's brands.Leading the development of all marketing plans.\nEnsuring the implementation of effective marketing strategies.\nFocusing on growing audiences and the uptake of products and services.\nReviewing and reporting on all areas of the marketing strategies and their implementation.\nDeveloping the corporate brand identity in consultation with senior managers.\nManaging creative agencies and retainer partners.\nCollaborating with senior team members across all departments to uncover insights and\ncreate innovative marketing and branding strategies.\nIdentifying ways to grow the marketing department and secure resources.\nSourcing talent to ensure the curation and retention of specialist skill sets across your\nteams.\nMonitoring, reviewing, and reporting on all marketing activities, results, and ROI.\nConducting strategic marketing analysis that will help guide marketing messages.\nOverseeing social media planning and execution.\nConsistently identifying new or expanded revenue opportunities and strategizing the\nimplementation of plans.\nConception, development, and implementation of marketing plans and strategies, product\nConcepts, and promotional programs to drive interest and sales.\nWorking to continuously ensure the company marketing goals are communicated across the\nentire organization and improving the company’s marketing outreach efforts.\nEnsuring that all current marketing and copyright regulations comply with accepted\nprofessional standards, policies, procedures, and legislation. \nPromoting and embedding strong and inspirational leadership in the entire team by demonstrating the company’s values and championing the leadership behavior framework.\nEfficiently managing annual marketing budgets.Skills",
    "Skills": [
        "You must be passionate about customers and continuously seek to understand their needs and desires.",
        "Skilled at working across teams to identify, develop, and launch world-leading market acquisition efforts through a mix of all mediums.",
        "Bachelor's Degree.\nMBA or equivalent Master’s degree.\n5+ years of experience.\nStrong bias for data-driven decision-making and experience in distilling complex, analytically dense products into client-facing solutions.\nCreative and analytical thinking to drive metrics and benchmarks to ensure continuous improvement in process and results.\nDemonstrated high attention to detail and proven ability to manage multiple, competing priorities simultaneously.\nExperience using data and metrics to measure impact and determine improvements.\nExperience using Microsoft Excel to cleanse and analyze data.\nDemonstrated ability to build, execute, and scale marketing communication programs.\nProven track record establishing program(s) end-to-end, from the ground up.\nWorking knowledge of search engine optimization (SEO), lead generation and affiliate marketing practices, techniques, and outcome expectations.\nExcellent oral and written communication skills, in Arabic and English.\nProven track record of influencing others to drive your key business KPIs \nDecisive, action-oriented, and able to motivate, inspire, and lead cross-functional teams.\nAmbitious self-starter with demonstrated ability and willingness to roll up sleeves and execute to get the job done.\nStrong drive for results, with the ability to manage independently and take calculated risks · Excited by change and comfortable working with uncertainty.\nAbility to succeed in a fast-paced, innovative, and rapidly evolving industry and business organization.\nAn entrepreneurial spirit and a passion for having fun."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 14",
        "Residence Location": "All Arab Countries; All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}