{
    "Job ID": "4730832",
    "Description": "Our company is seeking a highly experienced QHSSE Manager to join our team.Responsibilities:Develop and implement QHSSE policies, procedures, and programs to ensure compliance with ISO standards and industry regulations.\nConduct regular audits and inspections to identify potential hazards, non-compliance issues, and areas for improvement.\nImplement corrective actions and monitor their effectiveness to ensure ongoing improvement in QHSSE performance.\nProvide leadership and guidance to the QHSSE team, ensuring they have the necessary resources and support to carry out their responsibilities effectively.\nCollaborate with internal departments and external stakeholders to develop and implement risk management strategies.\nStay up-to-date with industry trends and developments in QHSSE management and make recommendations for improvement.\nPrepare and submit reports to management and regulatory agencies as required.\nEnsure all employees are trained and educated on QHSSE policies, procedures, and best practices.\nInvestigate incidents, accidents, and near misses to determine root causes and implement preventive measures.\nManage emergency preparedness and response activities, including drills and exercises.Skills",
    "Skills": [
        "The ideal candidate will have a minimum of 15 years of experience in quality assurance, health, safety, security, and environment. They should have a strong knowledge of ISO standards and preferably come from the cement industry or a related field such as building materials or manufacturing. Professional courses such as NEBOSH, OSH, IOSH, or other specialized industry-related training are preferred.",
        "Quality assurance\nHealth and safety management\nEnvironmental management\nRisk assessment and management\nISO standards",
        "Preferred Candidate:",
        "Minimum of 15 years of experience in quality assurance, health, safety, security, and environment.\nStrong knowledge of ISO standards and industry regulations.\nExperience in the cement industry or related fields such as building materials or manufacturing.\nProfessional courses such as NEBOSH, OSH, IOSH, or other specialized industry-related training.\nExcellent leadership and communication skills.\nStrong analytical and problem-solving abilities.\nAbility to build and maintain effective relationships with stakeholders at all levels.\nAttention to detail and a commitment to quality.\nAbility to work independently and as part of a team.\nProficiency in Microsoft Office Suite and QHSSE management software."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15 Max: 19",
        "Residence Location": "All GCC Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}