{
    "Job ID": "4730800",
    "Description": "We believe life doesn’t stop with a cancer diagnosis–and that has everything to do with a team of doctors, specialists, and nurses committed to patient-centered care. We are in search of an experienced oncologist who will rise to our high standards of cancer care and groundbreaking research. Our ideal candidate is compassionate, listening to each patient’s concerns, preferences, and needs in order to help them achieve the best outcome. This requires a keen understanding of the latest techniques in diagnosis, surgery, chemotherapy, and radiation therapy, as well as newer techniques such as interventional radiology and immunotherapy. Above all, you should have a passion for meeting the needs of patients and their families at every phase of their cancer journey. Responsibilities: ●       Collaborate with a multidisciplinary team to accurately assess patient needs and develop a treatment plan that meets those needs●      Participate as a key member of the patient care team to formulate treatment plans and monitor patient progress●      Utilize and promote approved standards of care, procedures, methods, techniques, safety precautions, and study protocols●      Participate in the development, review, and evaluation of standard operating procedures and study-specific procedures●      Mentor junior doctors and medical students, perform auditing and research, and attend conferences and committee meetings as necessary●      Order several diagnostic tests, which includes biopsy, imaging procedures, and blood tests, to confirm a specific diagnosis●      Provide patients with detailed information regarding cancer, the prognosis of the disease, and possible interventions or treatment options they may choose to undergo●      Develop appropriate treatment plans, complete with measurable goals, that provides the highest level of care while considering and respecting patient preference●      Maintain patients’ quality of life by managing cancer-related pain and other symptoms and side effects of treatment●      Reassess progress of the disease as treatment progresses and pursue alternative therapies as needed, as well as palliative care when appropriate●      Participate in training sessions and correspondence for respective study protocols and clinical trials, ensuring confidentiality is maintained Skills",
    "Skills": [
        "Requirements: ",
        " ",
        "●      MD or MD/PhD with medical training specifically in oncology",
        "●      Board certification in oncology with state license in good standing",
        "●      Ability to interpret clinical, genomic, and efficacy data",
        "●      Motivated to work in a fast-paced environment",
        " ",
        "Preferred Qualification:",
        " ",
        "●      Experience in research and/or clinical protocols",
        "●      The ability to effectively communicate with patients, caregivers, and fellow medical professionals",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}