{
    "Job ID": "4730797",
    "Description": "As an integrated health system committed to providing superior medical care to the members of the community we serve. We’re a 500-bed general and surgical acute-care hospital offering major services in cardiology/cardiovascular surgery, oncology, neurology/neurosurgery, orthopedics, emergency care, as well as many other specialties. We’re seeking an experienced anesthesiologist to join our thriving department. The individual must be comfortable supervising or running their own cases, and also be willing to take a leadership role in facilitating patient care. Job Responsibilities ●      Uphold the hospital’s guiding principle of providing superior medical care and education●      Oversee aesthetic procedures to ensure they are in line with best practices, and continue to assess risk throughout procedures●      Exercise fair and ethical medical judgment●      Adhere to medical staff bylaws, rules, and regulations●      Provide anesthesiology and pain management services to patients as directed or required●      Communicate with patients and families throughout the entire surgical process, including preparation, surgery, and recovery●      Mentor medical students and residents on various procedures as warranted●      Maintain comprehensive records of medical procedures and patient care Skills",
    "Skills": [
        "Job Skills & Qualifications",
        "Required:",
        " ",
        "●      Doctor of Medicine qualification",
        "●      Familiar with standard concepts, practices, and procedures of anesthesiology",
        "●      Board certified to practice anesthesiology and completion of 5 years residency",
        "●      Valid country license to practice",
        "●      Minimum 3 years of experience in the specialty",
        " ",
        "Preferred Qualification:",
        " ",
        "●      Excellent written and verbal communication skills",
        "●      Willingness to work on a team to accomplish a greater goal"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical Hospital; Medical Clinic",
        "Company Type": "Recruitment Agency",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}