{
    "Job ID": "4730979",
    "Description": "MAIN PURPOSE OF JOBTo support the growth of the Company by managing the supply, procurement, and maintenance of equipment and services for projects in accordance with corporate strategies and Company policies and procedures.JOB OBJECTIVESTo formulate long term plans and objectives to manage the efficiency of the Department and reduce downtime.\nTo make recommendations to Management regarding the acquisition and disposal of equipment and vehicles.\nTo manage equipment workshop functions for repairs and preventative maintenance and servicing according to manufacturers specifications and recommendations.\nTo manage the administration of the Department and advise on technical matters related to equipment and machinery.\nTo facilitate the procurement and finalize purchases for new equipment/vehicles and respective spares.\nTo coordinate with Projects for the supply of equipment, vehicles and services to ensure an efficient operation and availability.\nTo develop, review and approve procedures and practices for the efficient operation of the Division within the Company’s guidelines and framework.\nTo establish links with suppliers and rental companies for the purchase and hire of equipment, vehicles and services.\nTo action strategic plans and directives of Corporate management including the implementation of safety procedures, according to Company policies and procedures and international standards.\nTo advise on technical matters related to equipment and machinery to Projects and internal and external customers.SAFETY AND QUALITY RESPONSIBILITIESMaintain standards of safety and comply with Company’s Health, Safety & Environment Management System requirements.\nTake reasonable care of own health and safety and that of others in the workplace.\nFollow and maintain Company standards of Quality in accordance with Company Quality System requirementsSkills",
    "Skills": [
        "EDUCATION, SKILLS AND EXPERIENCE",
        "A Bachelors Degree in Mechanical Engineering\nManagement and supervision\nBusiness Administration\nNegotiation and Conflict resolution\nSafety regulations\nQuality Management\nVendor and Equipment training\nTechnical Application\nData Analysis\nInterview techniques\nInterpersonal Relations\n13 to 15 years of work experience as a Mechanical Engineer"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}