{
    "Job ID": "4731222",
    "Description": "Job Summary:The primary role is to participate in examining and evaluating the adequacy and effectiveness of the organization’s governance, risk management and internal controls as well as the quality of performance in carrying out assigned responsibilities to achieve the organization stated goals and objectives, with carrying out audits related to company activities in accordance with audit Plan. Job Duties:o Responsible for obtaining an understanding of key business activities and operations, identification of risk areas and control gaps as a part of ‘Audit Planning’ process.o   Participate in conducting regular audits on company operations and functions, review effectiveness of internal controls and compliance with company policies and procedures and recommend actions enhance control weaknesses and improve operations.O Contribute to developing ‘Audit Programs & Forms’ for audit engagements (including field visits).o Participate in executing and finalizing ‘Audit Scope’ for planned audit engagements and make appropriate modifications, based on inputs from business units to ensure its adequacy.o Assist in developing audit plans and defining the scope of audits and audit programs and ensure an on-target implementation of the same.o Report ‘significant risk exposures and control issues’, including fraud risks, governance issues, and other matters needed or requested by the audit director.o Organize working papers and notes for ‘Discussion Meeting’, with completion of fieldwork to ensure ‘Audit Conclusions’ are based on complete understanding of the activity or process and identified risks; and to ensure audit conclusion are well documented.o Review and discuss draft of ‘Internal Audit Reports’ with Internal Audit director upon completion of fieldwork.o Keep track of working papers for all completed engagements for ‘Archiving’.o Reporting the ‘Progress’ of the assigned engagements/ tasks to audit director on periodic basis.o Perform follow-up of engagements and report its results to audit director.Perform other related duties as assigned by the audit director.Skills",
    "Skills": [
        "Education:",
        "Bachelor’s degree in accounting, Finance, or equivalent.\nProfessional certification in accounting or auditing such as CIA, CPA, and CA will be an asset.",
        "Experience",
        "·        At least 2 years of experience in internal audit for Contracting business, with high level of contemporary theories and practices related to Internal Audit and Risk Management",
        "Skills",
        "Strong technical Audit skills.\nStrong analytical ability.\nCapable of giving strong attention to details.\nStrong problem-solving skills.\nGood presentation skills.\nConversant with Microsoft Office applications and Audit Management Analysis tools and software.\nGood written and oral communication skills in English."
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "At Taawun, Riyadh , Saudi Arabia",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}