{
    "Job ID": "4731810",
    "Description": "Job QualificationB.S./M.S Degree in Engineering, Construction Management, Computer Science with 10+ years of experience in engineering/ construction innovation or technology in design and construction with min. 7+ years as BIM/VDC manager, innovation/technology deployment lead for construction\nUnderstand project workflows from estimation, design, construction management, sub-contract administration and coordination through to handover to the client.\nPrevious experience implementing innovative and digital technologies and methodologies in construction.\nUnderstanding digital tools and processes used in engineering and construction such as Revit, Civil3D, 4D Planning, AR/VR technology solutions, integrating GIS for field data collection and visualization, data analytics, PowerApps, use-cases related to drone imagery, AI/ML and machine control. Familiar with databases and information management principles.\nFamiliar with collaboration and data and information management solutions: CDEs, BIM 360 Suite, Navisworks, Infraworks for visualization, 3D/BIM-enabled quantity takeoff, Synchro4D, ESRI GIS Field Maps/Survey 123\nProven experience leading and participating in cross-functional initiatives as a change agent.\nProficient in oral, visual, and written communications skills. Collaborate well in a team environment. Experience presenting to executive level audiences is a plus.\nAbility to manage multiple concurrent priorities and take on additional evolving responsibilities.\nDesign thinking experience and/or familiarity with six sigma and LEAN principles is a plus.\nExpertise with crowdsourcing platforms, ideation tools and techniques is a plus\nDemonstrated ability to facilitate meetings and ensure follow through in its discussions.\nExperience in organizational change management and institutionalizing new processes and tools.\n4D modeling, building construction story boarding, sequencing, CPM scheduling.\nUnderstand the solution deck and use-cases for Digital Twin for Construction and O&M related to Rail, Heavy Civil and Urban Infrastructure and use of AI/Analytics to enhance outcomes for each use-case.\nFamiliar deploying construction solutions from key equipment suppliers such as Trimble, Propeller, Honda, Volvo, Caterpillar, etc.  \nAdvance communication and presentation skills is a must for this role.\nExperience working in KSA or an understanding of technology company landscape in KSA is a plus  Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}