{
    "Job ID": "4731460",
    "Description": "This position is responsible for handling all HR issue such as company recruitment process, payroll and personnel, performance management system, training and development, HRIS management company policies and procedures and employee labor relations. ·      Responsible for personnel function including fulfilling personnel filing system, employee on-boarding, employee contracts, hiring procedures, social insurance document fulfilling.·      Responsible for the off-boarding function including exit documents, exit interviews, social insurance document fulfilling. ·      Handling all related issues to employee vacation balances for all employees.·      Will take care of all governmental issues related to work office, social insurance in terms of reports, audits and documents.·      Handling the administration function which includes the management of the reception function, office hygiene and office security procedures.·      Manage the employee insurance operations including building relations with HR-related service providers {e.g. medical insurance, life insurance, ect…}, maintaining employee medical files, medical cards and managing the operations between Majestic and the service provider.·      Providing punctual and accurate input to the payroll and benefits processing, through on time payroll execution and effective coordination with Finance Department and banks.·      Developing and maintain an accurate organization structure in terms of organization charts, conducting job analysis, develop job descriptions, etc...·      Responsible for the recruitment process including the ads posts, headhunting, membership in recruitment agencies, conducting interviews, etc… to ensure having the suitable candidate in place.·      Conduct orientation session for newly hired employees including company overview, leave and vacation system, incentive and benefits, performance system and general policies. ·      Implement the performance management system on quarterly basis and review performance appraisal vs the HR policy. .·      Effectively manage the training needs analysis for employees. Develop presentation for HR training. Build good relationship with service providers and offer the best training with the lowest cost. Build an employee training record database.Skills",
    "Skills": [
        "·      A university graduate holding a Bch degree.",
        "·      HR studies is a must.",
        "·      Experience not less than 8 years in the HR field.",
        "·      Accuracy, analytical and figure oriented person.",
        "·      Excellent communication skills and able to build good relations.",
        "·      Very good English language {spoken and written}",
        "·      Proficiency in Microsoft office applications and report writing skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}