{
    "Job ID": "4731163",
    "Description": "Roles and ResponsibilitiesWe are seeking an exceptional and experienced Executive Housekeeping Manager for a high-profile related project in the Kingdom of Saudi Arabia. If you possess 5+ years' experience in a 5* environment as an Executive Housekeeper with a strong track record of effectively managing large housekeeping operations and leading a diverse team, we want to hear from you!Skills",
    "Skills": [
        "Minimum 5+ years of experience as an Executive Housekeeping Manager in a 5* setting, for a project in a remote location.",
        "- Demonstrated ability to effectively manage large housekeeping operations and lead a diverse team.",
        "- Exceptional organizational and communication skills to coordinate with various departments and ensure a cohesive guest experience.",
        "- Previous work experience in European hospitality preferred, with an understanding of European service principles.",
        "- European Hospitality-related education or certifications will be preferred.",
        "- Strong problem-solving skills and the ability to adapt to dynamic situations with a passion for delivering exceptional service.",
        "**Both male and female candidates are welcome to apply for the role.",
        "**Note: This role is remote and requires the candidate to be based in the Kingdom of Saudi Arabia.**",
        "If you are a driven and dedicated professional with a keen eye for detail and a passion for delivering unparalleled hospitality, we invite you to apply for this unique opportunity."
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Western Province, Saudi Arabia",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Recruitment Agency",
        "Job Role": "Cleaning Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$7,000 - $8,000",
        "Number of Vacancies": "1"
    }
}