{
    "Job ID": "4731532",
    "Description": "Act as HR Business Partner representing Corporate HR Function in AHC’s subsidiary to provide strategicand operational HR support, guidance and advice to the business.Key Accountabilities / Responsibilities:In coordination with CHRO, serve as a consultant to the subsidiary management on human resource related issues in the assigned subsidiary.\nServe as an employee champion and change agent in the assigned subsidiary.\nConsult with line management and provide HR guidance when appropriate.\nAnalyse trends and metrics in partnership with the CHRO to develop HR solutions, programs and policies.\nFor the HR matters that require legal consultation in the in the assigned subsidiary, partner with the legal department as needed/required.\nServe as a focal point of contact for all HR matters including Employee Relations related matters of the assigned subsidiary.\nProvide input for manpower planning; manage onboarding of new joiners at the assigned subsidiary and facilitate performance management system in the assigned subsidiary.\nFacilitate to identify training needs and coordinate training delivery for the assigned subsidiary.\nIn coordination with HRIS, provide updated regular reports on headcount, hiring, separation, Saudization data etc for the assigned subsidiary.\nCarry out HR Operations related activities such as employees’ leave processing, disciplinary issues, GOSI processing, end-of-service benefits processing etc.\nMonitor and report employees’ working hours and timesheet in the assigned subsidiary. In case of discrepancies, if any, take action as per policy in consultation with the CHRO.\nProvide input for accurate and timely payroll preparation/processing by reviewing and verifying monthly payroll and overtime report of the assigned subsidiary.\nProcess all cases relating to employee separation including – but not limited to: retirement, resignation, contract expiry, contract termination.\nConduct Exit Interview of outgoing employees and share report in this regard with superiors.\nHandle employee grievances and serve as a contact point for all disciplinary matters in the assigned subsidiary.Skills",
    "Skills": [
        "Education:",
        "Bachelor’s degree, preferably in Business Administration or equivalent.",
        "Experience:",
        "A professional with hands-on experience in HR Management.\nOverall relevant experience of 5-6 years is required.\nknowledge of local labor law is mandatory.\nknowledge of Arabic language is mandatory.",
        "Competencies:",
        "Commitment\nTime management\nCommunication\nTeamwork\nSelf-development\nAdaptability\nResults Oriented\nCustomer Oriented\nNegotiation"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}