{
    "Job ID": "4731159",
    "Description": "Organize and participate actively in the training of other Engineers.\nActively lead and support the training of JFEs/JFTs and crew in his location.\nConduct Appraisals to Field engineers & technicians in location.\nTo follow and uphold all the company HSE&Q standards and to promote their respect, understanding and adherence.\nTo Lead in the local HSE&Q programs & meetings with Management Support.\nTo control quality of our service during all phases of the operation and to ensure that products of highest quality are delivered to the client.\nTo perform all  reporting  and  administrative  duties  concerning  the  field  operations, accurately and in a timely manner.\nTo ensure that the principles of internal maintenance systems are systematically applied on all tools and equipment of the Location and to keep it in a state of readiness.\nTo ensure that the status of all equipment in the Location is reported and kept up to date in the internal maintenance system.\nTo ensure that supplies are available at the wellsite to perform the operation.\nTake the lead to investigate Service quality issues with support of Service quality manager.\nPromotes a culture of safety awareness.\nEnsures their work areas are safe, clean and orderly at all times.\nFollows the company policies and procedures on health, safety and environment.\nSupports efforts to minimize general HSE&Q risks, and promotes respect, understanding and adherence to safety regulations.\nMaintains strict confidentiality of the company and client information.\nMake sure journey management completed for each mobilization.\nTakes an active part in the company HSE&Q related functions.Skills",
    "Skills": [
        ".5+ Years’ Experience in Wireline Logging operations, Preferred from Top 4 International Service Companies\nTo be able to run all available services the company can provide in all locations.\nLeadership attitude towards Service Quality, health, safety and the environment.\nAbility to communicate and attend to client requests in a timely manner.\nAbility to control assigned FEs/FSs & crew performance at all time.\n10K WHE Pressure Control Certification.\nTrain the Trainer Certification.\nThe physical ability to immediately respond to emergency situations\nWillingness to work & perform in high demanding environment conditions.\nAbility to perform under time constraints\nGood communication skills and strong personality\nAbility to work in a team and adapt quickly to the work environment.",
        "Qualification",
        "Degree of Engineering.",
        "Preference",
        "Kuwait Society of Engineering Membership."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}