{
    "Job ID": "4731330",
    "Description": "Responsible for overseeing a company's interactions with the public by implementing social media platforms' content strategies. Their duties include analyzing engagement data, identifying trends in customer interactions, and planning digital campaigns to build a community online.Key Accountabilities:Build and execute social media strategy through competitive research, platform determination, benchmarking, messaging, and audience identification.\nGenerate, edit, publish, and share daily content (original text, images, video, or HTML) that builds meaningful connections and encourages community members to take action.\nSet up and optimize company pages within each platform to increase the visibility of the company’s social content.\nModerate all user-generated content in line with the moderation policy for each community.\nCreate editorial calendars and syndication schedules.\nContinuously improve by capturing and analyzing the appropriate social data/metrics, insights, and best practices, and then acting on the information.\nCollaborate with other departments (customer relations, sales, etc) to manage reputation, identify key players, and coordinate actions.Skills",
    "Skills": [
        "2+ Years of experience in related fields.\nEnglish Proficiency.\nTechnical Competencies:\nCreativity and commercial awareness\nOutstanding both verbal and written communication skills\nTime management and organizational skills\nAdaptability to changing digital marketing trends and technologies\nThis list of responsibilities, requirements, and working relationships is not exhaustive. The employee may be required to perform other duties in line with business requirements and at the Company’s discretion."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}