{
    "Job ID": "4731867",
    "Description": "We are hiring for a Sales GirlA well-known Bakery Dubai, UAE is currently seeking a talented and enthusiastic Sales Girl to join their team. The ideal candidate will have a minimum of 1 year of experience in sales roles in a Bakery.Salary - AED 2500+Commission + TransportResponsibilities:Engage with potential clients in a professional and friendly manner.\nIdentify and understand customer needs and requirements.\nPromote and sell a wide range of products to customers.\nProvide exceptional customer service and ensure customer satisfaction at all times.\nBuild and maintain strong relationships with clients to encourage repeat business.\nKeep up to date with product knowledge and industry trends to provide accurate and relevant information to customers.\nMeet or exceed sales targets and objectives on a monthly basis.\nAssist in the development and implementation of sales strategies to drive business growth.\nCollaborate with the sales team to share best practices and achieve team goals.\nPrepare and submit accurate sales reports and documentation on a regular basis.Skills",
    "Skills": [
        "Preferred Candidate:",
        "A minimum of 1 year of experience in sales roles is required.\nA proven track record of achieving sales targets and objectives.\nExcellent communication and interpersonal skills.\nStrong customer service skills with the ability to build and maintain relationships.\nSelf-motivated and driven to succeed in a competitive sales environment.\nAbility to work well in a team and collaborate with colleagues.\nAttention to detail and strong organizational skills.\nAbility to work under pressure and multitask effectively.\nProficiency in Microsoft Office Suite and CRM software.\nFluency in English is required. Knowledge of Arabic is a plus.\nProven ability to meet or exceed sales targets.\nExcellent communication and interpersonal skills.\nStrong customer service and relationship-building abilities.\nSelf-motivated and driven to achieve success.\nAbility to work well in a team and collaborate with colleagues."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "Philippines"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}