{
    "Job ID": "4731337",
    "Description": "Research advertising trends\nResearch competitors’ pricing and products\nDecide on appropriate placement of ads\nDetermine what content will reach customers\nDevelop projects to create content\nPublish digital marketing content online\nImplement email marketing campaigns\nMeasure digital traffic\nMonitor social media and Google Analytics\nOptimize paid advertising campaigns using SEO and other tools\nReport on the growth and analytics of campaigns to stakeholders\nScale campaigns to maximize ROI\nMonitor project status and budget\nConduct market research to inform campaigns\nBrainstorm and implement experiments and conversion testsSkills",
    "Skills": [
        "Digital Strategy: Develop and execute comprehensive digital marketing strategies aligned with business goals.\nSEO and SEM: Proficiency in search engine optimization (SEO) and search engine marketing (SEM) techniques to improve online visibility and drive traffic.\nContent Marketing: Create and manage high-quality content for various digital channels to engage audiences and drive conversions.\nSocial Media Management: Expertise in managing and optimizing social media profiles and campaigns across platforms.\nEmail Marketing: Design and execute effective email marketing campaigns to nurture leads and retain customers.\nPPC Advertising: Skill in planning, creating, and optimizing pay-per-click (PPC) campaigns on platforms like Google Ads and social media.\nAnalytics and Data Interpretation: Ability to analyze digital marketing metrics, extract insights, and make data-driven decisions.\nConversion Rate Optimization (CRO): Experience in optimizing websites and landing pages to improve conversion rates."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}