{
    "Job ID": "4731282",
    "Description": "PositionHook Up SuperintendentLocation: Worldwide (currently in Qatar)Start date: As soon as possible (The contract starts on the Employee’s designated date of departure to Work location)Duration: 30.06.2024 (renewable)Rotation:Eastern Europe: 56/28 (56 paid working days followed by 28 unpaid leave days)\nWestern Europe: 56/28 (56 paid working days followed by 28 unpaid leave days)\nTCN: 90/30 (90 paid working days followed by 30 unpaid leave days)Salary:Eastern Europe: 9 000 EUR Consolidated Monthly (Paid only while working)\nWestern Europe: 9 000 EUR Consolidated Monthly (Paid only while working)\nTCN: 6000 USD Consolidated Monthly (Paid only while working)Working days/hours:12 hours/day - 7 days/weekInsurancesDeath & Disability + Life Insurance, Medical Insurance and Income protection provided by the companyFlightsPrepaid Economy class ticket at the beginning, and end of CNT and for each work leave rotation cycleMission:Organise, coordinate and control the execution of the Hook-up activities, both performed by subcontractors or in direct hiring, ensuring proper coordination between disciplines supervisors and Hook-up engineering, overseeing the availability of project materials, equipment and tools, verifying that works are carried out in accordance with project documentation, schedule, safety and quality standards and procedures\nRepresent Hook-up construction in daily meetings with the ClientTasksEnsure that Hook-up activities are carried out as per time schedule and adhering to the time frame allocated to the specific work tasks\nInterface with Hook-up Planning and Control Analyst to share information regarding the progress of the work, highlighting possible cause of deviations between the program and the work carried out and to analyze the forecast for Client/Third parties inspections\nInterface with Hook-up Engineering to request instructions to overcome possible problems/critical issues, propose alternative solutions and request preparation of technical queries\nEnsure the supervision and monitoring of the works performed, subcontracted or in direct hiring\nCoordinate Hook-up resources, indicating any needs or surplus\nIn conjunction with the commissioning superintendent, plan and monitor vendors or any specialists activities at site\nManage the technical and administrative documentation\nPromote safe works practices and environmental protection, ensuring that safety standards are respected\nEnsure that an effective Permit to Work system is implemented and maintained for the safe execution of the activities supervised by discipline specialists\nEnsure the Hook-up Marine Spread management is performed according to hook-up execution needs, in a timely and effective mannerAt Yard:Cooperate with the Hook-up team to give inputs and expertise into the preparation of project Job Card\nEnsure proper and time effective stocks of tools, equipment and consumables are arranged in line with project forecast workload\nSupport Hook-up Manager into material management and carry over management during weekly meetings with fabrication department\nProvide inputs to the definition of the Hook-up works detailed planning.Skills",
    "Skills": [
        "Project Management: Proficiency in overseeing the entire hook-up phase of a project, coordinating resources, schedules, and activities to ensure successful completion.\nTechnical Expertise: Deep understanding of engineering principles and construction practices related to hook-up activities.\nLeadership: Strong leadership skills to manage and guide a team of contractors, technicians, and other personnel effectively.\nCommunication: Excellent communication skills to convey project requirements, updates, and expectations to team members and stakeholders.\nProblem-Solving: Ability to identify and address technical and logistical challenges that may arise during the hook-up phase.\nPlanning and Organization: Skill in creating detailed hook-up plans, setting priorities, and managing resources efficiently.\nHealth and Safety: Expertise in adhering to strict health, safety, and environmental regulations during hook-up operations."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Accounting",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}