{
    "Job ID": "4731869",
    "Description": "Account Manager AfricanOur client is a 20-year-leading multinational Forex Trading Company headquartered in the UAE. They are looking for experienced Account Managers with a background in banking or Forex within the fintech industry.You can keep and expand your customer base by offering individualized service and access to the information consumers need.\nDeliver a superior customer experience and serve as our high-net-worth clients' point of contact, fixing any problems and providing support throughout their interaction with us.\nMake sure to achieve your own KPIs (net deposits, traded clients, call time, etc.); increase production, profitability, and the quality and experience of client service; respond to emails, helping with trades, withdrawals, and customer training; cooperate with pertinent departments to quickly address problems and concerns; give them accurate information on the company's goods and services; preparing and delivering a regular financial market update; daily, weekly, and monthly updates to customer portfolio reports; keep up-to-date on all that the organization has to offer;Skills",
    "Skills": [
        "• Has excellent English communication skills. Any more languages are viewed as beneficial.",
        "• At least two years of sales-related work experience, preferably in the financial industry:",
        "• Working with clients from Sub-Saharan Africa:",
        "• A university degree or its equivalent in a related discipline (such as business, finance, or economics)",
        "• Strong interpersonal and problem-solving abilities",
        "• The capacity to collaborate with stakeholders effectively",
        "• The ability to manage multiple tasks and track and report on progress",
        "• The self-motivation to work independently in a fast-paced, high-pressure environment",
        "• Excellent mathematics and numerical skills",
        "• Ability to collaborate, interact, and communicate with members of various teams and departments",
        "• Technical and fundamental analysis knowledge",
        "• Working with CM experience is regarded as advantageous"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "Kenya; Morocco; South Africa"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}