{
    "Job ID": "4731421",
    "Description": "Position Title:              SAP Quality Assurance ConsultantEmployment Type:      9-month contract- renewableSalary:                         up to 45K SAR all-inclusive, depending on experience and qualificationsJob Location:             Riyadh, KSAAbout the Client:A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSAJob Description:Quality Assurance Planning. Collaborate with project teams to define quality assurance strategies, test plans, and testing schedules for SAP implementations and upgrades\nTest Design and Execution. Develop comprehensive test scenarios, test cases, and test scripts based on functional and technical specifications\nDefect Management. Identify, report, and track defects using relevant defect tracking tools. Work closely with developers and functional consultants to resolve issues and ensure timely fixes\nTest Automation. Assess opportunities for test automation and implement automated testing frameworks to improve testing efficiency and accuracy\nDocumentation and Reporting. Create and maintain comprehensive testing documentation, including test plans, test cases, test scripts, and test execution resultsSkills",
    "Skills": [
        "Qualifications:",
        "Open to Arabic nationals\nMale, 45 years old and below\nAt least 6 years of experience in SAP quality assurance and testing\nProject Management certification (PMP, PRINCE2, etc.) is preferred\nImmediate joiners or with maximum 1 month notice will be prioritized"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 6",
        "Gender": "Male",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}