{
    "Job ID": "4731815",
    "Description": "Qualifications/Experience Essential Technical Skills:  Mechanical/Pipeline Engineering Degree from an accredited university with 15+ years of relevant experience in design management, related to Water projects.\nExperience in managing the design/installation/operation/maintenance of Water / Wastewater treatment plant, pumping stations and desalination plants.\nExperience in Hydraulic design, modelling, surge analysis, design of large diameter pipe & valve for potable water network and district cooling plant.\nExperience in both design-build and design-bid-build forms of procurement with contractors and consultants.\nExperience in field construction and inspection for initial acceptance.\nKnowledge of relevant codes and standards pertinent to the discipline.\nThorough knowledge of discipline engineering techniques, the design of engineered systems and design calculations.\nKnowledge of current computer applications for engineering and design including appropriate knowledge of CAD (both 2-D and 3-D) e.g AutoCAD, MS Word and Excel for managing design reviews.\nUnderstanding of the roles played by other departments on projects including basic construction practices and the economics involved.\nA professional license from a recognized licensing or registration board. Essential Behavioral Skills: Excellent interpersonal, analytical and communication skills (oral and written).\nWillingness to relocate to the job site in Saudi Arabia.\nProactive, supportive, inquisitive, challenging and result driven.\nHard working and motivated with high self-initiative.\nAbility to manage multiple assignments, changing priorities and work with ambiguity.\nHelp others and receive help from others in achieving goals.\nAcknowledge and value contribution from other team members.\nPromote the creation of a work environment, supported by leadership, which fosters openness, trust, communication, teamwork, empowerment, innovation, and satisfaction. #Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}