{
    "Job ID": "4731192",
    "Description": "Job descriptionJob description The candidate will follow up on leads and educate potential customers on the English education product via phone calls.Responsibilities:Outbound Calls:Making outbound calls to potential customers from a provided list.\nIntroducing products or services and explaining their benefits.Customer Engagement:Engaging prospects in a professional and persuasive manner.\nBuilding rapport and addressing any concerns or objections.Product Knowledge:Gaining a comprehensive understanding of the products or services being offered.\nBeing able to explain features, benefits, and pricing accurately.Needs Assessment:Listening actively to customers to identify their needs and preferences.\nTailoring sales pitches to match customer requirements.Pitching and Closing:Delivering compelling sales pitches to capture customer interest.\nEffectively using persuasive techniques to close sales and secure commitments.Skills",
    "Skills": [
        "He/she must have a proven track record in closing sales and exceeding sales quota. Candidate must be proactive, has good customer service and sales skills. ",
        "• Bachelor's degree in any course or equivalent experience",
        "• 3-5 years of B2C sales experience in the edtech/e-learning, insurance or service industry;",
        "• Proven track record in sales achievement;",
        "• Resident of Riyadh or can move in;",
        "• Transferrable residence (for foreigners)",
        "• Passionate and self-motivated;",
        "• Must have good communication and negotiation skills;"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}