{
    "Job ID": "4731442",
    "Description": "Storage Sales Specialist (Expert)Who We Are:Hewlett Packard Enterprise is a global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Job Description:Job Family Definition:Sales Specialists & Consultants are product, services, software or solution specialists that are responsible for leading pursuit in their assigned focus areas. Collaborates with and supports Account Managers and provides specialist expertise within the sales team. Drives proactive campaigns to build the pipeline, uses specialized knowledge and skills to prospect, qualify, negotiate and close opportunities. May have named accounts allocated, cover a designated geography, or may be allocated to one high-potential, competitive attack account. Management Level Definition:Applies advanced subject matter knowledge to solve complex business issues and is regarded as a subject matter expert. Frequently contributes to the development of new ideas and methods. Works on complex problems where analysis of situations or data requires an in-depth evaluation of multiple factors. Leads and/or provides expertise to functional project teams and may participate in cross-functional initiatives. Acts as an expert providing direction and guidance to process improvements and establishing policies. Frequently represents the organization to external customers/clients. Exercises significant independent judgment within broadly defined policies and practices to determine best method for accomplishing work and achieving objectives. May provide mentoring and guidance to lower-level employees.ResponsibilitiesResponsible for sales of storage products and solutions in assigned territories, industries or accounts.\nUses advanced storage expertise to seek out new opportunities for customer value by expanding and enhancing existing opportunities.\nCreates and drives the storage sales pipeline. Captures leads outside of specialization and uses closed-loop lead management to ensure assignment and follow-up by others.\nCollaborates with the account pursuit teams to leverage their solutions expertise for business development.\nBuild sales readiness and reduces client learning curve through effective knowledge transfer in storage.\nContributes to development of quota objectives and future direction for storage product lines.\nDirects and coordinates supporting sales activities related to pipeline hygiene through account managers, Presales, channel partners and other relevant stakeholders.\nEffectively uses internal sales tools to maintain a healthy pipeline and the account plan in a timely fashion.\nCollaborates across the HPE teams to deliver a consistent approach to developing business, including account planning for end-to-end solutions.\nAssesses solution feasibility from a technical and business perspective to determine \" qualify-in\"/\" qualify-out\" status.\nNegotiates and drives profitable deals to ensure successful closure and a high win rate.\nDrives sales of the storage portfolio, using strong leadership and initiative to successfully prospect, negotiate and close deals.\nEstablishes a professional and consultative relationship with the client by achieving an advanced understanding of the unique business needs of the client within the industry. Works with clients up to and including the C-level for mid-to-large accounts.\nLeverages advanced knowledge of competitors and industry trends to strategically position the company's products and services.\nFocuses on and works with the channel to forge relationships, provide enablement of key technologies, and co-sell to end-users.\nEffectively leads, evangelizes, and helps to coordinate Storage marketing campaigns (digital /new techniques) to ensure a successful launch and maintenance of the campaign momentum, in alignment with the account strategy.\nActs as a trusted storage solutions consultant for the slated accounts/region.\nReinforces and articulates HPE's strategy and portfolio to partners and champions to uncover new business opportunities and contacts, including new logos when appropriate.\nEffectively uses references to craft a story that makes complex technologies seem simple and understandable for the customers\nActively generates customer interest and anticipates customers' buying trends. Links business and financial benefits with technology offerings. Illustrates the ROI & TCO advantages of HPE offerings for the customer's business.\nCultivates and maintains positive relationships with customers to ensure account retention and growth, to position the company as the preferred vendor to meet business needs.\nSupports deal closure in partnership with relevant internal stakeholders including account managers and channel partnersSkills",
    "Skills": [
        "Education and Experience",
        "University or Bachelor's degree preferred.\nDemonstrated achievement of progressively higher quota, interface with diverse business customers at all levels.\nTypically 6-10+ years of sales experience.\nExperience in storage sales, typically 2-3+ years.\nExtensive vertical industry knowledge required.\nProject management experience required.",
        "Knowledge and Skills",
        "Storage Specialist- Sales Acumen & Behaviors",
        "Possesses expertise to be able to assess solution feasibility from a technical and business perspective, to determine \"\"\"\"qualify-in\"\"\"\"/\"\"\"\"qualify-out\"\"\"\" status.\nUses expertise to negotiate and drive deals to ensure successful closure and a high win rate.\nDemonstrates hunter mentality to actively pursue for solution opportunities in acquisition and development accounts and to pursue new business.\nPossesses the ability to independently articulate the technical solution and the commercial benefits to the client.\nPossesses knowledge of digital and modern methods to connect and sell.\nUses storage knowledge to actively prospects within accounts to discover or cultivate sales opportunities.",
        "Technology Focus",
        "Is considered an expert in knowledge of storage, cloud, solution or service offerings as well as competitor's offerings to be able to sell large solutions.\nUnderstands the outside-In view and possesses deep knowledge of industry trends. Stays abreast of competitors and key partner/ISV solutions, including both traditional and emerging vendors. Leverages HPE’s opportunities and mitigates challenges.\nUnderstands the role of IT within the area of storage. Understands how the company's solutions differentially address specific vertical industry challenges, as well as their cross-segment capabilities.\nDemonstrates high service, product, and solution knowledge. Can articulate and differentiate HPE's product offerings against the competition.",
        "Solutions Acumen",
        "Understands the industry and market segments in which key accounts are situated, and integrates this knowledge into consultative selling.\nPossesses the ability to leverage the company's product portfolio and services to up sell.\nPossesses deep expertise of end to end data solutions leveraging the HPE storage portfolio and ecosystem of partners, with a strong focus on traditional & modern applications and change the playing field on our competitors",
        "Other",
        "Understands how and when to engage different types of partners effectively, and is able to map the right partner to an opportunity.\nExpertise in mapping the right partner skills to the required storage related opportunity.\nPossesses deep understanding of business models of service providers, to be able to engage and sell",
        "Leadership",
        "Persuades and negotiates with others, draws upon interpersonal skills, empathy, and understanding of personality types\nMotivates, coaches and supports peer sales team members to ensure effective selling; counsels through selling challenges.\nClearly address challenges on customer's/partner's business horizon, aligns with requirements and priorities, reflects strategic partnering, and contributes to account growth objectives.\nDemonstrates courage to take calculated risks; creates a sense of trust to inspire innovation in the team.\nRewards, recognizes and celebrates successes.",
        "Other",
        "Possesses advanced financial acumen and leverages the available tools to profile each account's business unit.\nMaintains expertise on IT at all levels - new applications, maintenance, typical budgets of the CIO's, typical objectives, measures, metrics.\nUnderstands and applies program/project management methods and processes to define, plan, cost, resource, track and ensure successful pursuit.\nCollaborates with management and sales teams in shared accounts to ensure seamless integration of Storage Specialist sales with other sales activities.",
        "Impact/Scope",
        "May lead sales engagements to position creative storage solution which is the key to a profitable and successful delivery.\nAccounts may be international or global.\nTypically assigned higher than average quota.\nOrchestrates the regional pursuit resources for the account.",
        "Complexity",
        "Accounts may be international or global.\nMay perform project management role.\nCoordinates external partners.",
        "What We Can Offer You:",
        "Health & Wellbeing",
        "We strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.",
        "Personal & Professional Development",
        "We also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have — whether you want to become a knowledge expert in your field or apply your skills to another division.",
        "Diversity, Inclusion & Belonging",
        "We are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}