{
    "Job ID": "4731216",
    "Description": "A high-end multi-brand Hospitality developer is hiring a Restaurant Manager for their Fine Dining Restaurant.Based in Riyadh, you will be responsible to produce an outstanding customer experience within the restaurant concept by managing a service team in cooperation with the culinary team. Provides a courteous, professional, and efficient service in accordance with the restaurant standards, driving sales and maximizing profit. RESPONSIBILITIES: Provide professional and courteous service at all times and ensure that all employees of the assigned restaurant follow the example.\nEnsure that the place of work and surrounding area are kept clean and always organized and execute and demand the team to execute the highest level of service and set up standards at all times.\n Understand thoroughly the concept of the restaurant and train all employees of the restaurant with regards to the concept and set an example in terms of service, products, and guidance of the team that reflects the concept.\nActively participate in menu design in cooperation with the restaurant's Head Chef and know the restaurant scene and gastronomic character of the destination and be recognized in the market.\nPerform upselling for all items offered by the department assigned as well as offering alternatives.\nProduce reports and analysis of the restaurant and present reports in the monthly performance meeting and lead the restaurant efficiently in cost and expenses, constantly delivering the highest quality as well as driving high top-line revenue and profit.\nAssist in the preparation of the restaurant’s budget.\nConduct monthly inventory of operating supplies and equipment together with the kitchen department and obtain an account for the correct settlement of all sales and be overall responsible for restaurant floats when and as required.\nIdentify errors and correct them as required during set-up, service, and breakdown of operations.\nManage daily or weekly meetings with the kitchen team, and conduct daily pre-shift meetings with employees.\nConstantly improve product quality by sourcing the best available products a\nHandle customer inquiries, and complaints in the restaurant in a courteous and efficient manner and report to the Director of Operations ensuring that the follow-up is performed with the customerSkills",
    "Skills": [
        "Proven work experience as a Restaurant Manager with proven customer service experience.\nExtensive food and beverage knowledge, with the ability to remember, and recall ingredients, and dishes to inform customers and waiter staff.\nFamiliarity with restaurant management software, like OpenTable and PeachWorks.\nStrong leadership, motivational, and people skills, and acute financial management skills.\nDegree in Business Administration; hospitality management or culinary schooling is a plus.\nUndergraduate degree holder in Hotel Management from a reputed training institute.\nAdroit in utilizing restaurant management tools and digital software for improving overall productivity.\nStrong leadership, motivational, and people skillss"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 26 Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}