{
    "Job ID": "4731372",
    "Description": "Position Overview:We are seeking a dynamic and experienced ELV Senior Sales Engineer to join our sales team. The ideal candidate should have a solid background in sales within the ELV integration sector, with a proven track record of achieving and exceeding sales targets. As an ELV Sales Engineer, you will play a pivotal role in driving our business growth by identifying new opportunities, nurturing client relationships, and offering tailored ELV integration solutions that meet our clients' unique needs.Key Responsibilities:•   Utilize your deep understanding of ELV systems to prospect, identify, and engage potential clients within various industries, including commercial, industrial, residential, and institutional sectors.•   Leverage your industry knowledge to assess client needs and propose comprehensive ELV integration solutions that encompass security, access control, CCTV, audiovisual, automation, and more.•   Collaborate with the technical/estimation team to create customized proposals, including technical specifications, system designs, and cost estimates that align with client requirements.•   Develop and maintain strong relationships with clients by providing exceptional pre-sales consultation, addressing inquiries, and offering expert advice on suitable ELV solutions.•   Conduct presentations and demonstrations to showcase the benefits and features of our ELV products and services, highlighting how they can enhance clients' operations and security.•   Actively manage the sales process, from initial contact through contract negotiation and closure, ensuring that all client interactions are documented and well-maintained.•   Stay updated on industry trends, emerging technologies, and competitive landscape to provide insights that inform business strategies and improve the effectiveness of sales efforts.•   Attend industry events, trade shows, and conferences to network, build brand awareness, and generate potential leads.•   Monitor and report on sales performance metrics, providing regular updates to management on progress and forecasts.Skills",
    "Skills": [
        "•   Bachelor's degree in Engineering, Business, or a related field (or equivalent experience).",
        "•   A minimum of 10 years of successful sales experience within the ELV integration industry.",
        "•   Proven track record of consistently meeting or exceeding sales targets and quotas.",
        "•   In-depth technical knowledge of ELV systems, including security, access control, CCTV, audiovisual, and automation.",
        "•   Excellent interpersonal and communication skills, with the ability to present technical concepts to both technical and non-technical audiences.",
        "•   Strong negotiation and relationship-building skills.",
        "•   Self-motivated, proactive, and capable of working independently as well as part of a team.",
        "•   Availability for travel as needed to attend client meetings and industry events."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Qatar",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Electrical Engineering; Consumer Electronics",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}