{
    "Job ID": "4731430",
    "Description": "Position Title:        Technical Consultant (SAP Basis Consultant)Employment Type: Full-timeSalary:         up to 30K SAR, all-inclusive depending on experience and qualificationsJob Location:         Riyadh, KSAAbout the Client: A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSA.Job Description:  Design, implement, monitor, and optimize SAP landscapes and dependent technologies.  Monitors and tunes system performance and workload. Manage and performs system refreshes. Identify needed system corrections and enhancements and recommend changes. Apply advanced system management principles, concepts, and techniques. Evaluate and recommend new hardware, software, tools and utilities within the SAP environment.  Understanding the current and future requirements and developing relevant solutions. solutions implemented correctly and on time.Skills",
    "Skills": [
        "Qualifications: ",
        " Open to Asian and Arabic nationals",
        " Male, 45 y/o and below",
        " At least 10+ years of experience in SAP BASIS Implementation",
        " Project Management certifications available/ licenses is preferred",
        " Must have strong knowledge of multi-system landscape architecture and integration aspects between heterogeneous system technologies (Global focus desired), in the areas of build and support for S/4HANA, PI, EP, BW and HANA"
    ],
    "Preferred": {
        "Residence Location": "All GCC Countries; Saudi Arabia; United Arab Emirates",
        "Gender": "Male",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}