{
    "Job ID": "4731686",
    "Description": "Position Title:              SAP SAC ConsultantEmployment Type:      Contract 9-months Salary:                          up to 40K SAR all-inclusive depending on experience and qualificationsJob Location:             Riyadh, KSA About the Client:A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSA. Job Description:Responsible for the successful delivery of functional and technical components of planning, budgeting and forecasting solutions using SAC Planning.\nApply functional and technical integration knowledge of SAP Enterprise Resource Planning (ERP) tools, planning/BI systems, and functional finance processes (reports, input schedules, script logic, allocations, distributions, trending, forecast models, Storyboards, Dashboards and visualization).\nDevelop functional / technical specification documents and design best in class technical solutions to support analytical/reporting activities.\nSupport the setup and development of an overall SAC governance model to position the solution for future reporting and analytics operations and enhancements.\nCollaborate with the cross-functional team to develop an integrated SAC solution to support business processes and project deliverables with an emphasis on quality, productivity, and consistency.\nDevelop a cut-over strategy for SAC activities for Go-live.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Asian and Arab nationals\nMale, 40 years old and below\nMinimum 3 years of relevant experience in SAP Analytics Cloud and certified in SAC & other's SAP modules\nMinimum 3 years of experience required in managing SAP Analytical/Reporting work streams for large complex legacy systems for various industry sectors\nMust have SAP Analytics Cloud experience\nGood knowledge in BW Modeling, in HANA Modeling (Native HANA or BW powered by HANA)\nGood knowledge in Business Objects and S4HANA Embedded Analytics"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}