{
    "Job ID": "4731207",
    "Description": "Key AccountabilitiesØ Can be assigned any of the following responsibilitiesØ Compile and analyze financial information to prepare financial statements including monthly and annual accountsØ Ensure financial records are maintained in compliance with accepted policies and proceduresØ Ensure all financial reporting deadlines are metØ Ensure accurate and timely monthly, quarterly and year-end closeØ Establish and monitor the implementation and maintenance of accounting control proceduresØ Resolve accounting discrepancies and irregularitiesØ Develop and maintain financial databasesØ Ensure accurate and appropriate recording and analysis of revenues and expensesØ Analyze and advise on business operations including revenue and expenditure trends, financial commitments and future revenuesØ Can be assigned any of the following responsibilities related to receivables, payables, general Ledger accounting, and contract Management.Skills",
    "Skills": [
        "Bachelor's degree holder with a proven track record of academic or work experience in the Finance sector.\nApt in handling financial tasks like budgeting, planning, and calculating variance which reduces business expenses.\nAdroit soft skills to enable fluent in-house operations and maintain strong partner relationships.\nAn analytical personality, apt in understanding data by investigating the interplay between various information.\nPresenting an in-depth analysis of the company's financial statements through concise reports.\nHands-on experience in handling MS Word, Excel, Outlook, Teams, and PowerPoint."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Age": "Min: 26 Max: 36"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}