{
    "Job ID": "4731550",
    "Description": "To manage, control, monitor, oversee, and direct the activities of ABC; including developing long termstrategy, planning the implementation of strategies backed by due evaluation/mitigation of organizationalrisks), maintaining its corporate image, ensuring compliance with the Board of Directors’ directives so thatgood corporate governance ensues.Key Accountabilities/Responsibilities:Develops and recommends long term strategy and vision for the company to the Board of Directors.\nImplements the vision and mission as outlined/approved by the Board of Director and ensures company activities are aligned with the goals/objectives of the group.\nDevelops and recommends to the Board the annual business plans and budgets (capital and operating expenditure) which complement and support the company’s short and long term strategy.\nStrives consistently to achieve the financial and operating goals and objectives of the company.\nEnsures that the day-to-day business affairs of the company are adequately monitored and managed.\nEnsures the continuous improvement of the quality and value of the products / services provided by the company and that the Group achieves the planned competitive growth within its industry domains.\nEnsures that the company has an effective, result-oriented management team that actively participates and contributes to the development of the management function and succession plans.\nEnsures that effective recruitment is undertaken to fill in vacant positions and that an efficient succession plan is in place for key positions.\nOversees smooth transition of personnel into senior managerial positions and provides the requisite\nsupport and guidance.\nFormulates and oversees the implementation of major corporate-driven policies.\nMaintains a positive and ethical work climate that is conducive to attracting, motivating and retaining a diverse company of high-quality employees across all levels of the company.\nEnsures adequate disciplinary procedures are enforced in case of senior management violating ABC policies.\nServes as the chief spokesperson of the company and ensures the corporate image of Alesayi is maintained at all times.\nEngages in damage control and consults with the public relations officer in cases of bad press, major factory-related accidents/disasters, conflicts with labour etc.\nMonitors performance of all departments within the company on a regular basis and directs the activities of the each function.\nSets out specific performance standards in such key areas as efficiency, timeliness, organization and effectiveness, coaches and assists the department heads in improving their performance\nEnsures that the company is staffed with competent and motivated personnel as well as provides for\noptimum utilisation of department heads. This includes selection of competent personnel, training, their evaluation, authority and careful allocation of work.\nFollows procedures of reporting on strategic planning, performance, budgets, financial forecasts, and other reports required from time to time to the Board of Directors.Skills",
    "Skills": [
        "Education:",
        "A Graduate Degree in Engineering or equivalent, preferably with Business Administration.",
        "Experience:",
        "A minimum of 15 years’ experience in an equivalent position.",
        "Competencies:",
        "Leadership Skills\nStrategic Planning\nOrganizing and Planning\nCommunication Skills\nDecision Making and Problem Solving\nBusiness Development\nNegotiation skills\nInfluencing Skills\nInterpersonal Relationship Skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}