{
    "Job ID": "4731005",
    "Description": "**Job Advert: Junior Accountant with Accounts Receivable Experience**Are you a detail-oriented and organized individual with a passion for numbers? Do you have a solid understanding of accounting principles and a knack for managing accounts receivable efficiently? If so, we have an exciting opportunity for you to join our team as a Junior Accountant with Accounts Receivable experience.**Company Overview:**We are a dynamic and rapidly growing consumer company known for our commitment to excellence and innovation. We pride ourselves on fostering a collaborative and supportive work environment that encourages professional growth and development. As a Junior Accountant, you will play a vital role in maintaining the financial health of the organization.**Position Overview:**As a Junior Accountant with Accounts Receivable experience, you will be responsible for assisting our finance team in managing and tracking customer invoices, ensuring timely collections, and maintaining accurate records of transactions. Your attention to detail, analytical skills, and proactive approach will be essential in helping us optimize our accounts receivable processes.**Key Responsibilities:**- Process customer invoices accurately and in a timely manner.- Monitor accounts receivable aging reports and follow up on overdue payments.- Collaborate with cross-functional teams to resolve billing discrepancies and customer inquiries.- Maintain organized and up-to-date records of financial transactions.- Prepare and analyze monthly accounts receivable reports for management review.- Assist in reconciling customer accounts and ensuring accuracy.- Contribute to continuous process improvement initiatives to streamline accounts receivable processes.**Why Join Us:**- Opportunity to gain valuable experience in a fast-paced and growing industry.- Collaborative and supportive work environment that values your contributions.- Professional development opportunities to enhance your skills and career growth.- Competitive compensation and benefits package.- Chance to be part of a dedicated team that makes a real impact on the company's success.Skills",
    "Skills": [
        "If you are a motivated individual with a passion for accounting and a drive to excel in an accounts receivable role, we would love to hear from you. Join us and embark on a rewarding journey to contribute to our financial success.",
        "**Qualifications:**",
        "- Bachelor's degree in Accounting, Finance, Banking or a related field.",
        "- Previous experience at least 1 year in accounts receivable or related financial roles.",
        "- Solid understanding of accounting principles and practices.",
        "- Proficiency in using accounting software and Microsoft Excel.",
        "- Strong communication skills for interacting with internal teams and external clients.",
        "- Exceptional attention to detail and accuracy.",
        "- Ability to work independently and collaborate effectively within a team.",
        "- Strong organizational and time-management skills."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 22 Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}