{
    "Job ID": "4731243",
    "Description": "Portuguese-Speaking Media Search AnalystTELUS International AI-Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities for people with passion for languages. The jobs are part-time, and there is no fixed schedule. Whoever you are, wherever you come from, come join our global AI community.We are hiring freelance Media Search Analyst - an exciting work-from-home opportunity related to Music, Video App Store and HomePod! We offer a flexible schedule of up to 20 hours per week completing tasks in a web-based evaluation tool.The Role:Evaluation of online task types related to Music, Video, App Store and HomePod to help improve the overall quality and relevance of online content and research.Benefits & Perks:Flexible hours to work around home life\nBetter Work-Life balance\nRemote work & location independence\nPositive environmental impact\nIndependent contractor role.Skills",
    "Skills": [
        "What are the main requirements for the job?",
        "Fluency in English & Portuguese is essential\nYou must be living in Brazil for a minimum of 1 year\nApple user - Your email address must be associated with an Apple ID\nHas an iOS device with the latest iOS version\nA screenshot of your Apple ID must be provided for verification\nExperience/know-how of Apple products is mandatory"
    ],
    "Preferred": {
        "Residence Location": "Brazil",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Sao Paulo, Brazil",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}