{
    "Job ID": "4731412",
    "Description": "Position Title:              SAP IT Support ConsultantEmployment Type:      Full-timeSalary:                         up to 30K SAR all-inclusive depending on experience and qualificationsJob Location:              Riyadh, KSA About the Client:  A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSA Job Description:  Provide expert-level support for various SAP modules, resolving complex technical issues and incidents promptly to ensure minimal downtime and optimal system performance.\nCollaborate with cross-functional teams to identify and address technical challenges, ensuring seamless integration of SAP systems with other IT applications and infrastructure.\nEngage in proactive monitoring, analysis, and troubleshooting of SAP environments, making necessary adjustments to prevent and mitigate potential disruptions.\nLead efforts to implement system upgrades, patches, and enhancements while adhering to best practices and minimizing risks.\nCollaborate with clients to understand their business needs and provide technical guidance on optimizing their SAP systems to achieve business objectives, assist in the planning and execution of data migrations, system migrations, and system refresh activities. Skills",
    "Skills": [
        "Qualifications: ",
        "Open to Asian and Arabic nationals\nMale, 45 years old and below\nMinimum of 10 years’ hands-on experience in SAP support, including extensive exposure to Application Management Services (AMS)\nGCC experience is preferred\nMust have SAP certification\nImmediate joiners will be prioritized"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Software Development",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$6,000 - $7,000",
        "Number of Vacancies": "1"
    }
}