{
    "Job ID": "4731674",
    "Description": "Position Title:               SAP S/4 HANA MM ConsultantEmployment Type:     Contract for 9 months  Salary:                        up to 35K SAR all-inclusive depending on experience and qualifications Job Location:                Riyadh, KSA  About the Client:  A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSA. Job Description:  Collaborate with cross-functional teams and stakeholders to gather business requirements, analyze processes, and provide innovative solutions within the SAP MM module.\nLead end-to-end implementations of SAP S/4 HANA MM projects, including project planning, blueprinting, configuration, testing, deployment, and post-go-live support.\nProvide expertise in optimizing and configuring the SAP MM module to align with business needs and industry best practices.\nConduct workshops and training sessions to educate end-users on SAP MM functionalities, ensuring effective system adoption.\nWork closely with other SAP consultants to ensure seamless integration between SAP modules (e.g., SD, PP, WM, Ariba) and external systems.Skills",
    "Skills": [
        "Qualifications: ",
        "Open to Asian and Arabic nationals\nMale, 45 years old and below\nBachelor’s degree in Information Technology or any related field\nAt least 6 years of experience as an SAP MM Consultant, with a proven track record of successfully delivering at least 5 end-to-end SAP MM implementation projects\nIn-depth knowledge of SAP S/4 HANA MM module, including configuration, customization, and integration with other SAP modules\nAbility to analyze complex business requirements and translate them into effective SAP solutions\nSAP certification in the MM module is a strong advantage\nOpen to overseas candidates"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "$9,000 - $10,000",
        "Number of Vacancies": "1"
    }
}