{
    "Job ID": "4731374",
    "Description": "We are seeking for Executive Assistant on behalf of one of our clients, who will serve as the administrative and functional point person for the Chairman’s corporate, community, and personal matters to ensure the smooth functioning of activities and processes in multiple lines of business.Duties & Responsibilities:To perform this job successfully, an individual must be able to perform each of the essential duties satisfactorily.\nManage multiple projects as assigned by the Chairman related to diverse lines of business, community, and personal interests with inter-related activities and relationships.\nCoordinates calendar, travel, meeting, and schedule arrangements for the Chairman, staff, business partners, and customers. Includes initiating contact and securing appointments, equipment, and facilities as appropriate.\nWorks closely with other team members to assure the Chairman’s preparation for meetings, presentations or other engagements. Administrative and functional activities include but are not limited to:Taking phone calls.\nMaintaining personal and business files.\nCorporate record keeping for multiple entities.\nSupporting marketing and strategic planning activities.\nNote taking & creating documentation.\nFiling, storage & retrieval of business and personal activities.Handles financial and accounting matters for the chairman with confidentiality.\nPrepares and sends business and private correspondence.\nCoordinates operations of the Chairman’s office including:Reception.\nDocument preparation & control.\nInternal communications.\nGeneral office maintenance to improve costs and effectiveness.Carries out responsibilities with professionalism, and respect for others, in accordance with the organization’s policies and applicable laws.\nAny other duties as assigned.\nEfficient and smooth operation of the Chairman’s office.Skills",
    "Skills": [
        "Bachelor’s Degree in Business or Related Field.\nExcellent communication skills in Arabic & English and Persian (write & talk)  is a must\nFinancial & Accounting Statement Language.\nHigh Proficiency in MS Office Suite."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}