{
    "Job ID": "4731368",
    "Description": "*RELOCATION OPPORTUNITY* This international business within the luxury Watch, time pieces and accessories sector is looking for a Watchmaker, in their workshops in one of their flagship stores.This brand is steeped with heritage but still pride themselves on innovation & design in the market today. The business is part of a wider group which offers the manufacturing and sale of finished jewellery, watches and accessories across the world.The roles and responsibilities of this WatchmakerTo service and repair watches\nTo have a full service of products when required\nHave direct client interaction.\nTo provide the highest quality service to ensure perfect technical functioning of the product.\nKeep record of all work undertaken on Repair Sheet\nEnsure the first level repair quality control according to Group’s recommendations.Skills",
    "Skills": [
        "You must be organized and self-manage workflow while working to targets.\nCarry out interventions on watches according to the Group standards.\nInform administration of all additionally required spare parts and details needed.\nWorking to fast paced yet realistic work timescales.\nHave worked in a similar commercial or retail environment.\nHave worked with premium or successful timepieces and watches.\nWOSTEP/BHI certification – desirable",
        "The benefits of this Watchmaker opportunity –",
        "The brand offers a warm and friendly environment.\nCompetitive salary\n£3600 for relocation expenses which can be claimed back from the company\nBonus potential of £3,000\nflexible working patterns\nHolidays."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Watches & Luxury Goods",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "5"
    }
}