{
    "Job ID": "4731684",
    "Description": "Position Title:             SAP S/4 HANA FICO LeadEmployment Type:     Contract – 9 months Salary:                         up to 40K SAR all-inclusive depending on experience and qualifications Job Location:            Riyadh, KSA About the Client:A highly recognized international group handling Information Technology Services to various industries located in Riyadh, KSA. Job Description:Deliver a good understanding in Finance and Controlling business processes obtained during previous implementations with established corporate/industry/audit firms/consulting firms.\nExplain and manage FICO processes covered or related to Accounts Receivable, Accounts Payable, New GL, New Asset Accounting, Cost Center Accounting, Integration, Tax processes, Bank Configurations, Cash and Liquidity Management, Funds Management for Public Sector and Budgeting.\nImplement a good experience in Financial Accounting (FI) and Controlling (CO) areas in all the phase of global end-to-end SAP implementation projects.\nFunction within integration aspects with other SAP ModulesSkills",
    "Skills": [
        "Qualifications:",
        "Open to Asian and Arabic nationals\nMale, 45 years old and below\nPost-Graduation in Commerce, CA, CIMA or Master of Business Administration (MBA) in Finance\nMinimum 6 years of experience in SAP S/4 HANA FICO and related modules with 5 or more implementation experience\nMust have experience in S/4 HANA greenfield implementations or conversions\nCertification in SAP Finance and related modules is an added advantage\nMust be willing to relocate in KSA "
    ],
    "Preferred": {
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}