{
    "Job ID": "4731375",
    "Description": "·      Monthly accounting and reporting services for clients, including onboarding, proposals, and client relationship management·      Assist with the implementation of accounting, inventory, and CRM systems for clients·      Assist with Adhoc excel report building both internally and for clients·      Assist with the accounting operations of Rethink, including internal month-end close and reporting on time·      Assist in reviewing existing contracts, accounting systems, and procedures to advise clients and internal teams on timely invoicing·      Consistently keep abreast of latest developments and implications of VAT & IFRS·      Assist in VAT compliance function, including performing VAT filings and training outsourced staff·      Provide support on VAT returns by reviewing work of the outsourced team·      Assist and support Finance Managers on business plans and forecasts if necessary·      Assist with the implementation of policies and procedures throughout the service offeringAssist in the system implementation, data migration for internal companiesSkills",
    "Skills": [
        "·      Strong Accounting skills and team management experience",
        "·      Relationship management experience",
        "·      Financial Modelling and advance excel skills.",
        "·      At least 3 -6 years of experience in accounting or business advisory.",
        "·      Perfect written and spoken English.",
        "·      Excellent technical and systems skill."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}