{
    "Job ID": "4732770",
    "Description": "Monglish Academy is hiring dedicated, creative, passionate online Egyptian and American teachers residing in Egypt as follows:1. Full-time teachers of English2. Story-tellers (No experience required, No teaching is involved, Training is provided)3- Full time English-major fresh graduatesCELTA, International TEFL, TESOL, DELTA holders is a plusMain Tasks:• Deliver learner-centered, interactive live lessons using Monglish methodology• Teach beginner and pre-intermediate students in groups of 6-12 learners• Provide timely feedback and progress reports on learners strengths and weaknesses..Plan lessons and create adequate supplementary materials• 8 hours a day/ six days a week• World-class CPD• Paid Training (if needed)• Career path and promotions. Medical and social insurance. Annual renewal contracts. No short-term hires* Excellent work environment and supportive managementWork conditions:. Teaching online from home• Working days: Sat-Thu• Working hours: between 2:00 PM to 10:00 PM according to class schedules.. The job is entirely remote. teachers work from home.Salary: Highest in the market according to experience and qualificationsSkills",
    "Skills": [
        "Experience: 2+ years except for 2 and 3",
        "Education level: Bachelor's degree English Major.",
        "• Native or bilingual proficiency is a must",
        "• Successful completion of Monglish Training program",
        "• Strong presentation Skills",
        "• High level of adaptability and flexibility",
        ". Stable internet & personal Laptop/PC",
        "Experience teaching online is a plus",
        "Modern approach to teaching"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Training & Education Center",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}