{
    "Job ID": "4732675",
    "Description": "The candidate will be responsible for managing accounts and generating business through new leads. Implementation of business plans and initiatives, generating volume growth, turn over, numeric & weighted distribution, improved merchandising, and cost optimization. ·         Direct Sales to a portfolio of Modern Trade customers.·         Ensure productive sales calls and proper payment management.·         Design and implement a sales strategy.·         Negotiate annual cooperation agreements (promotions, leaflets, displays, listing…).·         Support key accounts in managing their stocks to optimize supply conditions.·         Follow up demand forecast/orders plan.·         Track in-store promo effectiveness.·         Identify key issues, trends, and opportunities to increase market share and creatively help in growing the business. ·         Ensure optimal distribution and merchandising.·         Work with the Trade Marketing team to design tailored promotions and activations based on shopper profiling and Key Account strategy and objectives.·         Monitor, analyze, and share the main competitors’ strategies, activities, and competitive advantages in the modern retail environment. Skills",
    "Skills": [
        "Minimum of 7 years of sales and/or marketing experience \nBachelor’s degree in marketing, advertising, or related field \nDemonstrated ability to communicate, present and influence others. \nProven ability to drive the sales process from plan to close \nStrong business sense and industry expertise \nStrong computer and technical skills with specific experience in Microsoft Office Suite (Excel, Word, PowerPoint) "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}