{
    "Job ID": "4732929",
    "Description": "Work with the pre-sales/Tech team to ensure FCC cyber security solutions are used in production environments and become the first choice for our most strategic customers\nLiaison with the presales team in consultation, designing and sizing cybersecurity solutions for customers\nPrepare proposals and technical documents (with presales)\nAccount Management and support mitigationSkills",
    "Skills": [
        "Degree holders in Computer or Information Engineering or related subjects\nAt least 4+ years of experience in Sales for Information Technology - Network Security with sales certification from vendors such as Checkpoint, Sophos, Palo Alto Networks, Fortinet, Cisco etc.\n·      Strong knowledge on Firewalls/ endpoint security /web / client / DNS / Email security/ Advance Security Solutions, Monitoring Solutions and Corporate Cyber Security Policy and Management\n·      Cloud security knowledge will be an advantage\n·      Knowledge of security products, such as Sophos, Cisco, Fortinet, CheckPoint, Mcafee, Juniper, etc.\n\n·      Sold technical support experience in large scale cyber security projects and mission-critical infrastructures is an advantage\n·      Familiar with Cybercrime and IT fraud (Spoofing, Forged Email, Phishing sites) is a plus\n·      Broad experience and understanding of industry standards, framework, and best practices such as ISO27001, PCI DSS, NIST, etc.\n·      Proactive and can work independently or as a team\n·      Good presentation and proficiency in writing technical proposal\n·      Good Communication Skills\nBusiness acumen and Strong leadership abilities.\nTime optimization and identification of priorities.\nFlawless exchange of ideas during peer-to-peer communication and the ability to follow-up effectively.\nWeeding out essential tasks while understanding effective time division."
    ],
    "Preferred": {
        "Years of Experience": "Max: 4",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "2"
    }
}