{
    "Job ID": "4732872",
    "Description": "General1.Handle incoming and outgoing communication such as answering phone calls, responding to e-mails and routingmessages to appropriate staff members, managing incoming and outgoing packages and deliveries.2.Maintain office supplies inventory and place orders when necessary.3.Ensure the office is clean, organized and equipped with necessary supplies.4.Greeting and welcoming visitors, clients, and employees in a professional and friendly manner.5.Answer inquiries and provide information about the organization or direct individuals to the appropriate contacts.6.Schedule and coordinate meetings, appointments and travel arrangements for managers and staff members.7.Get offer from airlines, travel agencies and hotels and make contract at the best offers.Documentation1.Draft, proofread and format correspondence (Letters, contracts, reports, memos and other documents)2.Maintain electronic and paper filing systems to ensure information is easily accessible and organized.3.Assist in compiling and preparing data and reports as requested.Office operation1.Arranging for the maintenance and repair of office equipment, including computers, printers, and other devices.2.Basic bookkeeping tasks such as processing invoices, expense reports, and reimbursement requests.3.Support HR functions, including maintaining employee records and assisting with new employee onboarding.4.Collaborate with colleagues to support their administrative needs and provide assistance when required.5.Monitor and record employee attendance, including arrivals, departures, breaks and absences.6.Assist in preparing salary payroll list.7.Assist in organizing company events, meetings and employee training sessions.Skills",
    "Skills": [
        "Fluent in English speaking and writing.\nComputer knowledge in MS. Office (Word, Excel, Power point, Outlook)\nKnowledge in Photoshop software.\nSpeaking Arabic would be an added advantage."
    ],
    "Preferred": {
        "Gender": "Female",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}