{
    "Job ID": "4732499",
    "Description": "Preparing and consolidating financial statements and reports.\nAssisting with the development and evaluation of budgets and preparing budget reports.\nSupporting the formulation and implementation of control systems within the organization.\nOverseeing accounts payable, accounts receivable, and payroll, identifying discrepancies, and reconciling accounts.\nSupporting the accounting department with all aspects of the general ledger.\nEnsuring strict compliance with company and regulatory standards.\nPreparing and managing accounts using various software programs.\nPreparing and assisting with audits.\nFollowing changes in regulations and compiling reports regarding compliance issues, standards, and accounting practices.Skills",
    "Skills": [
        "Degree in accounting, finance, or in a related field.\nPrevious experience as an accountant, assistant controller, or in a similar role.\nProfessional certification such as CPA, CFM, or CMA preferred.\nExcellent understanding of GAAP and relevant financial accounting regulations.\nStrong computer skills and knowledge of accounting software programs.\nExcellent verbal and written communication skills.\nHighly organized and detail-oriented.\nExcellent math and accounting skills.\nStrong supervisory and management skills.",
        "Experience 3-5 Years In The Same Position ",
        "In The Field of Religious Tourism Or Hotels"
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Nasr City, Cairo , Egypt",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}