{
    "Job ID": "4732258",
    "Description": "Excellent Job Opportunity for Head of International Business – GCC RegionShark partners with the world's leading brands to design & manufacture consumer environments. Shark is an industry leader with unmatched knowledge, infrastructure & quality standards.Shark brings value to brands and retailers. Shark offers extensive solutions of shopfitting manufacturing, prototyping, value engineering, localization, material research and technology to our clients. We create creative retail solutions and products for consumer and retail environments. Shark is one of the leaders in furniture and shop-fittings solutions for the retail industry and corporate offices. We have a design and engineering hub, 2 factories, multiple warehouses and presence all over India and Middle East which enable us to offer cutting-edge products with maximum customization and highest quality, which in turn are perfectly packaged for transport to ensure maximum protection, and with deliveries to any country where the project is carried out. Head of International Business – GCC regionWhat you will be doing.We are seeking a highly motivated, tenacious and experienced Head of International Business to lead our expansion efforts in GULF region. You will be based out of Dubai and will serve as the international face of the company. You will be responsible for maintaining the existing client relationships and creating strategies to grow the organic business with them. As a primary responsibility, you will devise strategies and connect with new prospective customers and expand sharks business.With high levels of passion and energy, you will thrive on shaping the company middle east strategy establishing our brands to fulfil the growing appetite for retail shop-fittings across GCC. To be successful in your application, you will be driven to exceed targets, adopting an innovative and resourceful approach to all areas of the role. We’re looking for a naturally collaborative, personable manager, capable of identifying, pursuing and capturing new business opportunities. Finally, you will be a confident communicator, negotiator, and decision-maker.Key responsibility areas· Developing and implementing an international business plan. Negotiating and approving contracts with clients. HR duties, including hiring international employees and managers.· Identifying and pursuing new opportunities: You would be responsible for identifying new business opportunities and pursuing them in order to grow the company's revenue and market share. This would involve conducting market research, networking with potential partners and clients, and developing marketing strategies to promote the company's products and services.· Take ownership of the entire sales process from first point of contact to final agreement.· As a part of primary responsibility the role means to take ownership of complete project after sales, developing team for daily coordination of project, oversee the communication, take reports, coordinating with the factory, supervising the timelines and communicating with the clients till final delivery.· Ensure compliance with local laws, regulations, and cultural normsWHAT ARE WE OFFERING?In return for everything you can bring, we can offer you an exciting, challenging role in a fast-growing and dynamic business with plenty of career opportunities and a competitive rewards package.You will get to work in an inspiring and creative environment and be a part of a close-knit team who always go above and beyond for each other and our customers. We really love what we do and are looking forward to welcoming a new team member who shares our passion. You will be a key member of our management team reporting into the CEO of shark. Skills",
    "Skills": [
        "ABOUT YOU",
        "· 10+ years of experience in retail design, shopfitting's, projects or related areas with a proven track record of success",
        "· Sales leadership experience in B2B and preferable shopfitting's, furniture or large-scale interior and projects field.",
        "· Experience working with international businesses or brands.",
        "· Experience in contract negotiations.",
        "· Strong negotiation and influencing skills to drive commercial success.",
        "· Demonstrable evidence of success in securing new business.",
        "· Articulate demeanor and exceptional relationship building skills.",
        "· Excellent communication skills are essential.",
        "· Fluent in English, Arabic language is a plus.",
        "· Superb commercial acumen.",
        "· Strong organizational and multi-tasking skills.",
        "· Able to work within a structured framework to reach long term goals.",
        "· Business oriented and results driven.",
        "· A goal getting attitude where you like to take the initiative."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "All GCC Countries; United Arab Emirates",
        "Age": "Min: 35 Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Fit-Out & Joinery",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}