{
    "Job ID": "4732893",
    "Description": "Position Title: Shift ManagerEmployment Type: Full Time Salary: up to 55K AED depending on experience and qualifications plus yearly increment and yearly bonusJob Location: Abu Dhabi, UAEAbout the Client: They are the largest electricity and desalinated water suppliers in Abu DhabiJob Description:Ensure adherence to safety, quality, and environmental protocols for employee safety and legislative compliance, acting as a Safety Controller through application of Company Safety Rules.\nImplement safety rules effectively on a shift basis, ensuring comprehensive understanding of related procedures and preventing breaches within the team.\nMonitor and maintain records of safety, environmental walk downs, incidents, and near misses, promoting safe work methods among Operations Staff.\nMaintain compliance with applicable laws, corporate policies, and internal controls; contribute to policy and procedure enhancement.\nFulfil Subject Matter Expert role, provide training, and support Emirati staff development; lead performance management, workforce organization, and oversee plant operations, including start-ups, shutdowns, equipment monitoring, chemical processes, and emergency response.Skills",
    "Skills": [
        "Qualifications:",
        "Open to UAE nationals with family book\nMale, 50 years old and below\nMust have a bachelor’s degree in electrical or mechanical and Instrumentation equivalent\nAt least 3 years of experience in similar position\nCandidate with Power plant experience would be an advantage\nReady to be located near site during the shift days\nMust be flexible with day or night shift\nMust be a fluent English speaker"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 55"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Utilities",
        "Company Type": "Recruitment Agency",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}