{
    "Job ID": "4732674",
    "Description": "تسويق الوحدات العقارية: تسويق وترويج وحدات المشروعات العقارية للعملاء المحتملين. تحليل السوق وتحديد استراتيجيات التسويق الملائمة لزيادة الوعي بالمشروع وجذب المشترين المحتملين.\nتطوير علاقات العملاء: بناء وتعزيز علاقات طويلة الأمد مع العملاء المحتملين والعملاء الحاليين. توفير المشورة المهنية والمعلومات المفصلة عن المشروعات العقارية وتقديم حلول مخصصة وملائمة لاحتياجات العملاء.\nجولات المعاينة والعروض التقديمية: تنظيم جولات لعرض المشروعات العقارية والوحدات المتاحة للعملاء المحتملين. تقديم العروض التقديمية والمواد الترويجية ذات الصلة لتسهيل عملية اتخاذ القرار لدى العملاء.\nمتابعة العملاء: متابعة مع العملاء المحتملين والعملاء الحاليين لتحقيق البيع. تزويد العملاء بمعلومات محدثة حول التطورات العقارية، والتعامل مع الاستفسارات والمخاوف، والتفاوض على الشروط والأسعار.\nتحقيق أهداف المبيعات: وضع أهداف المبيعات الشهرية والفصلية والسنوية، والعمل بجد لتحقيقها. تحليل الأداء المبيعاتي وتطوير استراتيجيات لتحقيق الأهداف المحددة.\nالتعاون مع الفريق الداخلي: التعاون مع الفريق الداخلي المسؤول عن التطوير العقاري والتسويق لتنسيق الجهود وتحقيق أهداف المشروع.Skills",
    "Skills": [
        "المؤهلات والمهارات المطلوبة:\nخبرة سابقة في مجال المبيعات، خاصة في صناعة التطوير العقاري (مفضل).\nمعرفة قوية بصناعة التطوير العقاري والأسواق المحلية والاتجاهات الحالية.\nمهارات اتصال ممتازة وقدرة على بناء علاقات قوية مع العملاء.\nقدرات تفاوضية ممتازة وقدرة على إغناء تجربة العملاء.\nمهارات التسويق والترويج والقدرة على إنشاء استراتيجيات فعالة لجذب العملاء المحتملين."
    ],
    "Preferred": {
        "Residence Location": "Buraidah, Saudi Arabia ; Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Real Estate; Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}