{
    "Job ID": "4732531",
    "Description": "Making yearly forecast in to order to set a suitable sales target for key retail customers.\nMonitoring market trends, competitor activities, and customer feedback to identify business opportunities and improve sales strategies.\nNegotiating and closing sales deals, ensuring customer satisfaction and achieving sales targets.\nCollaborating with internal teams, such as production and logistics, to ensure timely delivery of products to customers.\nUnderstanding customer needs and requirements and presenting appropriate product solutions.\nBuilding and maintaining strong relationships with existing and new customers.\nCollection of customer statement as per the agreement between the two companies.\nFollowing up with accounting department on reconciliation for the payments and analyze the missing payments if any.\nRout plan for covering all customers with their branches weekly.Skills",
    "Skills": [
        "Must know the key retail (supermarket) individuals and buyers and must a good relationship with them.\nExcellent communication and interpersonal skills to effectively engage with customers.\nStrong sales and negotiation skills to persuade and close deals.\nknowledge or background of Food products specially cheese.\nAbility to understand and analyze customer needs and provide tailored solutions.\nSelf-motivated and result-oriented, with a proactive approach to sales.\nOrganizational and time management skills to handle multiple customers and meet sales targets.\nProblem-solving skills to address customer inquiries or concerns.\nknowledge in written and spoken English.",
        "Experience: 3-5 Years.",
        "Notes:",
        "Please if your CV is not relevant in Food Sales for Supermarkets located in Saudi Arabia - Jeddah, do not apply.",
        "Job Location: Saudi Arabia - Jeddah",
        "Applicants must be available in Saudi Arabia Only."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}