{
    "Job ID": "4732451",
    "Description": "We are looking for Glass Plant Manager for QatarFull timeResponsibilities:-• Establish and implement policies, procedures and reporting structures to monitor plant / production activities and resolve operational issues to ensure compliance of projects/company short term and long-term goals.• Implement robust data collection to monitor plant performance and drive informed decision making.• Establish KPI’s to monitor operational success against business objectives.• Set and manage Plant & Team Goals and Objectives to deliver the plant KPI’s.• Oversee capacity and production planning from a resource, equipment, and materials perspective.• Establish and drive a culture of continuous improvement through the foundations of LEAN business operating systems.• Deliver a LEAN/CI cost saving program through your team reducing operating expenditure within the business.• Promote a quality driven culture throughout the plant through the development and implementation of robust processes and systems.• Efficiently manage and direct the daily production activities• Lead by example to monitor overall plant functions for safety, production, and quality standards.• Review, analyze, and evaluate plant operational performance, and implement improvements or corrective measures to achieve operational efficiency.• Responsible for development and implementation of production / manufacturing best practices, policies, and procedures.• Managing the master production schedule, work-in-progress inventory and the generation and execution of sites’ schedules.• Analyze and implement process improvements to enhance workflows, plant layouts / automation, production quality and capacity.• Evaluate, recommend and implement optimal production solutions and machinery / equipment needs or acquisitions• Provide leadership and mentoring to plant personnel.• Establish programs to ensure plant training, upskilling and succession planning are in place to deliver both the short and long term business strategy.Skills",
    "Skills": [
        "• BS or MS degree in Engineering or Manufacturing Management",
        "• 10+ years’ experience in Glass Processing industry.",
        "• At least 5 years’ experience in a management role.",
        "• Experience in Middle east or Gulf Region preferred.",
        "• Strong people management skills.",
        "• Strong sense of commercial awareness and project targets.",
        "• Excellent working knowledge of MS Office suite.",
        "• Experience of Production Management/ERP software.",
        "• Strong team building ability",
        "• Fluent in written and spoken English.",
        "• Strong interpersonal and written communication skills",
        "• Client-centric approach.",
        "• Ability to work with multicultural workforce",
        "• Time flexibility to ensure work schedule compliance",
        "• Travel is accordance with company requirements"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 15",
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}