{
    "Job ID": "4732683",
    "Description": "The role and responsibilities of the Managing Assistant & Sr. Architect are in the following areas, which may evolve as per business’ requirements:·        Provides executive support to the General Manager including schedules and communications management including prioritizing emails and phone calls, gathering documents to share with other parties or to prepare for meetings, and coordinating travel arrangements;·        Reviews new brands’ company profiles and business plans if any, and advises prior affirming to requests for meetings;·        Schedules meetings and appointments, coordinates with teams attending the same functions, and prepares/distributes the needed materials such as printed or digital files of proposals and samples;·        Inducts new employees with the company policies, and initiates  team orientation;·        Schedules training sessions for the teams;·        Provides support in staffing and recruitment efforts by initial resume screening and coordinating interviews;·        Represents the Managing Principal and Company in training interested Architecture and/or ID Interns;·        Carries executive duties with instruction from the Managing Principal when needed;·        Prepares new or reviews received contracts related to design or retail and operations departments in order to understand the key provisions within the agreement, and highlight any relevant points of concern or benefits before requesting changes from the other party and/or submitting to Management for further advice; ·        Maintains the ISO documentation, and ensures its continuous implementation in all departments.·        Reviews received documents, analysis, and delegates them to concerned departments or personnel;·        Prepares documents, presentations or information relating to a project, and ensures that standards are being followed;·        Keeps records of all information related to projects and brands for documentation, clarification, and presentation to management;·        Creates specific strategies for easier and effective execution of projects;·        Collaborates with the Design Principal in final selections of FF&E pieces, among a wide range of top-level brands and according to design guidelines given by the client;·        Draws up documents such as design concept statements, furniture specifications, etc.;·        Prepares material / fabric boards when necessary;·        Ensures that all records relating to tasks assigned are adequately delivered to various departments;·        Manages ID-Library and suppliers’ database;·        Maintains contacts with potential clients and suppliers who may be interested in investing in projects;Skills",
    "Skills": [
        "·  Architect / Interior Designer with background in high-end design and construction projects, exposure to retail and furniture marketing industry preferred.",
        "·  At least 10 years of experience.",
        "·  Expertise in architectural plans and detailed drawings.",
        "·  Proficiency in AutoCAD and other drawing software.",
        "·  Proficiency in Adobe Photoshop or other presentation software.",
        "·  Proficiency in MS Office software package.",
        "·  With excellent report-writing skills.",
        "·  Experience in executive / administrative support experience with 3-5 years’ experience in supervisory role.",
        "·  Excellent communications, problem-solving, organizational and time management skills.",
        "·  Ability to multi-task and prioritize.",
        "·  Comfortable working with all levels of personnel.",
        "·  Fluency in English, both written and spoken, Arabic language proficiency is highly desirable.",
        "·  Must possess valid Qatari driver’s license."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Qatar",
        "Nationality": "Philippines",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}