{
    "Job ID": "4732507",
    "Description": "Job Purpose:Supporting the Project Manager in ongoing projects, by supervising the entrusted tasks, performing works related to all technical arrangements within the scope of the entrusted task.\nInvolved in the approval of products, tooling designs, line layout, equipment specifications/capacity, product range, technologies proposed by the engineering services company.\nResearch and verification of the required update/update of standards/procedures of the operation process, equipment, facility in order to meet future market trends, customer requirements/expectations and the development technologies.\nDeveloping entrusted projects in the field of cost reduction, increasing production capacity, developing new products, implementing new technologies, implementing production lines and auxiliary equipment.\nKeeping full documentation of entrusted projects, also in AutoCad, reporting to the project manager.\nSending the required daily, weekly, monthly, quarterly and annual reports to the project manager.Duties:Comply with company regulations regarding working time, assignments, behavior.\nFollow ABC's security rules, policies and procedures.\nGenerate required reports and timely submit to Operational Project Manager.\nImprove staff competencies, skills, knowledge by setting annual training needs, plan, schedules.\nSet up a team to support ongoing projects, goals, milestones, timelines, budgets and costs.\nFollow the instructions of your superiors.\nConscientiously and timely perform the entrusted tasks and report on progress.\nWork with engineering service partners to define products, tooling designs, equipment layout, plant layout, equipment/facility specifications to meet project requirements, industry standards and maximum efficiency.Skills",
    "Skills": [
        "Job Specification:",
        " Required level of education:",
        "Bachelor's degree or higher in mechanical, electrical or industrial.",
        "Required experience:",
        "At least 5 years of experience in a beverage manufacturing plant in a similar/same position.\nExperience in the process and production of beverages in PET packaging.\nExperience in the process and production of beverages in TetraPak packaging.\nExperience in the process and production of beverages in glass packaging.",
        "Skills:",
        "Independent management of entrusted projects, from the idea through the design process to the final implementation.\nAbility to think analytically in the design process, taking into account the current available solutions and technologies.\nAbility to plan - plan the project taking into account the required human, financial and time resources.\nProficient use of AutoCad.\nExcellent communication and management skills.\nGood presentation, negotiation skills.\nGood computer skills.\nGood project management skills.\nStrong problem-solving skills.",
        "Knowledge:",
        "Extensive knowledge and experience in production/processes and project management.\nSaudi labor law.\nGood knowledge of IS09001; IS022000 documentation, procedures and implementation - Good knowledge of SPC.\nVery extensive knowledge and experience in project management, planning, assignment and evaluation.",
        "Required Quality:",
        "Honest, Disciplined, Creative, Cautious, Open-Minded, Motivating, Collaborative, Non-drinking.",
        "Languages required:",
        "Good English in speaking, writing, listening.",
        "Communication channels:",
        "Internal Communication: all levels of management within company\nExternal Communication: customers, suppliers, contractors"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Unspecified",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}