{
    "Job ID": "4732898",
    "Description": "First of all , we want someone has experience in Italian Food . As CDP you should takes care of the daily food preparation and duties assigned to your section through the Sous Chef to meet the standard and the quality set by the Senior Executive Chef.General ResponsibilitiesTo promote efficiency, confidence, courtesy, and an extremely high standard of social skills\nTo generally promote and ensure good inter-departmental relations\nTo always display a pleasant manner and positive attitude and to promote a good company image to guests and colleagues\nTo always demonstrate pride in the workplace and personal appearance when representing the hotel thus identifying a high level of commitment\nTo always adhere to Company and Hotel rules and regulationsOperationalPrepares the daily mis-en-place and food production in different sections of the main kitchen or satellites.\nCoordinates daily tasks with the Executive chef and Sous chef.\nFollows the instructions and recommendations from the immediate superiors to complete the daily tasks.\nEnsures the highest standards and consistent quality in the daily preparation and keeps up to date with the new products, recipes, and preparation techniques.\nInstructs and leads subordinates through their daily requirements in food preparation and actively takes part in set up and supervising of buffets and special functions.\nCoordinates and participates with other sections of requirements, cleanliness, wastage, and cost control.\nPersonally responsible for hygiene, safety and correct use of equipment and utensils.\nChecks periodically expiry dates and proper storage of food items in the section.\nConsults daily Executive chef/ Sous chef on the daily requirements, functions, and last-minute events.\nChecks daily time sheet is correctly filled at the section, prepare a weekly roster, and keeps overtime to a minimum.\nGuides and trains the subordinates daily to ensure high motivation and economical working environment.AdministrationTo ensure that the standards required by Law and by Dubai Holding Entertainment Management are\nalways maintained in the areas specified above\nAssist in recruiting, hiring chef’s vacancies\nTo ensure statutory training is carried out relating to fire, hygiene and health and safety\nMarinating the food cost target\nReduce the food wastage to the minimum percent\nCompletes cleaning, opening & closing checklists when instructed by senior colleagues\nPlaced orders of products and ingredients and ensure all recording inventories/ stock-takes are recorded\nPrepares duty schedules in the kitchen operation\nMaintain good record for staff training and developmentHSE Duties:To be an example for personal hygiene and cleanliness on and off duty.\nTo report any equipment failures/problems to the Maintenance Department.\nPass any maintenance requests to the Maintenance Department.\nTo participate in any Training/Developments schemes as recommended by senior management.\nTo comply with any reasonable request made by management to the best of your abilitySkills",
    "Skills": [
        "Essential",
        "Ability to describe main spirit category\nSpeak fluent English",
        "Desirable",
        "Exceptional cooking skills "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}