{
    "Job ID": "4732211",
    "Description": "The Construction lead will be responsible to manage and coordinate all site construction activities aspects of the project. Will be an integral part of the leadership team, focused on delivering the project within time and budget and achieving the company's strategic goals\nManaging contractors site activities in the delivery of their respective scopes of work to meet quality, schedule and cost.\nMonitoring contractor progress in the execution of their work to ensure the contract scope is being executed in a timely manner to achieve the contract milestones.\nAttend progress meetings with Contractors and prepare necessary progress / status reports.\nCoordinating the works in accordance with the construction schedule.\nManage the review and approval of all the materials and shop drawing submittals.\nTo check technical accuracy of work.\nReviewing, commenting and approving contractor’s construction deliverables to ensure that such deliverables appropriately govern the execution of the work within the contract.\nCoordinate the site activities and requirements between site and ADP project team.\nDuties include monitoring execution schedule, following up and checking of all contractual issues.\nReview project variations in relation with project contract’s requirements.\nConstruction issue resolution\nInterface coordination between different contractors on the project\nSupporting the provision of construction input as and when required during the “Procurement” phase of the Project including technical evaluations, responding to queries and clarifications related to construction elements for the projects assigned.\nSupporting the Project Director in leading and managing the “Delivery” phase for construction project including achieving construction schedules, managing contractors, achieving quality requirements for the projects assigned\nSupporting the provision of construction support to “Inspection and Handover” phase of the Project including inspection of work.\nSupporting the provision of construction input to the “Closeout” phase of the Project including construction input to the assessment of claims for the projects assigned.Skills",
    "Skills": [
        "Bachelor’s or master’s degree in mechanical engineering, process engineering or similar\nEnglish (Fluent)\nArabic (Not required but could be advantageous)\nMinimum of five years’ professional experience in the field of Construction involving steel fabrication / process plants (desalination)\nWorking within a Project Management team on the construction projects either as a client or as a contractor with specific experience of managing site activities\nExperience in steel fabrication / Ship Building or process plants construction will be an advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}