{
    "Job ID": "4732210",
    "Description": "The seawater desalination lead is responsible for overseeing and managing all technical aspects of our desalination projects during tendering, execution and operation and maintenance. This role ensures the effective and efficient development of the projects, The seawater desalination lead will manage and coordinate all technical aspects of the project. Will be an integral part of the leadership team, focused on delivering the project within time and budget and achieving the company's strategic goals\nManage and coordinate the activities for Seawater Desalination projects.\nOrganize, supervise, and track the design deliverables generated by the design consultant, including reports.\nCoordinate the response to comments raised on technical deliverables.\nCoordinate project interfaces in assigned areas between engineering groups or disciplines, with the consultants, suppliers, and contractors.\nCoordinate and visit the jobsite as required, to resolve problems, interpret drawings and documents and provide technical support during the construction phase.\nCoordinate with other disciplines, consultants, and attend project meetings.\nReview design and engineering studies prepared by local and international engineering firms.\nTake a monitoring role in design reviews, interdisciplinary design reviews and provide comments if necessary.\nProvide guidance for assured design quality and compliance with the requirements, design guidelines, statutory requirements, local and international codes, standards and norms, and international standards of independent firms that are carrying out the detailed design.\nReview contractor’s construction drawings, respond to technical queries and technical submittals to ensure compliance with design intent.\nReview changes or deviations in design scope, material quantities, budget or schedule, and assists particularly with defining the change\nReport progress, critical issues and risk to Project DirectorSkills",
    "Skills": [
        "Bachelor’s or master’s degree in process engineering, mechanical engineering or similar\nMinimum of five years’ professional experience in the field of seawater desalination\nExpert knowledge in the areas of pre-treatment, membrane processes and water chemistry would be an advantage\nKnowledge of the design, construction and commissioning of desalination plants\nExperience in the area of project development and EPC and O&M contract negotiation will also be an advantage"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Electric Power Production & Transmission",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}