{
    "Job ID": "4732734",
    "Description": "• Technicians conducts inspection for Fire Fighting and Fire Alarm System• Test run of diesel engine fire pump for 30 minutes• Test run of electric motor driven fire pump for 10 minutes.• Checking of water level.• Checking of Automatic tank filling valves• Checking of pressure gauges.• Test pressure minimum of 13.8 bar and observed at least 2 hours• Checking of the jockey pump for proper functionality.• Inspection of diesel engine fire pumps include level of diesel in the tank, oil level on engine, electrical, manometers, valves in correct position, etc.• Test of each pump assembly regarding minimum rated and peak flows discharged through approved test devices.• Physical inspection of firefighting equipment (Extinguishers, hose, pump, hydrant etc.)• Inspection of fire hose cabinets and hydrants• Checking of the correct level of foam concentrate• Inspection of all valves inclusive deluge valves.• Checking of Backup batteries/generators according to manufacturer’s requirements• Checking of automatic fire-doors and other fire critical aspects like emergency door.• Inspection of (tank) cylinder exterior, supports, vent, and ladders.• Inspection the area surrounding the tank to ensure that the area is free of combustible material, trash, etc.• Checking of entire system inclusive call points in according to NFPA 72, chapter 14.• Checking of main control panels of fire alarm system etc. all non- conformances will be rectified.• Examine batteries and connections, and replace as needed.• Smoke detectors testing.• Checking of foam concentrate according to manufacturer requirements• Inspection of Sprinkler pipes, fittings and pipe support from floor level• Testing Water flow alarms.• Physical inspection of hoses, couplings, nozzles and fire hose reel shall be rolled out.• inspection of interior control of tank if the control shows that there are no issues related to rust, slime or any type of blockage, longer control intervals can be accepted.• flow testing on the hydraulically most remote outlet.• testing of hydrostatic pressure of the piping• testing of Hoses, removed and service after the date of manufacture, thereafter. Replacement hoses must be used.• foam concentrate tanks drained and flushed, to ensure no corrosion• hydraulic test will be conducted on pressurize foam concentrate tanks.• inspection of piping condition.Skills",
    "Skills": [
        "- Familiarity with hardware, software, and network components.",
        "- Hands-on experience with system modeling and simulation tools.",
        "- Practical exposure to system modeling and simulation tools.",
        "-3 to 5 years of experience in fire fighting and fire alarm systems design and construction.Solid understanding of NFPA standards and the Saudi code for fire systems.",
        "Familiarity with fire protection system design software and AutoCAD.",
        "Strong analytical and problem-solving skills.",
        "Excellent communication and interpersonal skills.",
        "Ability to work collaboratively in a team environment.",
        "NFPA certification is preferred.",
        "If you meet the above criteria and are passionate about ensuring fire safety in buildings and facilities, we invite you to apply for the position of Fire Engineer.",
        "Join our team and contribute to creating safer environments for our communities."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}