{
    "Job ID": "4732494",
    "Description": "Oversees reports regarding cash flow; ensures correct payments are made in a timely manner.\nDevelops guidelines for proper handling and coding of invoices to maintain general ledger expense account and inventory records.\nAnalyzes expense reports and other invoices for accuracy and eligibility for payment.\nVerifies payments before controllers signature is added by reviewing checks and vouchers.\nReconciles accounts payable total and general ledger with other applicable records (e.g., subsidiary vendors ledger).\nFacilitates correct and timely preparation of budget reports and purchase journals.\nEnsures proper recordkeeping of purchases for use in tax preparation and periodic audits.\nEnsures employer identification numbers or social security numbers have been collected from all vendors for the payables clerk to prepare and submit 1099s.\nEnsures proper maintenance, filing, and storage of records in case of audits.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Excellent verbal and written communication skills.\nProficient in accounting software and Microsoft Office Suite or related software.\nThorough understanding of accounts payable functions.\nExcellent supervisory and analytical skills.\nExcellent organizational skills and attention to detail.\nAbility to motivate staff.",
        "Experience 3-5 Years In The Same Position ",
        "In The Field of Religious Tourism Or Hotels"
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Nasr City, Cairo , Egypt",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}