{
    "Job ID": "4732903",
    "Description": "Duties and Responsibilities:Protects assets by planning and completing financial audits; identifying inadequate, inefficient, or ineffective internal controls; recommending improvements\nImplement best audit in line with applicable internal audit statements\nFollow up all related party transactions and comferm the balance\nFollow up IKTVA & BENA PLAN\nPlans financial audits by understanding organization objectives, structure, policies, processes, internal controls, and external regulations; identifying risk areas; preparing audit scope and objectives; preparing audit programs.\nAssesses compliance with financial regulations and controls by executing audit program steps; testing general ledger, account balances, balance sheets, income statements, and related financial statements; examining and analyzing records, reports, operating practices, and documentation.\nAssesses risks and internal controls by identifying areas of non-compliance; evaluating manual and automated financial processes; identifying process weaknesses and inefficiencies and operational issues.\nVerifies assets and liabilities by comparing and analysing items and collateral to documentation.\nCompletes audit work papers and memoranda by documenting audit tests and findings.\nCommunicates audit progress and findings by providing information in status meetings; highlighting unresolved issues; reviewing working papers; preparing final audit reports.\nImproves protection by recommending changes in management monitoring, assessment, and motivational practices, in the internal control structure, and in operating processes; identifying root causes\nSupports external auditors by coordinating information requirements\nProvides financial control information by collecting, analysing, and summarizing data and trends.\nProtects organization's reputation by keeping information confidential.\nUpdates job knowledge by participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.\nContributes to team results by welcoming new and different work requirements; exploring new opportunities to add value to the organization; helping others accomplish related job results as and where needed.Skills",
    "Skills": [
        "Computer Literacy: Ms Windows’s applications (Excel is essential), Outlook, PowerPoint and Excellent Presentation skills, Excellent Business and Technical writing skills.\nIntermediate to advanced knowledge of SAP System for both general ledger and statutory accounting. Great Plains and Freedom preferred.\nAudit, Financial Skills, Financial Diagnosis, Analysing Information , Research Skills, Reporting Research Results, Integrity and Trust, Project Management, Attention to Detail, and Objectivity\nExtensive ability to handle confidential material with discretion.\nThorough understanding of International Financial Reporting Standards (IFRS). Knowledge of Statutory accounting principles.\nStrong analytical and accounting skills.\nMust be able to effectively handle multiple projects simultaneously in a deadline driven environment.\nAbility to work independently and as part of a team and take on new tasks with high level of difficulty.\nThe individual will be expected to work with minimal up-front guidance and take ownership of his / her work product"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Dammam, Saudi Arabia ; Khobar, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Financial Auditing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}