{
    "Job ID": "4732857",
    "Description": "·      المساهمة في وضع الأهداف التنظيمية والخطط الاستراتيجية لضمان تحقيق الأهداف التنظيمية الشاملة للقسم.\n·      المتابعة والإشراف على تطبيق المنهجيات الداخلية المعدة لمتابعة سير الأعمال وتنفيذ العمليات الرئيسية ورفع التغذية الراجعة للمدير المباشر.\n·      تنظيم وتوزيع العمل، وتوجيه المرؤوسين، والقيام بتنسيق ومتابعة تنفيذ كافة الأعمال اليومية ذات الصلة.\n·      وضع المقترحات لتحسين وتطوير العمل وتحفيز الموظفين ورفعها إلى المدير المباشر\n·      تقديم الدعم اللازم في إعداد التقارير المالية بحسب دورية تقديمها.\n·      المشاركة في إعداد الموازنة الخاصة بالقسم بالتنسيق مع أعضاء الفريق المعني\n·      مراجعة نسب الانجاز وتقييم أداء المهام والموظفين بالقسم\n·      أي مهام إضافية يكلف به مدير الإدارة.\n·      الاشراف على اعداد الموازنة الخاصة بالمؤسسة وفق المنهجية المتبعة لإعداد الخطة بالتنسيق مع الوحدات التنظيمية المعنية في المؤسسة\n·      الإشراف على إعداد الحسابات الختامية والتقارير المالية المعدة من قبل القسم.\n·      مراقبة وإعداد مستندات الصرف والتعديلات التي تجري عليها بالإضافة إلى إجراء المطابقات الشهرية لحسابات المؤسسة مع قيود دائرة المالية في الأوقات المحددة.\n·      الإشراف على إعداد موازنة الرواتب ومراجعة تنفيذ الموازنة لضمان عملية الصرف.\n·      التواصل والتنسيق مع دائرة المالية فيما يتعلق بالقرارات والقوانين وتوزيع الأدوار والتطبيق الأمثل لها.\n·      اعداد الدراسات المالية وتقديم المقترحات البناءة لتخفيض التكاليف والحد من الانفاق\n·      المساعدة في متابعة تقارير دائرة المالية وأعمال التدقيق الداخلي والخارجي والاشراف على الرد عليها.\n·      تقديم التحليلات الرئيسية اللازمة لأنشطة وخطط الأعمال في محاولة لتحديد المخاطر المالية.\n·      إدارة كافة المهام والأنظمة المحاسبية بما يضمن مدى دقتها وترابطها\nضمان الحفاظ على التدابير الداخلية والإجراءات المالية/ المحاسبية المناسبةSkills",
    "Skills": [
        "1- المام بالجوانب القانونية والتشريعية\n2- معرفة بإعداد الموازنات ورقابتها  \n3- قدرة على تقييم الأداء المالي  \n4- معرفة في التحليل المالي وعمل التنبؤات  \n5- مهارات التحليل واعداد التقارير  \n6- المام بالغة الانجليزية\n7-مهارات العرض والالقاء\n "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 10 Max: 20",
        "Residence Location": "Dubai, United Arab Emirates ; Sharjah, United Arab Emirates",
        "Gender": "Male",
        "Nationality": "United Arab Emirates",
        "Degree": "Certification / diploma",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$9,000 - $10,000",
        "Number of Vacancies": "1"
    }
}