{
    "Job ID": "4732438",
    "Description": "Job Summary:Showroom Sales Representatives sell tableware products to customers visiting our showrooms. Theywill primarily deal with either walk-in customers or source sales via online media, cold calling, and leadfollow-up calls.General Duties and Responsibilities: Greeting customers, responding to questions, improving engagement with merchandise and providingoutstanding customer service. Maintain and update own self with superior product knowledge, stock and price range. Communicating with customers, to understand their needs to be able to suggest the right table setsor mixing and matching from multiple products to meet customer’s taste and satisfaction. Answering potential customers' questions, updating them with our new products via WhatsApp andemail. Keeping up with products stock, availability and service information and updates. Creating and maintaining a database of current and potential customers. Explaining and demonstrating features of products and how to use / clean / heat.....etc. Staying informed about competing products and services to be able to outstand them. Close, upsell and achieve sales targets. Inspecting the Showroom on daily basis to ensure cleanliness and intact presentation of products. Constantly reports and follows up on maintenance issues in the showroom and ensures that it isimpeccably clean. Following and attending to work needs as assigned by the superiors ensuring to complete tasks toutmost accuracy. Comply with the company’s policies and procedures at all time. Not to divulge commercial work secrets and, in general, any matter related to the company’s work, itsinternal and external affairs and/or work system. It is also forbidden for the colleague to competewith the employer in the same activity. Follow safety and occupational health and prevention measures as announced in country’s laws,company and management policies and procedure manuals.Skills",
    "Skills": [
        "High school diploma / post-graduation courses related to sales / communication and /or Customer\nservice.\nExperience in sales is an asset.\nSalary Range from EGP 10,000-12,000\nExcellent communication skills, both verbal and written.\nUnderstanding of the sales process and dynamics.\nA commitment to excellent customer service.\nSuperb interpersonal skills, including the ability to quickly build rapport with customers.\nExperience using computers for a variety of tasks.\nCompetency in Microsoft applications including word, excel, and outlook.\nAble to work comfortably in a fast paced environment.\nExcellent English Skills."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 30"
    },
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Trading & Commodity Trading; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}