{
    "Job ID": "4732510",
    "Description": "Implement the human resources strategy within assigned departments taking into consideration strategic goals and objectives.\nDeliver all aspects of HR services within agreed Policies rand regularly provide reports and matrices on assigned department’s performance.\nProvide input to HR policy formulation, implement and interpret HR policy and procedures and ensure effective and proactive communication across assigned departments on policies, procedures and services\nProvide overall expertise in HRMIS, Payroll Processing, Records Management and Separation and be the reference point to the HR Department but working closely with the the heads of other departments\nOwn and drive recruitment, on boarding, talent management and motivation needs of assigned departments ensuring each process meets organization goals.\nManage succession, staff development and workforce planning as essential activities within the assigned departments.\nEnsure departmental data in the HRMIS relating to records management, leave, payroll, medical and other HR duties are coordinated and executed within expected standards\nEnsure effective implementation of performance management processes and systems for the organziation goals\nManage all staff welfare and employee relations matters within assigned departments and ensure timely and adequate resolution of any issues so as to promote a harmonious working environment.\nLead and supervise HR staff supporting assigned departments, ensuring they have clear objectives and resources need to perform their tasks.Skills",
    "Skills": [
        "A Bachelor’s degree in Human Resource Management or equivalent.\nProfessional HR Certificate or any related certificates\nAt least 3 - 5 year’s hands on human resources management experience.\nKnowledge of employee relations policies, procedures and experience in their implementation.\nExperience in implementing Human Resources Management Information Systems.\nIn depth understanding of scientific staff competence requirements, ability to handle fiscal databases and completely integrate budget and planning documents for HR management.\nAbility to maintain a strategic view but can also conduct detailed analysis as appropriate.\nWillingness to take a hands-on approach to problem resolution as required.\nAbility to build productive and collaborative relationships with varied stakeholders.\nStrong leadership and management skills\nExcellent planning and follow through ability\nStrong interpersonal and communication skills\nFluent in English language"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jordan",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}