{
    "Job ID": "4732902",
    "Description": "Objective of DepartmentThe Gas Market Analysis Department (GMAD) monitors, analyses and forecasts short-term gas market developments, including, but not limited to, gas prices, supply and demand, trade, transportation and storage, as well as factors of short-term nature that impact gas market fundamentals, including economy, inter-fuel competition, energy policies and regulations, taxation and investment. The Department is responsible for keeping Member Countries informed on the latest global and regional gas markets developments through regular reports and studies. The GMAD also cooperates with the other Secretariat structures to undertake joint activities required to fulfill the objectives of the GECF and/or to support Member Countries, in particular in communication, energy dialogue and multilateral negotiations.Objective of PostResponsible for routine secretarial, administrative, financial, statistical, and clerical tasks required by the Department.Main duties & responsibilities1.   Drafts memos/letters/e-mails as requested by the Head of the Department.2.   Records and arranges incoming and outgoing correspondence and assists the Head of the Department in its distribution to the relevant staff.3.   Requests and maintains proper inventories of office supplies and stationery.4.   Assists the Head of the Department in drafting the Program of Work, 5-Year Working Plan, the Department’s budget, and other relevant documents.5.   Assists the Head of the Department in the coordination of activities related to workshops, conferences, and other events held by the Department. 6.   Arranges meetings and business trips for the Department’s staff.7.   Attends the Department’s meetings to record and draft the minutes of meetings.8.   Coordinates activities related to the editing, designing, and printing of the Department’s deliverables.9. Creates filing systems and initiates their changes and updates. Contributes to archiving the data and correspondence of the Department.10. Performs typing duties of varying difficulty, including complicated materials.11.Carries out any other tasks assigned to him/her by his/her relevant superiors (Secretary General or Department Head) as pertaining to his/her background, qualifications, and position.Skills",
    "Skills": [
        "Education: University degree in a relevant field ",
        "Work experience: Minimum of 5 years of work experience as a secretary or personal assistant.",
        "Excellent communication, interpersonal, organizational, and time management skills. Excellent Microsoft Office knowledge.",
        "Language(s): Excellent command of English & capable of writing reports. Excellent computer and typing skills. ",
        "Age: Maximum 58"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}