{
    "Job ID": "4732679",
    "Description": "Job Accountabilities:1. Plan, direct, co-ordinate, and control the work.2. Execute Projects in accordance with corporate practices and Project procedures.3. Developing and implementing a project execution plan and project schedules that meets with Company and Contract requirements.4. Provide leadership and commitment to the Project HSSE and Quality plan.5. Keeping to the control budget within the objectives established for the Project. 6. To focus upon customer care and customer feedback7. To understand the Project ‘business case’ and drivers8. Act as focal point for Engineering, Procurement, and Project services resources deployed on the project.9. Interface closely with client management representatives to ensure client interests are being accommodated.10. Clearly define and communicate the project objectives and organization to the Project team.11. To feedback to the Company data related to performance of work on a regular basis12. To monitor and expedite account receivables for the Project.13. To document lessons learned and to review/implement lessons learned from other Projects14. To close out the projectSkills",
    "Skills": [
        "Required qualifications and experience:",
        "• Undergraduate degree in an engineering discipline",
        "• Minimum of 15-20 years of relevant experience",
        "• Ideally candidates will have further education and certification in the field of Project Management, PMP or APM for example.",
        "• Must have good working experience of the Microsoft Office applications in the development of documents, presentations, trackers and schedules etc.",
        "• Is a self-motivated, proactive and highly driven individual with high standards, attention to detail and capable of demonstrating initiative.",
        "• High level of commercial aptitude and awareness. Should be able to interpret and follow the Contract whilst raising potential delays, change and commercial matters to Project Sponsors in good time.",
        "• Must be an excellent communicator, being a leader in the success of multi-discipline team delivery. Motivates teams in a positive manner to ensure a proactive approach in the delivery of timely solutions.",
        "• Highly experienced with risk and change management across the full project lifecycle, ideally having exposure to both design and site works. Highlights and quantifies change when it impacts the work.",
        "• Experienced across multiple project phases such as Concept/Feasibility, Pre-FEED, FEED, Detailed Design, Procurement, Construction, Commissioning, Star-Up and Warrantee",
        "• Proven experience in managing lump sum contract for Engineering projects for oil and gas industry (Qatar experience is preferred)",
        "• Able to lead others in a challenging environment.",
        "• Able to make decisions and drive decision processes.",
        "• Excellent analytical and abstract reasoning skills, plus excellent organization skills",
        "• Well-developed management and administrative skills",
        "• Works within a team to establish direction, alignment and commitment.",
        "• Well-developed interpersonal skills. Ability to get along with diverse personalities. Tactful, mature, and flexible",
        "• High energy level, comfortable performing multifaceted projects.",
        "• Demonstrated servant leadership ability, team management, and interpersonal skills.",
        "• Well organized, credible and decisiv"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}