{
    "Job ID": "4732864",
    "Description": "We are revolutionizing the Retail, Fulfillment, and Intralogistics industries, developing our own cutting-edge robotics by creating software and hardware systems. We’re proud to supply and integrate our original product into existing supply chains and provide full-service maintenance. We are completely committed to openness, responsibility, and freedom of engineering. We are working and going to work with colleagues who share our values and are eager to work in a challenging environment.Job location: GULF region (relocation package)Job Summary:We are looking for a full-time Solution coordinator to join our team. You will be responsible for interunit cooperation within the company. This includes coordination between engineering and supply chain units and communication with external manufactures.Duties:Search for system components\nCoordination of production with the developer (and supplier)\nTechnical support for the procurement process- answers to technical questions of selection and manufacturers- input control of supplied components- writing complaints (technical part)Work with third-party industries (placement of orders for the manufacture of parts from\nmetal and plastic)\nAbility to communicate ideas, justify chosen decisions.\nInput quality control of system components.Pipeline:60% - work with documents, implementation of input quality control, analysis, search, reporting, business correspondence\n40% - internal and external communications with the team and contractorsWhat we offer:➔ Lack of bureaucracy; no outdated rules◆ We don't waste time on unnecessary approvals and paperwork. This allows us to focus on our core processes and achieve maximum efficiency.➔ Great team spirit◆ Our team is tight-knit, friendly, highly professional, proactive, productive, responsible and reliable. ➔ Training and development ◆ Developing our employees means developing our company. Visiting specialized exhibitions in Europe and the USA helps us stay up-to-date with the latest trends and technologies. We offer opportunities for growth not only professionally but also in related areas. ➔ Prospects ◆ Robotics is one of the most promising areas of activity. Our company offers a chance to work at the forefront of scientific and practical thought and to become not just a professional, but a pioneer who sets standards and trends for others. ➔ Freedom of time management ◆ Ability to predict the amount of time you’re going to spend on a given task and be ready to present it on-time-this is what we truly value in our team. That's why we give our employees the freedom to manage their own time, while carefully ensuring the best outcome is provided within the agreed time frame.Why us? Our company culture is built on the values of openness, responsibility, and freedom of engineering. Weencourage our employees to embrace new opportunities and challenges, take ownership of their work,and explore innovative solutions.Our values Openness: Be open to fresh possibilities, transformations both internal and external, and facing obstacles and challenges.Responsibility: You manage your tasks and set your own deadlines, that’s why you are accountable for the outcomes of your own labor in the presence of colleagues and customers, as well as, for the feedback and assessment of the output of the work of fellow teammates and customers.Freedom of engineering:The potential for unrestricted creativity is within reach! The only inquiry is when it may be realized, in what shape, and with what necessary features and characteristics.Skills",
    "Skills": [
        "Your profile:",
        "Knowledge and ability to read blueprints (ISO, SCADE)\nExperience in engineering\nKnowledge of technological processes for the processing of ferrous and non-ferrous metals, including sheet material\nKnowledge and ability to communicate on part quality control\nExperience in CAD systems SolidWorks, SolidEdge\nReal work experience in production as a technologist from 3 years in manufacturing body parts, shafts, sheet metal parts\nAbility to conduct business correspondence\nKnowledge how to use measuring tools\nKnowledge English at a level not lower than B2 + technical English\nKnowledge and used normative documents DIN, ISO, GOST\nAbility to write technical quality control reports, submit claims with support for documents",
        "It would be a plus if you:",
        "➔ Have higher technical education"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Computer Hardware & High-Tech Manufacture; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}