{
    "Job ID": "4732975",
    "Description": "Our client: On behalf of our client an eminent name in the construction/ EPC industry, we are looking for a seasoned professional to join the tendering team.Your role: Prepare technical proposal and cost estimation for tender projects. Estimate project quantities and costs in the preparation of major tenders in a timely and cost-effective basis. Review estimate inputs from functional department and supervise the preparation of cost reports and price forms. Monitor current competitive prices, new techniques, and cost trends. Provide technical inputs where possible. Assist the project management or Sales team on technical and/or costing matters during the process of securing the contracts. Update and maintain the customer database. Oversee the sales process from prospecting, through to final negotiation & handover to project/ contract management team. Maintain a tendering pipeline process ensuring a methodical approach to finding and capitalizing a flow of business opportunities required to achieve the company objectives. Follow up all quotations. Attend technical meetings with clients during the tendering process.Skills",
    "Skills": [
        "Must haves: Candidates for this role typically have at least 15 years of experience. Education in Mechanical Engineering, Electrical engineering, or Civil engineering degree. Must be proficient MS office including Word, Excel, Outlook, and Project. Strong technical skills with the ability to read and understanding engineering drawings. Working knowledge of conditions of contracts. Excellent inter-personal skills and communication skills. Strong engineering, analytical and problem-solving skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building; Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}