{
    "Job ID": "4732934",
    "Description": "Build and maintain a sufficient and accurate pipeline of sales opportunities to ensure that sales goals are met.Prospect and penetrate a list of named accounts as assigned via professional prospecting and networking direct with target accounts and also via the Microsoft account teams assigned to those accounts.\nDevelop and maintain ongoing relationships with existing customers to ensure that we retain them and continue to be the partner of choice.·      Attain/Maintain Microsoft Dynamics 365 (AX/CRM) Sales certification(s) as required.·      Meet or exceed sales goals as established in the GP monthly target sales mo.·      Maintain a sufficient and accurate pipeline as established in the annual sales plan.·      Build and maintain strong working relationships with the appropriate Microsoft team members.·      Conduct all business activities in an ethical and prudent manner.·      Update and/or submit all required reports and information within the designated timeframe(s).Skills",
    "Skills": [
        "·      Skills and Experience:",
        "prelingual (Arabic & English)",
        "Knowledge of the market sector and the competitive landscape in the industry verticals like Discrete Manufacturing, Consumer, Professional Services, Retail, and Distribution.",
        "Sales hunter personality is a must.\nGood, recorded experience in selling Dynamics 365 (AX/ CRM) and/or ERP Software solutions.\nWorking understanding of Dynamics 365 (AX/CRM) systems is highly advantageous.\nAbility to communicate, in writing and verbally, in a professional and polished manner.\nMust have experience not less than 5 years closing deals and working within the SME sector selling software solutions - Dynamics 365 is preferable, but other Software Solution sales will also be considered.\nExcellent time management and prioritization skills.\nTime optimization and identification of priorities.\nProductive engagement in different activities simultaneously.\nWeeding out essential tasks while understanding effective time division."
    ],
    "Preferred": {
        "Years of Experience": "Max: 5",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "2"
    }
}