{
    "Job ID": "4732333",
    "Description": "Live-in French Nanny / GovernessWe are seeking an experienced and nurturing live-in Female French Governess with a French passport, a UAE Driving License, and proficiency in English to join our family. Your primary responsibility will be to provide a stimulating French language and cultural immersion for our children while also supporting their educational needs. Additionally, your ability to communicate in English will be essential for effective coordination with the family and other requirements.Responsibilities:French Language and Cultural Immersion: Create an immersive French-speaking environment through engaging activities, conversations, and storytelling, fostering fluency and cultural appreciation.\nAcademic Support: Provide educational support and tutoring in various subjects, ensuring the children's academic progress.\nEnriching Activities: Plan and execute age-appropriate activities to stimulate creativity, critical thinking, and a passion for learning in both French and English.\nCollaborative Approach: Work closely with parents and other household staff to align educational goals and ensure a supportive environment for the children's growth.\nDriving Duties: Safely transport the children to and from school, extracurricular activities, and appointments,\nSafety and Well-being: Prioritize the safety, well-being, and emotional development of the children at all times.Benefits:Competitive Salary: Compensation will be based on qualifications and experience.\nAccommodation: Private living quarters within the family's home will be provided.\nMedical Insurance and Employment visa\nMeals will be provided while on duty.\nTravel Opportunities: Occasional travel with the family may be required, with expenses covered.\nPaid Time Off: Eligibility for paid time off will be discussed during the interview process.Skills",
    "Skills": [
        "Requirements:",
        "French Language Proficiency: Native French speaker with excellent command of the language, both written and spoken.\nEnglish Proficiency: Proficient in English to communicate effectively with the family and support the children's school learning\nFrench Passport: Must hold a valid French passport\nUAE Driving License: Possess a valid UAE Driving License with a clean driving record.\nExperience: Proven experience as a Governess or private tutor with outstanding references.\nCultural Awareness: Deep knowledge and appreciation of French culture, customs, and traditions.\nDiscretion: Demonstrates the ability to maintain strict confidentiality and professionalism in a private household setting.\nAdaptability: Flexible and adaptable to changing schedules and travel requirements.\nSwimming: Comfortable swimming in pool and ocean.\nEtiquette and Social Skills: Instill proper manners, etiquette, and social skills, helping the children develop into respectful and well-rounded individuals.",
        "To Apply: If you are a dedicated and experienced French Governess with a French passport, a UAE Driving License, and proficiency in English, and passionate about language education and cultural enrichment, we invite you to submit your application with the following documents:",
        "Resume/CV detailing relevant experience and qualifications.\nCover Letter expressing your interest in the role and your suitability for the position.\nReferences: Contact details of previous employers or individuals who can attest to your capabilities.",
        "Please note start date for the position will be Thursday, August 24th"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Gender": "Female",
        "Nationality": "All Western European Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Preschool, Nursery, & Daycare",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}