{
    "Job ID": "4733007",
    "Description": "Position Overview:We are seeking a highly organized and detail-oriented Accountant to join our team. As an Accountant, you will play a crucial role in managing and maintaining financial records related to purchases, invoices, taxes, inventory, and reporting. Your responsibilities will include tracking all financial transactions, ensuring compliance with tax regulations, maintaining accurate inventory records, and preparing various financial reports.Responsibilities:1. Purchase and Invoices:  - Record and monitor all purchase transactions and invoices accurately.  - Verify and reconcile invoices with purchase orders and receipts.  - Ensure timely payment to vendors and resolve any discrepancies in a timely manner.2. Tax Compliance:  - Maintain up-to-date knowledge of tax laws and regulations to ensure compliance.  - Prepare and file VAT reports and other tax-related documents on time.  - Collaborate with external tax consultants or authorities as needed.3. Inventory Management:  - Track inventory levels and movements, ensuring accuracy and timely updates.  - Conduct periodic physical stock audits to reconcile system records with actual stock on hand.  - Analyze inventory data to identify potential issues and recommend improvements.4. Internal System Updates:  - Enter and update financial transactions into the company's internal accounting system.  - Reconcile accounts regularly to maintain accurate financial records.  - Collaborate with other departments to gather necessary financial information.5. Daily Cash Handling:  - Manage and reconcile cash transactions on a daily basis.  - Prepare and maintain daily cash reports and ensure proper documentation.6. Financial Reporting:  - Generate and analyze various financial reports, such as profit and loss statements, balance sheets, and cash flow statements.  - Provide financial insights and recommendations to management for informed decision-making.7. Auditing and Compliance:  - Assist in internal and external audits, providing necessary documentation and explanations.  - Ensure compliance with company policies, accounting standards, and legal requirements.Skills",
    "Skills": [
        "The ideal candidate will have a strong understanding of accounting principles, excellent analytical skills, and the ability to handle multiple tasks effectively.",
        "-Bachelor's degree in Accounting, Finance, or a related field.",
        "- Proven experience as an Accountant or similar role, preferably with experience in handling purchase, tax, inventory, and reporting functions.",
        "- Strong knowledge of accounting principles, tax regulations, and inventory management.",
        "- Proficiency in using accounting software and MS Excel for data analysis and financial reporting.",
        "- Attention to detail and accuracy in recording financial transactions.",
        "- Ability to multitask and meet tight deadlines in a fast-paced environment.",
        "- Excellent communication skills and the ability to collaborate with cross-functional teams.",
        "- Integrity and professionalism in handling sensitive financial information.",
        "Joining our team as an Accountant will provide you with a challenging and rewarding opportunity to contribute to the financial success of our organization. If you have a passion for numbers and a commitment to maintaining financial integrity, we look forward to receiving your application."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 7"
    },
    "Data": {
        "Job Location": "Heliopolis, Cairo , Egypt",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}