{
    "Job ID": "4733368",
    "Description": "JAVA developer. for a leading bank in Riyadhrelated banking experience in Java Development roll not less than yearsPlease find below the key Responsibilities we are looking for: Core Java/JEE development skills and understanding of Java design principles\nDeveloping web applications using Spring MVC, Angular, and Hybrid Mobile framework.\nWebSphere 8.5 & 9, MS SQL Server\nJSP, JavaScript, and JQuerySkills",
    "Skills": [
        "Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate).\nExcellent analytical and problem-solving skills.\nWell-versed in Java frameworks and related JEE internals, including, but not limited to, Exception Handling, Memory Management, Class Loading and Transaction Management.\nProficiency with handling core Java frameworks and JEE internals (Memory Management, Class Loading, JAX-WS, JAX-RS, etc.)",
        "Please find below the key skills we are looking for: ",
        "Strong core Java/JEE development skills and understanding of Java design principles\nExperience in developing web applications using Spring MVC, Angular and Hybrid Mobile framework.\nExcellent knowledge of WebSphere 8.5 & 9, MS SQL Server\nExperience in the following technologies: JSP, JavaScript, and JQuery\nExcellent problem-solving and production troubleshooting skill\nAbility to work well under pressure and time constraints\nExcellent written and verbal communication including technical writing skills.",
        "Desirable Skills",
        "Familiar with Mobile Native application technology and frameworks\nDemonstrate good understanding of all phases of the development lifecycle.\nExperience in Internet banking applications including Web and Mobile."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}