{
    "Job ID": "4733600",
    "Description": "To prepare and share the country growth strategic plan including customers, suppliers, and products for next three years within first quarter of joining.\nRetaining credibility with all principals and customers with consistence communication on behalf of ECORE GROUP operating company and seeking their grievances if any and ensure communication with the line managers to address the issues.\nEnsure delivery of monthly sales budget via ERP reporting. Report all competition activities to the line manager.\nEnsure Group credit control policy is implemented & followed with assured payments to Ecore in agreed timeline. \nEnsure there is no local stocks at any warehousing location for more than 90 days for the operating company at any time.\nIdentification of new prospective principals and products for growing sales into existing / new customers.\nEnsure that sales prospectus are updated with new customers, products and applications and shared via CRM consistently & reviewed with line manager at the end of every month.\nIdentify minimum two key projects for various subsector with a minimum value of half a Mln US$ over the agreed sales budget.\nEnsure to follow the operational processes aligning to the ERP and the guidelines issued by CFO for continuous improvements. Ensure smooth implementation of CRM as and when it is implemented.\n.Ensure to follow QHSE policy, ERP processes and local company operations are regulated under the company and in line with legal compliances. Report everything to the management in case of any discrepancies.  Skills",
    "Skills": [
        "Education: B.Pharma\nMinimum 1-5 years of experience in sales with market knowledge in UAE. \nIn-depth knowledge to convert leads into final customers, thereby contributing to the company revenue.\nProficient in creating sales records, client interactions, and developing precise reports.\nApproaching new and existing customers by following optimum consumer service standards.\nTremendous enthusiasm to efficiently achieve sales goals under tight deadlines.\nExcellent phone and presentation skills.\nAbility to find the right balance between client requirements and company terms, thereby improving profit margins and maintaining fruitful customer relationships."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Pharmaceutical Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}