{
    "Job ID": "4733356",
    "Description": "Regional Sales Manager - KSAOur client is a leading Chinese semi-state-owned security inspection manufacturer. They are now looking for a Regional Sales Manager (KSA, Jordan and Qatar) - KSA-based to join them.Roles & Responsibilities:Increase share of wallet and market penetration in the MENA region through new client acquisition.\nGenerate, develop, and close sales opportunities for security inspection products, including scanners for baggage and parcel inspection, cargo and vehicle inspection, personnel inspection, and fever screening technology, and other products that are used in civil aviation, customs inspection, railway inspection, highway freight inspection, building security and large event security. This is a revenue-generating role and success is measured against unit sales and revenue targets on a monthly, quarterly, and annual basis.\nHunting for new business to achieve regional/territory revenue targets.\nResearching and prospecting customers for sales pipeline development.\nDevelop strategies and execute to improve conversions in funnel.\nProduct demos and working closely with product and marketing to improve conversion rates.\nBe the product expert in the region.\nOrganizing multiple face-to-face meetings in a day at schools in cities within your territory.\nWarm handover to the account management team for onboarding the client.Salary: AED 20000 - AED 25000Skills",
    "Skills": [
        "Preference:",
        "Immediate joiners\nEnglish-speaking, Arabic-speaking",
        "Qualifications:",
        "Minimum 5 years’ experience in selling x-ray or security scanners, or security inspection scanners\nMust have the solid and strong connection in either KSA, Qatar or Jordan, or all three countries.\nFamiliar with governmental authorities and departments is a plus.\nBachelor degree or above in Engineering is preferred or higher\nStrong hunter mentality matched with a proven aptitude for customer service\nSuperior interpersonal skills: capacity to deal with a range of individuals\nEngaging presentation and persuasion skills\nVery strong written and verbal technical/commercial communication skills\nCapacity to challenge and negotiate for a win-win outcome\nStrong work ethic with an ability to work in an autonomous, fast-paced environment\nArticulate, friendly, optimistic, goal oriented and success driven\nHighly organised and meticulous, with follow through\nHigh degree of social and cultural awareness",
        "Benefits:",
        "Salary + commission\nUAE Mandatory Benefits"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}