{
    "Job ID": "4733431",
    "Description": "We are looking for an enthusiastic Sales Engineer (based in Saudi Arabia) to join our vibrant growing team and will be responsible for selling to and building relationships with their customers. The candidate will have an understanding of our technical recommendation process selling both solutions as well as products. We are looking for an individual who is driven by sales and achieving targets, determined and commercially aware coupled with an understanding of technical sales within the civils/Construction sector and a real passion for developing customer relationships. Incorporating the use of geosynthetic products within earthworks & foundations, roads and pavements, hydraulic and environmental applications.Skills",
    "Skills": [
        "Key responsibilities ",
        "Understand the Geosynthetics business plan and philosophy. \nThe candidate must be able to work independently and also as a team.\nAchieve personal and department targets. \nProvide basic technical assistance and recommendations when required, utilizing the engineering department where appropriate. \nAssist with the implementation of department sales and marketing strategies. \nProduce a monthly department sales report. \nAble to provide a 3 monthly forecast. \nDevelop new and existing targeted accounts. \nProvide quotations from customer enquiries. \nMaintain and increase the conversion rate of quotations to orders. ",
        "Requirements: ",
        "Bachelor's degree in Civil engineering \nGreat written and verbal communication skills in both Arabic and English. \nSales experience in Saudi Arabia is a plus. Preferably in geotechnical and/or geosynthetic related industry. \nConducting technical presentation to the project stakeholders. \nGenerating sales leads. \nPreparing technical and sales offers. \nExperienced in client relationship development. Building and Maintaining relations with consultants and key decision makers ,and generating business through strategic negotiation. \nProven track record in Technical Sales and/or business development \nIdentify and exploit sales opportunities through tactical planning and product expertise. \nGreat leadership and organizational skills. \nEnthusiastic and willing to learn. \nAbility to execute winning strategies that enhance existing accounts, create new accounts, and accelerate revenue growth.\nStrong project management skills with expertise in developing project plans, coordinating resources, supervising project teams, controlling budgets, and managing project performance. Ability to develop and present progress reports, continuous improvement project proposals and documentation.  \nThe post will require traveling to sites across the kingdom of Saudi Arabia"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering; Construction & Building; Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}