{
    "Job ID": "4733124",
    "Description": "-Supervise a team of software developers, providing mentorship, guidance, and technical expertise to drive high-quality software development practices.- Collaborate with product managers, business development and other stakeholders to define project requirements.- Drive the design, development, and implementation of software applications related to Computer Vision and NLP, leveraging AI and Machine Learning algorithms and frameworks.- Ensure the team follows best practices for software development, including code reviews, testing, and continuous integration/continuous deployment (CI/CD) processes.- Provide technical leadership and expertise in AI and Machine Learning concepts, methodologies, and tools, staying up-to-date with the latest advancements in the field.- Foster a culture of innovation, collaboration, and knowledge sharing within the team.- Participate in the hiring and onboarding process of new team members, contributing to building a diverse and high-performing software development team.Skills",
    "Skills": [
        "Bachelor's or Master's degree in Computer Science, Engineering, or a related field.",
        "-Proficiency in full stack software development using technologies such as .Net Core, Angular, and Python.",
        "- Proven experience in the field of AI and Machine Learning is preferable.",
        "- Strong expertise in AI and Machine Learning concepts, algorithms, and frameworks, specifically applied to Computer Vision and NLP problems.",
        "- Experience with cloud platforms (e.g., AWS, Azure, or Google Cloud) and working in a DevOps environment is highly desirable.",
        "- Solid understanding of software development best practices, including code reviews, testing methodologies, and CI/CD processes.",
        "- Excellent problem-solving skills and ability to analyze complex technical challenges.",
        "- Strong communication and leadership skills, with the ability to effectively collaborate with cross-functional teams.",
        "- Proficiency in troubleshooting and debugging software issues, with excellent problem-solving skills.",
        "- Passion for staying up-to-date with the latest advancements in AI and Machine Learning technologies"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 6",
        "Nationality": "Egypt"
    },
    "Data": {
        "Job Location": "Nasr City, Cairo , Egypt",
        "Company Industry": "Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}