{
    "Job ID": "4733408",
    "Description": "We are hiring a Facility Manager(Riyadh) to manage a large property, and maintenance/technical staff to effectively maintain all property facilities, equipment, and property.Based in Riyadh, you will be responsible for the safe and efficient maintenance of the large property through proper supervision and management of maintenance and technical service staff. Capable of rapid decision-making and must be able to solve complex maintenance problems. The Facility Manager will be responsible for keeping buildings properly maintained, clean, and safe.The role combines management tasks such as supervising contractors and more strategic responsibilities such as managing budgets and advising on long-term energy efficiency. Typical duties include:Overseeing and agreeing on contracts and providers for services including security, parking, cleaning, catering, and IT.\nSupervising teams of staff including cleaning, maintenance, and security.\nEnsuring that basic facilities, such as water and heating, are well-maintained.\nManaging maintenance and staffing budgets.\nEnsuring that facilities meet government regulations, health and security standards and energy efficiency requirements.\nOverseeing building projects and renovationsSkills",
    "Skills": [
        "Bachelor’s degree or equivalent in Engineering, Facilities Management, Housing, or other related discipline is essential\nA minimum of 15 years of relevant experience with at least 5 years of experience in leading large residential/commercial property/asset management.\nRelevant experience in a senior facilities management role spanning across operations & maintenance, housekeeping, security services and Health Safety & Environment."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Age": "Min: 30 Max: 42"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Recruitment Agency",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}