{
    "Job ID": "4733707",
    "Description": "eMagine FMCG have been retained by a global powerhouse that has revolutionized the global FMCG market. Renowned for featuring some of the world's most beloved brands across the global. As part of their expansion strategy, they are ramping up their Dubai operations, presenting a golden opportunity for your personal and professional growth.We are looking for sales professionals with experience in exports and business development in the FMCG industry to scale the company's portfolio in Europe / Middle East / Asia region.• In this role, you will be responsible for the country expansion & coverage, proactively identifying and recommending strategic partners for various product lines and private label brands.• Within the region, you will identify countries and search for possible business partners or distributors. You will research on specific country trade dynamics; channel and route to market.• You should be able to conduct analysis and periodical reviews of the country's sales performance, research competitive information, and market conditions to enhance the business, marketplace performance, and competitiveness.• You will lead a team of Sales Coordinators and will be responsible for their performance management.Skills",
    "Skills": [
        "The ideal candidate should possess a proven track record of generating new business through effective prospecting and networking. Your expertise in constructing and implementing successful sales strategies will be crucial in achieving revenue growth, while also displaying strong managerial skills in coaching and overseeing sales teams."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$9,000 - $10,000",
        "Number of Vacancies": "1"
    }
}