{
    "Job ID": "4733474",
    "Description": "1. Adapting interface for modern internet applications using the latest front-end technologies.2. Writing JavaScript, CSS, and HTML.3. Building and implementing top-notch user interfaces using JavaScript and the Angular framework.4. Ability to write cross-browser-compatible code.5. Cordova plugins, and able to write new custom plugins.6. Capacitor plugins, and able to write new custom plugins.Skills",
    "Skills": [
        "1. (4-8) years of working experience with Ionic frameworks and UI tools building mobile applications.",
        "2.Expertise in developing hybrid mobile apps and PWA using the Ionic framework.",
        "3.Must have working knowledge on Angular, Typescript, JavaScript, Ionic and HTML/CSS.",
        "4.Fluent in Cordova plugins, and able to write new custom plugin.",
        "5.Fluent in Capacitor plugins, and able to write new custom plugin.",
        "6.Should have expert knowledge of using REST APIs.",
        "7.Good knowledge in RESTful web service, XML, JSON, SQLite.",
        "8.Extensive knowledge of mobile APIs and UI standards.",
        "9.Good analytical and problem-solving skills are mandatory.",
        "10.A team player with excellent communication skills.",
        "11.Strong Object-oriented program ability.",
        "12.Expertise in the implementation of Continuous build and delivery of Mobile Applications.",
        "13.Proficient understanding of code versioning tools.",
        "14.Adapting interface for modern internet applications using the latest front-end technologies.",
        "15.Writing JavaScript, CSS, and HTML.",
        "16.Building and implementing top-notch user interfaces using JavaScript and the Angular framework.",
        "17.Ability to write cross-browser compatible code.",
        "18. It’s a plus have prior experience in Writing .NET API’s."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Software Development",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}