{
    "Job ID": "4733578",
    "Description": "As the front of house to the bakery school the administrator excels in customer service. To ensure the efficient and successful management of the bakery school admin from and for all internal and external parties. The administrator is often the customer's first experience of the bakery school and works to ensure the reputation of the brand through efficient and polite communication at all times.RESPONSIBILITIES & DUTIES:Answer all telephone enquiries and help the customer however necessary.\nAttend to all customer emails as well as any admin tasks they have been assigned by the authoritative.\nEnsuring that all customer correspondence mismanaged and addressed within 24 hours.\nReception work in the bakery school & checking attendance at all workshops.\nCommunicating all appropriate information regarding the workshop schedule and customer booking.\nSending out the brand customer correspondence – joining instructions, feedback forms etc.\nEnsuring that any scheduled changes are managed and the brand customers managed accordingly.\nDetailed diary management with a strong eye for details when checking bookings.\nGeneral admin duties; collating workshop/teacher feedback ad hoc and bespoke administration projects.\nCash handling and taking payment through various in person and online methods as well providing regular financial reports on such transactions.Skills",
    "Skills": [
        "QUALIFICATIONS & SKILLS:",
        "2-3 years experience in a customer service focused role.\nExcellent verbal and written communication skills.\nHighly computer literate.\nTime management skills and solid ability to prioritise workflow.\nAdept at problem solving with a solution oriented mindset.\nComfortable working independently, yet able to communicate effectively with a wider team.\nEnthusiastic and enjoys engaging with people."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}