{
    "Job ID": "4733982",
    "Description": "Raising funds from private equity deals or private equity funds.\nTarget clients include institutional investors, UHNWI, HNIs, family offices, or family funds.\nGood connections and networks with which he has raised money in the past and has good terms.Skills",
    "Skills": [
        "Someone who has worked in Dubai or KSA and has a ‘tried & tested’ client base. Past success is a prerequisite for this role.\nSomeone who has strong sales skills is outgoing, dynamic, and energetic. An individual with a pleasant personality who is looking for a challenge and is inclined to fast-paced growth in his career\nSomeone who has a track record in\nExperience in private banks wealth managers is preferred.\nMust have raised money for private equity deals or funds from institutional investors, corporate clients, HNI’s, UHNWI’s, family offices, etc.\nThe individual should have good connections and networks with which he has raised money in the past and has good terms.\nIdeally, someone who is 35 years old or younger however can be flexible for a very strong candidate.\nAny nationality with contacts in the UAE and/or KSA. (Saudi National Preferred) since predominately this role's core focus will be on KSA.\nThis role is an individual contributor role.\nThe role is to raise money for the company’s various funds situated in UAE and KSA\nTypically, the funds required to be raised are SAR 100 in the first 2 years.\nShould have qualified for Capital Market Exam 1 & 4 or CFA with CME 1 qualification.\nSomeone who has experience in buy-side and sell-side transactions and evaluations.\nSomeone who has strong technical skills, because when the transactions are done, he/she will be handling the post-management relationship.\nSomeone who has a strong Private Equity background only.\nlooking for candidates who have funding exposure in Entertainment, Food and beverage, Healthcare, Technology, Media, etc.\nIdeal candidates should not have more than 10% real estate funding exposure to a PE portfolio."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Banking; Investment, Securities & Funds",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}