{
    "Job ID": "4733656",
    "Description": "Position Title:            Production Manager – Fitout & Joinery DivisionEmployment Type:    Full TimeSalary:                               up to 8K AED depending on experience and qualifications plus company car, petrol, salik and parking allowancesJob Location:             Dubai, UAEAbout the Client:They stand out as one of the leading maintenance service providers in the region.Job Description:§ Supervise production processes and coordinate activities to meet deadlines and resource requirements.§ Allocate labor resources, monitor schedules, and adjust costs for efficient production operations.§ Ensure proper functionality of production equipment and manage a diverse team of carpenters and engineers.§ Lead interior/joinery projects from design order to completion, collaborating with customers and coordinating with various departments.Handle production planning, quality assurance, health & safety, and financial aspects of projects.Skills",
    "Skills": [
        "Qualifications:",
        "§ Open to Asian nationals",
        "§ Male, 40 years old and below",
        "§ At least 10 years of experience in similar experience in the Management of joinery / manufacturing industry specializing in Fit Out -Degree in Engineering or equivalent.",
        "§ managerial level within a corporate environment.",
        "§ Must possess broad knowledge of manufacturing and production processes and concepts.",
        "§ Must have strong communication and software skills.",
        "§ Great understanding of design drawings",
        "§ Hands on experience in financial management, budgeting & planning is a must.",
        "Must be able to cater the client’s requirements by providing a technical solution in the pre-sales process with the team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Gender": "Male",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Fit-Out & Joinery",
        "Company Type": "Recruitment Agency",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}