{
    "Job ID": "4733608",
    "Description": "We are seeking an HR & Admin Manager who will be responsible for the end-to-end HR Management, Administration, Coordination, design, and evaluation of HR & Admin functions.Responsibilities:Develop and oversee the recruitment process.\nReview job advertisements prior to posting, screen CVs, conduct telephone screenings, coordinate interview teams, participate in interviewing candidates\nOversee all staff engagement for the office and manage the new hire orientation and exit process.\nAnnually review the Personnel Handbook recommending amendments needed due to changes in local conditions or labor laws.\nMonitor compensation and ensure internal equity & compliance and benefits are met.\nFacilitate job analysis and update job descriptions.\nCoordinate with Finance Manager in the preparation of monthly Payroll.\nAdvise General Manager on appropriate staffing levels and assist in budget preparation.\nReview employee final payments for accuracy and compliance with labor laws.\nMonitor inventory of office supplies and the purchasing of new material with attention to budgetary constraints.\nEnsure smooth running of all administrative functions in the office.\nSupervise all travel and hotel arrangements for staff and visitors, including visas and work permits as applicable.\nUndertake employee training and development and make recommendations.\nOversee the coordination and implementation of annual performance reviews.\nCoach, counsel, and discipline employees.\nWork with senior management to resolve employee relations issues pragmatically.\nInvestigate employee relations issues and work to ensure human resources-related decisions are consistent and fair.\nInitiate, coordinate, and enforce systems, policies, and procedures.Skills",
    "Skills": [
        "Bachelor's degree in Business Administration/Public Administration major in HR Management.\nAt least 10 years of experience in the relevant field with minimum 5 years in the same senior managerial position in large corporate sector firm(s), preferably in Public Sector Company/Government Department.\nMaintain & update the job requirements and job description for all positions. The person will responsible for all HR & Admin functions including Recruitment & Selection, Induction & Orientation, Training & Development, and Compensation Management of the staff & must be computer literate with experience in MS Office and administrative matters.\nExcellent organizational skills; flexible and able to multi-task, with demonstrated resourcefulness in setting priorities.\nStrong verbal and written communication skills; ability to effectively present and execute innovative ideas. Ability to write reports and business correspondence. Outstanding grammar and proofreading skills.\n Strong sense of accountability, integrity, and ability to handle highly visible responsibilities.\nAbility to take initiative, act independently and direct one’s own work.\nGuided by exceptional common sense, maturity, discretion, and the ability to maintain confidentiality."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Interior design; Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}