{
    "Job ID": "4733043",
    "Description": " Support Service Office by managing schedules , arranging meetings, appointments, and travel arrangements. \nCoordinate and prepare materials for meetings, presentations, and conferences. \nAssist with the preparation of reports, correspondence, and other documents as required. \nHandle sensitive and confidential information with utmost discretion. \nAct as a liaison between senior executives and internal/external stakeholders, ensuring effective communication and timely responses. \nPrioritize and respond to incoming communications, including emails, phone calls, and other inquiries. \nProvide administrative support, including drafting and proofreading documents, maintaining filing systems, and handling expense reports. \nPrepare and distribute meeting agendas, minutes, and follow-up actions. \nAnticipate and address any issues or challenges that may arise. \nAssist with special projects and initiatives as assigned. Skills",
    "Skills": [
        "Knowledge ",
        "Excellent organization and time-management skills. \nExcellent communication skills. \nAbility to multitask & support the needs of multiple and diverse projects. \nAbility to work independently, as well as in a team environment. \nIntegrity and the ability to establish strong work relationships. \nGood analytical skills and cost consciousness. \nCompetent in problem solving, initiative and pro activeness. \nExcellent command of English spoken and written at business level. ",
        " ",
        "    Motivation ",
        "Strong identification with the IKEA culture and values  \nDrive to exceed results within a given framework ",
        " ",
        "   Capabilities ",
        "Attention to detail \nAbility to work with tight deadlines \nCreate Togetherness \nFind Better Ways "
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Gender": "Female",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 35"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}