{
    "Job ID": "4733487",
    "Description": "As a Coordinator / Document Controller is responsible for supporting our design team and ensuring seamless project coordination and document management. The position requires attention to detail, organizational skills, and ability to maintain accurate records .In this role the candidate will be reporting directly to the head of design Responsibilities:Document Management:Establish and maintain an efficient document control system for the firm.\nOrganize and manage project documents, including drawings, specifications, contracts, and correspondence.\nEnsure all project documentation is up-to-date, accurate, and accessible to relevant stakeholders.\nCoordinate with the design team and consultants to obtain and distribute updated documents promptly.Project Coordination:Collaborate with project managers and designers to schedule meetings, site visits, and design reviews.\n Assist in the preparation and distribution of project-related documentation to clients, contractors, and team members.\nMonitor project progress and deadlines, providing timely reminders and updates to the team.\nMinutes all the meetings and assist the head of design in managing / responding to all in coming enquirers and correspondences Quality Control:Review project documents for consistency, accuracy, and compliance with company standards.\nPerform regular audits of project files to ensure adherence to document control procedures.Communication:Facilitate effective communication among project team members to enhance collaboration and efficiency.\n Serve as a central point of contact for document-related inquiries, clarifications, and updates.Records Maintenance: Maintain a comprehensive record of all project-related communications, decisions, and approvals.\n Ensure proper archiving of project documents for future reference and compliance purposes.Software Proficiency:Utilize relevant document management software and other tools to streamline document control processes.\n Assist in the implementation and utilization of new software as required.Skills",
    "Skills": [
        "This position requires a highly motivated individual with excellent communication skills ",
        "Excellent command of Arabic\nOrganizational skills\nAttention to detail\nCommunication skills\nTechnical proficiency (document management software)\nData entry and typing skills\nInformation management\nVersion control\nTime management\nSecurity awareness\nProblem-solving ability\nAdaptability\nCompliance and regulations understanding\nTeam collaboration\nAnalytical skills\nDocumentation skills"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}