{
    "Job ID": "4733377",
    "Description": "As an Admin Assistant, you will be responsible for providing administrative support to our team and ensuring the smooth operation of our office. The ideal candidate will have excellent organizational and communication skills, attention to detail, and the ability to multitask in a fast-paced environment.Responsibilities:Manage office supplies and order new supplies as needed.\nCoordinate and schedule appointments and meetings.\nHandle incoming and outgoing mail and packages.\nAnswer and direct phone calls.\nPrepare and edit documents, reports, and presentations.\nAssist in the recruitment process by posting job ads, scheduling interviews, and conducting reference checks.\nMaintain and update employee records and databases.\nAssist with the onboarding process for new employees.\nAssist with travel arrangements and accommodations for staff.\nProvide general administrative support to the team.Skills",
    "Skills": [
        "Time management\nAttention to detail\nOrganization\nCommunication skills\nMicrosoft Office proficiency",
        "Preferred Candidate:",
        "Proficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\nExcellent verbal and written communication skills in English.\nStrong organizational and time management skills.\nAbility to prioritize tasks and meet deadlines.\nAttention to detail and accuracy.\nAbility to maintain confidentiality.\nAbility to work independently and as part of a team.\nFlexibility and adaptability to changing priorities.\nProfessional and friendly demeanor."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 3",
        "Residence Location": "Kuwait",
        "Nationality": "India",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}