{
    "Job ID": "4733446",
    "Description": "Forklift Operator (Saudi Nationals Only)The Operator is accountable for the safe and efﬁcient operation of the forklift and may also be required to perform stock-keeping duties.\nReceiving/Put-Away: Unload inbound shipments safely and move product to storage locations. Efﬁciently stack and store the material in the appropriate areas.\nQuality: Ensure inbound and outbound shipments are accurate and free of damage. Report quality variances.\nOrder Picking: Pull and prepare material for shipment, ensuring that the exact number and type of materials are loaded and shipped. Perform picking duties in an efﬁcient manner that meets service standards.\nLoading: Efﬁciently move product from staging and/or storage areas into trailers.\nEquipment: Load, unload, move, stack, and stage product and materials using a forklift, clamp truck, or other power equipment.\nMaintain the facility’s equipment and materials in a neat, clean, and orderly fashion.\nOn a daily basis, inspect and perform minor maintenance on the forklift or other equipment.\nOperate all equipment in a safe and efﬁcient manner following prescribed work methods.\nInventory:Keep appropriate records and reports to guarantee that tight inventory control and security are maintained.\nAssist in physical inventories.\nEnsure proper stock rotation.Safety, Sanitation, and Security: Maintain a clean, neat, and orderly work area. Assist in maintaining the security of the warehouse.\nMaintenance: Perform or assist in building, grounds, and equipment maintenance as required.Skills",
    "Skills": [
        "Experience operating a forklift",
        "Basic math/counting skills\nValid driver’s license\nAbility to lift 30-50 pounds\nExperience with multiple forklift types (sit-down, stand-up, cherry-picker, clamp and reach) preferred \nAbility to understand instructions in English would be an advantage. \nGood spatial awareness.\nAttention to detail.\nAbility to work well with others.\nAbility to operate and control equipment.\nUnderstanding of health and safety."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Dammam, Saudi Arabia ; Qatif, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}