{
    "Job ID": "4733687",
    "Description": "Technical Project Manager Graduate (Khebra Program - Emiratis ONLY)Advance the way you live and work at HPE.Who We Are:At HPE, our team members search beyond customers' needs today to accelerate what’s next and make a difference — for others, our company, and the planet. Our customers turn to us because we are positive, empathetic, and enterprising. We embrace opportunities to accelerate this transformation across data, connectivity, cloud, and security. And together we make what was once thought impossible, possible.That’s why we not only give you the space to grow into the professional you want to be, but we also embrace who you are and where you come from. We also value the flexibility and autonomy to balance work and personal needs in a way that works best for you.What you'll do:You will help develop schedules, critical deliverables, budget, resource allocation plans, and other support requirements for assigned program.\nYou will help coordinate activities of supporting project teams and internal and external development partners.\nYou will update schedule and resource allocation, tracking progress against established plan to meet project requirements and development schedule.\nYou will assist with materials preparation, testing samples arrangement and logistic support, to include but not limited to, researching information, analysis, compiling data for reports, coordinating work processes following work unit manager’s directions and other established administrative procedures.        Locations:Dubai, United Arab Emirates.Skills",
    "Skills": [
        "What you’ll need:",
        "Bachelor’s/Master’s degree with a focus in business management, engineering, computer science or related field prior to your start date.\nTechnical understanding and knowledge of the relevant industry.\nYou must have graduated within the last 24 months to be considered.\nOnly Emiratis are considered for this role.",
        "At HPE, we’re:",
        "Ranked 19th on Fortune’s 2022 list of 100 Best Companies to Work For\nRanked 7th on Newsweek’s list of America’s Most Responsible Companies 2022\nNamed a Best Place to Work for Disability Inclusion for the sixth year in row\nNamed one of the 100 Best Large Workplaces for Millennials in 2021\nRecognized as one of the Best Companies for Multicultural Women by Seramount",
        "Ready to take the next step? Open up opportunities with HPE.",
        "Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.",
        "HPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}