{
    "Job ID": "4733935",
    "Description": "Responsible for the full implementation and appropriate application of all documented Procedures and Instructions as documented in Company’s Business Management Systems (BMS) pertaining to his rig, especially for the full application of all communication, inspection, training and Emergency Drill requirements.\nDirects and supervises work of area personnel; determines work priorities and schedules work assignments; interviews and recommends candidates; evaluates, orients, counsels, and trains subordinate personnel and recommends associated personnel action.\nDefines projects objectives; develops operating plan; including manpower requirements, in compliance with senior management decisions. Develops programs to comply with organization requirements.\nAnalyzes and oversees drilling operations including safety and recommends changes in procedures to meet goals and objectives.\nIdentifies, develops, and recommends revision of standards, operating procedures, and new programs to improve efficiency; provides staff with clear and concise written and verbal guidelines.\nInvestigates accidents and injuries and submits reports.\nDirects workers to erect, dismantle, and move drilling rigs.\nPlans delivery of drilling tools, fuel, water, and other supplies for use at drill site.\nInspects rig and submits rig condition reports.\nMonitors the conditions of drilling rigs and equipment to ensure preventive maintenance procedures are followed.\nPrepares reports for managerial review concerning drilling progress, operational problems, and equipment requirements.\nInstructs the Night Pusher, Driller, Sr. Mechanic and Sr. Electrician in daily held Operations Meeting/ ensures that work to be carried are discussed during the pre-tour meeting with the incoming shift prior to start of work and during work.\nResponsible to ensure compliance and monitoring of all training requirements of rig based staff.\nResponsible for implementing training and instruction as assigned by management on his rig site.\nResponsible for the correct crew manning requirements on his site to ensure safe and continued operations.\nEnsures that all the documentations or records as required in the Company’s BMS is correct and checked/verified for work carried out on the site.\nShall ensure that service companies, third parties are in compliance with the Company’s and Client’s operations procedures and HSE standards to ensure efficient and safe operation at the site.Skills",
    "Skills": [
        "Shall have at least Ten (10) Years of Drilling Industry experience in Oil & Gas well drilling.\nShall have a minimum two (2) Year experience as a Rig Manager.\nShall hold a valid Well Control Training and Competency Certificate – Supervisory Level (from either IWCF or IADC WellCap)\nShall have a thorough theoretical and practical knowledge of Drilling Operations and all equipment used on the rigs. Where necessary his experience shall be supplemented to include the operation of pipe handling and drilling equipment.\nShall be able to communicate fluently in written and verbal English.\nShall have the ability to apply common sense to carry out detailed but uninvolved written or oral instructions and to deal with problems involving a few concrete variables in standardized situations.",
        "Shall have completed the required trainings as specified in Company BMS and Client contractual requirements."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Gender": "Male",
        "Age": "Max: 55"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}