{
    "Job ID": "4733609",
    "Description": "JOPI is looking for a talented Plant manager to join our business family in Jordan.You must have an extensive understanding of production procedures.We expect you to implement an innovative change in our current production process and make them more efficient.Job responsibilities:Provide top level of leadership for the firm and have overall responsibility and decision for strategy and future direction of the organization.\nFormulate, implement and manage strategies and policies to achieve strategic goals and meet risk objectives on daily basis.\nSet and direct strategies for current and future growth, with a focus on achieving strategic returns.\nContinue to drive the transformation of the organization to achieve its goals.\nManaging multicultural work environment.\nPlant Operations management.\nMarket, Machinery and Products knowledge.\nDevelop and implement process improvement to increase operational efficiency and productivity.\nMonitor production output, quality and compliance regularly.\nManage the preparation of production reports and records and control the production costs and implement cost- saving measures.\nCollaborate with human resources in recruitment, training and development of staff.Skills",
    "Skills": [
        "Received the needed training and qualification of Industrial Safety Regulations.\nMust be well aware of the industrial safety regulations.\nWell-motivated self-starter with proactive work ethics and commitment.\nBachelor’s degree in industrial engineering or any relevant field with 10 to20 years’ experience as a Senior Production Supervisor/Production Manager in Plastic Packaging Industry and knowledge of handling ERP based reporting.\nKnowledge of Plastic Blown Film and cutting machine operations, changeovers, and tools maintenance.\nKnowledge of Plastic Flexo printing machines.\nProblem solving and troubleshooting production related issues and root cause analysis."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10 Max: 20",
        "Gender": "Male",
        "Nationality": "Jordan; Syria",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Manufacturing; Consumer Packaged Goods Manufacture; FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}