{
    "Job ID": "4733412",
    "Description": "Our client is a deep tech company focused on bridging the gap between global AI technologies and the Arab-speaking world. they have developed the most accurate multi-dialect Arabic speech-to-text transcription engine, but they didn’t stop there!the client is currently building end-to-end speech intelligence solutions.About the RoleWe are looking for a self-motivated and results-driven Chief Commercial Officer to lead our new office and business opportunities in KSA by creating strategies and metrics to ensure the business stays on track with its objectives and exceeds targets.This role is a mission-critical and strategic role and will be expected to contribute substantially to the strategic direction, growth, and sustained high performance as a successful leader and key part of the Leadership Team.Responsibilities• Create and execute commercial strategies aimed at accelerating growth• Study industry trends and create an effective business plan based on commercial opportunities.• Follow up on daily sales achievements and provide frequent updates to the CEO• Manage the commercial and sales teams with the goal of improving key metrics.• Heavily involved in the motivation, drive, and development of new talent within the organization.• Develop an understanding of customers’ needs and make sure they are met.• Responsible for the approval of the company's product pricing and positioningSkills",
    "Skills": [
        "Job Requirements",
        "• +10 years of work experience in management, sales, or commercial roles.",
        "• Bachelor or Master’s degree in finance, business administration, or related field",
        "• Past experience as a CCO or Commercial Director",
        "• Proven experience in sales and client relationship management",
        "• Outstanding communication, interpersonal, and leadership skills",
        "• A proven track record of successfully leading and motivating diverse teams.",
        "• Strong work ethic",
        "• Experience in handling governmental affairs and structuring large-scale partnerships",
        "• Experience in SaaS sales such as cloud sales, chat bots, voice bots, AI ...etc."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Software Development",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}