{
    "Job ID": "4733445",
    "Description": "Department: Information TechnologyReports To: Chief Executive Officer (CEO)Company Overview:Baida Pack, located in the vibrant city of Amman, Jordan, is a distinguished leader in providing primary and secondary packaging solutions exclusively for the pharmaceutical industry. Our unwavering dedication to delivering impeccable packaging materials and pioneering solutions has solidified our standing in the sector. As we continue to expand, we are seeking an experienced IT Manager in ERP Systems to lead our innovative Information Technology department.Job Summary:The IT Manager - ERP Systems will be a pivotal role responsible for overseeing the seamless implementation, maintenance, and optimization of our Enterprise Resource Planning (ERP) systems. This position requires strong leadership, technical expertise, and the ability to collaborate closely with cross-functional teams to enhance business processes, improve system functionality, and contribute significantly to the organization's overall success.Responsibilities:Lead the complete lifecycle of our ERP systems, covering implementation, configuration, customization, testing, deployment, and ongoing maintenance.\nCollaborate closely with various functional teams to grasp business processes, identify system requirements, and translate them into detailed technical specifications.\nConfigure and manage ERP modules, including finance, supply chain, manufacturing, inventory management, and sales.\nConduct regular system updates, patches, and upgrades to ensure consistent system stability and security.\nAddress and resolve ERP-related challenges, working closely with end-users to provide effective technical support and training.\nDevelop and maintain comprehensive system documentation, encompassing process flows, user manuals, and technical reference materials.\nCollaborate with external consultants and vendors to optimize ERP system functionality and implement industry best practices.\nMonitor system performance, identify opportunities for optimization, and implement effective solutions to enhance overall efficiency.\nLead cross-functional projects focused on process improvement, system integration, and data analysis.\nStay up-to-date with industry trends, best practices, and emerging technologies to drive continuous enhancement within the ERP landscape.\nAssist in data migration and data integrity efforts during system upgrades and migrations.\nConduct routine checks and assessments of the in-house IT systems to ensure seamless productivity.\nAlign new Information Technology systems with the practical requirements of the organization's policies and standards.\nDesign, develop, implement and coordinate systems, policies and procedures.\nProtect and backup vital information of the company using digital management tools and servers.\nPerform the role of problem-solver and attend to practical doubts and challenges of senior management.Benefits:Opportunity to lead and mentor a dynamic and forward-thinking IT Department. \nProfessional growth and development opportunities.\nEngagement with cutting-edge technologies and transformative projects.\nComprehensive health benefits with a high salary.Skills",
    "Skills": [
        "Bachelor's degree in Information Technology, Computer Science, or a related field. Master's degree is a plus.\n5+ years of proven experience in IT management, including ERP systems implementation, preferably within the pharmaceutical or manufacturing sector.\nProficiency in ERP systems, with a strong understanding of module interdependencies.\nHands-on experience in system integration, data migration, and software customization.\nStrong problem-solving skills with the ability to analyze complex business processes.\nExcellent leadership and communication skills, collaborating effectively with cross-functional teams and presenting technical concepts to non-technical stakeholders.\nDetail-oriented mindset with a commitment to maintaining accurate system documentation.\nFamiliarity with SQL, scripting languages, and database management is advantageous.\nRelevant certifications in ERP systems or related technologies are a plus.\nFluency in both English and Arabic is essential for effective communication.\nIn-depth knowledge of cybersecurity best practices and a solid understanding of data protection measures.\nExperience in handling company servers, cloud services, database management, disaster recovery planning, and data backup log management is crucial.\nA skilled IT professional with decent exposure in handling and maintaining computing hardware and systems.\nExcellent knowledge of technical management, information analysis and of computer hardware/software systems.\nHands-on experience with computer networks, network administration and network installation.",
        "If you are an experienced IT professional with a background in ERP systems, a proven track record in IT management, and expertise in handling servers, cloud services, databases, disaster recovery planning, and data backup log management, we encourage you to take advantage of this opportunity. Lead us to contribute to Baida Pack's success as a pivotal member of our IT leadership team. ",
        "Baida Pack is committed to equal opportunity and diversity. We strive to create an inclusive workspace that fosters the growth and success of all team members."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Printing; Pharmaceutical Manufacturing; Consumer Packaged Goods Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}