{
    "Job ID": "4733689",
    "Description": "Who We Are:Hewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Advance the way you live and work at HPE.Who We Are:At HPE, our team members search beyond customers' needs today to accelerate what’s next and make a difference — for others, our company, and the planet. Our customers turn to us because we are positive, empathetic, and enterprising. We embrace opportunities to accelerate this transformation across data, connectivity, cloud, and security. And together we make what was once thought impossible, possible.That’s why we not only give you the space to grow into the professional you want to be, but we also embrace who you are and where you come from. We also value the flexibility and autonomy to balance work and personal needs in a way that works best for you.What you'll do:You will manage central reporting and forecasting and support ad-hoc tasks upon request.\nYou will support the team with key presentation material and reports for business reviews and planning.\nYou will assist in organizing and representing HPE at focused Customer and Partner events.\nYou will support sales initiatives and the driving of new business opportunities.\nYou will work closely with members of the HPE Management Team and associated departments (e.g. Marketing, Finance, SSP).Locations:Dubai, United Arab Emirates.Skills",
    "Skills": [
        "What you’ll need:",
        "Position requires a Bachelor’s/Master’s degree prior to your start date. We encourage any field of study to apply!\nExperience or a proven interest in sales and a passion for technology.\nExcellent at building relationships at all levels and having solution focused discussions.",
        "What we’d prefer you bring:",
        "The drive to seek out what’s next and to deliver exceptional results\nA collaborative, solution focused spirit and overall sense of urgency\nThe desire to embrace new ideas and fresh thinking and seek out ideas different than your own\nExperience as an active leader on campus who strives to make a positive impact on the world\nComfort with working in a hybrid (virtual and face-to-face) environment\nExceptional communication and presentation skills and the ability to ask smart questions",
        "At HPE, we’re:",
        "Ranked 19th on Fortune’s 2022 list of 100 Best Companies to Work For\nRanked 7th on Newsweek’s list of America’s Most Responsible Companies 2022\nNamed a Best Place to Work for Disability Inclusion for the sixth year in row\nNamed one of the 100 Best Large Workplaces for Millennials in 2021\nRecognized as one of the Best Companies for Multicultural Women by Seramount",
        "Ready to take the next step? Open up opportunities with HPE.",
        "HPE is an equal opportunity employer/Female/Minority/Individual with Disabilities/Protected Veteran Status",
        "What We Can Offer You:",
        "Health & Wellbeing",
        "We strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.",
        "Personal & Professional Development",
        "We also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have — whether you want to become a knowledge expert in your field or apply your skills to another division.",
        "Diversity, Inclusion & Belonging",
        "We are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good.",
        "HPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together. Please click here: Equal Employment Opportunity.",
        "Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}