{
    "Job ID": "4733011",
    "Description": "تحقيق أهداف المبيعات: تحمل المسؤولية عن تحقيق أهداف المبيعات المحددة من خلال تسويق وبيع مجموعة متنوعة من الأثاث المكتبي للعملاء المحتملين.\nاستشارة العملاء: فهم احتياجات ومتطلبات العملاء وتقديم استشارات مهنية حول القطع المناسبة لتلبية احتياجاتهم.\nتطوير قاعدة بيانات العملاء: بناء قاعدة بيانات قوية للعملاء المحتملين والحاليين، وتحديثها بانتظام مع المعلومات المفيدة.\nتقديم عروض: إعداد وتقديم عروض مبيعات شاملة وجذابة للعملاء تضمن التعريف بميزات وفوائد الأثاث المكتبي المقدم.\nمتابعة المبيعات: تتبع ومتابعة مراحل عملية البيع من الاستفسار الأولي إلى إتمام الصفقة وتوصيل الأثاث.\nالتفاوض: التفاوض بشأن الأسعار والشروط مع العملاء لضمان تحقيق أفضل صفقات للجانبين.\nتحقيق الرضا العملاء: ضمان رضا العملاء من خلال تقديم خدمة ممتازة، وحل مشكلات العملاء بفعالية، وتجاوز توقعاتهم.\nالتواصل الفعّال: التواصل بشكل فعّال مع أعضاء الفريق الداخليين لتبادل المعلومات المهمة حول المبيعات والمخزون.\nمتابعة اتجاهات السوق: مراقبة وتحليل اتجاهات السوق والمنافسة وتقديم تقارير حولها.\nتقديم ملاحظات: تزويد الإدارة بتقارير دورية حول أداء المبيعات والتحديات المتعلقة بالسوق والعملاء.Skills",
    "Skills": [
        "المهارات المطلوبة:\nمهارات التواصل: القدرة على التواصل بشكل فعّال وبثقة مع العملاء والزملاء.\nمهارات التفاوض: القدرة على التفاوض بشكل مهني والتوصل إلى اتفاقات مرضية للجميع.\nمعرفة بالمنتجات: معرفة عميقة بأنواع الأثاث المكتبي وخصائصها واستخداماتها المختلفة.\nمهارات تحليلية: القدرة على تحليل احتياجات العملاء وتقديم الحلول المناسبة.\nإدارة الوقت: القدرة على التنظيم وإدارة الوقت لتحقيق أهداف المبيعات.\nمرونة: القدرة على التكيف مع التغييرات في السوق وتلبية متطلبات العملاء المتغيرة.\nعلاقات بين الشخصية والقوية: القدرة على بناء علاقات طويلة الأمد مع العملاء وكسب ثقتهم.\nمهارات الحاسوب: القدرة على استخدام الأدوات والبرمجيات المكتبية والمعرفة الأساسية بأنظمة إدارة العلاقات مع العملاء (CRM).\nقيادة الذات: القدرة على العمل بشكل مستقل واتخاذ قرارات مناسبة.\nالالتزام بالجودة: التفاني في تقديم منتجات عالية الجودة وخدمة متميزة للعملاء."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Home & Office Furniture",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}