{
    "Job ID": "4733551",
    "Description": "Roles & ResponsiblilitiesTo design &amp; cost Communication System, in accordance with relevant project specifications, statutes and codes and to do so in accordance with industry best practice and the Group Quality Assurance Systems.\nTo be responsible and accountable for the proposed integrated technical solutions design across various subsystem solutions.\nSupport the Design Team Lead in understanding the technical risks, dependencies and issues that exist and be able to quantify these and the impact that they may have on the project in a concise legible reporting format.\nEnsure that all project specifications are implemented in the technical solution and are compatible with the project's overall architecture including structured cabling and OSP. Identify any and all compliance issues with recommended resolution options.\nMeet and discuss with client, end users and other stakeholders, on the Communication System and associated networking infrastructure for the project design.\nDevelop professional relationships with the client by demonstrating an understanding of their business and their technology requirements and achieving reliable, timely and high-quality delivery.\nProduction of Construction and O&amp;M documentation.\nCarry out any reasonable request relating to job scope.\nAct as the specialist Communication system technical liaison with the implementation team, this position is based at the head office offices with visits to the job site location to support the role and tasks. Also support other disciplines of the project in various project office locations.\nProduce high level and detailed design technical documentation, including CAD drawing review and development, including construction documentation.Skills",
    "Skills": [
        "Qualification & Experience",
        "Bachelor of Engineering Degree with minimum 6 years of experience ith minimum 6 years of experience",
        "Knowledge, Capabilities & Skills",
        "Hands on experience &amp; good knowledge of all the following systems &amp; technologies: Audio Visual &amp; Public Address Systems Including Auditorium / classrooms/meeting rooms/studios equipment, Video wall &amp; digital signage solutions, interpretation systems, live streaming solutions, BGM, public address system, evacuation systems, PAVA systems, in addition to centralized clock systems, Video conference solutions.(Mandatory Requirement)\nBachelor of Engineering Degree with minimum 6 years of experience strictly as stipulated below;\nMust have worked for a reputed system integrator as a Site &amp; Commissioning Engineer for at least 3 years on medium to large projects involving all the above mentioned systems &amp; technologies. (Mandatory Requirement)\nMust have worked for a reputed system integrator as a Pre-Sales Engineer for at least 3 years on medium to large projects involving all the above mentioned systems &amp; technologies. (Mandatory Requirement)\nMust have worked on major American and European brands involving all the above mentioned systems &amp; technologies. (Mandatory Requirement)\nGood working knowledge of and interest in all areas of Communication System Design and Requirements.\nGood knowledge of technical infrastructure and integration technologies to include power, UPS, networking, communications.\nNetwork experience to include WAN, LAN, firewall, network switch technologies and video transmission on IP networks.\nExperience of design and implementation of large scale Communication systems and complex projects.\nAbility to quickly develop professional and trusted relationships with a variety of cultures and clients.\nHigh level of self-motivation and an ability to work with a high level of initiative and limited supervision, in high pressure situations.\nStrong team player who can communicate, motivate and interact effectively with technical, commercial and clerical team-members.\nProficient in MS Word, Excel, PowerPoint MS Project.\nPreferred Capabilities:\nCandidates with Communication Systems Project experience in Industrial Sector will be preferred."
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}