{
    "Job ID": "4733602",
    "Description": "Roles & ResponsiblilitiesResponsible for day-to-day work on-site according to the scheduled plan.\nCapable of effectively analyzing from a system viewpoint, system problems and making recommendations to superiors to solve the issue.\nSubmit requests and follow up delivery of all required equipment, tools, and materials.\nCooperate, coordinate and exchange data, information pertaining to technical issues in audio and broadcasting systems with staff and keep well informed of such issues in order to cover the gap in case of emergencies.\nDo all BMS design &amp; submittals in addition to BMS installation and configurations\nUsing software to design digital versions of building management systems based on project documentation\nAssisting with the graphic design of BMS software\nProducing documentation to instruct other engineers or users on how to interact with the BMS\nEnsuring that any BMS software or equipment aligns with relevant safety and quality standards\nConducting site surveys before installation of BMS takes place, or after a system has been installed to check that it is functioning properly\nCommissioning new BMS software to ensure that it works properly\nMaintaining existing building management systems by fixing errors, running tests and updating softwareSkills",
    "Skills": [
        "Qualification & Experience",
        "University degree in Electronic/Telecommunication Engineering.\nMinimum 6-8 years in the field.\nField of experience (BMS- Building Management System Presales and project installation)\nKnowledge, Capabilities & Skills\nEnglish &amp; Arabic Language.\nComputer and software applications related to the field.\nAbility to make judgments and take decisions.\nGood analytical, interpersonal, and effective communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 6 Max: 8",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}