{
    "Job ID": "4733516",
    "Description": "Business Support Officer/AbraCadabra BrandWe are looking for an organized self-starter to be our new Business Support / Assistant. Your responsibilitiesinclude handling data processing procedures, writing business transaction reports, and coordinating withdifferent team members the ongoing production/sales requests. You will be expected to follow up onproduction and sales activities on and off/ site, provide customer support, proofread documents, developand complete data sheets.Our ideal Business Support officer candidate will need to: Creating spreadsheets with large numbers of figures without mistakes. Verifying the data by comparing it with original source of information (sales order, email,catalog...etc) to maintain accuracy at all times. Processing invoices and accounts payable, including follow-up with vendors regarding late paymentsor discrepancies in the billings. Receiving and processing incoming mail, distributing mail to staff members, and handling outgoingmail and packages. Following up on sales orders/production processes with concerned departments. Providing support to managers by performing administrative tasks such as scheduling meetings,maintaining calendars, and managing contact lists. Providing clerical support, such as filing documents and maintaining records in an organizedmanner.Skills",
    "Skills": [
        " Bachelor’s degree in Business Management, Accounting or related degree, or equivalent professional",
        "experience",
        " Post requires exchange of information / persuading/negotiating on a daily basis across various",
        "communication methods.",
        " Proficient in Microsoft Word, Excel, and PowerPoint.",
        "Sound knowledge of office practice and administrative procedures.",
        " Knowledge and experience of working with computer software.",
        " The passion and strive to make the day to day operation as efficient and effective as possible.",
        " Basic understanding of databases",
        " Good command of English both oral and written and customer service skills",
        " Great attention to detail"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Trading & Commodity Trading; Administration Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}