{
    "Job ID": "4733073",
    "Description": "FX Sales Manager - Africa RegionSales Manager AfricanOur client is a 20-year-leading multinational Forex Trading Company headquartered in the UAE. They are looking for experienced Forex Sales Managers with a background in banking, or Forex within the fintech industry who will manage the African market.Oversee a group of Client Relations Managers who provide support to the African region.\nMake sure the achievement of all team Key Performance Indicators (KPIs) and targets, including metrics like chat/call/email volume, net deposits, activations, and CSAT scores, are met.\nManage, support, and report on daily team metrics in a daily, weekly, and monthly manner.\nEnhance the quality of customer service, increase productivity, and drive profitability.\nPossess comprehensive knowledge of the company's offerings.\nFunction as a point of escalation for complex customer issues and complaints, escalating to other teams when necessary, and implementing resolutions.\nConduct team training, identify skill gaps, and foster skill development.\nEnsure the team has access to the necessary resources and tools to effectively fulfill its responsibilities and serve customers.\nUpdate internal systems with relevant information.\nProviding feedback to relevant departments regarding customer needsSkills",
    "Skills": [
        "Proficient in English; additional languages are a plus.\nHolds a Bachelor’s degree or equivalent in fields like Business, Finance, Economics, or related disciplines.\nPossesses exceptional written and oral communication abilities and is confident in delivering presentations at the executive level.\nBrings 3-5 years of experience in sales and/or customer service management within the Forex Industry, including expertise in technical and fundamental analysis.\nDemonstrated prior involvement with CRM systems, including designing efficient workflows and overseeing integrations.\nCapable of skillful stakeholder networking, managing multiple tasks, and monitoring and reporting progress.\nExhibits critical thinking, adept problem-solving, effective decision-making, keen attention to detail, and analytical reasoning prowess.\nHas experience in leading and supervising both direct and indirect reports, with a track record of coaching, driving outcomes, providing performance feedback, and motivating teams through collaborative efforts.\nAble to establish excellent rapport across diverse customer profiles and various levels of customer contact."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "Kenya; Morocco; South Africa"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Banking; Financial Services; Investment, Securities & Funds",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}