{
    "Job ID": "4733607",
    "Description": "Roles & ResponsiblilitiesSupervise & manage the project workforce/teamwork towards achieving the project's objectives.\nPerform duties of superiors on all assigned jobs, pertaining to commissioning, installation and/or repair of equipment.\nHandle product complaints and make recommendations to superiors regarding goodwill replacement of products, suggesting methods of quality control\nand checking to determine that equipment and systems are functioning properly.\nPlan site activities in a proper and professional manner.\nSubmit reports on regular basis to superiors on activities status and to follow instructions given by superiors.\nEnsure that daily work activities on assigned project are going successfully and client or their representative(s) are confirming work results.\nCheck, verify and approve timesheets for subordinates and allocate relative expenses as per project cost wise.\nInform PM/PMOM in writing of all violations committed by subordinates to take the proper actions required according to JJE policies.\nUtilize to the maximum limit all assigned manpower resources to achieve project schedule plan.\nReview and understand departmental and overall JJE policies and procedures and ensure full abidance and compliance.Skills",
    "Skills": [
        "Qualification & Experience",
        "Minimum of associate's Diploma in a related technical discipline (Electronics / Telecommunication).\nMinimum 3 to 5 years' Experience in the field.\nKnowledge, Capabilities & Skills\nGood communication skills.\nEnergetic and team player. Must have good knowledge of safety codes and regulations"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}