{
    "Job ID": "4733897",
    "Description": "Responsibilities:Project Management:Working closely with clients, project team, and various stakeholders to ensure successful project delivery.\nTaking ownership of project’s execution from initiation to completion and ensuring adherence to project scope, timeline, and budget.\nDeveloping and maintaining project plans, schedules, and budgets.\nMonitoring progress, identifying potential risks, and implementing appropriate mitigation strategies.\nCoordinating with cross-functional teams, including architects, engineers, contractors, and vendors, to ensure seamless project execution.Client Collaboration:Engaging with clients to understand their project requirements, objectives, and design preferences.\nProviding expert advice and guidance to clients throughout the project life cycle.\nFostering strong client relationships and managing stakeholders’ expectations effectively.\nPresenting design concepts and proposals to clients and obtaining necessary approvals.Design Coordination:Monitoring the project team to ensure delivering the design as per the project’s contractual, stakeholders, relevant authorities and ALSUWEIDI requirements, codes and standards., avoiding abortive works and reducing variations required as per client/stake holders’ decisions.\nCommunicating to the project team and management the project’s objectives and goals and securing its delivery via the project execution strategies.\nCoordinating and chairing -as required- project coordination meetings, presentations, and workshops, between the project team, client, authorities, management and any relevant stakeholders.\nFacilitating effective communication and collaboration among project team, client authorities, management and any relevant stakeholders.\nSupporting project team engagement and aligned coordinated processing of project activities.Quality Control:Ensuring the quality and completeness of the project’s deliverables, procedures.\nImplementing quality control procedures to maintain high standards throughout the project lifecycle, as per the client -if requested- and ALSUWEIDI policies and procedures.\nSecuring the quality control tools and techniques for the project team as per ALSUWEIDI policies and procedure and complying with client’s guidelines as required.\nReviewing project quality audits and review reports and impact of team performance, to reporting corrective and preventive actions and recording them as applicable in the lessons learned and risk registers.Budget and Cost Management:Monitoring project budgets and expenditures.\nTracking costs related to project activities, resources, required tools and techniques.\nIdentifying cost-saving opportunities and propose them without compromising project quality.\nPreparing and reviewing project financial reports, forecasts, change orders and cost impact of team performanceContract Management:Reviewing and negotiating agreements with subconsultants, experts, freelancers, or any other supporting external party.\nEnsuring contractual obligations are fulfilled and managing any contract variations or disputes.Documentation and Reporting:Reporting as per the ALSUWEIDI and contractual requirement\nManaging project documentation, including design drawings and documents, time schedule, contracts, invoices and correspondence.\nPreparing team, scope, cost and time management and progress reports, schedules and records at ALSUWEIDI portal and any other requested formats, such as but not limited to project briefs, scope outlines, responsibility matrix, resources allocation and time schedules, reference and guideline documents, risk registers, lessons learned records and presentations for internal and external stakeholders, as per ALSUWEIDI and client procedures.\nCompiling project documentation for handover and record-keeping purposes, during or after project completionSkills",
    "Skills": [
        "A bachelor's degree in Architectural design.\nProfessional project management certifications or affiliations with international project management organizations, such as Project Management Professional (PMP) or Certified Associate in Project Management (CAPM) from the Project Management Institute (PMI) or MBA.\nMinimum 10 years of experience as a design project management, including 2 years in UAE, preferably in Abu Dhabi.\nCommunication skills: Excellent written and spoken communication skills in English and preferably Arabic.\nLeadership skills: Strong leadership skills to motivate and guide the project team towards achieving project goals.\nTime management skills: Proven effective time management and tasks prioritization, and awareness of time scheduling, monitoring and controlling tools and techniques\nRisk management skills: Excellent ability to identify and mitigate potential risks that can negatively impact the project's success.\nTechnical skills: Very good awareness of the design projects process, success factors and required resources.\nBudget management skills: Very good ability to manage the project budget and ensure that the project is completed within the allocated budget.\nProblem-solving skills: Very good critical thinking and problems solving capabilities.\nExcellent proficiency in Microsoft office programs\nVery good proficiency in projects time scheduling and monitoring programs\nKnowledge in computer aided drafting and modelling software, such as Auto. CAD and REVIT."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}