{
    "Job ID": "4733917",
    "Description": "Parisima Talent is hiring with one of our clients in hospitality, high-end steakhouse restaurants in Turkey, Dubai, and other countries around the world. Position: Griller / Grill CommisJob Location: Abu Dhabi Job responsibilities:Grill Operation: Operate and maintain grilling equipment efficiently, ensuring that all steaks and grilled items are cooked to perfection while adhering to established recipes and standards.\nFood Preparation: Handle food preparation tasks, including portioning, seasoning, and marinating steaks to ensure consistent taste and presentation.\nTemperature Control: Monitor and maintain proper cooking temperatures to ensure food safety and compliance with health and safety regulations.\nQuality Assurance: Conduct regular checks on the quality of food items, ensuring that they meet the restaurant's standards before serving to guests.\nOrder Management: Coordinate with the kitchen team to ensure timely preparation of grill orders and maintain a smooth flow of food service during busy periods.\nSanitation: Adhere to all sanitation and hygiene guidelines to maintain a clean and safe cooking environment. Properly clean and sanitize grilling equipment after each use.\nInventory Management: Assist in monitoring and managing inventory related to grilling supplies, ensuring that necessary items are available for smooth operations.\nMenu Suggestions: Collaborate with the chef and kitchen team to develop new grilling recipes and menu suggestions to keep the offerings fresh and exciting for our guests.\nTeamwork: Work cooperatively with other kitchen staff members, assisting them as needed to ensure efficient kitchen operations. Skills",
    "Skills": [
        "Job specifications:",
        "2+ years experience as Griller / Commis in Kitchen section is must."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}