{
    "Job ID": "4733895",
    "Description": "Job Title                   : Social Media Specialist.Job Role                  : Implement Social Media Strategy. Location                   : Kuwait      Career level             : Mid-Career/Professional   Position Type           : Full-timeJob Summary :Social Media Marketing: Proficiency in creating, implementing, and managing social media marketing strategies across various platforms.\nContent Creation: Ability to develop engaging and relevant content, including graphics, videos, and written posts, tailored to the target audience, working with various creative agencies for building monthly content\nAnalytics and Metrics: Skill in analyzing social media data and using insights to optimize performance and make data-driven decisions.\nCommunity Management: Managing and engaging with followers, responding to comments and messages, and fostering a positive online community, reporting any unusual sentiment captured on the platforms\nPlatform Knowledge: Familiarity with different social media platforms and their unique features to maximize reach and impact.\nTrend Awareness: Staying up to date with the latest social media trends, algorithms, and best practices.\nCommunication Skills: Excellent written and verbal communication skills to effectively convey messages and maintain a brand's voice.\nCustomer Service: Addressing customer inquiries and concerns promptly and professionally.\nBrand Management: Ensuring social media content aligns with the brand's image and values.\nCollaboration: Ability to work with cross-functional teams, such as marketing, design, and customer support, to achieve common goals.Skills",
    "Skills": [
        "Required Skills :",
        "Creative marketing skills & ability to think out of the box. \nIn-depth knowledge & understanding with different social media platforms. \nAbility to effectively communicate, information in Arabic & English.\nTeam player with the confidence to take the lead & guide department when necessary.\nShould have a good technical understanding & ability to pick up new tools quickly.\nHave good knowledge of principles of SEO & CMS (Search engine optimization - Content management system).\nPublic relations, Marketing, Customer service experience would be a plus. ",
        "Required Qualification:",
        "Relevant Experience (in years)  : 3-4 years\nEducation: bachelor’s degree - Marketing/master’s degree preferred.\nSpecialized Experience:  social media/blogging in FMCG/commercial/Retail environment.\nIT: Social media certifications/Content Management\nPreferred Language : Arabic & English  "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 4",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}