{
    "Job ID": "4733925",
    "Description": "Conducts all rig operations in accordance with Company’s Procedures and Standards defined in BMS, HSE Standards and Standard Operating Procedure (SOP) Manual and good drilling practice requirements as contained in IADC and Client Drilling Manuals.\nInitiates and controls the execution of all daily inspections, maintenance routines and repairs of rig machinery as dedicated to him.\nAttends to all administrative duties as specified for him in Company’s Business Management System.\nEnsures that good housekeeping practice is established and maintained on and around the rig.\nPrepares and submits written drilling operations reports.\nMonitors and records parameters and required data in the Drillers Shift Log, BHA Worksheet, DP Tally Sheet, Trip Sheet, Kill Sheet, IADC Tour Sheet, and Driller’s Shift Handover Report.\nEnsures that the Daily Rig Floor inspections are done in his shift.\nProvides guidance and training for work crew personnel regarding rigging up or rigging down, day to day operations, and company policies and procedures.\nOversees operations to ensure compliance with safety guidelines and established procedures by his assigned rig crew.\nMaintains safety equipment in proper working order and in the appropriate locations.\nOperates rig hoisting system from control panel; raises and lowers drilling tubulars using hoisting system.\nKeeps himself informed of all BMS procedures and HSE standards, and other Requirements.\nEnsures that all company disseminated information applicable to his staff is communicated to them in TBT’s, Safety Meetings or by means of Procedure/Instruction training and that execution of such communication/training is appropriately recorded as defined in respective Procedures.\nCarries out TBT’s (Pre-job Safety Meeting) at the beginning of each shift and on change of operation/task and supervises all work under his control to an extend as is necessary to ensure the safety and integrity of staff and plant at all times.Skills",
    "Skills": [
        "Shall have at least seven (7) Years of Drilling Industry experience in Oil & Gas well drilling.\nShall have a minimum two (2) Year experience as a Driller.\nShall hold a valid Well Control Training and Competency Certificate – Supervisory Level (from either IWCF or IADC WellCap)\nShall have a thorough theoretical and practical knowledge of Drilling Operations and all equipment used on the rigs. Where necessary his experience shall be supplemented to include the operation of pipe handling and drilling equipment.\nShall be able to communicate fluently in written and verbal English.\nShall have the ability to apply common sense to carry out detailed but uninvolved written or oral instructions and to deal with problems involving a few concrete variables in standardized situations.",
        "Shall have completed the required trainings as specified in Company BMS and Client contractual requirements."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7",
        "Age": "Max: 55"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}