{
    "Job ID": "4733639",
    "Description": "Administer purchase contracts in areas pertaining to delivery, receipts, warranties, damages and insurance.\nProcess and analyze all requisitions of material & supplies in order to determine the appropriate method of procurement in line with Company's Purchasing Procedures.\nPrepare requests for quotations (RFQ) or (RFP), obtain quotations from suppliers, prepare quotation's evaluations & comparison sheet and forward it to the direct manager.\nPrepare technical specifications for request for proposals, including terms and conditions and evaluation criteria.\nPrepare and develop bid documents and supplier bid lists to obtain competitive quotations on commodities and services.\nLiaise with warehouse and stores staff pertaining to all required materials to avoid potential shortages.\nPrepare and issue purchase orders and record all purchasing documentation and price lists properly in their designated files.\nReport any significant supply problems to the direct manager.\nCoordinate with the suppliers regarding delivery, quality, etc. to ensure that all required materials, supplies and equipment's are provided and delivered on-time and ensure dealing with the approved suppliers and maintain a strong supplier relationship.\nAssist with performance monitoring & evaluation of Company's suppliers, using metrics such as lead time, accuracy of delivery quantities, quality, and delivery time.\nSubmit shipping documents and follow-up for any import items under customs clearance, and ensure imported materials are authorized by regulatory bodies.\nPerform any other duties related to the job as assigned by the Direct Manager.Skills",
    "Skills": [
        " ",
        "Analytical and statistical capabilities.\nSolid Experience in data tracking system for orders and shipments.\nExperience in technology and software systems to enhance processes improvement.\nProficient in English and Arabic would be an advantage."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4 Max: 0",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Medical Hospital",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}