{
    "Job ID": "4733165",
    "Description": "Employment Type:     Full TimeSalary:                up to 5K AED depending on experience and qualifications plus shared company accommodation, transportation, and duty mealJob Location:            Abu Dhabi, UAE About the Client:A well-known restaurant group in Dubai. Job Description:  Assist in the execution of marketing campaigns, promotions, and events to enhance the restaurant group's brand presence and customer engagement.\nCreate compelling and visually appealing content for social media platforms, newsletters, and the website, showcasing the unique offerings and exquisite dining experience of the fine dining restaurants.\nEngage with online audiences by responding to comments, messages, and reviews, maintaining a positive and professional online reputation for the restaurant group.\nHelp gather and analyze marketing performance data, providing insights to refine strategies, identify trends, and make data-driven recommendations for continuous improvement.\nProvide administrative assistance by coordinating marketing materials, maintaining databases, and ensuring smooth communication between the marketing team, restaurant staff, and external partners. Skills",
    "Skills": [
        "Qualifications:",
        "35 years old and below\nAt least 3 years of UAE experience in similar role in the UAE and with background in hospitality or restaurant\nPossesses a basic knowledge of Marketing Concepts and Tools\nFamiliarity with Social Media Platforms, including Facebook, Instagram, Twitter, LinkedIn, etc., demonstrating a comprehensive understanding of the digital marketing landscape\nExceptional communication skills, both verbal and written, with fluency in English\nImmediate joiners are preferrable"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}