{
    "Job ID": "4733568",
    "Description": "Roles & ResponsiblilitiesResponsible for day-to-day work on site according to scheduled plan.\nResponsible for quality control of materials and installation procedures.\nCapable of effectively analyzing from system view point, system problems and make recommendations to superiors to solve the issue.\nOversee projects team achieving their assigned tasks on time.\nReport to PM, and update him if any changes required in project's scope, following the change management procedures to get approval for these changes.\nSubmit requests and follow up delivery of all required equipment, tools, materials with PM and Site Store Keeper.\nCooperate, coordinate and exchange data, information pertaining to systems &amp;amp; projects with staff in other divisions and keep well informed of such issues in order to cover the gap in case of emergencies.Perform Professional appearance and function the maximum effective communication skills when dealing with customers to gain their satisfaction and to maintain JJE image.Skills",
    "Skills": [
        "Qualification & Experience",
        "University degree in Electronic/Telecommunication Engineering.\nMinimum 4 years in the field.\nField of experience (CCTV System, Digital Video Storage &amp;amp; Transmission, Access Control, Intruder Detection, Perimeter Protection, GTE Barriers &amp;amp; Security doors, Electromechanical locks, ID Badging, Fire Alarm, Guard Patrol system, Key Watcher System, UPS, Frequency Converters, Fiber Optics, Coaxial Cables, Cable &amp;amp; cabling and LAN and Wan.",
        "Knowledge, Capabilities & Skills",
        "English &amp; Arabic Languages.\nComputer and software applications related to the field.\nDriving License."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}