{
    "Job ID": "4733096",
    "Description": "Our client is one of the largest retail Conglomorate in the UAE region. We are looking at hiring a technology savvy HR Analyst. Job Summary: You will be responsible for managing our client’s Success Factors Employee Central Data Migration and provide data transformation support in the go-live period. Through expert product knowledge of Success Factors and as a key-value partner, you will ensure we continuously drive business value from our technology, and optimize the cost to serve, in partnership with Group Technology & Digital platforms & HR Data owners. Job Duties: As the data migration expert for SAP Success Factors Employee Central, you will need to rapidly understand the key demands of the program for mock and production data loads – understanding of client’s data and transformational needs, go-live data support, any fixes and adjustments required based on project needs.\nExecute and deliver the data load detailed plan.\nResponsible for the resolution of data issues encountered during data load.\nAccountable for the data checks and stabilization fixes.\nCollaborate with the system integrators on the transformation and load of data.\nSupporting our data migration team and product owner for the end-to-end data migration lifecycle. Skills",
    "Skills": [
        "Requisite Expertise/Experience:",
        " ",
        "Experience in service mgmt. methodologies such as ITIL and service delivery chain’s.\nUnderstanding of local legislative change’s impacting HR Technology.\nSolid experience of ‘software development lifecycle’ methodologies such as Agile, Scrum, Kanban, Iterative Model, DevOps etc.\nMinimum 4-7 years’ experience in HR Technology projects and domain.\nHands-on SAP HCM or SuccessFactors experience.\nAbility to create data migration reports in SuccessFactors EC.\nExpertise in data mapping and validation, and data quality checks in excel.\nExpertise in Data transformation for foundation and employee objects.\nExpertise in Configuration error investigation and resolution in SF.\nExperience SF EC integration with SAP HCM."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}