{
    "Job ID": "4733880",
    "Description": "Purpose:This is very important position and the incumbent will be responsible to manages all contractual matters, negotiates and ensures compliance with the terms and conditions of contract as well and maintaining a record of all changes/variations throughout the project.Job Description:Review the contract thoroughly and ensure the requirements of the contract are implemented during all the stages of the contract\nAdvise to stakeholders about contract variations/claims and interact with client representative and consultants about contract matters\nEffectively maintain the records of all contractual correspondences with key stakeholders\nMake sure that all guarantees, bonds are maintained and updated according to the contract requirements\nAttend all relevant meetings related to the contract administration such as claims, variations EOT etc.\nPrepare and assess the contractual entitlements in respect of the contractor\nEnsure that all terms and conditions are implemented correctly before the close out procedures and final settlement.\nOther duties according to the nature of the job.Skills",
    "Skills": [
        "Key Qualifications, Experience and Skills",
        "Bachelor of Engineering or related filed with typically 15+ years of experience of contract administration in large construction companies\nFIDIC extensive knowledge\nProven experience of industry best practices and negotiation of main contracts\nProfessional memberships are desirable\nStrong communication and negotiation skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 20",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}