{
    "Job ID": "4733031",
    "Description": "Position Title:             Sales ManagerEmployment Type:     FulltimeSalary:                         up to 18K AED, all-inclusive depending on experience and qualificationsJob Location:             Dubai, UAE About the Client:One of the market leaders in steel and piping industry. Job Responsibilities:Develop and implement comprehensive sales plans and strategies to achieve company objectives and maximize revenue from piping products and valves.\nIdentify and target key markets, industries, and customers for business expansion and establish a strong pipeline of sales opportunities.\nBuild and maintain strong relationships with existing and potential clients, understanding their needs and providing customized solutions to drive customer loyalty and increase sales.\nLead, mentor, and motivate a high-performing sales team, providing guidance, coaching, and support to achieve individual and team targets.\nCollaborate with internal departments and suppliers to ensure efficient project management, timely product delivery, and exceptional customer service.Skills",
    "Skills": [
        "Qualifications",
        "Male, 40 years old and below\nBachelor's degree in business administration, engineering, marketing, or any related field, additional certifications in sales or business development is a plus\nProven track record of successful sales performance in the piping products and valves industry, with a minimum of 3 years’ experience in sales management\nIn-depth knowledge of piping products, valves, applications, and relevant industry standards",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}