{
    "Job ID": "4733185",
    "Description": "Adherence to safety guidelines when working with fiber optic cables and equipment to prevent injuries from laser light exposure\nInstalling and terminating fiber optic cables, connectors, splices, and other related hardware while ensuring proper alignment and minimal signal loss.\nUse testing equipment such as optical power meters, light sources, and OTDRs to measure signal strength, identify signal loss points, and troubleshoot issues.\nand attention to detail for delicate tasks like splicing and connector installation.\nMaintaining and repairing fiber optic networks, including identifying and addressing issues related to signal degradation, connectivity, and equipment malfunction.\nUnderstanding of basic electrical concepts relevant to fiber optic systems, such as power requirements and grounding.Skills",
    "Skills": [
        "Diploma certificate or what shows; synthetic synthetic fiber\nA strong understanding of fiber optic technology, components, and how light signals are used to transmit data through optical fibers.\nProven experience as a Technician, in a similar position, with hands-on experience in cabling and networking.\nProficiency in the use of manufacturing devices\nStrong understanding of network architecture and call centers for telecom networks.\nExcellent problem-solving and detail skills.\nAbility to work in a variety of environments, including outdoor and confined spaces\nKnowledge and experience in both fusion splicing and mechanical splicing techniques to join fiber optic cables accurately and securely.\nKnowledge of networking components, protocols, and standards that interact with fiber optic systems, such as switches, routers, and Ethernet interfaces.\nFiber Optics Knowledge\nInstallation and Termination\nTesting and Troubleshooting\nSplicing Techniques\nNetwork Maintenance\nNetworking Components\nBasic Electrical Knowledge."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Jordan",
        "Nationality": "Jordan"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}