{
    "Job ID": "4733013",
    "Description": "Hiring for Russian, Chinese, Malay, Indonesian- BPO @UAEJob Description : Customer Solutions Representative(Chinese/Mandarin only)The Customer Solutions Representative will be responsible for all clients ensuring ongoing support and value throughout the client journey cycle (registration, deposit, trading, withdrawals, client training etc.) using soft sellingDuties and Responsibilities:· Improving customer experience, productivity and profitability through excellent service quality· Ensure to hit personal KPIs (chat/call/email numbers, net deposits, activations, CSAT etc.)· Identifying and developing high net worth clients and ensuring smooth transition to the Relationship Management team for further assistance – when required· Answering e-mails, assisting with client registrations, deposits, trading, withdrawals, client training· Liaising with all departments to resolve issues· Providing all relevant information to clients regarding documents and materials for becoming a clientSkills",
    "Skills": [
        "Requirements:",
        "· Language skills: Fluent in Arabic or Yoruba languages(should read, write & speak)",
        "· Excellent spoken and written communication skills required ",
        "· Ability to work efficiently under pressure",
        "· Excellent computer skills (Microsoft Excel and Word)",
        "· Knowledge of Meta Trader platforms will be considered an advantage",
        "· Previous experience in a similar position will be considered an advantage",
        "skills.",
        "The endeavor would be to try and interest the customer in the other products and services available. To understand the customer’s needs and propose accordingly."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 20 Max: 30"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Call Centers & Customer Care Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$5,000 - $6,000",
        "Number of Vacancies": "10"
    }
}