{
    "Job ID": "4733099",
    "Description": "Our client is a fast-growing SaaS start-up. They are now looking for an Enterprise Sales Account Manager – KSA to join them. Roles & Responsibilities:Generating new business opportunities and expanding existing customer networks in the enterprise segment\nManaging the full sales cycle from prospecting to closing, and ensuring high customer satisfaction and retention\nSetting and tracking sales account targets and key performance indicators, aligned with company objectives and strategy.\nBuilding strong relationships with decision-makers and influencers at enterprise accounts, and positioning the company as a trusted and strategic partner\nDeveloping and executing account plans and sales strategies to address customer pain points and deliver value-added solutions\nReporting on sales activities and pipeline status using our CRM systemSalary: SAR 20000 - SAR 25000Skills",
    "Skills": [
        "Preference:",
        "Arabic-speaker\nImmediate joiner",
        " ",
        "Qualifications:",
        "5+ years of experience in sales or business development within a fast-paced B2B SaaS enterprise\nProven track record of selling software / SaaS/web services into large Enterprise accounts\nA solid network and connections in Saudi Arabia \nMust be a Saudi National or resident of the Saudi\nStrong presentation and listening skills: comfortable presenting and negotiating with senior executives (C-level)\nExcellent negotiation skills\nMust be able to communicate effectively in Arabic and English",
        " ",
        "Benefits:",
        "A comprehensive and generous compensation (salary and commission) and benefits package for self."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}