{
    "Job ID": "4733365",
    "Description": "Our client is a leading retail organization located in the UAE. To perform routine accounting functions such as account/ ledger maintenance, reconciliation, approved vendor payments, plus supporting the Finance Manager/Asst. Finance Manager in ensuring compliance and effective implementation of financial policies. Responsibilities:Ensures all transactions are recorded and updated in a timely manner.\nReviews all accounts payable requests from departments to ensure validity and support with approvals, process payments and update records.\nResolves accounting discrepancies and ensures accuracy is maintained on all accounting information.\nAssists on periodic internal and external audits; ensures that records for internal and external audits are prepared and maintained.\nAssists and supports the Finance Manager and Asst. Finance Manager for monthly book closure and accounting all necessary provision and accrual entries.\nPrepares bank and cash reconciliation.\nAny other related duties / projects assigned by the Finance Manager from time to time to meet the business needs.Skills",
    "Skills": [
        "Proven work experience as a Tax Accountant,\nWell-versed in understanding various cycles in the accounting process.\nA disciplined individual with a keen eye for solving practical challenges within the constraints of prescribed time limits.\nBasic knowledge of accounting software solutions and their practical applications.\nProfessional education in Commerce-oriented streams like Finance and Accounts from a reputed university."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}