{
    "Job ID": "4733524",
    "Description": "JOB PURPOSEWe are looking for a talented social media and content manager to join our team and take charge of our social media presence across our portfolio of brands. The ideal candidate will have a strong understanding of social media platforms and best practices, as well as experience with B2B marketing. They will also be proficient in reporting and data analysis, planning and scheduling, content development, and basic design.KEY RESPONSIBILITIESDevelop and implement comprehensive social media strategies for each brand in line with overall marketing objectives and target audience\nCreate engaging and shareable content (text, images, videos, etc.) tailored to each brand's identity and target audience.\nCreate and manage quarterly calendar, written content for online channels.\nManage day-to-day social media activities, including content planning, scheduling, posting, and community management.\nMonitor and analyse social media performance metrics, generating regular reports to track KPIs and providing actionable insights for continuous improvement.\nCollaborate with the marketing and design teams to ensure consistent branding and messaging across all social media channels\nEngage with followers, respond to comments and messages, and handle customer inquiries or issues in a timely and professional manner.\nImplement social media advertising strategies to drive lead generation and conversion.\nMonitor industry trends and competitive landscape to identify new opportunities for growth and engagement.\nStay up-to-date with the latest social media trends, algorithms, and emerging platforms to ensure maximum brand visibility and engagement\nStay informed about industry regulations and best practices related to social media.Skills",
    "Skills": [
        "Bachelor's degree in Digital Marketing, Communications, or a related field.\nProven work experience as a Social Media Manager or similar role, with a successful track record in managing multiple brands.\nExcellent written and verbal communication English and Arabic skills with a keen eye for detail\nStrong understanding of B2B social media strategies and best practices (experience of B2C would also be useful but not essential)\nProficiency in using social media management tools for planning, scheduling, and reporting.\nExcellent analytical skills to interpret data and metrics and make data-driven decisions.\nDemonstrated ability to create compelling and visually appealing content.\nBasic graphic design skills to create simple visual assets\nAbility to work in a fast-paced environment and handle multiple projects simultaneously."
    ],
    "Preferred": {
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Media Production; Marketing; Public Relations (PR)",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}