{
    "Job ID": "4733605",
    "Description": "Roles & ResponsiblilitiesManage all aspects in Electronics and Telecommunication Projects according to PMI Methodology and approved processes and procedures.\nPerform installation, testing and commissioning of highly engineered materials, supervise & monitor related activities.\nCoordinate with ED -PMD Manager to develop the project plan before starting his project.\nResponsible for achieving project scope, according to project budget and scheduled plan.\nResponsible and capable for units and/or system installation, testing and commissioning to complete and finalize all contractual conditions and needs.\nMonitor and control project schedule plan and follow up project's team to achieve their assignments accordingly.\nConduct regular meeting with client, client consultants to update them with project status, and to solve any problems affecting project's progress.\nReport to ED PMD manager on daily basis stating project performance and tasks accomplished according to project's schedule plan.\nReport to ED PMDM if any changes required in project's scope, following the change management procedures to get approval for these changes.\nCoordinate with Sales and Marketing team along with clients on work progress and needs.\nHandle product complains and make recommendations to superiors regarding goodwill replacement of products, suggesting methods of quality control and checking to determine that equipment and systems are functioning properly.\nCooperate, coordinate and exchange data, information pertaining to systems & projects with staff in other divisions and keep well informed of such issues in order to cover the gap in case of emergencies.Skills",
    "Skills": [
        "Qualification & Experience",
        "University degree in Electronic/Communication / Electrical Engineering.\nMinimum 3-5 years in the field with supervisory.\nField of experience (CCTV System, Digital Video Storage &Transmission, Access Control, Intruder Detection, etc...).\nKnowledge, Capabilities & Skills\nEnglish &; Arabic Language.\nComputer and software applications related to the field.\nAbility to make judgments and take decisions.\nGood analytical, interpersonal and effective communications skills.\nDriving License."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}