{
    "Job ID": "4734238",
    "Description": "Coordinate with various vendors to get the vendor deliverables and review them effectively.\nParticipate in engineering studies such as SAFOP, HAZID, HAZOP, SIMOPS, SIL, ALARP, BOW-TIE analysisetc.Review the Electrical engineering drawings such as interconnection, Earthing layouts, distribution boardwirings protection & metering drawings etc.Electrical data acquisition systems such as Power monitoring systems (PMS) and SCADA networks is highlydesirable.Electrical Feeders, Motor control Centers (MCC), Remote control units (RCU), Current/Power and Voltage transducers and their installation and commissioning.\nPreparing and reviewing the calculation software documents such as cable sizing, power calculations, load calculations, short circuit analysis, voltage drop etc.\nWell aware of Oil and gas construction practices and safety guidelines.\nAware of international standards and design practices such as IEC, NEC, NEMA, BS and Shell DEP etc. and good exposure to preparing construction documentation such as method statements, review of startup and commissioning documents of electrical systems and equipment, review of inspection test plans etc.\nCoordinating with Permit authorities in an Oil & Gas facility and must be able to assess the required manpower, Tools and tackles, safety measures in accordance with the planned work. Skills",
    "Skills": [
        "Bachelor's Degree in Electrical engineering\nMust have good experience in the review of design engineering documents\nGood exposure to UPS and battery banks is mandatory.\nGood experience in the installation and startup of electrical cabinets, associated cabling, and other tests in accordance with the applicable standards and guidelines prevails in Oil and gas industry.\nFamiliarity with power system studies is highly desirable.\nGood knowledge in the Installation of Transformers (both oil-filled & Dry type), the pre-start-up checks and commissioning is desirable.\nA basic knowledge in the electrical interfaces with other systems such as Instrumentation, DCS, ESD, PMS Etc. Is highly desirable. A good knowledge in small power, LV/ELV installations is required.\nHands-on experience in the startup checks and commissioning activities of Electrical equipment’s such as motors, Fans, compressors etc.\nMinimum 8 to 10 years’ experience similar experience in Oil & Gas Industry.\nMust have rich exposure to work in EPIC projects in O&G industry, both upstream and downstream.\nFamiliarity with electrical equipment installations, such as rotary equipment, switch gears, power feeders and",
        "substations etc.",
        "Good exposure to 33KV/11KV/3.3KV & 415VAC installations along with  good knowledge of Transformers and",
        "switch gears for the respective installation.",
        "Exposure to transmission and distribution networks will be an added advantage.\nPreference for locally available candidates."
    ],
    "Preferred": {
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}