{
    "Job ID": "4734784",
    "Description": "Position Title:               SupervisorEmployment Type:     Full TimeSalary:                        up to 4.5K AED all-inclusive depending on experience and qualifications plus centralized tips and uniformJob Location:                Dubai, UAE  About the Client:  A stand-alone Mediterranean restaurant, serving signature burgers and beverages with multiple branches in UAE and KSA. Job Description:  Ensuring exceptional customer service by interacting with customers, addressing their concerns, and maintaining a welcoming and professional atmosphere.\nSupervising and guiding the front-of-house staff, includig waitstaff, hostesses, greeters, and other customer-facing employees. This involves training, scheduling, and performance management.\nOverseeing daily operations during shifts, including seating arrangements, reservations, and managing the flow of customers to optimize efficiency and customer satisfaction.\nHandling customer complaints and conflicts effectively and professionally to ensure a positive resolution and maintain a harmonious environment.\n\\Coordinating with kitchen and bar staff to manage inventory levels of food, beverages, and supplies to avoid shortages and wastage. Greet customers as they enter.\nGive customers drink menus and answer their questions regarding ingredients. Take orders while paying attention to details e g preferences of coffee blend dairy and sugar ratios.\nPrepare beverages following recipes.\nServe beverages and prepare latte art like solid heart, simple Tulip, etc.\nReceive and process payments cash and credit cards.Skills",
    "Skills": [
        " ",
        "Qualifications: ",
        "Open to Indian, Filipino, Sri Lankan, Nepali, and African nationals\nFemale, 22 to 35 years old\nDiploma or any relevant certificate\nAt least 2 years of experience from hotel restaurants, mid to high-end café, and bistro\nCandidates who can join immediately will be prioritized "
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All African Countries; India; Nepal; Philippines; Sri Lanka",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}