{
    "Job ID": "4734987",
    "Description": "Responsible for planning, conducting and reporting on operational, financial and compliance related audits reviews to evaluate the effectiveness of internal controls and determine compliance with selected policies, procedures, and regulation, assisting McD–Jo Internal Audit and Controls team in the execution of the annual audit plan, and preparing recommendations to DL to increase efficiency and/or effectiveness of the control systems of functions reviewed.Skills",
    "Skills": [
        "Education: Bachelor Degree in related Filed, Certified Internal Auditor (CIA).",
        "Experience: 3 - 5 Years in 3 to 5 years in Internal Audit and Risk Management.",
        "Communication:",
        "Ability to send and receive message in a correct and clear manner, within a correct time.\nAbility to respect differences of opinion and cultures.\nAbility to use different communication ways efficiently.\nAbility to participate in periodic management meetings.\nAbility to comply with applicable policies and procedures.",
        "Skills:",
        "Analytical thinking and attention to detail.\nStrong ethical standards and high levels of integrity.\nThe ability to think objectively and demonstrate sound judgment.\nStrong interpersonal and communication skills, both oral and written, to interact effectively and professionally with faculty, staff and the public.\nDemonstrated project management skills.\nFlexible thinking and ability to adapt to change.\nAble to maintain positive team relationships by demonstrating and supporting initiative.\nWorks well under pressure, excellent time management and organization skills.\nAbility to accept and contribute to change.\nAbility to help others to accept change.",
        "Language: Proficient in both Arabic and English",
        "Strategic Perspective:",
        "Ability to plan and organize activities / products / offers at the company level.",
        "Elevates and Champions Talent:",
        "Ability to supervise the development plans of the employees under his /her supervision.",
        "Risk Management:",
        "Ability to follow the company's alternative plans with small plans associated with his/ her department roles."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}