{
    "Job ID": "4734168",
    "Description": "إعداد جدول اعمال رئيس مجلس الاداره والمساعدة في تخطيط المواعيد واجتماعات الإدارة.\nالتنسيق وحضور الاجتماعات بالنيابة عن رئيس مجلس الاداره طبقا لتعليمات رئيس مجلس الادارة .\nاستقبال المكالمات الهاتفية وإعادة توجيهها حسب الطلب.\nالتعامل مع المراسلات الصادرة والواردة وترتيبها حسب الأولويات.\nإعداد وتجهيز ترتيبات السفر لرئيس مجلس الاداره.\nالتعامل مع الوثائق السرية والتأكد من بقائها بشكل آمن.\nإعداد التقارير اللازمه والتى تتضمن سير العمل والمشكلات التى توجهها الشركه لعرضها على السيد رئيس مجلس الادارة.\nالحفاظ على السجلات الإلكترونية والورقية وضمان تنظيم المعلومات بحيث يمكن الوصول إليها بسهولة.\nإجراء البحوث وإعداد العروض التقديمية و التقارير عند الطلب.\nالتواجد فى العمل طوال مدة وجود رئيس مجلس الادارة خلال ايام العمل\nبعض ايام العمل تستدعى التواجد بعد مواعيد العمل الرسميه كا (اجتماعات رئيس مجلس الادارة  بمدرين الادارات او الفروع – مقابلات التوظيف) Skills",
    "Skills": [
        "اجادة استخدام برامج مايكروسوفت اوفيس MS Office.\nالمعرفة الجيدة بإدارة المكاتب ومبادئ الإجراءات المحاسبية الأساسية.\nاجادة اللغة الانجليزيه وخاصه فى المرسلات\nالإلمام بأساليب البحث الأساسية وتقنيات إعداد التقارير.\nامتلاك مهارات تنظيمية قوية والقدرة على إدارة وقت بشكل ممتاز.\nالقدرة على التفاوض والاقناع.\nاجادة مهارات التواصل مع الشخصيات المختلفة.\nالنزاهة والسرية في التعامل مع البيانات المختلفة.\nالتمتع بشخصية هادئة ورزينة وبالمرونة.\nالتعامل مع الأمور برزانة وهدوء.\nقرب السكن من مقر الشركه بالتجمع الخامس"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 3 Max: 7",
        "Residence Location": "Egypt",
        "Gender": "Female",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 35"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}