{
    "Job ID": "4734872",
    "Description": "We are seeking a motivated Receptionist/Admin Assistant to join our team at a Sports Academy in Abu Dhabi. The individual will play a crucial role in ensuring the smooth and efficient operation of the academy by providing administrative support, managing office tasks, and assisting with customer service. This position requires strong organizational skills, good communication abilities, and computer skills to ensure exceptional service to our students and their families.ResponsibilitiesAdministrative Support:Provide general administrative support to the academy, including answering phone calls, responding to emails, addressing WhatsApp inquiries and handling correspondence.\nAssist with scheduling appointments, managing calendars, and maintaining accurate records.\nPrepare and distribute documents, reports, and presentations as required.Customer Service:Greet visitors, students, and parents, ensuring a friendly and professional atmosphere.\nProvide information and guidance on academy programs, services, and policies.\nRespond to inquiries, assist in resolving complaints, and address customer needs in a timely and professional manner.Registration and Enrollment:Assist with student registration and enrollment processes, ensuring accurate and up-to-date information is collected while maintaining strict confidentiality of customer and financial information.\nProcess payments, issue receipts, and maintain financial records related to student fees and memberships while maintaining confidentiality of information.\nCoordinate with the coaching staff to assign students to appropriate classes based on their skill level and age.Records Management:Maintain student records and files, ensuring confidentiality and accuracy of information.\nUpdate and organize databases, including student profiles, emergency contacts, and medical information.\nAssist in maintaining inventory and ordering office supplies as needed.\nAdhere to data protection and privacy policies when handling student records and personal information.Event and Program Support:Provide support during events, competitions, workshops, and other academy programs.\nHelp with logistics, scheduling, communication, and registration for various events.\nCollaborate with the coaching staff and management to ensure successful event execution.Office Management:Maintain office supplies inventory, place orders, and ensure the availability of necessary materials.\nManage incoming and outgoing mail, packages, and deliveries.\nHelp maintain a clean and organized office environment.Additional Tasks:Perform any additional tasks as needed to support the smooth operation of the academy.\nAdapt to new responsibilities and assist in areas such as event coordination, marketing initiatives, or administrative projects as required.Skills",
    "Skills": [
        "Qualifications and Skills",
        "Bachelor’s degree\nProven experience in an administrative role, preferably in a sports or educational setting.\nExcellent organizational and time management skills with the ability to multitask effectively.\nStrong interpersonal and communication skills, both written and verbal.\nProficiency in using office software, such as Microsoft Office Suite.\nAttention to detail and a commitment to maintaining accuracy in all administrative tasks.\nAbility to work independently as well as collaboratively in a team environment.\nFriendly and professional demeanor with a passion for providing exceptional customer service.\nGood command of the English language is essential"
    ],
    "Preferred": {
        "Residence Location": "Abu Dhabi, United Arab Emirates",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Sports & Outdoor Activities",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}