{
    "Job ID": "4734183",
    "Description": "قيادة استراتيجية استقطاب المواهب وتخطيط القوى العاملة التي تشمل الإدارة العامة لتوريد المرشحين ، والقائمة المختصرة ، والمقابلات ، والتقييم ، والعروض ، والإعداد ، وترتيبات انضمام الموظف ، وعقد المنضمين الجدد والتوجيه ، والفترة المؤقتة للموظف ، ونقل الموظفين ضمن إنتاجية محددة مسبقًا و معايير الوقت المستغرق (TAT) وبالتالي ضمان المساهمة في التوجه الاستراتيجي لـ الماجد للعود. سيكون مدير اكتساب المواهب مسؤولاً عن الإشراف على جميع الوظائف والأنشطة في الماجد للعود.\n• إدارة دورة الميزانية لإدارة أستقطاب المواهب وتقديم مدخلات لعملية وضع الميزانية\n• إدارة إدارة أستقطاب المواهب بشكل فعال ضمن الميزانية ، والإبلاغ بدقة عن التقدم المحرز والتحديات التي تمت مواجهتها\n• صياغة المبادرات التي تؤدي إلى أثر مالي إيجابي لإدارة أستقطاب المواهب وتخفيف المخاطر المالية والتشغيلية\n• تصميم وتنفيذ أهداف أستقطاب المواهب بما يتماشى مع استراتيجية العمل الشاملة\n• تصميم وتطوير والحفاظ على عملية التوظيف بما في ذلك تحديد تدابير التتبع المطلوبة وتقديم تقارير منتظمة إلى أصحاب المصلحة الضروريين\n• التنبؤ بمتطلبات التوظيف السنوية وتحديدها من خلال تحليل الخطط والأهداف التنظيمية تليها مناقشة مع مديري الأفراد\n• بناء والحفاظ على مصادر موثوقة لمقدمي الطلبات من خلال البحث والاتصال والحفاظ على العلاقات مع الكليات ووكالات التوظيف والمجندين المستقلين. وهذا يشمل أيضًا البحث في الوسائط التي يمكن الاعتماد عليها ومواقع الإنترنت\n• الإشراف على مبادرات التوظيف مثل وضع إعلانات الوظائف والاستخدام المناسب لمجموعات الأخبار ومواقع العمل\n• تحديد ملاءمة المرشح من خلال إجراء مقابلات مع المتقدمين ، وتحليل الردود ، والتحقق من المراجع ، ومقارنة المؤهلات بمتطلبات الوظيفة\n• تصميم وتنفيذ عملية تهيئة وتوجيه الموظف\n• الإشراف على نقل الموظفين وإدارتها بما في ذلك التحقق من متطلبات الموظف والتنسيق مع مختلف البائعين\n• المساعدة في تحسين جاذبية المنظمة من خلال تحديد وتنفيذ أفضل الممارسات\n• إدارة برنامج التدريب (عندما يكون نشطًا) من خلال إجراء التوجيه وجدولة التناوب والمهام ومراقبة أداء المتدرب والتدريب\n• المشاركة في أحداث التوظيف واستضافتها لزيادة وعي شركتنا وبناء العلامة التجارية للشركة في وضع عدم الاتصال وكذلك المبادرات عبر الإنترنت\n• قيادة وإدارة تخطيط القوى العاملة والخطة السنوية\n• قيادة وإدارة حلول أنظمة التوظيف مثل (تهيئة الموظفين ، ATS ونظام الفترة المؤقتة)\n• دعم مشاريع التوظيف الخاصة بوزارة الإسكان ومبادراتها\n• قيادة شراكة استراتيجية مع صندوق تنمية الموارد البشرية لبرامج مثل تمهير وبرامج أخرى\n• إعداد ومراجعة ومراقبة ميزانيتنا السنوية لـأستقطاب المواهب\n• إدارة قياس مقاييس التوظيف ومؤشرات الأداء الرئيسية لتتماشى مع مؤشرات الأداء الرئيسية للموارد البشرية\n• تصميم وإدارة أدوات تقييم التوظيف.\n• قياس جودة التوظيف عن طريق مسح الرضا بشكل متكرر\n\n• تطوير والإشراف على تنفيذ سياسات وإجراءات وضوابط إدارة اكتساب المواهب التي تغطي جميع مجالات النشاط ، وضمان استيفاء جميع المتطلبات الإجرائية / القانونية ذات الصلة أثناء تقديم نتائج عالية الجودة وفعالة من حيث التكلفة\n• قيادة وإدارة التغيير المباشر من خلال التحسين المستمر لأنظمة وعمليات وممارسات إدارة اكتساب المواهب ، مع الأخذ في الاعتبار بشكل استباقي الممارسات الرائدة ، والتغيرات في بيئة الأعمال\n• الإشراف على تطوير وتنفيذ \"اتفاقيات مستوى الخدمة\" (SLAs) مع وظائف أخرى\n• المساعدة في ترسيخ ثقافة التطوير والتوجيه والأداء داخل قسم أستقطاب المواهب\n• توجيه وإرشاد وتطوير فريق إدارة أستقطاب المواهب لتولي مسؤوليات أكبر وأكثر تعقيدًا\n• تحديد وتوظيف المواهب الرئيسية لإدارة أستقطاب المواهب\n• توفير اتصال واضح من أعلى إلى أسفل للموظفين وردود فعل من أسفل إلى أعلى للإدارة العليا\n• تعيين أهداف الأداء ، وتقديم الدعم اللازم ، وتقييم التقارير المباشرة ، وتقديم ملاحظات منتظمة على الأداء\n• إنشاء بيئة عمل عالية الأداء داخل قسم أستقطاب المواهبSkills",
    "Skills": [
        "• 8 إلى 12 عامًا من الخبرة في أستقطاب المواهب / تخطيط القوى العاملة ، مع خبرة لا تقل عن سنتين في منصب إداري\n• درجة البكالوريوس في الإدارة أو ما يعادلها\n• يفضل درجة الماجستير في الإدارة (تخصص الموارد البشرية) أو ما يعادلها\n• يفضل CIPD أو SHRM "
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}