{
    "Job ID": "4734740",
    "Description": "The Front Desk Manager has a crucial role in ensuring an exceptional and memorable experience to our guests, responsible for greeting guests, serving the needs of guests, and building positive relationships with guests as the direct responsible for our guests first and last impressions. An important aspect of the role is to work closely with the front desk hostess team in order to ensure that the expectations of our guests are met and delivered from the very start of their experience to the moment that they leave.Duties and ResponsibilitiesEnsure an exceptional and memorable guest experience by working closely with the team to ensure that the expectations of our guests are met and delivered from the very start of their experience to the moment that they leave.\nComplete the service of reception according to the assigned task standards and training.\nEnsure all our guests receive a positive, warm and professional first and last impression of the restaurant, including: opening the entrance for guests to enter and exit; remembering guest names and special requests; escorting guests to their allocated tables with menus; and thanking quests upon leaving with a warm invitation to return.\nAct as the face of the restaurant, taking time to listen, understand, engage and recognize each guest. Remember guest names, number of people and special requests. Maintain privacy and professionalism when dealing with high profile guests.\nAssist to implement service and operating standards, at the Front desk and to the team, through disciplined supervision with absolute attention to detail.\nEnsure that quality of service and standard in the bar reflects the one provided in the restaurant, without compromising the reservation steps.\nResponsible for supervising the day-to-day functions of all front desk employees, ensuring successful operations and motivating the team to deliver exceptional service to our guests. This will include dealing as first point of contact for any guest queries and initial guest approach. This will also include excellently and appropriately communicating with our guests, which will include checking with customers on departure to ensure satisfaction with the overall experience.\nAssist the General Manager with reports and/or assessments related to procedures, policies and methods of operation, which are aimed to maximize guest experience, footfall and revenue. This may include reports on trends and opportunities of sales or updates on customer interactions.\nAssist the executive team to implement ideas and procedures to continuously improve performance and sales. This will include monitoring and reporting comments, footfall trends and helping identify key patrons.\nAssist the General Manager to achieve financial targets and ensure financial success of the department. This will include assisting with the review of performance, manning and successful business volume management.\nDevelop a strong relationship with key guests and act as leader and responsible to maintain a guest data base, which will include contact details, table/food/drink preferences and special requests.\nAssist with implementation and constant update on the front desk operating manual. Be responsible in communicating and training the whole staff on it.\nPromptly inform the executive team, prior to giving approval, in regards to any special requests made by our guests in regards to food, drinks and arrangements. To ensure that the front desk team also seek prior approval by the Restaurant Manager on such requests.\nUltimately be one of the face and voice that each guest will associate to restaurant in its perfection.\nAnswer emails in regards to reservations, promotion, or enquiries, and ensure effective communication between bar, reservations, and Restaurant Manager.\nCollaborate with executive team to monitor and implement and marketing initiatives.\nEnsure that all equipment, fixtures, and furniture of the department are kept in the best repair possible and are used in a safe and proper manner.\nEnsure departmental adherence to and awareness of environmental, health and safety policies and procedures.Skills",
    "Skills": [
        "Previous experience in Hospitality/F&B and customer service, in a manager position or above\nExperience in premium service/operations standards required to achieve an exceptional guest experience\nKnowledge in customer service, front desk training and customer satisfaction initiatives.\nExperience in motivating, training and leading team members to the highest standards, set and monitored by the executive team.\nKnowledge in sanitation requirements, local governmental regulations, and food/beverage handling safety standards (HACCP)\nExcellent English and Arabic communication skills.\nKnowledge of the facilities, menus and promotions."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}