{
    "Job ID": "4734958",
    "Description": "•Handles a wide range of administrative and secretarial-related work.•Handles telephone calls and responds to public inquiries.•Carries out the filing of records and maintains an effective filing system.•Accounting/Inventory data entry•Making Invoices•Reviews and summarizes various reports and documents for the Manager.•Handles confidential information with utmost secrecy and integrity.•Perform all other routine office managerial and secretarial related work.Skills",
    "Skills": [
        "Good communication skills. Strong organizational skills with the ability to multi-task Professional, friendly, and caring customer service skills to ensure patients feel welcome and comfortable. Proper phone and email etiquette. Ability to work independently as well as in a team environment. Ability to effectively handle details with accuracy. Excellent time management and ability to prioritize work Flexible, organized, motivated to learn, and a team player. Maintain patient confidentiality, both in and out of the clinic.",
        "LIVES IN BEIRUT FEMALE",
        "Working Hours: Monday to Friday: 8 am to 5 pm Benefits: Monthly Salary: Good package; relevant to experience Social Security Private Insurance: 2nd Class Official Holidays: 9-10 days per year Yearly days off: 15 working days Bonus: Yearly according to performance, attendance and attitude Education and Experience Requirements: University or Institute degree education needed Minimum 3 years of administrative assistant experience Knowledge of appropriate software including Excel, Word, PowerPoint Arabic & English proficient Basic Accounting is a must "
    ],
    "Preferred": {
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}