{
    "Job ID": "4734004",
    "Description": "The duties and responsibilities of an HSE manager include the following;Investigate mishaps or near misses to spot potential dangers and make recommendations for action.\nEstablish and enforce safety policies and practices to guarantee employee adherence to safety requirements.\nCoordinate safety training programs to assist staff in comprehending and observing safety procedures.\nEvaluate the safety performance of employees to find areas for development.\nInspect, audit, and research a company’s or organization’s workplace safety.\nStudying workplace dangers will help you find solutions to increase safety.\nAdvise equipment updates to make it more user-safe.\nAssure the availability of safety gear, such as hard helmets and respirators.\nEstablish and put into practice safety rules and procedures to safeguard employees from workplace dangers.\nAssist, encourage, and keep an eye on the HSE strategy’s execution.\nPreserve safety in manufacturing facilities, and make sure that the workplace is observed and is completely compliant with all applicable OSHA standards, rules, and regulations.\nAlert workers to potential dangers, and use labels, signage, posters, floor markings, and color coding.\nMake sure that personnel is informed of and has access to safety standard operating procedures (SOPs).\nEnsure that the findings of safety inspections are recorded, keep track of how accidents and injuries are investigated, make sure that corrective steps are taken, and offer suggestions on how to avoid future mishaps.\nPoint out areas where training or certification is necessary to meet the requirements outlined in applicable law-approved codes of conduct, or HSE recommendations.\nConduct and review all “assessments” as specified by law at appropriate intervals, and keep records of them.\nProvide advice on the standard of P.P.E. provided to employees and control mechanisms.\nPrepare reports on all company operations and conduct health and safety inspections.\nConduct investigations into any mishaps and near-misses, and document the results on the appropriate forms.\nMaintain constant facility hygiene, keep an eye on all conservation and protection activities, and create the necessary status reports.\nManage communication strategies, write necessary newsletters, create and put into place effective site safety training programs, and conduct investigations to resolve all problems.\nJoin all site safety committees, evaluate all job hazards, make sure all OSHA regulations are followed, and conduct audits on all operations.\nAssist in the HSE Policy and Guidelines matter.\nSupport the Top Management’s understanding of the Organization’s roles and responsibilities for matters relating to safety.\nEnsure that implementation, update, review, and audit the Company HSE Systems.\nOversee the efficient application of the proper Safety and Environmental System processes and make arrangements for their update by following law and company directives.Skills",
    "Skills": [
        "Understanding of health, safety and environmental regulations\nStrong communication and interpersonal skills\nOrganizational skills\nProblem-solving skills\nLeadership skills\nAuditing\nEmergency response\nGood analytical abilities and the capacity for critical thought\nRisk assessment\nGood writing skills"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 15",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 40"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}