{
    "Job ID": "4734193",
    "Description": "JOB REQUIREMENTS Engineering graduate (BSEE preferred) with >15 years of relevant experience in chemical or electronic engineering. Demonstrated “hands-on” experience in designing and maintaining quality assurance on control systems in manufacturing plants. Proficiency in programming of Distributed Control Systems, specifically Siemens PCS7, Honeywell Experion will be an advantage. Understanding of field instrumentation, gas analyzers, and control valves. A fundamental understanding of computer networks is desirable. Profound knowledge in the fields of advanced process control, process simulation (static and dynamic models), real-time optimization, model predictive control, digital control signal engineering and artificial intelligence (machine learning and neural networks). Solid understanding of fundamentals of chemical process and reaction engineering and thermodynamics. Candidates should also possess demonstrated math, analytical, troubleshooting and problem-solving skills, an ability to think logically and systematically. Knowledge & understanding with the principles of: Safety Integrity Level (SIL), Safety Instrumented System (SIS), Safety Instrumented Function (SIF), Supervisory control and data acquisition (SCADA). Knowledge of industry codes and standards applicable to Oil and Gas and Refining Industries (API, ISA, NEC / IEC, NFPA, ASME, etc.) and preferably also Saudi Aramco standards and working practices will be an advantage. Emphasis placed on safety, teamwork, and aptitude toward challenging work. Skills related to outage planning, organization and communication are highly desirable. Proficiency in English speaking and writing. Good interpersonal and teamwork skills with the ability to communicate clearly and effectively throughout all levels within the organization. Experience in leading and guiding technical employees and service providers. Knowledge and understanding of local statutory / regulatory requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dhahran Al Janoub, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Chemical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}