{
    "Job ID": "4734889",
    "Description": "Primary Duties and Responsibilities:May participate in project execution strategy and planning.Knows the project and discipline scope/cost/time requirements, assists the team to meet expectations, and coordinates with other disciplines to ensure project success.\nImplements innovative solutions, technology advances, and methods to effectively deal with working out of sequence.\nSupports management of project change and progressing for the discipline and works with the Project Management Team to take corrective actions regarding any issues, staffing requirements, scope changes, progressing, or other events that could affect project completion and/or profitability.\nPlans discipline quality, monitors quality activities, drives and participates in squad checking, recommends improvements, and takes action where required.\nMonitor design/drafting estimating norms within asset for own discipline.\nDevelop and promote drafting and CAD initiatives to improve cost effectiveness of design / drafting work within own discipline.\nParticipate in review of structural design and advise on technical drafting difficulties or government compliance requirements as appropriate.\nOversee the preparation of design and detail drawings from sketches, plans or other design / specification data.Skills",
    "Skills": [
        "Qualification:Minimum 15 years proven experience of detailed Civil Structural design gained with design contractors and/or oil/gas companies within the industry. Expert knowledge in 3D modelling (E3D/S3D/PDMS) of Structures including understanding of constructability.",
        "Extensive design experience in the relevant discipline in the same or similar industry, and, where relevant, experience managing and leading multi-disciplinary projects and teams"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}