{
    "Job ID": "4734078",
    "Description": "Roles:We are seeking a skilled and experienced Facilities Manager to oversee the maintenance and operation of our facilities. As the Facilities Manager, you will be responsible for ensuring the efficient and effective functioning of our physical infrastructure, including buildings, equipment, and systems. You will lead a team of professionals and collaborate with various departments to ensure a safe, comfortable, and well-maintained work environment.Responsibilities:Develop and implement facilities management strategies, policies, and procedures to optimize the use of company resources and enhance productivity.\nOversee the maintenance, repair, and renovation of buildings, equipment, and systems, ensuring compliance with safety regulations and industry standards.\nConduct regular inspections of facilities and systems to identify maintenance needs, safety hazards, and operational inefficiencies.\nDevelop and manage budgets for facility operations, maintenance, and capital projects.\nNegotiate and manage contracts with vendors, suppliers, and service providers to ensure cost-effective and high-quality services.\nLead and supervise a team of facilities management staff, including hiring, training, and performance management.\nCollaborate with cross-functional teams and department heads to understand their facility-related needs and provide solutions and support.Skills",
    "Skills": [
        "Qualification and Experience:",
        "Bachelor's degree in facilities management, engineering, business administration, or a related field.\nProven experience in facilities management, preferably in a managerial or supervisory role.\nExcellent leadership and team management skills, with the ability to motivate and develop a high-performing team.\nExcellent communication and interpersonal skills, with the ability to collaborate effectively with individuals at all levels of the organization."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}