{
    "Job ID": "4734939",
    "Description": "Senior SAP IS-OIL/SD Consultant:Experience in SAP IS-OIL/SD module with proven experience in SAP IS Oil and Gas downstream, upstream as well as SAP S/4 HANA Implementation and Migration. The candidate will have 15+ years of experience which includes 03 end-to-end implementations. The experience must cover all aspects of the project life cycles executed via different methodologies (ASAP, roll out) that include but are not limited to those mentioned below.Key Accountabilities• Coordinate with business stakeholders to deliver detailed design, build, testing, and deployment, and governance within the assigned SAP scope, change requests, working with the onshore and offshore resources with agreed quality and timelines.• Recognized as the functional expert and go-to person within SAP IS-OIL/SD and integrated processes, having deep functional/business expertise. Understand cross-functional integration issues, and work with other team leads to develop appropriate solutions. Design, develop, and document complex operational and technical processes, functions, and procedures involving SAP IS-OIL/SD. Performs complex functional configuration, modification, and testing tasks involving complex components of SAP IS-OIL/SD.• Single point accountability for the ownership and ongoing maintenance of all Blueprints within the assigned SAP scope.• Ensure all proposed SAP IS-OIL/SD change requests follow the predefined company procedure. Ensure and maintain the operational integrity of the SAP solutions.• Assist businesses to develop efficient processes for Order to Cash processes using SAP best practices and proactively look for continuous improvement opportunities for domain processes. Commits to health, safety, environmental responsibility and sustainable development• Business blueprint preparation, configuration, testing, cutover planning and execution, preparing functional specifications documents for technical development, work hand-in-hand with technical team for the delivery of solutions.• Training/support end-users; in order to ensure effectiveness, stability, reliability, availability, and high performance of business applications, and enhance operational capability. Leads or participates in system implementation or upgrade projects.Skills",
    "Skills": [
        "Experience: 8+ years",
        "Location: Yanbu- Saudi Arabia",
        "Notice period: 30- 60 Days",
        "Technical Skills",
        "• Implementation and Troubleshooting experience in SAP SD functionalities: Master Data, Account groups, Pre-sales, Inquiry and Quotation, Sales, Shipping, complex F&A Pricing, Transportation, Foreign Trade, Billing, Sales Support, credit management, Account assignment, Purchase contracts, pricing, GR/IR, Integration of SAP with 3rd party interfaces, SAP integration via different communication methods, LSMW and master data upload.",
        "• SAP IS Oil is to cover the Nominations and ticketing for different processes (sales, purchase, stock transfers for pipeline and vessel operations), SPW, 3PW, Berth Planning Board, relevant TW master data, SAP TSW integration with other modules, HPM, SILO management, TD.",
        "• Having good exposure in SAP S/4 HANA Implementation (On-premise & Cloud) and Migration projects."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Yanbu, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}