{
    "Job ID": "4734200",
    "Description": "The main purpose why this position exists is to ensure the attraction (s) is operated with utmost attention to safety and exemplary presentation standards.Validate that the attraction has passed the Maintenance Daily Check.• Execute the pre-opening check list.• Maintain cleanliness and good order in the attraction area.• Welcome Guests and provide the safety information and any extra information they may request.• Complete the Guests load/unload process.• Manages the Grouping for the ride in relation to normal, single riders, Q Fast and VIP Q line guests.• Check the compliance of all safety regulation before running the attraction.• Participate as needed in the pre-show of the attraction.• Provides the first level answer to Guest complaints or escalate it to the Team Leader.• Escalate to Team leader / Ops Base any potential malfunction in the attraction.• Participate in the evacuation process in the assigned role.• Close the attraction in a safe mode as per the Operating standards• Replace temporarily the Team Leader when required and as assigned by Supervisor• Monitors the consumables (3D glasses ) and maintains and inventory for the same.• Adhere to the parks / attractions code of conduct, grooming and uniform standards.Skills",
    "Skills": [
        "Essential",
        "• Fluent in English",
        "• Excellent Guest and employee services skills.",
        "• Confident, Proactive and fun loving.",
        "• Ability to handle / interact with children.",
        "• Positive, enthusiastic and energetic attitude.",
        "• Adapt to a changing work environment.",
        "• Guest service; interacts in a positive manner and diffuses any negative guest situation following company protocols.",
        "• Pleasant personality with excellent communication skills.",
        "Desirable",
        "• Knowledge / Understanding of Arabic language and UAE culture",
        "• Background in hospitality industry.",
        "• Knowledge of computers (MS Office).",
        "• Strong interpersonal skills.",
        "• Fluent in Arabic",
        "• Fun loving. Cheerful and playful with children."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}