{
    "Job ID": "4734677",
    "Description": "Keep up-to-date data for all employees\nManaging and supervisor all duties of Government Relations Officer (GRO)\nPreparing all employee related application for GRO\nPaying all government payment/fee using Honeywell tools and company account\nProviding reports to the Government Relations Manager (GRM)\nFollowing up all traffic violation payment and clear it from company record.\nFollowing, renewal, maintain all company documents such CR, Saudization, GOSI, Tax etc.\nCommunicate with all employees and their management for all government requests.\nKeeping all documents required by governmental agencies while processing them, and submitting them to concerned employee\nCoordinate with all agencies for processing work visa\nCoordinate with HR and FL department and update them for new hiring status\nProvide report on monthly basis for all government relation processes\nPerforming other duties related to the job as assigned by GRM\nCoordinating with Staff regarding personnel issues related to governmental applications as required\nCommunicating with Governmental entities to issue licenses and other related documents as requiredSkills",
    "Skills": [
        "Diploma from Administration institute or equivalent\nA minimum of 5 years of experience in a related field\nProfessional Knowledge in Labor Office and Jawazat and Governmental Regulations\nProfessional knowledge of administrative procedures and policies applied at the Company\nProfessional knowledge of Governmental Procedures in issuing licenses and other related documents\nGood command of Arabic, and fair in English\nComputer Applications\nTime Management - Communication Skills\nConfidentiality - Interpersonal Skills\nProblem Solving - Follow up skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 8",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}