{
    "Job ID": "4734229",
    "Description": "Key AccountabilitiesDevelop Data Governance policies around: data lifecycle, data retention, model governance, regulatory reporting, business reporting, data documentation, data quality, metadata management, data classification.\nEnsure Data Governance policies are addressed to responsible units: business, IT, Operations, Risk, Compliance.\nDevelop Data Governance metrics and monitor them.\nMake sure Data Governance KPI’s are met within assigned domain.\nDocument Data Assets in Data Catalog, ensure Data Lineage is accurate.\nDiscover and document data in Source Systems. Assist Data Architects in developing Data Models.\nCommunicate with Source system owners, Project Management Office, Data Team and Business units to ensure documentation in Data Catalog is correct and up to date.Skills",
    "Skills": [
        "Key Competencies",
        "System or Business Analytics\nData Governance\nSoftware and Tools knowledge\nSQL – Advanced user (Stored Procedures, Window functions, Temp Tables)\nKnowledge (at least one of) Data Catalog solution is a plus: IBM WKC, Ataccama, Infomatica Axon or EDC\nStrong analytical and problem-solving skills and attention to details",
        "Required Experience",
        "Experience in Business and System Analysis\nUnderstanding of main Banking Systems and technologies.\nExperience in Data Governance or any Data related projects is a plus.\nUnderstanding of the process of creating the reporting.\nExperience in documenting requirements: BRD, FSD, testing plan etc.\nBABoK certificate is a plus\nDMBoK or DCAM certificate is a plus\nExperience in Finance/Banking is a plus\nExperience with data governance and data quality tools is a plus.",
        "Competencies",
        "Adaptability/Flexibility\nCreativity/Innovation\nDecision Making/Judgment\nDependability\nInitiative\nIntegrity/Ethics\nProblem Solving/Analysis",
        "Education",
        "Bachelor’s degree in Computer Science or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}