{
    "Job ID": "4734820",
    "Description": "Manage all of the screening resumes and applications by filtering them as per the requirements and shortlisting them.\nInterviewing candidates on the shortlist and maintaining a database of employees for future vacancies.\nArranging for interviews with the managers and setting a suitable time for them for the panel interview.\nWork with the recruitment team in organizing and administrating recruitment campaigns and programs to ensure the sourcing of applicants within the approved manpower forecast, internship program, and the company’s Saudization program.\nConsider Saudization and NITAQAT status in terms of recruiting Saudis.\nArranging job advertisements on the company career webpage and in various portals.\nPerform reference and background checks on applicants’ selection.\nKeeps records, metrics and compiles statistical reports concerning recruitments, interviews, hires, and transfers.\nFormulating detailed job descriptions and posting ads in various portals.\nPrepare various methods to evaluate candidates, including structured interviews, technical assessments, and behavioral questions. Sharing offer letters to candidates and negations on the package.\nOn-boarding of selected candidates and completion of registration in Government records.\nMaintaining Complete records regarding the Hiring Process. E.g., JDs, CVs, Offer letters, appointment letters, etc.Skills",
    "Skills": [
        "5+ years of experience as a Recruiter or similar role. (Mandatory).\nUniversity Degree in HR-related field, Psychology, Economics, or Engineering.\nExperience using LinkedIn Recruiter and other search engines and job boards and platforms, have an established candidate network.\nExperience in using an Application Tracking System (ATS), ideally a Workday.\nThe ability to develop strong working relationships and maintain work ethics.\nFluent in Arabic & English (Bilingual) (Verbal & Written).\nStrong communication and collaboration skills.\nAbility to manage a heavy volume of job requisitions and work in a fast-paced, ever-changing environment.\nExceptional sourcing skills.\nProactive and self-disciplined.\nEnergetic, enthusiastic, and confident.\nProficiency in Microsoft Office with demonstrated abilities in Excel.\nExpert level experience in multitasking with the ability to set priorities as per the given situation"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "Dammam, Saudi Arabia ; Eastern Province, Saudi Arabia ; Khobar, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}