{
    "Job ID": "4734870",
    "Description": "تخطيط المشتريات:\nوضع استراتيجيات شراء استنادًا إلى احتياجات الشركة وأهدافها التشغيلية وميزانيتها.\nتحديد الموردين:\nتقييم واختيار الموردين المناسبين بناءً على معايير الجودة والسعر والتوفر.\nتفاوض العقود:\nتفاوض شروط العقود والاتفاقيات مع الموردين لضمان شروط ميزانية معقولة وتوريد مستمر.\nإجراء المناقصات:\nتنظيم وإدارة عمليات المناقصات والعطاءات لاختيار الموردين المناسبين.\nإدارة العلاقات:\nبناء وتطوير علاقات مستدامة مع الموردين وتعزيز التواصل الجيد معهم.\nتحسين الأداء:\nتقييم أداء الموردين بانتظام وتطويرهم لضمان تلبية متطلبات الشركة.\nإعداد طلبات الشراء:\nإعداد طلبات الشراء ومتابعتها بما في ذلك المواد والخدمات المطلوبة.\nمراقبة المخزون:\nمراقبة مستويات المخزون وضمان توفر المواد المطلوبة دون تجاوز الحدود.Skills",
    "Skills": [
        "معرفة بالمشتريات والتوريدات: فهم عميق لأساسيات عمليات المشتريات وتوريد المواد والخدمات.\nمهارات تحليلية: القدرة على تحليل البيانات والمعلومات لاتخاذ قرارات استراتيجية تتعلق بالمشتريات.\nقدرة على التفاوض: مهارات تفاوض قوية للحصول على أفضل الشروط والأسعار من الموردين.\nإدارة العلاقات: القدرة على بناء والحفاظ على علاقات متينة مع الموردين والشركات المتعاونة.\nمعرفة بتكنولوجيا المعلومات: القدرة على استخدام أنظمة البرمجيات والتقنيات المعلوماتية المتعلقة بالمشتريات.\nإدارة الوقت: القدرة على التخطيط وتنظيم وإدارة الأوقات بشكل فعّال.\nمهارات التواصل: القدرة على التواصل بوضوح وفعالية مع الموردين وأعضاء الفريق الداخلي.\nمهارات القيادة: القدرة على قيادة وتوجيه فريق المشتريات وتحفيزه لتحقيق الأهداف.\nالقدرة على التعامل مع الضغوط: القدرة على التعامل مع الضغوط والمواقف الصعبة بشكل فعّال."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Electric Power Production & Transmission",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}