{
    "Job ID": "4734205",
    "Description": "·        To provide good service and promote merchandise and services and to attend to guest needs at the retail stores or carts. Ensure consistent housekeeping standards, merchandise display, stock replenishment, perform cashiering duties and maintain accurate stock control. To be able to work independently at the retail store or at the cart, and be able to work in an outdoor environment and be able to work on rotating shifts including weekends and public holidays.   Provide good service standards at all times\nGreet and initiate conversation with guest and understand guest needs\nAssist guests on their enquiries and helping them by going the extra mile\nEnsure that the store housekeeping, stock replenishment and merchandise display are carried out as a daily routine\nUnderstand store assortment mix\nMonitor store inventory movement & inform Store Management if there are irregularity in stock movement\nAssist other team members in a positive and professional manner\nWillingness to cross train as requested\nEnsure that Standard Operating Procedures (SOP) are adhered in accordance with company policies\nPerform all POS functions in an accurate and timely manner\nEnsures that Environmental, Health and Safety requirements are adhered\nLearn, Practice and Adhere all related safety procedure related to job and work area. Knowing and Following the advised restrictions and limitations in performing the job.\nEstablish and follow good housekeeping practices.\nFollow or establish safety procedures or avoiding working alone wherever possible. Hence, if inevitable, advise the Line Manager and know the alternative means to contact in case of emergency.\nProvide good service standards at all times\nGreet and initiate conversation with guest and understand guest needs\nPossess good product knowledge and selling skills\nAssist guests on their enquiries and helping them by going the extra mile\nEnsure that the store housekeeping, stock replenishment and merchandise display are carried out as a daily routine\nUnderstand store assortment mix\nMonitor store inventory movement & inform Store Management if there are irregularity in stock movement\nAssist other team members in a positive and professional manner\nWillingness to cross-train as requested\nEnsure that Standard Operating Procedures (SOP) are adhered in accordance with company policies\nPerform all POS functions in an accurate and timely manner\nEnsures that Environmental, Health and Safety requirements are adhered\nLearn, Practice and Adhere all related safety procedures related to job and work area. Knowing and Following the advised restrictions and limitations in performing the job.\nEstablish and follow good housekeeping practices.\nFollow or establish safety procedures or avoid working alone wherever possible. Hence, if inevitable, advise the Line Manager and know the alternative means to contact in case of emergency.\nAdhere to fire safety and emergency evacuation procedures, including assisting the guests when evacuating. By exercising the “duty of care”. As moral and legal obligation to protect the guests, staffs, contractors, vendors, suppliers, third party partners and all other persons within our care from harm or loss when they are exposed to our activities and using our services, with watchfulness, attention, caution, and prudence that a reasonable person in all circumstances would.\nFollow the use of equipment, machines and tools safely. Keeping all work areas clear of clutter.\nContribute to a healthy, illness-free work place by observing proper personal hygiene, high standard of cleanliness and observing consistent housekeeping like frequent hand washing to reduce the risk of common infections and cross contaminations.\nEnsure that fire exits are not blocked, and fire extinguishers are monitored and updated.\nEnsure a complete first aid kit and within easy access and advise Line Manager if it need a further first aid item.\nKnow how to report a hazard and a near miss to the Line Manager. Cooperate and resolve incidences involving oneself and persons within own’s control and influence, timely and accurately.\nFollow strictly the rules and regulations set by the company to protect the lives and welfare of the persons involved in the business processes, including the protection of property and environment from damages and other form of losses.\nCommit to safe systems of work by adhering to agreed processes that are put in place, which can include, but not limited to those in the approved manuals, policies, procedures and SOP’s and thus it shall be everyone’s responsibility to know and understand thoroughly these systems and processes, execute properly an avoid short cut.\nProvide, as far as reasonably practicable, the highest level of protection, against harm or loss from hazards and risks to health, safety and welfare, of oneself and of the persons working under own’s authority.·        Any other duties as may reasonably be requested by the management teamSkills",
    "Skills": [
        "Essential",
        "·        Effective oral and written communications skills in English",
        "·        Ability to calculate simple mathematics and collect different modes of payment accurately",
        "·        Possess good interpersonal skills for interacting with people",
        "·        A team player and have the ability to meet assigned targets",
        "·        Multi-tasking",
        "Possess good product knowledge and selling skills",
        "Desirable",
        "·        Ability to communicate in Arabic",
        "·        Has good selling skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}