{
    "Job ID": "4734082",
    "Description": "As a Senior Accountant, you will play a crucial role in managing financial operations and ensuring accuracy and efficiency in our accounting processes. YoResponsibilities:Manage accounts payable processes, including vendor invoice verification, recording and processing invoices, and coordinating payments.\nOversee petty cash management, including reconciling and replenishing petty cash funds, and maintaining accurate records.\nConduct inventory control activities, such as monitoring stock levels, performing regular audits, and reconciling inventory records.\nPrepare and review bank reconciliations to ensure accurate and timely processing of financial transactions.\nCollaborate with internal departments to resolve any accounting discrepancies and ensure accurate financial reporting.\nAssist in month-end and year-end closing procedures, including preparing financial statements and supporting schedules.\nParticipate in financial audits and provide necessary documentation and information to auditors.\nStay updated with relevant accounting regulations, standards, and best practices to ensure compliance.Skills",
    "Skills": [
        "Qualification and experience:",
        "Bachelor's degree in Accounting, Finance, or a related field. Professional certifications (e.g., CPA, ACCA) are preferred.\nProven work experience as a Senior Accountant or similar role, preferably in a facilities management or related industry.\nProficient in using accounting software and MS Office applications, particularly Excel.\nStrong analytical and problem-solving skills.\nStrong communication and interpersonal skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}