{
    "Job ID": "4734057",
    "Description": "The Photographer position will be responsible for creating visual content for the app/web through high-quality images that will best represent the product. In eCommerce, photographers are an integral part of capturing and communicating the company’s visual and commercial identity. This is a highly operational full-time role that includes elements of photography, production efficiency, and quality control. Follow up Boutiqaat objectives and be keen on the organization's mission and vision to inspire suitable ideas. \nImplement plans and execute it referring the competitive and audience interest to enhance levels of audience engagement.  \nOversees brand standards, lighting technique, and image quality. \nExecutes standard photography operation procedures including image editing techniques, tools, processes, and guidelines. \nProduce all product related studio photography for the app/web  \nArchives images and organizes files. \nDrives towards continuous improvement and creative solutions. \nProvide a clear image of product as per standards and expectations for attracting the customers. \nEnhance the subject’s appearance with natural or artificial light. \nProducing a high-quality image that implies high quality product, creating a good first impression of your brand  \nCreating excellent photos that are of high commercial quality and ensuring products are launched online in a timely manner  \nUtilizes up-to-date knowledge of product shoot trends and photography/imaging technology to enhance product photo presentation. \nComing up with innovative and creative ideas for product photoshoots.  \nPerform postproduction photo retouching and editing- clean and edit products through Photoshop.  \nDeliver products in a timely manner and adhering to given deadlines.  \nKeeps equipment up to date, organized, and maintained.  Skills",
    "Skills": [
        "Bachelor’s degree in marketing, photography, or art preferred. \nPrevious experience in Photography, Product photography, Fashion Photography, ECommerce Photography. \nExcellent portfolio, driven and motivated to create excellent photos that are of high commercial quality.  \nExcellent technical knowledge and expertise in Photoshop and other photo editing tools and programs.  \nDetailed knowledge of photography art and lighting. \nStrong creative presence and artistic flair. \nPassionate about E-commerce photography with a creative eye with the ability to capture. products in the best way possible through lighting, styling, and composition. \nAble to follow instructions clearly to achieve desired results. \nAble to stand and move around for long periods at a time. \nFlexible to work on different locations as required of the job. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Perfume & Cosmetics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}