{
    "Job ID": "4734208",
    "Description": "Key responsibilities of this position are to provide leadership of pre-commissioning activities. He/She will lead the development and implementation of the Pre-commissioning plan for project. On a day-to-day basis, Pre-Commissioning Manager will collaborate with Air Products Construction and Contractor team members, to ensure that the pre-commissioning activities are progressed. Specific Job Functions of this position are:Leads and executes the Pre-Commissioning activities.\nReview and familiarization of Company required scope of work, drawings, project specifications and standards related to Pre-Commissioning work and handover scope.\nPrepares and generates the pre-commissioning procedures for the project.\nLead the development of Pre-Commissioning method statement, including overall philosophy.\nAssist in the development of documentation or Dossier\nComply to Company policies and rules and safety requirements.\nAccountable for all Pre-Commissioning activities under his / her control are duly performed in accordance with the stated procedures, in conformity with the safety rules and as per the project requirements.\nBe responsible for the supervision of the Pre-commissioning internal and Subcontractors resources and to co- ordinate the specific work scopes\nIdentify the Pre-Commissioning personnel, equipment, and consumables, philosophy for assigned scope.\nPrepare scope of work and Material Requisition (MR)/Service Requisition (SR) documents.\nFollow-up with awarded subcontractor (daily), review/approval of Pre-Commissioning subcontractor project specific procedures, equipment spread, and ensure compliance with the required scope of work and specifications\nLead all Pre-Commissioning internal and external technical interfaces with project team, Pre-Commissioning Subcontractors, Client, and Third-Party Contractor. Report on status of work, potential delays, problems, and so forth.\nAttend and participate in project risk analysis meetings, constructability reviews, sessions, operation readiness review, and safety workshops, covering Pre-Commissioning activities as required\nManage all Technical Queries (TQ) and Non-Conformance Reports (NCR) related to Pre-Commissioning scope. Providing technical justification for Technical Queries (TQ) and Non-Conformance Reports (NCR) and ensure the TQs and NCRs are addressed / closed out.\nEnsure as-built documentation is received, review and close-out per schedule.\nCompile and present to department lesson learned for Pre-Commissioning activities on the project.\nProvide formal and informal reporting of progress and status.Skills",
    "Skills": [
        "Previous experience managing Pre-Commissioning on capital construction projects in the $1B range\nDemonstrated leadership and strong interpersonal skills\nLeadership of both construction engineering and site construction teams\nAbility to communicate at all levels of the organization at construction site\nExperienced in in the full cycle of construction activities from development through production. \nProven Record of success in safety, environmental, quality, employee involvement, team building, and diversity.\nConstruction, engineering, or management university degree or equivalent experience\nMinimum of 15 years construction and engineering experience\nFive (5) or more years of Pre-Commissioning Manager experience or equivalent"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15 Max: 20",
        "Residence Location": "All Arab Countries; All GCC Countries; India",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas; Construction & Building",
        "Company Type": "Recruitment Agency",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}