{
    "Job ID": "4734684",
    "Description": "Contract Coordinator- 6 months Temporary contractJob Purpose:This role is responsible for providing administrative support in performing procurement of\ngoods and services to end-users consistent with existing procedures and policy in a cost\neffective and professional manner to protect Company interests. They support the\nformalities of executing and completing Contracts Awarding, Addendum and Renewal\nrequirements and ensuring proper approval documents are complete from pre-contract\nthrough post-signatures phases, database maintenance and reporting. Responsible for\nassisting in Periodic Vendor Performance Evaluation and Reporting. They also participate in\nthe developments of system and procedures towards simplification of work process,\nautomation and process re-engineering.Accountabilities:Policy and Procedures:▪ Make awareness of and perform in accordance with the Company’s establishedpurchasing policies and procedures. Participate and provide input to the review ofexisting or establishment of new procedures.• Contract & Vendors Data Analysis:▪ Provide support to the team with statistical data / analysis and help them tocontinually monitoring the processes.▪ Supplier Co-ordination.▪ Supplier Performance:Responsible for coordinating with the business in obtaining the feedback on theperformance of the Strategic Suppliers on an annual basis and summaries the samefor management review.• Responsible for co-ordination with the business in obtaining the feedback on theassigned contracts for renewal in accordance to the Procurement Procedures▪ Responsible for co-ordinating with the Supplier for contract renewal / formalisationas assigned▪ Support in preparation of the approvals for the contract renewal.▪ Responsible for database maintenance by updating and uploading of necessarycontract documents and SLA reporting.Counselling Meeting:▪ Support the Contract management team in arranging the counselling meeting inco-ordination with the business and the Vendor.▪ Responsible for updating of the SLA database related to counselling meeting▪ Reporting.▪ Responsible for the maintenance of the necessary contract documentationphysically and in the system.▪ Responsible for providing necessary contracts related documents to business /audit as and when required.▪ Provide necessary reports as may be required by the management in relation to theContracts and Supplier performance• Assistance to Superiors:▪ Perform related duties as assigned by superiors to enable achievement ofcompany’s targets and programs.• Development of Systems:▪ Carry out studies towards the simplification of work procedures through processredesign and automation. Co-ordinate with IT in developing new reports to enhancedata analysis capability for GPC and involve in testing of system/oracle in case ofany system upgrade.Training Responsibility:▪ Participate in the on-the-job training of trainees and newly hired personal withinthe Section to ensure that they develop the necessary skills to independently carryout the assigned procurement activities.Management System (Quality, Environment, Health and Safety):▪ Comply with all relevant ENOC Management Systems procedures in respect toQuality, Environment, Health and Safety.Skills",
    "Skills": [
        "Minimum Requirement:",
        "Qualifications and Experience:",
        "▪ Bachelor’s Degree in Science or Business Administration from accredited",
        "institution.",
        "▪ 3-4 years direct and relevant experience in a procurement function within and",
        "oil/gas or petrochemical industry.",
        "Skills :",
        "▪ Knowledge of internal processes, standards, policies and procedures",
        "▪ Professional and Technical Expertise",
        "▪ Ability to communicate effectively in written and spoken English",
        "▪ Ability to operate standard computer software applications",
        "▪ Knowledge of basic finance",
        "▪ Knowledge of technical terminology in use at process plants (Process Knowledge)",
        "▪ Knowledge of market practices and sources of supply and commercial laws",
        "▪ Ability to conduct market data collection",
        "▪ Knowledge in supply logistics",
        "▪ Ability to suggest technically equivalent alternative proposals",
        "Behavioral Competencies :",
        "▪ Service Orientation",
        "▪ Commitment",
        "▪ Integrity",
        "▪ Communication",
        "▪ Information Seeking",
        "▪ Achievement Drive",
        "▪ Teamwork",
        "▪ Developing Expertise",
        "▪ Analytical Thinking"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}