{
    "Job ID": "4734891",
    "Description": "Primary Duties and Responsibilities:Provide Company oversight of the Onshore Project EPC Contractors' operation and maintenance of their construction camps (>30000 pax) with the objective of ensuring the provision of robust camp management systems, acceptable living standards, properly delivered camp worker welfare and compliance with international and Qatar standards.\nSupport the monitoring of the operation and maintenance of camp’s operated by third parties, both inside and outside of RLIC environment, that will house a circa 5000 EPC Contractor personnel.\nDevelop reporting on areas of concern, non compliances with contractual obligations and corrective actions required in Contractor camps, offsite camp locations and site mess halls.  \nEnsure Camp Operators implement and sustain Safety and Quality programs relevant to operations and maintenance activities including adherence to industrial hygiene standards.\nSupport the Camps Operations and Maintenance Head overseeing and stewarding all camp services / operations, including development and management of camp management systems, activities and programs, by the EPC Contractors and their sub-contractors.Skills",
    "Skills": [
        "Qualification: Bachelor's",
        "degree in Humanities or Business or equivalent experience in senior management position of workers camps.\nMinimum of 10 years’ experience in management, operations and maintenance of industrial workers camps (construction, O&G, mining etc). Ideally have direct experience in camp administration / camp boss with experience in implementation of HACCPS."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}