{
    "Job ID": "4734972",
    "Description": "Oracle Developer position works independently to develop, implement, and maintain complextechnology solutions. This position, with minimal supervision, is responsible for leading programmingactivities related to business applications including the analysis, design, development, testing, andimplementation of computer software systems and/or enhancements that meet business needs andrequirements.• Accountable for planning, designing & implementing application architecture and integrationrequirements for business applications for the group.• Develop PL/SQL database objects, SQL scripts, interfaces, reports, and forms using standard toolsincluding Oracle Forms, Report Builder, Oracle Application Framework, BI Publisher/Smart View/ FRS• Ability to design ETL unit test cases and debug ETL Mappings Expertise in developing Load Plans,Scheduling Jobs Ability to design data quality and reconciliation framework• Hands-on experience in complex SQL, PL/SQL, report development experience with Oracle Fusiontables, views, and setups, Fusion APIs, FBDI, ADF DI Loads, BIP, and OTBI Reports• Work with functional consultant in reviewing business requirement documents (BRD) and translate intotechnical specifications to independently develop, modify and maintain complex software products• Leads design/code reviews, architecture design and infrastructure reviews for larger projects.• Analyse business needs utilizing a structured requirements process (gathering, analysing, documenting,and managing changes) on the technical/integration requirement.• Owner of all integration project lifecycle of the organization's business applications, includingmanagement of scope and business requirements technical specifications, testing, user applicationtraining (UAT), implementation, deployment, and post-go-live end-to-end efficient application support.• Manage enhancements, integration solutions, and support across the organization to ensure ultimateefficient operations.• Work with senior and department leadership to identify and implement business process improvements.Proactively and consistently identify and manage project-related issues, and risks, and mitigate scopechanges, ensuring that all project objectives are attained• Directly interacts with internal team, vendors, business users and manages customer expectations.Skills",
    "Skills": [
        "Bachelors/master’s degree in computer science or a related field.",
        "• Solid experience on platform cloud components to Oracle Fusion, EBS and install base including OACS,",
        "OICS, SOACS, DBCS, – including PaaS for SaaS.",
        "• 8+ years’ experience as technical consultant in software industry.",
        "• Good In debugging skills with the integrations of custom tools.",
        "• Candidate should have at least minimum 2 end to end implementation projects.",
        "• Hands-on, expertise in the Oracle ODI toolset and Oracle PL/SQL, knowledge of ODI Master and work",
        "repository, knowledge of data modelling and ETL design.",
        "• Experience in creating and consuming SOAP/REST Webservices using JSON, and XML,",
        "• Knowledge of JavaScript, HTML, and CSS (SCSS) would be an added advantage.",
        "• Hands-on, expertise in the Oracle ODI toolset, knowledge of ODI Master and work repository,",
        "knowledge of data modelling and ETL design."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$5,000 - $6,000",
        "Number of Vacancies": "1"
    }
}