{
    "Job ID": "4734273",
    "Description": "We are seeking an experienced building designer, drafter, Architect, Engineer or Project Manager candidate to join our team. The applicant will learn to manage the design aspects of residential and commercial projects.Based in Sydney, Australia, however, the job is working from home. Our office is currently working on, commercial projects, including shop fitout. This role will consist of working across diverse project types and involvement throughout all project stages.Collaborating with senior architects and engineers to develop project plans and specifications.\nCreating 2D and 3D models and design concepts using computer-aided design (CAD) software.\nAssisting in the preparation of design documents, construction drawings, and project schedules.\nConducting research on building materials, codes, and regulations to ensure compliance with industry standards and best practices.\nParticipating in meetings to develop a strategy to manage the design and approval process. Communicating with contractors, vendors, and clients to ensure project requirements are met and deadlines are adhered to.\nAssisting in the construction administration phase of projects, including reviewing submittals and shop drawings, attending site meetings, and conducting field inspections. Skills",
    "Skills": [
        "We are looking for someone who has an artistic flare, is design-orientated, technically skilled, strong English skills, and is engaged in their work.\nDocumentation experience and relevant examples will be highly regarded.\nThis position offers the opportunity to join a growing design team as we shape the future of the practice."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Architecture; Project & Construction Planning; Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "3"
    }
}