{
    "Job ID": "4734165",
    "Description": "Salesperson:Sell store products excellently and provide advice to customers to meet their needs.\nBuild strong relationships with customers, enhance trust, and brand loyalty.\nWork towards achieving sales goals and maintaining excellent service standards.\nMaintain cleanliness and organization of the display area and clean products.Cashier :Welcome customers with a smile and provide friendly and efficient service.\nHandle payment and transaction processes accurately and swiftly using the cashier system.\nRecord transactions precisely and ensure accurate account settlements.\nAdhere to security policies and procedures, verifying customer identities when necessary.Work Hours: 5 hours per shift.Staffing: 1 employee per shift, ensuring continuous coverage.\nShifts: Two shifts are established to cover the work hours effectively.\nDay Off: Friday is designated as the only day off.\nRotation: The two employees alternate working on Fridays each week.\nSchedule: One week, the first employee works on Friday. The following week, the other employee works on Friday.Skills",
    "Skills": [
        "High school diploma at a minimum.\nPrevious experience (1+ years) in sales and/or cashiering.\nExcellent communication skills and the ability to communicate politely with customers.\nNumerical proficiency.\nAbility to work quickly and efficiently in a multitasking environment.\nCommitment to personal hygiene and a suitable professional appearance.\nQuick learning and acquiring knowledge about provided products and services.\nFlexibility in dealing with technology and cashier systems.\nDedication to the highest service standards to create a positive customer experience."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Fashion & Apparel",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}