{
    "Job ID": "4734076",
    "Description": "Responsibilities: Government RelationsEstablish and maintain positive relationships with government agencies, including labor departments and regulatory bodies.\nStay updated on labor laws, regulations, and compliance requirements and ensure the organization's HR practices align with them.\nCoordinate and manage the process of obtaining necessary permits, licenses, and certifications as required by government authorities.\nServe as a liaison between the organization and government agencies, addressing any HR-related matters. Manpower Supplier ManagementCollaborate with manpower suppliers to ensure timely and efficient sourcing of temporary or contract workers.\nOversee the selection and onboarding process of manpower suppliers, ensuring compliance with company policies and procedures.\nMonitor the performance and service quality of manpower suppliers, ensuring alignment with agreed-upon contractual terms.\nMaintain accurate records of manpower supplier contracts, invoices, and related documentation. HR ComplianceEnsure compliance with labor laws, regulations, and reporting requirements, both locally and nationally.\nStay informed about changes in labor legislation and communicate updates to relevant stakeholders. Employee RelationsServe as a resource for employees, addressing questions, concerns, and conflicts.\nAssist in resolving employee relations issues and mediating conflicts.\nProvide guidance on employee disciplinary actions and performance improvement plans. HR Data Management and ReportingMaintain accurate employee records and HR information systems.\nEnsure data privacy and security in accordance with applicable regulations. Employee Engagement and CultureSupport employee engagement initiatives, such as surveys, events, and recognition programs.\nContribute to fostering a positive work culture and promoting employee satisfaction.\nCollaborate with management to address employee needs and improve employee experience. HR Projects and InitiativesParticipate in HR projects, such as policy updates, process improvements, and HR system implementations.\nStay updated on HR trends, best practices, and legal developments.\nContribute to the continuous improvement of HR programs and processes. Skills",
    "Skills": [
        "Qualification and experience:",
        "Bachelor’s degree in Human resources, Business Administration, or related field.\nMinimum of 2 years of experience in Human Resources, Government Relations, or a related field. \nComprehensive understanding of local and national labor laws."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}