{
    "Job ID": "4734824",
    "Description": "Position Title: Administrative OfficerEmployment Type: Full Time Salary: up to 8K AED all-inclusive, depending on experience and qualificationsJob Location: Dubai, UAEAbout the Client: One of the most innovative and successful automotive accessory developers in the UAEJob Description:Maintain and monitor the timely renewals of various Lease Agreements, Trade Licenses,Membership Certificates, AMCs, company vehicle renewals and insurances.Prepare documents for Easy 2 approvals (Vehicle Expenses, Insurances, AMC’s, Leases, Trade Licenses, and new assets).\nMaintain vehicle expenses and associated repairs.\nResponsible for purchasing and monitoring of office and warehouse office supplies, stationaries, furniture, office equipment, etc.\nUpdate documents and files within the Admin Archive.Skills",
    "Skills": [
        "Qualifications:",
        "Open to European nationals\nFemale, 35 years old and below\nBachelor’s Degree in Business Administration, Office Management, or any related field\nAt least 2 years’ experience in handling daily office management and administrative tasks\nMust have a solid knowledge of office procedures\nMust have experience with office management software like MS Office (MS Excel and MS Word)\nStrong organization skills with a problem-solving attitude.\nExcellent written and verbal communication skills (English)\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}