{
    "Job ID": "4734093",
    "Description": "Roles & Responsibility:Skilled technical work in the maintenance, repair, replacement, and installation of heating, air conditioning and refrigeration equipment, controls and distribution systems.Installs, troubleshoots and repairs heating, air conditioning and refrigeration units, including chillers, boilers and heat pumps.• Troubleshoots malfunctioning heating, air conditioning and refrigeration systems to determine the cause of the malfunction• Performs scheduled maintenance inspections, and adjusts, cleans and calibrates various systems to assure proper system operations.• Repairs wiring and electronic components associated with automated building management systems.• Replaces expansion valves, compressors, motors, coil units and other component parts.• Cleans refrigerant systems from hermetic burnouts, evacuates, and charges systems.• Troubleshoots and repairs direct digital and pneumatic control systems.• Checks distribution systems for proper velocity, volume, temperature, pressure, etc.• Balances air and water treatment systems.• Determines cause of and corrects condensation problems.• Provides technical assistance with the design of HVAC systems including installations and modifications to existing systems.• Assists in training other technicians and staff in preventative maintenance of HVAC systems.• Prepares records and reports describing procedures, actions taken and recommended solutions.• Responds to emergency service requests.Skills",
    "Skills": [
        "• Knowledge of pertinent rules and regulations, guidelines, safety orders, departmental operating procedures and safety regulations sufficient to insure that work is performed in compliance with applicable law.",
        "Skills:",
        "Your skills and experience:",
        "• Thorough understanding of maintenance of HVAC systems",
        "• Strong communication skills.",
        "• Excellent command of English language (written and oral).",
        "• Well-developed fault finding skills.",
        "• Ability to reach appropriate solutions to breakdown and defects.",
        "• Understanding of Health and Safety requirements.",
        "• HVAC technician diploma.",
        "• Previous experience in maintaining, repairing, replacing and installation of HVAC systems."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}