{
    "Job ID": "4734819",
    "Description": "Property Sales Advisor is responsible for communicating the benefits of a company’s services in order to drive sales. Property Sales Advisor serves as the point of contact between the business and its prospects or clients and have a range of responsibilities including identifying prospective customers while supporting existing clients with information and assistance that relates to services.Present, promote and sell services using solid arguments to existing and prospective customers.\nPerform cost-benefit and needs analysis of existing/potential customers to meet their needs.\nEstablish, develop, and maintain positive business and customer relationships.\nReach out to customer leads through cold calling.\nAchieve agreed-upon sales targets and outcomes within the schedule.\nCoordinate sales efforts with team members and other departments.\nAnalyze the territory/market’s potential, and track sales, and status reports.\nSupply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.\nKeep abreast of best practices and promotional trends.\nContinuously improve through feedback.Skills",
    "Skills": [
        "Proven experience as a Property Sales Advisor or similar position\nOutstanding selling communication and negotiation abilities\nPrioritizing, time management, and organizational skills\nAbility to create and deliver presentations tailored to the audience's needs\nRelationship management skills and openness to feedback\nHighly motivated and target driven with a proven track record in sales\nA results-oriented approach\nAbility to work under pressure\nProficient in English, Arabic.\nRussian speakers will be a privilege.\nWorking knowledge of MS Office."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Business Consultancy Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}