{
    "Job ID": "4734118",
    "Description": "Responsibilities:Design and Development: Design and develop innovative and efficient mechanical products and systems based on client requirements and industry standards.\nAnalysis and Testing: Analyze mechanical systems using modeling, simulation methods, and conduct tests to verify their performance.\nPerformance Enhancement: Improve the performance of existing mechanical products and systems by developing enhancements and modifications.\nProduction Guidance: Provide technical guidance and assistance to production teams for manufacturing products sustainably and with high quality.\nDocumentation Preparation: Prepare technical drawings, documentation, and test reports to support manufacturing and assembly processes.\nInnovation: Develop new and creative solutions to enhance performance and meet customer requirements.\nProject Management: Manage mechanical projects from planning to execution and monitoring.\nMaintenance and Support: Provide technical support and solutions for maintenance and mechanical issue resolution.\nCompliance and Safety: Ensure designs and products comply with industry standards and safety guidelines.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Education: Bachelor's degree in Mechanical Engineering or a related field. Higher qualifications or relevant professional certifications are advantageous.\nTechnical Knowledge: Deep understanding of mechanical engineering principles, design, and analysis.\nModeling and Simulation Skills: Proficiency in using modeling and simulation tools to analyze the performance of mechanical systems.\nCommunication Skills: Excellent communication skills to interact with team members, clients, and collaborators.\nProblem-Solving: Ability to analyze complex challenges and develop logical and effective solutions.\nCreativity: Ability to think creatively and develop innovative solutions.\nProject Management: Experience in project management and the ability to work within schedules and budgets.\nSafety Understanding: Strong understanding of safety principles and compliance with relevant guidelines."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}