{
    "Job ID": "4734791",
    "Description": "The Library Assistant is responsible for assisting the Librarian and is supervised and evaluated by the AISA Librarian. The Library Assistant will perform all duties associated with his/her position at such times and places as the Librarian or school administration may direct. The duties and responsibilities of the Library Assistant will include but not be limited to the following:SPECIFIC DUTIES● Check materials in and out for all library patrons.● Offer assistance to library patrons on library databases.● Prepare, update and adjust as required, database of staff, students and faculty.● Add new materials to the catalogue database making adjustments as necessary.● Prepare new materials for adding to collection including stamping, covering, and labeling.● Daily shelving of returned materials.● Shelf reading to maintain collection in orderly manner.● Yearly online input of new orders.● Minor repairs of materials.● Yearly inventory of collection and required monthly reports.● Overdue notices for staff and students throughout the year.● Bring monies for lost materials to accounts office and obtain receipts.● Maintain lost materials file and generate end-of-year print out.● Maintain library web page.● Search magazine articles in the online database.● Reconcile invoices against library budget.The foregoing statements describe the general purpose and responsibilities assigned to this job and are notan exhaustive list of all responsibilities and duties that may be assigned or skills that may be required.Skills",
    "Skills": [
        "Excellent IT skills and knowledge of library databases.\nPreference for a Bachelor’s degree in Library Science.\nA Bachelor of Library Science (B.Lib.Sc) degree is preferred.\nPreference to applicants with a B.Lib.Sc degree."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}