{
    "Job ID": "4734776",
    "Description": "Field Contract Administrator (FCA) is the primary focal point for day to day interaction with contractors. Their primary job function is field management of contractors. The FCA serves as the primary liaison with contractor personnel while on-site work is in progress.Support End User in creating the SoWArrange and jointly review the Bid Offers alongside the End User and Safety departmentSupport Area Owner / End User to ensure the Contractor has welfare facilitiesArrange and run the pre-job meetings alongside the relevant end user, SCM, Safety and ContractorLiaise with End User, SCM & HSD to ensure the site specific induction is completedMaintain a file for the Contractors working in their specific area (Competency checks, HSE File)Support End User in preparation of JMS & JSA for Permit-to-Work (PTW).Ensure Contractors are reporting to him each day and managing any issues that arise (change of manpower, equipment issues, unauthorized jobs, etc)Monitor and audit the ongoing work for Safety, Cost, Schedule, QualityReview with End User and ensure the SRN is completed on time as per the job completionEnsure the Contractor safety feedback form has been completedSingle point of contact for Contractor issuesLiaise and closely work with existing Contractors to ensure smooth operationAvoiding/Resolving issues arising out of (a) more than one contractor working at site or (b) more than one activity handled by single contractor. Ensuring that the contractor:Meets all Safety, Health and Environmental requirements including obtaining permits, providing Material Safety Data Sheets, monitoring environmental controls, etc.Follows the scope of work.Meets all work specifications and safety standards.Ensures all incidents are reported and participate in the investigations.Provides satisfactory quality of work.Maintains proper housekeeping.Skills",
    "Skills": [
        "8 and above in industrial sector / oil & gas"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Business Consultancy Services; Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}