{
    "Job ID": "4734735",
    "Description": "The Hostess has to check that any guest coming in is directly taken care of and welcomed as soon as arrived.\nGuide guests to their tables and make sure to explain about the food concept and brand and answer any question with professionalism.\nMake sure to introduce the guest to his/her supervisor for the night and move the communication for her from them. To offer a personalized service it is best to call a guest by his name and therefore a memorization of the guest’s names is necessary.\nMakes sure before the service, that the welcoming area is set and clean and that her table plan matches the sections.\nHave to know the floor plan perfectly.\nHostesses are responsible for training and assisting new Hostesses. Ensure that personal grooming and uniform is to the required standards.\nPromotes image of the brand by displaying impeccable manners, diplomacy and strategy towards our outlet, guests and the management.\nGuest satisfaction is one of the main goals!\nInforms the reservations manager in any case of maintenance problem or malfunction.\nResponsible for filling table reports in the end of operation.\nAttends briefings, training sessions and weekly meetings.\nDeals with complaints or special requests and reports it to the management even if the problem is fixed.\nAlways keep a positive smile and professional classy body language at work, especially when dealing with guests.Skills",
    "Skills": [
        "Able to handle money accurately and operate a point-of-sale system.\nStrong ability to maintain a positive, friendly attitude while delivering top-notch customer service in a fast-paced environment.\nExcellent teamwork skills, with the ability to support and communicate effectively with all members of the restaurant staff.\nStrong interpersonal skills and the ability to work effectively with diverse teams, even in high-stress situations."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}