{
    "Job ID": "4734783",
    "Description": "We are seeking experienced Digital Product Managers with a strong background in corporate banking, business finance and investment products to join our dynamic team. As a Digital Product Manager, you will be responsible for working on the development and enhancement of our digital products & processes in the corporate banking, business finance and Advisory space. With your deep knowledge of banking products, industry expertise, and digital technologies, you will play a key role in shaping our digital product strategy and delivering exceptional user experiences.2. Key Responsibilities – list what the person will be doing on a day-to-day basis:1. Develop and execute the Client digital product roadmap for corporate banking and investment products, aligned with the overall business strategy.2. Drive Squads, and collaborate with cross-functional teams, including technology, design, marketing, and business stakeholders, to define product requirements and prioritize feature development.3. Conduct market research and analysis to identify customer needs, industry trends, and competitive landscape, translating insights into actionable product strategies.4. Define and refine product features, user flows, and user experience (UX) design to ensure intuitive and seamless digital experiences. Good to have.5. Work closely with engineering teams, providing clear product requirements, user stories, and acceptance criteria, and overseeing the product development lifecycle.6. Monitor product performance and analyze user data to identify areas for improvement and optimize user engagement and satisfaction.7. Stay updated about emerging technologies, industry regulations, and market trends to proactively identify opportunities and drive innovation in our digital product offerings.8. Collaborate with sales and marketing teams to develop go-to-market strategies, product positioning, and promotional materials to drive product adoption and revenue growth.9. Provide product training and support to internal teams, including sales, customer support, and relationship managers, ensuring they have the necessary knowledge and tools to effectively promote and support the digital products.10. Act as a Squad lead & subject matter expert, representing the digital product portfolioSkills",
    "Skills": [
        "1. At least 5 yrs. Experience in Banks or Banking Product companies, in bachelor’s degree in business, finance, computer science, or a related field. MBA or advanced degree is a plus.",
        "2. At least 3 years of experience as a Digital Product Manager or consultant, with a focus on corporate banking, business finance and Advisory products.",
        "3. Strong understanding of corporate banking and Advisory products, including cash management, trade finance, treasury services, capital markets, and asset management.",
        "4. Proven track record of successfully delivering digital products in a fast-paced and dynamic environment.",
        "5 - experience in corporate banking and Advisory products, including cash management, trade finance, treasury services, capital markets, and asset management"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}