{
    "Job ID": "4734895",
    "Description": "Expectations:Accountable for the safe and effective supervision / execution of the Lifting and Rigging work scope, in adherence with Project HSEQ safety targets, procedures and practices.\nDemonstrate high profile visible safety leadership by example and communication with teams.\nAct as the site / Project responsible person representative (focal point) for all technical issues relating to Lifting, Rigging, and moving loads.\nProvide safe systems of work for all activities associated with lifting and moving loads to ensure that all lifting operations can be carried out efficiently without risk to safety and in accordance with UK Statutory Regulations and the Client / corporate standards.\nAct as the site / Project focal point for all technical matters relating to the specification, procurement, and the Integrity Assurance process of all items of Lifting Equipment on the site / Project.Key Aims & Objectives:Ensure all Project / Company HSEQ goals are achieved and where possible exceeded.\nEnsure all Lifting and Rigging personnel are aware of safe working practices / procedures and are provided with a safe working environment.\nEffective liaison with any Client and / or Sub-Contractor / Vendor representatives.\nDeliver a high standard Lifting and Rigging service to the Project, ensuring a consistent and efficient approach is implemented at all times.\nImplement a continuous improvement philosophy across all Lifting and Rigging activities, delivering best practices at all times.\nManage, support, and develop Lifting and Rigging personnel.Prime responsibilities and duties:Plan, supervise and support day-to-day Lifting and Rigging activities / personnel in the safe and structured delivery of the work scope and processes, ensuring all applicable site / Project safety procedures are fully and properly implemented.\nEnsure Lifting and Rigging personnel are competent and possess the required skills - liaise with the Project Safety Representatives to ensure that all personnel have been adequately trained.\nActively participate in all Company and Project safety initiatives.\nResponsible to the Construction Manager for providing the assurance through technical audit that the management, control, and execution of lifting operations are in compliance with the Statutory Regulations, the Clients Lifting Standards and procedures, and where applicable, the Corporate Lifting standards.\nEnsure that all necessary regimes, standards, processes, and procedures for the activities associated with lifting and moving of loads are established and are being suitably applied to provide assurance that all lifting operations are properly planned by competent people, risk assessed, appropriately supervised, and completed within the boundaries of a safe system of work.\nProvide technical guidance and support to the site Lifting and Rigging Team to ensure all lifting operations are implemented safely and efficiently and in accordance with LOLER and BSEN technical standards and any other applicable Project specific lifting standards.\nCustodian for the management of change process for lift plans, ensuring all changes to lift plans are formally documented, evaluated and where applicable endorsed by the appropriate technical authority(s). All changes to lift plan must be endorsed by the Appointed Person.\nReview and endorse all lift plans developed by the site / Project rigging function and those of 3rd party contractors and Specialist Sub-Contractors / Vendors.\nEnsure that the technical integrity of all lifting equipment used on the site / Project is continually assured thorough the performance of regular lifting equipment inspections are carried out in accordance with the requirements of LOLER and where applicable, the Assets Written Scheme of Examination (WSE).\nReview / approve any Sub-Contractor / Vendor lift plans and risk assessments.\nLiaise with Construction Engineers to identify Site Queries.\nDevelop and submit Construction activity permitry, lift plans, method statements and risk assessments in line with client gate criteria procedures / schedule.\nEnsure that all Lifting and Rigging work is to the required standard and that all drawings, specifications, inspections and certifications and Company systems of quality assurance are strictly adhered to and assist the Project quality team in the completion of site system test sheets and the test dossier.\nSupervise / conduct tool-box-talks.\nMonitor and report progress on a regular basis – daily / weekly / monthly.\nLiaise with site Control of Work personnel to ensure daily work permits are issued and any issues are resolved.\nMonitor barrier management and ensure barrier owners adhere to site / Project barrier procedures.\nLiaise with Project personnel to identify and deliver early Construction / Commissioning /Project gains.\nLiaise with Client representatives to ensure, where applicable / required, Construction data / services are supplied.\nAudit site / Project activities on a regular basis to ensure all compliance with Project safety, environmental and quality requirements.Skills",
    "Skills": [
        "Essential:ECITB L3/L6 Moving Loads VQ",
        "OPITO Rigging Assessment Stage 3 or stage 4\nA Valid Competent Person Qualification issued by one of the following award bodies:\nOPITO LOLER Competent Person or ECITB Appointed Person Moving Loads (Certificate of Training) and\nTAP01 Planning a Rigging Operation (Certificate of Achievement)\nCPCS A61 Appointed Persons (Lifting Operations) Blue Card for planning of mobile crane lifts\nLifting Equipment Inspection\nRigging Loft Management\nManaging Working at Height\nWorking at Height/Harness Equipment User",
        "Competencies – Generic:Able to demonstrate high level understanding of HSEQ safe working practices / procedures and their implementation – particularly regarding Lifting and Rigging operations.",
        "Able to develop comprehensive lift plans for all categories of lifting operations on the facility (including those for complex lifts) and address first line technical queries on lifting equipment.\nAble to demonstrate effective and efficient leadership of personnel and resources.\nAble to supervise lifting activities.\nAble to react to changing deadlines and achieve Project goals / milestones.\nAble to manage / maintain schedule requirements.\nDeal with Client / Vendor representatives in a professional manner.\nPossesses extensive trade and industry knowledge.\nAble to work as part of an integrated team.",
        "Competencies – Technical:Extensive knowledge and understanding of the UK Regulations (LOLER, PUWER, HSWA) and with International standards and codes associated with lifting and hoisting operations and lifting equipment and the Able to disseminate the requirements of these to the Supervision and rigging team members.",
        "Able to assess the vagaries of all categories of lifting operations to provide such planning, selection of crane(s), lifting accessories and equipment, instruction and supervision as is necessary for the task to be undertaken safely. This may include consultation with other responsible bodies if necessary and ensuring that, where different organizations are involved, they collaborate as necessary to ensure conformance with safe and good working practice.\nReview and authorise / endorse all lift plans developed by the Project / operations rigging team including specialist vendors and 3rd party contractors.\nAble to provide technical advice and assistance in the inspection for malfunction, wear and tear, stress deformation, corrosion, misuse of and alterations to the original design of lifting appliances and accessories, raising defect reports and removing such items from service.\nBe knowledgeable of the requirements of lifting equipment certification and for maintaining a register of all owned or hired portable lifting equipment on the installation.\nAble to read / understand procedures/ specifications / drawings / etc. in particular those pertaining to rigging & lifting operations.\nAble to safely deliver all rigging & lifting work scopes to the required/specified Project / industry standards.\nAble to coach and provide on the job training for all rigging personnel, particularly trainees, to ensure the progression toward the skill sets required to achieve the required Industry competence standard for the specific role.\nAble to demonstrate a high standard in execution and completion of assigned tasks.\nAble to deliver Project workscopes to the required / specified Project / industry standards.\nAble to produce technical documents and procedures covering all aspects of the Construction process."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Sweden",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}