{
    "Job ID": "4734251",
    "Description": "Parisima Talent is hiring for the position of Key Account Manager with one of our clients in Consumer Electronics industry.Position: TV Key Account ManagerJob location: Riyadh, Saudi ArabiaThe KAM is responsible for the sales & commercial partnership for the channels assigned . This primarily includes comprehensive distributor / account management. In this role the KAM will be responsible for planning sales to the distributor based on the agreed target, ensuring timely input of purchase plans, managing the distributor sell out by taking needed actions, optimizing value for the brand, building a reliable communication channel with the distributor & driving distribution excellence in the Channels assigned.Responsibility :To achieve the targeted Sales Revenue, Sales Quantity & Product- mix.\nTo achieve the targeted profit margin, planning /forecast accuracy & timely payments from customers\nTo carry out periodic Distributor Business Reviews, Assessment and Distribution Effectiveness\nTo provide timely inputs of distributor’s purchase plans to the Category Product Planner and his Sales Manager\nTo agree with the distributor of the Annual Marketing Plan & Activities and to ensure full visibility of its implementation. This includes space rentals with Key Accounts & promoter deployment.\nProper execution of GTM for the related channels, manage Merchandisers, Promotors\nEnsure company is occupying the best placement inside the channels, optimize brand visibility with related market.\nMaster all related information, knowledge, data of related channels, work hard to occupy the biggest MS within the related markets/Channels/\nLocking – in financial commitments (like rebates, support etc.) with GM & Finance team based on pre-agreed discussions & contractual terms with distributor, in coordination with his Sales Manager\nProviding a regular update of market intelligence on competition pricing, market trends, benchmarking, distribution and visibility.Skills",
    "Skills": [
        "Education & Experience :",
        "Minimum requirement - Graduation level.\nMinimum experience of 3 – 5 years in a distributor management role in consumer electronics / home appliances and preferably with a known brand\nGood understanding of the Home Appliances business & the Consumer Electronics industry in general, and in specific in the relevant target Channels (IR, OR in KSA)\nGood level of communication & interaction skills\nKnowledge of KSA markets is a must."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}