{
    "Job ID": "4734682",
    "Description": "Generate new leads and customers.\nPreparing Target Sales plan (Monthly, Quarterly & Yearly) and discuss the same with the management and get approval on it and achieve the agreed sales target in your assigned areas with the assistance of the Sales Staff designated to you and advise the achievements to the Sales Manager in a Weekly / Monthly basis.\nPrepare the marketing plan (Monthly, Quarterly & Yearly) basis and carry out those plans and ensure effective utilization of P.O.S material by area/outlets in the process obtaining full exposure to consumer.\nPrepare and follow daily reports for the Salesman & Merchandiser and evaluate them to assist your sales staff to increase sales through; a) Pioneering b) Improved Product display c) call frequency/visit regularly.\nTo visit market daily as per salesman route plan to look for the market development and to deal with the customer complaint in a positive (effective manner) and submit your report for it to the management in a weekly basis.\nCheck all the shelf report from Merchandiser and analyze it to avoid any unpleasant situation with the customer (out of stock / over stock).\nPlan and follow Tasting & Sampling with our customers.\nTo ensure regular availability of the entire range of company’s products throughout your assigned area and ensure supply continuity of products for sales.\nTo maintain vigilance on sales trends of own and competitive products and provide information to the Sales Manger.\nCollect and advise the Manager of competitors activities, i.e. pricing structure, packaging change, new product, competitor infrastructure, marketing policies, trade/consumer.Skills",
    "Skills": [
        "At least 5 years strong working experience in Building materials and plastic pipes.\nGood communication skills.\nComfortable with customer site visits.\nGood skills in English are preferred.\nKnowing Arabic is an extra advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}