{
    "Job ID": "4734062",
    "Description": "Medication Dispensing: Dispensing prescription medications, compounds, and medical supplies for animals based on veterinary prescriptions and treatment plans.\nMedication Management: Ensuring accurate dosing and proper administration of medications to various animal species. Providing guidance on the correct usage of medications to pet owners and veterinary staff.\nCompounding: Preparing customized medications for animals when commercially available formulations are not suitable. This involves adjusting dosages, flavors, and forms to meet specific needs.\nInventory Management: Managing the inventory of veterinary pharmaceuticals, ensuring proper storage, tracking, and disposal of medications in compliance with regulations.\nPatient Consultation: Offering professional advice and consultation to veterinarians, veterinary technicians, and pet owners regarding medication choices, interactions, side effects, and overall treatment plans.\nRegulatory Compliance: Staying informed about relevant laws and regulations governing the dispensing and handling of veterinary medications. Ensuring compliance with veterinary pharmacy regulations and protocols.توزيع الأدوية: توزيع الأدوية الموصوفة، والمركبات، والمستلزمات الطبية للحيوانات استنادًا إلى وصفات الطبيب البيطري وخطط العلاج\nإدارة الأدوية: ضمان جرعات دقيقة وإعطاء صحيح للأدوية لمختلف أنواع الحيوانات. توجيه أصحاب الحيوانات الأليفة وفريق الأطباء البيطريين بشأن الاستخدام الصحيح للأدوية\nالمركبات: تحضير الأدوية المخصصة للحيوانات عندما لا تكون التراكيب المتاحة تجاريًا مناسبة. وهذا يتضمن ضبط الجرعات والنكهات والأشكال لتلبية الاحتياجات المحددة\nإدارة المخزون: إدارة مخزون الأدوية البيطرية، وضمان تخزينها وتتبعها والتخلص منها بشكل صحيح وفقًا للوائح\nاستشارة المرضى: تقديم المشورة المهنية والاستشارات للأطباء البيطريين، وفنيين البيطرة، وأصحاب الحيوانات بشأن اختيار الأدوية، والتفاعلات، والآثار الجانبية، وخطط العلاج العامة\nالامتثال للتنظيمات: البقاء على اطلاع بالقوانين واللوائح ذات الصلة التي تحكم توزيع ومعالجة الأدوية البيطرية. ضمان الامتثال للوائح والبروتوكولات الخاصة بصيدليات البيطرةSkills",
    "Skills": [
        "Pharmacy Knowledge: A strong understanding of pharmaceuticals, medications, and their interactions in the context of animal health.\nPharmacology Expertise: In-depth knowledge of veterinary pharmacology, including dosages, administration routes, and potential side effects.\nCompounding Skills: Proficiency in compounding medications to meet the specific needs of various animal species.\nAttention to Detail: Precise and accurate in measuring and dispensing medications.\nCommunication Skills: Effective communication with veterinary professionals, pet owners, and colleagues to provide clear instructions and advice.\nProblem-Solving: Ability to analyze treatment plans and recommend appropriate medications or alternatives based on individual cases.\nRegulatory Understanding: Familiarity with regulations and guidelines related to veterinary pharmacy practice.",
        "المعرفة الصيدلانية: فهم قوي للمستحضرات الصيدلانية والأدوية، وتفاعلاتها في سياق صحة الحيوان\nالخبرة في الفارماكولوجيا: معرفة عميقة بفارماكولوجيا الحيوانات البيطرية، بما في ذلك الجرعات وطرق الإعطاء، والآثار الجانبية المحتملة\nمهارات التركيب: اجتياز في تركيب الأدوية لتلبية الاحتياجات المحددة لمختلف أنواع الحيوانات\nالانتباه للتفاصيل: دقة ودقة في قياس وتوزيع الأدوية\nمهارات الاتصال: تواصل فعّال مع المحترفين البيطريين وأصحاب الحيوانات وزملاء العمل لتقديم توجيهات ونصائح واضحة\nحل المشكلات: القدرة على تحليل خطط العلاج وتوصية بالأدوية المناسبة أو البدائل بناءً على الحالات الفردية\nفهم التنظيمات: الاطلاع على اللوائح والإرشادات المتعلقة بممارسة صيدلة البيطرة"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Pharmacies; Veterinary Hospital & Clinic",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}