{
    "Job ID": "4734761",
    "Description": "ResponsibilitiesOpening new market with a high export opportunities .\nAdminister all export of goods and ensure compliance to all organizational policies and procedures and monitor all financial and currency processes and transactions and manage all communication with export authorities for all required countries.\nDesign and implement all export strategies and activities and ensure adherence to all project requirements and prepare all export documents within required timeframe and schedule efficient shipping activities and identify appropriate transportation method in assistance with customers.\nSupervise efficient working of sales staff and ensure compliance to all export objectives and design sales strategies according to customer requirement and collaborate with country sales manager to prepare budget for projects\nManaging relationships with international clients, vendors, and business partners\nNegotiating contracts with new vendors and clients as well as terminating contracts with existing clients or vendors when necessary\nCoordinating freight shipments to ensure that they arrive on time and without damage\nEstablishing and managing relationships with freight carriers and other service providers to ensure smooth operations\nDeveloping and implementing plans for increasing market share through brand awareness, new product development, and advertising\nManaging the inventory of goods held in storage facilities, including monitoring stock levels and ordering replacements when necessary\nPreparing financial reports about sales activity, costs, and profit margins for international markets\nManaging the supply chain process from procurement to shipment to customer delivery\nCooperating with other departments within the company to ensure that all international business operations run smoothly.Skills",
    "Skills": [
        "Education: High Bachelor’s degree",
        "Briefer international business, finance, economics or marketing. Some employers may accept an associate’s degree or a combination of education and experience.",
        "Experience in exporting Cheese products",
        "Communication skills: Communication skills are also important for exporters. You may need to communicate with suppliers, customers and other parties in your company. You may also need to communicate with customs officials and other government agencies. Effective communication can help you to resolve issues and make the exporting process more efficient.",
        "Analytical skills: Analytical skills can help you make informed decisions about your company’s sales, production and distribution. You can use analytical skills to review your company’s financial records, sales data and production numbers to make informed decisions about which products to export and which markets to target",
        "Problem-solving skills: Problem-solving skills can help you find solutions to challenges that arise during the export process. For example, you may need to find a new shipping method if the original one isn’t available. You can also use problem-solving skills to identify and address any issues that arise during the inspection process.",
        "Marketing skills: Marketing skills can help you develop a strategy to sell your company’s products to customers in other countries. You can use marketing skills to create advertisements, develop a brand image and create a marketing plan to attract customers.",
        "Decision-making skills: Export managers make many decisions throughout the day, including which clients to work with, which products to sell and how to handle customer complaints. Making the right decisions can help you grow your business and increase your profits. It’s important to make decisions quickly and confidently, and it’s helpful to have a process for evaluating your options."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 18"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}