{
    "Job ID": "4734897",
    "Description": "To interpret simultaneously a range of material including: official speeches, interviews with contributors, discussion programs for TV news bulletins, news/current affairs and other programs, under the direction of the TV Editors and Senior Broadcast Journalists.  \nTo perform translations in at least three languages - English/Arabic-Arabic/English and a third language preferably: French-German-Spanish- Russian- Turkish - in front of the microphone, live or in recording sessions.  \nTo translate, adapt, voice and record material including packages and scripts for broadcasting.  \nTo translate text material on occasion as required, including online scripts, program transcripts and press releases around special seasons or events.  \nTo shorten packages or scripts for broadcasting and online publication under editorial guidance.  \nTo use the full range of program resources available.  \nThe role includes shift work and working at weekends and public holidays \nProof reading and writing news. \nWork extended hours in cases of live and/or breaking news coverage as required by management  Skills",
    "Skills": [
        "A proven professional knowledge and experience in at least 2 languages – Arabic, English and a third language: Preferably one of the following – German, Spanish, Russian, Turkish - including complete comprehension of the spoken and written languages. It would be preferable for the translator to be an Arabic speaker.  \nA thorough and up to date knowledge and understanding of news and current affairs in the Middle East North Africa region and internationally.  \nHigh level of concentration, discipline and proven ability to deliver accuracy in conveying the translation clearly from one language to the other during discussion programs and other output.  \nTo work and deliver high-quality professional interpretation/translation under pressure and meeting deadlines.  \nA good general knowledge of contemporary political, economic, social and scientific issues.  \nGood computer/keyboard and IT skills and a good knowledge of useful digital and internet sources.  "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Broadcast Media Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Translation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}