{
    "Job ID": "4734333",
    "Description": "محاسب أمين صندوق في شركة صاحب عمل في غبيرة، الرياض\n\nالمسؤوليات:\nإدارة صندوق الشركة وتسجيل العمليات المالية المختلفة.\nتنفيذ ومراقبة الإجراءات المحاسبية والمالية للشركة.\nإعداد التقارير المالية الدورية وتحليلها وتقديم التوصيات اللازمة.\nمراقبة الأرصدة النقدية وضمان التوازن في الحسابات المالية.\nمراجعة ومراقبة الفواتير والمستندات المالية الأخرى.\nالتعامل مع البنوك والجهات المالية الأخرى لإجراءات الدفع والتحصيل.\nإعداد وتحديث السجلات المحاسبية وضمان دقتها واكتمالها.\nالتحقق من الالتزام بالمعايير المحاسبية والقوانين المالية المحلية.\nالمساهمة في عمليات التخطيط المالي والميزانية للشركة.\nالتعاون مع فريق العمل الآخر وتبادل المعلومات المالية الضرورية.\nمتابعة أحدث التطورات في مجال المحاسبة وتطبيقها في العمل.Skills",
    "Skills": [
        "المرشح المفضل:\nحاصل على درجة البكالوريوس في المحاسبة أو مجال ذي صلة.\nخبرة سابقة لمدة 1-3 سنوات كمحاسب أمين صندوق أو وظيفة مماثلة.\nمهارات تحليلية ورقابية قوية.\nقدرة على العمل تحت ضغط وإدارة المهام المتعددة في آن واحد.\nمعرفة قوية بالمعايير المحاسبية والقوانين المالية المحلية.\nمهارات تواصل ممتازة وقدرة على التفاعل مع الفريق والجهات الخارجية.\nإجادة استخدام برامج المحاسبة المختلفة.\nمعرفة جيدة ببرامج Microsoft Office، بما في ذلك Excel وWord.\nالقدرة على التعامل مع المعلومات المالية بسرية ومهنية.\nالانضباط والدقة في العمل والالتزام بالمواعيد النهائية.\n======المهارات======\nإجادة اللغة العربية والإنجليزية (تحدثًا وكتابةً).\nمعرفة قوية ببرامج المحاسبة المختلفة مثل SAP و QuickBooks.\nمهارات تحليلية ورقابية متقد"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Ghubayra, Riyadh , Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Ghubayra, Riyadh , Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}