{
    "Job ID": "4734235",
    "Description": "Position Title:               Finance Team LeadEmployment Type:      PermanentSalary:                         depending on experience and qualificationsJob Location:             UAE About the Client:A leading oil and gas company in the UAE Job Description:Review and approve supplier invoices in Maximo system as per terms of the contract/PO and facilitate timely payments to suppliers.\nOversee and manage the weekly interface between Maximo and Sun System in a timely manner.\nOversee the treasury function. Ensure all bank transactions are recorded on a timely basis. Review bank reconciliations and scrutinize and clear reconciling items.\nRecord and review month-end accruals and ensure accruals are aligned with monthly cost projection.\nEnsure financial integrity by conducting complete GL review and internal controls check as part of monthly closing activity.\nSupport audit requirements both internal and external by providing required information to auditors and providing assistance to the team as and when required during the audit.\nLead the Tax compliance including computation of liability, return filling and refunds on quarterly basis.\nOversee and manage all VAT and other tax related issues.\nOversee and manage routine functional activities and supervise the work of the Accountants. Skills",
    "Skills": [
        "Qualifications:",
        "Minimum of 13 years overall experience in the Oil & Gas Industry; 3 years in leading and supervising a team\nMust be a qualified professional accountant – ACCA\nProficient with using Microsoft Office applications, particularly Excel and Word\nShould have strong knowledge and experience with UAE VAT regulations and IFRS\nPreferably with experience in using Maximo and Sun System\nImmediate joiners will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}