{
    "Job ID": "4735413",
    "Description": "Role and Responsibilities: As a Freight Forwarding Specialist, you'll play a pivotal role in ensuring the smooth movement of goods across borders.Your responsibilities will include:🌐 Collaborating with clients, carriers, and customs officials to coordinate international shipments.📋 Preparing and managing shipping documentation, including bills of lading and customs declarations.📦 Selecting the best transportation modes and routes to optimize delivery timelines and costs.🔍 Monitoring shipments and addressing any potential delays or issues proactively.📊 Analyzing market trends and rates to secure the most competitive pricing for clients.💼 Providing exceptional customer service by keeping clients informed at every stage of the process.Qualifications:3+ years of Dubai experience in freight forwarding or related logistics roles.\nProficiency in customs regulations, documentation, and international trade.\nStrong negotiation skills to secure favorable terms with carriers and vendors.\nExcellent communication skills to collaborate with clients and partners.\nDetail-oriented mindset and a commitment to accuracy in documentation.Skills",
    "Skills": [
        "Technical Skills:",
        "Customs Regulations: In-depth knowledge of international customs regulations, import/export documentation, and compliance requirements.\nShipping Documentation: Proficiency in preparing and managing shipping documents, bills of lading, commercial invoices, and customs declarations.\nTransportation Modes: Understanding of different transportation modes (air, sea, road, rail) and their associated logistics processes.\nTrade Agreements: Familiarity with trade agreements, tariffs, duties, and taxes that impact cross-border shipments.\nLogistics Software: Experience using logistics software and tools for shipment tracking, route optimization, and documentation management.\nNegotiation Skills: Ability to negotiate favorable terms with carriers, freight forwarders, and suppliers to ensure cost-effective shipments.",
        "Soft Skills:",
        "Communication: Strong verbal and written communication skills to interact with clients, carriers, customs officials, and internal teams.\nProblem-Solving: Skill in addressing challenges that arise during shipping, such as delays, documentation discrepancies, and route changes.\nAttention to Detail: Keen eye for accuracy in preparing documentation, recording shipment details, and ensuring compliance.\nTime Management: Efficiently manage multiple shipments, deadlines, and prioritize tasks to ensure timely deliveries.\nCustomer Service: Dedication to providing exceptional customer service, keeping clients informed, and addressing inquiries promptly.\nAdaptability: Ability to adapt to changing regulations, market conditions, and client needs in the fast-paced logistics industry.\nAnalytical Thinking: Capacity to analyze shipping options, costs, and routes to make informed decisions.\nTeam Collaboration: Collaborate effectively with internal teams, clients, carriers, and partners to achieve seamless operations"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Shipping",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}