{
    "Job ID": "4735431",
    "Description": "موقع الوظيفة عمان الاردن\nطرح الأفكار وتطوير استراتيجية التسويق عبر وسائل التواصل الاجتماعي بالكامل والتي تتضمن كل شيء بدءًا من تحديد الأهداف وجدول النشر إلى تحديد المحتوى الذي سيحتاج مؤلفو المحتوى والمصممين إلى إنشائه.\n·        خطط لحملات فردية ، مثل الحملات الموسمية - الهالوين والجمعة السوداء وعيد الفصح وعيد الفطر والاضحى - والحملات الترويجية لخدمة أو منتج أو فئة معينة.\n·        الفهم لرغبات واحتياجات الجمهور المستهدف للعلامة التجارية والقيام بتطوير هوية العلامة التجارية .\n·        التأكد من أن كل من مشاركات العلامة التجارية والردود على وسائل التواصل الاجتماعي تتماشى مع صورة العلامة التجارية الحالية. يتضمن ذلك كل شيء من اختيار الألوان للتصميمات المرئية إلى اختيار الكلمات والنبرة التي تستخدمها العلامة التجارية عند مخاطبة المعجبين والمتابعين والعملاء.\n·        التعامل مع لوجستيات النشر على منصات اجتماعية مختلفة.\n·        إدارة وتطوير إنشاء تقويم محتوى الوسائط الاجتماعية والتأكد من اكتمال جميع المخرجات ونشرها في الوقت المناسب.\n·        إدارة العروض الترويجية المدفوعة على المنصات. من خلال جمع البيانات وتقديم رؤى قيمة فيما يتعلق بالإعلانات المدفوعة ، وكذلك المساعدة في تطوير الحملات المدفوعة وتشغيلها.\n·        إدارة عملية التواصل مع الجمهور على وسائل التواصل الاجتماعي من خلال ضمان الرد على التغريدات والتعليقات ، والإجابة على أسئلة الجمهور ، والرد على الاستفسارات في الوقت المناسب ، ومراقبة المراجعات.\n·        بناء الوعي بالعلامة التجارية من خلال إشراك المؤثرين ذوي الصلة.\n·        إدارة مجتمعاتنا عبر الإنترنت لضمان المشاركة المحترمة والمناسبة.\n·        الإشراف على خدمة العملاء المقدمة عبر وسائل التواصل الاجتماعي.\n·        تحليل البيانات لتحديد ما إذا كانت حملات وسائل التواصل الاجتماعي قد حققت أهدافها.\n·        تدريب الموظفين على مستوى الشركة على أفضل ممارسات إنشاء المحتوى.\n·        وضع أهداف لزيادة الوعي بالعلامة التجارية وزيادة مشاركة العملاء.\n·        القيام باجراء بحث حول الاتجاهات المعيارية الحالية وتفضيلات الجمهور.\n·        التعاون مع الفريق ، مثل التسويق والمبيعات وخدمة العملاء لضمان اتساق العلامة التجارية.\n·        إدارة تصميم حسابات وسائل التواصل الاجتماعي (مثل غلاف الخط الزمني للفيسبوك وصور الملف الشخصي وتخطيط المدونة).\n·        اقتراح ميزات جديدة والتوصية بها لتطوير الوعي بالعلامة التجارية ، مثل العروض الترويجية والمسابقات\nبحث وتقييم أحدث الاتجاهات والتقنيات من أجل إيجاد طرق جديدة وأفضل لقياس نشاط وسائل التواصل الاجتماعي\n·        البقاء على اطلاع دائم بالتقنيات والاتجاهات الحالية في وسائل التواصل الاجتماعي وأدوات التصميم والتطبيقات\n·        تسهيل توسيع نطاق الوعي بالعلامة التجارية والشركة من خلال قنوات التواصل الاجتماعي المختلفة.\n·        الإشراف على جميع جوانب تفاعل وسائل التواصل الاجتماعي بين العملاء والشركة ، وضمان تجربة خدمة عملاء إيجابية.\n·        إنشاء وتطوير خطط قابلة للتنفيذ لتنمية المتابعين والحفاظ عليهم من خلال منصات التواصل الاجتماعي الشهيرة مثل Twitter و Facebook و Tiktok و YouTube و LinkedIn\n·        التأكد من التقدم على جميع الأنظمة الأساسية باستخدام الأدوات التحليلية مثل Google Analytics وغيرها.\n·        الإشراف على إنشاء وتنفيذ التقويم التحريري الشهري الذي يتضمن أهداف ومبادرات المبيعات الشهرية.Skills",
    "Skills": [
        "·        خبرة من 5 إلى 7 سنوات أو أكثر كمدير وسائط اجتماعية أو مدير علامة تجارية أو دور مشابه.\n·        خبرة في تطوير استراتيجيات وسائل التواصل الاجتماعي.\n·        خبرة في العمل مع خطة التسويق وتطويرها.\n·        القدرة على تطوير الصوت المناسب لكل منصة وسائط اجتماعية.\n·        فهم مبادئ التصميم الجرافيكي.\n·        القدرة على قياس نجاح الحملات.\n·        مهارات إدارة الوقت الممتازة والقدرة على تحديد أولويات العمل.\n·        الاهتمام بالتفاصيل ومهارات صنع القرار القوية.\n·        مهارات تنظيمية قوية مع القدرة على تعدد المهام والتفاوض\n·        براعة في القيادة و إدارة وتنمية الأفراد."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}