{
    "Job ID": "4735406",
    "Description": "Fayendra prides itself on having Quality and Excellence as the basis of its culture. This philosophy transcends all aspects of the company. Based on our luxury brand, we know that our customers expect the best from us. Whether that means building the best, most innovative online shopping experience, or providing unmatched face-to-face shopping experiences in our showrooms, we're up for the challenge.Fayendra is looking for an exceptional Manager/Team leader with a Software development background. This position commands a wide range of knowledge and experience to build and grow our ecommerce platform, support the showrooms, and Odoo ERP Platform.In this role, you ensure production support activities for all major IT systems and related subsystems are carried out, ideally within the e-commerce space. You will collaborate with a team of IT professionals and various departments to ensure the advancement of our retail technology solutions. The successful candidate will have a strong understanding of the retail sector mandates, security, standards, and compliance for supporting and developing on-premises and cloud-based solutions.ResponsibilitiesDevelop and execute comprehensive e-commerce strategies to align with the company's retail objectives and drive operational efficiency.\nCollaborate with cross-functional teams to identify and implement improvements and technology solutions to enhance the customer experience, optimize sales, and improve overall operational effectiveness.\nOversee the enhancement and maintenance of the company's Odoo ERP, POS systems, and collaborate to enhance the inventory management systems, and other retail-related applications.Skills",
    "Skills": [
        "The ideal candidate must have a proven track record as an eCommerce lead. You will utilize your ecommerce expertise to work on all aspects of our web presence including integration, enhancement, architecture, implementation, and deployment. Odoo ERP experience is a must.",
        "Basic Qualifications",
        "Bachelor's degree in Information Technology, Computer Science, or a related field. Master's degree is a plus.\nExtensive experience (10+ years) in an Software engineering role, preferably within the retail industry.\nExpert knowledge of key technical and strategic concepts in the areas of e-Commerce, Websites (UX, Coding, Tagging, etc.), Search, Digital Media, Creative/Content, Mobile, Analytics/Data Science and Research.\nExcellent leadership and team management skills, with the ability to mentor and inspire a diverse group of IT professionals.\nOdoo software development experience\nFamiliarity with emerging technologies and their potential applications in the retail industry.\nPosition requires the ability to balance multiple projects/tasks simultaneously, the ability to prioritize tasks, and the ability to shift established priorities in response to changing business needs.",
        "Preferred Qualifications",
        "Have a working knowledge of modern software development practices and technologies such as agile methodologies and DevOps (highly desirable)"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Jewelry & Gold",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}