{
    "Job ID": "4735554",
    "Description": "Our client is established by Federal Law are now looking for an Events Specialist to join them.The events specialist is responsible for identifying, developing, implementing and maintaining our clients related events, conferences & sponsorship programs.Key Roles & Responsibilities:Supports the Corporate Communications & Marketing Team in the coordination, planning and execution of events promoting our clients services, and initiatives.\nLiaise with and manage conference organizers to coordinate all pre-event and post-event logistics, including project timelines, preparing paperwork, providing updates and liaising on content requirements, preparing the client's content for programs.\nMake sure all pre-event & post-event logistics are coordinated; all internal & external approvals have been obtained; all resources required have been identified and obtained.\nTracks and communicates deadlines to relevant areas; identifies and seeks to minimize any risks associated with events; communicates event information to all stakeholders.Salary: AED 15000 - AED 16000Skills",
    "Skills": [
        "Preference:",
        "Strong analytical and problem-solving skills to identify and address complex issues and challenges, utilizing data and strategic thinking to drive solutions.\nEmbraces a culture of collaboration, and efficiency\nStrong financial acumen and experience in effectively managing budgets",
        "Qualifications:",
        "Diploma in Relevant Field Required\n10 years of experience",
        "Benefits:",
        "Employment Visa\nMedical Insurance"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}