{
    "Job ID": "4735592",
    "Description": "We are currently seeking experienced Maintenance Electricians to become a valuable part of our Facility Management team in Dubai. As a Maintenance Electrician, you will play a vital role in upholding the functionality, safety, and efficiency of various electrical systems and equipment within residential, commercial, and industrial settings. The ideal candidates will possess a robust background in electrical maintenance, demonstrate exceptional technical skills, and be well-acquainted with the unique challenges and demands of the UAE climate.Skills",
    "Skills": [
        "Responsibilities:",
        "Execute routine maintenance tasks on electrical systems and equipment to pre-emptively address potential malfunctions and ensure their continued optimal performance.",
        "Employ your technical expertise to inspect and diagnose electrical issues, efficiently troubleshoot problems, and implement effective solutions.",
        "Undertake repairs or replacements of faulty wiring, lighting fixtures, switches, outlets, and other electrical components as required.",
        "Collaborate closely with our Facility Management teams to strategize and execute electrical maintenance activities that minimally impact ongoing operations.",
        "Maintain thorough and accurate records of maintenance activities, repairs conducted, and specifications of equipment.",
        "Validate and test the functionality of repaired and maintained systems to ensure they fully meet safety and performance standards.",
        "Contribute to the upgrading and modernizing of existing electrical systems in alignment with evolving technologies and energy-efficiency standards.",
        "Adhere unwaveringly to safety protocols and guidelines, fostering a secure working environment for all individuals.",
        "Extend guidance and support to junior technicians or apprentices during various maintenance tasks.",
        "Remain well-informed about industry trends, emergent technologies, and evolving practices pertinent to electrical maintenance.",
        "Requirements:",
        "Possess at minimum a high school diploma or an equivalent qualification. While not mandatory, completion of an electrical apprenticeship program or relevant technical training is advantageous.",
        "Hold a track record of 3-4 years of hands-on experience in electrical maintenance, gained within the UAE.",
        "Exhibit a robust understanding of electrical systems, circuits, wiring, and established maintenance protocols.",
        "Display familiarity with local electrical codes and regulations particular to Dubai.",
        "Exhibit proficiency in comprehending and interpreting technical documents, blueprints, and electrical diagrams.",
        "Showcase exceptional troubleshooting abilities, enabling the identification and efficient resolution of electrical issues.",
        "Demonstrate effective communication and teamwork skills, facilitating seamless coordination with colleagues and superiors.",
        "Possess the physical capacity to engage in demanding tasks and navigate confined spaces as required.",
        "Uphold an unwavering commitment to detail and excellence, ensuring maintenance standards are consistently met.",
        "Exhibit strong problem-solving skills, particularly under time-sensitive circumstances.",
        "A valid UAE driving license is regarded as an advantageous asset.",
        "Showcase excellent time management abilities to effectively prioritize tasks and adhere to maintenance schedules."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Age": "Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}