{
    "Job ID": "4735078",
    "Description": "Senior culinary professional is responsible for overseeing and managing all aspects of the kitchen operations.Below are the key responsibilities but are not limited to:Menu Creation and Development:Develop innovative menus that align with the establishment's concept, target audience, and seasonal ingredients.\nDesign dishes that balance flavours, textures, and presentation.Kitchen Management:Lead, supervise, and train kitchen staff, including sous chefs, line cooks, and other culinary team members.\nOversee all kitchen operations, including food preparation, cooking, plating, and quality control.Food Safety and Hygiene:Ensure strict rules to food safety and hygiene standards, including HACCP guidelines, to maintain a safe and clean kitchen environment.\nMonitor and enforce proper handling, storage, and disposal of food items.Inventory and Procurement:Manage inventory levels of ingredients and supplies, ensuring efficient utilization and minimizing wastage.Cost Control and Budgeting:Develop and manage budgets related to kitchen operations, labor costs, and food expenses.\nImplement cost-effective practices without compromising on food quality and guest satisfaction.Training and Development:Provide guidance, mentorship, and training to kitchen staff.\nConduct regular performance evaluations and address areas for improvement.Skills",
    "Skills": [
        "Experience & Educational qualifications",
        "Culinary degree or relevant certification in culinary arts or at least 10 years experience in the same field.\nStrong knowledge of various cuisines, cooking techniques, and culinary trends.\nExcellent leadership, communication, and interpersonal skills.\nAbility to work well under pressure.\nCreativity and passion for creating exceptional dining/Casual dining/QSR experiences.\nAttention to detail and commitment to food quality and presentation.\nFamiliarity with kitchen equipment, safety protocols, and sanitation standards.\nCollaborating with the front-of-house team to provide an excellent dining experience for customers.\nCreating work schedules, delegating tasks, and supervising the daily operations of the kitchen.\nResearching and identifying new suppliers and vendors to expand the range of ingredients and products available to the kitchen.\nCreating and implementing training programs to ensure that all employees are properly trained in their roles.\nDemonstrate strong conflict resolution skills and be able to handle customer complaints and other issues in a professional and effective manner."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Max: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}