{
    "Job ID": "4735395",
    "Description": "·      Identify and explore new business opportunities in the Dubai and Gulf market, aligning with VTS's service offerings in SAP, Microsoft, Infrastructure, RPA, and ServiceNow.·      Build and maintain a robust network of potential clients and key stakeholders within the technology sector in Dubai and Gulf countries.·      Conduct market research and competitor analysis to understand market trends, client needs, and positioning VTS as a preferred technology solutions partner.·      Collaborate with the marketing team to develop targeted campaigns, lead generation strategies, and brand awareness initiatives.·      Engage in consultative selling by understanding client requirements, pain points, and challenges, and presenting comprehensive solutions to address their specific needs.·      Develop and deliver persuasive presentations, proposals, and pitches to potential clients, showcasing VTS's expertise and unique value proposition.·      Negotiate and close deals, ensuring sustainable revenue growth and profitability for VTS.·      Work closely with the delivery and project teams to ensure a smooth transition from sales to implementation, maintaining strong customer relationships throughout the project lifecycle.·      Provide timely and accurate sales reports, forecasts, and market feedback to senior management.·      Represent VTS at industry events, conferences, and networking opportunities to enhance the company's visibility and reputation in the Gulf region.Qualifications and Experience:·      Bachelor’s degree in business administration, Computer Science, or a related field. A Master's degree would be a plus.·      Proven track record of 6-7 years in business development and technology sales, specifically in Dubai and the Gulf market.·      Extensive knowledge of SAP, Microsoft, Infrastructure, RPA, and ServiceNow solutions and their application in various industries.·      Established network and strong connections with potential clients in Dubai and Gulf countries, with a history of successful client acquisitions.·      Demonstrated ability to meet and exceed sales targets, driving revenue growth and market expansion.·      Excellent communication, presentation, and negotiation skills.·      Strong problem-solving abilities and a customer-centric approach.·      Self-motivated, result-oriented, and a team player.·      Fluent in English; knowledge of Arabic would be an advantage.·      Willingness to travel within the Gulf region as required.Skills",
    "Skills": [
        "Communication and interpersonal skills. ...\nNegotiation skills. ...\nResearch and strategy. ...\nBusiness intelligence. ...\nNetworking."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 6"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}