{
    "Job ID": "4735515",
    "Description": "About IN2IN2 is an award-winning specialist communications and research company dedicated to creating positive change for communities in high-risk and rapidly changing environments. We use innovative and engaging two-way communications to create impact across the full spectrum of geo-political and socio-economic issues, including global security, international development, business transformation and climate change.IN2 combines a global geopolitical outlook with a rich understanding of local grassroots sentiment to help clients develop, deliver and measure communication campaigns that connect our clients with their intended audiences in a language, manner, and medium that feels natural to them.With our track record of delivering culturally sensitive campaigns in challenging and higher-risk environments around the world, IN2 has become a trusted partner and advisor to a range of clients from national governments and transnational institutions to global brands and international corporations. In addition to our operational headquarters in Istanbul, IN2 has offices in the UK, UAE, Jordan, Europe, Iraq and Kenya. This role is suitable for hybrid working within GMT+/-3 hour time zones.As we continue to expand our operations, we are seeking a highly motivated and experienced professional to join our team, of 160 culturally diverse staff that hail from 20 countries, as the Head of Business Development. We are committed to diversity in our workplace. This role is crucial in driving the growth and success of our business across the targeted regions.IN2 ValuesAs a values-based organisation, the successful candidate will be expected to understand and live by IN2’s values to ensure alignment with our rich company culture. Our values are: Creativity, Integrity, Curiosity, Empowerment, Accountability, Impact, Innovation, Collaboration, Social Responsibility and Agility.Purpose of the Role:The Head of Business Development will be responsible for driving revenue growth in the Middle East, Africa, and Europe particularly with our research-led communications offerings. The role involves developing and implementing strategic plans, building strong relationships with key stakeholders, identifying new business opportunities, securing partnerships with other organisations, and managing a team of business development professionals. This position requires a deep understanding of the target markets and the ability to lead the company towards achieving its business objectives.The Small Print:We receive a high number of applications per role and therefore ONLY successful applicants will be contacted.Please do not apply if you do not meet the education and experience requirements.PLEASE NOTE: It is unlawful to employ a person in a UK-based job who does not have permission to live and work in the UK. The same applies for our Headquarters in Turkey and UAE. You should make yourself aware of how immigration laws apply to your situation before applying for any jobs. IN2 is an Equal Opportunity Employer. We offer a unique opportunity, a competitive salary and an environment that inspires innovation and supports professionals to perform at their best in their chosen fields to achieve positive change.Skills",
    "Skills": [
        "Roles and Responsibilities:",
        "Develop and execute a comprehensive Business Development strategy to drive revenue growth, create value for IN2, and lead expansion in targeted markets.\nIdentify new business opportunities, markets, and potential partnerships to enhance the company's reach and presence and increase revenue and market share.\nConduct market research and analysis to identify customer needs, industry trends, and competitor activities, utilising this information to develop effective business strategies.\nBuild and maintain relationships with potential clients, key stakeholders, and industry influencers to expand the company's network and generate business leads.\nBuild and oversee partnerships with external organisations within our industry space to help IN2 compete for and deliver tendered contracts.\nLead negotiations and contract discussions with potential clients, ensuring favourable terms and conditions for IN2.\nManage the Business Development team, providing guidance, mentoring, and support to achieve objectives and targets while maintaining standard corporate performance management processes.\nLead the Business Development team to continuously improve marketing strategy documents including concept notes, proposals, pitches, client reports, and strategic communications plans for the region.\nCollaborate with other departments, such as Programmes, Finance, and Creative, to align strategies and ensure cohesive efforts towards business growth in line with IN2’s Five-Year strategy.\nMonitor and report on key performance indicators (KPIs) related to business development activities, providing regular updates to the Board and SMT.\nEnsure the Business Development team is disciplined in the use of technology, particularly Customer Relationship Management (CRM) for effective pipeline management and reporting.\nEncourage and contribute to a culture of value creation at IN2, so colleagues across departments are proactively sharing potential business opportunities in our geographies.\nStay updated with industry trends, the geopolitical influences across our regions of interest, market dynamics, and regulatory changes that may impact the business, adapting strategies and priorities accordingly.\nRepresent IN2 at industry events, conferences, and exhibitions to enhance brand visibility and identify potential business opportunities.",
        "Note: This job specification serves as a general guideline and may be adjusted to meet the specific needs of the company.",
        "Education and Experience Requirements:",
        "Bachelor's degree in Business Administration, International Relations, Behaviour Science, Marketing, or a related field (Master's degree preferred) OR over ten years of directly relevant experience for this role.\nA minimum of five years of relevant experience in business development or sales, preferably in an international setting within the Middle East, Africa, and Europe.\nProven track record of successfully developing and implementing business development strategies, resulting in demonstrable revenue growth and market expansion.\nStrong understanding of the targeted regions' geopolitics, business environment, cultural nuances, and market dynamics.\nExperience in building and managing high-performing teams, with exceptional leadership and communication skills.\nDemonstrated ability to network, negotiate, close deals, whilst building strong relationships with key stakeholders, clients, and partners.\nFluency in English; knowledge of other languages (Arabic, German, French) relevant to the targeted regions would be advantageous.\nWillingness, and ability, to travel frequently within the Middle East, Africa, and Europe as required.",
        "Personal Qualities Required:",
        "Thrives in a busy, multi-tasking environment.\nUnflappable under pressure.\nLoves winning. Even when it's not going to plan and others are fearing failure, the  Head of Business Development will always look for positive opportunities to create a motivational win.\nProactive, values-driven and results-oriented mindset, with a proven ability to achieve targets and meet deadlines.\nConfident and comfortable with professional capabilities.\nStrong people manager capable of setting a high standard and encouraging and inspiring others to follow.\nEnjoys meeting people and professional socialising.\nAble to demonstrate a high level of writing ability, creative planning, project management and team management.",
        "Compensation:",
        "The compensation package for this position is based on various factors, including experience, educational background, key skills, and the location of work. We believe in rewarding our employees for their expertise and dedication. As part of the salary structure, a portion will be commissioned based, as we are looking for candidates who are confident in their ability to succeed and excel in this role. We value individuals who are driven to achieve results and contribute to the continued growth and success of IN2."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Media Production",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}