{
    "Job ID": "4735023",
    "Description": "Provide Support to employees and act the IT single point of contact for all IT related services. Coordinate and assist the IT needs and requirements.\nCreate, add, and modify user accounts and services across our various cloud platforms.\nAdministration of Active Directory, Azure, SharePoint, Exchange, Office365, Endpoints, firewalls, email filter, backups, phone systems, and any other IT-related software\nConfigure, deploy, and relocate desktops, laptops, printers, and any other related devices.\nIdentify, report, and respond to potential cybersecurity threats. Setting up advanced network firewalls and switches\nIdentify, troubleshoot, resolve, and document end-user system issues requests.\nOpen and follow up with tech support from vendors such as internet providers, cloud solutions, consultants, etc.\nInstalling, configuring, and maintaining of server platforms and server Operating Systems.\nManage different Server Hypervisors, Hyper-V, and VMware and Troubleshoot Hyper-V and VMware server environments.\nEvaluates and advises on all technology components, such as server software and hardware capabilities for server, systems, and applications.\nManaging onsite based Domain Controller servers, Microsoft Active Directory in the enterprise, including creating bulk user accounts, deleting, and modifying user accounts, setting up e-mail, home directories.\nPerform file system configuration and management; define and perform server backups and recovery procedures.\nPlan and implement server upgrades, maintenance fixes, and vendor-supplied patches.\nMonitor and test system performance and provide performance statistics and reports.Skills",
    "Skills": [
        "General Technical and Functional Skills",
        "Bi-lingual ARABIC/ENGLISH (speak, read, and write) preferred.\nCertifications such as A+ / Network + / Microsoft are preferred but not required.\nExperience in the set-up, configuration, and use of computer hardware, software, and networks\nProficient in troubleshooting and supporting Windows servers, VMWare, Hyper V, Windows 10/11, and Office 365\nSelf-motivated and willing to learn, as well as always find the solution.\nAble to work in a fast-paced environment.\nAdvanced level knowledge in the use of all office software (Word, Excel, Outlook, etc.)\nBasic understanding of Cloud Solutions & Cloud Computing\nKnowledge of wireless networks, set up maintenance and troubleshooting.\nKnowledge of video conference systems, cell phones, smartphones, iOS, iPad OS, and other common hardware devices and software\nExperience providing remote support via phone and remote-control applications desired.\nExperience supporting and configuring iPads/iPhones/smartphones in an enterprise environment preferred.\nExperience in telecom, structured cabling, panels, switches, cameras, APs, etc.\nThe ability to work under pressure in a high-pressure environment with numerous tasks handled simultaneously.\nAbility to work flexible hours, including evenings, weekends, and overtime, on an on-call rotation.\nThe position will require travel between multiple Locations Driver License and Car is necessary.",
        "Data Center and Server Technical and Functional Skills",
        "At least five years’ equivalent work experience in a senior technical position responsible for managing server environments.\nExperience installing, configuring, and maintaining all manners of server hardware and associated network equipment.\nExperience with server performance tuning and monitoring tools.\nFamiliarity with TCP/IP and other network protocols, firewall management, and operating system configuration.\nGeneral knowledge of storage technologies such as SAN or NAS, as well as Active Directory or other directory services.\nProven experience with systems planning, security principals, and general software management best practices."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}