{
    "Job ID": "4735540",
    "Description": "We are hiring for an Environment Engineer.Location - DubaiSalary - AED 9000Our client is currently seeking a Health Safety and Environment Engineer.The ideal candidate will have a minimum of 1 year of experience in a similar role and possess a strong understanding of health, safety, and environmental regulations and procedures. As a Health Safety and Environment Engineer, you will be responsible for implementing and maintaining health, safety, and environmental programs and initiatives to ensure a safe and healthy work environment for all employees.Responsibilities:Develop and implement health, safety, and environmental policies and procedures to ensure compliance with local and international regulations.\nConduct regular inspections and audits to identify potential hazards and risks in the workplace.\nCreate and deliver training programs to educate employees on health, safety, and environmental best practices.\nInvestigate accidents and incidents to determine the root cause and implement corrective actions to prevent reoccurrence.\nMonitor and analyze data related to health, safety, and environmental performance and prepare reports for management.\nCollaborate with cross-functional teams to develop and implement emergency response plans and procedures.\nStay up-to-date with industry trends and best practices in health, safety, and environmental management.\nProvide guidance and support to employees regarding health, safety, and environmental issues.\nConduct risk assessments and develop risk mitigation strategies.\nEnsure compliance with all relevant health, safety, and environmental legislation and regulations.Skills",
    "Skills": [
        "Strong knowledge of health, safety, and environmental regulations and standards.\nExcellent communication and interpersonal skills.\nAbility to work well in a team and collaborate with cross-functional teams.\nAttention to detail and strong analytical skills.\nProficient in Microsoft Office Suite.",
        "Preferred Candidate:",
        "Bachelor's degree in Environmental Science, Occupational Health and Safety, or a related field.\nMinimum of 1 year of experience in a similar role.\nStrong knowledge of health, safety, and environmental regulations and standards.\nExcellent communication and interpersonal skills.\nAbility to work well in a team and collaborate with cross-functional teams.\nAttention to detail and strong analytical skills.\nAbility to prioritize and manage multiple tasks and projects.\nProficient in Microsoft Office Suite.\nProfessional certifications in health, safety, and environmental management are highly desirable.\nKnowledge of local and international health, safety, and environmental regulations is a plus."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}