{
    "Job ID": "4735383",
    "Description": "We are looking for a highly experienced Shopping Mall Director to join our team in Dubai, UAE. As the Shopping Mall Director, you will be responsible for overseeing the overall operations and management of the shopping mall. You will ensure that the mall is running efficiently, meeting financial goals, and providing an exceptional experience for both tenants and customers.Responsibilities:Develop and implement strategic plans to maximize the profitability and success of the shopping mall.\nOversee the leasing process, including negotiating and renewing leases with tenants.\nMonitor and analyze market trends, customer preferences, and competitor activities to identify opportunities for growth and improvement.\nEnsure that the shopping mall is well-maintained and aesthetically pleasing, including coordinating with maintenance and cleaning teams.\nManage the financial aspects of the mall, including budgeting, forecasting, and financial reporting.\nCreate and maintain strong relationships with tenants, addressing their concerns and ensuring their satisfaction.\nCollaborate with marketing and advertising teams to develop and implement effective marketing strategies to attract customers and increase footfall.\nOversee the hiring, training, and performance management of mall staff, ensuring a high level of professionalism and customer service.\nEnsure compliance with all regulatory requirements and standards, including health and safety regulations.\nStay updated on industry trends and best practices in shopping mall management, implementing innovative ideas and strategies.Skills",
    "Skills": [
        "The ideal candidate will have at least 10 years of experience in shopping mall management, with a deep understanding of the Dubai market and trends.",
        "Financial management\nLeasing and negotiation\nMarket analysis\nCustomer relationship management\nTeam leadership",
        "Preferred Candidate:",
        "Proven experience as a Shopping Mall Director or similar role, with a minimum of 10 years of experience in shopping mall management.\nDeep understanding of the Dubai market and trends, with a track record of success in managing shopping malls in the region.\nStrong leadership and managerial skills, with the ability to motivate and inspire a diverse team.\nExcellent financial acumen and analytical skills, with the ability to analyze data and make informed decisions.\nExceptional communication and interpersonal skills, with the ability to build strong relationships with tenants, customers, and stakeholders.\nAbility to think strategically and develop innovative solutions to drive business growth and improve customer experience.\nStrong negotiation and conflict resolution skills.\nProficiency in Microsoft Office Suite and other relevant software.\nFlexibility to work on weekends, holidays, and extended hours as needed.\nDegree in Business Administration, Marketing, or a related field."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}