{
    "Job ID": "4735412",
    "Description": "Position Title: HR and Admin CoordinatorEmployment Type: Full Time Salary: up to 8K AED all-inclusive, depending on experience and qualificationsJob Location: Dubai, UAEAbout the Client: One of the most innovative and successful automotive accessory developers in the UAEJob Description:Assist HR Manager with all internal and external HR related inquiries or requests.\nAssist HR Manager with the recruitment process by identifying candidates, performing reference checks, and issuing employment contracts\nMaintain and monitor the timely renewals of various Lease Agreements, Trade Licenses, Membership Certificates, AMCs, company vehicle renewals and insurances.\nPrepare documents for Easy 2 approvals (Vehicle Expenses, Insurances, AMC’s, Leases, Trade Licenses, and new assets).\nResponsible for purchasing and monitoring of office and warehouse office supplies, stationaries, furniture, office equipment, etc.Skills",
    "Skills": [
        "Qualifications:",
        "Open to European nationals\nFemale, 30 years old and below\nBachelor's degree in Business Administration, Office Management, HR or related field\nAt least 2 years of relevant experience in administration and human resources or any similar role\nMust have a solid knowledge of office procedures\nMust have experience with office management software like MS Office (MS Excel and MS Word)\nStrong organization skills with a problem-solving attitude\nExcellent written and verbal communication skills (English)\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Eastern European Countries; All Western European Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 33"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}