{
    "Job ID": "4736918",
    "Description": "Collaborate with Data Analyst and Architects, Developers and Quality Analysts on the physical database design and implementation.\nWork directly with development groups helping design SQL to interact efficiently with the database.\nOperating System tuning and management.\nPerformance Monitoring and Tuning: Monitoring and performance tuning on physical server level, database level, Database level (Database settings and options) and query tuning, memory settings, monitoring CPU usage and Disk I/O activity.\nData Extraction, Transformation, and Loading (ETL): Archive and maintain the history data, extract the archived data and make it available to the business.\nDisaster recovery implementation.\nBusiness Intelligence Development Studio: Develop Business solutions that include Analysis services, Intelligence services, Integration services, and Reporting services projects.\nSecurity Administration for specific application access and user access\nAssist with database capacity planning.\nDevelops and implements complex data models and logical database designs.\nRAC (Real Application Clusters)\nPlans and conducts structured testing of database designs to confirm functionality and performance.\nPlans and executes testing and implementation of major systems.Skills",
    "Skills": [
        "B.Cs. in Computer engineering/science/information technology or related\nMinimum 5 years' experience in DBA\nOracle certification\nStrong knowledge of using SQL Management Database tools\nOracle 10g experience\nExperience SQL scripting queries and documentations\nExperience in SQL security"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Cyber & Network Security; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}