{
    "Job ID": "4736210",
    "Description": "Position Overview:The Transport In-Charge is responsible for overseeing the transportation operations of an organization. This role involves managing a fleet of vehicles, coordinating transportation schedules, ensuring regulatory compliance, and optimizing transportation efficiency to meet the organization's needs.Key Responsibilities:Fleet Management:Supervise and manage a fleet of vehicles, including maintenance, repairs, and regular inspections.\nEnsure vehicles are clean, properly maintained, and equipped for safe transportation.Transportation Planning:Develop transportation schedules and routes to ensure timely and efficient delivery of goods, services, or passengers.\nCoordinate with various departments to align transportation activities with organizational goals.Driver Management:Hire, train, and supervise drivers, ensuring they adhere to safety protocols, regulations, and customer service standards.\nMonitor driver performance and provide feedback for improvement.Regulatory Compliance:Stay updated on local, state, and federal transportation regulations, ensuring compliance with all relevant laws and requirements.\nObtain necessary permits and licenses for vehicles and drivers.\nRenewal of Vehicle permits & vehicle insuranceSafety and Security:Implement safety protocols and guidelines for drivers and vehicles, promoting safe driving practices and accident prevention.\nConduct regular safety training and awareness programs for drivers.Vehicle Maintenance:Coordinate regular maintenance and repairs for vehicles, ensuring they are in optimal operating condition.\nMaintain accurate records of maintenance activities, inspections, and repairs.\n Cost Management:\nMonitor and manage transportation-related expenses, including fuel, maintenance, repairs, and driver salaries.\nIdentify cost-saving opportunities while maintaining service quality.Communication and Reporting:Maintain effective communication with drivers, colleagues, and other stakeholders to ensure smooth transportation operations.\nGenerate and analyze transportation performance reports, identifying trends and areas for improvement.Skills",
    "Skills": [
        "High school diploma or equivalent; relevant certifications or degrees are a plus.\nProven experience in transportation management or a related role.\nStrong knowledge of transportation regulations, safety standards, and logistics.\nLeadership and team management skills.\nExcellent communication and interpersonal abilities.\nProficiency in using transportation management software and technology.\nAnalytical skills to evaluate transportation data and optimize operations.\nProblem-solving and decision-making capabilities.\nAttention to detail and organizational skills.\nAbility to work under pressure and adapt to changing situations."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "All GCC Countries; Qatar",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate; Hospitality & Accomodation; Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}