{
    "Job ID": "4736051",
    "Description": "Builds market position by locating, developing, defining, negotiating, and closing business relationships using an effective business development strategy.You will be the front of the company and will have the dedication to develop the company corporate ID and digital image as well as emerging new projects.Key Responsibilities (Reporting directly to GM):1) Conduct research to identify new markets and customer needs based on understanding of the company’s human resources and capabilities.2) Discuss a business development strategy for the company and its new projects.3) Developing the corporate ID and company image in digital platforms.4) Promote the company’s products/services addressing or predicting clients’ objectives.5) Locates or proposes potential business deals by contacting potential partners, discovering, and exploring opportunities.6) Develops negotiating strategies and positions by studying integration of new venture with company strategies and operations; examining risks and potentials; estimating partners' needs and goals.7) Presenting new solutions and services to existing and potential clients.8) Identify potential clients, and the decision makers within the client organization.9) Set targets for sales and provide support that will continually improve the relationship with existing clients and consequently increase the sale revenue.10) Enhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.Skills",
    "Skills": [
        "Desired profile:",
        "• Proven working experience as an entrepreneur and a verified sales track record.",
        "• Smart and friendly personality.",
        "• Excellent persuasion and interpersonal skills.",
        "• Regional market knowledge.",
        "• 5 years of business development expertise in trading/import/export and e-commerce. Proven achievements and track record.",
        "Skills",
        "• Strategic planning.",
        "• Closing Skills, Motivation for Sales, Prospecting Skills, Sales Planning, Selling to Customer Needs, Territory Management, Market Knowledge, Presentation Skills, Energy Level, and Meeting Sales Goals.",
        "• Ability to think creatively and generate original ideas. Excellent writing and presentation skills.",
        "• Very good with numbers. Strong communication and IT fluency (Ms. Project, CRM, SPSS …. etc.).",
        "Languages: Turkish/and or Arabic native speaker, as well as excellent written and spoken English language. French or Spanish will be a plus.",
        "Education",
        "Bachelor’s degree in marketing & sales. MBA is a privilege."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Istanbul, Türkiye"
    },
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}