{
    "Job ID": "4736061",
    "Description": "Cluster Head Projects (Transmission Lines, Substations, UG ), Project Managers (Transmission Lines)Cluster Head Projects (Transmission Lines, Substations, UG) - Full time B.E. / B. Tech (Civil/Mech/Electrical), 22 - 25 years of relevant experience. Should have good knowledge in execution of projects in high voltage of Transmission lines. The candidate should have handled multiple projects in a particular region. Monitor and review project progress and ensure project completion in time and within budgeted cost. Timely report to Country Manger regarding the Project Updates in the given region. Allocate and optimize resources among the projects in the country / region. Supervise project activities from strategic perspective. Handle crucial project issues escalated by the project manager. Focus on stakeholder management and devise business strategy for cost control and profit improvement. Apprise HO in various strategic issues in the region. Interact seamlessly with clients, international authorities, and local authorities, and utilities, suppliers to get new and repeated orders. Plan and forecast project budget and human resource requirements for all projects of that country. Implement engineering systems and controls in compliance with Health & Safety regulations. Liable for negotiating and resolving issues related to taxation/ banking/ emigration & local laws. Promote and monitor various HR initiatives at project sites.Project Managers (Transmission Lines) - Full time B.E. / B. Tech (Civil/Mech/Electrical),15-25 years of relevant experience. Must have experience in execution of projects in high voltage of Transmission lines (380kV), Vendor management, Team Management, Commercial & Contractual, Client Management, Time Management, Project Management Skills, Forecasting, Leadership quality. Handle complete project from award stage (post-tender) to completion stage, Plan and forecast project budget and human resource requirements, Ensure project completion within specified time and budgeted costs. Create and execute project work plans and revise as appropriate to meet changing needs and requirements. Implement engineering systems and controls in compliance with Health & Safety regulations. Maintain complete project documentation with respect to design and construction. Monitor the progress of project and updates corporate office as frequently as required. Communicate with client and discuss about the project, contractual issues, contract validation etc. Co-ordinate with sub contractors to ensure timely delivery of goods at the project site. Handle local purchase and payment related issues. Handle various business development activities like study of upcoming projects, tracking of competitor information, promotion of business, visiting potential clients, making strategic alliances etc in that country. Apprise HO in various strategic issues in the region. Interact with local bodies, political parties to ensure smooth execution. Construct extra claims (change of scope) and process the same till time of realization.Skills",
    "Skills": [
        "Project Management, Risk management and resource management, Commercial focus - Awareness of financial variables affecting the organization, Contract, scope and time management skills, Customer relationship management skills, Knowledge of risk assessment, Construction methods and technology, Contract management, Knowledge of finance and overall project management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Electric Power Production & Transmission; Construction & Building; Electrical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$7,000 - $8,000",
        "Number of Vacancies": "10"
    }
}