{
    "Job ID": "4736664",
    "Description": "1.    Oversee the recruitment process, including job postings, candidate screening, and interviewing, ensuring the selection of top-tier talent.2.    Lead onboarding and orientation programs to ensure smooth integration of new employees.3.    In charge of all payroll related work such as attendance data collection & record, calculation of bonus & deduction, social insurance & tax contributions etc., ensure the payroll to be implemented accurately and efficiently.4.    Monitor performance appraisal processes, providing guidance to ensure consistent and fair evaluations.5.    Utilize HR analytics to track key performance indicators, providing insights to drive data-driven decisions.6.    Prepare regular reports for management, highlighting HR metrics and trends.7.    Implement and communicate HR policies, fostering a culture of consistency and fairness.Skills",
    "Skills": [
        "1.    Bachelor's degree in Human Resource, Business Administration, or a related field; HR certification is a plus.",
        "2.    Familiar with Kingdom labor law policy, process & knowledge.",
        "3.    Strong knowledge of payroll regulations, tax codes, and compliance requirements.",
        "4.    Proficiency in payroll software and MS Office Suite, especially Excel.",
        "5.    Strong interpersonal, communication, and negotiation skills, with an ability to build rapport and resolve conflicts.",
        "6.    5 years' experience in HR management, at least 3 years working experience in recruitment and payroll."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}