{
    "Job ID": "4736096",
    "Description": "Are you passionate about interior design and creating exceptional spaces? Do you possess a strong knack for building relationships and driving business growth? If so, we have an exciting opportunity for you to join our dynamic team as a Sales Executive at CHASE INTERIORS .Role and Responsibilities: We are looking for a bright , Dynamic and result driven  Sales Executive . At CHASE INTERIORS , you will be at the forefront of our business growth strategy. Your responsibilities will include:1.    Business Development: Proactively identify and target potential clients in various sectors who require interior fitout consulting services. Utilize your market knowledge to identify opportunities and generate leads, And to set and achieve Sales goals and targets.2.    Relationship Building: Cultivate and maintain strong relationships with prospective clients. Understand their needs, preferences, and project requirements to offer tailored solutions that meet their expectations.3.    Consultative Selling: Employ a consultative approach to understand clients' challenges and objectives. Present our range of services and solutions in a compelling manner, showcasing the value we can provide.4.    Customized Proposals: Collaborate with our design and consulting teams to develop customized proposals that align with clients' project goals and budgetary considerations.5.    Negotiation and Closing: Skillfully negotiate terms and contracts with clients, ensuring a win-win situation for both parties. Convert leads into successful projects and contribute to achieving sales targets.6.    Market Research: Stay updated on industry trends, market dynamics, and competitor activities. Use this knowledge to fine-tune sales strategies and position our company as a market leader.7.    Networking: Networking opportunities to expand your professional connections and promote our services.Benefits: We offer a competitive compensation package, including a base salary and attractive commission structure, rewarding your success in driving sales and contributing to the company's growth. Additionally, you'll have the chance to work in a vibrant and innovative environment, collaborating with talented professionals who share your passion for transforming spaces.If you're ready to take your sales career to the next level and play a pivotal role in shaping remarkable interiors.Skills",
    "Skills": [
        "Qualifications: To excel in this role, you should have:",
        "·       Proven experience in sales, preferably within the interior design, construction,Building materials or related industry.",
        "·       Exceptional communication and interpersonal skills.",
        "·       Strong negotiation and persuasion abilities.",
        "·       A results-driven mindset with a track record of meeting or exceeding sales targets.",
        "·       The ability to work independently and collaboratively as part of a team.",
        "·       A keen eye for design and a passion for creating appealing spaces."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}