{
    "Job ID": "4736800",
    "Description": "المسؤوليات:\nصياغة المحتوى المناسب والفعال الذي يتناسب مع منصات التواصل الاجتماعي.\nتطوير استراتيجيات التواصل الاجتماعي التي تتناسب مع أهداف الشركة والجمهور المستهدف.\nإدارة وتنفيذ الحملات التسويقية والمحتوى على منصات التواصل الاجتماعي، بما في ذلك إنشاء المنشورات والصور ومقاطع الفيديو.\nتحليل أداء المحتوى والحملات وتقديم تقارير دورية بالنتائج والتحسينات المقترحة.\nتفاعل مع المتابعين والجمهور بشكل فعال وبناء علاقات إيجابية عبر وسائل التواصل الاجتماعي.\nمراقبة اتجاهات ومستجدات وسائل التواصل الاجتماعي وتطبيق أفضل الممارسات والابتكارات.\nإدارة الجداول الزمنية للمشاركات وضمان التنفيذ المنسق وفقًا للخطط.\nالتعامل مع التعليقات والملاحظات بشكل مهني وتوجيهها للقسم المعني.\nالتفاعل مع الفرق الداخلية لتوفير المحتوى والمعلومات اللازمة للتسويق.\nتطوير استراتيجيات لزيادة عدد المتابعين والانخراط والوصول على وسائل التواصل الاجتماعي.Skills",
    "Skills": [
        ".مهارات مدير منصات التواصل الاجتماعي:\nمعرفة عميقة بمنصات التواصل الاجتماعي المختلفة وأدواتها وقدراتها.\nخبرة في تطوير وتنفيذ استراتيجيات التواصل الاجتماعي.\nمهارات التحليل والتقارير لقياس أداء الحملات وتحقيق الأهداف.\nالقدرة على توليد محتوى مبتكر وجذاب للمنصات المختلفة.\nمهارات تواصل ممتازة وقدرة على التفاعل مع مجموعات متنوعة من الجمهور.\nفهم عميق للاتجاهات والاهتمامات المتغيرة للجمهور على وسائل التواصل الاجتماعي.\nالقدرة على التعامل مع سرعة التغيير والتكنولوجيا الجديدة.\nمهارات إدارة الوقت والتنظيم لتلبية المهام والمواعيد.\nالقدرة على العمل بشكل مستقل وكجزء من فريق.\nمعرفة بأدوات البحث والتحليل المستخدمة في مجال وسائل التواصل الاجتماعي."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Perfume & Cosmetics",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}