{
    "Job ID": "4736675",
    "Description": "Drilling Rig Foreman (Field - 28/28)Supervises and oversees the operations of a contract rig performing drilling or remedial work on wells ranging from 7000 - 15,000 feet. Incumbent will ensure that the contractor performs the work in a safe and acceptable manner and that the contractor meets all the obligations of his contract. Coordinates deliveries of well materials and equipment and ensures it is available when the rig is ready for it.Liaisonman administers the contracts on sight and serves as the primary liaison between the company and the contractor.A) Supervises and oversees all operations performed on wells.B) Makes recommendations on alternative methods or equipment when unusual situations are encountered.C) Coordinates deliveries of materials to the well to ensure it is available when required.D) Ensures that the contractor meets all requirements of his contract.E) Works with Drilling and Workover engineers to see that modern drilling practices are followed.F) Approves contractor daily tour report.G) Ensures that contractor rig and equipment are properly maintained to avoid downtime.H) Performs other miscellaneous duties as directed by Supt.I) Ensures that Saudi Aramco Blowout Prevention Standards are met in all respects including equipment configuration, testing, and crew response. Assures that rig and personnel comply with Saudi Aramco's established safety standards and procedures.Skills",
    "Skills": [
        "Thirteen (13) years relevant experience in drilling and workover operations including supervisory experience generally acquired by progression on a drilling or workover rig.",
        "-OR-",
        "2) A. B.S. degree in Engineering.",
        "B. Seven (7) years of experience working in drilling and workover operations including adequate supervisory experience on a drilling or workover rig.",
        "C. Willing to live in remote areas in mobile camps."
    ],
    "Preferred": {
        "Years of Experience": "Min: 13"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}