{
    "Job ID": "4736372",
    "Description": "The Security Systems Service Engineer will be in charge of recruiting ,organizing and directing the technical teams involved in the installation, maintenance & configuration of the systems proposed for a project. This includes monitoring the team, instructing technicians and laborers, configuring the system, testing and commissioning, etc. Job Responsibilities:Carrying out quality inspections on jobs\nDirecting, instructing and supervising the technicians and supervisors.\nLiaising with client departments and customers in project execution.\nDiagnosing breakdown problems and faults\nCarry out installation duties when and where required.\nProgramming and configuration of the system proposed.\nMonitor the project activities and reporting back to the Head of services daily.\nAssist the Head of services in preparation of project schedule, revenue calculation, technicians training etc.\nProject handing over and preparation of delivery notes, project correspondence etc.\nPerform additional assignments per the direct manager's direction.Skills",
    "Skills": [
        "Should have a bachelor's degree (or equivalent) in Electronics or electrical.\nGood verbal & written communication in English; Communication skill in Arabic in added advantage.\nGood technical knowledge in Low current systems like CCTV/Access Control/intrusion detection systems / X-rays / road blockers, etc.\nAbility to work under pressure in a dynamic environment.\nProfessional presentation skills; self-starter; cooperative attitude; team player.\nHighly result orientated with a strong drive to deliver/succeed.\nGood organisational and time management skills\nGood Computer Knowledge\nFast learner and dedicated."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Izdihar, Riyadh , Saudi Arabia",
        "Company Industry": "Security & Fire Systems",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Security",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}