{
    "Job ID": "4736112",
    "Description": "Are you a successful car insurance salesperson or a dynamic financial services consultant who has been working in the UAE for the past 3 years? If you have a wide network of clients, strong telesales background, and are interested in selling motor insurance, we have just the right opportunity for you. We provide a thorough, comprehensive Motor Insurance training program and would like to hear from you.A Business Development Manager with us will be a confident, “hungry” salesperson with the drive to generate and convert leads, develop their portfolio, and close sales successfully; focusing on both personal and commercial motor insurance.Role Responsibilities:• Gaining new business by identifying and exploiting opportunities in the local market.• Developing and maintaining good working relationships with referral clients, dealerships, and direct clients.• Introducing new products and promoting them through regular visits and frequent communication with clients.• Increasing profitability of existing product lines by encouraging clients to use added value services wherever possible.• Consulting and promoting the most effective cover for a particular need, taking a number of factors into account.• Delivering good customer service by responding swiftly to queries and concerns from clients.• Maintaining detailed knowledge of new and existing products by liaising with colleagues.• Ensuring credibility with clients by maintaining detailed knowledge of current market conditions and competitors' products.• Monitoring and reporting on performance against agreed sales targets, sometimes including monitoring the performance of other sales staff.• Working with underwriters to amend policies where necessary in order to meet client demand.Skills",
    "Skills": [
        "Bachelor's degree or equivalent in Business, Marketing, or a related field. A Master’s degree would be an added advantage.\nMinimum of 3 years of UAE experience in motor insurance/bancassurance sales.\nConfidence in independently producing car insurance business and achievement of monthly and yearly targets"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 7",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 23 Max: 33"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}