{
    "Job ID": "4736240",
    "Description": "الوصف الوظيفي مدير الصيانة والتشغيل\n·        دراسة جميع المشاريع المطروحة من قبل الجهات الحكومية والجهات الأخرى الخاصة بالصيانة والتشغيل للدخول بها\nالتخطيط والإشراف على جميع مشاريع الصيانة الخاصة بقطاع الصيانة والتشغيل\nتحمل المسؤولية عن المشاريع وكل ما يطرأ عليها.\nإعداد جدول عمل تفصيلي لكل مشروع بالإضافة إلى خطط العمل .\nالاحتفاظ بسجلات مشاريع الصيانة والتشغيل و حل جميع المشاكل اليومية.\nتحديد المهام وتقسيم المهام على الفنيين والعمال والإشراف على إجراءات التنفيذ.\nاعداد ومتابعة الموازنات الخاصة بالمشاريع وتخفيض حجم النفقات.\nتنسيق الموارد الداخلية للمشروع والتنسيق مع الأطراف الخارجية والموردين وذلك لضمان سير المشروع على أكمل وجه دون عيوب\nوضع خطة تفصيلية لكل مشروع ومتابعة التقدم في العمل عليه\nالمتابعة الدورية لمؤشرات الأداء و اعداد تقارير نسب الإنجاز بالقطاع  ورفها للإدارة العليا .\nالاشراف والمتابعة الميدانية لمشاريع الصيانة والتشغيل والمبادرات الحكومية الخاصة بالمشاريع للتأكد من كفاءة وجودة التنفيذ والالتزام بالمواصفات الفنية المعتمدة.\nاعداد التقارير الدورية والفنية عن اعمال الصيانة للمشاريع وملاحظات الجهات عليها .Skills",
    "Skills": [
        "المهارات اللازمة لوظيفة مدير الصيانة والتشغيل:\nالتفكير التحليلي والإبداعي\nإعداد الموازنة التقديرية\nإدارة المشاريع\nالتفكير الاستراتيجي\nتحليل المشكلات واتخاذ القرارات\nاجادة مهارات التخطيط لعمليات الصيانة.\nادارة الموارد بفاعلية\nالتركيز على النتائج\nالقدرة على استخدام برامج مايكروسوفت اوفيس.\nفهم جيد للجوانب الفنية والحرفية\nالقدرة على متابعة الانشطة المختلفة وتقديم التقارير الدورية.\nاجادة مهارات التواصل مع الشخصيات المختلفة.\nمتطلبات العمل في وظيفة مدير خدمات الصيانة:\nالحصول على بكالوريوس في الهندسة\nالخبرة العملية السابقة في وظيفة مدير صيانة وتشغيل."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 5 Max: 15",
        "Residence Location": "Egypt; Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Sakaka, Saudi Arabia",
        "Company Industry": "Technical Maintenance & Repair; Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}