{
    "Job ID": "4736233",
    "Description": "Summary:We are seeking an enthusiastic and creative Marketing Specialist to join our team at our fast-food restaurant, which has five branches. You should have a strategic vision and the ability to develop and execute successful marketing campaigns to increase restaurant awareness and attract more customers.Responsibilities:Develop and implement marketing strategies to increase restaurant awareness and attract more customers.\nManage advertising campaigns on social media platforms and online advertisements.\nCreate and enhance marketing content such as posts, images, and videos.\nDesign advertisements and posts, either independently or in collaboration with online designers.\nMonitor and manage interactions with delivery apps to ensure a smooth ordering and delivery experience for customers.\nAnalyze data and utilize it to measure the effectiveness of marketing campaigns and make strategic decisions.\nDevelop partnerships with media outlets or other entities to increase restaurant visibility.\nCoordinate and organize promotional events and offers across branches.\nStay updated on fast-food market trends and competition, providing suggestions to improve marketing strategies.Skills",
    "Skills": [
        "Previous experience in marketing, preferably in the restaurant or food service sector.\nExcellent communication skills and the ability to build good relationships with the audience and media.\nFamiliarity with the latest digital marketing trends and effective use of social media.\nAbility to work independently and within a team.\nAnalytical skills to measure campaign success and identify areas for improvement."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}