{
    "Job ID": "4736060",
    "Description": "We are an esteemed and innovative early childhood education institution located in Abu Dhabi, dedicated to nurturing the intellectual, social, and emotional growth of young minds. Our commitment to providing a stimulating and supportive learning environment has earned us a reputation for excellence in early childhood education. As we continue to expand our offerings, we are seeking a passionate and experienced Nursery Teacher to join our team.Key Responsibilities:Foster a positive and inclusive classroom environment where each child feels valued, respected, and encouraged to express themselves.\nUtilize a variety of teaching methods, materials, and resources to engage students and cater to diverse learning styles.\nMonitor and assess each child's progress, keeping detailed records and communicating effectively with parents or guardians.\nCollaborate with fellow educators and staff to create a cohesive and dynamic learning community.\nOrganize and participate in extracurricular activities and events that enhance the learning experience.\nPromote health, safety, and hygiene practices within the classroom and supervise children during all activities.\nSupport the development of life skills, social skills, and emotional intelligence in young learners.\nStay updated on the latest research and trends in early childhood education, integrating best practices into your teaching approach.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor's degree in Early Childhood Education or a related field\nMinimum of 3 years of teaching experience in a nursery or early childhood education setting.\nFamiliarity with international early childhood education standards and best practices.\nStrong understanding of child development principles and different teaching methodologies.\nExcellent communication skills, both verbal and written, with the ability to engage effectively with students, parents, and colleagues.\nPassion for teaching and a genuine love for working with young children.\nPatience, creativity, adaptability, and a positive attitude.\nAbility and willingness to relocate to Abu Dhabi, United Arab Emirates.\nFemale "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 20",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Preschool, Nursery, & Daycare",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "15"
    }
}