{
    "Job ID": "4736850",
    "Description": "Knowledge:Maintain comprehensive technical knowledge of HVAC products (VRF, Ducted, Splits, Chillers) and services offering, market intelligence, industry trends and completion in their assigned territory. Knowledge of basic HVAC design and estimation of Unitary /chilled water systems projects. System and Process:Awareness of policies concerning product programme, sales channels, pricing, sales promotion, credit, stock levels, payment plans, as well as changes in these policies whenever this is deemed desirable. Also maintaining Sales/Project records as per ISO standards. Team Relationship:Support and communicative positively with Projects department and other departments in AFET to Grow the business and their respective goals. Events:Representing the company in the most professional manner at all times.  Required Skills to be successful:-At least 5 years’ experience in Sales of A.C equipment in Dubai/ Sharjah market with good business contacts with consultants/developers/contractors and Dealer Network in Dubai and NE with excellent track record.\nCustomer focussed.\nProactive attitude\nA team player, who possess a positive attitude and willingness to learn.\nExcellent spoken/written communication in English (Arabic will be preferred)\nGood Presentation skills\nGood commercial skills-selling/negotiation skills\nProficiency in MS Office (Outlook, Word, Excel, PowerPoint) and competent letter writing\nValid UAE driving licence.  What equips you for the role:Bachelor Degree in Mechanical engineering\nKnowledge of Ducted splits , Package Units, VRF units, AHVs & FCHs. Also Knowledge of Air-conditioning design and experience in software selection of VRF products.\n4-5 years’ experience in Sales of Air conditioners especially Ducted Splits and Package Units and VRF Units with good sales record of accomplishment in UAE market\nGood business contacts with consultants/developers/MEP contractors. \nDynamic personality, and flexible.\nResults oriented.\nMust possess strong motivational and Interpersonal skills to create a positive environment.\nTo Lead by example by being able to innovate and develop new /alternative strategies continuously and consistently to achieve the Sales and order booking targets.\nTaking Initiative\nDrive for Results\nGood communication skills (verbal and written)\nStrong/excellent attention to detail Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}