{
    "Job ID": "4736890",
    "Description": "Brand Marketing Executive (Perfumes & Cosmetics)Key role and responsibilities in the product marketing strategy of the assigned brand to achieve the company objectives.\nSignificant role in analyzing the market and competitors.\nProvide advice for product positioning with local marketing perspective.\nConduct research through methods such as survey, polls, focus group and statistical analysis, ensuring informed decisions on product specifications and line-up.\nResponsible for maintaining the product calendar and product life cycle schedule.\nEnsure the product launched is competitive in the market.\nSupporting the marketing promotional campaign and initiatives for the brand, such as special promotions, sponsored events, etc (e.g PWP, Discounts, etc).\nAssist in stock ordering.\nCreate and maintain a library of product information, visuals, and customer review.\nKeep current with supply and demand, trends, economic indicators and competitors.Skills",
    "Skills": [
        "Candidate must possess at least a Bachelor’s Degree in Marketing, Business Administration or any other related field\nAt least 2 years of working experience in beauty products or relevant industry is required for this position\nAnalytical, Self-Motivator, Excellent Interpersonal and Communication skills\nIn tune with market conditions as well as demographic and industrial trends\nAble to work independently and within a team\nStrong professional ethics and capable of maintaining confidentiality\nProduct marketing experience will have added advantage\nPreferably Executive specialize in Personal Care/ Beauty/ Retail Service or equivalent"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Perfume & Cosmetics",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}