{
    "Job ID": "4736864",
    "Description": "Key Account Manager (Software Solutions Sales) local IT market (Customers/Prospects, Competition, Regulations, etc..).\n Ability to apply strategic consultative selling techniques or/and power base selling methodology.   \nPinciples and methods for showing, promoting, and selling products or services. This includes sales strategy and tactics, product demonstration, sales techniques, and sales control systems.Skills",
    "Skills": [
        "  A bachelor’s degree in a relevant discipline.\nMinimum of 5 years of field experience in selling Software Solutions in the local market.\nHighly developed verbal and written communicative skills.\nExcellent leadership skills to manage and lead a group of sales personnel.\nWell organized in order to manage time, develop plans, organize schedule.\nThe ideal candidate should have 3-5 years of software solutions/services sales experience.\nShould be fluent in Arabic and very good in English\n   Should have a proven track record in selling software solutions in Kuwait Market.   \nShould be able to travel and stay in the different prospect countries according to the business needs.\nShould ideally have all/most of the following knowledge:\n Knowledge of relevant industry products (Enterprise Solutions).\n Knowledge of the relevant local IT market (Customers/Prospects, Competition, Regulations, etc..).\n Knowledge and ability to apply strategic consultative selling techniques or/and power base selling methodology.   \nKnowledge of principles and methods for showing, promoting, and selling products or services. This includes sales strategy and tactics, product demonstration, sales techniques, and sales control systems."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 6",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Sales Outsourcing; Software Development",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}