{
    "Job ID": "4736011",
    "Description": "Job Opportunity: Lifting EngineerCompany: Coral Safety ConsultancyPosition: Mechanical Engineer - Lifting Inspector Location: DUBAI, UAEAbout Us: Coral Safety established in 2001 as a third party inspection company for testing and certification of all kinds of lifting equipment, cargo gear, loose lifting gear in the onshore industrial sector as well as on ships, offshore vessels and oil and gas installations.  Responsibilities:Lifting Equipment Inspector (Test Inspector)Equipment Inspection: Lifting inspectors thoroughly examine lifting equipment to ensure that it meets safety standards and regulatory requirements. Collaborate closely with multidisciplinary teams to ensure seamless integration of safety measures and technical requirements.\nDocumentation: Lifting inspectors maintain accurate records of their inspections, including details about the equipment's condition, inspection dates, and any corrective actions taken.\nSafety Compliance: They verify that lifting operations adhere to safety guidelines and regulations. This includes checking that appropriate safety measures, such as load capacity limits, warning signs, and operator training, are in place.\nCertification: After a successful inspection, lifting inspectors may issue certificates of compliance or fitness for the lifting equipment. These certificates serve as official documentation that the equipment is safe to use.\nTesting Procedures: Lifting inspectors often perform various tests on equipment, such as load tests, to determine its capacity and stability.\nAdditional Responsibilities: Regulatory knowledge, Training and Education, Problem Solving, Communication, Field work and Continuous Improvement.Skills",
    "Skills": [
        "Bachelor's degree in mechanical engineering\n4 years of experience in an engineering discipline, ideally another EIAC Inspection Body\nIn Depth understanding of EIAC guidelines, industry benchmarks, and safety protocols.\nPrior EIAC audit experience in Lifting equipment and accessories.\nExceptional analytical abilities coupled with an unwavering attention to detail.\nEffective verbal and written communication skills for liaising with clients, team members, and stakeholders.\nAbility to independently manage tasks and efficiently handle time-sensitive assignments."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Mechanical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}