{
    "Job ID": "4736042",
    "Description": "We are a private tourism company based in Dubai looking for a young and talented individual for the following position.Responsibilities:•            Liase with PRO for visas, medical, process, for existing employees medical, emirates ID and work permit renewal•            Handle onboarding and offboarding processes, including documentation, exit interviews, and clearance procedures.•            Manage travel arrangements, visa processing, and accommodation for employees.•            Assist in payroll processing and ensure timely and accurate salary disbursement.•            Conduct disciplinary action and handle employee grievances in a smoother way.•            Collaborate with the HR team in implementing HR policies, procedures, and best practices to promote a positive work culture.•            Maintaining all employee records in hard copy and soft copy.•            Provide general administrative support to the management team as required.•            Process health cards and keep employees up to date with necessary information.•            Assist with day-to-day operations of the HR functions and duties including updating records, assets issuance, employee requests etc.•            Conduct initial orientation for newly hired employees.•            Coordinate recruitment, communication with candidate’s schedule interviews, providing feedback.•            Tracking off Visa and work permit renewal master in the system•            Handle documents request by the employees.•            Ensure compliance with UAE labor law.•            Any new assignment as and when required.Skills",
    "Skills": [
        "Requirement:",
        "•            Proven experience of 1-2 years as an HR Executive in the UAE.",
        "•            Bachelor’s/Master’s degree in human resources",
        "•            English and Urdu spoken and written skills.",
        "•            Proficiency in MS Office, including Word, Excel, and PowerPoint",
        "•            Knowledge of local HR rules and regulations.",
        "•            UAE Driving License is preferred.",
        "•            Pakistani Nationals Only",
        "•            Ability to manage multiple priorities, coordinate administrative tasks.",
        "•            Ability to handle confidential information with utmost integrity."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Dubai, United Arab Emirates ; Sharjah, United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India; Pakistan",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Tourism, Museum, & Cultural",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}