{
    "Job ID": "4736714",
    "Description": "Monitoring and controlling the progress of construction activities will be a crucial part of your role, addressing any issues that may arise to maintain project efficiency.\nWork collaboratively with architects, engineers, and subcontractors to create detailed project plans and schedules, efficiently allocating tasks and responsibilities among team members.\nSupervise and coordinate construction projects throughout their lifecycle, from planning to execution, ensuring timely completion, adherence to budgetary constraints, and strict adherence to safety regulations.\nYour responsibilities as a Construction Manager will revolve around overseeing and coordinating construction projects from inception to conclusion, ensuring they are executed within specified timelines, budgetary limits, and in compliance with safety protocols.\nFulfill your role as the primary point of contact, consistently updating clients, senior management, and other stakeholders on project status, budgetary shifts, and critical modifications.\nEffective collaboration with architects, engineers, and subcontractors will be essential as you create comprehensive project plans and schedules, ensuring tasks and responsibilities are assigned optimally among the team members.\nFamiliarity with project management software and tools for scheduling, cost estimation, and resource allocation, and the ability to analyze and interpret project data are essential requirements for this position.Skills",
    "Skills": [
        "Experience in managing major projects in oil & gas industry or environmental industry.\nHighly familiar with heavy equipment fleet management, planning and execution of soil remediation program management, contaminated soil excavation and movement activities and familiar with environmental remediation projects.\nA Bachelor's degree in Civil / Environmental Engineering,\n15 years' relevant experience\nProficiency in utilizing project management software and tools for scheduling, cost estimation, and resource allocation, along with the ability to analyze and interpret project data, is crucial for this role."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Oil & Gas; Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}