{
    "Job ID": "4736925",
    "Description": "Under the supervision of the REACH Yemen Research Manager, the REACH Senior GIS Officer is responsible for managing and coordinating all the GIS activities within the Early Recovery Unit. He/She oversees all GIS projects and mainstreams GIS components within all portfolios in Yemen. Moreover, under the supervision of the REACH Yemen Research Manager, he/she sets a yearly strategy for GIS activities and reviews the budget spending related to GIS activities on a quarterly basis.The Senior GIS Officer is responsible for the application of geographic information systems in REACH Yemen, including relevant aspects of research design, support in designing data collection tools, ensuring (spatial) data quality, geospatial analysis, drafting of maps, and (as relevant) production of web maps and information management systems. The Senior GIS officer will provide technical inputs in all research cycle stages. Throughout each research cycle, the Senior GIS Officer, in close liaison with the assessment teams, engages with partners to promote their participation and maximize their impact. He/she will be responsible for conducting flood mapping activities and collaborating with the clusters’ coordinators to discuss data management and protection policies and how to disseminate data. The Senior GIS Officer will also be responsible for developing and implementing a continuous capacity-building program for national and international team members, and (when relevant) for providing training to partners. Finally, the Senior GIS Officer will be responsible for discussing projects’ ToR and projects’ implementation and monitoring with HQ and validating all of the assessment and analysis results with the latter.ObjectivesUpdate and oversee GIS activities within the Early Recovery Unit.\nConducting applied research (e.g. Natural hazard modelling, flood risk management/mapping) by leveraging remote sensing technology.\nEnhance relationships and communication with external stakeholders (clusters, donors and other stakeholders).Duties and Responsibilities Research Planning:In coordination with relevant assessment officer(s), support assessment planning in line with project and program objectives and with REACH’s research cycle and other relevant guidelines;\nMap and analyse secondary data in coordination with the assessment officer(s);\nContribute to draft assessment ToRs with a specific focus on the analysis plan, and related mapping, as well as data management plan;\nSupport the development of qualitative and quantitative data collection tools, ensuring GIS requirements of research cycle/assessment are met;\nDevelop geo-spatial analysis of assessment areas to be used in developing assessment plans, and accompanying operational maps for research teams;\nIn coordination with relevant assessment officer(s), support construction of quantitative sample;2. Research Implementation: When relevant, support the training of enumerators for data collection;\nWhen relevant, support oversight of data collection, in line with agreed TORs, including spatial verification and validation as part of assessment checks;\nEnsure that collected data is properly geo-referenced, enabling the production of maps and related products;\nIn coordination with relevant assessment officer(s), document all changes in data collection that lead to a modification in the agreed TORs, ensuring that the REACH CR and IMPACT HQ are informed and agree on the modifications.3. Data management, cleaning and analysis:Ensure that all collected data is stored in line with IMPACT’s Data Management Guidelines, and with the ToRs;\nEnsure that data is revised and cleaned, and that all revisions are recorded;\n Conduct spatial analysis on collected data as per ToRs;\n Ensure that data and its spatial analysis are validated by IMPACT HQ before product drafting stage;\nEnsure that data and its analysis do not contain personal or other sensitive information and are validated by IMPACT HQ before sharing to external parties;\nEnsure the quality and accuracy of technical information provided as well as the confidentiality and protection of collected information. 4.Drafting of products:\n Ensure accurate linkages between spatial databases and assessment data;\nEnsure that the GIS products meet the requirements of REACH and concerned partners;\nMaintain regular communication with IMPACT HQ on progress and deadlines for GIS/RS products;\nEnsure the drafting of timely and accurate GIS/RS products, which comply with IMPACT’s guidelines;\nEnsure that all GIS/RS products are validated by IMPACT HQ before external release;\nWhen relevant, in close coordination with IMPACT HQ, support the regular maintenance and update of web GIS/RS products;5. External Engagement:In support of the assessment team, link with relevant partners to consult and involve them in the GIS/RS components of a research cycle;\nWhere relevant, represent REACH in relevant meetings/ working groups;\n Follow up on issues identified by partners or during meetings / working groups;\nPromote an active use of datasets, GIS/RS products and research findings by partners and the broader humanitarian community for their decision making;\nWhere relevant, support the presentation of research findings through GIS/RS inputs to relevant third parties in order to enhance their use and impact;\nEnsure that all partner engagement and all external relations are clearly documented and communicated with the line manager and relevant colleagues; 6.Develop Flood modelling system:\nProduce detailed flood outputs using HEC-RAS and HEC-HMS software to help clusters and stakeholders inform their response;\nIn coordination with the RM, liaise with IMPACT HQ on the procurement of UNOSAT services and satellite imagery;\nOther tasks as requested by supervisors.7.Internal Coordination:Actively participate in regular team meetings;\nEnsure regular coordination and exchange with relevant colleagues;\nEngage in the development and implementation of REACH’s strategy in Yemen.Skills",
    "Skills": [
        "Fluency of English and Arabic is mandatory.\nBachelor’s or Master’s degree in GIS, Data Science, Information System/Management, Geography, or related disciplines.\nMinimum 4 years of experience in GIS, Information Management and Team management, preferably in the humanitarian context.\nPrevious experience with industry standard mapping tools, ESRI products.\nProficiency with interactive dashboard platforms like Power Bi, Tableau or R.\nPrevious experience in Remote Sensing.\nPrevious experience in Flood risk mapping using HEC-RAS or any similar software.\nVery Good organizational, communication and interpersonal skills.\nAbility to think creatively in terms of tool and process development.\nAbility to operate in a cross-cultural environment requiring flexibility.\nFlexibility and adaptability to ever-changing needs and responsibilities.\nFamiliarity with the aid system and understanding of donor and governmental requirements is an asset.",
        "Desirable",
        "Prior knowledge of the region.\nPrior experience in the Humanitarian Architecture system.\nPrevious experience in managing a team."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}