{
    "Job ID": "4736866",
    "Description": "Greet customers warmly and provide assistance upon entry to the store.\nEngage with customers to understand their needs and preferences, offering personalized recommendations.\nAssist customers in locating products, answering questions, and providing information about features and benefits.\nPerform product demonstrations and provide information on promotions and discounts.\nHandle cash and electronic transactions accurately and efficiently.\nMaintain a neat and organized store appearance by arranging products, replenishing shelves, and ensuring proper pricing and labeling.\nCollaborate with team members to achieve sales targets and deliver excellent customer service.\nUpsell and cross-sell products to increase the average transaction value.\nHandle customer concerns, inquiries, and returns in a professional and customer-focused manner.\nStay updated on product knowledge, industry trends, and store policies.\nAssist in inventory management by conducting stock counts and replenishing merchandise.Skills",
    "Skills": [
        "Skills and Qualifications:\nHigh school diploma or equivalent; additional education in retail or sales is a plus.\nProven experience in customer service or sales, preferably in a retail environment.\nStrong interpersonal and communication skills.\nCustomer-focused mindset and a genuine passion for assisting customers.\nAbility to work effectively in a fast-paced and dynamic retail setting.\nBasic math skills for accurate transactions and cash handling.\nAttention to detail and ability to maintain an organized and clean store environment.\nProficiency in using point-of-sale (POS) systems and other retail software.\nTeam player with a positive attitude and strong work ethic.\nFlexibility to work evenings, weekends, and holidays as required by the retail schedule.\nAbility to stand for extended periods and lift moderately heavy items when necessary."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Fashion & Apparel",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "6"
    }
}