{
    "Job ID": "4736750",
    "Description": "Job DescriptionOur Mission is to Simplify Life. We are looking to Simplify and automate complex decision-making for customer centric industries, like Utilities, Financial Services, Logistics, and commerce, that drive the world's economies and you have the chance to join the revolution. We are trying to solve huge challenges in today's enterprise that are directly impacting the employee and customer experience.What can we promise you:You’ll join a global family of awesome, passionate people that are working together to build a sustainable, scalable ecosystem committed to using logic to create a better experience.\nWe want you to help us become better. You will be empowered to drive change and innovate.\nThat we will invest in you. We will give you the opportunity to master your domain and drive excellence.Job Summary:As the Culture & Happiness Associate at Avertra, you will be working closely with the CEO and Chief Of Staff to maintain the organization’s culture. You will be the ambassador for the workforce’s mindset and set of beliefs.Job Responsibilities:Employee Relations:Act as an active listener to employees to become the liaison between employee welfare and executive management. \nCultivate a relationship among employees as well as other executives.\nPlan and carry out events and team-building initiatives for our global workforce.\nOversee, manage, and document employee conflicts and grievances.\nTravel to global Avertra sites to build personal relationships with employees.Employee Mindset:Plan and execute employee sessions and workshops for our global workforce about topics that align with Avertra’s core values and cultural beliefs.\nWork with Learning & Development to ensure that core Avertra values are central to the company’s training, and assessment mechanisms.\nPlan and execute strategies around optimizing communication within the organization at every level and intersection.Employee Experience:Carry out diversity and inclusion programs to meet the company’s equity objectives.\nEnsure that the company’s policies and procedures are in line with the company’s corporate values and beliefs.\nEnsure that all employee touchpoints are optimized and in line with cultural best practices.\nEnsure organizational transparency with employees.\nPresent model behavior to employees in terms of excellence and conduct to set an example.Employee Engagement:Ignite thought leadership projects in the organization to promote innovative thinking within the culture. \nCommunicate the company’s culture-related goals to the organization.\nConduct 1:1 interviews with employees to gauge feedback on cultural initiatives.Culture and Branding:Oversee Avertra’s employer branding by collaborating with Talent Management and Marketing.\nWork with Avertra employees to enhance their personal brands.Employee Strategy, Insights, and Analytics:Create and carry out employee happiness and satisfaction surveys, which will then be turned into tracker reports to provide insight to executive management and produce points of action.\nTrack key metrics such as turnover rate, retention rate, tenure, etc., and maintain the KPIs associated.\nConduct a trend analysis for turnover to produce points of action.\nConduct competitor comparison reports to compare Avertra’s employee experience in relation to its competitors, as well as to stay up to date with industry trends.\nCreate and carry out the strategy and roadmap set for Avertra.\nOversee and maintain Avertra’s value book, and ensure implementation by promoting the values and ensuring that deliberate hiring takes place to ensure “culture fits” with new hires.\nWork with the People division to ensure that incentives and benefits are competitive.Skills",
    "Skills": [
        "Requirements",
        "Needed Competencies: ",
        "Good and clear communication skills.\nLeadership skills.\nAnalytical skills.\nProblem-solving skills.\nPresentation skills",
        "Education:",
        "A bachelor’s degree in Business Administration, Marketing, Psychology, or Sociology.",
        "Experience:",
        "3+ years of experience in a People & Culture role, HR role, or Marketing role.",
        "Knowledge, Skills, and Abilities:",
        "Good and clear communication skills.\nAnalytical and problem-solving skills.\nNative or excellent written and verbal English skills are a hard must.",
        "Preferences:",
        "Experience in the technology industry.\nHolder of an MBA.\nPreferably holder of an American or EU passport.",
        "Travel:",
        "Upon request by Executives.",
        "Work Schedule:",
        "Local Jordanian office hours with flexibility."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}