{
    "Job ID": "4736884",
    "Description": "Experience required:The Head Planner is a critical position necessary to achieve the successful and timely execution of Mega LNG Onshore Project by ensuring effective operation and reporting of Planning and Scheduling in the Business Division.\nOversees Planning and Scheduling of the project program, monitoring alignment with defined targets and identifying deviations and risks to be reported to the EPC Business Division Manager, EPC Project Manager and EPC PMT. Oversees project progress and performance, supports timely identification of potential issues and mitigation actions.\nOversees and manages accuracy, completeness, transparency, and consistency of reporting/dashboards, including those prepared and issued by the EPC Contractor.\nProvides planning representation in PMT meetings; provides an overview on progress, risks, and trends, addressing specific areas of concern and ways to mitigate them. Participates in Schedule Risk Workshops and leads schedule risk assessment to ensure adherence to approved parameters.\nEnsures EPC Contractor’s procedures and processes comply with the contract obligations and other COMPANY requirements. Leads and participates in COMPANY quality assurance audits and reviews to ensure robustness, accuracy and deliverability of baseline schedules and identifies opportunities to enhance overall value.\nSupports COMPANY review of EPC Contractor claims, extension of time submissions and carries out forensic schedule analysis during disputes. Drives timely Management of Change for changes that may affect project schedule targets. Acts as gatekeeper for project planning in the schedule assurance process to ensure deliverability of project schedule milestones in accordance with contractual obligations to meet project handover targets.Skills",
    "Skills": [
        "Minimum RequirementsBachelor’s degree in an Engineering Discipline\nAdvanced professional degree in Project Management or Certified PMP is desirable or equivalent professional association.\nMinimum of 12 years project planning experience in Engineering, Procurement and Construction of major oil & gas projects, preferably LNG.\nMinimum of 5 years of supervisory experience is desirable.\nProject controls/management with significant prior experience of project planning through all project phases from inception to handover.\nWork experience in the GCC Countries is desirable."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}