{
    "Job ID": "4736872",
    "Description": "Job Summary Develop and communicate insightful analysis of business performance to key internal and external stakeholders. Facilitate driving profitability of Wholesale Banking through more effective partnership of the Strategy & Business Performance team with the business.Key AccountabilitiesDevelop, institutionalise, monitor and ensure booking of all revenue streams and identification of the areas of revenue leakage\nDevelop and institutionalize ownership and tracking of KPIs that drive business performance (portfolio and individual level)\nEstablish a standard set of management information aligned with the relevant KPI’s of the business\nCommunicate plans, actual performance, trends to key stakeholders to identify actual vs target deviations\nWork with business to identify variance mitigation actions and tracking\nDay to day liaison with the business and other key stakeholders on business performance and analytics issues and projects\nImprove analytics supporting margin management and risk adjusted returns (FTP and RAROC principles)Skills",
    "Skills": [
        "Other Accountabilities",
        "Required Qualifications:",
        "Bachelor degree in Business or equivalent",
        " ",
        "Required Experience:",
        "Bachelor degree in STEM (science, technology, engineering and mathematics) field\nMinimum 2 years of relevant experience\nSome prior project management experience knowledge\nCommercial - Good understanding of the corporate banking industry and its products/ services. Strong Excel skills.",
        " ",
        "Knowledge, & Other skills:",
        "Fluent in English, Arabic desirable\nExcellent analytical skills especially MS Office – Word, Excel and PowerPoint",
        "Key Interactions",
        "Competencies",
        "Adaptability/Flexibility",
        "Creativity/Innovation",
        "Decision Making/Judgment",
        "Dependability",
        "Initiative",
        "Integrity/Ethics",
        "Personal Organization",
        "Planning",
        "Problem Solving/Analysis",
        "Process PRIME postings manually",
        "Process transaction vouchers received from various Departments (internal)",
        "Productivity",
        "Quality",
        "Receipt and verify the posting and payroll documents received",
        "Results Focus",
        "Self Development",
        "Sense of Urgency",
        "Strategic Thinking/Management",
        "Summary",
        "Vision and Values",
        "Skills",
        "Ability to interact with internal and external stakeholders",
        "Ability to work under pressure",
        "Accuracy and attention to detail",
        "Arabic speaking preferred",
        "Awareness of local cultural and social factors, and labour law provisions",
        "Bilingual (Arabic & English)",
        "Bilingual language skills in English and Arabic",
        "Knowledge of various aspects government requirements and processes of visas, work permits, medical clearance etc",
        "Numerical skills",
        "Proficiency in oral and written English & Arabic (Preferred).",
        "Proficiency in written and spoken English",
        "Risk Management",
        "Thorough knowledge and understanding of Local Labor Laws regarding Qatarization",
        "Time Management skills",
        "Education",
        "Bachelor’s Degree, in Business-related major"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}