{
    "Job ID": "4736808",
    "Description": "المسؤول/ة المباشر/ة:       نائب/ة الأمينة العام/ة\nالمسؤولون تجاهه :            قسم السياسات والاستراتيجيات \nقسم مرصد المرأة\nالهدف العام للوظيفة: مدير/ة وحدة السياسات والرصد: مسؤول/ة عن وضع وتطوير السياسات والاستراتيجيات والدراسات المرتبطة بواقع المرأة في الأردن.\n\nالواجبات والمسؤوليات الرئيسية والعامة لمدراء الوحدات:\n1. إعداد خطط عمل الوحدة واعتماد خطط وبرامج عمل أقسامها ورفعها للجهة المرجعية لإقرارها والإشراف على تنفيذها.\n2. إعداد الموازنة المالية التقديرية للوحدة وبما يتناسب مع أهداف الوحدة وخطط عملها التنفيذية واحتياجاتها.\n3. الإشراف على حسن تنفيذ مهام وأنشطة الأقسام في الوحدة وفق الخطط والبرامج المعتمدة، ورفع التقارير الدورية عن أعمال     ومستوى إنجاز الوحدة بشكل دوري.\n4. العمل على تطوير أساليب وإجراءات العمل باستمرار.\n5. الإشراف المباشر على رؤساء الأقسام في الوحدة وحل مشاكلهم وعقد اجتماعات دورية معهم.\n6. ايجاد المناخ الإداري التنظيمي الملائم في الوحدة وتوفير الوسائل المادية والمعنوية المناسبة لتحفيز الموظفين/الموظفات على العمل والمشاركة والإبداع.\n7. العمل على رفع أداء المرؤوسين وتوجيههم وتطوير قرراتهم وتقييم عملهم.\n8. تنسيق قنوات الاتصال ما بين الوحدة والوحدات الأخرى والعمل على تطويرها\n\nالواجبات والمسؤوليات المتخصصة:\n1. المتابعة لتطوير ومراجعة السياسات المرتبطة بواقع المرأة والمساواة بين الجنسين في الأردن.\n2. الاشراف على وإيجاد قاعدة بيانات وتطوير مرصد وطني لواقع المرأة في الأردن، والمتغيرات والمؤشرات الوطنية والعالمية.\n3. المساهمة في إعداد الابحاث والدراسات المتعلقة بواقع المرأة، وأوراق السياسات.\n4. متابعة الاتفاقيات الدولية الخاصة بالمرأة، وإعداد التقارير الوطنية والعربية والدولية ومتابعة تنفيذ التوصيات المنبثقة عنها.\n5. المساهمة في إعداد الاتفاقيات ومذكرات التفاهم للتعاون مع الجهات المعنية بالتنسيق مع الفريق القانوني والاقتصادي للجنة.\n6. إعداد وتطوير الاستراتيجيات المرتبطة بالمرأة بما فيها الاستراتيجية الوطنية للمرأة ومتابعة تنفيذها. وتقييم مدى الانجاز فيها.\n7. التنسيق مع المؤسسات الحكومية وغير الحكومية والجهات المانحة والمنظمات الدولية.\n8. المشاركة والتفاعل مع الفعاليات الوطنية المعنية بقضايا المرأة وحقوقها الانسانية وغيرها.\n9. المشاركة في الاجتماعات والمؤتمرات والمحافل الدولية وتمثيل مصالح الحكومة الأردنية.\n10. المساهمة في مراجعة التشريعات الأردنية فيما يخص تمكين المرأة وتعزيز الـعدالة والمساواة، والمشاركة وتطوير لائحة المطالب التشريعية وتحديثها.\n11. متابعة ادماج النوع الاجتماعي على المستوى المؤسسي.\n12. أية مهام/تكلف بها من قبل المسؤول/ة المباشر/ة وتقع ضمن نطاق عمله/ها.Skills",
    "Skills": [
        "المؤهلات العلمية:\nالأساسية:             درجة البكالوريوس في السياسة العامة أو الاقتصاد أو القانون أو الادارة  أو أي تخصص ذو علاقة.\nالمرغوب به:          درجة الماجستير في أحد المجالات مثل السياسة العامة أو الاقتصاد أو القانون دراسات المرأة أو أي تخصص ذو \nالخبرات العملية:\nالأساسية:                 6 -8 سنوات خبرة في مجال التخطيط الاستراتيجي ووضع السياسات وتحليلها وإدارة المشاريع.\nالمرغوب بها:           خبرات متخصصة في إعداد أوراق السياسات والدراسات والبحوث ووضع السياسات المرتبطة بتمكين المرأة. \n\nالمعارف والمهارات الفنية:\nالالمام والمعرفة بالسياسات العامة والاستراتيجيات الوطنية ذات العلاقة بالمرأة.\nمعرفة بتطوير الخطط الاستراتيجية التنفيذية والمتابعة والتقييم المبني على النتائج.\nمعرفة بالتشريعات والاتفاقيات الإقليمية والدولية الخاصة بقضايا المرأة والمساواة بين الجنسين وفي مجال حقوق الانسان.\nالالمام والمعرفة في مجال إعداد التقارير الوطنية والدولية.\nالالمام والمعرفة في تحليل وسن السياسات ودراسة أثرها.\n\nالمعارف والمهارات الإدارية:\nالمعرفة في مجال العمل\nالإلمام بالتوجهات والسياسات في مجال عمل اللجنة الوطنية.\nمعرفة المستجدات والمنهجيات الحديثة في مجال العمل.\nاستخدام تطبيقات الحاسوب\nإتقان تطبيقات الحاسوب ذات العلاقة.\nالطباعة باللغتين العربية والإنجليزية\nالتخاطب بكفاءة عالية باللغتين. \n\nإتقان اللغتين العربية والانجليزية:\nإتقان تام للغتين العربية والإنجليزية محادثة وكتابة. \nالقدرة على مراجعة البحوث والدراسات باللغتين العربية والانجليزية.\nكتابة التقارير والمخاطبات باللغتين العربية والانجليزية. \n\n. لن يتم قبول الطلب بعد 28/8/2023"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6 Max: 8",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Unspecified",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}