{
    "Job ID": "4736706",
    "Description": "The Financial Analyst is responsible for analyzing financial data for The Holding Group and providing insights to senior management. This includes developing financial models, forecasting future revenues and expenses, and identifying potential risks and opportunities. The Financial Analyst will also work with other departments to ensure that the company is meeting its financial goals.Job Responsibilities :Analyze financial data to identify trends, risks, and opportunities.\nPrepare financial reports, including budgets, forecasts, and financial statements.\nMake recommendations to senior management on financial matters.\nDevelop and maintain financial models.\nConduct financial research.\nPrepare financial reports and presentations.\nAnalyzing the financial impact of new products or services\nDeveloping and implementing financial risk management strategies\nOverseeing the company's treasury operations\nStay up to date on financial regulations and trends.\nCollaborate with other departments to ensure the financial health of the company.Skills",
    "Skills": [
        "Bachelor’s degree in in Finance\nStrong understanding of financial principles and concepts\nProficient in Microsoft Excel, PowerPoint, and other financial software\nProven Experience in Financial modeling, Risk management, Data analysis, Budgeting.\nExcellent analytical and problem-solving skills\nExcellent written and verbal communication skills\nAbility to work independently and as part of a team.\nStrong attention to detail\nAbility to work under pressure."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}