{
    "Job ID": "4736751",
    "Description": "المسؤوليات:تطوير وتقديم برامج تدريبية شاملة لإعداد المشاركين لاجتياز امتحان شهادات PMP,RMP,ACP.\nتوفير شروحات مفصلة لمفاهيم إدارة المشاريع ومعايير PMBOK.\nتقديم أمثلة واقعية ودراسات حالة لتوضيح تطبيق المفاهيم النظرية.\nتوجيه المشاركين في فهم الممارسات الأمثل في إدارة المشاريع وتحقيق النجاح.\nتقديم نصائح واستراتيجيات للتحضير لامتحان شهادات RMP,ACP, PMP.\nتقييم أداء المشاركين وتقديم ملاحظات بناءة لتعزيز التعلم.\nمتابعة أحدث التطورات في مجال إدارة المشاريع وضمان تكاملها في الدورات التدريبية.Responsibilities:Develop and deliver comprehensive training programs to prepare participants for the PMP,ACP,RMP certification exam.\nProvide detailed explanations of project management concepts and PMBOK standards.\nPresent real-world examples and case studies to illustrate the application of theoretical concepts.\nGuide participants in understanding best practices in project management and achieving success.\nProvide advice and strategies for preparing for the PMP, ACP, RMP certification exam.\nAssess participants' performance and provide constructive feedback to enhance learning.\nStay updated on the latest developments in project management and ensure their integration into training courses.Skills",
    "Skills": [
        "المتطلبات:",
        "حاصل على شهادة , ACP,RMP,PMP من PMI.\nخبرة تطبيقية واسعة في مجال إدارة المشاريع وتوثيقها.\nخبرة سابقة في تدريب المهنيين على دورات أدراة المشاريع.\nمعرفة عميقة بمعايير PMBOK وأفضل الممارسات في إدارة المشاريع.\nمهارات اتصال ممتازة باللغتين العربية والإنجليزية.\nقدرة على توصيل المفاهيم المعقدة ببساطة وفعالية.\nمهارات التحليل والتفكير النقدي.\nقدرة على تكوين بيئة تعليمية داعمة وتفاعلية.\nقدرة على التكيف مع احتياجات ومستويات مختلفة من المشاركين.\nحاصل على ثلاث شهادات:ACP, RMP, PMP",
        "Requirements:",
        "Holds a PMP certification from PMI.\nExtensive practical experience in project management and documentation.\nPrevious experience in training professionals in PMP courses.\nDeep knowledge of PMBOK standards and best practices in project management.\nExcellent communication skills in both Arabic and English.\nAbility to convey complex concepts simply and effectively.\nStrong analytical and critical thinking skills.\nAbility to create a supportive and interactive learning environment.\nAdaptability to the needs and levels of diverse participants.\nHolds three certifications: PMP, ACP, RMP."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services; Training & Education Center; Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}