{
    "Job ID": "4736159",
    "Description": "Security Manager / In-charge (Shopping Mall)Position Overview:The Security In-Charge for is responsible for overseeing and managing all security operations within the mall premises. This role involves ensuring the safety of visitors, tenants, and employees while maintaining a secure environment. The Security In-Charge collaborates with security personnel, tenants, and management to enforce safety protocols and respond effectively to security-related situations.Key Responsibilities:Security Operations Management:Plan, organize, and manage day-to-day security operations to maintain a safe and secure environment within the shopping mall.\nMonitor security personnel activities, ensuring adherence to policies, procedures, and assigned duties.Team Supervision and Training:Lead and supervise the security team, including hiring, training, scheduling, and performance evaluation.\nProvide ongoing training to security personnel on safety procedures, emergency response, and customer service.Access Control and Surveillance:Oversee access control systems, surveillance cameras, and alarm systems to prevent unauthorized access and monitor suspicious activities.\nCoordinate with the security team to respond to security breaches and incidents promptly.\nManaging CCTV Operations team and Control room.Emergency Response Planning:Develop and implement emergency response plans, including evacuation procedures, medical emergencies, and crisis management.\nConduct regular drills and simulations to ensure readiness for various emergency scenarios.Tenant and Visitor Relations:Interact professionally with tenants, visitors, and stakeholders to address security concerns, provide information, and maintain positive relationships.\nHandle customer complaints or inquiries related to security matters.\nManage lost and found activities.Incident Management:Investigate security incidents, accidents, and breaches, documenting findings and implementing corrective actions.\nCollaborate with law enforcement agencies when required.Safety and Compliance:Ensure compliance with local laws, regulations, and industry standards related to security and safety.\nImplement and enforce security policies, procedures, and guidelines.\nCollaboration and Communication:\nWork closely with mall management, vendors, tenants, and external security partners to enhance overall security effectiveness.\nProvide timely and accurate communication regarding security updates and incidents.\nReporting and Documentation:\nMaintain detailed records of security activities, incident reports, and training documentation.\nGenerate regular reports for management, summarizing security operations and incidents.Skills",
    "Skills": [
        "High school diploma or equivalent; relevant certifications in security management are a plus.\nProven experience in security management, preferably within a shopping mall or similar environment.\nStrong knowledge of security protocols, emergency response, and safety regulations & CCTV Operations & Control room.\nLeadership skills and experience in managing security personnel.\nExcellent communication and interpersonal abilities.\nProficiency in security software, access control systems, and surveillance technology.\nAnalytical skills to assess security risks and implement preventive measures.\nAbility to make quick decisions under pressure.\nCustomer-focused mindset and conflict resolution skills.\nAttention to detail and organizational skills"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "All GCC Countries; Qatar",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate; Hospitality & Accomodation; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Security",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}