{
    "Job ID": "4737703",
    "Description": "NorthBay Solutions is looking for a highly skilled and motivated Lead Full Stack Engineer with solid experience in Web & Mobile Application Development and AWS.Skills",
    "Skills": [
        "The ideal candidate is a creative individual who thinks out of the box and would like to work in a diverse technology environment. We are looking for a candidate to bring passion and dedication to this position and must be a great motivator who can thrive in an Agile environment.",
        "The candidate must be required to have experience of over 10 years.",
        "10+ years of hands-on experience with designing & developing web and mobile applications\nHands-on experience of React with Typescript, Amplify, Material UI with React\nHand-on experience with LangChain, Embeddings, Vector Database\nThe candidate should be expert in Python\nHands-on experience of FastAPI and Rest APIs\nProficient with AWS Services like ECS, Cognito, Cloud Watch, RDS: Postgres, API Gateway, Lambda\nExperienced in writing unit tests\nHands-on experience with Docker\nHands-on with Bitbucket and Git\nCandidates must have strong communication skills to work with various stakeholders, including customers\nExperience with SCRUM-based, Agile software development practices and familiar with Jira\nThe candidate must be able to manage and mentor a team of engineers",
        "Note: ",
        "The candidate should be willing to move to onsite (UAE).",
        "NICE TO HAVE:",
        "Hands-on experience with Flutter for mobile app development and experience in publishing mobile apps to iOS and Android stores would be an added advantage"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Software Development; IT Services; Business Consultancy Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}