{
    "Job ID": "4737993",
    "Description": "Job description:We are seeking a highly skilled and motivated Civil Structural Engineer to join our team. As a Civil Structural Engineer, you will be responsible for designing, analyzing, and overseeing various structural elements of construction projects. Your expertise will play a pivotal role in ensuring the safety, stability, and efficiency of buildings, bridges, infrastructure, and other structures.Job Responsibilities:Performs structural design and analysis calculations using governing codes and standards, engineering formulas, skills, and experience.\nProvide drawing for own designs and produce sketches to incorporate in drawings by Designers/Drafters.\nUse computer-assisted engineering and design software and equipment to prepare engineering design documents.\nAssume the lead engineer's role on assigned projects as well as responsible for perform field and supervision activities such as observe and record existing field conditions, take and verify measurements with project area.\nReview shop drawings\nAttend and participate in Client meetings.\nCoordinate work with other disciples such as architectural, mechanical, rtcSkills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor's degree in civil engineering or a related field.\nStrong knowledge of structural analysis software and design tools, as well as proficiency in AutoCAD and other relevant software.\nStrong analytical and problem-solving skills to address complex structural challenges.\nDetail-oriented with the ability to prioritize tasks and meet project deadlines.",
        "Other Requirement:",
        "Must be Immediately available.",
        "H R(AT)A L B A N N A-E N G(DOT)COM",
        "Job Type: Full-time",
        "Salary: AED8,000.00 - AED8,500.00 per month",
        "Ability to commute/relocate:",
        "Dubai: Reliably commute or planning to relocate before starting work (Required)",
        "Application Question(s):",
        "Immediately Available?\nSalary Expectations?",
        "Education:",
        "Bachelor's (Required)",
        "Experience:",
        "Oil & Gas: 6 years (Required)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}