{
    "Job ID": "4737167",
    "Description": "Sales Specialist - Hotel SupplyCompany Overview:We are an established supplier of a diverse range of products tailored for the hospitality industry. We are currently seeking a Sales Specialist with expertise in hotel supply to join our team. This role involves engaging with hotel clients, expanding our client base, sourcing products, and ensuring smooth order delivery.Job Role and Responsibilities:As a Sales Specialist in Hotel Supply, you will play a crucial role in expanding our market presence and delivering exceptional service to our clients.Your responsibilities will include:Customer Engagement: Respond to inquiries from hotel customers promptly and professionally. Understand their needs, provide suitable solutions, and build strong relationships.\nBusiness Development: Identify and approach potential new clients in the hospitality industry. Work towards registering our company as an approved vendor for various hotels and establishments.\nProduct Sourcing: Collaborate with potential vendors to comprehend customer requirements. Source suitable products from local and international markets that align with the clients' needs and quality expectations.\nVendor Negotiations: Negotiate terms with vendors, including price, production timelines, and delivery schedules. Work for win-win outcomes that ensure both our company's and the client's satisfaction.\nLogistics Coordination: Liaise with shipping agents to ensure timely and accurate delivery of customer orders. Monitor shipment progress and handle any potential issues.\nRelationship Management: Cultivate and maintain strong relationships with both existing and new clients. Understand their needs and proactively propose suitable solutions.\nMarket Insights: Stay updated on market trends, competitor offerings, and emerging opportunities within the hotel supply sector. Use this knowledge to refine our product offerings and business strategies.Skills",
    "Skills": [
        "Bachelor's degree in Business, Marketing, or a related field (Master's degree preferred).\nMinimum of three years’ experience in sales, particularly within the hotel supply industry.\nStrong understanding of the hospitality industry's procurement processes.\nExcellent negotiation skills, with the ability to strike mutually beneficial agreements with vendors.\nEffective communication and interpersonal abilities.\nProficiency in sourcing products from local and international markets.\nFamiliarity with logistics and order fulfillment processes.\nProblem-solving skills to address any shipping or delivery challenges.\nProficiency in Microsoft Office and CRM software (Ideally Odoo CRM)."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "India; Philippines; Sri Lanka"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale; Purchasing & Procurement; Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}