{
    "Job ID": "4737460",
    "Description": "To plan, implement and direct the overall sales activities of the Company to achieve sales objectives. He directs the team’s focus, set goals, motivates, looks at figures, analyzes budgets, and determines ways to streamline and improve the sales process.The position supports Management by contributing to the successful operation of the Retail Showrooms of DAJ- Co-operatives and Wholesale, and implementation of strategies. Meeting Sales Goals, Negotiation, Market Demand, Sales Planning, Building Relationships, Staff Training, Managing Processes, Market Knowledge, Developing Budgets, and Staffing.The primary responsibilities of a Head of retail are Vendor Management, Pricing & Marketing, and Planning & Stock Replenishment and ControlDetermines annual unit and gross-profit plans by implementing marketing strategies; analyzing trends and results.\nEstablishes sales objectives by forecasting and developing annual sales quotas for each Sales Channel; projecting expected sales volume and profit for existing and new products.\nDevelops a business plan and sales strategy that ensures attainment of company sales goals and profitability.\nResponsible for the performance and development of the Sales Key Accounts.\nPrepares action plans by individuals as well as by team for effective search of new sales leads and prospects.\nInitiates and coordinates development of action plans to penetrate new markets.\nAssists in the development and implementation of marketing plans for as needed.\nConducts one-on-one review with all Key Account to build more effective communications, and to provide insight for the improvement of Account’s sales and activity performance.\nProvides timely, accurate, competitive pricing on all completed prospect applications submitted for pricing and approval, while striving to maintain maximum profit margin.\nMaintains accurate records of all pricings, sales, and activity reports.\nAssists in preparation of Sales proposals and presentations and annual Budget.\nControls expenses to meet budget guidelines.\nAdheres to all company policies, procedures and business ethics codes and ensures that they are communicated and implemented within the team.\nHiring and training new sales representatives. Schedule /Intercompany transfer of Sales Staff, assign daily duties and motivate the sales staff at any retail location.\nProvide staff with product update knowledge\nMotivate sales team to meet or exceed sales goals\nNotify staff of new procedures or policies.\nMaintains sales staff job results by counseling and disciplining employees; planning, monitoring, and appraising job results.Skills",
    "Skills": [
        "Must have a transferable visa or be willing to relocate to Kuwait.",
        "Business degree or related professional qualification:",
        "Minimum of 10 years of experience in retail sales.\nExperience in all aspects of planning and implementing sales strategy technical sales skills\nProven experience in customer relationship management\nKnowledge of market research\nExperience in managing and directing a sales team\nRelevant product and industry knowledge\nExperience with relevant software applications",
        "Excellent written and verbal communication skills (English & Arabic)\nOrganization and Planning\nProblem analysis and Problem-solving\nInformation management\nTeam-leadership\nFormal presentation skills\nPersuasiveness\nAdaptability\nInnovation\nJudgment\nDecision-making\nStress tolerance"
    ],
    "Preferred": {
        "Gender": "Male",
        "Age": "Max: 50"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}