{
    "Job ID": "4737433",
    "Description": "Brand Manager - InfinitiBrand Manager - Automotive Reporting to: Sales & Marketing Director Overview:Our client is the sole distributor of international automotive brands in the GCC. Their operations also include Information Technology, investment, industrial, and finance with best practices in each sector. They are seeking an experienced and strategic Brand Manager to join their team in Kuwait. The ideal candidate should possess a strong background in brand management within the automotive industry, with a proven track record of developing and executing successful branding strategies. As the Brand Manager, you will play a pivotal role in shaping the brand identity, enhancing customer engagement, and driving business growth. This position requires a visionary leader who can leverage their expertise to elevate our brand presence in the Kuwaiti market.Responsibilities:Implement the Brand's Sales Strategy for sales development & customer retention.\nSubmit accurate sales forecasts and business plans based on analysis of actual market trends, sales conversions, invoices, etc.\nPrepare, analyze & review the annual sales forecast, demand, and orders with concerned departments.\nMentor, coach, develop and engage the team to consistently deliver expected business results according to the budget.\nMonitor Sales team performance evaluation and direct them to achieve the sales target and customer satisfaction. Further, sustain a dynamic & motivational work environment and develop Sales team skills to match the business requirements.\nMonitor & analyze the competitors' pricing survey feedback in conjunction with the marketing department.\nMonitor the daily sales performance trend and guide the sales team for better performance.\nMonitor the customers' preferences in order to maximize satisfaction.\nOperate the price schedules & discounts and review the sales activities reports to determine profitability.\nParticipate in external sales activities such as training, conferences, and franchisee meetings.\nManage the facility (showroom, delivery area, . . . etc) to comply with the Brand standards.\nEnsure 100% compliance with the company's Brand Standard Operating Procedures.Skills",
    "Skills": [
        "Requirements:",
        "- Bachelor's degree in Business Administration, Marketing, or a related field. MBA is a plus.",
        "- Minimum of 10 years of experience in marketing, with 3-4 years of experience in a similar brand management role within the automotive industry.",
        "- Proven success in developing and executing effective brand strategies that drive market share and brand awareness.",
        "- Excellent communication, presentation, and negotiation abilities.",
        "- Proficiency in market research and data analysis.",
        "- Creative thinker with a passion for innovation and staying ahead of industry trends."
    ],
    "Preferred": {
        "Nationality": "Lebanon"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}