{
    "Job ID": "4737312",
    "Description": "Be the change. Join the world’s most visionary developer.Red Sea Global (RSG) is showing that there is a better way to positively shape the places we live, work and travel.We are purpose-driven and committed to people and planet. Our transformative programs are a driving force to achieving Vision 2030, as well as leading the world towards regenerative tourism.Join RSG and be part of the positive change for Saudi Arabia and the world.We are looking to hire experienced Senior Construction Managers- Civil/MEP to work on our projects on the Red Sea Development program and ensuring successful delivery.Job Purpose:• To lead construction works on-site by providing CM advice and leadership throughout the construction phase of Civil /MEP works, ensuring construction works are adequately planned, controlled and executed, ensuring appropriate levels of coordination between contractors, sub-contractors and other interfacing parties, and auditing work executed by the contractor in order to achieve safe, successful execution of the project.Job Responsibilities:Strategic Contribution• Assist with the planning and execution of construction-related plans and targets and execute the strategic agenda of the Construction function to deliver RSG vision and mission.• Ensure that the overall construction strategy/plan is executed at site and monitor the performance and execution of those plans in order to achieve functional objectives and deliver the company’s overall strategy.Leadership• Coordinate the various Contractors to ensure that all work is carried out safely and efficiently, in line with the strategic Construction Management plans, policies and procedures.• Manage the Contractors by setting priorities and objectives, managing performance, and providing ongoing feedback, advice and direction to ensure the contractor meets their contractual, legal, moral and other established obligations.• Serve as a role model to ensure RSG (and other’s) employees’ awareness and commitment to RSG vision, mission, values, fundamentals and corporate strategy to establish a highly engaged and motivated human resources, and continuously improve performance.Budget• Be aware of project budgets and ensure works undertaken are in compliance with the various Contractual obligations. Ensure changes and variations are appropriately planned and managed to minimize cost increase. Identify and report areas of Contractor non-compliance / areas of unsatisfactory performance and drive performance improvement opportunities to ensure value for money project delivery.Operational• Take part in the meetings held between the CM/engineering teams and the contractors, help in the cost and quantity estimation, define the scope of work and work conditions, approve with the Senior Project Manager on the construction phase presented by the contractor, give final recommendations in order to kick off works. • Ensure all necessary prerequisites are in place before physically commencing any part of the works. These to include Insurance, Method Statements, Risk Assessments, Execution Plans, ESIAs, CSEMPs, etc.• Ensure all works on site are adequately and safely planned, performed, directed and supervised by the contractor and sub-contractors. Make sure that work is executed as per drawings, specifications, plans and other contractual requirements.• Ensure that all the materials used and that work executed is in line with the contract requirements.• Conduct daily site visits and report to the contractor about issues concerning work execution to fix them.• Ensure that all safety and environmental planning is in place and that necessary measures are taken in order to avoid any accidents or incidents.• Compare planned work versus work executed, make sure that all works are delivered on time and to the required quality. • Report to the contractor any areas of unsatisfactory performance and ensure appropriate action is taken by Contractors to correct them.• Identify and manage the project risks presented by the contractors and consultants or due to the quality of materials, timely sourcing, delivery, and cost of items procured to institute risk avoidance, risk mitigation or risk-sharing measures.Manpower Management• Lead any reporting RSG employees on-site, providing advice and guidance as appropriate.• Coordinate with the contractor and sub-contractor to ensure provision of adequate resources through an efficient workforce plan aligned with the construction phases and work priorities to achieve safe and successful project delivery.• Proactively estimate and forecast required resources, based on the upcoming construction phase, number and qualification of the workforce needed to avoid manpower shortage.Policies, Systems, Processes, Procedures, Standards, and Reports• Follow all relevant functional policies, processes, standard operating procedures, and instructions to ensure that work is carried out in a controlled and consistent manner.• Assist in the preparation of accurate and timely functional MIS statements and reports to meet corporate and functional requirements, policies, and standardsSafety, Quality & Environment• Lead the development of an appropriate Health, Safety, Environmental and Quality culture in the team on site through the application of all appropriate safety, quality and environmental management policies, procedures, and controls to ensure employee safety, legislative compliance, delivery of high-quality products/service and a responsible environmental attitude.Continuous Improvement• Contribute to the identification of opportunities for continuous improvement of Construction function systems, processes, and practices considering ‘international best practice’, improvement of business processes, cost reduction, and productivity improvement.Skills",
    "Skills": [
        "Qualifications & Experience:",
        "• Bachelor’s Degree in Engineering, Construction Management/PMP",
        "• Experience of managing infrastructure and building projects within the GCC highly desirable",
        "• Demonstrable record of taking projects from inception through to final delivery",
        "• Experience and abilities in working effectively within complex teams on challenging projects",
        "• Understanding of the complete project delivery process and disciplines involved",
        "• Broad grasp of commercial project delivery techniques in the region",
        "• Knowledge of FIDIC and other contractual principles",
        "• Minimum 12 years’ experience having worked on major programs with global consultants or developers. Contractor experience is a plus.",
        "Skills:",
        "• Time Management",
        "• Team Management",
        "• Communication Skills",
        "• Ability to work under pressure",
        "• Drive and enthusiasm to emulate the client's vision.",
        "• High level of integrity and drive for excellence.",
        "• Excellent motivational and teamwork skills.",
        "• Exceptional organizational skills and the ability to quickly adapt to changing environments.",
        "• Excellent communication skills to be able to deal effectively with contractors, site staff, third party suppliers and client team.",
        "• Ability to work fluently with various software applications in use in the industry",
        "• CAD Software Skills.",
        "• Revit Software Skills",
        "• Project Planning",
        "• Project Management",
        "Job Context:",
        "The Construction Manager will primarily be based on-site and may need to travel as needed"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}