{
    "Job ID": "4737445",
    "Description": "Research & Development (R&D) Manager is responsible for those activities necessary to lead new product introductions from concept to release, new supplier development and coordination with production.Define, develop, plan and manage Product Development initiatives.\nThe Products that need to be addressed shall include but not limited to LV Switchgear Panels, Withdrawable and Fixed\nMotor Control Centers, Final Distribution Boards& Sheet Steel Enclosures\nSet up the test and validation phases. It includes Design Verification, Validation and Certifications as per IEC Standards IEC 61439, IEC /TR 61641& IEC 62208\nCorrect and improve the product or process.\nSupport the production start-up and product launch\nGather business intelligence to identify new trends and conduct strategic planning.\nCoordinating with other Departments for all design-related work in achieving the milestones.\nPreparation of Product Specifications for Consultants.\nOversee training, mentoring and development of Engineers and CAD designers.\nCoordination of engineering support with the Production Department.\nParticipate in Vendor Meetings and Vendor Development with Purchase and Internal QC Team\nMonitoring product quality & impact of design modifications on product features.Skills",
    "Skills": [
        "Must have a transferable visa or is willing to relocate to Kuwait\nBachelor’s Degree in Engineering (Mechanical/ Electrical) would be preferred. (Master’s Degree a plus).\nMinimum 15 years of Experience in Electrical Switchboard manufacturing. At least 5 years of experience in a similar position.\nBilingual candidates are preferred.\nPositive, proactive attitude and work ethic.\nExcellent communication and problem-solving skills.\nAbility to thrive in an entrepreneurial environment- flexible, self-directed, creative, and team player.\nKnowledge of working with new current Software(s)."
    ],
    "Preferred": {
        "Gender": "Male",
        "Age": "Max: 50"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Research and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}