{
    "Job ID": "4737349",
    "Description": "Responsible for performing procedures to ensure core accounting processes of AP, AR, treasury and so forth are compliant with VAT and other taxation policies/guidelines as set out by the Al Koot and General Tax Authority. Responsible for representing Al Koot in communication with tax authorities & consultants when required during tax inspections or audits.The purpose of having a VAT analyst is to perform the following functionalities:(a) Lead role in upcoming VAT implementation project inside Qatar;(b) Reconciling VAT payable and receivables with various source data and investigating any discrepancies;(c) Monthly/quarterly upcoming VAT return and any other tax returns filing for Qatar;(d) Corporate tax provision calculation, annual return preparation and filing and;(e) Perform tax health checks while forecasting, developing VAT policies and procedures and ensuring compliance to the sameSkills",
    "Skills": [
        "Knowledge & Experience:",
        "Must have Bachelor’s Degree in Finance.\nProfessional qualification from any of the renowned Chartered Institute is an advantage\nMinimum experience required is 5 – 12 years\nStrong background within taxation field (Prior experience within taxation department of big 4 will be given priority)\nComputer Skills\nVAT Policies and Procedures\nWell versed with financial reporting knowledge (including standards) in order to support tax reconciliations against accounting records\nExcellent verbal, written, presentation, and interpersonal communication skills.",
        "Skills needed:",
        "Strong business communication and organisational skills.\nExcellent written and verbal English.\nMicrosoft office skills, particularly excel.\nTime management"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 12",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}