{
    "Job ID": "4737434",
    "Description": "JOB PURPOSELeads the process engineering discipline activities for the assigned project (greenfield and brownfield scope).\nProvide Process Engineering subject matter expertise during Detailed Design /EPC phases of the project.\nEnsures that technical requirements (e.g., basis of design, simulations, reports, studies project specifications, data sheets, etc.) developed during FEED fully comply with project requirements. \nGeneral understanding of multi discipline engineering (mechanical/piping/ instrumentation /etc.) and ability to work closely with multidisciplinary teams.Skills",
    "Skills": [
        "QUALIFICATIONS",
        " ",
        "Broad and extensive knowledge of:\nOil and gas offshore projects (greenfield and brownfield) Engineering \nIn-depth knowledge of Process engineering design\nDesign standards, specifications, codes, and appropriate safety criteria\nOffshore facilities design, construction, and operation.\nBachelor’s or master’s degree in chemical/Process engineering.",
        "KNOWLEDGE AND EXPERIENCE",
        " ",
        "Minimum of fifteen (15) years oil and gas process engineering work experience of which a minimum of ten (10 years) of relevant experience and 5 years in the similar position.\nInternational project experience with Tier-1 EPC Contractors or Client, involved in the projects executing large offshore platforms (i.e., greenfield and brownfield work), pipelines and onshore.\nSound knowledge of the project execution process in large-scale project environments (expenditure >US$ 1 Bn)."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}