{
    "Job ID": "4737415",
    "Description": "Coordinating commissioning and start-up activities in oil and gas domain that include a software-based tracking system for documentation, Procedures, check lists, punch list management, Completion certificates, hand over documentation tracking, performance test documentation etc.\nAdminister, and coordinate the CMS system with multiple user licenses at different locations.\nUsing a CMS platform based on a database or web-based system.\nProcedures, plans and schedules for the pre-commissioning and commissioning activities in Oil and Gas that may include defining systems /sub systems, Project tagging philosophies, equipment tags, Snag lists managing and tracking, Reporting and updating the data base etc.\nMaintain construction records, pre-commissioning, commissioning and startup check sheets for every discipline in coordination with discipline engineers. The templates shall also include FAT/SAT records, Preservation guidelines, Inspection test Plan etc.\nMaintain the CMS system data, update it, record it and report as per agreed norms between Client and contractor.\nThe close-out activities such as handover documentation, Completion documentation, Spare part Interchangeability records, Maintenance management system inputs, shall be configured into the data based and shall be tracked and reported as per schedule.\nCoordination with the engineering team, construction teams and project management team is mandatory and it is expected that the CMS coordinator is aware of HSE &QAC norms followed up for the pre commissioning, commissioning and start-up activities.\nMaintain the software-based tracking system for each and every activity that may involve Pre-commissioning, commissioning, startup Site acceptance tests, resolution of commissioning punch points and following up the document generation for every defined steps.Skills",
    "Skills": [
        "Bachelor of engineering (Mechanical/Process/E&I)\nMinimum 8 years experience in Oil and gas EPIC Project management\nPreference for immediate joinees available locally\nMust have good experience in Oil & Gas Industries in Qatar\nGood experience in coordinating commissioning and start up activities in oil and gas domain that include a software-based tracking system for documentation, Procedures, check lists, punch list management, Completion certificates, hand over documentation tracking, performance test documentation etc.\nMust be able to administer, coordinate the CMS system with multiple user licenses at different locations.\nShould have good experience in using a CMS platform based on a data base or web-based system.\nShould have good experience in the procedures, plan and schedules for the pre-commissioning and commissioning activities in Oil and Gas that may include defining systems /sub systems, Project tagging philosophies, equipment tags, Snag lists managing and tracking, Reporting and updating the data base etc.\nShould maintain construction records, pre-commissioning, commissioning and startup check sheets for every discipline in coordination with discipline engineers. The templates shall also include FAT/SAT records, Preservation guidelines, Inspection test Plan etc.\nPreference will be given to candidates who is already having working experience on completion management system software’s such as ICAPS or WINPCS software etc.\nMust be an engineer who has significant experience in Oil and Gas facilities pre-commissioning, commissioning and start up activities.\nMust be able to maintain the CMS system data, update it, record it and report as per agreed norms between Client and contractor.\nMust be having good knowledge in commissioning system definitions including systems & sub systems, Mechanical completion Procedures, hand over procedures, Punch lists and its categories, Prepare the lists of pre-requisites for commissioning that may include documentation, utilities, consumables, specialized manpower etc.\nThe close out activities such as hand over documentation, Completion documentation, Spare part Interchangeability records, Maintenance management system inputs, shall be configured into the data based and shall be tracked and reported as per schedule.\nA good coordination with engineering team, construction teams and project management team is mandatory and it is expected that the CMS coordinator is aware of HSE &QAC norms followed up for the pre commissioning, commissioning and start up activities.\nMust be able to maintain the software-based tracking system for each and every activity that may involve Pre-commissioning, commissioning, startup Site acceptance tests, resolution of commissioning punch points and following up the document generation for every defined steps.\nShould have good knowledge in upstream and downstream oil and gas facilities and shall have basic knowledge on equipment’s (Rotary & Static), electrical systems, Field instrumentation and Automation systems such as distributed control systems, Data acquisition systems (DAS), Loss prevention systems, Shutdown systems and Asset optimization systems.\nShould have good familiarity with Piping P&IDs, Process flow diagrams, I/O schedules, Cause and effect matrixes, Alarm schedules, Basic civil and mechanical drawings, Electrical drawings etc.,\nIt is preferable to have good knowledge on engineering standards such as Shell Design engineering Practices (Shell DEP), IEEE, IEC, ASME, ASTM, API ETC.\nHe must be able to schedule and plan the close out activities based on a mutually agreed CMS plan and must be able to alert the involved of any delays that may happen due to any reason. Any such occurrence shall be reported, tracked and mitigation measures for such issues shall be mutually prepared and input to CMS system till the resolution."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}