{
    "Job ID": "4737932",
    "Description": "Job BriefWe are in search of a proficient Office Administrator with expertise in DMCC compliance and portal and accounts. This role calls for someone with a keen business sense who can manage administrative responsibilities efficiently.The Office Administrator's duties encompass bookkeeping, payables, and receivables. The right fit for this position would be an individual who excels at multitasking without requiring constant supervision – someone driven, dependable, and trustworthy. The role is pivotal in maintaining the seamless operations of our company’s offices and plays a significant part in propelling sustainable growth.Key ResponsibilitiesOversee office operations to ensure a smooth workflow.\nHandle essential office renewals, including licenses, establishments, insurance, visas, and other related tasks.\nStreamline office activities to guarantee efficient operations and adherence to company policies.\nOrganize agendas, travel arrangements, and appointments for senior management as required.\nAddress phone calls and manage correspondence, including emails, letters, and packages.\nOversee invoicing, budgeting, and bookkeeping tasks.\nMaintain and update records in the company's financial and other databases.\nMonitor office supply levels and reorder when required.\nProduce timely reports and craft presentations/proposals as delegated.\nProvide support to the CEO, Director, and team members as needed.\nLiaise effectively with external auditors and suppliers.Skills",
    "Skills": [
        "Qualifications and Skills",
        "Mandatory experience in DMCC compliance and portal.\nPrevious role as an office administrator or in a similar capacity.\nExceptional communication and interpersonal skills.\nStrong organizational skills with keen attention to detail.\nFamiliarity with standard office management practices and foundational accounting principles.\nProficiency in MS Office and Zoho books software.\nMinimum requirement: High school diploma. A BSc/BA in office administration or a related field will be an advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 8",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}