{
    "Job ID": "4737506",
    "Description": "Our client is looking for a Logistics Executive (Import & Export) to be based in Dubai, UAE.Duties and Responsibilities:Be in charge of the administration of contracts / orders and ensure their proper execution.\nThe Sales Administration Officer will handle the contract execution once the contract review has been finalized with the sales representatives. He/She will take care of the purchase order execution from Purchase Order placement up to invoicing and shipping document issuance.\nGenerate supplier orders previously prepared by sales representatives.\nEnsure the proper execution of the terms specified in the contract review with each supplier\nFollow very closely local and international suppliers\nEnsure that delivery lead times are respected\nUpon receipt of the goods, ensure the quality and conformity of the products\nPrepare and issue export documentation\nSend the notification of readiness/delivery to the customer\nSend invoices to customers and ensure that they are received\nObtain proof of collection / delivery from the client or its forwarding agent to ensure the fluidity of client payments.\nManage and follow up any discrepancies (suppliers / customers)Skills",
    "Skills": [
        "Requirements:",
        "Fluent in English\n3 - 5 years experience as a Logistics Executive (Import & Export)\nPrevious professional experience in international sales administration\nPrevious professional experience abroad in a multicultural environment\nBusiness degree with major in International Trade or Supply Chain\nVery good knowledge of the office IT tools (Office + ERP system)\nExcellent organization skills\nVery good communicator\nBusiness oriented\nDynamic, tenacious, autonomous, rigorous and proactive\nCandidates who can start immediately will be highly desirable.",
        "Technical knowledge:",
        "PO placement /execution\nVery good knowledge of Incoterms\nUAE Free Zone import/export procedures\nPerforming Quality Assurance/Quality Control (QA/QC) physically"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}