{
    "Job ID": "4737610",
    "Description": "About UsUdacity is on a mission to change lives, businesses and nations through radical talent transformation in digital technologies. We offer a unique and immersive online learning platform, powering corporate technical training in fields such as Artificial Intelligence, Machine Learning, Data Science, Autonomous Systems, Cloud Computing and more. Our rapidly growing global organization is revolutionizing how the enterprise market bridges the talent shortage and skills gaps during their digital transformation journey. Udacity is proud to be backed by respected investors like Andreessen Horowitz, Charles River Ventures, Bertelsmann and Drive Capital, among other leading VC firms, and provides a powerful and differentiated solution inside of a $32b total addressable market opportunity. Udacity has more than 100 enterprise customers including Airbus, Bertelsmann, BNP Paribas, Leidos, Mazda, and the United States Air Force.About UsUdacity is on a mission to change lives, businesses and nations through radical talent transformation in digital technologies. We offer a unique and immersive online learning platform, powering corporate technical training in fields such as Artificial Intelligence, Machine Learning, Data Science, Autonomous Systems, Cloud Computing and more. Our rapidly growing global organization is revolutionizing how the enterprise market bridges the talent shortage and skills gaps during their digital transformation journey. Udacity is proud to be backed by respected investors like Andreessen Horowitz, Charles River Ventures, Bertelsmann and Drive Capital, among other leading VC firms, and provides a powerful and differentiated solution inside of a $32b total addressable market opportunity. Udacity has more than 100 enterprise customers including Airbus, Bertelsmann, BNP Paribas, Leidos, Mazda, and the United States Air Force.Position overview:Session Leads are industry professionals who provide world-class technical support to our learners in their Nanodegree journey. All our session leads are handpicked through a rigorous selection process so that we can truly be #studentfirst. As a Session Lead/Instructor, you will be meeting virtually on a weekly basis with your students for group work, activities and short lectures. During the week, students are expected to study an estimated 10 hours on their Nanodegree programs on their own, and you will be expected to respond to their technical questions and check-in with them to make sure they are making progress.Responsibilities:Managing weekly Connect sessions with students according to Udacity guidelines\nCreating the Udacity Connect session agenda & notes\nCoordinating between the students and the Udacity Connect team\nReporting to Udacity the weekly overall attendance status of students & observations about each session\nBeing present at every Connect session over Zoom, helping students introduce themselves, organizing students in groups and keeping track of time\nExplaining concepts of the Nanodegree program to your group of students when needed\nSolving questions raised by students during the Connect session\nReporting student's attendance and progress to the Mentor's dashboard\nCommunicating with students on Slack\nWeekly check-in with all students on their progressWhy should you apply? Work remotely as an External Contractor\nEarn additional income \nContribute to a vibrant, international student community \nStay updated with the latest in cutting-edge technologiesSkills",
    "Skills": [
        "Residing in Oman is a must\nHolds Omani nationality is a must\nBilingual in (Arabic & English) is a must\nTechnical Competence: UX Fundamentals and Design Research, Concept to Low-Fidelity Prototyping, High-Fidelity Prototyping to Post-Launch Analysis\nGraduate from any of the UX Design related courses/Nanodegree programs is an added plus\nExperience teaching technical concepts and public speaking\nStrong interpersonal skills and confidence to lead a group of students\nStudents-oriented mindset and focus on understanding their problems\nInnovative approach and proactivity with students that need help\nPositive character, trusted by the students, creating emotional ties in the group\nExisting tech network and experience in technical conversations & discussions\nFlexibility at their current job to take this challenge as a part-time, external contractor"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Oman",
        "Nationality": "Oman"
    },
    "Data": {
        "Job Location": "Mountain View, United States",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}