{
    "Job ID": "4737243",
    "Description": "Position Title:               StorekeeperEmployment Type:     Full Time  Salary:                        up to 3K AED all-inclusive depending on experience and qualifications Job Location:                Sharjah, UAE  About the Client:  A well-established metalwork and engineering company with several renowned projects in UAE. Job Description:  Plans and performs work that involves ordering, receiving, inspecting, returning, unloading, shelving, packing, labeling, pricing, delivering.\nUpdate logs and documentation for inventory processing and report damaged or missing inventory to immediate supervisor.\nSupervise the offloading of incoming materials and inspect quantity and quality in line with the requirements mentioned on the purchase orders, check for damage and discrepancies, then report to accounting for reimbursements and record keeping.\nEnsure all stored materials should be easily accessible and safely handled as per HSE guidelines standards and procedures.\nMove materials from facilities to workstations, pickup locations, or other locations as applicable.Skills",
    "Skills": [
        "Qualifications: ",
        "Open to Indian, Pakistani, Nepali nationals\nMale, 45 years old and below\nAt least 3 years of related experience in storekeeping, inventory control, and recordkeeping\nKnowledge in safety and security practices, and basic mechanical concepts.\nAdvanced knowledge with using Excel (PIVOT & VLOOK UP) is required\nCandidates who can join immediately will be prioritized "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India; Nepal; Pakistan",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Industrial Engineering & Automation",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}