{
    "Job ID": "4737252",
    "Description": "Job Description:We are currently seeking a skilled and experienced AC & Chiller Technician to join our team in Sharjah. In this role, you will be responsible for the installation, maintenance, and repair of air conditioning systems, chillers, and related equipment. Your expertise will play a critical role in ensuring the efficient and reliable operation of cooling systems across various residential and commercial properties.Responsibilities:Perform installation, maintenance, and repair tasks for air conditioning systems and chillers.\nRead and understand basic drawings.\nConduct troubleshooting and diagnostic assessments to identify and resolve issues with HVAC equipment.\nCarry out regular inspections to ensure proper functioning of cooling systems.\nRespond promptly to repair requests and resolve problems efficiently.\nConduct preventive maintenance activities to prolong the lifespan of cooling equipment.\nCoordinate with other team members to ensure timely completion of projects.\nAdhere to safety guidelines and regulations while working on HVAC systems.\nKeep accurate records of maintenance and repair work performed.\nProvide excellent customer service by addressing clients' queries and concerns.Requirements:Proven experience as an AC & Chiller Technician or a similar role.\nProficiency in installing, maintaining, and repairing air conditioning systems and chillers.\nSound knowledge of HVAC principles, equipment, and components.\nAbility to troubleshoot and diagnose issues with cooling systems.\nFamiliarity with electrical and refrigeration systems.\nStrong problem-solving skills and attention to detail.\nExcellent communication and customer service abilities.\nAbility to work independently and as part of a team.About You:The ideal candidate for this position will have the following experience and qualifications:\nMinimum 5 years air-conditioning installation or maintenance experience in Industrial/Commercial Projects in UAE\n1-year formal training (Certified) in Air Conditioning ITI/Diploma in Air Conditioning (Mechanical)\nValid UAE driving license (Not mandatory)\nFluent in Hindi or English languageAbout the Benefits:Accommodation Provided by Company\nTransportation Provided by Company\nPaid Over Time\nOther benefits as per UAE Labor Law\nAdditional benefits and opportunities for growth within the organization may be available for the right candidate.Job Type: Full-time/Part-timeAbility to commute/relocate:Sharjah: Reliably commute or planning to relocate before starting work (Preferred)Visit our Page to see the latest updates.If you are a skilled AC & Chiller Technician looking for a rewarding opportunity in Sharjah, please submit your resume, along with a cover letter, detailing your relevant experience and qualifications. We look forward to reviewing your application and potentially welcoming you to our team.Skills",
    "Skills": [
        "Perform installation, maintenance, and repair tasks for air conditioning systems and chillers.\nRead and understand basic drawings.\nConduct troubleshooting and diagnostic assessments to identify and resolve issues with HVAC equipment.\nStrong problem-solving skills and attention to detail.\nExcellent communication and customer service abilities."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "India",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Mechanical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}