{
    "Job ID": "4737530",
    "Description": "-         Work directly with Business User as an Oracle Cloud Financials functional expert-         Ability to work independently and manage multiple task assignments.-         Lead and support the Business Team throughout implementation and support phases.-         Collect and analyze business requirements for the Finance department and perform Fit-Gap analysis and provide corrective actions.-         Anticipate and identify Project related risks and escalate issues as appropriate.-         Write business requirement documents and other functional related documentations.-         Active participation in design, demonstration, development, testing and implementation of Oracle financial modules according to the business requirements.-         Active participation in preparing various project documents – Solution design, Functional Specifications, Setup Documents, SIT-UAT Test Scripts, Training materials.-         Ensure that project deliverables meet Users specifications.-         Explain the business requirement to other team members in the project.-         Create and execute test scenarios in various test environments.-         Works closely with users during user acceptance testing phase and respond to their queries and concerns promptly.-         Resolve Oracle related queries & issues of customer in a timely fashion.-         Develop user guides and training materials and provide End Users Training at all the sites.-         Collaborate with different tracks & team and help to provide a holistic solution.-         Provide suggestions to configure the Oracle applications for optimum utilization.-         Perform daily activity reporting against plans and schedules.Skills",
    "Skills": [
        "-         Candidate should have 6-8 Years Experience as an Oracle Fusion Application Financial Consultant including Support and Upgrades",
        "-         Independently lead at least 2-3 end-to-end Oracle Cloud Financials implementation lifecycles and Support activities.",
        "-         Experience is Healthcare Industry is mandatory.",
        "-         Experience in gathering and documenting business requirements, functional documentations, setup document, test scripts, training materials, perform fit-gap analysis, functional configuration, testing, and training.",
        "-         Experience in collaborating with different tracks & teams and good knowledge in Supply Chain Management Modules like Procurement, Inventory, Order Management etc. to provide holistic solutions.",
        "-         Expert level knowledge in Oracle Fusion Cloud Application Financials - General Ledger, Accounts Payable, Accounts Receivable, Asset Management, Cash Management and Tax and certified in these Modules.",
        "-         Good accounting knowledge including Sub Ledgers, Closures, Consolidation, Budgeting, Costing, Management Reporting, IFRS etc.",
        "-         Basic knowledge of SQL",
        "-         Excellent communication (Oral & Written), inter-personal and Presentation skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services; Other Healthcare Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}