{
    "Job ID": "4737474",
    "Description": "Prepare Developed Design, including coordinated and updated proposals for Architectural design, structure and building services systems coordination, outline specifications, cost information, and project strategies in accordance with design program and Permits regulations.\nLead the architectural design process, creating innovative and practical solutions that align with project goals, budget constraints, and industry standards. This may involve developing sketches, blueprints, and 3D models.\nDevelop architectural concepts and design proposals based on client needs and budget constraints and create detailed architectural drawings, specifications, and construction documents.\nEnsure that projects are designed and executed effectively, meeting the client's requirements and adhering to quality, budget, and timeline constraints. Ensure proper liaison between project management, design teams, and clients, ensuring a smooth and successful project delivery.\nConduct site visits and assessments to gather information and demonstrate expertise in architectural design principles, building codes, and construction standards as well as ensure that architectural designs comply with relevant regulations and sustainability guidelines\nEvaluate and select appropriate materials, building systems, and technologies and address technical challenges during the design and construction phases.\nLead and guide a team of architects and designers throughout the project lifecycle and delegat tasks and responsibilities to team members while providing support and mentorship.\nResponsible for quality assurance, reviewing design deliverables to ensure they meet the required standards, are compliant with regulations, and fulfill the client's expectations.\nInteract with various stakeholders, including clients, contractors, engineers, and other professionals involved in the project.\nCollaborate with other departments to integrate architectural designs seamlessly and review architectural designs and construction documents to ensure accuracy and adherence to project requirements.\nConduct design reviews, identify potential design risks, propose solutions to mitigate, and participate in quality control during construction.\nAct as a primary point of contact for clients regarding architectural aspects of the project and participating in client meetings and presentations to discuss design concepts and project progress.\nProvide support during the construction phase, address any architectural design-related queries from contractors and stakeholders, manage client expectations, and ensure client satisfaction throughout the project.\nConsider environmental sustainability in the designs, incorporating green building principles and energy-efficient solutions.Skills",
    "Skills": [
        "Bachelor Degree of Science in Architecture.\nArchitectural License and holds a MMUP Certificate Grade “A”\nGSAS/LEED certification is an advantage\nPrograming and Management Certificate is an advantage Experience\nMinimum 10 years solid experience in Consultant Architectural Design, Drafting, Detailing, Coordinating and Monitoring.\nExperience in Project Management\nArchitectural Design Expertise\nGood Knowledge in Project Management, Procurement, Contracts and Site Supervisors.\nKnowledge in CAD tools, presentation tools and MS office programs\nKnowledge in Project Management including Documents/Drawing Coordination (Specifications, Building Codes and Regulations, Bill of Quantities & other Technical data – MEP & Structural).\nSustainability and Green Building Knowledge."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate; Architecture",
        "Company Type": "Recruitment Agency",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}