{
    "Job ID": "4737442",
    "Description": "NorthBay Solutions is looking for a highly skilled and motivated Director of Technology with solid experience in Machine Learning and Artificial Intelligence domain.Strategic Leadership and Planning:Develop and execute the company's AI/ML strategy, aligning it with overall business objectives.\nDefine the roadmap for AI/ML initiatives, considering short-term and long-term goals.\nStay updated with emerging AI/ML trends and technologies, contributing to the company's technological vision.Team Management and Development:Lead, mentor, and manage a team of AI/ML experts, fostering a collaborative and innovative work environment.\nProvide technical guidance, mentorship, and coaching to team members to enhance their skills and expertise.AI/ML Implementation:Identify opportunities to leverage AI/ML technologies to enhance products, services, and processes.\nOversee the design, development, and deployment of AI/ML models, algorithms, and applications.\nCollaborate with cross-functional teams to define AI/ML project scope, requirements, and feasibility.Skills",
    "Skills": [
        "The ideal candidate is a creative individual who thinks out of the box and would like to work in a diverse technology environment. We are looking for a candidate to bring passion and dedication to this position and must be a great motivator who can thrive in an Agile environment. ",
        "The ideal candidate will have experience of over 12+ years, specifically in ML / AI, Natural Language Processing, and other similar technologies. ",
        "Requirements",
        "12+ years of hands-on experience with designing & developing machine learning models\nHands-on experience with deploying ML/AI models in different environments\nExpert knowledge in NLP, text classification and/or computer vision using machine learning, identifying objects & events, processing inference, and utilizing it for dashboards.\nHand on experience with LLM Models, GPT, Prompt Engineering, Chatbots, Vector DBs, LangChain\nStrong proficiency in python scripting, Jupyter notebooks.\nFluency in python frameworks like NumPy, pandas, pyspark, TensorFlow, OpenCV, Yolo  and other deep learning frameworks.\nExperience with using AWS ML Services, SageMaker, Ground Truth, ECS, Cognito, Cloud Watch, RDS: Postgres, API Gateway, Lambda\nCandidate must have at least 8 years of experience in AI/ML\nCandidate must have sufficient experience in using core AWS Services\nOut of total 12+ ML/AI experience, a suitable candidate should have at least 8+ years of hands-on experience by successfully delivering 5 or more projects in one or more of the following areas. Model Fine-Tuning, Training Foundational Models, Vector Embedding, Management of integrating with products, Human in loop feedback, Foundation model and Multi-modality \nCandidates must have used ML/AI in at least 5 to 7 successful projects.\nAWS certification is a plus\nCandidates must have strong communication skills to work with various stakeholders, including customers. \nThe candidate must be able to manage and mentor a team of engineers.",
        "Note: ",
        "The candidate should be willing to relocate to onsite (Dubai)."
    ],
    "Preferred": {
        "Years of Experience": "Min: 12"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Software Development; IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}