{
    "Job ID": "4737717",
    "Description": "Internship OpportunityPhotography Assistant - Commercial Photography & Short Reels Production.If you’re a creative passionate student interested in PHOTOGRAPHY & VIDEOGRAPHY, this is a good opportunity to elevate your photography skills and learn it professionally and practically.At MagicMedia our speciality is Commercial and Advertising Photography, such as Product photography, fashion and beauty, Jewelry, hotels and resorts, automotive photography, etc.Also we capture and develop Interactive 360º Virtual Tour for business locations.MagicMedia studio is now located in a hotels-vibrant area at Shmeisani district, Queen Aliaa St, Amman.This is a 3 months internship, possible to be extended afterwards to a full-time paid job upon mutual interest.Please, Apply ONLY if you understand all aspects of this job post.• Basic skills related to photography field are expected from the intern.• Training/Working hours: 3-5 hours per day, 5 days a week.• Internship counts as academic credit toward graduation, This is a 3 months UNPAID internship program, unless if you're really helpful and producing more than just learning.• You must be living in Amman city.• We shoot for clients not only at our studio, but also on locations inside and outside Amman, and sometimes but not often, some shooting projects require spending a day or too outside town.Thank you all, and Good luck!Skills",
    "Skills": [
        "Expected Skills from candidate:",
        "Photography basics l shooting mode.\nAdobe Photoshop & image editing basics.\nA strong desire and dedication to learn and gain more photography skills.\nWould be appreciated but not a must to have video editing skills, specially for publishing on social media platforms."
    ],
    "Preferred": {
        "Residence Location": "Amman, Jordan",
        "Gender": "Female",
        "Age": "Min: 18 Max: 40"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Photography; Video & Film Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Internship",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}