{
    "Job ID": "4737216",
    "Description": "Digital Partners Global is currently looking for a GM GCC with fluent Arabic and English. To continue operating at our high standards, we’re seeking a general manager who’s a born leader. This person should have experience in overseeing business operations as well as human resources, finance, and communications. The ideal candidate will be an expert communicator who has a strong ability to take responsibility and collaborate across a range of departments. Ultimately, the general manager should be driven by a desire to lead our business to maximum productivity and efficiency.Objectives of this roledevelop strategic plan for optimized productivity;\nreview and improve organizational effectiveness by developing processes, overseeing employees, establishing a highly motivational work environment, and implementing innovative changes;\nadhere to company standards for excellence and quality;\nseek out opportunities for expansion and growth by developing new business relationships;\nprovide guidance and feedback to help others strengthen specific knowledge/skill areas.Responsibilitiesoversee day-to-day operations, assign weekly performance goals and ensure their completion, and accomplish your own goals;\nrecruit, onboard, and train high-performing employees to achieve objectives for sales, profitability, and market share;\nmaintain project timelines to ensure tasks are accomplished effectively;\ndevelop, implement, and maintain budgetary and resource allocation plans;\ndelegate responsibilities to the best-qualified employees and enforce all policies, procedures, standards, specifications, guidelines, training programs, and cultural values;\nresolve internal staff conflicts efficiently and to the mutual benefit of all involved.Skills",
    "Skills": [
        "Required skills and qualifications",
        "proven success in a managerial role;\nstrong decision-making ability;\nexcellent communication, collaboration, and delegation skills;\nproven ability to develop and achieve financial plans;\nability to motivate and lead employees, and hold them accountable;\nstrong working knowledge of operational procedures;\nfluent English (C2);\nfluent Arabic (C2).",
        "Preferred skills and qualifications",
        "Bachelor’s degree (or equivalent) in business management or related field – we hire for attitude so diplomas are just a pre-requisite;\nworking knowledge of human-resources processes."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Computer Hardware & High-Tech Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}