{
    "Job ID": "4737395",
    "Description": "Managing Commissioning and start-up activities in Oil and Gas domain covering both greenfield and Brownfield projects.Prepare a commissioning plan and coordinate with all stakeholders involved.\nPrepare commissioning and start up procedures in line with the contractual scope of work,standards and guidelines.Prepare procedure for pre-start-up audits, methodology, checklists, roles and responsibility matrix etc.\nManaging a commissioning team that comprises commissioning engineers,supervisors, technicians and specialists.acceptance tests and performance tests for the facility.Mechanical completion Procedures, hand over procedures, Completion management system procedures(CMS), Punch lists managing skills, Prepare the lists of pre-requisites for commissioning that may includedocumentation, utilities, consumables, specialized manpower etc.Coordinate with all stakeholders involved such as Engineering and construction team, Quality Assurance &Control team end users etc. to make sure that all engineering /construction conflicts related to technicalcompliance have been looked into and resolved prior to commissioning.Effective coordination with OEMs, Vendors and sub-contractor involved in the pre-commissioning andCommissioning activities.Guide the CMS coordinator (Completion management System) to have a software-based tracking system foreach and every activity that may involve Pre-commissioning, commissioning, startup Site acceptance tests,resolution of commissioning punch points and following up the document generation for every defined step.Lead close out activities, post start up that may include Safety study close outs, Maintenancemanagement system documentation close outs, Plant Operational Hand over certificate approvals,Performance tests approvals and coordinate with discipline engineers to close out Spare part interchangeabilityrecords. etc..Skills",
    "Skills": [
        "Vast experience in managing Commissioning and start-up activities in Oil and Gas domain covering both green\nMust have outstanding capability of maintaining cordial working relation with Client (Include state run energy\ncompanies), engineering consultants, sub-contractors, third party consultants, OEMs and vendors.\nMust be able to prepare a commissioning plan and coordinate with all stake holders involved.\nMust be able to prepare commissioning and start up procedures in line with contractual scope of work,\nShould have good experience in managing a commissioning team that comprises commissioning engineers,",
        "supervisors, technicians and specialists.",
        "Bachelor of engineering (Mechanical/Process)\nMinimum 15 years experience in Oil and gas EPIC Project management\nPreference for immediate joinees available locally.\nMust have good experience in Oil & Gas Companies in Qatar.\nThe candidate must be conversant with Team management, Material management, time management, Project",
        "Risk assessment and Mitigations.",
        "Knowledge on multidiscipline commissioning activities in compliance with standards is mandatory",
        "and the commissioning manager in coordination with construction manager & Project manager, must be able to",
        "assess, analyses and mitigate any constraints that may come across commissioning that eventually may cause",
        "delay in startups.",
        "Should have basic knowledge on multi disciplines such as Mechanical, Civil, Loss prevention, E&I and",
        "Process in an Oil and Gas Upstream/Downstream Domain.",
        "Good knowledge on Process piping, Static equipment’s, Rotary equipment’s, E&I systems, Heat exchanging",
        "systems, Hydro carbon storage facilities, Utilities interface, Loss prevention systems, shutdown systems etc. is",
        "highly desirable.",
        "The candidate must be able to work in accordance with Qatar national and international standards and must",
        "be familiar with standards such as ASTM/ASME/Shell DEP/IEC, IEEE/API etc.",
        "Good knowledge on Safety and engineering studies is mandatory.\nMust have basic knowledge on automation systems such as Distributed Control systems, Supervisory Control",
        "and Data acquisition system, Shutdown systems and Field instrumentation.",
        "The candidate shall have good analytical reasoning for any issues that may arise during pre-commissioning",
        "and commissioning stage and must be in a position to mitigate such instances technically in coordination with",
        "the stakeholders involved.",
        "A good knowledge on hazardous area classifications, Piping and Instrumentation Diagrams (P&IDs) Electrical",
        "documents, Process flow diagrams (PFD), Utilities flow diagrams (UFD), Cause and effect Diagrams, General",
        "arrangements and isometric drawings etc. is mandatory."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 14",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}