{
    "Job ID": "4737280",
    "Description": "Position Title:                Procurement EngineerEmployment Type:       Full TimeSalary:                            up to 5K AED all-inclusive depending on experience and qualificationsJob Location:                 Sharjah, UAE About the Hiring Company:A well-established metalwork and engineering company with several renowned projects in UAE Job Description:Obtain quotes from vendors for materials and equipment and collaborate with Project Coordinators, Planning Engineers, Site Engineers, and Stores on a daily basis.\nFinalize chosen contractors and start the project upon receiving permits, adhere to BOQ / Budget / Drawings while following approved payment terms.\nCoordinate with the Design, Estimation team & Project team for product pricing of multiple projects at the same time.\nEnsure contractor and supplier invoices are pre-approved by the finance team and immediate superior, purchases follow order confirmation, and maintain accurate supplier files and records.\nRegular market research and carrying out regular vendor ratings and other responsibilities as maybe assigned from time to time.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Pakistani and Indian nationals\nMale, 45 years old and below\nBachelor’s degree in engineering\nMinimum 3 years’ related experience in steel fabrication industry\nShould be able to analyse the Steel Structure drawings in Steel Fabrication and check the quantities from the CAD drawings\nGood knowledge in Excel, Word, CAD etc\nWell-versed with materials related to interior turnkey works such as building materials, steel fabrication, and special items as required\nMust have own database of suppliers and subcontractors to source materials/works for in Steel Fabrication\nGood communication skills in English & Hindi are preferred"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India; Pakistan",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 42"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Industrial Engineering & Automation; Civil Engineering; Mechanical Engineering",
        "Company Type": "Recruitment Agency",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}