{
    "Job ID": "4737545",
    "Description": "Since 2014, Niagara College KSA (NC KSA) has operated technical and vocational training colleges throughout the Kingdom of Saudi Arabia in support of the Vision 2030 initiative and in partnership with the Colleges of Excellence (CoE). Headquartered in Riyadh, Saudi Arabia, NC KSA provides community and customized training based on Niagara College Canada's expertise and international track records as one of Canada’s most innovative and enterprising applied learning post-secondary institutions. With a strong focus on developing ‘world-’ and ‘work-’ ready graduates.A strategic partnership between Saudi Aramco, Ministry of Labor and Social Development, TVTC & HRDF resulted in the establishment of the first academy for females in Al Khobar, Leading National Academy (LNA), which is not-for-profit legally independent entity aiming at leading diversification of employment opportunities and building the capabilities of the Saudi female workforce through economy driven, elite, and agile training; committed to the values of integrity, excellence, diversity, citizenship and safety responsibility. In partnership with NCKSA, LNA provides a specialized two-year diploma training program for entry-level jobs in new market opportunities.The first year, the Academic Program, solidifies English, IT, Math, and H&S skills as part of the performance-based curriculum. In the second year, the Job Skills Program provides the latest knowledge and skills training in different vocational trades and sectors (e.g. Supply Chain Management, Chemical Lab Technician, Business Administration, Electrical Technician, Quality Control Building Inspection, and Health, Safety & Environment). LNA prides itself on its integral reliance on smart learning solutions (e.g. iPads, Smartboards, blended learning) to efficiently equip carefully selected trainees (A2 minimum) through high-quality training.Applications are invited for the position of Instructor,ESL at Niagara College KSA, Leading National Academy (LNA) in Al Khobar. Reporting to the Head, Academic Program, the Instructor, ESL is responsible for developing an effective learning environment for students. This exciting career opportunity offers the ideal candidate a once-in-a-lifetime educational development experience in an international environment to deliver outstanding language training within the Academic Program.Responsibilities include but are not limited to:Delivery of approximately 25-30 hours of English language instruction per week.\nPlan and deliver high-quality, function-based lessons online and/or face-to-face.\nDevelop and create a learning environment that is conducive to success for all trainees.\nEvaluate trainee progress and assume responsibility for the assessment of the trainee’s work within the assigned courses.\nAssess trainees on writing, speaking, and presentation skills using detailed rubrics.\nProvide remedial sessions during non-teaching periods.\nOptimize the use of educational technologies to meet trainee learning needs.\nProvide a learning environment that makes effective use of available resources including educational technologies and the NC KSA-approved Learning Management System (Moodle).\nDeliver and model H&S safety messages every lesson.\nManage one section of trainees as a homeroom teacher and create a section profile and individual learning profiles (ILPs).\nDeliver extra-curricular content weekly focused on workforce wellness using the provided curriculum.\nParticipate in curriculum and consultative committees and team meetings.\nLiaise with community members and engage in program promotion.Skills",
    "Skills": [
        "Required skills and qualifications, at a minimum, include:",
        "A bachelor’s degree in Teaching English as a Second/Foreign Language (TESL/TEFL). A master’s degree is preferred, or at least, a bachelor’s degree in English literature, applied linguistics or modern languages with a teaching certificate or diploma, such as the Certificate in Teaching English to Speakers of Other Languages (CELTA) or the Diploma in English Language Teaching to Adults (DELTA).\nFour (4) years’ experience in English language instruction for adults.\nNon-native speakers of English must have either an overall Academic IELTS score of at least 7 or a TOEFL score of at least 100 on the internet-based test, 600 on the paper-based test or 250 on the computer-based test.\nExceptional classroom management skills and the ability to create a learning environment that promotes and enhances trainee motivation.\nDemonstrated training and/or experience in the implementation and integration of multimedia technologies in an ESL/EFL language-learning environments.\nExperience in web-based technologies & computer-assisted language learning (CALL).\nAbility to function as a team player within a multi-cultural work environment.\nEffective presentation and communication skills, both written and oral.\nAbility to work independently and to meet tight deadlines.\nStrong organizational, problem solving, and analytical skills.",
        "How to apply:",
        "Position will be posted on the job portal website, Bayt\nSelect the \"Apply Now\" button displayed in the job posting and follow the instructions provided.\nIt is required that the mandatory questionnaire be completed.\nEnsure that your Bayt profile and CV information provided is up-to-date, and that you list all relevant work experience and education.\nCandidates will be shortlisted based solely on the information they provide through Bayt.\nIf experience is not included, the system will fail to recognize your qualifications and may automatically screen out your application.\nAll applications must be received through Bayt in order to be considered for review.\nWe thank all applicants; however, only those selected for an interview will be contacted."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}