{
    "Job ID": "4737250",
    "Description": "Next Level Manager:  Operations Manager, TechnicalLocation of Position: Dubai Office. The role may require infrequent global travel.Purpose of Role:  Provide 24/7 customer support via email, skype and phone for all Sicuro related services. Capable of installing GPS tracking devices and provide both hardware and software training using a good command of the English language. Willing to be deployed outside of Dubai particularly Middle Eastern and African countries.Contact and Cooperation:  Intelyse, Sicuro Technology and all Sicuro Group companiesKey Responsibilities:1.Ops room tasks and responsibilitiesAccomplishes all protocols related to deployed personnel and PM clients.\nProvides timely response/solutions to all customer concerns handled during shifts\nActively spot and react to any issues concerning both hardware and software.\nCommunicate effectively via email, skype and phone (both internally & externally in English language).\nConducts clear and concise shift handovers\nGenerate required Ops reports such as:-      Shift Summary Reports-      Primary Monitoring reports-      Client issues and summary reports2.    Ensure adherence to Ops protocols and instructions for events and situations such as:Critical client incidents/vehicle theft\nPlatform and app issues and development requests\nSignificant technical failure\nSafekeeping of supplier’s portal password\nDeployment rules\nLeave policy3.Hardware, Tools and Stock InventoryProficient in operating vendor’s device features (GPS and Radios) and appropriate applications.\nProvides hardware support to clients with minimal supervision.\nPerforms device scripting including remote/OTA4.Tracking platforms and IT SystemsHas above average knowledge of SicuroTrackV2, SicuroFleet, SicuroPeople and device software\nConducts in-house and remote training of the tracking platform (both with clients and Sicuro employees).\nActively spot and react accordingly to any issues concerning the tracking platform.\nKnowledgeable in using suppliers' provisioning portals and carry out OTA configurations and activation/deactivation/swapping devices and airtime.5.DeploymentsInstall and commission all GPS tracking devices both personnel and vehicle trackers with high standards.\nProduce a daily report on what tasks have been accomplished during deployments.\nExhibits professionalism, time management and good communication skills.\nTravels to Gulf region, Africa or elsewhere as required.6.Perform other related duties as required.·        Extends extra time to accomplish tasks as required.·        Takes the initiative to handle extra tasks needed to improve support processes.·        Relays information related to client concerns and Operation issues to the OCM or Opsmgt in a timely manner7.Responsible to be aware, up-to-date and adhere to all related controls and policies for ISO 27001,22301 and GDPR.Skills",
    "Skills": [
        "         Essential",
        "Bachelor’s degree in Electronics and Communications Engineering, preferably board certified\nMinimum 2 years work experience in the field of electronics, telecoms or networks.\nComputer literacy including proficiency in Microsoft office; Strong verbal and written communication skills\nCustomer service oriented\nExperience in providing technical support to clients by different means, e.g. Team Viewer, telephone and Skype chat\nCompose technical documents in Word/Excel/PDF, create and maintain Excel worksheets and databases\nQuick to understand systems, hardware and new devices\nMust maintain confidentiality and discretion in all aspects\nHonest and trustworthy\nTeam player\nGood Interpersonal skills",
        "Preferred",
        "Bachelor’s Degree in Electronics and Communications Engineering, preferably board certified\nCisco or Microsoft related certifications\nCCNA/CCNP certified",
        " ",
        "Experience Preferred",
        "Working experience with a GPS tracking provider/vendor, a Telecommunications company or IT companies\nWorking experience in the Middle East and Africa\nCyber Security related experience\nMotorola MOTOTRBO DMR systems and configuration",
        " ",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 9",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "Philippines",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}