{
    "Job ID": "4737673",
    "Description": "The CDB Project is engaged in complex solutions, including construction, private and public architectural and design projects of a premium class worldwide. For the past several years we have successfully finished a large number of objects : apartments and houses, restaurants, hotels in various parts of the globe.Now we are opening a new branch in Dubai due to growing number of clients in Asian region and therefore looking for bright individuals, passionate about their work, to build up a new team.Responsibilities:Development of design projects for private and commercial objectsDevelopment of shop drawings for construction and FF&EDevelopment of stylistic collages (perspective!) in photoshop based on references, general concept and color schemes.Development of the architectural and construction part of the interior project.Organization and planning of design work.Development of design and working documentation (pre-design / sketch solutions, renderings).Development of technical specifications for subcontractors.Architectural supervision of construction.Requirements:BA in designPlease provide a portfolio! Resumes WITHOUT portfolio will NOT be considered!Proficiency in Photoshop, ArchiCAD - are a must; proficiency in 3d max adds extra value to the applicationKnowledge of modern building requirements, technologies and standards.Ability to multitask.Knowledge of the OS&E and FF&E markets.What knowledge is required:It is important that you have a specialized education in architecture or interior design;It is important to have a confirmed portfolio (be ready to demonstrate examples of projects);You need to be able to demonstrate good knowledge of design, of new trends, technical knowledge of ergonomics and fit-out technologies.SUCCESSFUL CANDIDATES WILL BE REQUIRED TO DO A SMALL TASK TO DEMONSTRATE THE ABILITY TO WORK UNDER TIME PRESSURE IN A PARTICULAR PROJECT LIMITATIONS, AS WELL AS SHOW PROFICIENCY IN SOFTWARE.PLEASE SEND YOUR PORTFOLIO WHEN APPLYING!Skills",
    "Skills": [
        "Requirements:",
        "BA in design",
        "Please provide a portfolio! Resumes WITHOUT portfolio will NOT be considered!",
        "Proficiency in Photoshop, ArchiCAD - are a must; proficiency in 3d max adds extra value to the application",
        "Knowledge of modern building requirements, technologies and standards.",
        "Ability to multitask.",
        "Knowledge of the OS&E and FF&E markets.",
        "What knowledge is required:",
        "It is important that you have a specialized education in architecture or interior design;",
        "It is important to have a confirmed portfolio (be ready to demonstrate examples of projects);",
        "You need to be able to demonstrate good knowledge of design, of new trends, technical knowledge of ergonomics and fit-out technologies.",
        "SUCCESSFUL CANDIDATES WILL BE REQUIRED TO DO A SMALL TASK TO DEMONSTRATE THE ABILITY TO WORK UNDER TIME PRESSURE IN A PARTICULAR PROJECT LIMITATIONS, AS WELL AS SHOW PROFICIENCY IN SOFTWARE.",
        "PLEASE SEND YOUR PORTFOLIO WHEN APPLYING!"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}