{
    "Job ID": "4737405",
    "Description": "Job Role: SalesJob Type: Full-time  Who are we?At Bayt.com, we are committed to empowering people to lead better lives by providing them with the tools and information to build their lifestyle of choice. We are passionate about our services and seek to deliver the best customer experience. Not only are we devoted to our work and customers but most meaningfully to each other's success. We want to better every life we come in contact with and have a lasting positive impact on the community. What do we value?We strive to be the best \nWe obsess about empowering others to lead better lives\nCreate value by doing more with less\nEmbrace change with a positive attitude\nCommunicate openly, honestly, and oftenJob SummaryWe are looking for an experienced Tech Licensing Sales Specialist to join our team. The successful candidate will be responsible for selling recruitment and tech licensing solutions to enterprise companies. You will work closely with clients to understand their business needs and develop customized solutions to meet those needs. ResponsibilitiesDevelop and maintain a pipeline of new business opportunities by conducting outbound calls and emails to potential clients\nMeet with potential customers through regular physical and telephonic meetings, build relationships with clients, and understand their business needs\nConduct needs assessments and present recruitment and tech licensing solutions to clients\nNegotiate and close sales deals\nBuild a strong pipeline and consistently meet and exceed monthly, quarterly, and annual sales quotas.\nIncrease Bayt.com's product portfolio sales per customer through active customer needs assessment and solution recommendations\nIdentify up-sell and cross-sell opportunities by building long-term relationships and providing quality customer service.\nLead online demonstrations to clients.\nProvide professional after-sales support to enhance the client's success.  \nRemain in frequent contact with the existing clients and prioritize retention as a major focus.  \nRespond to complaints and resolve issues to ensure client success and satisfaction.\nMaintain accurate records of all sales activities and follow-up tasks in the CRM system\nWork collaboratively with the sales team and other departments to ensure customer satisfaction\nDeliver service that is consistent with Bayt.com's values and customer promise.Skills",
    "Skills": [
        "Qualification",
        "Bachelor's Degree in Business Administration, Marketing, or  Information Technology\n3+ years of demonstrated track record of meeting/exceeding sales targets of B2B solutions\nWork experience in SaaS industry would be an advantage",
        "Required Skills",
        "High aptitude for sales (Preferably B2B sales).\nStrong networking and connections in Saudi Arabia.\nKeen eye for identifying potential leads.\nExcellent negotiation skills to convert qualified leads into customers.\nGood interpersonal, communication, and presentation skills.\nHighly energetic, self-starter with a purpose-driven, result-oriented attitude.\nEmpathy and ability to understand customer viewpoint and customer service.\nSkilled at building rapport, opening doors, and understanding the business requirements of senior decision-makers.",
        "If you are a motivated and results-driven sales professional with experience in SAAS or B2B business, we encourage you to apply for this exciting opportunity."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 5",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}