{
    "Job ID": "4737272",
    "Description": "Our client: A well-known FMCG company in KSA is looking to hire an In-store Channel Manager.Your role: Reporting to the Sales Director, you will lead and oversee a specialized team within the sales division, driving the achievement of volume and distribution KPIs across various regions.\nYour role extends beyond traditional sales management, encompassing strategic planning, customer engagement, and operational excellence within our innovative retail environment.\nLeading the SIS operation requires your attention to detail and a customer-focused approach.\nBuilding strong customer relationships, ensuring SKU availability, managing third-party distributors, and maintaining attractive product displays are integral aspects of your role.\nYou will contribute to the preparation of the Sales section budget, meticulously monitoring financial performance against the budget to ensure a clear understanding of anticipated costs and revenues.Skills",
    "Skills": [
        "Must haves: ",
        "At least 5+ years of experience with bachelor's Degree in Business or a relevant field.\nProven experience in retail management, preferably in a shop-in-shop.\nStrong leadership abilities, with a track record of effectively managing and motivating teams.\nStrategic mindset, capable of developing and executing sales strategies that drive revenue growth.\nDetail-oriented approach to inventory management and visual merchandising.\nExcellent communication and negotiation skills for successful partnership management.\nCreative flair to contribute to the aesthetic and ambiance of the shop-in-shop area."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}