{
    "Job ID": "4737299",
    "Description": "Job descriptionAl-Ghad College of Applied Medical Sciences Announces its need to appoint English language lecturerResponsibilities:-     Participate in the implementation of the college's vision and mission.-     Implementation of educational and training programs, each in relation to and according to the study plan and the prescribed academic quorum.-     Teaching the assigned courses according to the shares determined by the system.-     Carrying out practical exercises and lessons according to the shares prescribed by the system.-     Carrying out all the work related to the exams of the Teaching courses: (setting questions - correction - review and audit).-     To convey to students the latest developments in field of specialization.-     Participate in the development of college programs and work procedures.-     Participation in the work of departmental councils, committees, college activities, and scientific research programs.-     Attending department council sessions, participating in it, and voting on its decisions and recommendations.-     Carrying out the assigned works from the department council within the limits of the rules and regulations.-     Maintaining order in halls and laboratories.-     Carrying out all that entrusted to in the field of scientific research, academic advising, or other administrative or academic work, in addition to the prescribed teaching load.-     Contribute effectively to conducting scientific research in specialty.-     Carry out the required quality work and prepare the necessary reports for the academic courses.-     Fostering the spirit of constructive competition among students and encouraging innovation and creativity in order to achieve excellence for the college and its students.-     Participation in the committees of the department and the college.-     Making the necessary periodic reports required from the college or scientific departments.-     Preserving the reputation of the college and its property, maintaining order and the safety of students.-     Dedication to work in college.-     Compliance with all regulations, laws, bylaws, and instructions in force in the Kingdom of Saudi Arabia, and not prejudice religion or interfere in politics.Skills",
    "Skills": [
        "Skills:",
        "1- Excellent English pronunciation, vocabulary and grammar skills.",
        "2- Confidence and skills to give motivating and interesting lessons to students.",
        "3- Developing teaching materials",
        "4- Assessment.",
        "5-  Reflecting on practice and microteaching.",
        "6- Mastery of subject.",
        "7- Use technology in the classroom.",
        "8- Keep up to date with the latest methods and theories for English teachers.",
        "9- Gain new practical skills.",
        "10- Get equipped to teach at the right level.",
        "Experience:",
        "- Two years of experience (at least) in education or training For Applicants who have a Master's degree in English.",
        "- Five years of experience (at least) in education or training For Applicants who have a bachelor’s degree in English.",
        "Qualifications:",
        "-  Applicants are required to have a Master's degree in English (Applied linguistics - TESOL - TESL - TEFL - linguistics - English Literature). With at least two years of experience in education or training.",
        "- Holders of a bachelor’s degree in English language can also apply, provided that they obtain a certificate (CELTA), with at least five years of experience in education or training.",
        "1. Critical thinking",
        "2. Patience",
        "3. Communication",
        "4. Organization",
        "5. Imaginative thinking",
        "6. Leadership",
        "7. Teamwork",
        "8. Time management",
        "9. Computer skills",
        "10. Conflict resolution"
    ],
    "Preferred": {
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}