{
    "Job ID": "4737587",
    "Description": "The Jr. Credit Salesman is a preparation stage to assume the role of a Credit Salesman in 1 or 2 years. Handles up to 3 retail outlets, assisting the Credit Salesman to ensure that retail outlets have sufficient stock cover in store for all our Category lines in distribution, processing orders for the assigned outlets and follow up on delivery. Facilitate efficient sell-in of central and local promotions and assist Merchandisers to secure space for promotional plans. Assist the Credit Salesman to ensure the implementation of the activity plan and Point of Sale implementation in store. Job Responsibilities:Achieving Value and Volume targets as set from month to month.\nManaging spend in trade in coordination with the Sales Supervisor and Credit Salesman for the assigned outlets.\nManage product freshness through efficient store ordering, and stock rotation (with the help of Merchandisers).\nEnsuring and Tracking On shelf availability and display for all our lines in distribution by category, according to agreed availability plan and Planogram, through a process of efficient store ordering, and implementation through Merchandisers\nImplementing Central and local activity efficiently through efficient sell in\n100% contractual implementation and reporting any deviations/exceptions\nEfficient usage of Point of Sale Material in each of the categories, as negotiated with the Store and implemented through the Merchandisers.\nEnsuring MF/GTRC asset integrity at store level, including maintenance follow up.\nLimit spend on Freshness through efficient store ordering, stock rotation, freshness actions in advance and reporting of any exceptions\nCoordinating with Merchandisers to ensure all GRVs for any freshness actions are processed within 2 weeks from date of actioning.\nOptimally reduce and eliminate write-offs (0%)\nAchieve optimum sales phasing during the month\nReporting to management on critical control measures as agreed/communicated. Skills",
    "Skills": [
        "Effective communication skills",
        "Good customer services skills",
        "Team players and result oriented",
        "Reliable, honest, Integrity and trust",
        "Initiative and follow up",
        " "
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "Kuwait",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}