{
    "Job ID": "4737281",
    "Description": "We are seeking experienced candidates for the Logistic Manager position who will be responsible for supervising the movement, distribution, and storage of supplies and materials in a company. Duties:Selecting carriers and negotiating contracts and rates.\nPlanning and monitoring inbound and outgoing deliveries.\nSupervising logistics, warehouse, transportation, and customer services.\nOrganizing warehouse, labeling goods, plot routes, and process shipments.\nResponding to any issues or complaints.\nResearching ideal shipping techniques, routing, and carriers.\nWorking with other departments to incorporate logistics with company procedures and operations.\nEvaluating budgets and expenditures.\nUpdating and evaluating metrics to assess performance and implement enhancements.\nEnsuring all operations adhere to laws, guidelines, and ISO requirements.\nEnsure that the warehouse operates at peak efficiency — with customer satisfaction the primary goal — by supervising, organizing, and training warehouse employees and establishing, monitoring, and managing operational goals.\nDevelop warehouse operations systems by determining product handling and storage. requirements, equipment utilization, inventory, gate processes, and shipping methods.\nTrain and manage the warehouse team to solve day-to-day operational issues and reach short- and long-term performance goals.\nOversee daily operations while controlling and managing inventory and logistics\nReview and prepare workflows, staffing requirements, space allocations, equipment layouts, and action plans that meet company standards for productivity, quality, and customer service.\nMaintain a safe and healthy work environment by establishing and enforcing standards and procedures and by complying with legal regulations.  ResponsibilitiesSupervise daily warehouse activities, including quality assurance, inventory control, space management, logistics, floor productivity, shipping, and customer service.\nSchedule and oversee the warehouse team, and manage the flow and quality of work to maximize efficiency and minimize overtime.\nInspect equipment, tools, and machinery regularly, and oversee general maintenance when necessary.\nMeet regularly with warehouse leads to analyze productivity and develop actionable plans for loss prevention.\nOversee and manage logistics for transporting products to customers and company facilities, communicating with drivers and air partners to ensure efficient delivery of packages.Skills",
    "Skills": [
        "Bachelor’s degree in business administration, logistics, supply chain, or relevant field.\nA minimum of 7 years experience in a similar role.\nIn-depth knowledge of the consumer goods industry.\nSolid understanding of logistics and inventory management software.\nOutstanding analytical, problem-solving, and organizational abilities.\nExceptional verbal and written communication skills."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Interior design; Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}