{
    "Job ID": "4737331",
    "Description": "Roles and responsibilities:Serve as project member in the formulation of plans and the execution of the overall material management.\nManage the procurement work process\nReports the material management status of purchased material and equipment\nManage the development of all purchasing and Material and Subcontractor Management activities from the requisition to close-out\nAssign requisitions, including Request for Quotation or Proposal packages\nResponsible for the implementation, management, and monitoring of the Material Management and Subcontractor Work Process\nPerform supervisory responsibilities as appropriate\nSupport the development of a procurement strategy, sourcing and procurement plans to be implemented across the business\nWork with the Business Units to ensure a clear process is established for the purchase and / or lease of materials and that achieves best value during the bidding process\nManage preferred supplier partnerships, monitoring performance and ensure compliance with company policies and procedures\nResponsible for the governance and controls of all aspects of the procurement process\nIncorporates best practices and market research into procurement practices to ensure WSP obtains value for money\nMakes recommendations on policies and procedures as needed to ensure the success and compliance of all procurement related activities\nManage and maintain the ERP Procurement module and the setting up of catalogue items, supporting managers as required on their product requirements\nManages and reviews documents for the procurement of all supplies, equipment and services and ensures compliance the Procurement Policy and Procedures Manual, as well as applicable local laws\nWork closely with the Commercial team to ensure the best practices are being adopted on the management of key suppliers / partners\nEnsure we conform to the highest standards (ethical, social diversity and environmental), in both the way we work and the goods and services that are procured\nContribute to the delivery of the program in a timely, efficient, sustainable and safe manner whilst achieving commercial targets, meeting client expectations and enhancing the reputation of the business\nExamine estimates and delivery schedules\nCoordinates procurement activities with clients, project management, and other departments within the Company.\nActively participates in the Company’s Quality Improvement Process. Promotes technical excellence in all employees. May endeavor to develop a partnership agreement where supplier quality and performance are consistent with Company and client requirements.\nParticipates in establishing and maintaining Procurement Department polices and procedures, working closely with upper management. Ensures compliance with the Company’s business ethics policy and with the Conflict of Interest Policy. Offers training in these policies, as needed, to the assigned procurement personnel.\nProvides technical guidance to assigned personnel, and ensures proficiency and timeliness of commercial management and contract administration.\nMaintains an active participation in related professional societies to keep abreast of relevant contractual issues.\nDraft high quality and professional contractual notices\nPerforms other responsibilities associated with this position as may be appropriate.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor’s degree in civil / Architectural Engineering\nExperience in the Saudi code\nField of work: contracting - real estate\nAdministrative role 5 years and above"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}