{
    "Job ID": "4737823",
    "Description": "Introduction:This vacant position is for an international company opening up it’s third-party global outsourcing office; expected to be fully operational in Dubai October 2023! The company is one of North America’s leading carriers and specialize in the transportation and logistics industry. They are growing in many areas and are searching for talented individuals to lead their team!*This is an in-office, permanent, full-time role in Dubai, UAE.Position Summary:The ideal candidate should be an accounting professional that is self-driven, organized, and thrives in a fast-paced environment. They should be able to lead the teams based in Dubai and simultaneously coordinate/communicate with HO in Canada. They will manage the day-to-day financial operations of the organization, will plan and direct all accounting operational functions, manage the accumulation and consolidation of financial information for internal and external financial statements, assess accounting and internal control systems, and guide departmental staff. As a leader, you will encourage innovative ideas that are sound and progressive, challenge the status quo, and support creativity in your area of responsibility.Direct Report:·    Financial ControllerDuties & Responsibilities:Oversee, guide and manage the general operations of the finance department and accounting functions, including, but not limited to accounts payable, accounts receivable, billing, payroll, and internal auditing.\nEngaging in and managing day-to-day financial transactions\nPreparing cash-flow reports that project cash needs at weekly and monthly intervals, and handling daily cash management\nManage teams of Accounts Receivable, Billing, Accounts Payable and Internal Audit.\nPrepare and present management reports, financial statements (internal & external) for all the subfunctions.\nLead scheduled weekly meetings with accounting teams\nFollow up with Management regarding issues or concerns as required.\nPreparing financial statements, both internal and external\nPreparing monthly financial indicators as selected\nPreparing cash flow analyses and budget variance analyses\nPreparing special reports by collecting, analyzing, and summarizing information and trends\nParticipating in the budgeting processes.\nEnsuring compliance with applicable rules, laws, and regulations\nProviding company leaders with insights for decision-making purposes\nEstablishing and maintaining financial controls\nAssessing and improving accounting processes and procedures; update and maintain SOP’s for designated teams\nScreening, hiring, training, developing and retaining accounting department employees.\nFollow up with team regarding various issues or concerns.\nPerform ad hoc analysis and projects as required.Job Offer:Full-time (Permanent)Skills",
    "Skills": [
        "Qualifications/Skills:",
        "Minimum of 5+ years experience in a similar role handling a team independently\nTransportation, trucking, logistics industry experience is highly preferred.\nTeam oriented and results driven using collaboration to achieve goals.\nQuick learner and ability to manage multiple and competing priorities in a fast-paced work environment\nStrong management skills with the ability to lead, mentor, and develop an accounting team of 10 to 15 people\nOutstanding verbal and written communication skills.\nExcellent organizational skills and ability to work in fast paced environments while remaining efficient and detailed oriented\nExcellent knowledge of advanced functions in Microsoft Excel\nProficiency in Microsoft applications including Word, and Outlook\nExcellent Interpersonal skills\nKnowledge of TMW (Truck Mate Software) will be an asset\nKnowledge of Quick Books will be considered an asset",
        "Experience Required",
        "Budget Forecasting: 1 Year (Required)",
        "BA/BS in Accounting, Finance, Economics or other business related field (Required)",
        "Accounting Designation (Preferred)",
        "Finance Manager: 5+ years (Required)",
        "Transportation/Logistics Industry: 1 year (Preferred)",
        "UAE local experience (Required)",
        "Non-UAE experience will be considered",
        "Fluent in English Language (Required)",
        "English speaking & writing (Proficient)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}