{
    "Job ID": "4738445",
    "Description": "Introduction:This vacant position is for an international company opening up it’s third-party global outsourcing office; expected to be fully operational in Dubai October 2023! The company is one of North America’s leading carriers and specialize in the transportation and logistics industry. They are growing in many areas and are searching for talented individuals to lead their team!*This is an in-office, permanent, full-time role in Dubai, UAE.Position Summary:The ideal candidate should be an HR professional that is self-driven, organized, and thrives in a fast-paced environment. They will be responsible for high volume full-cycle recruitment with office-focused recruitment and hiring of personnel (non-physical labor industry). They should be highly resourceful and should be able to recruit the teams based in Dubai and simultaneously coordinate/communicate with HO in Canada.Direct Report:·    Head of OperationsDuties & Responsibilities:Full Cycle Recruitment: post job ads, screen resumes, pre-screen candidates, coordinate and schedule interviews, complete reference checks, employee onboarding\nPrepare accurate job postings to attract top talent\nAttend or assist in planning events such as career fairs\nBuild strong talent pipelines and be proactive for our current and future hiring needs\nAssist in orientation of new employees and onboarding\nFollow up with Management regarding issues or concerns as required.\nFollow up with team regarding various issues or concerns.\nAssess current practices and procedures and recommend improvements.\nPerform ad hoc analysis and projects as required.\nOversee and monitor the corporate company processes\nUpdate and maintain SOP’s for designated teams\nCreate and stay up to date on company social media and post the job openings.\nFind new platforms and ways to promote job openings with in our organization\nStay updated on HR procedures and policiesJob Offer:Full-time (Permanent)Skills",
    "Skills": [
        "Qualifications/Skills:",
        "Post-secondary degree or diploma, or equivalent experience required\n5+ Years minimum experience in recruitment\nTeam-oriented and results-driven using collaboration to achieve goals.\nStrong phone/verbal and written communication skills.\nExcellent Interpersonal skills\nQuick learner and ability to manage multiple and competing priorities\nExcellent organizational skills and ability to work in fast-paced environments while remaining efficient and detailed oriented\nProficiency in Microsoft applications including Word, Excel, Outlook, Teams and HRIS",
        "Experience:",
        "Recruitment: 5 years (Required)\nTransportation/Logistics Industry: 1+ years (Preferred)\nUAE local experience (Required)\nNon-UAE experience will be considered\nFluent in English Language (Required)\nEnglish speaking & writing (Proficient)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}