{
    "Job ID": "4738315",
    "Description": "Job Summary:Responsibilities:Install, configure, and maintain Microsoft Windows Server operating systems and related software.\nManage and monitor Active Directory services, including user and group management, permissions, and security policies.\nAdminister Microsoft Exchange Server/ Microsoft Office 365, including user accounts, email routing, and mailbox management.\nPerform routine system maintenance tasks such as updates, patches, and system backups.\nTroubleshoot and resolve hardware, software, and network issues related to Microsoft systems.\nImplement and maintain security measures, including firewall configurations, antivirus software, and intrusion detection systems.\nCollaborate with other IT teams to design and implement solutions integrating with Microsoft-based systems.\nMonitor system performance and proactively address potential bottlenecks or performance issues.\nMaintain documentation of system configurations, processes, and procedures.\nProvide technical support to end-users, assisting with software installation, troubleshooting, and issue resolution.\nParticipate in on-call rotation for after-hours support and emergencies.\nStay up to date with the latest Microsoft technologies and industry best practices.\nResponsible for supporting, maintaining, and administrating the IT infrastructure (Data Center, Servers, Storage, etc.)\nDisaster Recovery planning and execution.\nResponsible for oversight of all IT Helpdesk functions.Skills",
    "Skills": [
        "We seek a skilled and motivated Microsoft System Administrator to join our IT team. The ideal candidate will implement, administer, and maintain our Microsoft-based systems and infrastructure. This role requires a deep understanding of Microsoft technologies, strong problem-solving skills, and the ability to work collaboratively with cross-functional teams to ensure our IT environment's stability, security, and efficiency.",
        "Qualifications:",
        "Bachelor's degree in computer science, Information Technology, or a related field (or equivalent work experience).\nProven experience as a Microsoft System Administrator or a similar role.\nKnowledge of cloud platforms such as Microsoft Azure is a must.\nStrong expertise in Microsoft Windows Server operating systems (2012, 2016, 2019).\nProficiency in Active Directory management, group policies, and user authentication.\nExperience with Microsoft Exchange Server administration.\nFamiliarity with virtualization technologies such as Hyper-V or VMware.\nKnowledge of networking protocols, firewall configurations, and security best practices.\nExcellent problem-solving and communication skills.\nAbility to work independently and collaboratively in a fast-paced environment.\nRelevant Microsoft certifications (e.g., MCSA, MCSE) are a plus.\nMicrosoft / Veeam certifications\nExcellent Communication skills\nExcellent time management skills\nResourcefulness and problem-solving aptitude\nTeamwork and collaboration",
        "Required Experience",
        "At least ten years of progressively increasing responsibility and achievement in the Information Technology area, with at least five years of system administration.\nExperience designing, deploying, and administering scalable, available, and fault-tolerant systems on Azure Cloud.\nMust have in-depth, up-to-date, and hands-on knowledge of Microsoft infrastructure technologies, including Active Directory, Exchange Server / Exchange Online, SQL Server, SharePoint Online, Azure/Office 365, Hyper-V, Veeam, DNS, DHCP, Symantec/Veritas Backup Solutions as well as a concrete understanding of the Cisco IOS and associated Cisco LAN/WAN products and Microsoft Defender."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}