{
    "Job ID": "4738102",
    "Description": "Follow all relevant policies, processes, standard operating procedures and instructions and ensure work is carried out in a controlled and consistent manner · Contribute to the identification of opportunities for continuous improvement of systems, processes and practices, taking into account leading practices, improvement of business processes, cost reduction and productivity improvement · Promote the implementation and adherence to relevant policies, processes and operating procedures to othersDevelop and research all related chemicals\n· Attend all activities related to mixing products\n· Ensure the contents and formulation of products are in accordance with the company standard\n· Assist in new product development throughout its lifecycle through ideation to manufacturing and packaging · Ensures Lab facilitates are equipped to carry out product design and testing activities in compliance with applicable standards and regulations -Saudi Foods & Drugs Authority (SFDA)\n· Communicate with the companies of perfume oil providers\n· Ensure the delivered perfume’s oil is in accordance with SFDA regulations\n· Suggest new methods and keep abreast of developments in the market as well as undertake proactive actions to develop processes\n· Provide guidance on new product segments\n· Help NPD team to develop new products\n· Check the stability and on online productions\n· Work with various stakeholders to ensure feasibility of new ideas\n· Solve problems related to productionsSkills",
    "Skills": [
        "1. Analytical Skills:",
        "Proficiency in analyzing complex data, interpreting results, and drawing meaningful conclusions from experiments.",
        "2. Laboratory Techniques:",
        "Mastery of various laboratory techniques, including titration, chromatography, spectroscopy, and other analytical methods.",
        "3. Research Abilities:",
        "Strong research skills to investigate chemical processes, discover new compounds, and develop innovative solutions.",
        "4. Problem-Solving:",
        "Ability to identify challenges, develop hypotheses, and devise experiments to address scientific questions or problems."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}