{
    "Job ID": "4738290",
    "Description": "PurposeThe SAP S/4HANA EAM functional expert is crucial in designing, implementing, and supporting SAP S/4HANA's Enterprise Asset Management modules. You will collaborate closely with various stakeholders to design, configure, and optimize EAM processes, contributing to the efficient management of assets and maintenance activities.KEY ROLES AND RESPONSIBILITIESFunctional: • SAP S/4HANA EAM Implementation: Actively participate in the end-to-end implementation of SAP S/4HANA EAM modules, including Plant Maintenance (PM), Preventive Maintenance (PPM), Predictive Maintenance (PdMS), Calibration, Linear Asset Management, and other related components.• Solution Design: Work closely with business users, maintenance managers, and other stakeholders to gather requirements and design EAM solutions aligned with industry best practices. Implement SAP S/4HANA EAM best practices to meet specific business needs.• Configuration and Integration: Configure SAP S/4HANA EAM modules to support maintenance processes, asset data management, and work order management. Collaborate with other SAP functional experts and technical teams to ensure seamless integration with other SAP and non-SAP systems.• Asset Master Data Management: Oversee the creation, maintenance, and governance of asset master data in the SAP system. Ensure data accuracy and consistency to support reliable asset management practices.• Maintenance Planning and Scheduling: Implement maintenance planning and scheduling strategies to optimize asset performance and reduce downtime. Define maintenance task lists, maintenance plans, and scheduling parameters.• Preventive and Predictive Maintenance: Design and implement preventive maintenance strategies, including time-based and condition-based maintenance schedules. Leverage predictive maintenance capabilities to address asset health and improve reliability proactively.• Work Order Management: Define and configure work order processes, including creation, assignment, execution, and completion of maintenance tasks. Streamline work order management for increased efficiency and cost-effectiveness.• Mobile EAM Solutions: Collaborate with IT teams to implement mobile solutions for field technicians to access and update maintenance information in real-time.• Testing and Quality Assurance: Plan, coordinate, and execute comprehensive testing of SAP S/4HANA EAM solutions. Conduct unit testing, integration testing, and user acceptance testing (UAT) to ensure the reliability of implemented solutions.• Training and Support: Provide training to end-users on SAP S/4HANA EAM functionalities and processes. Offer post-implementation support, troubleshooting assistance, and timely resolution of issues.• Documentation: Create and maintain comprehensive documentation, including functional specifications, process flows, configuration documents, and user guides.• Continuous Improvement: Stay updated with the latest SAP S/4HANA EAM advancements, industry trends, and best practices. Proactively identify opportunities for process improvement and system optimisation.Skills",
    "Skills": [
        "REQUIRED EXPERIENCE AND QUALIFICATIONS",
        "Education: ",
        "• Bachelor's degree in Engineering, Computer Science, or a related field. ",
        "• Relevant certifications in SAP EAM are a plus.",
        "Experience: ",
        "• Proven experience (6+ years) in implementing and supporting SAP S/4HANA EAM modules, particularly Plant Maintenance (PM) and other EAM components.",
        "• Strong understanding of asset management and maintenance processes in various industries.",
        "• In-depth knowledge of SAP S/4HANA EAM functionalities, configuration, and integration with other SAP ",
        "modules.",
        "• Familiarity with mobile EAM solutions for field technicians is advantageous.",
        "Knowledge, Skills and Abilities:",
        "• Excellent analytical, problem-solving, and communication skills.",
        "• Ability to work effectively in cross-functional teams and manage multiple priorities in a fast-paced ",
        "environment.",
        "• Strong project management skills and the ability to lead EAM-related initiatives.",
        "• A proactive and customer-focused approach to delivering solutions.",
        "People of all nationalities are welcome, with a special emphasis on Emiratis."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}