{
    "Job ID": "4738931",
    "Description": "BriefDar Al-Hulool IT company is seeking a Sales specialist in the Saudi Arabia. The ideal candidate will be someone with a strong background selling in AI , IOT, Cybersecurity , and RPA. You will be able to suggest forward-thinking ideas to promote our brand and work closely with clients to understand their needs. This individual will have excellent communication abilities and negotiation skills.⁩Responsibilities:•   Work with key accounts to provide product solutions, develop new business, and to ensure satisfaction•   Serve as primary day-to-day liaison with assigned clients and maintain positive ongoing relationships•   Develop and maintain relationships with clients.•   Winning large deals in IT Sector projects.•   Manage internal resources and assign appropriate resources to each existing customer and new sales opportunities•   Ongoing pipeline management with accurate quarterly forecasting•   Writing sales reports.-Led all stages of payment gateway projects across the gulf, from conception through delivery.Areas of Expertise:1- Market based sales2- Business Development Plans3- Ability to manage and delegate the sales team4- Ability to plan and execute strong strategies5- Good leadership skills and ability to motivate the sales team6- Sales Strategy planning7- contract Development & Negotiations8- Ability to recognize and recruit sales representatives who will be successful9- Products & Services PresentationQualifications:•   Bachelor's degree IT or equivalent experience•   5 years' of proven success in client management•   Familiarity with sales performance metrics•   Strong negotiation, presentation and communication skillsSkills",
    "Skills": [
        "Qualifications:",
        "•   Bachelor's degree IT or equivalent experience",
        "•   5 years' of proven success in client management",
        "•   Familiarity with sales performance metrics",
        "•   Strong negotiation, presentation and communication skills"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Al Malik Fahd, Riyadh , Saudi Arabia",
        "Company Industry": "IT Services; Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}