{
    "Job ID": "4738374",
    "Description": "orders from existing and prospective customers through a relationship-based approach.\ndevelop and maintain business relationships with current customers and prospective customers to generate new business.\nprospects, customers, and referral sources and develop/maintain relationships to ensure attainment of company business goals. Support efforts to consistently grow the base of referral sources.\nthe resolution of customer problems and complaints.\n  Contribute to research of market assessments, competitor analyses, pricing strategies on the competitive environment and the company’s strengths, weaknesses, opportunities, and targets, and provide feedback to the Sales Manager.\n  Provide a professional level of customer service with existing and prospective clientele.\n  Supply management with oral and written reports on customer needs, problems, interests, competitive activities, and potential for new products and services.\n  Participate in trade shows and conventions for the benefit of the company.\noptimal usage of sales materials and current product knowledge.\nfrom Sales Representatives oral and written reports on customer needs, problems, interests, competitive activities, and potential for new products and services.\n  Achieve a minimum of 75% ofthe company sales target on monthly and yearly basis in the key accounts, large & small groceries and wholesale sectors for the entire product portfolio of the company.\n  Achieve the targeted level of distribution across all key accounts, groceries & wholesale sectors and at national level.\n  Manage a team of Sales Representatives including training, assessment against objectives and motivation.\n  Coordinate with the different Sales Supervisors in order to maximize sales potential.\n  Attend meetings/workshops with Sales Managers and conduct requested business presentations.\nOther duties assigned by Area Sales Manager Skills",
    "Skills": [
        "  Strong negotiation and selling skills.\n  Strong organizational and time management discipline.\n  Solid judgment and ability to resolve conflicts effectively.\n  Ability to multi-task and operate effectively in stressful situations.\nexcellent attendance and positive attitude to the job\ncommunication skills and have an ability to maintain a good working relationship with others.\nability to lead, train, and motivate a team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Age": "Min: 20 Max: 29"
    },
    "Data": {
        "Job Location": "Tripoli, Libya",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "Unspecified"
    }
}