{
    "Job ID": "4738261",
    "Description": "Driven to create unique home-grown food concepts that bring people together, the Independent Food Company is a UAE-based hospitality company with multiple concepts under its umbrella – SALT, Switch, Parker’s, Grind, Somewhere, and Public.Receiving deliveries and verifying that all ordered items have been delivered and are of good quality.\nUnderstanding the necessary meal ingredients and preparing them using the best practices for a perfect meal.\nAdhering to the instructions of the Chef de partie, preparing salads and sauces to satisfy the customer, and modifying the recipe if required.\nKeeping track of low or depleted kitchen supplies and requesting additional requirements after consulting senior professionals.Skills",
    "Skills": [
        "We are looking for experienced Commis Chefs to join the amazing back-of-house teams at our restaurants throughout the UAE as well as our Central Kitchen sites. As a Commis Chef you are responsible for the preparation of food, supporting the team of chefs in the kitchen, and playing an important role in the overall successful delivery of quality food. ",
        "To be considered for this role we require previous experience working in a busy kitchen, whether with a high-volume catering group or a busy independent restaurant. Strong communication skills are important as is a passion for developing a career as a chef. We will provide ongoing opportunities to support this growth. ",
        "Experience cooking with either Arabic/Lebanese cuisine or Italian/French cuisine."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant; Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}