{
    "Job ID": "4738107",
    "Description": "Roles and Responsibilities:Lead the regular activities of Ticketing, L2 support and Proactive monitoring efficiently.\nHandle the Workforce management of the ESC team.\nAnalyze the skillsets of each team members and up skill them wherever the operation demands.\nCoordination with all Ooredoo teams and communication with customer for all planned activities/changes Lead the Major Planned activities\nwith proper Pre and Post activity plans and escalation matrix.\nEnsure knowledge transfer to colleagues by setting knowledge base processes and documentation.\nMaintain the communication channel with other groups/departments and improve it on regularly basis.\nEscalate major faults that can affect service levels to higher management, Customers and different Ooredoo teams for faster resolution\nCoordinate with all relevant stake holders for the root cause analysis, RCA report and share with customer\nAct as focal point for all the Major& Critical faults, so that the Agents can complete the diagnosis without disruptions.\nArrange a work environment to ensure the highest level of performance.\nBe part of the process development and provide the inputs timely.\nGenerate performance reports of the team as well as operations and circulate to the superiors periodically.\nIdentify the trends in performance and convert them to positive improvements with right guidance and interaction.\nMonitor efficiently all related day to day activities (Fault Management, Performance Monitoring, TT creation/follow-up, coordination,\ncustomer updates etc.) according to the circulated 24/7 shift duty roster.\nHandle the Managed services tickets and supervise the group of agents who handles the Managed services.\nHandle the escalations from various teams and use the ESC agents effectively to resolve them on time.\nEscalate major faults that can affect service levels to higher management, Customers and different Ooredoo teams for faster resolution\nMaintain the Managed service KPIs and provide regular performance reports.Skills",
    "Skills": [
        "Required Qualifications and competencies:",
        "Bachelor degree in Telecommunication / Engineering with minimum 5 years’ experience in corporate service management domain. \nITIL Certified\nGood understanding of E2E telecom network solution.\nExcellent Knowledge of WAN Technology, Network Security & Remote Access Technique.\nFamiliar with the NMS Tools which deals with Availability Management and Performance Management\nGood knowledge and experience on Service Provider Voice Products \nGood technical knowledge on POTN, SDH, MPLS, VOIP, VSAT, networking technologies for delivering Centralized network and service operations.\nExcellent reading/writing English.\nDesign and Presentation skills\nExcellent interpersonal and communication skills.\nInnovative and creative thinker.\nTeam Leading Skills \nProblem solving and decision making."
    ],
    "Preferred": {
        "Residence Location": "All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "IT Services; Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}