{
    "Job ID": "4738052",
    "Description": "We are looking for a Junior Accountant to join our team.Responsibililities:·       Accounts payable / receivable / inventory·       Preparation of monthly financial reports such as Profit & Loss Statements and Balance Sheet, Cash Flow and reporting it directly to the Accounting Manager.·       Vat Return filling.·       Accurately entering financial transactions into accounting software and maintaining organized and up-to-date records.·       Recording and categorizing business expenses, ensuring they are appropriately documented and allocated.·       Assisting in the preparation of financial reports and statements, providing accurate and timely financial information to management.·       Assisting in maintaining accurate and organized financial records, including accounts payable and accounts receivable ledgers.·       Providing support during internal and external audits by preparing requested documentation and responding to auditor inquiries·       Assisting with special projects, tasks, and assignments as needed by the accounting department or management.Candidate must have bachelor's degree and minimum 1 year of UAE experience in the relevant field.Skills",
    "Skills": [
        "Pertinent educational qualification in the field of Commerce, Finance, and Economics.\nKnowledge of finance, accounting, budgeting, and cost control principles.\nProven command of negotiation skills to build long-lasting partnerships with clients.\nAn analytical personality, apt in understanding data by investigating the interplay between various information.\nAbility to prepare detailed and accurate reports within the given timeframe as per requirements.\nProficient use of Microsoft Office and its applications."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}