{
    "Job ID": "4738287",
    "Description": "PurposeThe SuccessFactors functional expert will implement, configure, and support SAP SuccessFactors modules to enhance our HR processes and elevate the employee experience. You will collaborate closely with HR stakeholders, IT colleagues, and external consultants to drive successful HR system implementations and optimizations.• SAP SuccessFactors Implementation: Actively participate in the end-to-end implementation of SAP SuccessFactors modules, including Employee Central, Performance Management, Learning Management, Compensation Management, Succession Planning, and other relevant components. • Solution Design: Work closely with HR business partners to gather requirements and design optimal HR solutions using SAP SuccessFactors functionality. Customize and configure SuccessFactors modules to align with HR business needs and industry best practices. • Data Integration: Collaborate with technical teams to ensure seamless integration between SAP SuccessFactors and other HR systems, such as SAP ERP or third-party applications. • Employee Data Management: Oversee the setup and maintenance of employee data in SAP SuccessFactors to ensure data accuracy and compliance with HR policies and regulations. • Performance and Talent Management: Implement and configure performance management and talent management processes in SAP SuccessFactors, including goal setting, performance reviews, development plans, and career succession planning.• Learning and Development: Design and configure learning management processes, including training content management, course assignments, certifications, and employee learning histories. • Compensation Management: Set up and configure compensation management processes in SAP SuccessFactors to support salary planning, bonuses, incentives, and rewards. • Employee Self-Service: Implement and optimize employee self-service functionalities in SAP SuccessFactors, enabling employees to access and update their HR information efficiently. • Testing and Quality Assurance: Plan, coordinate, and execute comprehensive testing of SAP SuccessFactors solutions, ensuring the system's reliability and accuracy. • User Training and Support: Train end-users on SAP SuccessFactors functionalities and HR processes. Address and resolve user queries and issues in a timely manner. • Documentation: Create and maintain comprehensive documentation, including functional specifications, process flows, configuration documents, and user guides.• Continuous Improvement: Stay updated with the latest SAP SuccessFactors releases, HR industry trends, and best practices. Proactively identify opportunities for HR process improvement and system optimisation.Skills",
    "Skills": [
        "Education: ",
        "• Bachelor's degree in Information Technology, Human Resources, Business Administration, or a related ",
        "field.",
        "Experience: ",
        "• Proven experience (6+ years) in implementing and supporting SAP SuccessFactors modules, particularly ",
        "Employee Central and other HR modules.",
        "• Strong understanding of HR processes and best practices.",
        "• In-depth knowledge of SAP SuccessFactors functionalities, configuration, and integration with other HR ",
        "systems.",
        "• Familiarity with HR data management and compliance requirements.",
        "License and Certifications:",
        "• HR certifications and SAP SuccessFactors certifications are a plus.",
        "Knowledge, Skills and Abilities:",
        "• Excellent analytical, problem-solving, and communication skills.",
        "• Ability to work effectively in cross-functional teams and manage multiple priorities in a fast-paced ",
        "environment.",
        "• Strong project management skills and the ability to lead HR technology initiatives.",
        "• A proactive and customer-focused approach to delivering HR solutions.",
        "People of all nationalities are welcome, with a special emphasis on Emiratis."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}