{
    "Job ID": "4738503",
    "Description": "Process Engineer- Combined Cycle (Mechanical)As a Process or Senior Process Engineer at the Jazan, you will support the commissioning and operations phases of the project by:Support and participate in all commissioning activities including Commissioning Engineering Support, Commissioning and Start-up Procedure Review and Pre-Start-up Safety Review.\nSupport reviews of process safety hazards prior to start-up including providing input for review Safety Integrity Level assessments and Layer of Protection Analysis.\nSupport field validation of SIS and DCS systems with Control and Process Control engineers.\nHelp support operations during first start-up to guide Operations and ensure safe start-up.\nProvide engineering support to identify performance gaps, troubleshoot problems, and develop solutions to resolve plant operating issues.\nDevelop and perform the performance testing program for the facility following successful start-up\nProvide technical support for developing and driving improvements to meet financial targets.\nProvide process safety support, including technical and safety reviews for changes to the plant.\nProvide effective interfaces with technical functions in other departments, laboratory, and Operations Managers.Skills",
    "Skills": [
        "JOB REQUIREMENTS",
        "The requirements below are the minimum requirements for the Process Engineering positions:",
        "1. Must be a Saudi resident or be able to obtain a Saudi visa/IQAMA, and be willing to work in Jazan, KSA",
        "2. Have a minimum of 15 years’ experience, in power plants project engineering and power plants operations support.",
        "3. Have experience with managing project process documentation, including H&M Balances, P&IDs, functional logic tables, alarm and trip settings, critical safety tables. control strategies, and operating procedures/training manuals through commissioning, start-up and operation.",
        "4. Have a solid understanding of fundamentals of power generation plans process and thermodynamics.",
        "5. Candidates should also possess demonstrated mathematical, analytical, troubleshooting, and problem-solving skills, and have the ability to reason logically and systematically and communicate this clearly.",
        "6. Have important knowledge of international codes and standards applicable to Power Generation Plants, and Oil and Gas and Refining Industries (API, ISA, NEC / IEC, NFPA, ASME, ANSI/ASME, ASTM, etc.) also knowledge of Saudi Aramco specifications, standards and working practices will be an advantage."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Chemical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}