{
    "Job ID": "4738996",
    "Description": "Junior Accountant - Emirati NationalCarry out accounting entries and paperwork tasks related to A/P, Petty cash expenses, employees’ payments, reconcile credit cards efficiently and book entries in system, prepares month-end supporting reconciliations, and keep proper archiving record for the company in both soft copy and hard copy, the archiving including all finance documents of the company.Job Responsibilities & Performance Standards: Local Accounts PayableReceive invoices of goods and services and verify the invoices comply with financial policies, procedures, UAE law and legislation and contract terms, invoices include (local suppliers) examples: insurance, products, service providers and others.\nBook invoices in system and proceed with the due payments and book the payments in system.\nMonitor accounts payable and ensure payments are up to date, process payment transfer request or check payment request and print check from system in case or check payment request.\nReconcile vendor’s balances at each payment and at month end.\nCorrespond with vendors and respond to inquiries, acts as a liaison between related departments and vendors.\nMaintain accounts payable files.\nReimburse office expenses and book entries of payments and expenses in system.\nProcess payment transfer request or check payment request (including check printing from System) of staff payments and book the entries in system.\nBook the entries of credit card transactions on system after receiving supporting documents from treasury department.\nKeep soft & Hard copy of all A/P Invoices in same sequence as system.\nkeep soft & Hard copy of All A/R Invoices in same sequence as system.\nmaintain the entire department filing in a proper manner.\nKeep separate soft & Hard copy file for each VAT return filing.\nKeep filling in compliance with any new law and legislation raised by the UAE legal bodies.\nSupport other functionals during colleagues leave.\nAssist in guiding and helping new accountants if needed.\nHandle petty cash advance if required.\nSupport in admin and government work if required.Expenses Reimbursement & Staff PaymentsReimburse office expenses and book entries of payments and expenses in system.\nProcess payment transfer request or check payment request (including check printing from System) of staff payments and book the entries in system.Credit cardBook the entries of credit card transactions on system after receiving supporting documents from treasury department.FillingKeep soft & Hard copy of all A/P Invoices in same sequence as system.\nkeep soft & Hard copy of All A/R Invoices in same sequence as system.\nmaintain the entire department filing in a proper manner.\nKeep separate soft & Hard copy file for each VAT return filing.\nKeep filling in compliance with any new law and legislation raised by the UAE legal bodies.OtherSupport other functionals during colleagues leave.\nAssist in guiding and helping new accountants if needed.\nHandle petty cash advance if required.\nSupport in admin and government work if required.Skills",
    "Skills": [
        "Minimum Qualifications:",
        "Bachelor’s degree in accounting\nFluent in Arabic and English\nProficient in Microsoft Office",
        "Required skills:",
        "Excellent written and verbal communication skills\nSelf-motivated and ability to learn.\nStrong follow up skills.\nOpen to handle new tasks if required.\nCommitted with ability to work under pressure.\nCorporate etiquette."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 1",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "United Arab Emirates",
        "Age": "Max: 27"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}