{
    "Job ID": "4738219",
    "Description": "Ensure Overall SLA is monitored at order level à Order is Fulfilled and Delivered within the promised delivery timings\nEnsure that the order presentation is proper and follow-up on expiry dates by the allocators, sorters, packers to ensure controlled deliverables to Boutiqaat’s Customers.\nEnsure no backlog and process orders in FIFO.\nFollow up on reports with objectives to improve KPIs.\nDefine Relevant Working Hours for Allocation Team to be efficient with Picking Process and Timings.\nAssist the Team in case of required assistance.\nEnsure Picked items are allocated in FIFO manner\nEnsure resolving any miss-pick, Excess-Pick, Wrong Pick as soon as possible with coordination with relevant operations sections and team members.\nDefine Relevant Working Hours for Sorting Team Members to be efficient with prior processes & timings.\nEnsure fast moving of products along the process.\nEnsure FIFO is maintained along the process.\nEnsure quick response to miss-sort, miss pick, miss allocated items.\nMonitor Packing Material with Admin Team\nEnsure relevant packing material are assigned to packers\nEnsure FIFO is maintained in organizing Packing Team\nEnsure that packer is packing with relevant packing materials. (Train Team in case of overusing or less using of packing material)\nDifferentiate packing Logics for Local and international shipments.\nOrganize Packing Stations to be Clean, Organized and ready to pack Boutiqaat’s premium box.\nEnsure smooth handover with DSP/Logistics Department and Highlight any risk\nArchive relevant documents of Shipments Handover.\nFollowing up with DSP to Re-conciliation of shipments\nFollowing up with DSP in case of problems arousal.\nChecks Aging Shipments between Packing and Manifest.Skills",
    "Skills": [
        "Bachelor's degree in business, operations management, or related field.\n3-5 years experience in an operations management role.\nProven leadership and team-building skills.\nExcellent communication, interpersonal, and problem-solving skills.\nHighly organized with strong attention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}