{
    "Job ID": "4738174",
    "Description": "• Establish and administer sound food and beverage cost control systems and procedures consistent with high standards of quality and service.• Perform tasks on areas of concern which include food and beverage, purchasing, receiving, storage and issuance, menu planning, production and portion control, pricing, inventories, reporting forecasting and analysis.• Check to see that bidding procedures as specified by the hotel are adhered to.• Provide costing, control, administration support in regard to food and beverage cost to F&B Department, supervise inventory control.• Form analysis and prepare reports to keep all levels of management informed of day-to-day food and beverage costs, problems and opportunities and to provide necessary information for accounting entries.• Verify the accuracy of the entries, extensions and totals of the Receiving Clerk's Daily Report and that all items received, with or without invoice, had been properly recorded thereon.• Verify that Notice of Error Correction and Goods Received without Invoice forms have been prepared where appropriate.• Spot check merchandise received daily to determine that it conforms to specifications as to weight, trim, and count and that it has been properly invoiced.• Ensure that adequate controls are maintained over all goods received from the point of receipt to the point of storage or final delivery.• Ensure that all merchandise is stored in properly locked storage areas and monitor security control of keys for all such areas.• Furnish the Executive Chef information needed in planning daily production requirements and monitor daily production of pastry and other items, and see to it that they are according to plan.• Check the butcher shop production record daily for yield information and for control of steak usage.• Establish potential cost for outlets.• Verify the accuracy of outlet checks.• Check cash register readings for all cash items to ensure that amounts recorded agree with actual consumption as reflected on requisitions net of returned merchandise.• Monitor activities relating to food and beverage cost controls of the hotel.• In co-operation with the Outlet Operation Manager and the Executive Chef, to establish standard portion sizes for all outlets, post in proper locations in the kitchen and continuously monitor to see to it that they are adhered to.• Take initiative to see that food and beverage control procedures are adhered to and where necessary enlist the assistance of the Chief Accountant and/or General Manager to ensure compliance.• Verify that Hotel standard purchase specifications are followed on a continuing basis.• Check daily quotation sheets prices with invoiced prices.• Provide information from perpetual inventory records needed for beverage purchasing.• Review any deficiencies with Receiving Clerk to ascertain why sub-standard merchandise was accepted. If not resolved, report the problem to the Chief Accountant.• Maintain a daily and cumulative monthly record of food and beverage requisitions and of direct purchases issued to the producing department without requisition.Skills",
    "Skills": [
        "Monitor procedures for issuing store items from storerooms to ensure that such merchandise is issued only on written requisition signed by a properly authorized person.",
        "• Monitor beverage issue procedures to make certain that bar requisitions are handled according to cost control manual instructions.",
        "• Participate in the formulation and enforcement of sound control procedures for banquet beverage bars including issue, return and re-issue practices.",
        "• Participate in planning daily salvage, control and usage of usable left-over food items, including banquets.",
        "• Take monthly inventories of food and beverage assisted by another member of the controller staff or food and beverage management personnel.",
        "• Maintain a perpetual inventory of the beverage storeroom.",
        "• Reconcile store purchased for each month.",
        "• Maintain a complete familiarity with the requirement of the Food and Beverage Cost Control policy according to the hotel standards and carry out the responsibilities therein designated.",
        "• Prepare cost requisitions directly issued on a daily basis to produce a daily food cost.",
        "",
        "Perform other related duties as assigned."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Ula, Saudi Arabia",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}