{
    "Job ID": "4738257",
    "Description": "Job DescriptionSupervise, manage, operate and perform preventative maintenance operational planning and implementation on Casing and Tubular Running Equipment .To safely operate casing/tubing tongs, as mentioned on Basic Function Service Technician IV. Teaching skills and monitoring the overall job situation, and safety aspects. To safely operate casing/tubing tongs, power units, tubular handling and cleaning equipment, Torque Turn services and equipment, bottom hole assembly make-up; Historic and other specialized oilfield equipment used in tubular make-up and testing services.Essential Functions:When on Stand By keep in contact with the Base manager and stay in contact by means of telephone.\nPerform TRS Field Services as per the requirements\nProvide High Level of Well Site Supervision and Standards\nPositive Attitude - Act With Intensity\nAttend daily safety & morning meeting at designated bases.\nConduct Competency Assessments\nOverall responsibility for crews and jobs offshore and onshore. Acting as a point of contact with Company Representatives.\nOverall responsibility for safe working practices on site and full knowledge of the Company HSE Manual and procedures.\nCompletion of all necessary job and equipment paperwork in line with Company procedures\nTraining of Junior Technicians and assessment of their progress.\nMonitoring performance of Technicians. Ability to undertake performance appraisal reports.\nTo safely and satisfactorily perform any given casing/tubing tong assignment.\nKnow routine and specific maintenance procedures as they relate to power tongs and power units\nPreparation of accurate delivery tickets, job reports, time sheets and other similar administrative forms\nReview and dispatch equipment according to checklist procedures\nIndependently operate and trouble shoots all tubular handling and cleaning equipment.\nAssist maintenance supervisor with special maintenance assignments and perform pipe yard duties as necessary\nAct as trainer for Service Technicians 1, 2, 3 & 4.\nReport any accident, incident or near miss incidents in accordance with the company’s HSE Program Manual. Attend monthly HSE meetings and initiate changes to existing HSE procedures or initiate new procedures.\nPerform other assignment as directed by base manager.\nResponsible for QHSSE and EEP operations for his relevant functions.\nAccountable to safe operation of Parker Wellbore and Customer (if any) Equipment in his area of operations\nAssist in load outs.\n Responsible for providing adequate data to complete the Reports (hours spent and parts used) for each individual Piece of equipment. Maintain the store inventory records up dated.\nEnsure that Quality Standards are met and repair work is carried out according to acceptable standards and in good workmanship.\nThe thorough testing of equipment before it is released for operational work. Ensure that outgoing/incoming equipment are checked & tested according to the applicable procedures & work instructions. The base supervisor must inform if non-conformance is determined.\n Report any unforeseen repair work to the base supervisor and discuss corrective action.\nAccept any reasonable assignment as given by the department head/ Base Supervisor.Position competenciesInitiating & Driving Change • Acts as a catalyst for and takes responsibility for leading, directing, and managing organizational change • Develops new insights into situations and applies innovative solutions • Creates work environment that encourages creative thinking and innovation • Drives step changes in how the company operates • Understands how to change and addresses not only systems and processes, but also cultural aspects of change • Is good at bringing the creative ideas of others to market • Develops a change strategy that includes milestones and timelines • Accurately assesses the potential barriers and resources necessary for change initiatives • Understands and supports the need for change • Envisions and articulates the intended result of the change process • Provides direction and focus during the change process • Helps to generate support of the changes throughout the organization • Identifies and enlists allies who support the change process • Provides resources, removes barriers, and acts as an advocate for those initiating change\nResult Focused • Establishes clear, specific performance goals, expectations, and priorities • Can be counted on to exceed goals successfully • Is constantly and consistently one of the top performers • Very bottom-line oriented • Steadfastly pushes self and others for results • Navigates quickly and effectively to resolve problems and obstacles • Persists to complete tasks / responsibilities, even in the face of difficulties • Develops a sense of urgency in others to complete tasks • Operates with personal ownership and looks for ways to improve performance all the time • Challenges him- or herself and others to raise the bar on performance • Focuses people on critical activities that yield a high impact • Holds self and others accountable for delivering high-quality results on time and within budget (e.g., models high work standards and demands the same from others)\nTeam Work • Blends people into teams when they are needed • Creates strong morale and spirit in his/her team • Shares wins and successes • Fosters open dialogue • Lets people finish and be responsible for their work • Seeks consensus among diverse viewpoints as a means of building group commitment • Defines success in terms of the whole team • Creates a feeling of belonging in the team • Values the contributions of all team members • Creates an environment that encourages open communication amongst team members • Creates an environment that encourages collective problem solving amongst team members\nCustomer Focus • Is dedicated to meeting the expectations and requirements of internal and external customers • Gets first-hand customer information and uses it to understand customers' business issues and needs for improvements in products and services • Acts with customer in mind • Establishes and maintains effective relationships with customers and gains their trust and respect • Genuinely enjoys working with customers to build long-term partnerships • Creates a sense of customer focus throughout their team/ department/ business unitSkills",
    "Skills": [
        "Education / Qualification:",
        "Qualifications in Mechanical or Electronic Applications or past experience in a similar operation ie. Rig operation or casing and tubing running activity.",
        "Experience:",
        "8-10 Years minimum field proven experience in Rig Floor / Tubular Handling and Running Operations with 5 years supervisory level.\nThe physical ability to immediately respond to emergency situation.\nShould pass the written exams on the Training Manual.\nDemonstrate a high level of participation in Safety Programs and Systems - Embrace Discipline\nDemonstrate and provide Leadership in Safe Behavior\nWillingness to Listen and Learn - Be Responsive\nKnow the operation and routine maintenance requirements of all tubular handling and cleaning equipment.\nMust have an extensive knowledge of the Company’s products and services. And Quality procedures and work instructions\\\nHave extensive operational and maintenance knowledge of all Company equipment including but not limited to hydro test, compressors, pipe cleaning machine, etc.\nAbility to operate pipe yard equipment such as cleaning and bucking machines.\nBe the focal point between Company’s representative when dealing with Operating and Drilling Contractor Personnel.\nKnowledge of products, services and equipment, knowledge on hydraulics, pneumatics, electrical controls, etc.",
        "Physical demands / work environment",
        "Copy & paste or type the Physical demands / work environment here",
        "Physical demands and work environment",
        "Ability to work around moving machinery\nAbility to perform under stress, under pressure, and/or in emergency situations.\nCarry up to 10 lbs."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}