{
    "Job ID": "4738927",
    "Description": "Overview:As a Duty News Editor at Al Aan TV, you will play a vital role in overseeing the newsroom's operations, ensuring the delivery of timely, accurate, and engaging news content. You'll be at the forefront of news curation, working closely with a team of journalists and producers to provide our audience with reliable and impactful news coverage.Key Responsibilities:Editorial Oversight: Lead the newsroom during assigned shifts, making critical editorial decisions, and maintaining the highest standards of accuracy and integrity.\nContent Coordination: Collaborate with reporters, correspondents, and other team members to prioritize, edit, and publish news stories, features, and multimedia content.\nBreaking News Management: Quickly respond to developing stories, coordinating coverage, and updating content as events unfold.\nQuality Assurance: Review articles, headlines, and visuals to ensure they align with editorial guidelines, style standards, and fact-checking protocols.\nDeadline Management: Ensure all content is published promptly, meeting established deadlines and adhering to the newsroom's production schedule.\nAudience Engagement: Monitor audience feedback, analytics, and trends to adjust content strategies and enhance reader engagement.\nCross-Departmental Collaboration: Work closely with graphics, multimedia, and social media teams to enhance the impact and reach of news content.\nEditorial Planning: Participate in editorial meetings to contribute ideas, angles, and coverage strategies for upcoming stories and events.\nStaff Support: Provide guidance and support to junior editors and reporters, fostering a collaborative and learning-focused environment.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Journalism, Communications, or related field.\nProven experience as a news editor or journalist, showcasing strong editorial judgment and decision-making skills.\nArabic speaker.\nAbility to thrive in a fast-paced news environment, managing priorities and adapting to breaking news situations.\nProficiency in digital publishing tools, video editing and content management systems.\nExceptional leadership and communication skills.\nA deep understanding of current events, news trends, and the evolving media landscape.\nFlexibility to work varied shifts, including evenings and weekends.",
        "Join us in shaping the news landscape and delivering impactful stories to our audience. Apply now to be part of our dedicated newsroom team!"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Media Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}