{
    "Job ID": "4738047",
    "Description": "To provide solutions for complicated cases that requires experience and knowledge\nTo manage second level escalations.\nTo surprise and delight all our customers by being knowledgeable, efficient, friendly and thoughtful in every call with them, anticipating their needs and arriving at an uncomplicated, timely and satisfying outcome for each customer interaction.\nTo always make sure to understand the customer needs, attend to their inquiries and make sure they are clear on what’s next at the end of each call.\nTo interact imaginatively with each individual customer, helping them see how our products could work for them. To guide customers through the features and benefits of our products and services ensuring the customer completely understands company offerings\nTo take ownership for the customer’s experience, seeking and acting upon feedback ensuring any complaints are dealt with effectively and efficiently.Skills",
    "Skills": [
        "Knowledge & Skills:",
        "·        Strong communication skills (both written and spoken) in at least English and ideally Arabic/other languages.",
        "·        Computer literacy (Word, Excel, Outlook)",
        "·        Highly self-motivated and able to act on own abilities ",
        "·        Effective listening skills that deliver against customer needs",
        "·        Passion and motivation for over achieving against KPIs without compromising customer service.",
        "·        Great at networking and building genuine and productive relationships",
        "·        Interest in and awareness of media platform within local area",
        "·        Working collaboratively",
        "·        Influencing and persuading",
        "·        Delivery of results",
        "·        Focusing on the customer"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Ad Dasmah, Kuwait",
        "Company Industry": "Call Centers & Customer Care Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}