{
    "Job ID": "4738218",
    "Description": "Summary:The Tele Sales of the P2P Trading Platform is responsible for generating leads and closing sales for our P2P trading platform. You will be responsible for qualifying leads, conducting demos, and answering customer questions. You will also be responsible for building relationships with potential clients and nurturing them through the sales process.Responsibilities:Qualify leads by assessing their needs and understanding their pain points.\nConduct demos of our P2P trading platform to potential clients.\nAnswer customer questions about our platform and services.\nBuild relationships with potential clients and nurture them through the sales process.\nClose sales and meet or exceed sales goals.Benefits:Competitive salary and benefits package.\nOpportunity to work with a leading P2P trading platform.\nChance to make a real impact on the company's growth.\nCollaborative and supportive work environment.\nIf you are a highly motivated and results-oriented individual with a passion for sales, we encourage you to apply for the Tele Sales of P2P Trading Platform position.Skills",
    "Skills": [
        "Qualifications:",
        "Being fluent in Hindi and English is mandatory\nBachelor's degree in business or a related field.\n2+ years of experience in sales or a related field.\nStrong understanding of P2P trading platforms.\nExcellent communication and interpersonal skills.\nAbility to work independently and as part of a team.\nStrong customer service skills.\nAbility to work under pressure and meet deadlines.\nMandatory fluency in Hindi and English.\nSmooth communicator with a command of engaging the end customer.\nExcellent in pitching ideas and convincing people through fluent interactions."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "5"
    }
}