{
    "Job ID": "4738428",
    "Description": "Sales Engineer - Audio Visual & Digital SignageCompany: 2.0 ConceptsLocation: KSA2.0 Concepts is an industry leader in audio-visual solutions and digital signage technology. We bridge the gap between innovative tech and effective communication, helping businesses engage their audiences in meaningful ways. Our team is dedicated to pushing the boundaries, and we're looking for a Sales Engineer to help us deliver the best in AV and digital signage solutions.Position Overview:The Sales Engineer (SE) will play a critical role in the sales process by partnering with our sales and account management teams to understand customer needs, design technical solutions, and support the implementation of our products. The SE will possess deep knowledge of AV and digital signage technologies and use this expertise to facilitate the sales process.Key Responsibilities:Collaborate with the sales team to understand customer requirements and provide sales support.\nPresent technical descriptions of solutions and benefits to customers, demonstrating how a product will meet client needs.\nPrepare and deliver technical presentations tailored to the customer’s requirements.\nWork with customers to design custom solutions based on our product suite.\nConduct product demonstrations both in-person and virtually.\nRespond to technical questions and concerns from clients promptly and professionally.\nProvide feedback to the product development teams to help improve product offerings.\nAssist in training sessions for clients and internal teams.\nStay updated on industry trends and emerging technologies to ensure we are always ahead of the curve.\n. Liaise between the sales team, product management, and technical support teams.Skills",
    "Skills": [
        "Bachelor’s degree in Engineering, IT, Business, or related field.\n5 years experience in a technical sales or pre-sales role.\nStrong knowledge of AV and digital signage systems.\nExcellent presentation and communication skills.\nStrong problem-solving capabilities and analytical mindset.\nFamiliarity with CAD software or other design tools is a plus.\nWillingness to travel for client meetings and industry events.\nA proactive and collaborative approach."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Fit-Out & Joinery; IT Services; Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}