{
    "Job ID": "4738397",
    "Description": "We are looking for a Motion Graphic Designer / Multimedia Designer who will work with the marketing team, to create high-quality content that reflects our branding priorities.ResponsibilitiesCreate high-quality videos, 3D animations, and motion graphics for marketing and advertising projects.\nHave to manage material such as camera footage, sound effects, graphics, and special effects to produce a final film of video product requirements.\nUtilize graphic design tools and software to design PowerPoint presentations.\nDesign and create graphics, illustrations, and other visual elements for use in print and digital media, such as Brochures, Social media posts, Presentations, and Animations.\nCollaborate with the marketing team to develop design concepts that effectively communicate our brand and marketing messagesQualifications:Bachelor’s degree in graphic design, or related field.\nWork Experience Required 2-3Years.\nExcellent Expertise in Adobe After Effects, Premier Pro, Photoshop, and Illustrator.\nA strong portfolio of previous work demonstrating design and video editing skills as well.Location: Dubai, United Arab EmiratesJob type: Full-timeSkills",
    "Skills": [
        "Bachelor’s degree in graphic design, or related field.\nWork Experience Required 2-3Years.\nExcellent Expertise in Adobe After Effects, Premier Pro, Photoshop, and Illustrator.\nA strong portfolio of previous work demonstrating design and video editing skills as well."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Graphic Design; Marketing; Media Production",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}