{
    "Job ID": "4738278",
    "Description": "Job Summary:Recording financial movements and manual accounting entries on the company's accounting system after fulfilling the approvals, signatures and supporting documents, and maintaining regular accounting records that are easy to review.Responsibilities and Tasks:Register all accounting exchange requests paid in cash, check or bank transfer that were approved in accordance with the approved accounting directives for each item and link them with their cost centers on the accounting system and ensure that the registration matches the supporting documents.\nRegister all requests for electronic payment of bills, government services and other services that have been approved on the bank’s website after withdrawing them from the bank in accordance with the accounting directives approved for each item and linking them with their cost centers on the accounting system and ensuring that the registration matches the supporting documents.\nPreparing and reviewing requests for permanent and temporary cash covenant replacement for employees in accordance with the approved accounting directives and supporting approvals and applying the company's financial policy to replace the cash covenant within the framework of the powers granted to each item and linking them with their cost centers on the accounting system.\nRecording the approved accounting entries and bank settlements based on the accounting system, and ensuring that the registration matches the supporting documents.\nResponsibility for organizing, arranging and keeping financial documents and accounting entries in a manner that facilitates reference for review and audit purposes.\nCovering the work of branch accountants and warehouse accountants in vacation and emergency cases.\nAny other tasks assigned as neededSkills",
    "Skills": [
        "Education and Competency:",
        "Bachelor's degree in accounting.\nHigh skills in dealing with others.\nAccuracy, honesty, innovation.\nThe ability to work under pressure and to work as a team.\nAbility to complete tasks and responsibilities on time.\nPrevious experience in the same field 3 years or more.\nProficiency in dealing with various accounting programs.\nHighly proficient in using MS Office",
        "Additional Requirements:",
        "Must Have SOCPA - Saudi Organization for Chartered and Professional Accountants Certificate.\nSaudi Nationality\nBased on Eastern region."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Eastern Province, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}