{
    "Job ID": "4738105",
    "Description": "We're seeking a motivated Digital Marketer and operations assistant to join our team and play an important role in expanding our online presence and driving growth in the competitive market and also to be involved in the operations.  Position Overview: As a Digital Marketer, you'll create and execute effective digital marketing strategies that increase brand visibility, engage prospective clients, and drive lead generation through various online channels. You'll collaborate closely with our sales and marketing teams to align our online efforts with our business objectives and ensure a seamless customer experience. The ideal candidate has a deep understanding of digital marketing and a proven record of delivering measurable results.  Responsibilities  Develop and execute digital marketing campaigns to promote our offers, showcase listings, and attract potential owners and guests.  \nCreate tailored content for social media, website, emails, blogs, etc., engaging and educating our target audience.  \nUse SEO techniques to optimize content and drive organic traffic, enhancing search engine rankings.  \nManage paid advertising campaigns on platforms like Google Ads, Facebook Ads, and more to generate leads.  \nCollaborate with the creative team to produce compelling visuals and assets.  \nStay informed about market trends and emerging digital marketing strategies.  \nAssist in developing and executing email marketing campaigns. \nAssist in operations management: Guest communication, check-in/check-out process execution, coordination with the internal team (designer, cleaner, maintenance) to make sure that the property is ready on time for the guest.    Skills",
    "Skills": [
        " Requirements: ",
        "Digital Marketing Capabilites \nMust be creative and well organized. \nProficiency in digital marketing tools, social media management, SEO, email marketing, and paid advertising. \nExcellent English written and verbal communication skills. \nAnalytical mindset with the ability to draw actionable insights from data. \nProven ability to manage multiple projects and meet deadlines. \nKnowledge of marketing automation tools and CRM systems is a plus.  \nFast learner and curious.  "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}