{
    "Job ID": "4738241",
    "Description": "Lead, plan, and execute audit engagements in accordance with professional auditing standards and firm guidelines.\nSupervise and mentor a team of audit professionals, providing guidance and support to enhance their skills and performance.\nDevelop audit strategies, risk assessments, and audit plans tailored to client needs.\nReview and analyze financial statements, internal controls, and audit findings to identify areas for improvement and recommend solutions.\nMaintain effective communication with clients, addressing their concerns, and presenting audit findings in a clear and professional manner.\nEnsure timely completion of audit projects, adhering to deadlines and managing resources efficiently.\nStay updated with industry trends, regulatory changes, and best practices in auditing.Skills",
    "Skills": [
        "Bachelor's degree in accounting.\nA minimum of 7 years of relevant experience in auditing, with a significant portion of that experience obtained in Kuwaiti auditing firms.\nStrong understanding of Kuwaiti regulatory requirements and auditing standards.\nProven track record of managing and leading audit engagements.\nExcellent knowledge of financial reporting and analysis.\nProficient in using auditing software and Microsoft Office applications.\nExceptional interpersonal, leadership, and communication skills.\nDetail-oriented, analytical mindset, and problem-solving abilities.\nAbility to manage multiple priorities and meet deadlines in a fast-paced environment.\nFluency in English and Arabic.\nPREVIOUS EXPERIENCE IN A KUWAITI AUDITING FIRM."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Financial Auditing",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}