{
    "Job ID": "4738928",
    "Description": "Job Responsibilities:Understand the Road Operation and Management Department\nCarry out Road repair works design on the networks\nMonitor stakeholders work schedules, set priorities and ensure the appropriate assignment of equipment, materials, and personnel.\nAdminister, prioritize and oversee major repairs on the road network.\nWork proactively with the RMD Engineer and design consultants to resolve any design related issues.\nPrioritize projects and assign work to outsourced maintenance crews to\n repair road networks, taking into consideration criticality of work to be executed.\nEnsure that incidents / emergencies reported are attended to and resolved by the maintenance contractors or in-house teams\nPerform emergency road maintenance and respond to public complaints and requests/ calls received from Customer Contact Centre / Road Management Centre\nPrepare all specifications for maintenance vehicles and equipment and assists in the purchase of motor vehicles, off road equipment and others, as required.\nAssist the project team in ensuring that road upgrading and maintenance works are carried out to the specified technical standards and that corrective action is taken as needed.\nLiaise with stakeholders throughout client where appropriate, using various channels of communication, to ensure customer needs are met\nAct as an ambassador for client and deal with customers in a professional and courteous manner at all times.\nAdhere to Health and Safety policies and procedures in work and other corporate procedures and comply to any new work instructions\nAssist other colleagues where required and according to business needsSkills",
    "Skills": [
        "Qualification",
        "Diploma in relevant subject or above\nCurrent/valid Qatar Driving License would be an advantage",
        "Experience",
        "Minimum 5 years’ cumulative experience of road networks including 3 years managing contractors and leading a team\nExperience of working in a multidisciplinary Organization preferably in the Middle East\nKnowledge of Signage, Road works, Health and Safety, Environment policies, procedures and regulations.\nAbility to communicate verbally and in writing in Arabic is preferred"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "IT Services; Civil Engineering; Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}