{
    "Job ID": "4738113",
    "Description": "Qualifications5+ years of experience in cybersecurity, in areas such as security operations, intrusion detection, incident analysis, incident handling, log analysis, threat intelligence/hunting or digital forensics.\nBachelor’s/Master’s Degree in Cybersecurity, Computer Science, Information Systems, Electrical Engineering, or a closely related degree.\nAn active interest and passion in cybersecurity, incident detection, network, and systems security.\nA sound knowledge of IT security best practices, common attack types and detection / prevention methods.\nDemonstrable experience of analyzing and interpreting system, security, and application logs.\nKnowledge of the type of events that both Firewalls, IDS/IPS and other security related devices produce.\nExperience in using Splunk as an analyst for Threat and Incident Detection is required.\nExperience with ArcSight, LogRhythm, QRadar, is preferable but not mandatory.\nStrong understanding of Cyber Kill Chain and MITRE ATT&CK frameworks and techniques.\nSolid understanding of TCP/IP and network concepts and principles.\nPossible attack activities, such as scans, man in the middle, sniffing, DoS, DDoS.\nProfessional certificates are highly preferred (e.g., CCIE, OSCP, CISSP, GSEC, GCIA, GCIH, GMON, GREM, GDAT, GCFE…etc.).\nAn experienced Analyst who aspires to be a leader, and is committed to learning the principles of leadership and the role of a leader.\nOutstanding organizational skills.\nExclusive focus and vast experience in IT.\nVery good communication skills.\nStrong analytical and problem-solving skills.\nA motivated, self-managed, individual who can demonstrate exceptional analytical skills and work professionally with peers and customers even under pressure.\nStrong written and verbal skills.\nStrong interpersonal skills with the ability to collaborate well with others.\nAbility to speak and write in English is required; Ability to speak and write in both English and Arabic is preferred.\nWell-versed in developing content for SIEM (creating, fine tuning) use cases and rules.\nExperience with automation tools (SOAR) is preferred.\nExperience in Malware Analysis / Reverse Engineering is preferred.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}