{
    "Job ID": "4738422",
    "Description": "IT Network Supervisor - Riyadh AirportThe ideal candidate will be handling mechanical tasks related to our construction project located in Riyadh . You will work in a team-oriented environment that accelerates operational efficiency.Network Design and Implementation:Plan and design network architectures that align with business requirements and ensure optimal performance, scalability, and security.Oversee the implementation of network hardware and software, ensuring proper configuration and integration.Network Monitoring and Maintenance:Monitor network performance, availability, and security to proactively identify and address issues.Perform regular maintenance tasks such as updating firmware, applying patches, and conducting system backups.Troubleshooting and Issue Resolution:Diagnose and resolve network-related problems, identifying root causes and implementing solutions promptly.Coordinate with team members to address complex network issues that require collaboration.Security and Compliance:Implement and maintain network security measures, including firewalls, intrusion detection/prevention systems, and access controls.Ensure compliance with security policies, regulatory requirements, and industry best practices.  Skills",
    "Skills": [
        "·        Bachelor's degree in Engineering or any professional courses in Networking.",
        "·        Minimum 5 years of Experience as IT Administrator.",
        "·        Hands on Experience of installing hardware, software and strong trouble shooting skills.",
        "·        Experience in IT commercial Building (Maintenance /Trouble shooting side)",
        "·        Excellent Communication skills.",
        "·        Only Saudi candidates."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}