{
    "Job ID": "4738291",
    "Description": "PurposeSAP Ariba functional expert will implement, configure, and support the SAP Ariba suite of solutions. Your expertise will be critical in optimizing procurement and sourcing processes and supporting the end-to-end procurement lifecycle.KEY ROLES AND RESPONSIBILITIESFunctional: • SAP Ariba Implementation: Actively participate in the implementation of SAP Ariba solutions, including SAP Ariba Buying, SAP Ariba Sourcing, SAP Ariba Contracts, SAP Ariba Supplier Performance, and other relevant modules.• Solution Design: Collaborate with procurement stakeholders and business users to gather requirements and design effective procurement solutions using SAP Ariba functionalities. Customize and configure SAP Ariba modules to meet specific business needs.• Integration: Ensure seamless integration of SAP Ariba with other SAP modules (such as SAP ERP) and nonSAP systems. Coordinate with technical teams to implement data integrations and ensure smooth data flows.• Procure-to-Pay (P2P) Processes: Solution design and implantation of the end-to-end procurement processes, including requisitioning, sourcing, purchase orders, contract management, and invoice processing using SAP Ariba solutions.• Supplier Onboarding: Define and configure supplier onboarding processes to efficiently manage supplier information and ensure compliance with supplier requirements.• Catalog Management: Oversee the setup and maintenance of catalogs in SAP Ariba to enable easy and efficient shopping for goods and services.• Contract Management: Configure and manage contract templates, workflows, and approvals in SAP Ariba  Contracts to ensure effective contract lifecycle management.• Supplier Performance Management: Implement supplier performance measurement and evaluation processes using SAP Ariba Supplier Performance to monitor supplier performance and drive continuous improvement.• Testing and Quality Assurance: Plan, coordinate, and execute comprehensive testing of SAP Ariba solutions. Conduct unit testing, integration testing, and user acceptance testing (UAT) to validate the system's functionality.• User Training and Support: Provide training to end-users on SAP Ariba functionalities and processes. Offer post-implementation support, troubleshooting assistance, and timely resolution of issues.• Documentation: Create and maintain comprehensive documentation, including functional specifications, process flows, configuration documents, and user guides.• Continuous Improvement: Stay updated with the latest SAP Ariba advancements, procurement industry trends, and best practices. Proactively identify opportunities for process improvement and system optimisation.Skills",
    "Skills": [
        "REQUIRED EXPERIENCE AND QUALIFICATIONS",
        "Education: ",
        "• Bachelor's degree in Business, Supply Chain Management, or a related field. ",
        "• Relevant certifications in SAP Ariba are a plus.",
        "Experience: ",
        "• Proven experience (6+ years) in implementing and supporting SAP Ariba solutions, including Ariba Buying, ",
        "Ariba Sourcing, Ariba Contracts, and Ariba Supplier Performance.",
        "• Strong understanding of procurement and sourcing processes.",
        "• In-depth knowledge of SAP Ariba functionalities, configuration, and best practices.",
        "• Experience in integrating SAP Ariba with other SAP and non-SAP systems.",
        "Knowledge, Skills and Abilities:",
        "• Excellent analytical, problem-solving, and communication skills.",
        "• Ability to work effectively in cross-functional teams and manage multiple priorities in a fast-paced ",
        "environment.",
        "• Strong project management skills and the ability to lead Ariba-related initiatives.",
        "• A proactive and customer-focused approach to delivering solutions.",
        "People of all nationalities are welcome, with a special emphasis on Emiratis."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}