{
    "Job ID": "4738289",
    "Description": "PurposeSAP S/4HANA Finance functional expert will be crucial in designing, implementing, and supporting our SAP S/4HANA Finance solutions. You will collaborate closely with cross-functional teams, business stakeholders, and IT colleagues to deliver efficient and effective solutions leveraging the capabilities of SAP S/4HANAFunctional: • AP S/4HANA Implementation: Actively participate in the end-to-end implementation of SAP S/4HANA Finance modules, including General Ledger (GL), Accounts Payable (AP), Accounts Receivable (AR), Asset Accounting, Controlling (CO), Financial Supply Chain Management (FSCM), and related components.• Solution Design: Work closely with business stakeholders to gather requirements and design best-fit solutions using SAP S/4HANA Finance functionality. Translate business needs into functional specifications and ensure alignment with overall SAP and business process standards.• Configuration: Configure SAP S/4HANA Finance modules to meet business requirements. Analyse gaps between standard functionalities and business needs and propose and implement necessary customisations and enhancements.• Integration: Collaborate with other SAP functional experts and technical teams to ensure seamless integration between SAP S/4HANA Finance and other SAP and non-SAP systems.• Testing and Quality Assurance: Plan, coordinate, and execute comprehensive testing of SAP S/4HANA Finance solutions, including unit testing, integration testing, and user acceptance testing (UAT). Ensure the quality and reliability of the implemented solutions.• User Training and Support: Provide end-user training on SAP S/4HANA Finance functionalities and processes. Offer post-implementation support, address issues, and provide timely resolutions to problems encountered by end-users.• Documentation: Create and maintain comprehensive documentation, including functional specifications, process flows, configuration documents, and user guides.• Continuous Improvement: Stay up-to-date with the latest SAP S/4HANA Finance advancements, industry trends, and best practices. Proactively identify opportunities for process improvement and system optimization.• Compliance and Security: Ensure adherence to financial and data security policies and regulatory requirements. Maintain the integrity and confidentiality of financial data in the SAP system.• Project Management: Collaborate with project managers and team members to deliver projects on time and within budget. Provide status updates and progress reports to project stakeholders.Skills",
    "Skills": [
        "REQUIRED EXPERIENCE AND QUALIFICATIONS",
        "Education: ",
        "• Bachelor's degree in Finance, Accounting, Information Technology, or a related field. ",
        "• MBA or professional finance certification is a plus.",
        "Experience: ",
        "• Proven experience (6+ years) in implementing and supporting SAP S/4HANA Finance modules, with a focus ",
        "on General Ledger (GL), Accounts Payable (AP), Accounts Receivable (AR), Asset Accounting, Controlling ",
        "(CO), and Financial Supply Chain Management (FSCM).",
        "• Strong understanding of finance and accounting business processes.",
        "• In-depth knowledge of SAP S/4HANA Finance functionalities, configuration, and best practices.",
        "• Experience in integrating SAP S/4HANA Finance with other SAP and non-SAP systems.",
        "Knowledge, Skills and Abilities:",
        "• Excellent analytical, problem-solving, and communication skills.",
        "• Ability to work effectively in cross-functional teams and manage multiple priorities in a fast-paced ",
        "environment.",
        "• Strong project management skills and the ability to lead and drive change initiatives.",
        "• A proactive and customer-focused approach to delivering solutions.",
        "People of all nationalities are welcome, with a special emphasis on Emiratis."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}