{
    "Job ID": "4738054",
    "Description": "Job SummaryWe are currently seeking passionate and dynamic Floor Sales Associates who pride themselves on their ability to deliver extraordinary levels of customer service to help us keep growing.You will be responsible for all sales activities, from greeting customers, guiding them through our products, answering questions, offering assistance, lending opinions, facilitating purchases, and providing customer service.Main TasksGreet & welcome customers in a friendly and polite manner when they walk through the door.\nAssist customers with requests in-store and on the phone.\nBuild rapport and productive trust relationships with customers through conversation and honest recommendations.\nRing up customers at the cash register, take payments, issue receipts, and arrange for delivery or pick-up of the customer’s order if needed.\nStamp, mark, and tag prices on merchandise.\nProcess POS (point of sale) purchases and execute price changes and inventory control.\nInvite customers to search the company’s website, Instagram and Facebook to educate them about our products.\nAssist in maintaining the back-stock room and setting up merchandise displays on the sales floor.\nCollaborate with fellow team members to keep the sales floor area clean and organized at all times.\nEnthusiastically meet and exceed guest expectations.\nProtect all company assets and maintain the security of all cash.\nReceive merchandise and maintain in-stock and presentable condition assigned areas.\nRemain knowledgeable on products offered and discuss available options.\nEnsure accomplishment of your sales target through consistently delivering, and exceeding targets and KPIs.\nAdheres to and upholds company policies and procedures.\nDisplay a pleasant manner and positive attitude at all times to promote a good company image to guests and colleagues in order to avoid internal or external complaints.\nSuggest ways to improve sales (e.g., planning marketing activities, changing the store’s design)\nParticipate in any training and development programs as recommended by the senior management. The Company might require the jobholder to carry out additional tasks that he/she will be trained and coached on...Skills",
    "Skills": [
        "Qualifications",
        "Education:",
        "-         High school diploma or equivalent.",
        "Experience:",
        "-      1-2 years of work experience as a Retail Sales Associate, Sales Representative, or similar role",
        "-      Good understanding of sales principles and customer service practices",
        " ",
        "Required Language:",
        "Proficiency in Arabic and English languages is required; ",
        "Skills and Job requirement:",
        "-      Outgoing personality, professional appearance, and customer-oriented attitude.",
        "-      Excellent sales service to ensure high levels of customer satisfaction through “Go the extra mile” to drive sales.",
        "-      Persistent and can quickly understand and relate to clients’ needs.",
        "-      Strong verbal communication skills to allow for proper interaction with customers.",
        "-      High level of integrity and honesty; extremely discreet and ethical.",
        "-      Contributor to the effective functioning of the team.",
        "-      Excellent time management & organization skills.",
        "-      Motivated by the challenge.",
        "-      Flexible and highly adaptable.",
        "-      Ability to stand and walk for extended periods of time.",
        "-      Available to work on weekends and holidays or rotating schedules"
    ],
    "Preferred": {
        "Residence Location": "Beirut, Lebanon"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}