{
    "Job ID": "4738235",
    "Description": "Job Description:We are seeking a skilled and motivated Fit-Out Project Engineer to join our team. As a Fit-Out Project Engineer, you will play a pivotal role in overseeing and executing various interior fit-out projects. You will be responsible for ensuring projects are completed on time, within budget, and to the highest quality standards.Requirements:Bachelor's degree in Civil Engineering, Construction Management, or a related field.Proven experience in managing fit-out projects from start to finish.Strong knowledge of construction processes, building codes, and regulations.Proficiency in project management tools and software.Excellent organizational and multitasking skills.Effective communication and interpersonal abilities.Problem-solving mindset with the ability to adapt to changing project conditions.Attention to detail and a commitment to delivering high-quality work.Ability to work both independently and as part of a team.Prior experience collaborating with architects, designers, contractors, and subcontractors.Familiarity with budgeting and cost control.Certification in project management (PMP, CAPM) is a plus.Knowledge of sustainable and green building practices is desirableSkills",
    "Skills": [
        "Responsibilities:",
        "Collaborate with project managers, architects, and contractors to develop detailed project plans and timelines.",
        "Manage all aspects of fit-out projects, from inception to completion, ensuring adherence to design specifications and regulatory requirements.",
        "Coordinate procurement of materials, equipment, and resources necessary for project execution.",
        "Conduct site visits to monitor construction progress, address any issues, and ensure work is being carried out according to plans.",
        "Provide technical expertise and solutions to overcome project challenges.",
        "Prepare and review project documentation, including drawings, specifications, and reports.",
        "Ensure compliance with safety standards and regulations throughout the project lifecycle.",
        "Monitor project budgets, track expenses, and report any budget deviations to management.",
        "Liaise with clients, vendors, and subcontractors to maintain effective communication and build strong relationships.",
        "Lead project meetings to update stakeholders on progress, address concerns, and facilitate decision-making."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}