{
    "Job ID": "4738178",
    "Description": "present and discuss the products and services of the company, soliciting only those desired products provided by the company and its suppliers, to current and prospective customers in a way that conveys an image of quality, integrity and superior understanding and delivery of customer needs.\norders from existing and prospective customers through a relationship-based approach.\nproducts and services to existing/potential customers and assists them in selecting those best suited to their needs.\nbusiness relationships with current customers and prospective customers to generate new business.\nfor achieving sales targets and create reports showing sales percentages against forecasted targets, and status reports.\nprospects, customers, and referral sources and develop/maintain relationships to ensure attainment of company business goals. Support efforts to consistently grow the base of referral sources.\nclear and effective written proposals/quotations for current and prospective customers.\nthe resolution of customer problems and complaints.\nand manage a customer value plan for existing customers highlighting profile, share and value opportunities.\nand organize personal sales strategy by maximizing the Return on Time Investment\nmanagement with oral and written reports on customer needs, problems, interests, competitive activities, and potential for new products and services.\nin trade shows and conventions for the benefit of the company.\noptimal usage of sales materials and current product knowledge.\nnew product offers, special developments, and updated specifications on merchandise to clientele.\na professional level of customer service with existing and prospective clientele.\ncollection of cash payment before goods are granted.\nand implement special sales activities to reduce stock.\nto research of market assessments, competitor analyses, pricing strategies on the competitive environment and the company’s strengths, weaknesses, opportunities, and targets, and provide feedback to the Sales Manager.\nduties as assigned by the Sales Manager.Skills",
    "Skills": [
        "  Strong negotiation and selling skills.\n  Strong organizational and time management discipline.\n  Solid judgment and ability to resolve conflicts effectively.\n  Ability to multi-task and operate effectively in stressful situations.\nexcellent attendance and positive attitude to the job\ncommunication skills and have an ability to maintain a good working relationship with others."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Age": "Min: 20 Max: 25"
    },
    "Data": {
        "Job Location": "Tripoli, Libya",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "Unspecified"
    }
}