{
    "Job ID": "4738389",
    "Description": "We are seeking a highly organised and detail-oriented Real estate portfolio manager to join our dynamic team. The ideal applicant will have experience managing and administering real estate properties, with an emphasis on ensuring effective coordination and seamless operations within the real estate industry. We would love to hear from you if you are observant, possess first-rate communication abilities, and have a track record of successfully managing real estate administrative responsibilities.Responsibilities:Manage and coordinate various real estate activities;\nLook for the perfect assets that meet the project's needs on a range of advertising platforms;\nScheduling viewings with the agents;\nPrepare MOUs, sales and rental contracts, and undertaking letters;\nWork productively both independently and in a team environment to accomplish department goals;\nBe able to operate under pressure and meet deadlines in order to thrive in a quick-paced atmosphere;\nDemonstrate great organisational skills and problem-solving abilities;\nExhibit the ability to multitask while keeping a high level of job quality;\nCapable of speaking to clients and tenants, determining their availability, and scheduling viewings;\nIndependently arrange for all information about a property, such as pictures, videos, floor plans, title deeds, NOCs, and IDs;Benefits:Competitive salary package (based on experience and qualifications) + bonus (based on KPIs).\nOpportunities for professional growth and development within a dynamic real estate environment.\nCollaborative and supportive team atmosphere.Job Type: Full-timeSalary: AED 6,000.00 - AED 15,000.00 per monthAbility to Commute: Dubai (Required)Ability to Relocate: Dubai: Relocate before starting work (Required)Job Type: Full-timeSalary: AED6,000.00 - AED15,000.00 per monthSkills",
    "Skills": [
        "Requirements:",
        "A minimum of 1-3 years of proven experience in real estate/property portfolio management;\nHigher education from a reputable university;\nFamiliarity with Tenancy and Leasing Forms/Agreements/Contracts, MOUs, Rent and Sales agreements, undertaking letters;\nExcellent communication skills, both written and verbal;\nStrong computer literacy;",
        "Experience: Real estate agent/Property portfolio manager: 1 year (Required)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}