{
    "Job ID": "4738285",
    "Description": "Job DescriptionA TRS Technician is responsible for safely and professionally operating casing running equipment at various rig/field sites, and providing maintenance and repair to company’s equipment to keep it in working condition and in compliance with the manufacturer’s and company’s quality standards.Essential Functions:Handle and operate casing running equipment, including casing running tools, power tongs, elevators, power slips, control panels, and hydraulic power units.\nWork with hand tools and operate hydraulically activated equipment\nRig up, run, and rig down various components on a drilling rig.\nCommunicate clearly and professionally with all rig, customer, and Parker Wellbore personnel.\nAct as a trainer for Service Technicians I and II\nPrepare delivery tickets, job reports, time sheets, and other administrative forms\nIndependently test, operate, maintain, and troubleshoot company equipment and tools\nAssist maintenance supervisor and TRS Lead with special maintenance assignments\nPrepare and dispatch equipment according to checklist procedures\nMaintain a safe working environment by wearing personal protective equipment (PPE), checking the tools and equipment, keeping the work area neat, organized and free of hazards, and following Parker Wellbore Life Saving Rules, as well as location-specific and customer QHSSE Policies and Procedures.\nAccountable for safe operation of all Parker Wellbore equipment.\nEnsuring the highest standard of workmanship produced is in accordance with the company expectations and as per customer, regulatory standards and specification.\nReporting hazards on location, with equipment and other work place, or short comings in the existing controls, to a superior without delay.\nMake recommendations for the safe execution of the job and report any unsafe acts, near misses, or incidents.\nAttend all customer and Parker Wellbore QHSSE meetings, safety training, equipment training, and medical checks as required\nInitiate improvements to existing QHSSE procedures or initiate new QHSSE procedures based on operational needs, incidents and/or near misses  \nObtain required authorization and/or training before undertaking any task\nSupport continual improvement of the integrated management system by expressing better and safer ways to perform tasks and improve policies and procedures.\nWhen on standby, stay in contact with the Operations Supervisor and coordinate further actions\nOther tasks requested by the TRS Lead or Field Service Supervisor.Skills",
    "Skills": [
        "Necessary qualifications, skills and abilities",
        "To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.",
        "Have an extensive knowledge of the components and functionality of Tubular Running Service (TRS) Manual Handling Equipment, Power Equipment, Bucking Units and Thread Monitoring Systems as it applies to the assigned business segment.\nHave extensive knowledge of the company products and services, and propose continuous improvement initiatives\nHigh school diploma or equivalent is preferred\nQualifications in Mechanical or Electronic Applications or extensive past experience with rig operations and equipment\nMechanical aptitude and extensive knowledge of hydraulic and mechanical/electronic systems.\n5+ years of relevant experience with mechanical, electronic, hydraulic equipment or similar experience in rig operations\nExtensive knowledge of tubular handling equipment, including: casing running tools, power tongs, elevators, power slips, control panels, and hydraulic power units.\nMust possess the ability to work with hand tools and operate hydraulically activated equipment.\nMust possess the ability to rig up, run, and rig down various components on a drilling rig.\nFast learner, results oriented, strong interpersonal skills, works cooperatively with others and independently as directed by supervisor. \nGood customer service skills.\nMust have the ability to adapt positively to changes in policies, procedures and priorities, or work environments.\nMust be a good team player and have a willingness to share knowledge with and coach junior colleagues",
        "Position competencies",
        "Initiating & Driving Change\nResult Focused\nTeam Work\nCustomer Focus",
        "Physical demands and work environment",
        "Ability to perform under stress, under pressure, and/or in emergency situations.\nCarry up to 10 lbs.\nAbility to work in noisy environments"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}