{
    "Job ID": "4738882",
    "Description": "Our client, a distributor of Consumer electronics, is looking for an experienced Chief Executive Officer to supervise and control all strategic and business aspects of the company. This role will be based in Dubai, UAE. Responsibilities:• Leading the development of the company’s short and long-term strategy, ensuring their alignment with short-term and long-term objectives• Develop high-quality business strategies and plans for the organization.• The role manages Consumer and Non- Consumer Electronics division for sales and aftersales operations.• The CEO will be responsible for the operations of the business, relationship & stakeholder management with the principle.• Experienced managing the P&L of the business, balance sheet and cash flow management, and general budgeting.• Work on future strategies to grow the business locally and regionally and future proof the business from the changes resulting from agency agreements.• Works with various departments and management within the company to identify business needs and to resolve issues/processes to ensure needs of the business are met and to ensure timely, resolutions.• Developing fresh ideas for the running of the company to advance the business and increase profits.• Monitoring how various departments of the company operate and how they work together to achieve overall goals.• Build trust relations with key partners and stakeholders and act as a point of contact for important shareholders.• Creating and implementing strategies, together with the senior management team, to determine the direction the company will take.• Enforcing adherence to legal guidelines and in-house policies to maintain the company’s legality and business ethics.• Maintain excellent knowledge of the markets and aware of current market trends.Skills",
    "Skills": [
        "Requirements and skills:",
        "• MSc/MA in business administration or relevant field",
        "• Min 8-10 years’ experience managing a similar business. ",
        "• UAE experience is a must.",
        "• Excellent Leadership skills",
        "• Strategic thinker",
        "• Business development",
        "• Analytical and people management skills",
        "• Excellent communication and public speaking skills",
        "As a CEO, you will be responsible for the supervision of the overall business strategy and success. Experience in both consumer and non-consumer electronics will be an advantage."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}