{
    "Job ID": "4738978",
    "Description": "Product Specialist ( Medical Devices ) - Saudi Nationals - RiyadhDescription:Promoting and selling company’s products to new and existing customers by visiting them regularly and constantly. Product Specialist tasks also involve performing certain after-sales support functions such as conducting In-Service Training, follow up on the collection and maintain a good relationship with customers.Job Responsibilities:Perform consultative method of sales with prospecting clients in either identifying or even creating the need for Imdad products and continuously update all customers on company product modifications, changes, and enhancements\nSchedule appointments, meet existing and new customers in order to promote Imdad’s product, and to determine other opportunities\nGenerate and develop new client’s business accounts\nPerform professional demonstrations/presentations of company products or services while on customer’s site. Apply successful negotiation and sales closure techniques\nProvide adequate information about a new prospect and client, in terms of ownership, working physicians, relevant client’s equipment, and status, and update customer’s database with proper contact details, email, and contact numbers\nSubmit reports for sales and marketing on a weekly basis in a timely manner\nAssist in following up the accounts receivables for sales accounts responsible for\nMaintain excellent customer relationship with key decision makers, doctors, key customer’s personnel and always work toward enhancing such relations\nEffective use of company’s sales aids and marketing data to secure deals\nEffectively attending conferences and workshops\nPerform professional in-service training for customer’s end users on systems application\nPossess market awareness, competitor’s activities/events and competitor’s pricing changes.Skills",
    "Skills": [
        "Minimum Qualifications:",
        "Bachelor's degree in Biomedical Engineering, Pharmaceutical Science or any scientific related degree.\nFresh graduate or up to 4 years’ experience in sales.\nSaudi national\nKSA Driving License + car\nEffective time management, organization and multi-tasking skills\nExcellent interpersonal skills\nStrong verbal & written communication skills\nTeam player with ability to work at pace and juggle multiple tasks\nProficient in Microsoft office Applications"
    ],
    "Preferred": {
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22 Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}