{
    "Job ID": "4738134",
    "Description": "His job duties:1. Developing quality items, policies and procedures, explaining them to employees and employees of the company, training them on them, and motivating them to act accordingly.2. Carrying out internal control and auditing of all departments and sections to ensure their implementation of these procedures.3. Work to improve and develop the quality procedures and models currently in use in the company in a manner that does not contradict the general objective, laws, and instructions.4. Issuing regulations and instructions related to the application of these procedures and following up on their implementation.5. Permanent monitoring of health and occupational safety conditions in the factory and ensuring their validity.6. Examining the raw materials supplied to the factory and making sure of the quality of the materials used in manufacturing and whether they conform to the specifications or not.7. Permanent supervision of the production processes in the factory, the cleanliness of the factory and its surroundings, and the cleanliness of the workers, and verifying their compliance with quality standards.8. Direct supervision of laboratory technicians, laboratories and quality supervisors.9. Participate in evaluating and qualifying suppliers.10. Participate in evaluating the performance of employees and workers in all departments through their application of quality standards.11. Supervising storage conditions in warehouses for both materialsCheck if line clearance done properly\nCheck daily job schedule\nCheck all information on the job jacket and inside as to the following document.\nCheck kind of stock\nCheck size of stock\nCheck key line\nCheck approved sample\nCheck required inks\nCheck required coating\nCheck running sheets against signed off sheets for colour matching\nCheck images are in correct position on sheet (Use job key line)\nCheck GSM\nPut and check labels on palletsSkills",
    "Skills": [
        "1. Printing Expertise:",
        "In-depth understanding of printing processes, techniques, and technologies, including offset, digital, screen, and more.",
        "2. Quality Control:",
        "Proficiency in quality control methodologies, including visual inspection, color accuracy, and print consistency.",
        "3. Color Management:",
        "Skill in managing color accuracy and consistency across different printing processes and materials.",
        "4. Print Materials Knowledge:",
        "Familiarity with various print substrates, inks, coatings, and their effects on print quality.",
        "5. Technical Skills:",
        "Proficiency in using printing software, color measurement tools, and quality control equipment."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 1 Max: 10"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Printing; Paper & Paper Product Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}