{
    "Job ID": "4738695",
    "Description": "We are a leading home massage provider in Dubai, seeking a dynamic and experienced Sales Receptionist to join our team. If you have a passion for sales, exceptional organizational skills, and previous experience in the massage spa industry, we'd love to hear from you!Responsibilities:Utilize your sales expertise to actively promote our services and close deals, both with individual clients and B2B partnerships.\nHandle reception duties, including managing phone calls, and emails.\nHave exceptional writing and speaking English skills\nDemonstrate an in-depth knowledge of Dubai roads to efficiently schedule appointments based on current bookings and locations.\nManage our team of skilled masseuses, ensuring they arrive punctually at appointments and maintain high service standards.\nKeep meticulous records of all receipts, payments, and bookings, maintaining an accurate database.\nProactively follow up on leads to convert potential clients into loyalQualifications:Proven experience in sales, with a track record of achieving targets and closing deals.\nPrevious work experience in the massage spa industry is essential.\nFamiliarity with Dubai roads and locations is a strong advantage.\nExceptional organizational and multitasking skills to handle various responsibilities effectively.\nStrong interpersonal and communication skills, enabling you to build and maintain client relationships.\nAbility to work in a fast-paced environment and manage time efficiently.\nDetail-oriented with a focus on accuracy in handling administrative tasks.Timings: 9:30am - 9:30pmSalary: AED 4,000 - AED 5,000 per month (depending on experience)Commission: 5% of monthly targetSkills",
    "Skills": [
        "If you are an ambitious salesperson who thrives in a customer-oriented setting, and you have the relevant experience in the massage spa industry, we encourage you to apply! Join our team and contribute to enhancing the well-being of our valued clients through our premium home massage services",
        "Experience:",
        "4 years Sales experience preferably in a spa/massage center\nKnowledge of Dubai Roads"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Personal Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}