{
    "Job ID": "4738214",
    "Description": "Ensure Overall SLA is monitored at order level.\nEnsure order is Fulfilled and Delivered within the promised delivery timings\nLast Mile Team are real in-touch agents with customers, Driver shall be presenting Boutiqaat’s image with the customers and shall receive trainings on such.\nManage filtration of returned orders; Rescheduled, no answer and Customer denied.\nOrganize Shipments in FIFO.\nPerform Daily Shipment Aging Reports to ensure no delays.\nManage Sorting of shipments into Delivery Zones\nGroup relevant zones in case of zone doesn’t have enough shipments\nCan divide a single zone to multiple drivers in case of high shipment availability in this zone.\nKnowledge in Delivery Areas and Zones of the country/city of Operations.\nPlanning of distribution Routes.\nPlan Shipments and Manage Handover to 3rd Party Logistics.\nOversee the activities of shipping and receiving.\nArranging and providing transport for all the request from other departments like; Transfer orders, urgent.\nOrders and any external and internal request which are company related.\nEnsures that non-delivered shipments are received back at station.\nEnsures that non-delivered shipments are in good condition.\nFor Re-scheduled shipments, ensures that the Dispatch is as per the re-schedule date.\nIn Case of COD, ensures to collect the exact amount of CASH from the driver and check FAKE MONEY.\nOrganize received items into shipments and Cases.\nHandover reverse logistics items in the same day to the dedicated returns team in Boutiqaat Warehouse(s).Skills",
    "Skills": [
        "Bachelor's degree in business, operations management, or related field.\n3-5 years experience in an operations management role.\nProven leadership and team-building skills.\nExcellent communication, interpersonal, and problem-solving skills.\nHighly organized with strong attention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}