{
    "Job ID": "4738239",
    "Description": "Sales Indoor Specialist - RiyadhSales Specialist Responsibilities:Assist clients by answering questions about products, services, and price plans\nIdentify and develop leads through cold calling, referrals, networking, and trade shows\nDevelop relationships and advance the sales funnel from initial contact to sale\nInitiate new customer and vendor relationships and expand existing work relationships\nResearch and qualify leads, providing recommendations to clients\nAssist with lead generation, tracking, and follow-up\nMaintain records of sales calls and conversations\nPrepare and maintain client files\nAssist with account management, including client billing, responding to customer inquiries, and maintaining client relationships\nEncourage client referralsSales Specialist Duties:Develop relationships with clients and potential clients\nIdentify, qualify, and maintain existing accounts\nProvide excellent customer service by responding to clients’ needs in a timely manner\nDevelop customized selling strategies\nEstablish and maintain professional rapport with clientsSkills",
    "Skills": [
        "Communication Skills: The ability to articulate product features, benefits, and pricing clearly and persuasively to potential customers is crucial. Strong communication skills help build rapport and trust with customers.\nCustomer Service: Providing excellent customer service is essential for retaining existing customers and attracting new ones. Addressing customer inquiries, resolving issues, and maintaining a positive attitude are all part of this skill.\nProduct Knowledge: Thorough knowledge of the products you're selling is essential. You should be able to answer questions, provide recommendations, and highlight the unique selling points of each product.\nListening Skills: Active listening allows you to understand the customer's needs and tailor your pitch accordingly. This skill helps you offer relevant solutions and increase customer satisfaction.\nProblem-Solving: Not every customer will have the same needs or concerns. Being able to adapt your approach, offer alternative solutions, and resolve customer objections are valuable skills.\nNegotiation Skills: Negotiating terms, prices, and packages requires finesse and the ability to find a win-win situation for both the customer and your company."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}