{
    "Job ID": "4738108",
    "Description": "• تنسيق ومتابعة المشاريع مع العطارين وصانعي العطور لإعادة العمل عند الحاجة\n• الإشراف على عمليات تقييم واختيار العطور\n• العمل بشكل دائم على التطوير الاستباقي للمنتجات الجديدة باتجاهات عطرية جديدة\n• إجراء عمليات البحث ومسح السوق والمنافسين وتتبع عمليات الإطلاق المحلية والإقليمية والدولية الجديدة واكتشاف الاتجاهات الجديدة\n• مراقبة أداء المنتج والمشاركة في اتخاذ الإجراء اللازم: من حذفه أو إطلاق إصدار خاص له، إلخ ...\n• المشاركة في تطوير الأدوات والطرق والخطط التي من شأنها أن ترفع اداء العطور الناجحة\n• إنشاء تقارير دورية عن عمليات مبيعات المنتجات وكتابة التوصيات حسب توجهات العملاء للإدارة العليا\n• العمل على إنشاء شبكة تواصل خارجية مع البائعين والموردين الرئيسين في السوق\n• الاشراف على عمليات اختيار التغليف والعبوة وتصميم المنتج الجديد\n• الاشراف على تطبيق إيقاف المنتجات حسب المتغيرات في السوق والتأكد من التواصل الفعال مع جميع الإدارات المعنية بالايقاف\n• المتابعة مع إدارة المبيعات والتسويق للتأكد من تسويق المنتج بشكل صحيح وتدريب البائعين عليه\n• المتابعة مع إدارة المتجر الالكتروني للتأكد من طريقة عرض المنتجات الجديدة\n• إتباع جميع السياسات والعمليات وإجراءات التشغيل الموحدة والتعليمات ذات الصلة وضمان تنفيذ العمل بطريقة خاضعة للرقابة ومتسقة\n• المساهمة في تحديد فرص التحسين المستمر للنظم والعمليات والممارسات، مع مراعاة الممارسات الرائدة، وتحسين العمليات التجارية، وخفض التكاليف وتحسين الإنتاجية\n• تشجيع الآخرين لتنفيذ السياسات والعمليات وإجراءات التشغيل ذات الصلة \n• الإشراف على ومساعدة المرؤوسين لأداء عملياتهم الوظيفية وفقًا للسياسات والإجراءات المحددة\n• تحسين العلاقات وتوجيه فريق العمل وتطوير الموظفين كجزء من تطورهم المستمر\n• تعزيز بيئة عمل عالية الأداءSkills",
    "Skills": [
        "1. إدارة المشاريع:\nقدرة على تخطيط وإدارة جميع جوانب مشاريع تطوير المنتجات من تحديد المتطلبات إلى التسليم.\n2. استراتيجيات التطوير:\nتطوير استراتيجيات فعالة لتطوير المنتجات تستند إلى أهداف الشركة واحتياجات السوق.\n3. تنسيق الفريق:\nالقدرة على توجيه وتحفيز فريق متعدد التخصصات للعمل بتناغم نحو تحقيق أهداف المشروع.\n4. التواصل:\nمهارات اتصال ممتازة للتفاوض مع الأطراف المعنية والتواصل مع فريق المشروع والإدارة.\n5. تحليل الاحتياجات:\nالقدرة على تحليل احتياجات العملاء والسوق لتحديد متطلبات تطوير المنتج.\n6. إدارة المخاطر:\nتعريف وتقييم المخاطر المحتملة وتطبيق استراتيجيات للتخفيف من تأثيرها."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}