{
    "Job ID": "4738461",
    "Description": "عرض وظيفي لمحاسب  \n\nالشركة: شركة هامة الرواسي \nالموقع: الرياض – قرطبة \nالصناعة: مواد غذائية \n\nنظرة عامة:\nنحن نبحث عن محاسب ذو خبرة واحترافية عالية للانضمام إلى فريق المالية والمحاسبة في شركتنا. إذا كنت تمتلك خبرة لا تقل عن 5 سنوات في مجال المحاسبة، وتجيد التعامل مع التحديات المحاسبية المعقدة، وتتميز بدقة عالية واهتمام بالتفاصيل، فنحن ندعوك لتقديم طلبك والانضمام إلى فريقنا المحترف.\n\nالمهام والمسؤوليات:\n\nإعداد ومراجعة القوائم المالية والتقارير المحاسبية الشهرية والسنوية وعمل الميزانيات والموزانات .\nمراقبة وتحليل الأوضاع المالية وتقديم تقارير ملائمة لإدارة الشركة.\nتنفيذ الإجراءات المحاسبية وضمان الامتثال للسياسات والإجراءات المالية.\nإدارة وتوجيه فريق المحاسبة وتقديم الدعم والإشراف على أعضاء الفريق.\nالتعامل مع الجهات الخارجية مثل المراجعين والبنوك والموردين بشأن القضايا المالية.\n\nالمزايا:\n\nراتب تنافسي يعكس خبرتك ومهاراتك.\nحزمة مزايا شاملة تشمل تأمين صحي وإجازات سنوية مدفوعة الأجر.\nفرصة للتطوير المهني من خلال العمل في بيئة احترافية وتعلم مستمر.\nفرصة لتأثير إيجابي على تحسين وتطوير أنظمة المحاسبة والعمليات المالية.\nكيفية التقديم:\nإذا كنت مهتمًا بالانضمام إلى فريقنا وتتوفر لديك المؤهلات المطلوبة، يرجى إرسال سيرتك الذاتية عبر الايميل: مع ذكر \"محاسب - [اسمك]\" في خانة الموضوع. تشمل رسالة التغطية سبب اهتمامك بالوظيفة وكيفية تجربتك تؤهلك للدور.   \n\nآخر موعد لتقديم الطلبات: [05/09/2023م]\n\n\nنحن نعتز بالتنوع والمساواة في فريق العمل. جميع الأفراد المؤهلين مدعوون للتقديم دون اعتبار للعرق، اللون، الدين، الجنس، الجنسية، الإعاقة، أو أي حالة أخرى محمية بموجب القوانين المحلية.\n\nنحن متحمسون لرؤية المرشح المناسب ينضم إلى فريقنا ويساهم في نجاحنا المستمر في مجال المالية والمحاسبة.Skills",
    "Skills": [
        "المؤهلات المطلوبة:\n\nبكالوريوس في المحاسبة أو مجال ذي صلة. الماجستير يعتبر ميزة إضافية.\nخبرة لا تقل عن سنتين في مجال المحاسبة، بما في ذلك خبرة في العمل كمحاسب أول.\nإلمام عالي بمعايير المحاسبة الدولية والتشريعات المالية المحلية.\nمهارات احترافية في استخدام برامج المحاسبة وأدوات مايكروسوفت أوفيس.\nقدرة على التفكير التحليلي وحل المشكلات المعقدة.\nمهارات اتصال ممتازة وقدرة على العمل ضمن فريق.\nبخبرة لا تقل عن سنتين وأكثر"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}