{
    "Job ID": "4738720",
    "Description": "Our organization is a fast growing professional services firm that manages Information Technology (IT) for our clients. Our clients are small and medium businesses that usually range between 10 to 100 employees located in the United States. Our firm acts as the IT department for our clients.  You will be responsible for monitoring and running our Managed board. This includes monitoring, maintain and troubleshoot Server, Backup, Anti-Virus, Firewall and internet outage alerts. As Network Operations Center (NOC) Engineer, you are responsible for handling support of these service requests. This relates to all technology to include: workstations, servers, printers, networks, and vendor specific hardware and software. Typical hours are Monday through Friday from 4pm to 1am local time ranging from 40 to 48 hours per week and available for emergencies. Candidates should possess strong problem solving, analytical and communications skills in addition to in-depth technical knowledge of systems hardware and software. Job SummaryThe NOC Engineer is responsible for handling support of Managed board service requests. This relates to all technology, to include workstations, servers, printers, networks, and vendor specific hardware and software. Monitoring large computer networks and servers for problems from a central location. Analyzing problems, perform troubleshooting and incident response on the system, communicate with site technicians and track problems through to resolution. Typical DutiesBackups – Azure, Veeam and partner specific\nCRM and Remote Monitoring Application - Server updates, Server maintenance, scripting, monitors, projects\nDNS Security - Projects and escalation point for service\nAntivirus - Projects and escalation point for service\nData - SQL Database Cleanups and Reporting\nCompliance and security - performs scans, scan analysis, hand off for remediation and routine health checks\nFirewalls - Routine maintenance, Backup Configurations, Firmware updates\nSecurity - Knowledgeable of general IT Security practices\nProject Quality Assurance - checks for compliance to company standards and confirms documentation is in place Additional ResponsibilitiesImprove customer service, perception, and satisfaction\nAbility to work in a team and communicate effectively\nEscalate service or project issues that cannot be completed within agreed SLA\nBusiness awareness: specific knowledge of the customer and how IT relates to their business strategy and goals\nDevelop in-depth knowledge of the service catalog and how it relates to customer’s needs.\nDocument internal processes and procedures related to duties and responsibilities\nEnter all work as service or project tickets into ConnectWise\nResponsible for entering time and expenses in ConnectWise as it occurs\nUnderstand company processes by completing assigned training materials and blueprintsSkills",
    "Skills": [
        "Technical Skills:  ",
        "Advanced understanding of operating systems, business applications, printing systems and network systems\nDiagnosis skills of technical issues\nUnderstanding of support tools, techniques, and how technology is used to provide IT services\nTyping skills to ensure quick and accurate entry of service request details\nSelf-motivated with the ability to work in a fast-moving environment\nExperience with solutions such as Citirx, VMware or Veeam\nStrong working knowledge of LAN/WAN technology including TCP/IP\nProficient in PowerShell scripting\nExperience is Administering Avast / AVG, Symantec & Webroot AV\nProficient in Microsoft Technology: Microsoft 365, Windows Server Azure, SQL & Hyper V",
        " ",
        "Education & Experience: ",
        "BS/BA or equivalent experience and training required \nActively pursuing advanced technical certifications such as MCSE, CCNA,  etc.…\nGood command of the English language"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}