{
    "Job ID": "4739680",
    "Description": "We are seeking a NetSuite Senior Developer Contractor to join our team. As a team member at our progressive and purposeful company, you will have the opportunity to contribute your skills, broaden your experiences, and make a positive impact on clients, colleagues, and communities. Our commitment to an entrepreneurial spirit and people-centric approach is what sets us apart.**Role Overview:**In this role, you will be responsible for providing support, subject matter expertise, and technical guidance to users, company employees, contractors, suppliers, and customers. You will take the lead in report writing and analytics efforts for company financial information and drive data and systems integration projects, especially related to NetSuite, including the implementation of BI platforms.You will play a pivotal role in maintaining the integrity of system upgrades and development releases through thorough testing before migration to production. Hands-on coding work will be part of your responsibilities as needed.Your ability to document business objectives, requirements, specifications, workflows, and processes will be crucial. You will also take on functional lead or system expert roles within NetSuite environments and related systems.You will contribute to the optimization of the NetSuite platform by developing and maintaining workflows and processes, as well as assisting in the creation of dashboards and operational reports. The maintenance of our integrated platform testing application will also be within your scope.Additionally, you will evaluate the current state, research solutions, and implement effective designs to achieve business or process objectives. Your role will also encompass various other responsibilities as needed.Skills",
    "Skills": [
        "**Requirements:**",
        "- Strong experience with NetSuite ERP development.",
        "- Proficiency in SuiteScript for back-end customization.",
        "- Understanding of industry-standard practices in accounting, manufacturing, and warehouse management.",
        "- Ability to work independently on technical tasks.",
        "- Certified NetSuite Administrator or Consultant preferred.",
        "- Proficiency in saved searches, formulas, reporting, dashboard creation, custom forms, and workflows.",
        "- Minimum 7 to 10 years of experience in NetSuite platform management.",
        "- Experience in generating reports and custom reporting within NetSuite.",
        "- Strong problem-solving skills and the ability to manage competing priorities.",
        "- Excellent written and verbal communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 6"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}