{
    "Job ID": "4739236",
    "Description": "We are looking for a motivated and enthusiastic Network Engineer Intern to join our team in Riyadh, Saudi Arabia. As a Network Engineer Intern, you will have the opportunity to gain hands-on experience and develop your skills in network design, implementation, and troubleshooting. You will work closely with our experienced network engineers and IT team to support and maintain our network infrastructure.Responsibilities:Assist in designing, implementing, and maintaining network infrastructure.\nMonitor network performance and troubleshoot any issues that arise.\nCollaborate with the IT team to ensure network security and data privacy.\nAssist in configuring and maintaining network devices, including routers, switches, and firewalls.\nAssist in managing network documentation, including diagrams, configurations, and procedures.\nParticipate in network upgrade and expansion projects.\nProvide technical support to end-users regarding network connectivity and related issues.\nStay up-to-date with industry trends and advancements in network technology.\nAssist in implementing network monitoring and management tools.\nCollaborate with vendors and service providers to resolve network-related issues.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Currently pursuing or recently completed a degree in Computer Science, IT, or a related field.\nBasic knowledge of network protocols and technologies, such as TCP/IP, VLANs, and routing protocols.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal skills.\nAbility to work well in a team environment.\nSelf-motivated and eager to learn.\nAttention to detail and ability to follow instructions.\nAbility to prioritize tasks and manage time effectively.\nKnowledge of network security best practices.\nExperience with network monitoring and management tools is a plus.",
        "Network design and implementation\nTroubleshooting network issues\nNetwork documentation and configuration management\nNetwork security and data privacy\nKnowledge of network protocols and technologies"
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 1",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}