{
    "Job ID": "4739457",
    "Description": "The Company is one of the Middle East’s leading suppliers and EPC contractors of industrial equipment and services to heavy industries, utility providers and contractors. We are a specialist service group that caters to the exact requirements of clients using advanced technologies, talented teams of multi-disciplinary professionals, and best practice models and standards.The Company has a proven track record of more than 50 years of experience and employs more than 150 talented professionals specifically trained to meet identified market demands. The company retains a highly qualified team through intense selection and constant training and development of its workforce. The Management at the company also believes in the value of its human capital and provides what is needed to keep them satisfied and motivated.Skills",
    "Skills": [
        "We are currently looking for project engineers / managers to occupy a vacant positions within the Projects department to follow up under execution project in Jordan and gulf countries with the following duties , responsibilities and qualifications :",
        "Required Skills and Qualifications",
        "Bachelor’s degree in engineering ( mechanical , industrial or mechatronics ) or related field\n5+ years experience in project execution as project or site engineer role for industrial or construction projects\nExcellent in computer skills .\nStrong understanding of the project lifecycle and engineering processes\nAbility to develop detailed engineering schedules and track milestones\nPast experience in the industrial projects is preferable .\nKnowledge of contractual conditions and obligations or past experience in FIDIC regulations are preferred .\nExcellent analytical, problem-solving, and decision-making skills\nHighly organized with excellent attention to detail.\nStrong communication skills.\nStrong personality and ability to work under pressure and tight deadlines\nExperience in project management skills and preferred to be PMP certified ."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Jordan",
        "Gender": "Male",
        "Nationality": "Jordan"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Purchasing & Procurement",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}