{
    "Job ID": "4739340",
    "Description": "ACCOUNTABILITIESEnsure Engineering Dossier are delivered with a robust definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SOR.\nIs the focal point for all engineering subjects related to the package, including engineering scope management, change management, engineering manning and resources, engineering planning, progress.\nSupport Package Lead for planning, organizing, execution and control of full life cycle of engineering management activities from initiation to close out.\nEnsure efficient and effective interface management and coordination within engineering team, as well as with the organization's entities, and external parties to control proper realization of project engineering development.\nEnsure thorough, efficient, and timely review of project documents by engineering team, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome.\nSupport EMT team for engineering audit, progress monitoring, forecast and readiness assessment.\nEnsure package engineering team is staffed, competent and perform CPY reviews and validations in time as per contract.ACTIVITIESEnsure Engineering Dossier are delivered with a robust definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SORManage, control, and coordinate the proper realization of the engineering development for RUYA B1 sealine package. Ensure the good progress of engineering in compliance with project specifications and procedures, time schedule, required level of quality and safety.\nIdentify technical decision to be made by defining the subject, proposing the clear way forward for these decisions and managing the execution in agreed timeframe.\nIdentify any optimization / improvement in the design dossier to be implemented in the early stage of detailed design, promote, and encourage submissions of value engineering proposals\nSupervise and promote fit for purpose design to reduce and to optimize planning and costs.\nEnsure that relevant feedback/lesson learned from previous similar projects are considered in the design performance\nManage and lead the EPC kick of meetings for all disciplines.\nCapture gradually all the lesson learned and feedback on design within the package and communicate the outcome to package and Doha Engineering Management Team.\nCoordinate issuance of project response to contractors and vendors requests on engineering design clarifications, TQRs, derogation.Support Package Lead for planning, organizing, execution and control of full life cycle of engineering management activities from initiation to close out.Assist Package Lead in development of Package Engineering Execution Plan to create baseline for engineering scope, schedule, cost, risk and resources.\nAssist Package Lead and EMT to define package engineering maturity index, review the development and execution of engineering gate and readiness assessment.\n Assist in risk management and change management activities at package level by identifying potential risks and changes to the package baseline and providing accurate and clear information to Package Lead.\nAssist in performing engineering audit for CTR Engineering organization, that include audit of engineering process, engineering resources and engineering deliverables development.\nEnsure that engineering technical issues are listed, and allocated to CPY engineers by the Engineering coordinators, identifying the critical ones.\nConsolidate the action plans and their time schedule, listing the critical decisions and arbitrations to be done with their associated time frame. Ensure efficient and effective interface management and coordination within engineering team, as well as with the organization's entities, and external parties to control proper realization of project engineering developmentEnsure engineering development is consolidated with stake holders and stays within its assigned scope as per SOR and Project Basis of Design.\nCoordinate and lead weekly meetings with Engineering Disciplines to review the technical issues, blocking points, engineering progress, area of vigilance and concerns.\nPrepare technical engineering management reports detailing issues and decision to be made to ensure accurate information is available to Package Lead for decision making and opportunities.\nEnsure close coordination within engineering disciplines on all engineering, constructability, and operational matters,\nEnsure that engineering technical issues are identified, allocated, actioned, tracked, and addressed.\nAssist in preparation and attend to project studies including model review, HAZID, constructability review, PRs and other studies as directed by Package Lead.\nSupport the closure of project technical review points that need liaising with other entities.\nCoordinate and support overall project closeout, including completion documents, As-built, engineering, deficiency corrections and handover process.\nParticipate in weekly and monthly engineering meetings with Contractors, and specific ad hoc meetings as required by packages/projects.Ensure thorough, efficient, and timely review of project documents by engineering team, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcomeEnsure project documents are reviewed and commented by engineering disciplines in a timely manner and in accordance with the organization's standards, project specification and contractual requirements.\nEnsure proposed design by Contractor are challenged/reviewed by Engineering Team in order to achieve fit for purpose outcome\nLiaise with discipline leaders to identify/review the protentional deviations/derogations to the organization to ensure deviation package is mature for CMS submission and approval\nConsult E&C department and other entities to process derogation requests and interface with relevant TRP to secure needed approvalsEnsure package engineering team is staffed, competent and perform CPY reviews and validations in time as per contract.Plan and organize engineering team resources in accordance with projects plan in close contact with EMT.\nControl and manage the working load of the engineering team, update the mobilization and demobilization plan accordingly liaising with EMT..CONTEXT AND ENVIRONMENTThe scope of activities will concern green field (new development), brownfield activities (on existing platforms) and integration works. The activities include the review and comment of engineering and vendor documentation to ensure compliance with design dossier, SOR, Company specifications, …\nMajor Projects involve the development of new offshore platforms, integration to the existing facilities, installation of subsea pipelines, debottlenecking of existing functions, all these activities will be executed across several international sites.  Projects involves complex interfaces with other entities of the organization.\nThe Job holder is based in Doha, Qatar during the FEED and CFT stages and then will be relocated to EPC CTR premises (including Engineering Premises and Fabrication Yard) during the execution stage of the project with possibility of multiple worldwide missions to follow-up engineering development.Skills",
    "Skills": [
        "QUALIFICATIONS & EXPERIENCE REQUIREDEngineering degree in a technical discipline.\nMinimum 15 years’ experience in onshore & Offshore Oil and Gas Projects with good level of understanding of all technical disciplines\nAt least 5 years of experiences as Engineering Team Lead/Coordinator managing multidiscipline activities\nGood knowledge of industry codes, standards and legislations on SHE aspect,\nGood knowledge of TOTAL GS (shareholder) is a plus.\nExperience of FEED and Detailed Design Engineering technical management\nExperience of CPY engineering team lead is a plus.\nFluency in English (speaking and writing).\nStrong leadership skills and good communication skills,\nAbility to work on projects in a complex and multicultural environment,"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}