{
    "Job ID": "4739341",
    "Description": "ACCOUNTABILITIESEnsure Engineering Dossier are delivered with a robust corrosion, material selection and coating engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SOR.\nEnsure assigned project tasks are well managed in accordance with the project execution plan and contractual requirements that includes:\nThorough, efficient, and timely review of project corrosion & coating discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome\nProviding specialist technical expertise in corrosion engineering, material selection, cathodic protection design/ calculation, coating processes, coating control, coating resistant materials, and coating technology\nAssisting to coating and corrosion qualification, project studies and meetings related to the coating discipline as per project approved gate levels and design maturity\nIdentifying potential risks and scope changes within the corrosion discipline, conducting initial impact assessment to provide detailed information to Package Engineering Coordinator.ACTIVITIESEnsure Engineering Dossier are delivered with a robust corrosion, material selection and coating engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SOR.Ensure and coordinate the proper realization of the corrosion & coating design and material selection for project facilities in compliance with the organization's Standard, project specifications and procedures, time schedule, required level of quality and safety\nChallenge EPCIC Contractor on the proposed design, oversee the development of the corrosion and coating management specification procedures and material selection.\nIdentify corrosion and coating engineering and material selection technical decisions to be made. Define and manage clear way forward for these decisions to be made and report to Package Engineering Coordinator.\nContribute to the proper realization of the identification of and specification of the LLI\nEnsure close coordination with other disciplines on all engineering, constructability and operational matters,\nEnsure that relevant feedback/lesson learned from previous similar projects are considered in the design performance.\nAssist in planning and preparation of corrosion and coating discipline kick-off meeting with EPC Contractor\nSupport procurement engineering including TBEs, and vendor documents review and assist in manufacture site visit.\nAssist during execution of fabrication, transportation, and installation, liaise with QC resident personnel and site representative.\nSupport fabrication and construction engineering on review of engineering documents, modification approval, non-conformity reviews and assist in closer of punch lists\nSupport project during installation and hookup stage and review/approval work-pack, review of red-marksThorough, efficient, and timely review of project corrosion & coating discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcomeProviding specialist technical expertise in corrosion engineering, material selection, cathodic protection design/ calculation, coating processes, coating control, coating resistant materials, and coating technologyEnsure documents related to the corrosion& coating engineering, material selection, cathodic protection, commented in a timely manner and in accordance with the organization's standards, project specification and contractual requirements.\nIdentify any optimization / improvement in the design dossier to be implemented in the early stage of detailed design, promote, and encourage submissions of value engineering proposals.\nPromote fit for purpose design to reduce and to optimize planning and costs,\nCoordinate and issue project response to contractors and vendors requests on engineering design clarifications and TQR.\nIdentify the protentional deviations/derogations to the organization and assist in preparation of deviation package\nConsult E&C department to corrosion and coating derogation requests and interface with relevant TRP to secure needed approvals\nReview of final project documentation including final dossiers and as-built documents. Assisting to coating and corrosion qualification, project studies and meetings related to the coating discipline as per project approved gate levels and design maturityPrepare and manage scope of work for application tests and qualifications.\nOversee the development, qualification and approval of Corrosion and Coating procedures\nAssist to plant qualifications, procedure application tests, Factory Acceptance Test (FAT), Site Acceptance Test (SAT) in close coordination with QA/QC team\nAssist in review of related ITPs and attend the inspection as required\nAssist Package Engineering Coordinator to define, follow up and evaluate the corrosion reviews/ studies to be carried out by Contractors, ensure the studies completed as per approved project gate and maturity.\nAttend to project studies including model review, HAZID, HAZOP, constructability review, PRs.\nProvide technical answers and clarifications to internal project audit sessions (PR, HAZOP, HAZID, etc).\nParticipate in weekly engineering meetings with Contractors, and in specific ad hoc meetings as required by management.\nAssist in preparation of engineering progress reports detailing corrosion discipline progress across schedule. risks and technical issues to ensure accurate and timely information available to Package Management TeamIdentifying potential risks and scope changes within the corrosion discipline, conducting initial impact assessment to provide detailed information to Package Engineering Coordinator.Identify potential engineering scope change related to corrosion discipline, carry out initial technical assessment in order to provide accurate information to Package Engineering Coordinator.\nEnsure the design follows the approved SOR, basis of design and project standards, captured and manage any changes as per project change management plan.\nCONTEXT AND ENVIRONMENTThe scope of activities will concern green field (new development), brownfield activities (on existing platforms) and integration works. The activities include the review and comment of engineering and vendor documentation to ensure compliance with design dossier, SOR, Company specifications.\nMajor Projects involve the development of new offshore platforms, integration to the existing facilities, installation of subsea pipelines, debottlenecking of existing functions, all these activities will be executed across several international sites.  Projects involves complex interfaces with other entities of the organization.\nEngineering development take place EPCIC Engineering premises and then project team will move to fabrication yard of the Contractor.\n Possibility of multiple worldwide missions or relocations to follow-up engineering development with variousSkills",
    "Skills": [
        "contractors.\nQUALIFICATIONS & EXPERIENCE REQUIREDQualification: Engineering degree in Material and Corrosion Engineering.\nExperience: minimum10 years’ experience, in Corrosion engineering and material selection in offshore Oil and Gas industry.\nCorrosion engineering qualification (NACE or other certificates will be advantage)\nEngineering experience is required on wellhead platform, topsides, structure, piping, pressure vessels and practical knowledge of applicable codes and standards such as EN, ISO, ASTM, NACE and SSPC\nStrong leadership skills and good communication skills.\nGood analytical skills.\nFamiliar with Total general specifications is a plus, and with relevant codes and standards,\nLanguage: Fluent English\nAbility to work on projects in a complex and multicultural environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}