{
    "Job ID": "4739162",
    "Description": "Title: Delivery Driver - Night Route for Micromarket RestockingJob Description:We are looking for a dedicated Delivery Driver to join our team in Dubai. As a Delivery Driver, you will play a crucial role in ensuring the timely and efficient restocking of our micromarkets with delicious food and snacks. Your primary responsibility will be to follow a designated night route to replenish our micromarkets, ensuring that they are fully stocked and ready to delight customers the next day.About Us:At Self Kiosk, we specialize in providing innovative micromarket solutions that transform workplace dining experiences. Our micromarkets offer a wide range of delectable food and beverage options, conveniently located within corporate spaces. We believe in enhancing employee satisfaction, productivity, and well-being by offering easy access to tasty and fresh choices.Responsibilities:Follow a designated night route to deliver and restock food, snacks, and beverages in our micromarkets.\nEnsure accurate inventory management by tracking products delivered and restocked.\nCollaborate with the operations team to maintain micromarket cleanliness and organization.\nPerform routine vehicle maintenance checks to ensure the delivery car's proper functioning.\nCommunicate effectively with the operations team to report any issues or discrepancies.\nUphold safety standards while driving and unloading products.Benefits:Competitive salary and benefits package.\nCompany-provided delivery car.\nOpportunity to contribute to a dynamic team in a growing industry.If you are a reliable and organized individual with a passion for ensuring our micromarkets are fully stocked and ready to serve, we would love to have you on our team. Please submit your updated resume and a brief summary of your relevant experience.Note: This position requires working night shifts and following a designated route.Skills",
    "Skills": [
        "Valid UAE driver's license and clean driving record.\nFamiliarity with the roads and routes in Dubai.\nStrong organizational skills to efficiently manage deliveries and restocking.\nAttention to detail to accurately track inventory and product quantities.\nTime management skills to adhere to delivery schedules and meet deadlines.\nPhysical stamina to lift and carry packages of various sizes and weights.\nEffective communication skills to report issues and collaborate with the operations team.\nPositive attitude and ability to work independently.\nPrevious delivery or logistics experience is a plus."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}