{
    "Job ID": "4739327",
    "Description": "To be responsible, as and when required for the Estimating of complete projects of all classes Class 2 Class 5) by application of recognised norms and databases.\nTo liaise during the Estimating phase between various members of the engineering department,\nProject Management and construction disciplines to establish continuity and consistency.\nReview specifications, drawings, and attend meetings, etc. to determine scope of work and required contents of estimate.\nAbility and experience to both Lead and contribute to all aspects of Estimates, including details of\nMTO’s and unit rates, factored approaches and use of systems such as ACCE.\nEnsure all working documents and data are maintained to back-up estimate figures.\nTo assemble and present a professional estimate with the tools and systems available.\nHelp estimating manager in developing and maintain norms database.\nPerform benchmarking (tender stage and post award) to improve accuracy and confidence.\nPerform cost risk analysis using industry standard tools to determine the correct level of contingency for the estimate.Skills",
    "Skills": [
        "Required qualification and experience:University degree in engineering discipline\nMinimum 5 years of experience in a similar role in the oi and gas industry.\nExperience within energy and power projects\nExperience of Pre-FEED, FEED and EPC project estimating (onshore and offshore)\nExperience in presentations to clients\nKnowledge of all estimating techniques (top-down and bottom-up)\nExperience in preparing CAPEX, OPEX, ABEX is essential.\nBrownfield estimating experience is essential.\nHave a good written English skill to be able to write estimate basis, development plans, minutes of meeting etc."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}