{
    "Job ID": "4739046",
    "Description": "Design Manager - Facade, Aluminum, and GlazingWe are seeking an experienced Design Manager to join our dynamic team specializing in Facade, Aluminium, and Glazing work. As the Design Manager for Facade, Aluminium, and Glazing, you will be responsible for overseeing the design process from conception to completion. You will work closely with clients, architects, engineers, and project managers to ensure that our facade, aluminium, and glazing projects are executed flawlessly, meeting the highest standards of quality, functionality, and aesthetics. Your expertise in facade systems, aluminium structures, and glazing technologies will be vital in driving innovation and delivering exceptional design solutions.Responsibilities:Lead the design team in developing innovative and efficient facade, aluminium, and glazing solutions, ensuring compliance with relevant codes, regulations, and industry standards.\nCollaborate with clients, architects, and engineers to understand project requirements, objectives, and constraints, and provide expert design recommendations.\nPrepare and review design concepts, drawings, specifications, and technical documentation for facade, aluminium, and glazing systems.\nConduct feasibility studies and constructability reviews to evaluate design options and propose value-engineering solutions.\nManage the design process, ensuring adherence to project schedules, budgets, and quality standards.\nCoordinate with suppliers, contractors, and subcontractors to ensure accurate interpretation and implementation of design intent.\nPerform detailed design reviews and technical analysis to ensure constructability, performance, and compatibility of facade, aluminium, and glazing elements.\nStay updated on the latest advancements, trends, and best practices in facade, aluminium, and glazing design, and incorporate them into project designs.\nProvide guidance and mentorship to the design team, fostering a collaborative and innovative work environment.\nConduct regular site visits and inspections to monitor the progress of design implementation and address any design-related issues or challenges.Skills",
    "Skills": [
        "Bachelor's degree in Architecture, Civil Engineering, or a related field.\nProven experience (10+ years) in facade, aluminium, and glazing design, with a focus on commercial or high-end residential projects.\nStrong knowledge of facade systems, aluminium structures, glazing technologies, and relevant building codes and regulations.\nProficiency in design software such as AutoCAD, Revit, Rhino, and 3D modelling tools.\nStrong communication and interpersonal skills, with the ability to collaborate effectively with internal and external stakeholders.\nLeadership qualities with the ability to motivate and inspire a design team.\nAttention to detail and a commitment to delivering high-quality design solutions."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}