{
    "Job ID": "4739849",
    "Description": "Undertake receptionist duties:\nOffice supplies stock levels monitoring and ordering (stationery, pantry & cleaning, etc)\nHandle all online purchases for the projects department (Souq, noon, etc.)\nCoordinate with company driver for regular PO Box checking and distribute contents to addressees\nMonitoring expiry of company licenses, insurances, and other legal documents in coordination with the Group Administrator.\nPetrol Card application for new vehicles and other related requests of existing user\nPrepare summary of petrol expenses of company driver/s before submitting to Finance Dept.\nMaintain and keep updated employees and suppliers contact lists\nHandle travel visa applications, ticket and hotel bookings for company guests, project team and the management as and when required.\nBusiness cards ordering.\nHandle issues and coordinate AC maintenance, electric faults, pest control, etc.\nSupervise and close coordination with the Office Boy.\nOrganize and file company records.\nPreparing and disseminating correspondences, memos and forms.\nProvide administrative support to the management.\nArrange pick up and drop off of clients/guests.\nHandle employee requests and queries in close coordination with Group HR Department.\nPerform other administrative/clerical tasks as and when required.Skills",
    "Skills": [
        "Proficient in MS Office Package",
        "Business correspondence skills",
        "Adaptable",
        "Exceptional communication skills",
        "Candidates with experience with company travel arrangements (business visas, ticket and hotel bookings) will have an added advantage."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}