{
    "Job ID": "4739048",
    "Description": "Procurement Officer- Facade, Aluminum, and GlazingWe are seeking an experienced Procurement Officer to join our dynamic team specializing in Facade, Aluminium, and Glazing work/ Interiors/ Construction. Who will play a crucial role in managing the organization's procurement activities. Who will be responsible for sourcing, purchasing, negotiating, and coordinating the procurement of goods and services required for the company's operations. Your efforts will contribute to maintaining a streamlined and efficient procurement process while ensuring cost-effectiveness and adherence to quality standards.Key Responsibilities:Sourcing and Supplier Management: Identify reliable suppliers, maintain a robust supplier database, and negotiate favorable terms while prioritizing quality.\nPurchase Order Processing: Efficiently generate accurate purchase orders, collaborate with stakeholders for specifications, and ensure proper approvals.\nMarket Research and Analysis: Stay informed about market trends, pricing, and new products to make informed purchasing decisions.\nBudget Management: Collaborate with finance to develop and monitor budgets, seeking cost-effective alternatives without compromising quality.\nContract Management: Draft, and review contracts for legal and company compliance, mitigating potential risks.\nQuality Control: Work with quality assurance teams to uphold standards for procured goods and conduct inspections.\nInventory Management: Monitor inventory levels and adjust procurement strategies to prevent shortages or excess stock.\nDocumentation and Reporting: Maintain organized records, and generate regular reports on procurement activities and performance indicators.\nYour role ensures streamlined procurement, cost savings, and quality maintenance throughout the organization.Skills",
    "Skills": [
        "Bachelor’s degree in engineering, Business Administration, Supply Chain Management, or a related field.\nProven 5 to 7 years experience as a Procurement Officer or similar role in Façade or Interiors\nStrong knowledge of procurement regulations, processes, and best practices.\nExcellent negotiation and communication skills.\nProficiency in using procurement software and Microsoft Office Suite.\nDetail-oriented with exceptional organizational abilities.\nAbility to work collaboratively in a team environment.\nStrong analytical skills for market research and cost analysis.\nKnowledge of ethical sourcing and sustainability practices is a plus."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}