{
    "Job ID": "4739143",
    "Description": "Job Summary:As a Sales Executive – you are responsible to implement all sales activities and maximize business opportunities in your specific area of responsibility – under the general guidance of the Sales Manager.\nPreferably and priority to city residences.General Duties and Responsibilities: Generate and maintain clients / accounts of the HORECA sector through various sales activities (face-to-face sales calls, telephone calls, entertainment, hotel/restaurants/ outlets/Cafes inspections, etc); thus ensure complete coverage of own portfolio of accounts and achieve targets and maximize productivity. Formulate and negotiate HORECA leads / offers and yearly contracts and any other required business correspondence. Closely Monitor Accounts Revenue and business production for the HORECA Accounts and maintain up to date Account & Contact Database in the system results Continuously build positive relationships with large corporate clients Maintain good relationships with customers by providing support, information and guidance to solve customer issues and yield positive results Maintain professional and technical knowledge by continuously attending training and development programs on products, systems, policies and procedures Regularly report to and update management on sales progress and status of the assigned portfolio and engage them as required Remain current on industry trends, market activities and competitors to update management on regular basis Obeying the work orders of the superiors and implementing them with complete accuracy, and following the instructions and orders issued by the management at any time, and Their relations must be good and based on understanding and affection. Not to divulge industrial or commercial work secrets and, in general, any matter related to the firm’s work, its internal and external affairs, and its work system. It is also prohibited for the worker to compete with the employer in the same activity. Follow safety and occupational health and prevention measures as per they are announced by the state, company and management.Skills",
    "Skills": [
        "Communication Skills: Effective verbal and written communication to build rapport with clients, understand their needs, and convey the value of products or services.\nActive Listening: Skill to attentively listen to customer requirements, concerns, and objections, and address them appropriately.\nNegotiation Skills: Ability to engage in productive negotiations to close deals while ensuring both parties are satisfied.\nInterpersonal Skills: Build strong relationships, network effectively, and collaborate with colleagues and clients.\nProduct Knowledge: Thorough understanding of the products or services being sold to provide accurate and compelling information.\nProblem-Solving: Quickly identify customer pain points and tailor solutions to meet their needs."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 30"
    },
    "Data": {
        "Job Location": "Hurghada, Egypt",
        "Company Industry": "Trading & Commodity Trading; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}