{
    "Job ID": "4739038",
    "Description": "Responsible for brand marketing activities to build and increase brand awareness that leads to generating revenue for the Company through proper planning, and execution of digital activities that drive traffic, qualified leads, and sales.Organize and implement creative campaigns and promotional events to increase market share. Below are the essential duties and responsibilities but are not limited to:Conduct marketing research to ensure products and price positioning are competitive in the market and review customer behavior's /trends.\nAnalyze marketing data in collaboration with the Commercial team and provide insights and recommendations to improve brand performance and return on investment (ROI).\nPrepare and develop a marketing strategy to improve brand awareness, new product launching, recipes/product updates through promotions and events, etc.  \nFollow and execute the marketing programs based on the annual marketing calendar through available means such as social media, email, digital campaigns, activities, events, etc.\nBrainstorm with the team and create content for marketing campaigns and work closely with the Graphic Design team for the artwork, with Videographers and Photographers for the materials and ensure that SOPs and brand marketing checklists are followed based on brand guidelines.\nWork closely with the Procurement team for marketing tools, materials descriptions, and samples.\nObtain approvals for the marketing tools, materials, and samples before distribution and execution.\nMonitor the progress of the campaigns using various metrics and liaise with the Commercial and Finance team for ROI reports.\nBuild and maintain relationships with PR Agencies, influencers, tik-tokers, food bloggers, and other media personnel to ensure collaboration in promotional activities.\nCommunicate with delivery platforms such as Talabat, Deliveroo, V-thru, Upay and etc. for the activation/deactivation of promotional products/items.\nPrepare a consolidated report to help track the ongoing marketing performance for further analysis.\nPrepare weekly and monthly marketing activities and competitor activities (if any).\nMonitor and review marketing expenses against brand approve budget.\nAct as a focal point of contact with Suppliers & third-party vendors such as Print houses, Banks, Universities etc\nPerform other tasks assigned by Line Manager as and when required.Skills",
    "Skills": [
        "Fluency in verbal communication & writing skills (Arabic and English).\nGood understanding of market research techniques, data analysis and statistics methods.\nProfound knowledge of digital and traditional marketing.  \nStrong planning skills and executing marketing best practices.\nStrong organizational and interpersonal skills.\nStrong follow-up skills and willingness to exercise initiative.\nProficient in MS Office and marketing software (e.g. NIT, Canva, Office 365.)\nAbility to work on tight deadlines. \nAttention to detail and ability to multitask.\nEnergetic and self-starter\nFlexible",
        "Additional details:",
        "Driving license is a must"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries; All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant; Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}