{
    "Job ID": "4739081",
    "Description": "تنظيف وتشكيل الأظافر: ستقوم بتنظيف وتشكيل أظافر العملاء باستخدام أدوات متخصصة مثل قواطع الأظافر والملفات والمصقولات. ستضمن أن الأظافر نظيفة ومشكلة بشكل متساوٍ وفقًا لتفضيلات العميل.\nالعناية بالجلد المحيط بالأظافر: ستعمل على الجلد المحيط بالأظافر، حيث ستدفعه بلطف إلى الخلف وتزيل أي جلد زائد لتحصل على سطح الأظافر نظيفًا.\nنقع اليدين والقدمين: قبل بدء جلسة المانيكير أو الباديكير، قد تقوم بنقع يدي العميل أو قدميه في ماء دافئ أو محلول مريح لتنعيم الجلد والأظافر، مما يجعلها أسهل في العمل.\nالتقشير: في جلسات الباديكير، غالبًا ما ستقوم بتقشير جلد القدم لإزالة الخلايا الميتة والجلد الجاف، مما يجعل الجلد أكثر نعومة ونعومة.\nالترطيب: ستقوم بوضع مرطبات أو كريمات على الأيدي والقدمين للحفاظ على ترطيب الجلد ومنع الجفاف.\nالتدليك: تقديم تدليك للأيدي والقدمين جزء شائع من الخدمة، ويقدم الاسترخاء والراحة للعميل\nDuties\nManicurists and pedicurists typically do the following:\nDiscuss nail treatments and services available\nRemove clients' nail polish, if any\nClean, trim, and file nails\nSoften calluses and remove rough skin\nMassage and moisturize hands (for a manicure) and feet (for a pedicure)\nPolish or buff nails\nApply or remove artificial nails and nail art\nAdvise clients about nail and skin care for hands and feet\nClean and disinfect their work area and toolsSkills",
    "Skills": [
        "النظافة والصحة: ضرورة فهم والالتزام بممارسات النظافة والتطهير الصارمة لضمان بيئة نظيفة وآمنة للعملاء ومنع انتشار العدوى.\nاستشارة العملاء: مهارات الاتصال الفعالة للاستشارة مع العملاء وفهم تفضيلاتهم وتحديد أي مخاوف خاصة يمكن أن يكون لديهم بشأن أظافرهم أو جلدهم. يجب أن تقدم أيضًا نصائح للعناية بالأظافر والقدمين لمساعدتهم في الحفاظ على أظافر صحية بين الزيارات.\nمعرفة المنتجات: معرفة بالمنتجات المختلفة للعناية بالأظافر، بما في ذلك طلاء الأظافر، والجيل، والأكريليك، وتمديد الأظافر، ومعرفة كيفية تطبيقها وإزالتها.\nخدمة العملاء: تقديم خدمة عملاء استثنائية من خلال التكرم والتجاوب والانتباه لاحتياجات واهتمامات العملاء.\nCommunication skills\nTo provide advice and application of nail services\nKnowledge of proper safety and sanitation\nProper hand and foot massage techniques\nBusiness skills"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Personal Care Centers",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}