{
    "Job ID": "4739280",
    "Description": "Required Skills to be successful:Finance & Process experience\nAftersales experience\nAudit or compliance background ideal. About the Team:In this role you will be working in a diverse and fast paced environment and reporting directly to the GM Finance. What equips you for the role:MBA (Finance) with strong accounting knowledge or Member of a professional body of accountants (e.g. CPA, ACA, ACCA, CIA or ACMA) or be a partly qualified professional.\nDemonstrated experience with current systems analysis principles, method, procedures, practices, tools and techniques.\nA proven ability to communicate effectively with variety of levels of knowledge, skills and responsibilities. \nExtensive application of project management principles in managing projects and initiatives.\nAbility to articulate process and systems integrations applying best business practices.\nVast working knowledge on various automotive processes (e.g. Sales, After sales, Supply Chain, Leasing, etc.)\nMinimum 5 years working experience in the automotive industry Job-Specific Skills:Thorough knowledge of automotive sales processes\nExcellent understanding of SAP IS Auto system and preferably Ariba P2P. SAP BI and SAP BPC experience is an added advantage. \nA thorough understanding of an ERP application and its integration to finance along the entire supply chain.\nGood working knowledge in MS Visio\nStrong analytical skills  Behavioural Competencies :A team player\nExcellent Interpersonal Skills\nCultural awareness\nAble to build strong relationships\nResult oriented approach. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}