{
    "Job ID": "4739110",
    "Description": "Responsible to produce visual communication (text and imagery concept) for the Company.Manage digital and print-out design for marketing activities and ensure high-quality graphics content based on SOPs and brand guidelines. Below are the essential duties and responsibilities but are not limited to:Brainstorm and work closely with Marketing and Commercial team for the concept and ideas.\nPrepare creative content for the brands online campaigns, videos, print ads, brand labels, logos by combining brand standards, color theories, typography, and graphic elements to make visuals compelling and attention-seeking.\nDesign graphics to meet specific promotional and commercial needs like logos, packaging, displays, or imagery for digital and printable products.\nDecide how images and text work to fit a specific layout and size.\nCreate infographics that make complex ideas simpler and more accessible.\nDevelop the production design and overall layout for advertisements, magazines, banners, products, brochures, etc. \nPropose and communicate concepts and designs to Marketing team prior to incorporating them into revised designs.\nAmend designs based on brand feedback and obtain Line Manager approval.\nCheck samples and materials quality from the Procurement team as per the brand guidelines.\nProofread final graphic designs for typos and errors before submission, distribution, and execution.\nUpskill to keep up to date with the latest tools and technologies in graphics designing.\nAct as a point of contact with the Suppliers, third-party vendors and agencies for designing, packaging etc.\nPerform other tasks assigned by Line Manager as and when required.Skills",
    "Skills": [
        "Proven work experience as a graphic designer.\nPortfolio with design projects.\nFluency in verbal communication & writing skills (Arabic and English).\nThorough understanding of marketing, website design, production, corporate identity, advertisements, product packaging, and multimedia design.\nProficiency in tools such as Photoshop, Adobe, InDesign, and Illustrator.\nAesthetic, creative, and analytical skills.\nAbility to give and receive constructive criticism.\nUnderstanding of quality of material, dimensions & packaging etc.\nAbility to work on tight deadlines. \nAttention to detail and ability to multitask.\nEnergetic and self-starter.\nFlexible & Passionate. "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries; All GCC Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Food & Beverage Production; Catering, Food Service, & Restaurant; Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}