{
    "Job ID": "4739226",
    "Description": "We are looking for a Telecom Engineer Intern to join our team in Riyadh, Saudi Arabia. As a Telecom Engineer Intern, you will be responsible for assisting with the design, implementation, and maintenance of our telecommunications systems. You will work closely with our team of engineers to ensure the smooth operation of our communication networks and provide support to end-users.Responsibilities:Assist in the design, installation, and maintenance of telecommunications systems, including voice, data, and video networks.\nSupport the implementation of new technologies and upgrades to existing systems.\nTroubleshoot and resolve network issues and outages.\nCollaborate with cross-functional teams to ensure seamless integration of telecommunications systems with other IT infrastructure.\nMonitor network performance and make recommendations for improvements.\nAssist with the configuration and testing of telecommunications equipment and software.\nDocument system configurations, procedures, and troubleshooting steps.\nProvide technical support to end-users and assist with training as needed.\nStay up to date with industry trends and advancements in telecommunications technology.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Currently pursuing or recently completed a degree in Telecommunications Engineering or a related field.\nKnowledge of telecommunications systems and equipment, including PBX, routers, switches, and cabling.\nUnderstanding of network protocols and technologies, such as TCP/IP, VLANs, and SIP.\nExperience with network monitoring and diagnostic tools.\nAbility to troubleshoot and resolve network issues.\nGood written and verbal communication skills.\nStrong analytical and problem-solving abilities.\nAbility to work well in a team environment.\nAttention to detail and strong organizational skills.",
        "Knowledge of telecommunications systems and equipment\nUnderstanding of network protocols and technologies\nExperience with network monitoring and diagnostic tools\nTroubleshooting and problem-solving skills\nStrong communication and teamwork abilities\nMust be an Arabic speaker"
    ],
    "Preferred": {
        "Residence Location": "Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}