{
    "Job ID": "4739438",
    "Description": "Main Duties & ResponsibilitiesResearch, Write, translate and adapt items, news stories or programme material and to edit packages at the desktop.\nTo keep up to date with main news stories and undertake background research and checking on factual information.\nFlexible and prepared to take on any role required by the Editor or senior team members in response to the needs of the Newsroom (Input and Output).\nOccasional deployment in the field for specific projects requiring technical expertise and editorial judgement.\nManage a moving story, amending and updating material as required to build compelling and engaging news material\nLiaise with assignment desk and producers, to gather information and advice on stories and coverage.\nProvide ideas and suggestions for output, stories and attend editorial meetings when required.\nManage and undertake pre and post production and studio work, both live and pre-recorded.\nTo produce graphics at the desktop and in collaboration with graphic designers.\nTo be familiar with different technical systems, including news production systems, demonstrate a willingness to learn to operate new technology systems and to be able to adapt to different working methods.Skills",
    "Skills": [
        "Able to work with minimum supervision within a fast paced environment and achieve objectives.\nWorks with precision, accuracy and applies a high attention to detail.\nEffective communications and presentation skills using multimedia tools.\nProven Analytical, conceptual and problem-solving skills, work under pressure and to tight deadlines.\nA full command and up to date knowledge of spoken and written modern standard Arabic language of a high standard.\nAble to write, adapt and translate with accuracy, clarity and style as appropriate to different audience groups and media groups and articulate and able to communicate effectively at a professional broadcasting standard.\nUp to date knowledge of regional and international news.\nAppreciates and understands the benefits and importance of social media and digital technologies.\nExcellent understanding of editorial guidelines and able to identify trends and potential issues.\nDealing with live ‘breaking news’ and developing ideas resulting in turning into successful creative programme with speed.\nAble to demonstrate a very good understanding of news and current affairs programmes and the types of audiences they attract."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Broadcast Media Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}