{
    "Job ID": "4739945",
    "Description": "POSITION SUMMARY:A physician shall work in Imaging Services and devote his/her best ability to its proper management and provide best service for the patients. The Specialist shall provide all services required by Imaging Services in the normal scope of its operations. The Specialist shall provide 24‑hour on-call coverage seven (7) days per week as per operational requirement. Reports to and advises the Medical Director on matters related to operation within the Radiology Unit.POSITION ACCOUNTABILITIES:1)     Ensure patient and staff safety.2)     Assure that personnel in Imaging Services participate in continuing education programs.3)     Provide interpretations of all tests performed by Imaging Services within a time frame established by the medical staff and the company’s management.4)     Makes recommendations to the Medical Director for new or improvements to the equipment being used in Imaging Services.5)     Participate in and help establish the educational programs conducted by company and/or allied medical clinics and provide instructions as required to the various departments in the form of a continuing education program.6)     Contributes in development and/or approval of all policies and procedures for Imaging Services.7)     Contribute in verification of the qualification and capabilities of all radiological technical personnel as required by Medical Director.8)     Actively participates in clinic meetings and activities as representative of Radiology department whenever required.9)     Ensure implementation of the Ministry of Health regulations, hospital medical bylaws, rules and regulations and the Radiology Department policy and guidelines.10)  Maintains strictest confidentiality.11)  Accept all other additional assignments deemed necessary by the clinic Medical Director.Skills",
    "Skills": [
        "Minimum Education               : PhD/Royal College/Fellowship/Membership",
        "Minimum Experience             : 5 years experience with minimum 3 years post Fellowship/Membership experience in relevant specialty."
    ],
    "Preferred": {
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Medical Hospital",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}