{
    "Job ID": "4739336",
    "Description": "DUTIES AND RESPONSIBILITIES  To carry out Civil engineering work, supporting the project team for field development of oil and gas production facilities.\nTo plan, organize, and control a segment of the Civil/Structural engineering deliverables for the project.\nTo prepare Civil deliverables and ensure that they conform to all applicable engineering codes and standards as well as the Client’s policies and procedures.\nAnalysis and Design using engineering software such as STAAD. Pro, SACS, Matt 3D, etc\nTo ensure that all work is completed without compromise to quality and is delivered according to the project schedule.\nTo liaise with the Client’s Engineering, Operations and Maintenance staff as required to ensure a consistent approach to project completion.\nTo provide sound technical advice and solutions to a diversity of technical problems within the discipline\nTo assist in the coordination of all activities related to Civil engineering design.\nTo identify any areas of concern with respect to progress and/or quality and recommend corrective actions as required.\nLiaise with other disciplines to accommodate their requirements.\nLiaise with Designers in the preparation of CAD drawings, civil drawings and details, typically using, MicroStation, Smartplant 3D, E3D, AutoCAD, PDMS, PDS, Tekla etc.\nEnsure all work to be carried out with a positive attitude toward safety, both in design and in the office environment.\nTo provide relevant knowledgeable practical skills in the response and actions for Site visits and site surveys, Site queries and discussions, Supplier, vendor, contractor, client and site related discussions and Site based activities.Skills",
    "Skills": [
        "EXPERIENCE:",
        "Minimum of 10 years of relevant experience\nEnrolled of the Register of Engineers in the State of Qatar, Grade A Category as a mandatory requirement\nIf not enrolled on the Register of Engineers in the State of Qatar, then candidates must be a Chartered Engineer.\nProven core Civil Engineering skills, including design experience and preferably in the Oil & Gas sector.\nExperience of working in a variety of projects and phases, including greenfield and brownfield, on and offshore, Pre-FEED through to EPC, with a focus on offshore upstream.\nA self-motivated, proactive individual with high achievement drive and initiative, excellent verbal and written communication skills and good organisational awareness\nAbility to impact and influence fellow workers.\n Demonstration of customer focus and ability to respond to customer needs whilst achieving project and corporate objectives.\nDisplay analytical and innovation skills to manage new technology."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}