{
    "Job ID": "4739040",
    "Description": "Share & implement campaign strategy, promotions, communication, P.R activities, branding & events for Body and crash repairs centres & guests to maximize the service market share and CPUS; Assist in service campaigns launching and responsible for body & paint after sales events and P.R activities through print and electronic media.Concede plans and execute all digital marketing campaigns through available channels (Owned Media, Paid Media and Earned media).\nManage, plan and execute all digital marketing campaigns through available digital channels (Social Media, website and google ads)\nResponsible for the campaign brief details to the Advertising Agency for campaign Ad and selection of media channels booking and negotiations with the Agency including all the marketing promotion & campaign BTL materials with the agency.\nMonitor Pre & Post Campaign progress and activities at the centres with the coordination of ROGM's & Service Managers.\nPlan service product branding materials for all the service centres and maintain the standards of the brand I.D in the centres and promotion.\nFollow media monitoring (print & electronic) for competitors' activities and for industry trends.\nResponsible of the events for internal associates GSO -training programs, campaign events and P.R release through print media.\nImplement strategies/tools for digital/online communications such as blogs, e-newsletters/e-publications, videos, and webinars.\nOversee functionality of the organization Social Platforms and web site and content management system on a day-to-day basis, ensuring content is updated as needed and keeping within brand, messaging, and legal guidelines.\nHelp develop and document best practices/guidelines for staff users/content contributors\nCommunicate the campaign & product details to GSO Management, ROGM's, and Service Manager & F.O.D - Field operation dept.\nCommunicate Campaign brief & present proposals for the agency & management for the campaign creative layouts and media selection and schedule.\nDiscussion on the legal terms & conditions which are required for the campaign promotions & events with the legal Advisor's team.\nCommunicate & arrange all the P.R activities with the agency for after sales marketing campaigns by announcing in all major newspapers and any other channels.\nIn collaboration with others, prepare campaign proposals to the best interest for customers & company.\nFollow up Campaigns performance/implementation with Agencies. Provides campaign reports, analysis and metrics\nReview and plan the required content for the social media channels and purpose required activates to achieve the agreed KPIs\nImplementation of the yearly Marketing plan & activities.\nDevelop the brand strategy based on business direction and growth targets.\nControl the product and corporate branding as per the standards in campaign communication and in-shop branding materials.\nResponsible for preparing customer education, awareness reading material by preparing the campaign details & communication for the Service associates and GCC before campaign Launch.\nManaging of the customer experience on all journey type and across the different touch points.\nDeal with Legal Dept. for all the legal terms & conditions to launch a campaign.Skills",
    "Skills": [
        "Bachelor's Degree in Marketing or any related filed.\nAt least 8 years in similar role.\nAutomotive experience is a must\nExperience under managing end to end fanel into digital customer life cycle.\nKnowledge of Marketing principles and methods for design the campaign, launch, promoting, and using communication channels based on target market and audience. (Localized Campaign, Nationwide Campaign, Seasonal Campaign, Tactical Campaign).\nHaving GCC automotive market knowledge with having working in the Automotive dealers in Saudi Arabia.\nThe basic knowledge in financial transactions like Marketing budget preparation, CPUS & Service ROI reports, Marketing Activities expenditures and marketing material inventory reports.\nAdvanced user of all Microsoft office applications with major fluency in Excel.\nFluent in speaking, writing and listening of the English language.\n• Digital Marketing Analysis: the ability to interpret the results of many digital marketing tools.\nTime Management: Preparing, Submitting & Presenting the projects as per the timeline.\nAchievement/Effort: Job requires establishing and maintaining personally challenging achievement goals and exerting effort toward mastering tasks.\nMathematical and Analytical: Ability to perform basic mathematical and analytical computation.\nProblem Sensitivity: The ability to tell when something is wrong or is likely to go wrong. It does not involve solving the problem, only recognizing there is a problem.\nInductive Reasoning: The ability to combine pieces of information to form"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 0",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}