{
    "Job ID": "4739460",
    "Description": "تطبيق السياسات الخاصة بالمتجر بشكل عادل على جميع العملاء.\nإدخال البيانات الخاصة بالمنتجات وأسعارها على الحاسوب لتسهيل عملية الشراء على العملاء وتجنب حدوث أي أخطاء مثل تحميل العميل مبلغا خاطئا.\nحل المشكلات التي قد تحدث من العملاء بطريقة لائقة.\nتقديم التوصيات والإجابة على كافة الأسئلة واستفسارات العملاء حول المنتجات.\nجرد المنتجات والتأكد من صحة أسعار كل منتج والكميات المتاحة.\nالتعامل مع المرتجعات أو تبديل المنتجات عند الضرورة.\nالترحيب بالعملاء عند دخول المتجر وعند مغادرتهم.\nالحفاظ على واجهة المكان نظيفة ومرتبة.\nإدارة المعاملات مع العملاء من خلال الدفع النقدي أو باستخدام ماكينة الدفع الآلي.\nإرضاء العميل وإرشاده وحل كافة المشاكل التي قد تواجهه.\nالالتزام بكافة سياسات العمل والقواعد واللوائح المتعلقة به.Skills",
    "Skills": [
        "يجب أن تكون لديه معرفة تامة برموز المنتجات وسياسات إرجاع المنتج\nمن الضروري أن يمتلك مهارات تواصل ممتازة\nأن يكون لديه مهارات حسابية كبيرة وقدرة على استخدام الحاسوب وبرامج المايكروسوفت أوفيس.\nمهارات خدمة عملاء مميزة.\nيجب أن يكون لبقا ويتمتع بمهارات تواصل شفهي عالية.\nيفضل أن يكون حسن المظهر والسلوك.\nإمكانية العمل تحت ضغط ولساعات طويلة مع الانتباه إلى أدق التفاصيل.\nلديه معرفة قوية بأنظمة نقاط البيع.\nيجب أن يكون ودودا ومنفتحا ومقبولا وقادرا على توقع احتياجات المتسوقين ومساعدتهم في عملية الشراء.\nيجب أن يتسم بالصبر والالتزام.\nمن الضروري تمتعه بمهارات حل المشكلات.\nمن الضروري أن يكون لديه إلمام تام بكافة المعلومات الخاصة بكل منتج.\nمهارات الرد على الشكاوى.\nالتمتع بأخلاقيات عمل قوية وأن يكون منتبها لاحتياجات العميل والالتزام بتقديم خدمة ممتازة.\nمهارات استماع قوية وبناء الولاء بينه وبين العملاء."
    ],
    "Preferred": {
        "Residence Location": "Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "Unspecified"
    }
}