{
    "Job ID": "4739072",
    "Description": "- Develop and maintain accurate demand forecasts for finished products and raw materials based on historical data, market trends, and input from sales and marketing teams.\n• Supervise and lead the demand planning process and team, providing guidance, training, and performance feedback to ensure accurate forecasting and effective teamwork.\n• Collaborate closely with sales, marketing, production, and procurement teams to gather information for demand forecasting and align production and inventory goals.\n• Utilize forecasting tools and software to create and manage demand planning models, generating accurate short-term and long-term demand projections.\n• Monitor and manage inventory levels to ensure optimal stock levels while minimizing excess inventory and stockouts.\n• Coordinate with production managers to align production schedules with demand forecasts, considering production lead times and capacity constraints.\n• Support procurement teams in ensuring the timely availability of raw materials and ingredients based on forecasted demand.\n• Analyze demand patterns, variations, and emerging trends to identify risks and opportunities, and communicate them to senior management.\n• Review and enhance demand planning processes to improve accuracy and efficiency, implementing best practices and utilizing technology effectively.\n• Prepare regular demand-related reports and analysis to inform decision-making and strategy development.\n• Foster effective communication and collaboration within the demand planning team and cross-functional departments. Skills",
    "Skills": [
        "• Bachelor's degree in Supply Chain Management, Operations Management, Business Administration, or a related field. Master's degree is a plus.\n• Proven experience (4-6 years) in demand planning, supply chain management, or related roles, preferably in a food processing or meat manufacturing environment.\n• Strong analytical skills with the ability to interpret complex data and trends to generate accurate forecasts.\n• Proficiency in demand forecasting and advanced proficiency in Excel or other relevant tools or softwares.",
        "- Experience with ERP (Enterprise Resource Planning) systems and supply chain software is an advantage\n• Leadership and supervisory experience, including the ability to lead a team, manage performance, and promote a collaborative work environment.\n• Excellent communication and interpersonal skills to work effectively with cross-functional teams and senior management.\n• Strong organizational skills with the ability to manage multiple priorities and meet deadlines.\n• Knowledge of food safety regulations, quality standards, and industry best practices in the meat processing sector."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 0",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Industrial Production",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}