{
    "Job ID": "4739328",
    "Description": "Job Purpose•   Execution of Reliability Centred Maintenance (RCM) and implement a sustainable and structured maintenance improvement process, based on Reliability Centred techniques.Key Job Accountabilities•   Custodians of client Maintenance strategies•   Applies risk & reliability techniques and defect elimination processes to define and continuously improve equipment maintenance execution strategies and spare parts requirements in order to ensure the integrity and optimise the reliability of all client assets as per the Company’s business requirements.•   Introduces & maintains best practices, systems and tools that will continuously improve the availability of the assets, optimise maintenance activities and reduce costs.•   Facilitates and executes Root Cause Failure Analysis (RCFA), troubleshoot equipment problems and revises/updates maintenance strategies as a result of this. •   Ensures that plant production is supported with properly operating equipment that is maintained in a cost effective manner in line with client’s quality and safety standards. Identifies key maintenance cost areas and implement plans to reduce costs.•   Implements reporting systems and scorecards to identify ‘bad actors’ and shortfalls in equipment and system performance utilizing SAP Computerized Maintenance Management System and Company Reliability package. •   Provides coaching, (on the job) training and development to Qatari national graduates in Reliability analysis tools and techniques.Skills",
    "Skills": [
        "--Minimum Requirements--",
        "Qualifications",
        "•   Bachelor degree in Engineering or equivalent.",
        "Knowledge and Key Skills",
        "•   Total 8 - 10 years relevant experience in the oil & gas or petrochemical industry, with a strong preference for extensive LNG and maintenance/operations experience.",
        "•   1- 5 years experience in RCM (preferred)."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}