{
    "Job ID": "4739337",
    "Description": "Ensure Engineering Dossier are delivered with a robust HVAC engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SOR. \nEnsure assigned project tasks are well managed in accordance with the project execution plan and contractual requirements that includes:\nThorough, efficient, and timely review of project HVAC discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome.\nAssisting to project studies and meetings related to the HVAC discipline as per project approved gate levels and design maturity. \nIdentifying potential risks and scope changes, conducting initial impact assessment to provide detailed information to Package Engineering Coordinator.Ensure Engineering Dossier delivered with a robust HVAC engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of the organization's standard, project basis of design, and SOR. Ensure and coordinate the proper realization of the HVAC design in compliance with the organization's Standard, project specifications and procedures, time schedule, required level of quality and safety.\nChallenge EPCIC Contractor on the proposed design, oversee the development of the HVAC design including, HVAC basis of design, HVAC philosophy HVAC equipment specifications, load calculation, HVAC routing and drawings etc. \nPromote field technical optimization/cost savings, ensuring first that they are compliant with the project schedule and the contracts, liaising with the HVAC Lead/Package Engineering Coordinator.\nIdentify HVAC engineering technical decisions to be made. Define and manage clear way forward for these decisions to be made and report to HVAC Lead/ Package Engineering Coordinator\nWork with weight control engineer and engineering team to ensure close weight monitoring and control of weight. \nContribute to the proper realization of the identification of and specification of the LLI.\nEnsure close coordination with other disciplines on all engineering, constructability, and operational matters,\nEnsure that relevant feedback/lesson learned from previous similar projects are considered in the design performance.\nAssist in planning and preparation of HVAC discipline kick-off meeting with EPC Contractor\nSupport procurement engineering including TBEs, and vendor documents review and assist in manufacture site visit. \nSupport fabrication and construction engineering on review of engineering documents, modification approval, non-conformity reviews and assist in closer of punch lists.\nSupport project during installation and hookup stage and review/approval work-pack, review of red-marks Thorough, efficient, and timely review of project HVAC discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome.Ensure project documents related to the HVAC discipline are reviewed and commented in a timely manner and in accordance with the organization's standards, project specification and contractual requirements.\nIdentify any optimization / improvement in the design dossier to be implemented in the early stage of detailed design, promote, and encourage submissions of value engineering proposals.\nPromote fit for purpose design to reduce and to optimize planning and costs,\nCoordinate and issue project response to contractors and vendors requests on engineering design clarifications and TQR.\nIdentify the protentional deviations/derogations to the organization to and assist in preparation of deviation package.\nConsult E&C department to HVAC derogation requests and interface with relevant TRP to secure needed approvals.\nReview of final project documentation including final dossiers and as-built drawings.Assisting to project studies and meetings related to the HVAC discipline as per project approved gate levels and design maturity.Assist to define, follow up and evaluate the HVAC discipline studies to be carried out by Contractors, ensure the studies completed as per approved project gate and maturity. \nAssist in preparation and attend to project studies including model review, HAZID, HAZOP, constructability review, PRs.\nProvide technical answers and clarifications to internal project audit sessions (PR, HAZOP, HAZID, etc.…).\nParticipate in weekly engineering meetings with Contractors, and in specific ad hoc meetings as required by management.\nAssist in preparation of engineering progress reports detailing HVAC discipline progress across schedule. risks and technical issues to ensure accurate and timely information available to Package Management Team Identifying potential risks and scope changes within the HVAC discipline, conducting initial impact assessment to provide detailed information to Package Engineering Coordinator/HVAC Lead.Identify potential engineering scope change related to HVAC discipline, carry out initial technical assessment in order to provide accurate information package management team.\nEnsure the design follows the approved SOR, basis of design and project standards, captured and manage any changes as per project change management plan. CONTEXT AND ENVIRONMENTThe scope of activities will concern green field (new development), brownfield activities (on existing platforms) and integration works. The activities include the review and comment of engineering and vendor documentation to ensure compliance with design dossier, SOR, Company specifications, …\nMajor Projects involve the development of new offshore platforms, integration to the existing facilities, installation of subsea pipelines, debottlenecking of existing functions, all these activities will be executed across several international sites. Projects involves complex interfaces with other entities of the organization. \nEngineering development take place EPCIC Engineering premises and then project team will move to fabrication yard of the Contractor.\nPossibility of multiple worldwide missions or relocations to follow-up engineering development with various contractors.Skills",
    "Skills": [
        "QUALIFICATIONS & EXPERIENCE REQUIRED",
        "Qualification: Engineering degree in Mechanical or HVAC system engineering.\nExperience: minimum10 years’ experience in HVAC engineering and design in offshore Oil and Gas industry. \nStrong leadership skills and good communication skills.\nGood analytical skills.\nFamiliar with Total general specifications is a plus, and with relevant codes and standards,\nLanguage: fluent English,\nAbility to work on projects in a complex and multicultural environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}