{
    "Job ID": "4739231",
    "Description": "We are looking for a highly motivated and talented Computer Engineer Intern to join our team in Riyadh, Saudi Arabia. As a Computer Engineer Intern, you will have the opportunity to work on various projects and gain hands-on experience in the field of computer engineering. You will be responsible for assisting with the design, implementation, and testing of computer systems and software applications. This internship will provide you with valuable practical experience and the opportunity to learn from experienced professionals in the industry.Responsibilities:Assist in the design and development of computer systems and software applications.\nCollaborate with team members to identify and resolve technical issues.\nConduct testing and debugging of computer systems and software applications.\nAssist in the documentation of technical specifications and user manuals.\nParticipate in team meetings and brainstorming sessions to contribute ideas and suggestions.\nStay up-to-date with the latest trends and advancements in computer engineering.\nPerform any other tasks assigned by the supervisor.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Currently pursuing a degree in Computer Engineering or a related field.\nStrong knowledge of computer hardware and software systems.\nProficient in programming languages such as C++, Python, and Java.\nExcellent problem-solving and analytical skills.\nAbility to work independently and as part of a team.\nGood communication and interpersonal skills.\nAttention to detail and ability to multitask.\nFlexible and adaptable to changing priorities and deadlines.",
        "Knowledge of computer hardware and software systems.\nProficiency in programming languages such as C++, Python, and Java.\nProblem-solving and analytical skills.\nGood communication and interpersonal skills.\nAttention to detail and ability to multitask."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}