{
    "Job ID": "4739240",
    "Description": "Assist team members with project objectives, budgets, and timelines.\nGuide and communicate with the in-house team to achieve project objectives in the desired timeframe.\nWork with colleagues to ensure smooth progress and execution of architectural projects.\nHelp new and existing teammates by explaining a specific project's timelines and other technical aspects.\n Collaborate with clients to understand their design preferences and requirements, translating them into unique and practical design solutions.\nLead a team of junior designers, delegating tasks and overseeing project timelines to ensure timely and successful project delivery.\nDevelop detailed design concepts, including floor plans, color schemes, material selections, and furniture layouts.\n Present design proposals to clients through visual presentations, 3D renderings, and mood boards, effectively communicating design concepts.\nSuccessfully completed multiple commercial and residential projects, receiving positive feedback from clients and stakeholders.\nSite Supervision, Coordinate with supplier. Skills",
    "Skills": [
        "Good time management skills.\nMinimum graduate degree holder in the Architecture stream from a reputed institute.\nProfessional license to practice Architectural design and project work.\nExpertise in recent Architectural techniques and standards for effective implementation in the company projects.\nMinimum work experience is 5 years."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Residence Location": "Abu Dhabi, United Arab Emirates ; Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Architecture",
        "Company Type": "Unspecified",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}