{
    "Job ID": "4739381",
    "Description": "Conduct market analysis by staying updated on trends, news, and economic indicators affecting stock prices.Analyze company financials, industry trends, and macroeconomic factors to inform trading decisions.Execute buy and sell orders for stocks and securities based on client or firm instructions.Utilize trading platforms to accurately and efficiently place trades.Manage risk associated with trades by setting stop-loss and take-profit levels.Implement risk management strategies to limit potential losses.Oversee portfolios of stocks and securities to optimize returns for clients or the firm.Provide recommendations for portfolio rebalancing and adjustments based on market conditions.Communicate with clients, providing updates on portfolios and trading activity.Address client inquiries and offer insights into trading strategies.Use algorithmic trading strategies to automate execution and capitalize on market inefficiencies.Collaborate with research analysts to gain insights into investment opportunities and stock performance.Ensure trading activities adhere to regulatory requirements and internal policies.  Monthly package: 8,000 – 12,000 SARSkills",
    "Skills": [
        "Nationality: Saudi\nExperience in EquityTrading +3years.\nExperience with reputable organization such as:\nIn Saudi: Al Rajhi capital, Aljazira capital, GIB capital\nExperience in Equity Trading +3years.\nLanguage: Arabic & English\nIn Egypt: Hermes securities brokerage, CIBC, Sigma securities, Mubasher, Prime"
    ],
    "Preferred": {
        "Gender": "Male",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting; Financial Services; Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}