{
    "Job ID": "4739176",
    "Description": "Point of contact responsible for the overall ride operation for the event. Single point of contact on ground for all event activities. Liaise with all departments to ensure that the safety and guest experience of the rides are maintained. Tactical element of the response and will be present on site during the time of the event. Formulating and implementing necessary responses to incidents. Classifying incidents as a major incident. Allocating and managing personnel during the event of an emergency or incident. Providing reports and ride status updates as required during the event.• To fill in the role and responsibilities of the Operations manager when required• Assist the Operations Manager in planning and organizing daily activities for ride operations, guest services,  maintenance, and park cleanliness.• To perform in Duty Manager role• Supervise and manage a team of ride operators, park attendants and other staff members to ensure a positive customer experience.• Ensure adherence to all safety policies and procedures as set forth by the park and regulatory agencies.• Collaborate with the management team to develop and implement strategies for improving park operations and guest experiences.• Assist in managing budgets and ensure the park operates within financial plans and goals• Assist in accident / incident investigation as requested.• Assist in enforcing and adherence to all policies and guidelines.• Assist in training ride Assistants and Operators to ManufacturersManuals and Mellors Group agreed standards.• Provide a work environment that demonstrates leadership, communication, and motivation.• Establish and maintain good working relationship with Attendants and Operators.• Respond to all emergency situations and perform and assist in all emergency evacuations of rides.• Compile and report information on all incidents and breakdowns within the assigned zone area on the Company Reporting App.• Work closely with rides Operations Manager to maintain proper staffing levels.• Ensure accuracy of the opening procedures checklist by sampling daily.• Provides Attendants and Operators with necessary information needed to effectively perform their dutiesleadership,communication, and motivation.• Establish and maintain good working relationship with Attendantsand Operators.• Respond to all emergency situations and perform and assist in allemergency evacuations of rides.• Compile and report information on all incidents and breakdownswithin the assigned zone area on theCompany Reporting App.• Work closely with rides Operations Manager to maintain proper staffing levels.• Ensure accuracy of the opening procedures checklist by sampling daily.• Provides Attendants and Operators with the necessary information needed to effectively perform their duties.• Follows up on tasks delegated to Attendants and Operators to ensure proper completion.• Verify to the Operations Manager safety procedures are followed at each ride.• Resolves and communicates concerns, occurrences or problems that may arise within the assigned zone area to the Operations Manager.• Evaluates job performance of all personnel under  his/her supervision and makes necessaryrecommendations.• Gives verbal directions and assistance to guests and ensures hospitality is practiced.• Prioritizes operational needs to supervise the area in an efficient and timely manner.Skills",
    "Skills": [
        "• Must be able to Read, Write and Speak English",
        "• Completed Any Type of Tertiary Education",
        "• Amusement Park Experience or Similar (2 Year)",
        "• Extravert, Out Going Personality",
        "• Good Communication Skills",
        "• Problem Solving",
        "• Safety Orientated",
        "• Supervisory Experience (3 Years)",
        "• Documentation & Report Generating Skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}