{
    "Job ID": "4739230",
    "Description": "We are eager to add an experienced Marble and Granite Sales Executive to join our team at Ronak Group in Sharjah. Growing your career as a full time Marble and Granite & natural stones Industry as Sales Executive is a remarkable opportunity to develop your skills. If you are strong in sales & business development and have the right initiative for the job this is an exciting & a concrete job opportunity, if interested then you can apply for the position of Marble and Granite Sales Executive at Ronak International:Job Description:• Develop and implement strategic sales plans to achieve company goals.• Maintaining and increasing sales of Marble and Granite• Build and maintain strong relationships with key clients and industry partners. Lead and motivate a team of sales professionals to meet or exceed sales targets.• Analyse market trends and competitor activity to identify new business opportunities. Collaborate with marketing and product development teams to ensure effective sales strategies. Conduct sales presentations and negotiations with potential clients.• Complete knowledge about the product is necessary• Need to Identifies business opportunities in the industry by researching and analyzing sales options.• Sells products by establishing contact and developing relationships with prospects and recommending solutions.• Need to meet and make a deal with Architects, Interior Designers, Builders, Constructions Company & High network individuals & making presentation to them about our products.• Establishing, maintaining and expanding your customer base for new marble business.• Identifies product improvements or new products by remaining current on industry trends, market activities, and competitors.• Collecting customer feedback and market research.• Keeping up to date with products and competitors. Possess a professional, knowledgeable, positive and energetic attitude• Will be responsible for sales and marketing to procure orders and develop new dealers and distributors basically field work in domestic market, handling existing client and finalization of deals with customers.• Keep informed about the competitor’s selling policies, tactics, services and prices offered.• Work with customers or their representatives (designers, contractors etc.) in planning and product selection.• Uses strong consultative sales skills and interpersonal skills (both oral and written), attention to detail, strong follow up skills and motivation to hook the customerSkills",
    "Skills": [
        "Ability to analyze the goal, target customer, and challenges to overcome before planning sales-oriented activities.\nAdept at communicating with the in-house team, clients, and management through formal documentation and discussions.\nAbility to implement the 'customer first' approach by providing a personalized and convenient sales pitch.\nTremendous enthusiasm to efficiently achieve sales goals under tight deadlines.\nPortraying superb soft skills during customer interaction and seminars as per requirement.\nStrong negotiation skills.\nKnowledge in marble and granite industry is prefferred.\nAbility to commute/relocate: Sharjah, Reliably commute or planning to relocate before starting work (required)\nLanguage : Arabic (preferred), English"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Hardware & Building Materials",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}