{
    "Job ID": "4739379",
    "Description": "Manage phone calls, emails, and correspondence, and route messages to appropriate individuals.\nCoordinate and schedule meetings, appointments, and events, and ensure calendars are up-to-date.\nPrepare, format, and edit documents, reports, presentations, and other materials as needed.\nInput and maintain accurate data in spreadsheets, databases, and software systems.\nOrganize and maintain physical and digital filing systems for easy document retrieval.\nAssist with travel arrangements, including booking flights, accommodations, and transportation.\nSupport meeting logistics, prepare materials, take minutes, and distribute follow-up actions.\nMonitor and replenish office supplies, ensuring essential items are available for team members.\nGreet visitors, clients, and employees, and provide general assistance to guests.\nHelp with event planning, workshops, conferences, and company-wide activities.\nAssist with expense reports, track receipts, and ensure adherence to company expense policies.\nConduct research, gather information, and compile data as required.\nUpdate and maintain contact lists, mailing lists, and databases.\nProvide overall administrative support to managers, teams, or departments as needed.Skills",
    "Skills": [
        "High school diploma or equivalent; additional education or training in office administration is a plus.\nProven experience as an Administrative Assistant or in a similar administrative role.\nProficiency in office software, including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\nExcellent organizational skills and the ability to manage multiple tasks and priorities.\nStrong communication skills, both written and verbal.\nAttention to detail and accuracy in data entry and document preparation.\nAbility to maintain confidentiality and handle sensitive information with professionalism.\nStrong problem-solving skills and the ability to find solutions to day-to-day challenges.\nAdaptability and willingness to learn new processes and tools.\nTime management skills and the ability to meet deadlines.\nPositive attitude, professionalism, and a proactive approach to tasks.\nCustomer service orientation and ability to interact with visitors and clients.\nFamiliarity with office equipment and basic office operations.\nMidscale level in English both written and verbal.\nArabic Language is a must."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Age": "Min: 20 Max: 28"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}