{
    "Job ID": "4739335",
    "Description": "DUTIES AND RESPONSIBILITIESUse techniques, spreadsheets, databases and proprietary software as necessary to perform safety study assessments and generate project deliverable documents, including production, checking and approval as required.\nPreparation of design deliverables including philosophies, reports, studies, specifications, data sheets, drawings, etc whilst following all applicable operational procedures\nCoordinating and liaison with other engineering disciplines as necessary in the preparation and development of the deliverables and ensuring that other disciplines’ input is incorporated.\nEnsure compliance with relevant specifications as well as applicable national/ international regulations, codes and standards.\nResponsible for the review and approval of vendor documentation as applicable to the discipline\nEnsuring Purchasing and Estimating Departments have technical information for obtaining costs and availability of Technical Safety equipment and materials.\nMaintain effective interfaces between the Technical Safety project team and other disciplines’ teams, Client representatives and other third parties as required.\nRepresent the Technical Safety discipline internally and externally on design issues they are involved in.\nProvide progress reporting and forecasting input to the Lead Technical Safety Engineer as required.\nFollow standard working procedures and ensure that compliance with relevant QA/QC systems is achieve.Skills",
    "Skills": [
        "EXPERIENCE:",
        "Minimum of 10 years of relevant experience\nExperience of safety engineering in the offshore oil & gas industry\nExperience of office working and working within a project team E\nExperience of participation in project design reviews such as HAZID, ENVID and/or HAZOP\n Ability to use Technical Safety software pertinent to design reviews (e.g., DNV Phast & Safeti, Gexcon Shell FRED & Shepherd, Sunrise Pipenet, Schlumberger Flaresim)\nNGL experience is an additional advantage."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}