{
    "Job ID": "4739965",
    "Description": "We are currently seeking dynamic and experienced Tele Sales Executives to join our esteemed nursery in Abu Dhabi. As a Tele Sales Executive, you will play a pivotal role in promoting our nursery's offerings and facilitating the enrollment of children. This is an exceptional opportunity to utilize your sales acumen and contribute to the advancement of our nursery's outreach. Key Responsibilities: Engage prospective parents via telephone and various communication channels to introduce our nursery's comprehensive services.\nOffer detailed insights into our programs, facilities, and advantages to potential clients.\nSkillfully persuade and guide parents towards enrolling their children in our nursery.\nMaintain meticulous records of all interactions, ensuring the customer database is current.\nSurpass defined sales targets and objectives while collaborating with the sales team to refine strategies.  Skills",
    "Skills": [
        "Candidate Requirements:",
        " ",
        "A minimum of 3 years' proven track record in tele sales.\nProficiency in spoken and written English and Arabic (not mandatory).\nPossession of a valid UAE driving license (DL) is preferred.\nExceptional communication and interpersonal proficiencies.\nStrong negotiation skills coupled with persuasive abilities.\nResults-driven mindset with a commitment to achieving and exceeding targets.\nDemonstrated aptitude for both independent and collaborative work.\nGenuine passion for early childhood education and childcare.",
        " ",
        "Remuneration and Benefits:",
        " ",
        "Competitive salary, with remuneration reaching up to AED 4000, commensurate with experience and qualifications.\nPerformance-driven Special incentives and bonuses.\nOpportunities for professional advancement within a nurturing work environment.\nComprehensive training and resources to further enhance sales expertise."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 7"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Preschool, Nursery, & Daycare",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "5"
    }
}