{
    "Job ID": "4739053",
    "Description": "Sr. Accountant - For Facade, Aluminum, and GlazingWe are seeking an experienced Sr. Accountant to join our dynamic team in the Construction and Interior Industry. A Senior Accountant with a strong personality and confidence who can actively work in the field of financial analysis and planning; financial reporting; credit control; accounts payable and receivable; inventory and costs control; and budgeting and forecasting. The candidate must be based in KSA. Responsibilities:Financial Reporting: Prepare and review monthly, quarterly, and annual financial statements, including balance sheets, income statements, and cash flow statements. Ensure compliance with relevant accounting standards and regulations.\nMonth-end and Year-end Closing: Lead the month-end and year-end closing processes, including reconciliations, accruals, and adjusting entries. Ensure all financial activities are accurately recorded and properly documented.\nGeneral Ledger Management: Maintain and reconcile the general ledger accounts. Monitor and analyze account variances, investigating and resolving discrepancies as necessary.\nAccounts Payable and Receivable: Oversee accounts payable and accounts receivable processes, ensuring timely and accurate processing of invoices, payments, and collections.\nJournal Entries: Prepare complex journal entries for various accounting transactions, including revenue recognition, expense allocation, and intercompany transactions.\nFixed Assets: Manage the fixed asset accounting, including recording acquisitions, disposals, and depreciation/amortization. Conduct periodic physical asset verifications.\nFinancial Analysis: Analyze financial data to identify trends, patterns, and anomalies. Provide insights and recommendations to management based on financial analysis.\nBudgeting and Forecasting: Collaborate with the finance team to develop annual budgets and periodic forecasts. Monitor actual performance against budgets and forecasts, explaining variances.\nAudit Support: Assist with internal and external audits, providing necessary documentation, explanations, and reconciliations. Ensure compliance with audit requirements and resolve any audit findings.\nProcess Improvement: Identify opportunities for process improvements in financial procedures, reporting, and systems. Implement best practices to enhance efficiency and accuracy.\nCompliance: Stay up-to-date with accounting regulations and standards to ensure accurate financial reporting and compliance.\nTeam Collaboration: Collaborate with cross-functional teams, such as finance, operations, and legal, to gather information and provide financial insights for decision-making.Skills",
    "Skills": [
        "Chartered Accountant (CA), ACCA, or other relevant qualification in finance and account.\nThe candidate should have a minimum of 8 years of experience in the accounting field.\nExcellent writing and verbal communication skills.\nGood at MS Office and mail communication.\nInternational Financial Reporting Standards (IFRS)\nFinancial Accounting and analysis"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}