{
    "Job ID": "4739175",
    "Description": "Purpose of position: To support learners to achieve their assessment standard, framework, or employer-based qualification, by providing a high quality and enjoyable learning experienceKey areas of responsibility:Training, supporting, and developing learners\nHolistic co-ordination of learner progress towards their standard, framework, or qualification, including registration and certification\nEffective communication\nDeveloping Training Materials\nOwn continuing professional developmentOther Responsibilities:Conducting learning needs analysis\nDeveloping competency-based training programmes relevant to role specific competency criteria\nDeveloping content training support material targeting structured On-The-Job Training (OJT)\nDeveloping, as needed, instructor-led classroom training, on-line learning, and assessments tools to augment OJT programmes\nUtilising multimedia technology and Virtual Reality as needed\nReviewing existing OJT training content, design and implementation for effectiveness and providing guidance and /mentoring to subject matter experts, quality assurance, and other members of the training team (including assessors)\nCollaborating with functional SMEs and other internal resources to identify training needs and recommending strategies related to OJT training development and implementation\nDesign and development of various employee communication pieces regarding business and system changes that happen within the company.\nPartner and coordinate with others in the HR function wherever possible for the benefit of the company, and to ensure consistency and continuous improvement in HR practices\nDefine & administer testing/assessment programmes to certify personnel prior to undertaking specific role related tasks\nDelivers training programmes that include Virtual Reality, printed manuals, group sessions, training videos, and more.\nTo ensure all training documentation is completed acutely and in full.\nTo ensure all safety and training documentation is logged correctly on the company digital reporting system\nPresents in-person and  develops online training sessions\nMaintains understanding of new educational and training techniques and methods.\nMonitors and updates training manuals to ensure that they are effective\nLiaises with third party training organisations and contractors to arrange external training where necessary\nCoaches, mentors and develops staff within the company.\nDevelops material in line with NVQ standards and helps staff undertake and successfully complete the NVQ process (i.e. completing various units, portfolio creation etc)\nMonitors and updates the company ‘Frog’ LMS platform.\nEnsures tasks are being completed by employees that have at the appropriate competency level (i.e. correct level of authority)\nCreate assessments based on the developed material relevant to the subjected undertaken by the individual.\nDevelop, monitor, create and update training paperwork and competency papers relevant to the material /task being taught.\nUpdate CMS systems and procedures with prior consent from your direct line manger\nCreate practical sessions that demonstrate the individual’s competency to complete the tasks required.\nInspire, motivate and raise aspirations through your enthusiasm and knowledge to develop skills and support achievement\nFoster and maintain a positive working relationship in which learners feel safe, valued, empowered, and respected\nValue and promote social and cultural diversity and equality of opportunity\nEnsure good learner and employer understanding of the programmes structure, including the purpose, requirements and processes of assessment, expectations and timelines through a thorough induction and regular communication\nIdentify learner objectives, motivation and any requirements relevant to the training and assessment needs through a thorough initial assessment, including English, maths and technology skills (where required)\nReview and recognise previous learning and achievements, evaluating these against relevant objectives and requirements\nEnsure accurate and timely information and advice is given, throughout the programme, to learners and employers about:The most suitable learning aims and options\nAdditional learning and development opportunities\nExpected completion\nNext stepsPlan and facilitate the learning and training using a variety of strategies and resources, including technology, to motivate, challenge, develop independent and collaborative skills that are relevant to the programme, employer, learner interests, needs and ability\nAgree and prioritise training and learning needs and develop an individual learning plan with targets and dates for achievementWorking in collaboration with colleagues to bring about Service improvementsMaintain high professional standards with learners, employers and colleagues, acting as an ambassador for skills, learning and development\nEnsure all communication is professional and timely\nPromote and uphold the principles, policies and procedures of Mellors Group, and all relevant statutory requirements, including the Equality Act, the Health and Safety at Work Act, Data Protection Act and Safeguarding.\nReports to the Training Manager.\nReports any non-compliance issues to direct line manger\nMeets KPI’s set by the company and the client (applicable to role/duties)Skills",
    "Skills": [
        "Current and continuing involvement within the business sector\nSignificant experience as a practising trainer\nMeeting targets for timely success\nWorking successfully as part of a team\nSupporting learners to achieve successful outcomes in a work-based environment\nWorking with a diverse caseload\nWorked in amusement, rail, aviation, oil and gas or motor industry\nExcellent inter-personal skills and communication skills\nGood organisational and time management skills\nHighly developed ICT skills to support training, assessment and communication\nAbility to manage own workload and to work unsupervised\nHave a flexible approach and the ability to liaise with learners, employers and curriculum staff\nA strong commitment to and evidence of Continuing Professional Development (CPD)\nAble to demonstrate a positive response to change and to being open to new ideas and collaborative ways of working\nA commitment to achieving the targets set by the company\nAble to demonstrate a good work ethic"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Recruitment Agency",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}