{
    "Job ID": "4739324",
    "Description": "We are looking to hire an executive secretary with exceptional administrative and clerical skills.To ensure success, executive secretaries should be organized, have superb research skills, and must be exceptional communicators with a keen interest in providing reliable and accurate support to executives and management while working with confidential information. Top candidates will possess incredible problem-solving and office coordination skills, and exhibit excellent time management.Job Responsibility :Coordinating arrangements, meetings, and/or conferences as assigned.\nTaking dictation and writing correspondence.\nCompiling, proofreading, and revising drafts of documents and reports.\nDaily record keeping and filing of documents.\nPreparing reports, presentations, and correspondence accurately and swiftly.\nCreating and organizing information, and generating reference tools for easy use.\nAnswering and screening telephone calls, and responding to emails, messages, and other correspondence.\nOperating and maintaining office equipment.\nManaging a busy calendar, meeting coordination, and travel arrangements.\nProfessionally greeting and receiving guests and clients.\nEnsuring efficient and effective administrative information and assistance.Skills",
    "Skills": [
        "Degree in business administration (desirable).\nCertificate in business administration or related (essential).\n10-15 years of experience in an executive support role.\nMethodical thinker with detailed research proficiencies.\nThorough understanding of clerical and secretarial principles.\nFantastic organizational skills and detail-oriented.\nAbility to work under pressure and meet deadlines.\nBrilliant written and verbal communication skills.\nProficient in Microsoft Office, and business communication software."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 20",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 40"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}