{
    "Job ID": "4739182",
    "Description": "About the roleWe are seeking a highly motivated & entrepreneurial sales executive to accelerate the growth of our brand with a focus on Sablés within the retail segment (shops, kiosks, gourmet grocery stores, wine and flower shops, universities, schools, hotels, restaurants, cafes, corporate gifting, and events etc.) across all of Lebanon.Key ResponsibilitiesTeam Building, Training and LeadershipBuild and lead a high-performing sales team for our branches.\nRecruit top talent and provide comprehensive training.\nProvide daily guidance and motivation to the team, fostering a results-driven culture.\nContinuously develop the skills of team members, ensuring they utilize effective sales tactics to meet revenue objectives, and conduct regular performance reviews.\nMotivate the team to generate leads, build client relationships, set targets to hit or exceed revenue forecasts, and ultimately meet customer needs.Sales Strategy and Performance:Research consumer needs and align our solutions to meet those needs effectively.\nSet clear sales goals and objectives, analyze performance data, and make forecasts.\nMaintain knowledge of competitor products and identify and report intelligence on competitor pricing or marketing strategies.\nMaintain up-to-date awareness of activities and industry trends and technical developments that affect target markets.New Sales Channels:Identify and develop new sales channels to expand market reach.\nDeliver persuasive sales presentations, conduct business reviews, and provide product recommendations.\nConvert prospects into customers and implement upselling and cross-selling strategies with existing clients.Account Management and Territory Planning:Manage direct accounts, meeting established sales and revenue goals.\nDevelop a territory sales plan aligned with annual brand business plans and regional objectives.\nFoster strong relationships with key end-user accounts to drive distribution volume.Customer Service and Industry Engagement:Maintain a high level of customer service through prompt resolution of complaints, troubleshooting supply chain issues, and regular client visits.\nNetwork within the industry, participate in trade shows, and provide gourmet chocolate training to distributor sales networks.Sales Forecasting and Reporting:Maintain accurate sales forecasts to support business planning and inventory management.\nActively pursue sales leads, conduct customer visits, assess needs, propose suitable products, negotiate contracts, and meet revenue targets.\nTrack sales metrics, analyze data, and prepare regular sales reports. Provide accurate sales forecasts to management and contribute to the development of budgets and sales plans and action plans for follow-up.\nCollaborate with internal team: work closely with them to align sales strategies with overall company objectives. Provide valuable insights and feedback to improve product offerings and enhance customer satisfaction.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor’s degree preferably in a business/marketing field; master’s degree is a plus.\nSuccessful 8+ Years in Sales, Retail, Confectionery, F&B, FMCG.\nLeadership, and people skills including teamwork and coaching.\nBusiness acumen, strategic thinking, and analytical abilities.\nExcellent communication & presentation skills.\nSelf-confidence, enthusiastic, dynamic, creative, proactive, positive attitude.\nCapability to work autonomously, exercise professional conduct and sound judgment in all related areas.\nCustomer oriented, results-driven mindset with a passion for achieving targets.\nFlexibility to adapt and respond quickly to changing work situations and environments.\nFluency in French, English and Arabic\nGood knowledge of Microsoft Office (Word, Excel, PowerPoint).",
        "Join our team and play a crucial role in driving the growth of our brand in Lebanon. This is a challenging and rewarding opportunity for a passionate sales professional to make a significant impact on our company's success. If you are a self-driven, entrepreneurial individual with a proven track record in sales and the ability to lead and inspire a team, we invite you to apply and contribute to our success."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 35"
    },
    "Data": {
        "Job Location": "Lebanon",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}