{
    "Job ID": "4739017",
    "Description": "On behalf of a multinational retailer, we are seeking a young Accountant. Based in Riyadh you will report to the Senior Accountant.To accurately maintain the organization’s financial records and transactions (invoices, AP, payroll) in accordance with established procedures and guidelines.\nMaintain accounting controls by adhering to the accounting department’s policies and procedures.\nReconcile accounts, post journal entries, and maintain a complete and accurate general ledger in accordance with accounting principles and reporting schedules so that the organization has a full and accurate statement of its financial position.\nCorrect errors, if necessary, by posting adjusting journal entries.\nVerify and process accounts payable accurately and within payment schedules, and prepare reconciliation checks; provide departments with payment status, when requested.\nAssist with period-end closing transactions (monthly/quarterly/annually).\nPerform other supporting duties as directed by the supervisor. \nCollect and compile simple financial information and assist senior accountants to prepare accurate and timely financial reports and accounting statements for senior management.\nThese reports may include profit and loss statements, balance sheets, depreciation statements, cash flow, payment schedules, regulatory reports, and filings.Skills",
    "Skills": [
        "Bachelor’s degree in Accounting\n1 to 2 years of experience in a similar role\nBasic knowledge of accounting programs\nAnalytical Skills\nProblem-Solving Skills\nCommunication Skills\nComputer Literacy (Word, Excel, PowerPoint, Outlook)\nDetail Orientated\nStrong understanding of accounting aspects like balance sheets, cash flow management, business forecast, and profitability.\nStrong communication skills.\nStrong attention to detail and good analytical skills."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22 Max: 25"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}