{
    "Job ID": "4739052",
    "Description": "Photographer/Videographer – For Facade, Aluminum, and Glazing/ Interior-The Photographer/Videographer is responsible for creating outstanding photo/video, editing via Adobe applications, and delivering exceptional content to the company. Must be a multi-skilled, highly competent person who is flexible and knowledgeable enough to play different roles as circumstances required. The role is hands-on, and he must have creative capacity and technical skills.Responsibilities:Producing photo/video content for different marketing mediums/platforms\nPhoto shooting brand products and company events and activities\nEditing of Raw Images in Photoshop or Lightroom\nWork both on and off-site\nWork with our creative teammates\nReports to the Marketing Director / Marketing Manager\nAdhere to the company's brand guidelines.\nVisualize production scripts, briefs, understand company requirements to produce great results.\nSetup and capture great shots to fulfil the brief. Capture studio-quality videos and photographs\nEditing photo/video projects using Adobe Suite specifically Adobe Premiere Pro, Lightroom and After Effects (Dialogue cutting, editing consultant and trouble-shooter)\nMedia management and archiving of completed jobs.Skills",
    "Skills": [
        "A degree or diploma in photography, videography, graphic design, or a related field. The ideal candidate should possess a strong portfolio and a proven track record of producing high-quality visuals.",
        "3- 6 Years minimum experience in the field of Photography, Videography, Photo &Video editing.\nExperience in Real Estate, Architectural photo / video shoots would be an added advantage. Great eye for details, and good focus on angle shots.\nCreative flare for social media content\nExperience in camera operation, DSLR & digital video cameras, sound equipment and the overall production process is essential.\nTech savvy, with considerable knowledge of audio/visual equipment, hardware, software, troubleshooting, and techniques used in video production & editing.\nHighly proficient in editing with Adobe Suite specifically Adobe Premiere, Light Room, After Effects, Audition, Photoshop, and Illustrator\nHighly Creative, Multitalented, and has knowledge in storytelling.\nKnowledgeable in content creation and editing photos and Videos. \nExperience in camera operation, DSLR & digital video cameras, sound equipment and the overall production process is essential.\nExcellent communication & a good team Player skills are essential,\nEnthusiastic, self-motivated and ability to work independently.\nWork well under pressure to meet deadlines, including working out of office hours and occasionally on weekends.\nFlexible with good initiative able to deal with ambiguity (asking the right questions, anticipating needs, being resourceful and preparing for several outcomes.)\nMust meet deadlines and be flexible to work on last-minute requests whenever is required.\nHaving UAE driving license and available to join immediately.\nKnowledgeable in visual effects / Animation\nKnowledgeable in Graphic Designing, assist in support for marketing requirements."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}