{
    "Job ID": "4739057",
    "Description": "We are seeking an experienced Sr. Estimator to join our dynamic team specializing in Facade, Aluminium, Interior & Exterior Fit Out Divisions with strong personality and confidence who can actively work under Estimation Department. Expertise in coordination from Design, AutoCAD & Sales Team until awarding of projects. Proven success in leading multifunctional teams to achieve project goals and successful completion of projects. Good at Technical Knowledge of Interior & Exterior fit out product manufacturing & installation. Should be organized, motivated, self-driven and quick learner. Good at soft communication and computer knowledge.Key Responsibilities:Cost Estimation: Analyze project specifications, architectural drawings, and engineering documents to determine the scope of work. Prepare detailed cost estimates for materials, labor, equipment, and subcontractor services related to facade, aluminium, and glazing projects.Collaborate with the engineering and design teams to identify project requirements and potential value engineering opportunities.Bid Preparation: Prepare comprehensive and competitive bid proposals in response to RFPs (Request for Proposals) or RFQs (Request for Quotations). Coordinate with various internal departments, subcontractors, and suppliers to gather pricing information and ensure accurate bid submissions.Review and finalize bid packages, ensuring all necessary documentation is included.Project Planning: Collaborate with project managers and engineers to provide accurate cost data for project planning and scheduling. Participate in pre-construction meetings to discuss project requirements, timelines, and cost considerations.Risk Assessment: Identify potential risks and challenges that may impact project costs or schedules. Work with the project team to develop contingency plans and strategies to mitigate risks.Value Engineering: Recommend cost-effective alternatives for materials, methods, or designs to improve project feasibility and reduce costs. Evaluate different options and present them to the project team and clients for consideration.Vendor and Subcontractor Management: Establish and maintain relationships with suppliers, vendors, and subcontractors to ensure accurate pricing and availability information. Solicit quotes and negotiate pricing for materials and services.Cost Analysis: Analyze project costs against actual expenses to identify discrepancies and opportunities for process improvement. Provide post-project cost analysis to refine future estimation accuracy.Team Leadership and Collaboration: Provide mentorship and guidance to junior estimators or team members. Collaborate with cross-functional teams including project managers, designers, engineers, and clients to ensure alignment on project goals and requirements.Skills",
    "Skills": [
        "Graduation in B.TECH/B.E. in CIVIL or in the same field preferable.\nExcellent writing and verbal communication skills.\nGood at MS Office and mail communication.\nCandidate should have minimum of 8 to 10 years’ experience in Estimation in the field of Interior and Exterior fit out products."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}