{
    "Job ID": "4739172",
    "Description": "The ideal candidate must have a thorough understanding of all relevant safety regulations and standards. It must know how to properly enforce these rules and regulations, as well as how to effectively communicate them to others.Responsibilities:Develop and implement safety policies, procedures, and programs to ensure a safe and healthy work environment\nConduct regular site inspections to identify potential hazards and recommend corrective action.\nInvestigate accidents and incidents, determine root causes, and develop recommendations to prevent future occurrences.\nMonitor compliance with safety regulations and company policy\nKeep abreast of new developments in safety legislation and industry best practices.\nMaintain accurate records of safety inspections, accidents, and incidents.\nPrepare reports for senior management on the status of safety compliance and performance.\nInvestigate the construction site to ascertain equipment, production, and material processes do not pose a safety or health hazard to employees, work guests, and the general public.\nCreate, evaluate, and implement health and safety programs and strategies.\nReview and approve all subcontractors’ safety plans.\nPerform other duties as assigned.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor’s degree in safety management, engineering, or a relevant field is preferred.\n5+ years experience in UAE.\nTarakhees and DDA approved.\nExperience in writing reports and policies for health and safety.\nFamiliarity with conducting data analysis and reporting statistics\nAbility to develop and implement safety programs\nExcellent communication and presentation skills\nStrong organizational and time-management skills\nStrong work ethic and positive team attitude.\nSound analytical thinking, planning, prioritization, and execution skills\nValid Driving License within UAE"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}