{
    "Job ID": "4739113",
    "Description": "Our client is the largest Business Consulting and Services industry. They are now looking for a Public Relation Officer to join them.Roles & Responsibilities • Assigning visas to expatriates through the QIWA portal, aligning details to support entry of colleagues into Saudi Arabia• Monitor and renew employee and dependents firm sponsored Iqama residency and work permits• Facilitate and follow-up cancellation of visas for firm sponsored employees and the dependents• Facilitate complex medical / police procedures on event of death of any employee or next to kin• Manage registration and follow up with GOSI to ensure social security payments are made• Routinely monitor QIWA and MOL portals. Liaise with HR manager on QIWA & MOL status and requirements• Provide expert advice to business and employees where required regarding government related procedures• Accountable in maintaining accurate records for all above services and correcting where discrepancies are identified• Keeping up to date with government rules and regulations including visiting Ministries to understand how to navigate situations where neededLocationRiyadh / KSASalary: RUPEE 20000 - RUPEE 22000Skills",
    "Skills": [
        "Preference",
        "Expected date to join – ASAP",
        "Qualifications:",
        " 5 years’ experience with strong experience with Governmental organizations and Embassies\nEducational background: at least completion of Secondary Education\nExcellent networking and interpersonal skills. Strong problem-solving (an ability to manage ambiguity with an open mind and positive attitude) and multi-tasking capability\nExemplary judgment, discretion and professionalism\nSpoken and written Arabic is a must. Good knowledge of written and spoken English\nValid Driving License",
        "Benefits:",
        "Opportunity to work with a big Company"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}