{
    "Job ID": "4739111",
    "Description": "Position Title: Quantity SurveyorEmployment Type: Full Time Salary: up to 5K AED all-inclusive, depending on experience and qualificationsJob Location: Sharjah, UAEAbout the Client: A well-established metalwork and engineering company with several renowned projects in UAEJob Description:Prepares construction budget by studying plans, updating specifications, identifying, and projecting costs for each elevation.\nObtains bids and negotiate prices from vendors and subcontractors by specifying materials, then evaluates offers to purchase by costing changes, additions, and site requirements.\nGathers opinion of the project team and fabrication team on the engineering details to prepare final controlled documents of tender.\nAssist the Estimating Manager in all matters relating to the financial and contractual aspects of the project during the full design stages for the project.\nPrepare BOQ's and Preamble for all types of Method of Measurement: Remeasure, Lump Sum, and EPC (Engineering, Procurement, and Construction).Skills",
    "Skills": [
        "Qualifications:",
        "Open to Pakistani, Indian, and Sri Lankan nationals\nMale, 45 years old and below\nMust have Bachelor's degree in Engineering\nMinimum 5 years related experience from steel structure/construction\nExposure in steel fabrication and erection works\nExperience in doing all types of contract and preparation: Remeasure, Lump Sum, and EPC (Engineering, Procurement, and Construction)\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India; Pakistan; Sri Lanka",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}