{
    "Job ID": "4740067",
    "Description": "الهدف الوظيفة:\n- مساعدة الافراد في كافة المستويات الاجتماعية وتحسين ظروف الحياة لكافة فئات المجتمع بشتى أنواع البرامج والخدمات العائدة عليهم بالنفع والخير، من خلال الجمعيات الخيرية والجهات النظامية\n\nالمهام الرئيسية:\nأولا المساجد:\n1. متابعة مسيرات رواتب العاملين.\n2. الاشراف على المساجد والتأكد من العناية بها.\n3. متابعة وتنفيذ أوامر الصيانة.\n4. الأنشطة الطارئة.\n5. متابعة أوامر الشراء الخاص بالجوامع.\n\nثانيا المشاريع الموسمية: هي تلك المشاريع التي يتبناها الوقف خلال المواسم الدينية في الأشهر الفضيلة مثل شهر رمضان وشهر الحج ومن تلك المشاريع:\n1. السلال الغذائية (بطاقات الدعم) لدعم الأسرة المحتاجة مباشرة او عبر الجمعية الخيرية.\n2. إفطار الصائم: متابعة المساجد المدعومة والتأكد من رضاهم عن الوجبات.\n3. العمرة الرمضانية: تيسير رحلات العمرة خلال شهر رمضان بالتنسيق مع شركة سباتكو.\n\nثالثا: البرامج المجتمعية:\n1. مشاركة وزارة الشؤون الإسلامية في تنظيف الجوامع.\n2. المشاركة في دعم أحد الفعاليات الخيرية مثل (التبرع بالدم) بالتعاون مع قطاع حكومي او صحي.\n\nرابعا: الجمعيات الخيرية:\n1. استلام ومتابعة التقارير الشهرية للمنجزات او الربع السنوي.\n2. ضابط اتصال مع الجمعيات الخيرية.\n3. متابعة بنود اتفاقية الجمعية والتأكد من تحقيقها.\n4. استلام التقارير المالية وتسليمها للمالية قبل صرف الدفعة الثانية.\n5. معرفة المشاريع الجديدة في الجمعيات وفرزها بما يتناسب مع اهداف الوقف.\n6. العمل على اصدار تقرير سنوي للوقف بالإنجازات الخيرية.\n\nالمهارات والسمات الشخصية:\n1. القدرة على ضبط النفس والتحكم بالمشاعر.\n2. اللباقة والقدرة على التعبير.\n3. القدرة على تأسيس علاقات جيدة مع العاملين بمختلف الإدارات الداخلية، والهيئات التي يعمل بها.\n4. القدرة على الابداع والابتكار.\n5. القدرة على الاقناع.\n6. التمتع بمظهر لائق.\n7. المحافظة على اسرار العمل.\n\nظروف العمل والبيئة:\nأولا العمل المكتبي:\n1. إدارة الاعمال والتخطيط والابتكار.\n2. المتابعة وإعداد التقارير للإدارة.\n3. المراسلات.\nثانيا العمل الميداني:\n1. زيارة الجمعيات الخيرية والجهات ذات العلاقة.\n2. الزيارات الدورية لمتابعة الجوامع.\n3. تنفيذ المبادرات والمشاركة فيها.\n\nالمهام والواجبات:\n1. بناء علاقات مميزة مع الجهات الخارجية سواء كانوا افرادا او مؤسسة.\n2. استقبال منصات المشاريع للجمعيات والمؤسسات الخيرية.\n\n\n\n3. رفع التقارير السنوية والختامية الصادرة من الجمعيات وملخصها.\n4. فتح ملف لكل جمعية او مؤسسة خيرية ودعوية يحتوي على كافة المبيعات الرسمية والنظامية.\n5. استقبال وفود الجمعيات والمؤسسات الخيرية والدعوية الزائرة وتنظيم جدول الزيارات.\n6. الإجابة على خطابات واستفسارات الجمعيات والمؤسسات الخيرية والدعوية.\n7. صياغة عقود الاتفاقيات والشراكات مع الجمعيات والمؤسسات الخيرية والدعوية.Skills",
    "Skills": [
        "خبرة لا تقل عن 3 سنوات في المؤسسات الخيرية / الجمعيات الخيرية\nمعرفة جيدة بواقع العمل الخيري بالسعودية\nسعودي الجنسية\nالقدرة على التخطيط والمتابعة\nالقدرة على طرح حلول للإشكاليات التي تطرأ"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Safa, As, Jeddah , Saudi Arabia",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}