{
    "Job ID": "4740390",
    "Description": "Health and Safety Manager (Construction Project) - Arabic speakers onlySalary: Between 25k to 30k SARLocation: Makkah, KSAYou will report directly to the Director and will take overall responsibility for Health And Safety within the company. This will include but not be limited to:- Ensuring all current contracts comply with current health and safety legislation with the objective of ensuring that all reasonable and proper measures are taken to protect the safety and health of all staff and visitors.- Reviewing and ensuring the company is compliant with all Health and Safety policies and procedures and enforcing them on sites, including site inspections.- Work to maintain the overall health and safety awareness at all levels within the organization to an exceptional standard and monitor closely health and safety compliance on our sites.- To ensure all company records in relation to Health and Safety such as training records and accident and near-miss reports are properly maintained.- Carry out toolbox talks with all site personnel.- Compiling method statements and risk assessments for new works and reviewing sub–subcontractor’s method statements for upcoming works.- To participate in Site Safety Meetings on each site with site management and client and discuss any upcoming works and potential hazards.- To arrange and collate periodic inspections of plant, machinery and toolsSkills",
    "Skills": [
        "SKILLS AND EXPERIENCE REQUIRED",
        "A Health & Safety qualification such as NEBOSH is essential.\nAt least 5 years’ experience in delivering Health and Safety in the construction industry\nExcellent communication skills and an ability to communicate with people at all levels within the organisation.\nProficient in MS Office.\nSelf-motivated and with a high level of professionalism.\nThe ability to work under pressure and handle multiple tasks at the same time.\nBe able to work efficiently in a team as well on their own."
    ],
    "Preferred": {
        "Residence Location": "Jordan; Saudi Arabia",
        "Gender": "Male",
        "Age": "Min: 38 Max: 45"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}