{
    "Job ID": "4740454",
    "Description": "مدير مالي (دوام كامل أو جزئي)\nمطلوب لشركة ريادية ناشئة وطموحة مدير مالي بدوام كامل أو جزئي، لديه القدرة والطموح لتحقيق النجاح.\nالمنصب متاح للعمل في مدينة جدة، والتقديم متاح لأي مواطن أو مقيم داخل المملكة العربية السعودية فقط.\n\nالمهام:\n·       إدارة ميزانيات الشركة، ووضع الموازنة المالية التقديرية التشغيلية والرأسمالية التقديرية للشركة\n·       إدارة الحسابات\n·       إعداد التقارير المالية للشركة والإشراف عليها\n·       الإشراف العام على البرامج التقنية المحاسبية للشركة، وتقديم المراجعات بخصوصها\n·       النظر في التكاليف والمصاريف والإيرادات ومراجعتها والتحقق منها\n·       تخطيط وتوجيه جهود العاملين في القسم المالي لدى الشركة\n·       الإشراف على مجمل العمليات والأنشطة التي يقوم بها قسم المالية في الشركة\n·       تحضير التقارير اللازمة وذلك وفقًا لقوانين وتعليمات وسياسات الشركة\n·       شرح وتفسير لغة الأرقام والبيانات المالية، وتحليل البيانات والمعلومات المالية\n·       إعداد خطط الأعمال الاستراتيجية المالية ومؤشرات الأداء الرئيسية التي تعكس صحة الأعمال.\n·       الحفاظ على المستوى المالي للشركة\n·       تحليل الأنشطة المالية اليومية والروتينية للشركة\n·       العمل المباشر مع الأقسام الأخرى من الشركة ومناقشة أهداف الشركة وخططها المستقبلية معهم\n·       المساهمة في عمليات التخطيط والتحليل واتخاذ القرارات\n·       عرض وتقديم الخطط الإدارية المالية طويلة الأجل\n·       المشاركة في إعداد دراسات الجدوى لمشروعات الشركة\n·       التأكد من الالتزام بتطبيق معايير المحاسبة الدولية ال IFRS محل التطبيق\n·       تجهيز الضرائب (VAT) والزكاة.\n·       وضع إجراءات آمنة للحفاظ على سرية المعلوماتSkills",
    "Skills": [
        "·       خبرة عملية بالميزانية وادارة المخاطر\n·       المعرفة التامة بتحليل البيانات ونماذج التنبؤ\n·       ACCA,CMA or CPA\n·       أفضلية في هذه الوظيفة لمن لديه خبرة في أنظمة ERP مثل Odoo.. أو له القدرة على تعلمها.\n·       أفضلية لمن عمل مسبقاً في شركات تقنية، وعمل على منصات أو مشاريع تقنية."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}