{
    "Job ID": "4740950",
    "Description": "Join Our Team as a Twitter Content Creator / Social Media Specialist & Podcast Translator (Native German and English Speaker) for Dirk Kreuter - Elevate Europe's Leading Sales Trainer and Business ExpertPosition Overview: Join our dynamic JETSTREAM LLC team and wield your creativity as a pivotal force in crafting captivating content for Dirk Kreuter's Twitter platform and seamlessly translating his podcasts. As a vital member of our Dubai team, we seek an individual passionate about creating engaging social media content, boasting exceptional linguistic skills, and thriving within a collaborative environment.About Dirk Kreuter: Dirk Kreuter isn't just a name – he's a trailblazing entrepreneur steering a multi-location empire with over 160 employees across global hubs. With more than 79,000 companies and 121,000 self-employed individuals transformed by his insights, he's a driving force behind unparalleled sales growth. His podcast boasts an impressive 1,000 episodes and 22+ million downloads, while his YouTube presence, marked by 3,000 videos, garners 120,000 subscriptions and 44+ million views. An author, world-record holder, and Certified Speaking Professional, he's an inspiration spanning 16 countries since 1990.Twitter Content Creation:Conceptualize, develop, and execute innovative tweets aligned with Dirk Kreuter’s personal brand\nCraft compelling copy, visuals, and multimedia for Twitter.Stay updated with industry trends for timely content.Podcast Translations:Accurately translate podcasts, preserving original tone.\nEnsure high-quality translations resonate with the target audience.\nCollaborate with the Podcast Team for content consistency.Content Strategy and Planning:Set strategic direction for cross-platform content creation.\nPlan, schedule, and collaborate on strategies elevating brand storytelling.Collaborative Impact:Collaborate cross-functionally for cohesive content experiences.\nWork closely with design, marketing, and podcast production teams.Benefits:Competitive compensation package.\nRoom for personal growth and skill development.\nAccess to company resources, tools, and training.\nComprehensive Medical Insurance\nInvolvement in exciting projects shaping Dirk Kreuter’s brand’s online presence.Application Process:To apply, please submit your updated resume, a portfolio of relevant work, and a cover letter detailing your experience in content creation and translation.We look forward to reviewing your application and exploring your unique creative perspective.Apply now to be part of our exciting journey and drive our brand's digital success!Skills",
    "Skills": [
        "Qualifications:",
        "Proven experience as a social media content creator and translator.\nExceptional writing skills in both German and English.\nProficiency in crafting concise, engaging copy for social media platforms.\nFamiliarity with social media trends, especially on Twitter.\nExperience in podcast translation is a significant plus.\nCreativity and an eye for visual design are desirable.\nAbility to manage multiple projects and deadlines in a fast-paced environment.\nStrong communication and collaboration skills.\nPassion for storytelling, brand engagement, and digital marketing."
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates",
        "Nationality": "European Union; Germany; Great Britain (UK); United States"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Media Production",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}