{
    "Job ID": "4740183",
    "Description": "We are Dar Alkhalaf for consulting and Training based in Kuwait, for more information please visit our website.Positions currently required at the Company:1. Veterinary Hospital Administrator (1)The Veterinary Hospital Administrator must believe in a team concept of leadership, valuing the opinion of staff and department supervisors to create a culture of excellent employee experience as well as superior client service and patient care. This includes: mentoring the staff and overseeing the business operations and maintenance of the facility; ensuring the business growth and profitability of the practice; and supporting the hospital’s mission of delivering high-quality patient care and exceptional client service.The administrator must be “hands-on” and be willing to adjust responsibilities as the hospital staff, culture, and client expectations change. Above all, the goal of the administrator is to work with the leadership team and Doctors to ensure the highest quality medicine for our patients and a work environment that encourages employee growth.Job ResponsibilitiesDirect and develop the veterinary, technical and administrative staff towards the goal of quality patient care and excellent client service; aid in the formulation of objectives and policies to ensure efficient and profitable hospital operations.\nOversee the hiring, reviewing, disciplining, and terminating of professional staff, per and with the approval of the Management team.\nReview the Profit-and-Loss Report monthly and partner with the Hospital Medical Director to increase revenue and limit expenses; work with the home office to prepare and submit the yearly budget (budget forecast, operating plan, cap-ex expenditures) and participate in the evaluation process with the Management team.\nModel an “owner” mentality in the hospital by demonstrating a willingness to assist all employees in making the practice a success; invest the necessary amount of time to accomplish the required responsibilities and ensure the smooth operation of the hospital.\nPositively represent the Hospital in the professional community and to the public.Skills and QualificationsAt least 5 years of managing a veterinary practice and financial budget management experience.\nKnowledge of sales and marketing techniques.\nExcellent verbal and written communication skills, especially with a diverse range of audiences and settings.\nThe ability to make decisions, delegate responsibility and achieve results with hospital team members.\nProfessional comportment and appearance, with excellent interpersonal skills and a friendly, positive attitude.\nRespect for and willingness to work with clients and their pets.\nMust be able to handle multiple tasks and deal with an environment of changing priorities.Education and/or Experience: BVSc, MBA and CVPM are a plus. At least 5 years of previous veterinary hospital experience.Computer Skills: To perform this job successfully, an individual should have previous computer skills, including Windows-based software and Microsoft Office, online email, calendar, internet, and practice management software.Language: The candidate must be Fluent and able to write daily Status Reports in both Arabic and English.Ethnicity: Candidates must be of Arab Origin.Additional License: Candidate must legally obtain/carry a valid Kuwaiti Driver’s license.Conditions and specifications:1. Accommodation and transportation are provided.2. Contract duration: 3 years (can’t work for another employer before 3 years)3. Return Ticket and Visa are provided after signing the contract.4. Health Insurance is provided.5. Annual vacation (30 Days)Skills",
    "Skills": [
        "Skills and Qualifications",
        "At least 5 years of managing a veterinary practice and financial budget management experience.\nKnowledge of sales and marketing techniques.\nExcellent verbal and written communication skills, especially with a diverse range of audiences and settings.\nThe ability to make decisions, delegate responsibility and achieve results with hospital team members.\nProfessional comportment and appearance, with excellent interpersonal skills and a friendly, positive attitude.\nRespect for and willingness to work with clients and their pets.\nMust be able to handle multiple tasks and deal with an environment of changing priorities.",
        "Education and/or Experience: BVSc, MBA and CVPM are a plus. At least 5 years of previous veterinary hospital experience.",
        "Computer Skills: To perform this job successfully, an individual should have previous computer skills, including Windows-based software and Microsoft Office, online email, calendar, internet, and practice management software.",
        "Language: The candidate must be Fluent and able to write daily Status Reports in both Arabic and English.",
        "Ethnicity: Candidates must be of Arab Origin.",
        "Additional License: Candidate must legally obtain/carry a valid Kuwaiti Driver’s license."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Degree": "Doctorate",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "Veterinary Hospital & Clinic",
        "Company Type": "Unspecified",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}