{
    "Job ID": "4740287",
    "Description": "One of our clients who is in the Manufacturing and Installation of Aluminium and Steel Industry is seeking a qualified Commercial Manager with expertise in the Aluminum Facade field to join their team in Saudi Arabia, KSA.Location: Riyadh / JeddahJob Description:As a Commercial Manager, the primary responsibility will be to oversee and manage the commercial aspects of our Aluminum Facade projects.Responsibilities:-Develop and implement effective commercial strategies and plans for Aluminum Facade projects.-Coordinate and communicate with clients, suppliers, and contractors to ensure smooth project execution.-Prepare and negotiate project contracts, ensuring compliance with legal and regulatory requirements.-Conduct market research and analysis to identify potential business opportunities and develop strategies to expand the company's presence in the market.-Monitor project budgets and financial performance, ensuring profitability and cost control.-Collaborate with the project team to ensure timely delivery and quality standards are met.-Build and maintain strong relationships with key stakeholders, including clients, contractors, and suppliers.-Stay updated on industry trends, market conditions, and competitor activities to identify potential risks and opportunities.-Prepare regular reports and presentations for management, highlighting project progress, sales reports, and business development activities.Skills",
    "Skills": [
        "The ideal candidate should have a minimum of 5 years of experience in the field, preferably with experience working in Saudi Arabia.",
        "Years of Experience: 5 years +",
        "Education: Engineering.",
        "Notice Period: Immediate joiners or a maximum one-month notice period.",
        "-Minimum of 5 years of experience in the Aluminum Facade field.",
        "-Previous experience working in Saudi Arabia is preferred.",
        "-Strong knowledge of commercial and business development principles.",
        "-Excellent negotiation and communication skills.",
        "-Ability to manage multiple projects simultaneously and meet deadlines.",
        "-Strong analytical and problem-solving abilities.",
        "-Proficiency in English and Arabic, written and spoken, .",
        "-Bachelor's degree in a relevant field, Engineering, or similar",
        "Note: We thank all applicants for their interest however, only those candidates who are shortlisted will be contacted﻿."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy; Construction & Building; Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}