{
    "Job ID": "4740339",
    "Description": "·        Role: Head Waiter·        Contract: Permanent·        Location – Abu Dhabi, UAE·        Work Hrs: 8 hrs.·        Week off: 1 day·        Work Schedule: Full time (Live In).Job Purpose:Head waiters/waitresses manage the food and beverage service in a unit. They are responsible for the guest’s experience. Head waiters/waitresses coordinate all actions involving welcoming guests, ordering, delivering the food & beverage.\nHead waiters/waitresses are also senior members of the food service team and are responsible for training junior staffDuties and Responsibilities:Head waiters/head waitresses typically do the following:Train and supervise waiters and waitresses to give high standards of service in terms of time, quality and personalization.\nSupervise the mise-en-place of the assigned station to ensure a smooth service.\nInspect table layouts in the station ensuring that they meet the standards set.\nCheck and ensures the serviceability of equipment and furniture. \nTake food and beverage orders correctly. \nControl the inventory of cutlery and service equipment allotted to the station. \nAssign duties ensuring equity of work. Skills",
    "Skills": [
        "Qualifications, Experience, Knowledge & Skills:",
        "To become a head waiter/head waitress, an extensive experience as a waitress is required, as well as the qualifications below:",
        "Inspect table settings: Control table settings in order to ensure a correct table setup, including cutlery and glassware.\nCoach employees: Maintain and improve employees’ performance by coaching individuals or groups how to optimise specific methods, skills or abilities, using adapted coaching styles and methods. Tutor newly recruited employees and assist them in the learning.\nEnsure tableware is ready for use: Guarantee that plates, cutlery and glassware are clean, polished and in good condition.\nGreet guests: Welcome guests in a friendly manner in a certain place.\nSupervise the work of staff on different shifts: Oversee the activities of the employees working in shifts in order to ensure continuous operations.\nAdvise guests on menus : Offer recommendations to guests on meal and drink items available in a professional and friendly manner.\nManage health and safety standards: Oversee all personnel and processes to comply with health, safety and hygiene standards. Communicate and support alignment of these requirements with the company’s health and safety programmes.\nRecruit employees: Hire new employees by scoping the job role, advertising, performing interviews and selecting staff in line with company policy and legislation.\nAssist vip guests: Help VIP-guests with their personal orders and requests.\nAttend to detail regarding food and beverages: Perform great attention to all steps in the creation and the presentation of a qualitative product.\nMeasure guest feedback: Evaluate customer’s comments in order to find out whether customers feel satisfied or dissatisfied with the product or service.\nSupervise food quality: Oversee the quality and safety of food served to visitors and guest according to food standards.\nSchedule shifts: Plan staff time and shifts to reflect the demands of the principal.\nBrief staff on daily menu: Inform staff on changes to the menus to ensure they have a good understanding of the dishes, their ingredients and possible allergens.\nStore kitchen supplies: Keep delivered kitchen supplies for future use safely and hygienically according to guidelines.\nTrain employees: Lead and guide employees through a process in which they are taught the necessary skills for the perspective job.\nCheck dining room cleanliness: Control dining areas including their floor and wall surfaces, tables and serving stations and ensure appropriate cleanliness",
        " "
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Eastern European Countries; All Western European Countries; Russian Federation"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}