{
    "Job ID": "4740288",
    "Description": "Job briefWe are seeking a motivated Social Media Specialist to effectively engage with targeted virtual communities and network users.Our objective is to achieve exceptional customer engagement, foster intimacy, drive website traffic, and increase revenue through strategic utilization of the social media marketing roadmap.The ideal candidate should possess a comprehensive understanding of various social media platforms and how to optimize content for maximum engagement.As a representative of our brand, you will actively participate in relevant conversations, gently promoting our products/services while providing support to existing and potential customers.Your expertise in social media marketing will be essential in achieving our goals and establishing strong brand connections.ResponsibilitiesBuild and execute social media strategy through competitive research, platform determination, benchmarking, messaging and audience identification.\nGenerate, edit, publish and share daily content (original text, images, video or HTML) that builds meaningful connections and encourages community members to take action.\nSet up and optimize company pages within each platform to increase the visibility of company’s social content.\nModerate all user-generated content in line with the moderation policy for each community.\nCreate editorial calendars and syndication schedules.\nContinuously improve by capturing and analyzing the appropriate social data/metrics, insights and best practices, and then acting on the information\nCollaborate with other departments (customer relations, sales etc.) to manage reputation, identify key players and coordinate actions.Requirements and skillsProven working experience in social media marketing or as a Digital Media Specialist\nExcellent consulting, writing, editing (photo/video/text), presentation and communication skills.\nDemonstrable social networking experience and social analytics tools knowledge\nAdequate knowledge of web design, web development, CRO and SEO\nKnowledge of online marketing and good understanding of major marketing channels\nPositive attitude, detail and customer oriented with good multitasking and organizational ability.\nFluency in English\nE\nBS in Communications, Marketing, Business, New Media or any related.Skills",
    "Skills": [
        "Fluency in English"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}