{
    "Job ID": "4740971",
    "Description": "We are seeking an experienced and dynamic Accounts And Admin Officer to join our team. This role requires a self-starter with excellent communication and organizational skills. The successful candidate will be responsible for managing accounts and administrative tasks to support the management.Responsibilities:Process and record financial transactions including invoices, receipts, payments, and expenses.\nPrepare and submit regular financial reports to management and assist in the preparation of financial statements for audits and tax filings.\nProvide administrative support including managing calendars, scheduling appointments, and preparing reports.\nManage customer relationships by responding to inquiries, resolving issues, and providing exceptional customer service\nIdentify potential new clients and products in different countries, and develop business relationships with them.\nCoordinate with other departments & partners to ensure smooth communication and timely delivery of products and services\nMaintain accurate records and databases, and assist with data analysis and reportingSkills",
    "Skills": [
        "Bachelor's degree in Business Administration, Marketing, Finance, Accounting or related field\nProven experience in accounting and office administration\nExcellent communication, interpersonal, and customer service skills\nStrong organizational and time-management skills, with the ability to prioritize tasks and meet deadlines\nProficiency with Microsoft Office and other office software\nAbility to work independently and as part of a team.\nKnoweledge in Tally platform is preffered"
    ],
    "Preferred": {
        "Years of Experience": "Max: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "2"
    }
}