{
    "Job ID": "4740283",
    "Description": "Equipment Maintenance:Conduct regular inspections as per manual, maintenance, repairs of mechanical equipment and machinery to ensure proper functionality.\ndiagnose & Troubleshoot mechanical issues, identifying root causes and implementing effective solutions which will last.Preventive Maintenance:Develop and execute preventive maintenance schedules for machinery to minimize downtime and extend equipment lifespan.\nReplace worn-out components, lubricate parts, and perform calibration as needed periodically.Emergency Repairs:Prioritize critical repairs based on their impact on production and safety.\nRespond promptly to breakdowns and emergencies, collaborating with the maintenance and Operation team to restore operations swiftly.Equipment Optimization:Monitor equipment performance, analyze data, and make adjustments to optimize efficiency and reduce energy consumption.\nImplement modifications and upgrades to enhance equipment capabilities.Spare Parts Management:Maintain inventory of spare parts periodically and ensure availability for prompt repairs and replacements in coordination with operation and Procurement team.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Mechanical Engineering or related field.\nProven experience in industrial maintenance, preferably in operation and maintenance Sector.\nStrong knowledge of mechanical operational systems, machinery, and equipment.\nProficiency in diagnostic tools, mechanical testing equipment, and maintenance software.",
        "Skills:",
        "Problem-solving skills to diagnose and resolve mechanical issues effectively.\nExcellent analytical and critical thinking abilities.\nStrong communication and teamwork skills.\nAttention to detail and commitment to safety.\nAbility to work in a fast-paced, dynamic environment."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Mechanical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}