{
    "Job ID": "4740096",
    "Description": "The ideal candidate will be responsible for the planning and construction of civil engineering projects, will be closely monitoring site activities throughout the different phases of construction, inspecting the completed work, and signing everything off with your expert seal of approval. The ideal candidate must be approved at least G+1 by DM (Building Construction).Responsibilities:Supervise the site working activities including the subcontractors' scope.\nPrepare the whole project’s execution plan as well as the separate plans\nfor execution of the specific scope of works of the project.\nCooperate with the Project Manager to implement the site’s work program.\nMake sure that the site activities are as per the project’s schedule.\nPrepare and submit site daily, weekly, and monthly reports.\nAttending site management meetings.\nCarrying out regular inspections of the work to ensure the quality of it.\nEnsuring that the works’ quality level is matching the company’s standard and client’s requirements.\nRaising safety concerns at the appropriate level.\nEnsuring appropriate site rules and welfare facilities are in place.\nInspect project sites to monitor and manage construction professionals working.\nDevelop detailed structural designs using computer software such as AutoCAD and resolve any challenges that arise.\nScheduling and adjusting each stage of the project to meet time and budget targets.\nProvide appropriate plans for construction.\nMonitoring the provision of materials.\nliaising with and directing the work of sub-contractors employed on the project.\nDrafts and presents reports on topics related to projects such as environmental impact statements and right-of-way descriptions.\nCollaborates with architects and subcontractors to ensure projects progress properly.\nCollaborates with surveyors (or directs and participates in surveying) to establish installations or reference points, grades, elevations, and other factors that will affect construction.\nOn completion of a project, inspects, repairs, and maintains the structures as needed.\nProduces engineering documents by developing construction specifications, plans, and schedules.\nConfirms adherence to construction specifications and safety standards by monitoring project progress, inspecting construction sites, and verifying calculations and placements.\nCollaborate with management to align activities with desired business outcomes.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Civil Engineering.\n5+ years experience in UAE\nDM approved for G+1 execution\nProficient in computer-assisted design (CAD) such as AutoCAD, and Revit knowledge would be an advantage.\nProficient in using structural softwares such as Etabs, Prokon, SAFE, …etc.\nComprehensive understanding of building materials, methods, and tools.\nUnderstanding safety regulations for assigned projects.\nAbility to identify and solve complex problems.\nAbility to be both creative and analytical.\nExtremely detail-oriented and accurate.\nValid Driving License within UAE"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}