{
    "Job ID": "4740260",
    "Description": "About The RoleAs an adtech Presales Engineer, you will possess exceptional presentation, written and verbal skills. You will be familiar with adtech Security Product portfolio and have a technical understanding of the security use cases associated with the portfolio. You will have a deep understanding of security principles, architectures, and competitive products and security architectures and design.Job ResponsibilitiesYou will be responsible for a wide range of presales activities including:Product presentations and technical deep diving to prospects, customers and\npartners\nConducting and documenting successful PoCs and live demos\nAddressing RFI/RFP/RFQ responses accurately and in a timely manner\nKeeping a trusted advisor relationship with key customers and partners, meeting\nthem regularly and keeping them up to date with the latest product releases and\nnew features\nOpportunity analysis and support\nGathers and assesses customer needs, both business and technical.\nIdentifies related needs (lead generation, opportunity expansion).\nProduct presentations and technical sessions for prospects, customers and\npartners\nAddressing responses to customers’ requirements, RF(X)s\nDesign comprehensive security architectures based on customer requirements\nBuild and maintain a healthy, positive relationship with key customers and\npartners, meeting them regularly, and keep them up to date with the latest\nProduct releases and new featuresSkills",
    "Skills": [
        "Knowledge and Skills Required:",
        "Bachelor degree in Computer/Telecommunication Engineer (e.g. computer\nengineering/computer science).\n4+ years’ experience as a security presales, architect, analyst, consultant in the\nInformation Security market\nRobust knowledge of information security fundamentals, market analysis and\nproduct verticals (architectural design, technology, implementation)\nExcellent solution presentation skills\nApplies broad understanding of technical innovations &amp; trends to solving\ncustomer business problems",
        "Good knowledge of and relationship to the IT security market (vendor,",
        "distributors are desirable)",
        "Considered as a Plus:",
        "Existing experience skills with Juniper, Fortinet.\nCISSP, CISM, CEH, or CCSK certifications\nKnowledge with Networking Infrastructure solutions; switching, routing, wireless\n...etc."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Technical Maintenance & Repair",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}