{
    "Job ID": "4740077",
    "Description": "A leading consumer goods company in Jeddah, Saudi Arabia is seeking a highly motivated and experienced Modern Trade Sales Manager to join our team. The ideal candidate will have a minimum of 4 years of experience in sales, preferably in the consumer goods industry. The Modern Trade Sales Manager will be responsible for managing and growing our presence in the modern trade channel, including key accounts and distributors.Responsibilities:Develop and implement sales strategies and tactics to achieve sales targets and increase market share in the modern trade channel.\nBuild and maintain strong relationships with key accounts and distributors, ensuring customer satisfaction and loyalty.\nAnalyze market trends, identify opportunities, and develop innovative sales programs to drive growth.\nMonitor and analyze sales data and market intelligence to identify trends, opportunities, and challenges.\nLead and motivate a team of sales representatives, providing coaching and guidance to ensure high performance.\nCollaborate with cross-functional teams, including marketing, trade marketing, and supply chain, to ensure effective execution of sales strategies and programs.\nManage the budget for the modern trade channel, ensuring efficient allocation of resources.\nDevelop and maintain a deep understanding of the competitive landscape and industry trends.\nStay up-to-date with industry developments and best practices in modern trade sales.Skills",
    "Skills": [
        "Bachelor's degree in business administration, marketing, or a related field.\nMinimum of 4 years of experience in sales, preferably in the consumer goods industry.\nProven track record of success in managing and growing sales in the modern trade channel.\nStrong leadership skills and ability to motivate and inspire a team.\nExcellent communication and negotiation skills.\nAbility to analyze data and market trends to drive informed decision-making.\nStrong business acumen and understanding of the consumer goods industry.\nAbility to build and maintain strong relationships with key accounts and distributors.\nExperience in developing and implementing sales strategies and programs.\nFluency in English and Arabic."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 4",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}