{
    "Job ID": "4740159",
    "Description": "At ILLIYEEN, The High-End Retailer, we are looking for a passionate and professional Sales Associate to join our team at our new Display Center in UAE. As a Sales Associate, you will be responsible for providing exceptional customer service while upholding the standards and values of BYSL Global.Job Responsibilities:● Greet customers and assist them with their needs and preferences● Demonstrate product features and benefits, answer questions, and provide recommendations● Stay updated on product knowledge, sales promotions, store events, and Customer Loyalty Programs● Arrange and replenish merchandise displays, ensure proper labeling and pricing, and follow inventory control procedures● Process transactions, handle payments, balance cash registers and issue receipts● Handle customer complaints, requests, and returns in a polite and professional manner● Build rapport with customers and provide them with a memorable shopping experience● Keep the store neat, tidy, and organized at all times● Receiving and storing the delivery of large amounts of stock● Be involved in stock control and management● Reporting discrepancies and problems to the supervisor● Follow company policies and procedures, as well as health and safety regulations● Working within established guidelines, particularly with brands.● Be responsible for security within the store and being on the lookout for shoplifters' fraudulent credit cards etc.Skills",
    "Skills": [
        "You will also be expected to maintain the Display Center’s visual and service standards. To be successful as a Sales Associate, you should have excellent communication skills in both English and Arabic, a friendly and outgoing personality, and a keen interest in fashion and luxury. You should also be able to work well in a team, handle multiple tasks, and adapt to different situations. You should have previous experience in retail sales, preferably in the luxury sector.",
        "● Proven work experience as a Sales Associate, Retail Sales Associate, or similar role.",
        "● Excellent verbal and written communication skills in English and Arabic",
        "● Knowledge of POS systems, cash handling, and basic math skills",
        "● Strong interpersonal and customer service skills",
        "● Ability to work independently and as part of a team",
        "● Ability to work under pressure and remain open to changes",
        "● Flexibility to work various shifts, including weekends and holidays",
        "● In-depth understanding of the stories of Luxury Brands across the world",
        "● Understanding of the retail sales process",
        "● Familiarity with consumer behavior principles",
        "● Knowledge of inventory stocking procedures",
        "● Basic math and analytical skills",
        "● Track record of achieving sales quotas",
        "● Excellent communication skills, capable of building trusting relationships",
        "● Ability to adapt and perform in a fast-paced environments",
        "● Bachelor's degree in business, marketing, or a related field (preferred) or equivalent work experience.",
        "● At least 3 years of experience in the relevant field (Sales)",
        "● English and Arabic is preferred",
        "Compensation & other benefits:",
        "● Performance bonus",
        "● Festival bonuses",
        "● Competitive salary",
        "● Yearly salary review",
        "Urgent Joining Considerations: Candidates who will be ready to join by September 10, 2023, are highly encouraged to apply."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}