{
    "Job ID": "4740882",
    "Description": "TalPods is an apprenticeship program bridging fresh grads into prosperous software engineering careers. We do this by accelerating your skillset and productivity to Silicon Valley standards through structured on-the-job training and mentorship, while you execute for some of the fastest growing tech companies in the KSA and MENA region.As part of KSA’s digitization strategy, we are excited to be unlocking the potential of young talent in the tech industry. We are looking for bright junior software engineers who are hungry to grow and solve complex engineering problems. If you think this could be you, we want you to join us as a ‘TalPod Developer’! A ‘TalPod’ is a small, Agile team of exceptional engineers like you who will join one of our partnering companies to help them build awesome software.Why this is a unique opportunity for youOur participating companies where you will be placed are some of the fastest growing tech companies in the KSA and MENA region. You will get the chance to work with one of the hottest companies in the industry today, and quite possibly a unicorn of tomorrow!\nYou will be trained and mentored by top lead engineers who each have more than 8 years of industry experience, with the aim of transforming you into a world-class software engineer and paving your way for a prosperous future.\nThrough our structured on-the-job talent development framework, you will be accelerated to a mid-level engineer within 1 year, instead of a journey that typically takes 2-4 years in the industry.\nYou will be working in an Agile and challenging environment, surrounded by smart people that you will learn from and grow with.\nThe position is full-time and remote (compatible with KSA time).Key activities:Work and learn in agile teams to build production-ready applications, serving real business and consumer needs.\nYou will complete an intensive bootcamp training before joining one of our partnering companies to execute as a full time software engineer.\nYou will be paired up with a top lead engineer who will coach you through execution and enhance your productivity and knowledge every day.\nYou will be learning a variety of technologies and skills depending on the tech stack you will specialize in. Here is an example of MERN stack activities:\nWork and learn with AWS services and deploy using a serverless framework.\nDeploy through CI/CD workflows on AWS using Elastic Beanstalk, CodePipeline, and Git version control.\nFollow best practices in web security.\nDesign scalable systems using microservices.\nDesign and implement scalable front-end products using React, Vue.js, or Angular.\nBuild using HTML5, CSS3, Tailwind CSS, SASS, Bootstrap, JavaScript, Typescript.\nDevelop REST APIs with CRUD operations.\nUnit testing in all areas of development.\nDesign and build databases in SQL, NoSQL - DynamoDb / MongoDb.\nDevelop software using any of the popular backend programming languages and various software development architectures:- NodeJS - Express/Nextjs, PHP - Laravel, Python - Django/Flask, .NET core - C#, Java - Spring, Ruby on Rails\nAWS Lambda\nApply extreme programming techniques under the guidance of your team lead for maximum productivity.\nWork with other members of the team to improve yourself on a range of hard and soft skills.Requirements:Previous industry experience is not required. Candidates with up to 2 years of experience can apply\nStrong computer science background.\nSuperb communication and interpersonal skills.\nProblem solving skills.\nKnowledge of Algorithms and data structures.\nKnowledge of Object Oriented Programming.\nKnowledge of Linux / Windows command line interfaces.\nUnderstanding of Web technologies HTML, CSS, JavaScript\nKnowledge and fundamentals of any of the following programming languages Javascript, C, C++, Python, PHP, Ruby, GoLang, Java, C#, .NET, Objective C\nAble to showcase some projects completed at least for learning purposes or a real application.\nA good GitHub profile.\nFaster and strong learning skills.\nBasic understanding of Internet based business models and companiesBig Plus if:Completed a Coding bootcamp and implemented some projects.\nWorked / interned with companies developing real world projects.Compensation:You will receive a stipend of SAR 3,000 per month during the 3-month bootcamp period. Thereafter, your salary will be between SAR 5,000 to 8,000 per month depending on your region and the company that you will be placed with. Our aim is to provide you with excellent earning potential and an exceptional path to growth.Skills",
    "Skills": [
        "Technical Skills:",
        "Programming Languages: Java, JavaScript, TypeScript, C++, C#, .NET, Python, PHP, Ruby\nWeb Development: HTML, CSS3, Tailwind CSS, Bootstrap\nWeb Frameworks: Ruby on Rails, Spring, NodeJS, Express/NextJS, Laravel, Django, Flask\nFrontend Frameworks: Angular, VueJS, ReactJS\nCloud Computing: AWS (Amazon Web Services)\nDatabases: SQL, NoSQL, MongoDB, DynamoDB\nObject-Oriented Programming (OOP)\nRestAPIs and Microservices Architecture\nVersion Control: GIT",
        "Additional Skills:",
        "Linux and Windows Command Line\nCSS and Styling Techniques"
    ],
    "Preferred": {
        "Career Level": "Fresh Graduate",
        "Years of Experience": "Min: 0 Max: 2",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Albaha, Saudi Arabia",
        "Company Industry": "Software Development",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "25"
    }
}