{
    "Job ID": "4740040",
    "Description": "We are seeking a Senior React Native Mobile Applications Developer to join our dynamic development team.As a Senior React Native Developer, you will be responsible for designing and building high-performance, innovative, and user-friendly mobile applications using React Native.Your primary focus will be on developing cross-platform mobile apps.Responsibilities:Collaborate with the product management and design teams to understand requirements and translate them into technical specifications.\nDevelop new mobile applications using React Native.\nDevelop new features and improve existing functionalities of the mobile applications.\nWrite clean, maintainable, and efficient code using React Native best practices.\nParticipate in code reviews to ensure the quality and performance of the applications.\nOptimize mobile applications for maximum performance and scalability.\nTroubleshoot and debug issues, fix bugs, and improve application performance.\nStay up to date with the latest industry trends and technologies related to React Native development.Skills",
    "Skills": [
        "A minimum of 3 years experience in developing mobile applications using React Native.\nStrong understanding of mobile app development concepts, including UI/UX principles, asynchronous programming, and API integration.\nFamiliarity with RESTful APIs and GraphQL.\nKnowledge of state management libraries (e.g., Redux, MobX) and their usage in React Native applications.\nExperience with version control systems (e.g., Git).\nAbility to write clean, maintainable, and reusable code.\nExcellent problem-solving and debugging skills.\nStrong communication and teamwork abilities.\nBachelor’s degree in computer science, Engineering, or a related field (preferred but not required).",
        "Additional Skills (Nice to Have):",
        "Experience with native mobile app development (iOS or Android).\nKnowledge of native app development languages (Objective-C, Swift, Java, Kotlin).\nFamiliarity with automated testing frameworks (e.g., Jest, Detox).\nExperience with continuous integration and deployment (CI/CD) processes.\nKnowledge of backend technologies (e.g., Node.js, Express.js, MongoDB).",
        "If you have the expertise developing mobile application using React Native, kindly apply."
    ],
    "Preferred": {
        "Residence Location": "Lebanon"
    },
    "Data": {
        "Job Location": "Jbail, Lebanon",
        "Company Industry": "Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}