{
    "Job ID": "4740279",
    "Description": "تخطيط وتنظيم وتوجيه وإدارة كافة الادارات والتصنيع والصيانة، والاستخدام الفعّال للقوى العاملة والمعدات والمرافق والمواد بما يحقق أهداف الشركة، والعمل على ضمان معايير المنتجات من خلال تنفيذ استراتيجيات التصنيع وخطط العمل، والعمل على تخفيض التكاليف حسب الحاجة، مع ضرورة استخدام التقنيات الحديثة والجديدة وتدريب العمال عليها، والمساهمة بتحسين المنتج باستمرار بما يحقق مصالح وأهداف الشركة.\n1- تخطيط وتنظيم وتوجيه عملية التصدير والتصنيع والصيانة التي تضمن معظم العائد الفعلي على الموجودات.\n2- إعداد خطط المبادرة والعمليات التي تقلل من تكاليف التصنيع وتسهم في تحقيق مصالح الشركة.\n3- الاستخدام الفعال للقوى العاملة، والمعدات، والمرافق، والمواد، بما يحقق العائد المخطط له.\n4- تحقيق الأهداف والجداول الزمنية للإنتاج والتصدير مع ضمان معايير المنتجات التي من شأنها أن تتجاوز توقعات العملاء.\n5- العمل على خفض التكاليف حسب الحاجة وبما لا يضر بمصالح وأهداف الشركة.\n6- العمل على استخدام التقنيات المتطورة بما يخدم العمل والمنتج.\n7- العمل على تحسين استخدام اليد العاملة داخل المصنع، والعمل على إبقاءها مستقرة بما يحقق العائد المطلوب لتحقيق مصالح الشركة.\n8- العمل على إرساء ممارسات الإدارة في كل أركان المصنع.\n9- العمل على منح الثقة للعاملين ومشاركتهم في عمليات البناء والعمل والانتاج.\n10- الحفاظ على المهارات الفردية وتشجيعها والعمل على تطويرها وتنميتها.\n11- العلم التام بمتطلبات العملاء والزبائن عن طريق مديرية التسويق التابعة للمجموعة.\n12- الإشراف على المعدات والأجهزة باستمرار للعمل على رفع القدرة الإنتاجية للمصنع، ووضع خطط متطورة لزيادة الإنتاج وفق معايير الجودة.\n13- الموافقة على طلبات الشراء قبل رفعها للمدير العام.\n14- رفع التقارير ووضع الخطط بالتعاون مع فريق العمل في المصنع.\n15- الإشراف الفني والإداري على المرؤوسين، ومتابعة تقييم أدائهم وإنجازاتهم، والاطلاع على مقترحات البرامج التدريبية الكفيلة برفع مستوى معارفهم وتنمية قدراتهم.\n16- التأكيد على تطبيق وتطوير إجراءات السلامة والصحة المهنية وتأمين مستلزماتها واعتماد خطط الإنقاذ والإخلاء والإسعافات الأولية بالتعاون مع إدارة الجودة والسلامة والصحة المهنية.\n17- تحديد حجم العمل والعمالة، وتحديد الاحتياجات من المعدات والموارد البشرية اللازمة، والتنبؤ بالاحتياجات المستقبلية.\n18- اعتماد خطط وبرامج الإنتاج، والتأكد من مطابقة المنتج للمواصفات القياسية العالمية.\n19- التنسيق مع الإدارات المعنية لتأمين المواد الأولية.\n20- اعتماد الاحتياجات التدريبية اللازمة للعاملين بالمصنع.\n21- الاشراف على تأهيل خط الانتاج، والتأكد من ثباتية مواصفة المنتج الجاهز.\n22- اعتماد خطة العمل الدورية من المخازن لتحديد الكميات المطلوبة من المواد الأولية.\n23- التأكيد على فحص المواد الأولية المستلمة، والتأكد مطابقتها للمواصفات.\n24- إعداد التقارير، ورفعها إلى الإدارة العليا.\n25- استلام التقارير الأسبوعية من كافة مديريات وأقسام المصنع، ومناقشتها معهم، وإعطاء التعليمات والأوامر والتوجيهات المناسبة والتي تضمن حسن سير العمل في المصنع.\n26- استلام الخطط الشهرية من كل مديريات وأقسام المصنع، وإعطاء التعليمات والأوامر والتوجيهات المناسبة والتي تضمن حسن سير العمل في المصنع.Skills",
    "Skills": [
        "اللغه التركيه جيد جدا شرط اساسى\nالمهــارات:\n1- صياغة و تحديد الأهداف.\n2- التخطيط الفعال.\n3- الدراية الواسعة بقوانين العمل.\n4- اتخاذ القرارات بناءً على الحقائق.\n5- التعامل الجيد مع برامج الحاسب الآلي والأجهزة المكتبية.\n6- مهارات القيادة و الإدارة بشكل عالي.\n7- القدرة على تحمل ضغط العمل.\n8- مهارات الاتصال و التواصل مع الأخرين.\n9- مهارات التنسيق و توزيع الأعباء.\n10- مهارات التنبؤ و قوة الملاحظة.\n11- مهارات التفاوض في مجالات العمل.\n12- العمل ضمن فريق.\n13- القدرة على الإبداع وتنمية المهارات.\nالخــبرات:\nاللغه التركيه جيد جدا شرط اساسى\nيجب أن لا تقل الخبرة عن 5سنوات.\nاللـغــات:\n- اللغة العربية بطلاقة تحدثاً وكتابة.\n- اللغة الإنجليزية جيد جداً تحدثاً وكتابة.\nاللغه التركيه جيد جدا شرط اساسى"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}