{
    "Job ID": "4740277",
    "Description": "We’re seeking a qualified sales representative to help sell the products and services that our customers rely on. The sales representative will have a strong understanding of the sales process and excel at generating leads, building relationships, and closing deals. The ideal candidate will be a quick learner who has strong negotiating skills and an ability to showcase our offerings in a compelling way.Responsibilities• Present, promote and sell products/services using solid arguments to existing and prospective customers• Perform cost-benefit and needs analysis of existing/potential customers to meet their needs• Develop and maintain positive business and customer relationships• Reach out to customer leads• Expedite the resolution of customer problems and complaints to maximize satisfaction• Achieve agreed upon sales targets and outcomes within schedule• Coordinate sales effort with team members and other departments• Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.• Keep abreast of best practices and promotional trends• Continuously improve through feedbackCandidate must own a carSkills",
    "Skills": [
        "Understanding of the sales process and dynamics.\nProven track record of maintaining professional ethics through the portrayal of exemplary soft skills.\nApproaching new and existing customers by following optimum consumer service standards.\nTremendous enthusiasm to efficiently achieve sales goals under tight deadlines.\nApt in dealing with clients and engagingly presenting product data for potential leads.\nDemonstrated ability to forge long-lasting work relationships by leveraging information, tactics, and excellent communication."
    ],
    "Preferred": {
        "Residence Location": "Amman, Jordan"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}