{
    "Job ID": "4740021",
    "Description": "POSITION OBJECTIVE This position is dedicated in supporting NEI’s production efficiency and in improving the product quality and generating revenues. KEY RESPONSIBILITIES  ·   Responsible of calculating and organizing the data for Technical Data sheet of the Air Handling units in accordance with the equipment schedule / Client requirements.·   Responsible of regular visits to consultants, contractors and clients to brand Nehmeh as Eurovent certified.·   Responsible of preparing the specifications and operating instructions for processing equipment.·   Responsible of developing the specification of the materials and communicating to the suppliers for the same in order to find the right products.·   Responsible of preparing the process flow diagrams to define heat and material balance.·   Responsible of supporting the sales team with technical knowledge of AHU/FCU to increase the current sales.·   Responsible of developing the vendor document requirement for the technical submittal of the projects.·   Responsible of ensuring conformance to applicable government regulations, engineering codes and standards as well as quality assurance system, policies and procedures.·   Responsible of preparing the identification and submittal of scope changes and deviations and to provide your manager for review.·   Responsible of providing engineering support by answering technical questions and requests.·   Responsible of performing work in a safe manner and follow all safety guidelines and procedures.·   Responsible of participating in general process improvements and initiatives.·   Responsible of following any other tasks / projects that are assigned by your manager.·   Responsible to following all the processes and policies of the company and be aligned to the departmental SOPs at all times.Skills",
    "Skills": [
        "JOB SPECIFICATION",
        " ",
        " ",
        "Qualification: Bachelor's Degree in Engineering.",
        " ",
        "Experience:",
        "·         3 to 4 years of design engineering experience in heat transfer solutions.",
        "·         Should have comprehensive understanding of principles, theories, concepts, industry practices and standards and their application.",
        "·         Knowledge on engineering drawings, blueprints and understand complex technical writing.",
        "·         Strong Written and verbal communication skills.",
        "·         Keen attention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Max: 6"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}