{
    "Job ID": "4740017",
    "Description": "Work closely with CS Team, commercial team, import team , Transportation team , export team and Shipping Services Suppliers to support smooth and efficient operations.\nCollaborate with internal departments, such as logistics and finance, to ensure timely and efficient delivery of products to customer.\nMonitoring daily opened orders, working with our internal teams, fulfillment providers, and shipping carriers to quickly resolve delivery exceptions and deliver orders on time.\nSupport & collaborate between Supply Chain, Customer Service, Internal Logistic sand Shipping Carriers .\nCoordinate and track movement of goods through logistic pathways.\nExecute logistics daily & monthly plan to move products and packages to reach destinations on schedule.\nSupport in customer enquiries and returns providing support with shipping, in case of any delays or courier service errors, lodging investigations with courier services in case of loss, ensuring returns terms and conditions are observed.\nProactively identify operational problems, suggest solutions, and independently resolve issues.\nPerforms other related duties as assigned.Skills",
    "Skills": [
        "Bachelor's degree in Bachelor's Degree in Logistics and Supply Chain Management is must\nFluency in English is a must .\nMales only.\nUnderstand and interpret a variety of instructions furnished in written, oral, diagram, or schedule form.\nGive full attention to what other people are saying, take time to understand the points being made, ask questions as appropriate, and not interrupt at inappropriate times.\nCommunicate information and ideas clearly and concisely, in written and orally.\nPossess high energy, initiative, resilience, work ethic, stamina, and unquestionable integrity to perform consistently and at a high level in a very demanding environment.\nEstablish and maintain effective working relationships with executive staff and with other stakeholders.\nQuickly adapt as requirements/tasks change.",
        " Able to work under critical time deadlines and pressures. ",
        " ",
        "Working Conditions ",
        "Work will be conducted from Hela Factory office as stated in the employment contract. Some meetings might be held at other locations; depending on the resource’s role in this meeting his/her presence in such locations will be required accordingly. Standard departmental working hours are from 9:00 till 17:00, nonetheless flexibility in resource’s presence at the office will be subjected to the nature of tasks. Standard departmental weekends are Friday and Saturday, however the need to be available on such days might occur for some tasks.",
        "  Benefits found in job :",
        "Medical insurance and social insurance\nAnnual Bonus"
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 3 Max: 5",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amreya, Alexandria , Egypt",
        "Company Industry": "Shipping",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}