{
    "Job ID": "4740047",
    "Description": "Job descriptionEPIC Consulting is seeking a Quality, Health, Safety, and Environment (QHSE) Consultant with experience working with consultancy or certification body.QHSE Consultant major responsibility is to develop EPIC Consulting client’s system on ISO 9001, ISO 14001, ISO 45001 and provide training on ISO 9001, ISO 14001, ISO 45001 standards and other safety topics.Key Duties & Responsibilities: Develop and implement ISO 9001, ISO 14001, ISO 45001 standards for EPIC Clients in Kingdom of Saudi Arabia and implement good industry practice.·       Ensure that while providing consultancy EPIC clients get certification on time.·       Prepare the company’s manual control and supervise all amendments and revisions.·       Conduct audits to evaluate the effectiveness of systems and procedures and participate in improving and developing quality practices.·       Conduct QHSE training courses. For example, ISO 9001, ISO 14001, ISO 45001 Lead Auditor, Fire Safety, First Aid, IOSH, OSHA 30 hours etc.·       Conduct regular risk assessments.·       Conduct certification audit as per certification body requirements.Skills",
    "Skills": [
        "Key Requirements",
        "·       Handson experience for developing or auditing ISO 9001, ISO 14001, ISO 45001 system.",
        "·       Experience in providing QHSE Trainings",
        "·       Must maintain confidentiality and trustworthiness and be able to generate a robust safety culture.",
        "·       Willing to travel all over Saudi Arabia for projects.",
        "·       Excellent English and Arabic speaking , Reading, and writing skills",
        "Qualifications",
        "·       BSc. (Hons) or equivalent ",
        "·       NEBOSH National Diploma in Occupational Health and Safety or NEBOSH IGC",
        "·       Lead Auditor certificates ISO 9001, ISO 14001, and ISO 45001",
        "·       Experience in auditing is an add advantage.",
        "Skills and Abilities",
        "·       Strong leadership skills to constantly drive safety and quality improvements.",
        "·       Excellent problem-solving, analytical, and critical thinking skills.",
        "·       Team-oriented with a positive outlook.",
        "·       Strong Interpersonal skills - Able to communicate clearly with all staff levels and other stakeholders and explain technical concepts in simple terms.",
        "·       Accountability – Takes initiative and ownership of responsibilities.",
        "·       Time Management & Organization Skills - Able to prioritize and delegate tasks.",
        "·       Data record management."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Management Consulting",
        "Company Type": "Unspecified",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}