{
    "Job ID": "4740991",
    "Description": "Experience in Automation of Functional and Integration Testing using – Selenium Web Driver, SOAP UI, Postman, Para soft, etc\nExperience in testing in Banking/Finance Domain (Commercial Banking/Fin Tech Domain, Investments)\nHands-on experience in managing teams and performing lead activities and coordination\nStrong Experience in Functional Automation Testing, API Automation and Mobile Automation\nStrategically design and build the Test Automation platform encompassing framework, tools, and accelerators\nHands on experience in working in a Continuous Testing and DevOps environment\nGood understanding of DB queries & Procedures\nPlanning and development of quality test design and test cases that meet test objectives\nDemonstrate experience working in a test team environment whilst maintaining focus and achieving outcomes and meeting deadlines.\nProven ability to communicate effectively\nPlanning and development of quality test design and test cases that meet test objectivesSkills",
    "Skills": [
        "Work with your team members (Onsite & remote), developers across multiple Teams\nLead and automate – functional, integration and E2E Test suite\nDesign and implement test strategy for the business platforms.\nWork with team to share knowledge and Learnings\nManaging testing resources and delivery both in person and interstate.\nReview of test cases/test scenarios and test results\nParticipate and provide knowledge on Test Estimation models and best practices.\nTest environment readiness & verification\nPerform test closure activities\nThorough analysis of test requirements and test cases use structured techniques to identify those suitable for automation\nCreate test automation frameworks to ensure stability, efficiency and scalability in the automated solution Review automated test scripts and code to ensure alignment with standards Execute tests and analyse test results to differentiate issues with the AUT from automation issues\nReview maintenance work to automation packs to ensure that test scripts are in line with the current version of the AUT"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 12"
    },
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}