{
    "Job ID": "4741171",
    "Description": "• Schedule appointments, maintain calendars, plan meetings (onsite and offsite), make travel arrangements, and coordinate related activities to ensure smooth and uninterrupted business.• Coordinate with the Sales Team to ensure all orders are done.• Preparing sales order, Purchase Order etc.• Assist in servicing existing and new accounts with various day to day tasks that are needed to effectively handle the business, including:o Receive and input quotes or orders into the system, confirming that quantities and pricing are accurate. Orders will be received via phone, email or other lead sources.o Maintain a follow-up process with sales manager on orders and other steps to ensure upkeep of accounts for optimal sales levels.o Track all orders that are pending, working with logistics to make sure that the bookings are made and keep a timeline of the process.o Create files and keep track of all customer paperwork, taking direction from the sales manager on specific requirements.• Prepare reports and other documents requested by customers.• Clearly communicate all business-related tasks with colleagues, clients and third parties in a professional and courteous manner.• Handle incoming calls on behalf of the company and sales team, pulling in team members as needed.• Invoicing of sales orders.• Coordinate with the Finance team and Logistics.• Update the CRM with customer notes, pricing, and other items as requested.• Be customer facing as necessary to answer questions and provide updates. This will include giving information on product specs, shipping dates, anticipated delays and additional information required.• Work on multiple projects for multiple accounts at the same time, handling each accurately and in a timely manner.Skills",
    "Skills": [
        "Bachelor’s degree required.",
        "• Fluent in English, a second language is a plus.",
        "• A minimum of 3-4 years of sales coordination experience in the FMCG sector is preferred.",
        "• Extensive excel experience necessary. Able to create charts and work with formulas.",
        "• Demonstrates urgency as well as being a self-starter, approaches tasks in an enthusiastic manner asking for more when completed.",
        "• Must be a team player, know the importance of the bigger picture.",
        "• Adaptable to change in a fast-paced organization.",
        "• Excellent written and verbal communication skills.",
        "• CRM experience preferred."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}