{
    "Job ID": "4741916",
    "Description": "Job descriptionWe are seeking a highly motivated and results-driven sales & operational executive to join our team. As a sales Representative, you will be responsible for actively contacting potential customers over the phone, face to face meetings and social media platforms to promote and sell our services.Responsibilities:Developing and implementing strategic sales plans to achieve company sales targets and objectives.Identifying new business opportunities and potential clients/customers through social media.Building and maintaining strong relationships with existing clients/customers.Conducting market research and analysis to identify customer needs, preferences, and trends.Creating and delivering sales presentations and proposals to potential clients/customers.Negotiating contracts, pricing, and terms of agreements with clients/customers.Monitoring sales performance and providing regular reports and updates to the management team.Collaborating with other departments (such as marketing, product development, and customer service) to ensure a cohesive approach to sales activities.Proposal Follow upsOverseeing day-to-day operational activities to ensure smooth business operations.Recovery follow up through calls.Customer Feedback and analysis the date.Coordination with GM office and Sales TeamSkills",
    "Skills": [
        "Experience in sales or a similar sales role.\nExcellent communication and interpersonal skills.\nPersuasive and confident with the ability to build rapport with customers.\nStrong negotiation and objection-handling abilities.\nGoal-oriented mindset with a drive to succeed and exceed targets.\nGood organizational and time management skills.\nPositive attitude, self-motivated, and a team player.\nGender: Female only (Any Nationality)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Management Consulting",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}