{
    "Job ID": "4741895",
    "Description": "Handle the official company page on social media platforms like Facebook, Instagram, LinkedIn, and Twitter to generate leads and entice the target audience.\nIndulge in research and creation of engaging content for publishing on different online channels.\nPlan a comprehensive social media strategy for improving the outreach of the organization.\nEvaluate the outcome of online campaigns through real-time metrics and relevant tools.\nUse SEO analysis tools and software to track customer satisfaction, engagement, and ROI, suggesting appropriate optimization.\nScan and research relevant changes in the Google algorithm for modifying SEO and social media marketing.\nCreate engaging and innovative content, including graphics, videos, and blog posts.\nRespond to comments, messages, and customer queries promptly and professionally.\nHold the know how to create content calendar, daily posting plan, Reels, photography and videography, and coverage.Skills",
    "Skills": [
        "Enthusiastic professional with a keen understanding of social media evaluation metrics using relevant online software and tools.\nProven work experience in content planning on social media platforms for professional firms.\nFamiliarity with recent digital marketing trends and the best SEO practices.\nAdept in publishing social media captions, articles, blogs, and other online resources.\nAbility to effectively communicate information and ideas in written and verbal format.\nAdept at understanding market trends, consumer requirements, and company capabilities to plan customer-centric online campaigns.\nExceptional written and verbal communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Qatar",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}