{
    "Job ID": "4741893",
    "Description": "Company Description:Ferrari Bridge Flowers is a highly reputed online flower shop, offering attractive hand-crafted flower delivery in Doha, Qatar, designed using a variety of top-quality fresh cut flowers sourced from around the world. we believe in enhancing the beauty of flowers through mesmerizing floral arrangements that breathe life into your room and add more class to the overall ambience.Job Title:HR ExecutiveReporting to:General ManagerSummary:We are seeking a highly organized and proactive HR Executive to join our company in Qatar. The HR Executive will play a crucial role in managing and enhancing our human resources functions, ensuring a positive work environment, and supporting the growth and development of our team. If you are a dedicated professional with a passion for both HR and the floral industry, we invite you to join our team and contribute to the success of our company.Responsibilities:1. Recruitment and Onboarding:- Collaborate with department managers to identify staffing needs and create job descriptions.- Source, screen, and interview candidates to build a talented and diverse workforce.- Facilitate the onboarding process for new hires, ensuring a smooth transition into the company.2. Employee Relations:- Act as a point of contact for employee inquiries, concerns, and conflict resolution.- Foster a positive and inclusive work environment by promoting open communication and teamwork.- Address employee relations issues in accordance with company policies and relevant labor laws.3. Performance Management:- Assist in the development and implementation of performance appraisal processes.- Provide guidance to managers on setting performance goals and conducting performance reviews.- Support employee development by identifying training and growth opportunities.4. HR Policies and Compliance:- Stay up-to-date with labor laws and regulations in Qatar to ensure HR practices are compliant.- Develop, update, and communicate HR policies and procedures to employees.- Ensure accurate maintenance of employee records and confidential information.5. Benefits and Compensation:- Administer employee benefits programs, including health insurance, leave, and other perks.- Support the management of payroll processes and collaborate with finance as needed.6. Employee Engagement:- Organize and participate in employee engagement activities and events.- Seek opportunities to enhance employee satisfaction and well-being within the workplace.7. HR Reporting:- Generate HR reports related to recruitment, employee turnover, training, and other relevant metrics.- Utilize data to provide insights and recommendations for continuous improvement.Skills",
    "Skills": [
        "Excellent verbal and written communication skills.\nFamiliarity with Qatar's labor laws and regulations\n-Strong organizational and time-management abilities.\n- High level of discretion when handling confidential information.\nDemonstrates a strong ability to solve problems and achieve desired outcomes.\nEffective communicator with excellent verbal and written skills.\nProficiency in using HR-related software and tools, including Microsoft Office suite."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 4",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Plants & Gardening Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}