{
    "Job ID": "4741128",
    "Description": "DXhero is a startup company that specializes in providing DevOps solutions to companies in the Middle East, North Africa, and Turkey region. We are Datadog's gold partner, working closely with the Datadog team to provide APM, ASM, RUM, Infra monitoring, and log management services to software developer teams, helping them to create higher-quality software in a more efficient way, thereby enhancing corporate competitiveness.The job:1. Provide Datadog's consultant, implementation, training, and client technical support to businesses2. Work 4-6 hours every day, with flexible working hours3. Full-remote4. Require video calls with clientsWe hope you are:1. With at least three years of DevOps experience2. Able to communicate orally in English3. Possessing good self-management skills4. Committed to doing things wellSkills",
    "Skills": [
        "Our company promotes remote work, allowing everyone to save on commuting time, spend more time with family, and provide additional work opportunities for those who need to stay at home. We also embrace diversity, hoping that there will be different cultures and ideas within the team. Besides having a multinational team, our clients are also spread across various countries, allowing team members to learn different cultures and ways of thinking in addition to their work.",
        "We are a startup company and cannot offer great package at the moment, but it's an excellent learning platform, and the team spirit is great. We welcome you if you love technology and are willing to help others to join our team and grow together.",
        "If you have the following qualities, you are a great fit for us:",
        "1. Love technology and are willing to help others",
        "2. Tired of big cities",
        "3. Interested in learning about startups",
        "4. Want to connect with the world"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "All Arab Countries; All Eastern European Countries; All GCC Countries; Croatia (Hrvatska); Jordan; Lebanon; Türkiye; Ukraine"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}