{
    "Job ID": "4741852",
    "Description": "Arabic Speaker OnlyScope:Knight Frank Middle East is looking to recruit an enthusiastic and hardworking Recruiter into its HR team. The Recruiter will assist on the development of recruitment strategy and implementation of best practices & processes for Residential, Commercial and Business Services roles at Knight Frank Middle East (with the focus on UAE and KSA).Responsibilities:Processes and Compensation:Advice recruitment strategies, processes, and recommend recruitment agencies needed for recruitment support.\nRecommend appropriate selection tools to all Service Lines Heads for the end-to-end recruitment process.\nLiaise with the Head of HR to advice on competitive compensation.Planning:Support the Head of HR in standardisation of recruitment policies & procedures, developing recruitment plans and collaborating with Service Line Heads in delivering high quality talent. The Recruiter works collaboratively with colleagues within HR to ensure attracting and retaining talent.\nUpdate and present the in-house recruitment tracker including development and management of the complete lifecycle of recruitment process, advertising, sourcing and assessment, hiring best practices, and effective attraction.\nCentralise the recruitment process for all service lines using the standard tools and documentation. \nFocus on diversity and collaborate with Service Line Heads.\nSupport Head of HR in developing strategy to enhance candidate and line manager’s hiring experience using surveys and feedback tools. \nWork with Service Line Heads on updating job descriptions.Recruitment:Conduct interviews, arrange for assessment centres and share feedback with hiring managers advising on the suitability of candidature.\nArrange interviews for candidates with hiring managers and seek and document comprehensive feedback on interviewed candidates from the hiring managers and / or selection panel.\nArrange for relevant approvals at various stages of the recruitment process.\nManage end-to-end candidate communication including the issuing and acceptance of the employment contract and / or application regret.\nLiaise with Service Line Heads on recruitment matters, local and overseas.\nMaintain measurable data to support the Head on HR in critically evaluating recruitment process & timeline effectiveness, time-to-fill, cost per hire etc.\nCritically analyze data and advice the Head of HR in building into future recruitment strategies accordingly.Networking:Make effective use of social media, advertising methods to develop impactful employer branding and Values and Behaviours.\nAlign all recruitment activities to the future Recruitment system.Skills",
    "Skills": [
        "Particular Aptitudes/Skills Required:",
        "Relevant university degree.\n2+ years of recruitment experience, preferably with a property development or consultancy background, and ideally have knowledge of the local markets in GCC.\nGood interpersonal & communications skills for both written and oral presentations.\nClear and logical thinker with well-developed report writing skills.\nThe ability to understand and make use of computers and information technology (KF Internal Systems).\nStrong team player with the ability to build relationships.\nFlexible attitude towards travelling.\nLanguage skills: Arabic and English fluency crucial."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 9",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Recruitment & Employee Placement Agency; Human Resources Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}