{
    "Job ID": "4741179",
    "Description": "Real Estate Agent - DubaiIf you are a dynamic and results-driven Realtor with a passion for real estate and a desire to thrive in a fast-paced industry, we would love to hear from you!We require a candidate who can demonstrate a determination to succeed, with a strong passion to work for the Real Estate Industry, with a good understanding of the Dubai's Real Estate Market. What do we provide? • Employment visa, as per the UAE law • Commission Based - Full Time • Own Marketing team to generate fresh leads • We offer a rewarding career and window of opportunities enriched with learning experiences• AWESOME work culture! • Generous commission pay structure with unlimited earning potential• Career growth and personal developmentResponsibilities:• Facilitate negotiations between buyers and sellers. • Develop and implement strategic sales plans to achieve company targets and objectives.• Identify new business opportunities and foster strong relationships with potential clients.• Monitor market trends and competitor activities to stay ahead in the real estate market.• Provide exceptional customer service and maintain a deep knowledge of our property portfolio.• Finding, scouting and identifying investors with property consultancy needs. • Keeping in touch with clients via calls, WhatsApp and emails. • Attending launching ceremonies organized by developers, taking briefing and training from property portal professionals, participating in training sessions organized by our company.• Carrying out thorough research and analysis of the real estate and/or property market to identify areas with increasing demand and profitability. • Ensure that company standards, protocols and procedures are well implemented. • Contacting leads and cold calling• Establishing a local network of clients• Source available properties for viewing according to the requirements• Secure viewings and act as the “to go for the clients” • Manage the intermediate negotiations process required.  Real Estate Experience: 5 years (Mandatory) in DUBAI ! (Preferred)Language: candidates have to speak fluent english and be from the nationalities mentioned: Scotland, United Kingdom, Ireland, and Italian.Skills",
    "Skills": [
        "We’re currently looking for a Real Estate Agent to join our growing team. The perfect candidate would be a senior Realtor with a minimum of 5 years real estate experience in Dubai focused on selling OFF-PLAN projects with a proven track record in Real Estate Sales. ",
        "• Proven track record of success in real estate sales with a minimum of 1 year of experience in Real Estate sales management.",
        "• Excellent communication and negotiation skills to close deals and maintain client relationships.",
        "• Knowledge of Dubai's real estate market and the latest industry trends.",
        "• Strong leadership abilities to mentor and motivate the sales team effectively.",
        "• RERA Certification is an advantage. ",
        "• Expertise and proven sales/leasing record.",
        "• English speaking skills, and any other language is a plus.",
        "• Neat attire and attractive personality.",
        "• Punctuality and Discipline .",
        "• Excellent interpersonal and communication skills.",
        "• Strong sales and negotiating ability. ",
        "• Experienced in Real Estate Market ",
        "• Familiar with the latest market trends",
        "• Understanding the exact needs and requirements of the clients "
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "European Union; Ireland; Italy; United Kingdom; United States",
        "Age": "Max: 36"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}