{
    "Job ID": "4741967",
    "Description": "Are you passionate about driving growth, fostering strategic partnerships, and shaping the success of innovative businesses? If so, Next Inn Technologies has a thrilling opportunity for you to join our team as a Business Development Officer!🏢 Company: Next Inn Technologies📌 Location: Lahore, PakistanAbout us:Next Inn is a full-service digital marketing agency that delivers big brand expertise to growing companies and savvy start-ups. Our strategies are influenced by real feedback from your customers; think the Lean Start-up Method meets Digital Marketing. Next Inn Technologies grows your business online through a truly collaborative partnership. We are not another vendor or service provider, Next Inn is an extension of your team.Position: Business Development OfficerType: Full-TimeWorking Hours: 9:00 PM - 5:00 AM (Monday to Saturday) Night shiftResponsibilities:Identifying and pursuing new business opportunities that align with our service offerings and values.\nBuilding and nurturing strong relationships with potential clients, understanding their needs, and tailoring our solutions to meet their specific goals.\nCollaborating closely with our cross-functional teams to develop strategic proposals and presentations.\nConducting market research to stay updated on industry trends and competitive landscapes.\nRepresenting Next Inn Technologies at networking events, conferences, and industry gatherings.Skills",
    "Skills": [
        "What we are looking for:",
        "Proven experience in business development, sales, or related roles.\nExcellent communication and interpersonal skills.\nStrong negotiation and persuasion abilities.\nAbility to work independently and as part of a team.\nFamiliarity with digital marketing concepts is a plus."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1",
        "Residence Location": "Pakistan"
    },
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "1"
    }
}