{
    "Job ID": "4741028",
    "Description": "Performs maintenance and repairs on camp facilities including plumbing, painting, carpentry, cleaning, and electrical duties.\nEmploys and supervises staff.\nMakes arrangements for disposal of garbage.\nAssumes responsibility for checking in and out camp grounds and non-camp groups and maintenance of records.\nInspects all facilities and collects breakage fees.\nSupervises and orients camp counselors.\nAssumes responsibility for maintaining standard first aid supplies.\nMaintains required health records to ensure proper payment of accident claims resulting from camp participation.\nMaintains liaison with medical doctors in the area.\nAssumes responsibility for weekly camp attendance summary, program evaluation, counselor evaluation, and other required reports.\nAssumes responsibility for security of camp facilities and camp personnel.\nAssumes responsibility for inventory and ordering of recreational equipment and supplies.\nMaintains liaison with forest service personnel.\nAids in the evaluation of camp programs and personnel.Skills",
    "Skills": [
        "High school diploma\nBachelors degree\nConsiderable knowledge of mechanical, carpentry, building construction, and electrical skills.\nKnowledge of menu planning and food services.\nAbility to supervise the work of others.\nAbility to establish and maintain effective working relationships with adults, youth, and the general public.\nAbility to maintain financial records.\nAbility to operate and maintain grounds equipment.\nAbility to operate and maintain kitchen equipment.\nAbility to work independently."
    ],
    "Preferred": {
        "Gender": "Male",
        "Nationality": "Pakistan"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "1"
    }
}