{
    "Job ID": "4741197",
    "Description": "Position: Digital Media DirectorCompany Brief:Our client is an entrepreneur in spirit, who truly believe that ordinary is the road to nowhere. They are an integrated communication company. They believe in concrete, palpable results. They are strategic thinkers yet street-smart. They are true believers that dedication leads to mastery. They are currently looking to hire an experienced are currently looking to hire a Digital Media Director to join their team in Beirut.The Role:As the Digital Media Director, you will be responsible for overseeing and driving the success of digital media campaigns for our clients, developing innovative strategies, and leveraging data-driven insights to achieve campaign objectives. Your role will involve managing a team of digital media specialists, collaborating with clients, and optimizing digital media initiatives to deliver impactful results. Skills",
    "Skills": [
        "Qualifications, skills and certifications:",
        "·       Bachelor's degree in Marketing, Advertising, Business, or a related field. A Master's degree is a plus.",
        "·       Proven experience as a Digital Media Director or a similar leadership role within an advertising agency or digital marketing agency.",
        "·       Minimum 5 to 6 years of Digital Media Planning and buying experience Digital media expertise including social, display, OLV, content programs / targeting",
        "·       In-depth knowledge of digital marketing platforms and tools, including paid search, social media advertising, display, video, and programmatic advertising.",
        "·       Strong analytical skills with the ability to interpret data and derive actionable insights for campaign optimization.",
        "·       Experience with digital analytics tools and platforms, such as Google Analytics, Google Ads, Facebook Business Manager, and other relevant tools.",
        "·       Excellent communication and presentation skills to effectively communicate with clients, internal teams, and stakeholders.",
        "·       Strong leadership and management skills, with the ability to lead and motivate a team of digital media specialists.",
        "·       Strategic thinker with a demonstrated track record of developing successful digital media strategies.",
        "Highly organized, detail-oriented, and capable of managing multiple clients and campaigns simultaneously",
        "Soft & hard skills:",
        "Digital Media Strategy and Planning:",
        "Develop and implement comprehensive digital media strategies aligned with clients' marketing goals, target audiences, and budgets.\nConduct market research, competitive analysis, and audience profiling to inform media planning decisions.",
        "Client Relationship Management:",
        "Serve as a primary point of contact for clients, understanding their business objectives and providing strategic recommendations.\nEstablish and maintain strong client relationships, ensuring client satisfaction and retention.",
        "Team Leadership and Development:",
        "Lead and mentor a team of digital media specialists, providing guidance, feedback, and support to foster their professional growth.\nDelegate tasks and responsibilities, ensuring efficient allocation of resources and successful campaign execution.",
        "Campaign Execution and Optimization:",
        "Oversee the setup, launch, and management of digital media campaigns across various platforms, including paid search, display, social media, video, and programmatic.\nMonitor campaign performance, analyze key metrics, and implement optimization strategies to achieve KPIs and maximize ROI.",
        "Performance Analytics and Reporting:",
        "Utilize data analytics tools and platforms to track campaign performance and provide data-driven insights to clients and internal stakeholders.\nPrepare regular reports and presentations on campaign results, optimizations, and strategic recommendations.",
        "Budget Management:",
        "Manage digital media budgets for multiple clients, ensuring proper allocation of resources and adherence to campaign objectives.\nOptimize spending to achieve the best possible results and ROI within budget constraints.",
        "Collaboration and Cross-Functional Communication:",
        "Collaborate with cross-functional teams, including creative, account management, and data analytics, to align digital media strategies with broader marketing initiatives.\nCommunicate campaign progress, performance, and optimization strategies effectively to team members and clients.",
        "Industry Trends and Innovation:",
        "Stay updated on the latest digital media trends, technologies, and best practices in the advertising and digital marketing industry.\nRecommend innovative approaches and emerging tools to enhance campaign effectiveness and client success."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "Lebanon"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}