{
    "Job ID": "4741480",
    "Description": "Sales Coordinator / Quotations / OrderseMagine are working with an international FMCG company who are expanding their office in Dubai. We are looking for a Sales Coordinator to work within an administrative capacity to support the sales team.You will be managing things such as preparing sales order and purchase orders (POs) and collaborating with the logistics department ensuring that all orders are being tracked and managed effectively.The ideal candidate will be the point of contact for colleagues and customers. This candidate will keep schedules, provide feedback, documentation and information in order to facilitate team activity. They will also work closely with sales teams to maximize performance.Good knowledge of CRMs and Excel is a must as well as experience of working within or alongside the FMCG industry.Key Responsibilities:Order Management: Process and manage sales orders from start to finish, ensuring accurate and timely delivery.\nCommunication Champion: Act as a bridge between the sales team and various departments, ensuring information flows smoothly.\nData Insights: Compile and analyze sales data to identify trends, opportunities, and areas for improvement.\nCustomer Relations: Build and maintain strong relationships with clients, addressing inquiries and providing exceptional service.\nCollaborative Spirit: Coordinate closely with marketing, logistics, and finance teams to optimize sales processes.\nDocumentation: Prepare and maintain sales reports, presentations, and documentation as required.\nProblem Solving: Proactively identify challenges and offer innovative solutions to streamline operations.Skills",
    "Skills": [
        "Qualifications",
        "Bachelor's degree or equivalent experience\n3+ years' experience in sales related role\nWell-organized with an aptitude in problem-solving\nStrong verbal and written communication skills"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}