{
    "Job ID": "4741354",
    "Description": "Overview: A Dubai-based Family Office is seeking a highly motivated and proactive accountant who can effectively manage financial tasks, collaborate with a team, and contribute to our success. The ideal candidate will both thrive within and empower small teams, take ownership over their work, be adaptable, and possess strong attention to detail. Experience working in a fast-paced environment, within hybrid, diverse teams and under tight deadlines is advantageous.How to apply: We will email you with the next steps if you are successful. Due to the high volume of applications, we regret that we are unable to respond to individual emails or calls.Responsibilities:Perform day-to-day financial tasks, including recording transactions, managing accounts, and preparing financial reports.Empower the team with your knowledge and explain accounting concepts succinctly and with ease.Utilize software tools such as Dext, Pleo, Xero, Teams, Approval Matrix and Outlook to efficiently manage financial data and communications between the team and external vendors.Ensure accurate and timely bookkeeping, bank reconciliations, and invoicing.Coordinate with the team to provide financial insights and support decision-making.Maintain compliance with relevant tax laws and regulations.Prepare financial statements and reports for review by senior management.Collaborate with external advisors, auditors, and tax professionals as needed and with the utmost professionalism.Actively engage in process improvement and identify opportunities to streamline financial operations. Ensure the smoothness of micro and macro-operations.Willingness to take on additional tasks and adapt to changing priorities as required.Skills",
    "Skills": [
        "Requirements:",
        "Qualified accountant with 5 + years of experience.\nProactive, hands-on approach to problem-solving and multitasking.\nStrong interpersonal skills to collaborate with a diverse, hybrid team.\nAbility to work independently and meet deadlines efficiently.\nProficiency in accounting software such as Pleo and Xero.\nFamiliarity with collaboration tools like Teams and Outlook. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Dubai, United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}