{
    "Job ID": "4742860",
    "Description": "JOB REQUIREMENTS Engineering Degree (BSEE / BEng preferred) with >15 years of relevant experience in chemical / refinery / gas plant maintenance / inspection / engineering / commissioning.  Experience in Front End Loading and Detailed Design engineering project development through to construction and commissioning.  Knowledge and application of industry codes and standards applicable to Oil and Gas and Refining Industries (API, ISA, NEC / IEC, NFPA, ASME, etc.) and preferably also Saudi Aramco standards and working practices.  Experience in leading and guiding teams of experts with the ability to review and comment effectively on technical documents such as piping specifications, procedures, data sheets, drawings and schematic diagrams as well as following and marking up of P+IDs is essential.  Experience in the following areas is highly desirable: Steam, Gas and Power control systems in particular Gas and Steam Turbine Piping and Fixed Equipment. Demonstrated “hands-on” ability to identify design and construction requirements for various plant Piping and Fixed Equipment following modifications.  Knowledge & appreciated understanding of the principles of Instrumentation connection requirements, experienced in HAZOP & HAZID workshops and working with EPC engineering teams in design development.  Candidates should possess demonstrated troubleshooting and problem-solving skills, and an ability to think logically and systematically in an efficient manner.    Emphasis placed on safety, teamwork, and aptitude toward challenging work. Skills related to outage planning, organization and communication are highly desirable. Good interpersonal and teamwork skills with the ability to communicate clearly and effectively throughout all levels within the organization.  Proficiency in English speaking and writing is essential. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}