{
    "Job ID": "4742726",
    "Description": "We are seeking a Senior Interior Architect with a Bachelor's degree in Interior Design or Architecture and 4-6 years of industry experience. In this role, you will be responsible for managing the entire design process, from concept to project delivery, utilizing software tools such as Autocad, Sketchup, Enscape, V-ray, and Lumion. Your duties will include developing and refining design concepts, addressing contractor inquiries, attending client meetings, and providing guidance to junior architects. If you are a skilled and experienced professional ready to take on challenging design projects, we invite you to join our team and contribute to our commitment to exceptional design.Skills",
    "Skills": [
        "Responsibilities:",
        "Project Management: Oversee the entire design process, from initial ideation to project completion, utilizing necessary design software tools.\nConcept Development: Create, develop, and refine design concepts and drawings in alignment with client specifications and feedback.\nOnsite Support: Address and resolve contractor inquiries during ongoing projects, including the review and approval of shop drawings.\nClient Collaboration: Attend client meetings to comprehensively discuss project deliverables and requirements, ensuring client satisfaction.\nTeam Leadership: Supervise and mentor junior architects, providing guidance and support throughout project execution.",
        "Requirements:",
        "Education: A Bachelor's degree in Interior Design or Architecture is required.\nExperience: 4 to 6 years of relevant experience in Interior Design or within an architectural design firm is essential.\nSoftware Proficiency: Demonstrating high proficiency in software tools including Autocad, Sketchup, Enscape, V-ray, and Lumion is a must.\nDesign Background: Proven experience in designing both residential and corporate spaces is required.\nBonus Skill: While not mandatory, previous experience in landscape design is considered a plus.\nProject Coordination: Ability to effectively coordinate projects with stakeholders such as structural, electrical, and mechanical engineers.\nMaterials and Construction Knowledge: A strong understanding of materials and construction details is expected.\nAutoCad Expertise: Proficiency in producing detailed design drawings using AutoCad.\nAdobe Photoshop: Basic knowledge in Adobe Photoshop is preferable.",
        "Kindly upload your CV and Porfolio when applying."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4 Max: 6",
        "Residence Location": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Architecture; Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}