{
    "Job ID": "4742734",
    "Description": "Terms of reference for consultancy to develop A business Model and Marketing Plan through conducting a marker analysis study in support of the Commercial First Aid Programme at Jordan Red Crescent Background and Rationale Commercial First Aid (CFA) refers to a business initiative that is led by the Red Cross/Red Crescent National Society, that seeks to commercialise First Aid services provision including; training and sale of First Aid kits. This would endeavour paid services for companies or professionals required to comply with government legislation, or that is based around occupational safety and health risks in the workplace. CFA intends to generate funds for the Jordan Red Crescent as part of its sustainability development ambitions to enable the National Society to expand its outreach to vulnerable communities; whilst maintaining its autonomy in the long-term. The CFA approach requires a risk management and project feasibility study to ensure a sound business venture. Hence it is necessary to identify potential activities that drive sustainable returns for the NS. The consultant is tasked to develop a business model and market plan based on the market analysis and feasibility study. It is then necessary to have ideas and to identify possible CFA activities, which can be suitable and profitable. You may then come up with a business idea after doing some research and having made a feasibility study and market analysis to identify the needs. The Jordan Red Crescent (JRC) forms part of the International Red Cross and Red Crescent (RCRC) Movement, which is the world's largest humanitarian network. JRC provides a range of services to communities across Jordan, including disaster response, health care, social services, and support for vulnerable groups such as refugees and people with disabilities. JRC also works to promote humanitarian values and raise awareness to the local communities through the HQ and 10 branches distributed in the governorates of the Hashemite Kingdom of Jordan. Its branches are located in Amman, Irbid, Mafraq, Jerash, Ajloun, Balqa, Madaba, Karak, Tafileh, Maan, and Aqaba, and they work closely with local communities to identify their humanitarian needs and provide appropriate assistance. First Aid is one of the main services provided by the JRC with a trained capacity of equipped teams with volunteers who can provide First Aid services in emergency situations or in response to requests from local authorities. These volunteers are trained to provide immediate assistance to people who have been injured or are in need of First Aid Services, such as administering CPR, treating wounds and fractures, and stabilizing patients until they can be transported to a medical facility. Local communities often play a critical role in responding to accidents and crises, and in many cases, are the first on the scene and can provide immediate assistance and support to those in need. JRC recognizes on the importance of Community-Based First Aid and emergency response awareness and preparedness for emergency situations through conducting regular First Aid training programmes for the public. JRC has a team of qualified trainers who provide First Aid training to staff, volunteers, and local communities.CRESCENT training is designed to equip individuals with the skills and knowledge necessary to respond effectively in emergency situations and to deal with accidents and injuries that may occur in everyday life. The JRC provides these training services free of charge or for a nominal fee, as part of its commitment to making these essential skills accessible to the community at large By providing First Aid training, the JRC aims to promote a culture of preparedness and resilience, and to empower individuals and communities to take an active role in protecting their own health and safety. Like many other humanitarian organizations, the JRC relies on funding from a variety of sources in order to sustain its operations and continue providing essential services to communities across Jordan. These sources may include internal Red Cross and Red Crescent partners (RCRC), external partners, corporations, and revenue-generating activities such as Commercial First Aid training. Therefore, introduction of the Commercial First Aid training by JRC at a national level on the basis (RCRC), external partners, corporations, and revenue-generating activities such as Commercial First Aid training. Therefore, introduction of the Commercial First Aid training by JRC at a national level on the basis of a feasibility study is still needed. As a result, the National Society would consider implementing the roll-out of Commercial First Aid training at a national level in a well thought manner. As the JRC is a non-profit organization, all income generated from the commercial activities is dedicated for humanitarian operations and programmes. Consultancy Purpose and Objectives: The purpose of the consultancy is to develop a business model and a marketing plan for JRC's Commercial First Aid Programmes which entails but is not limited to: - Feasibility Study. - Market and Stakeholder Analysis. - Assessing JRC's current capacity to successfully implement the Commercial F.A initiative. - Costing Analysis and Pricing of the curriculum costs. - Marketing and Communication Plans. Specific objectives of the consultancy: Review the existing First Aid training including - how and where they conduct the training, type and number of trainees, production and sales of supplementary materials, network and stakeholders and extent of collaboration, challenges, and best practices; Desktop research and review of existing tools and resources; Consultation and interviews with various stakeholders including IFRC Country Delegation and field offices, National Societies in different governorates, and other key stakeholders like academia, etc. Review the experiences of sister National Societies running Commercial First Aid training, if possible one country from Middle East Conduct a market analysis that includes the legal environment, the market size, competitors, The needs of the customers and why they will buy, define the customer segment...etc. Develop the marketing plan that covers the promotion channels. Organize the business's structure and determining its operational procedures. Based on the market analysis study, creates cost effectiveness analysis to determine the program's development costs, operating and maintaining costs, margins of profits, and guidance on different CFA programmes that JRC can consider to meet the variable needs of potential customers. Deliverables: By the end of this consultancy, the following deliverables should be submitted: A Business Model and Marketing Plan A comprehensive analytical report including but not limited to: CFA-SWOT analysis gap identification and mapping of resources Comprehensive Market analysis; Market strategy; Programme structure; Cost-effectiveness analysis. Ensure all project interventions are robustly designed meeting CFA investment criteria; that match the IFRC Commercial First Aid Guide; and is backed up with evidence including pre-scoping assessments, evaluations, relevant studies etc; Proposed timeframe: From  15th September 2023- 15th November  2023 during which the Consultant is expected to: 1. Submit the initial draft and conduct a one-day workshop to discuss and agree on the details of proposed JRCS CFA programme; 2. Final draft and presentation after incorporating the feedback and inputs; 3. Finalise and submit all deliverables.Skills",
    "Skills": [
        "Minimum Requirements for the consultant: \nRelevant University degree in fields related to Business Management, Marketing, human resource management, finance, or other related fields; \nAt least 7-10 years of technical experience in business development, marketing, or investment sector;\nStrong knowledge and expertise in conducting financial analysis and feasibility studies for project viability and budget formulations; \nPreferred previous experience of working with the Red Cross and Red Crescent movement or NGOs; \nExperience in practically applying knowledge into policy, programmes, and positioning; \nStrong analytical skills; scientific research, very good communication networking, negotiations, and writing skills; \nDisplays gender, diversity and culture sensitivity, and adaptability. \nFluent in English and Arabic"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}