{
    "Job ID": "4742640",
    "Description": "Responsibilities:· Take delivery of all incoming materials and reconcile with purchase orders.· Track, document, and resolve any discrepancies on received orders.· Ensure accuracy of the facility’s inventory system by updating records of physical inventory totals, receipts, adjustments, and returns.· Make sure to follow with concern person if there is any shortage in the order and make sure to get it ASAP on time.· Check the shop used items and make sure that is matching the invoices.· Make sure of the expiry dates of the products.· Checked the opened product and make sure to put a date of opening to follow forward the expiry date (especially for Spa products). · Follow with the Supervisors the purchase order and get their signature after the initial on the purchase order.· Submit all required reports daily, monthly, regular report when required.· Make sure that the inventory done correct and systematic.· Organize the files and make sure that the products used is correct and match the shop used.· Make sure that the invoice and product and the shop used are correct.· Make randomly inventory to make sure that all stock is correct and process under control.· Make sure to distribute the product received from the main store immediately to other section and make sure to get the signature of receiving.· Perform any other duties that management may reasonably require.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum of 2 years of experience in retail auditing or a similar role.\nBachelor's degree in accounting, finance, or a related field.\nStrong analytical skills with attention to detail.\nExcellent communication and interpersonal skills.\nAbility to work independently and manage multiple priorities.\nProficient in using audit software and Microsoft Office suite.\nKnowledge of retail industry regulations and best practices.\nFluency in English and Arabic.",
        "Financial analysis\nAudit procedures and techniques\nInventory management\nRisk assessment and mitigation\nCompliance and regulatory knowledge"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 4",
        "Residence Location": "Kuwait",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Merchandising",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}