{
    "Job ID": "4742850",
    "Description": "Job SummaryTo ensure conducting a quality review and produce STR with facts, context and indicators. To submit STR with accurate information to regulator in timely manners. Follow up with business and other departments for supporting documents and further information. Assist team to improve investigative skills and provide STR typology. Update STR tracker and highlight trends ongoing basisKey AccountabilitiesAssist in reviewing and analyzing financial transactions to identify potentially suspicious activities or patterns.\nUtilize provided tools and guidelines to detect unusual behaviors and anomalies in transactions. \nConduct initial investigations into alerts and cases related to potential money laundering or terrorist financing.\nGather necessary information, documents, and evidence to support analysis. \nAssist in monitoring compliance with AML/CFT regulations and internal policies.\nCollaborate with senior analysts to ensure adherence to relevant laws and guidelines.\nMaintain accurate and organized records of investigations, analysis, and decisions made.\nInput and update information in AML/CFT databases and systems.\nPrepare basic reports summarizing findings from investigations and analysis.\nContribute to regular reports on AML/CFT activities for management and stakeholders. Training and Learning:\nParticipate in training sessions to enhance knowledge of AML/CFT regulations, tools, and techniques.\nStay updated on industry trends and developments related to money laundering and terrorism financing. Collaboration:\nWork closely with senior analysts and other team members to share insights and findings.\nCollaborate with cross-functional teams, including compliance and legal, to address AML/CFT concerns. Documentation:\nAssist in maintaining and updating AML/CFT policies, procedures, and documentation.\nKeep track of changes in regulations and help ensure policy alignment.\nIdentify opportunities to enhance the effectiveness of AML/CFT programs and recommend improvements.\nContribute to the development and implementation of enhanced risk mitigation strategies. Skills",
    "Skills": [
        "Education",
        "Bachelor’s Degree, in Business-related major"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}