{
    "Job ID": "4742821",
    "Description": "Key Responsibilities:Technical Leadership and Hands-on Contribution:Provide technical leadership, mentorship, and hands-on support to a team of hybrid app developers\nParticipate in coding, development and enhancement of hybrid applications, setting an example of the team.Hybrid App Development:Lead the team in designing and developing hybrid application using web technologies (HTML, CSS, JavaScript) and relevant hybrid frameworks (Flutter, React Native).\nOther technical expertise to ensure seamless integrations in the features, optimal performance and cross-platform compatibility.Design Patterns and Architecture:Implement design patterns such as Model-View-ViewModel (MVVM) to ensure clean code architecture, data binding and effective separation of concerns within hybrid apps.Editor/IDE and Tooling:Utilize industry-standard editors/IDE (e.g Visual Studio Code, WebStorm) and tools for hybrid app development, ensuring efficient coding practices and streamlined collaborations.Backend and Frontend Development:Collaborate with backend developers to integrate hybrid apps with backend services.\nOffer technical guidance in frontend development, including HTML, CSS, JavaScript and frontend frameworks (Angular, React, Vue.js).Web App Development:Lead the development of Web application using frontend and backend technologies, ensuring user-friendly interfaces and optimal user experiences.Enhancement and Feature Development:Collaborate with team members to identify opportunities for app enhancement and new feature development.\nParticipate in feature design, development, testing and deployment.Project Management:Ensure the projects are executed on time, within scope and aligned with organizational goals\nWork closely with project manager to define project requirements, scopes and deliverables.Skills",
    "Skills": [
        "Qualifications and Requirements:",
        "Bachelor’s degree in Computer Science, Software Engineering or a related field.\n6-8 years of experience in software development, with a focus on hybrid app development and web applications.\nProficiency in hybrid app frameworks including Flutter.\nHands-on experience with programming languages and framework for frontend (HTML, JavaScript, Angular, React and Vue.js) and backend (Java, PHP, Laravel, MySQL)\nProven experience in leadership within software development team.\nStrong understanding of design patterns, architectural principles, and best practices for hybrid app development.\nEffective communication, intrapersonal and leadership skills.\nProject management experience, including the ability to prioritize tasks, manage timelines, and mitigate risks.\nKnowledgeable with UI/UX designing using figma or any related tools."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 6 Max: 8",
        "Gender": "Male",
        "Nationality": "All Arab Countries; Pakistan; Philippines",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 45"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Software Development; Distribution, Supply Chain & Logistics",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}