{
    "Job ID": "4742026",
    "Description": "Urgent Hiring !We are looking for a professional Real Estate Consultant to be joining our team in Dubai.The ideal candidates must be able to assist clients in making sound property investment decisions.To be successful as a Property Consultant, you should be proactive and keep abreast of the latest developments in property laws.Ultimately, an exceptional Property Consultant should be able to demonstrate effective negotiation skills and secure the best real estate deals for clients.Benefits:- UAE Residence Visa.- 50% Commission or Slabs according to work.- Medical Insurance.- Company Sim card with call and data pack.- Positive Working Environment.- You Make Your Schedule.- You get to be your own boss.- You Decide Your Target and Income.- Leads given by company.- Buyer and sellers updated data.- Best working environment.- Personnel Social Media Marketing for agents.- Supporting Top Management.- Company reputation.- RERA Card / BRN.Skills",
    "Skills": [
        "Responsibilities:",
        "- Highly motivated & dedicated candidates with the willingness to go to the extra mile to grow in their careers & succeed.",
        "- Candidates with the will & drive to self-discipline, self-growth, self-management, and hungry for success.",
        "- Proven working experience as a real estate agent in the Luxury Dubai sector - Min 1 year experience proven track record of successful sales/leasing. Strong sales, negotiation, communication, follow up & closing skills.",
        "- Focused & Goal oriented. Valid UAE driving license (own car is added advantage!) English a must, Multi-lingual or a secondary language (Bonus).",
        "What We Provide?",
        "- We offer a realistic and attractive commission plan with uncapped earning potential We provide complete and consistent real estate and self-improvement training We provide complete administration and marketing support as well as new lead generation support. We provide an extremely positive and healthy competitive work environment to motivate and help you progress in your career.",
        "- We have our own in-house quality CRM and digital marketing to provide with day-to-day leads we provide the proper structure and correct guidance to facilitate an agent in both secondary as well as primary sales.",
        "- We train consultants to grow into the best & most professional versions of themselves. We provide you with a company that completely supports the growth of its performing consultants.",
        "Qualifications:",
        "- 1+ years of relevant work experience an attested Bachelor's degree Driving Looking for Quality in details Presentable, Elegant and Adhere to Time Frame",
        "- Extensive background in and a strong understanding of commercial and residential real estate acquisitions or brokerage.",
        "- Excels working under pressure, ability to work both independently and cooperatively in a fast-paced environment.",
        "Interested Applicant with Real Estate Experience feel free to contact us, number mentioned below.",
        "*EXPERIENCED REAL ESTATE AGENT (With Salary AED 2,000 - AED 5000 per month depends on the experience) plus Commission.",
        "*For new agents, without Dubai experience, no salary, only 50-50 commission sharing."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "7"
    }
}