{
    "Job ID": "4742769",
    "Description": "1. Food Preparation: Assist with basic food preparation tasks, such as peeling, chopping, and cleaning fruits and vegetables. Measure and portion ingredients according to recipes or instructions provided by the kitchen staff. Prepare simple dishes or components, such as salads, dressings, or garnishes.2. Dishwashing and Cleaning: Wash dishes, utensils, pots, and pans using manual or mechanical methods. Operate dishwashing equipment efficiently and ensure cleanliness and proper sanitization of all kitchenware. Clean and sanitize kitchen surfaces, equipment, and storage areas regularly to maintain hygiene standards.3. Inventory Management: Assist with inventory control by receiving and storing food and kitchen supplies. Unpack and organize deliveries, ensuring proper storage and labeling of items. Keep track of stock levels and report shortages or expired products to the kitchen supervisor or chef. Equipment Operation and Maintenance: Operate kitchen equipment safely and effectively, such as food processors, mixers, slicers, or grills, following proper instructions and guidelines. Perform basic maintenance tasks, such as cleaning equipment, changing filters, or reporting any malfunctions or issues to the kitchen staff.5. Food Handling and Safety: Adhere to food handling and safety guidelines to ensure proper hygiene and prevent foodborne illnesses. Follow standard operating procedures for food storage, handling, and preparation, including temperature monitoring and labeling. Dispose of kitchen waste and food scraps properly.6. Assisting Cooks and Chefs: Support the kitchen staff by performing tasks as assigned, such as fetching ingredients, assembling ingredients or dishes, and monitoring cooking times. Collaborate with cooks or chefs during food preparation and service to ensure smooth operations.7. Kitchen Organization: Maintain a clean and organized kitchen workspace by sweeping and mopping floors, wiping down surfaces, and removing trash. Arrange and stock kitchen supplies, utensils, and equipment in designated storage areas.8. Compliance and Safety: Adhere to health and safety regulations, including proper use of personal protective equipment (PPE) and following safe work practices. Report any safety hazards or incidents to the kitchen supervisor or manager.9. Team Collaboration: Communicate effectively and work cooperatively with other kitchen staff members to ensure efficient workflow and timely completion of tasks. Assist in coordinating activities, sharing information, and supporting a positive and productive team environment.10. Flexibility and Adaptability: Be willing to perform various tasks and assist in different areas of the kitchen as needed. Adapt to changes in priorities, menus, or work assignments. Be responsive to the needs of the kitchen and willing to take on additional responsibilitiesSkills",
    "Skills": [
        "customer service skills.\nthe ability to work well with others.\nthe ability to accept criticism and work well under pressure.\nto be thorough and pay attention to detail.\nexcellent verbal communication skills.\na desire to help people.\nactive listening skills.\na good memory"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Gender": "Female",
        "Nationality": "Nepal; Philippines; Sri Lanka"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}