{
    "Job ID": "4742060",
    "Description": "Are you looking for a challenging and rewarding career in human resources? Do you have experience in developing policies, coordinating activities, and ensuring compliance with legal requirements? If yes, then we have an opportunity for you!We are ITSIZER, a leading company in consumer electronics industry. We are looking for an HR Manager to join our team in Sharjah, UAE.You will be responsible for:• Consulting legal counsel to ensure that policies comply with federal and state law.• Developing and maintaining a human resources system that meets top management information needs.• Identifying legal requirements and government reporting regulations affecting human resources functions and ensuring policies, procedures, and reporting are in compliance. Studying legislation, arbitration decisions, and collective bargaining contracts to assess industry trends.• Recruiting, interviewing, testing, and selecting employees to fill vacant positions.• Keeping records of benefits plans participation such as insurance and pension plan, personnel transactions such as hires, promotions, transfers, performance reviews, and terminations, and employee statistics for government reporting.• Coordinating management training in interviewing, hiring, terminations, promotions, performance review and safety.• Advising management in appropriate resolution of employee relations issues.• Responding to inquiries regarding policies, procedures, and programs.• Administering benefits programs such as medical insurance, vacation, sick leave, leave of absence, and employee assistance.• Preparing employee separation notices and related documentation, and conducting exit interviews to determine reasons behind separations.• Preparing reports and recommending procedures to reduce absenteeism and turnover.• Representing organization at personnel-related hearings and investigations.The selection process will consist of two stages:• First interview: Online call with Botim.• Second interview: In person interview at our company location in Sharjah.Please note that this job is open for gents only, as the job environment is not suitable for ladies.The salary range for this position is between 1500 AED to 2500 AED based on your qualifications and experience. Accommodation and benefits are also included.If you are interested in this opportunity, please apply online.We look forward to hearing from you soon!Best Regards,ITSIZERSkills",
    "Skills": [
        "To be considered for this position, you must meet the following requirements:",
        "• Less than 30 years old.",
        "• Valid visit visa in UAE or residence visa with NOC.",
        "• Ready to join us immediately.",
        "• Job Type: Full-time.",
        "• CV Required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}