{
    "Job ID": "4742139",
    "Description": "Work with a pleasant outlook and use appropriate communication channels to connect with existing clients.\nSearch for new prospect customers in the defined territory which includes existing accounts and new accounts.\nService existing accounts, obtain orders and establish new accounts by planning and organizing daily work schedule to call on existing or potential sales.\nBoost company revenue and achieve sales targets by taking appropriate measures into consideration.\nBoost company reputation by approaching existing and potential prospects in-person and on a remote basis.\nUnderstanding and promoting the company’s Products & Services as assigned.\nReview timeliness of scheduled deliveries to clients.\nResolves customer complaints by investigating problems; developing solutions; preparing reports; making recommendations to management.\nCommunicate and collaborate with other team members and management.Skills",
    "Skills": [
        "Understanding of the sales process and dynamics.\nExcellent written and verbal communication skills.\nKnowledge of customer service principles and processes.\nAbility to prioritize targets as per the requirements set forth by the company.\nProven command on improving conversion rate through modern communication channels and impressive presentations.\nConverting leads into customers through passionate discussions and debates.\nGood time-management skills\nCRM Proficiency, manage and provide transparency and visibility into an accurate pipeline"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Age": "Min: 22 Max: 35"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Textile & Apparel Production; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}