{
    "Job ID": "4742750",
    "Description": "o OSP Network development (Civil & Fiber) ▪ Planning and designing Core OSP underground infrastructure (Eg: RLU to RLU connectivity/upgrading) in new and areas under CRA▪ Planning and designing for Access OSP underground infrastructure in new and areas under CRA o FTTX Network development (Civil & Fiber) ▪ Additional capacity planning (Home Passed) to ensure sufficient number of splitters in the FTTX network o Service Requests (B2B/B2C/Special requests)▪ Planning and designing for expansion of core OSP underground infrastructure (Eg: RLU to RLU connectivity)▪ Planning and designing for expansion of Access OSP underground infrastructure (Eg: P2P, MPLS service provisioning)▪ Planning and designing for Redundancy for critical links, sites, 1st class SLA o Mega Projects & Ooredoo Projects:▪ Major Network Planning and design for mega projects like Lusail, Mesherieb etc.▪ GSM Network expansion – plan & design to build new/additional FO network to connect new GSM sites.▪ Microwave Swap - plan & design to build FO network to connect GSM sites that are currently on Microwave. ▪ As part of major transport projects. To study and propose redundancy for critical links /rings.▪ New projects – like Google quantum switch, POTN rings, new transport links etc  Skills",
    "Skills": [
        "o Academic Qualification:",
        "▪ BSc. Computer/Electronics or Diploma with 5 years practical experience in the same field",
        "▪ Certification in GIS/related technology o Skill set",
        "▪ GIS Skills, including:",
        "• Spatial Data, Data Collection, Esri Arcgis.",
        "• Database Design, CAD.",
        "• Geospatial Data/Analysis.",
        "▪ SIEBEL, Granite, CRM, ERP, Work order Estimation System",
        "▪ Project management knowledge",
        "▪ Good knowledge and practical experience in designing telecom U/G network Knowledge of emerging technologies/trends especially in telecom Good written and verbal communication skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "IT Services; Telecommunications; Cyber & Network Security",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}