{
    "Job ID": "4742979",
    "Description": "Presales Solutions Architect - Cyber Security ServicesAs a vital member of the sales team, the Pre-Sales Security Architect - Cyber Security has the responsibility of complex information security solution development, sales strategy, project transition to account managers, providing feedback to marketing, and regional leadership. Successful candidates should exhibit a deep understanding of the security industry and the ability to highlight the value of managed security services. Key tasks include:Developing solutions and conducting compelling proof of concept demonstrations.\nEnsuring that solutions in the Statement of Work align with best practices and client needs.\nDemonstrating strong business and technical acumen.\nEffective communication across client organizations, including executives, stakeholders, and delivery teams.\nServing as a subject matter expert on Kalaam Cyber Security services and offerings, fostering trust through strategic thought, execution, and technical expertise.ResponsibilitiesGathering business requirements from customers in collaboration with the sales team.\nUnderstanding and responding to RFPs/RFIs to prepare technical responses.\nProviding suitable solutions to customers and creating BOQs.\nHaving vendor product knowledge of various security solutions.\nDelivering solution presentations to C-level executives.\nEnsuring solution quality and consistency, and advising clients on cloud-based and managed security services.\nActing as a subject matter expert for commercial security platforms.\nCollaborating with partners to develop comprehensive security service offerings.\nDesigning technical solutions for compliance and governance objectives.\nConsulting with CSOs/CISOs on security solution selection.\nDeveloping proposals consistent with customer risk management goals.\nProviding training and sales materials to Sales Account Managers.\nCrafting Service Level Agreements for designated services.\nWorking closely with vendors and partners to meet customer requirements.\nContributing to whitepapers, articles, and blogs.\nConducting internal training sessions.\nAssisting delivery teams with knowledge transfer.Skills",
    "Skills": [
        "Qualifications",
        "B.E / B.Tech / B.Sc (Computers/ Electronics / Telecom) or related fields.",
        "Experience & Skills",
        "3 to 5 years’ experience in a pre-sales role within IT and cyber security aligned with a sales team.\nStrong techno-commercial knowledge of security technologies such as SOC, SIEM, UTM, FIREWALL, PAM, DAM, DDOS, Cloud Security, and Endpoints.\nProficiency in key security vendor technologies like Palo Alto, Check Point, Cisco, Fortinet, CASB, and SIEM solutions.\nPossession of professional security-related accreditations (CISSP, CEH) and vendor technology qualifications.\nDemonstrating intelligence, competence, adaptability, and integrity.\nEffective communication, negotiation, attention to detail, and a genuine passion for Information Security.\nArabic reading and writing skills are advantageous."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 10",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Security",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}