{
    "Job ID": "4742909",
    "Description": "Primary Duties and Responsibilities:Develop and maintain Project Master Plans and Schedules for all Project Phases and Stage Gates throughout the Project Lifecycle from Initiation to Close-out. Provide planning input to Gate deliverables including Project Execution Plan (PEP), Risk Management Plan / Risk Register, and Change Management Plan. Plan and Monitor project close-out activities, provide input for the finalization of Close-out Report of the project.Perform Project Planning including Scheduling, Monitoring, Forecasting, and Progress Reporting on weekly, monthly, quarterly and annual basis through various Management reports. Maintain Project Builder data in SAP to facilitate group reporting and analysis.Maintain and update the Integrated Resource Planning system to plan the requirement of resources for assigned Projects as per the Master Plans in PrimaveraDevelop & Incorporate Planning & Scheduling requirements, Progress Measurement, and Reporting Instructions for compliance by Bidders in the Tender Documents (Appendix D & H).Evaluate Technical Proposals of Bidders as a key member of the Technical Evaluation Team to ensure compliance with the tender requirements in particular performing schedule analysis, reviewing and validating man-hour allocations and resource histograms, progress measurement methodology, and compliance to planning and reporting instructions and procedures.Review, Validate and Endorse Contractor submitted Planning Package including Execution Program/Recovery Plans, Resource Plan, and progress measurement and reporting system to ensure that a proper system is in place for effective project control and in compliance with contractual requirements.Monitor Contractor's performance, Conduct time and progress variance analysis and Review/ Validate Contractor's progress reports to ensure performance deviation from the agreed plan is determined and reported on timely basis. Highlight areas of concern, and suggest corrective actions/ mitigation measures for implementation by Contractor and Project Team. Conduct \"what if' and schedule risk analysis when required, to anticipate unforeseen changes to the project and quantify potential impact & mitigation plans.Estimate progress achieved for all assigned Contracts in order to calculate Value of Work Done at every month end for the purpose of Service Entry Sheets (SES). Verify reported progress for all assigned contracts in coordination with all stakeholders and validate cumulative value of work done in Contractor’s invoices. Provide all relevant schedule input and estimated progress phasing for annual Budget/AFE preparation, subsequent revisions, and supplementary Budgets. Analyze reasons for progress and schedule variance for providing input to Budget variance report.Determine Time Impact related to scope changes addressed in Change Impact Notes and Work Change Requests (WCR). Review and assess Contractor Extension of Time (EoT) claims using international norms and time impact analysis processes.Participate in the development and implementation of various Project Planning Procedures/Work Instructions.Skills",
    "Skills": [
        "Minimum Requirements",
        "B. Sc. or equivalent in an Engineering Discipline. Preferably Certified PMP or equivalent certifications/memberships.",
        "Minimum 10 years’ experience in project engineering with 5 years’ experience in planning of projects in Oil & Gas and/or Infrastructure related industries.",
        "Experience includes project planning, scheduling & phasing, project control & monitoring, forecasting/trending, invoice verification, risk assessment, variations/claims analysis.",
        "Work experience in the Arabian Gulf Countries is desirable.",
        "High level of computer literacy with MS Office and relevant Project Control software including Primavera & MS Project.",
        "Well-developed analytical and reporting skills.",
        "Proficient level of computer literacy with relevant MS Office/Project Control Software packages."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}