{
    "Job ID": "4742832",
    "Description": "Legal Director - RiyadhOn behalf of a global healthcare provider, we are seeking a Legal  Director for their Riyadh headquarters. Reporting to the GM and Global Legal teamAssist the KSA operations team with all legal matters, including leading on negotiation of supply and service contracts, corporate transactions, and data protection matters.\nManage real estate and employment law matters relating to the KSA business, with support from external counsel where required.\nManage outside counsel in their handling of any disputes and litigation.\nAct as the internal Data Protection Officer for the KSA business by providing ad hoc advice and preparing and delivering internal training as required.\nAct as Company Secretary for the operating KSA entities, and comply with internal corporate governance procedures and processes, and potentially serve as a member of the board of the KSA entities.\nIdentify and effectively manage legal risk.\nTake instructions from and support the General Manager in KSA and all transactions.\nClosely collaborate with internal departments in aligning operational activities with data protection legislation and KSA’s privacy and security policies.\nProvide sound, commercial legal advice across all business lanes. \nActively participate in the leadership team of the International Legal Department and contribute to the development of legal operations in KSA and globally.\nManage the legal budget and outside counsel spend.\nProduction of Country Risk Register and Service Reviews.\nAssist with audits and execution of assurance program.\nUse and keep updated internal legal IT systems, such as entity management, contract lifecycle management, and data privacy management applications.\nLegal file management: including the opening, closing, archiving, and retrieval of legal files in accordance with the appropriate procedures.Skills",
    "Skills": [
        "Law degree from a leading university with law or legal studies as the main subject of the degree. \nYou will ideally have an LLM or KSA equivalent and be registered with the local Bar Association.\nYou will need to have a minimum of 10+ years’ experience as a Lawyer in a reputable KSA law firm. \nExperience in providing legal assistance to lawyers in an In-house legal department.\nCandidates must have excellent written and verbal communication skills (including presentations either in-person or online) in both Arabic and English. \nCandidates must have solid experience of MS PowerPoint, Word, and Excel Skills and be able to assist and/or produce PowerPoint slides for meetings under pressure and tight deadlines. \nDemonstrate excellent communication, interpersonal organizational, and presentation skills, strong research and report-generating skills.\nExperience of working in a fast-paced, team-oriented environment including liaising with international colleagues to help with project management and completion.\nAbility to build effective and positive client relationships quickly and fully embrace the importance of client service within the business."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10 Max: 20",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 45"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}