{
    "Job ID": "4742643",
    "Description": "We are on the lookout for both budding and experienced IT professionals, championing in web development, full-stack technologies, and WordPress.Key Responsibilities Include:Spearheading a myriad of web development projects, especially those rooted in WordPress, right from their inception to their fruitful execution.\nServing as the primary bridge between our esteemed clients and our developer brigade, ensuring fluid communication and project progression.\nDevising technical strategies leveraging a strong foundation in full stack technologies and WordPress.\nUpholding the highest standards of quality, punctuality, and budget considerations for all projects.\nInstrumental involvement in charting out project scopes and objectives, always keeping technical feasibility in check.\nUtilizing state-of-the-art systems, tools, and techniques for effective project performance monitoring.Experience Bracket:Junior Level: Candidates should have 1-3 years of experience in a similar role.\nSenior Level: Ideally 5+ years of experience, with a proven track record in handling intricate projects, and deep expertise in WordPress.Skills",
    "Skills": [
        "Qualifications & Skills:",
        "A bachelor's or higher degree in a relevant IT discipline.\nHands-on experience in web development and full stack technologies, with a special emphasis on WordPress.\nDemonstrated ability to drive projects to completion, adhering to deadlines.\nStellar communication skills, both with clients and within the team.\nA problem-solving, detail-oriented mindset.\nLanguage Proficiency: Fluent in both Arabic and English."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}