{
    "Job ID": "4742808",
    "Description": "Required Skills to be successful:The candidate possesses minimum 2 years of experience working in the capacity of credit control executive.\nTimely review of the customer outstanding and work with the credit control manager to ensure smooth collection. \nPrepare and report receivables key performance indicators for each division and regularly review the same with the credit control manager and Business Unit Finance Manager.\nTimely submission of SOAs to the customer and liaise with the customers to address any queries and coordinate with the sales executives and customer to settle pending dues, if any.\nPrepare and submit Budget and quarterly forecast assumptions for receivables About the Team:In this position you will be working in a fast paced and diverse environment. You will be reporting directly to the Senior Financial Controller What equips you for the role:The ideal candidate will possess an Internationally Accredited Professional Accountancy Qualification or a Bachelor of Commerce or Diploma in Accounting Financial Management. You will have a minimum of 3 years’ experience with specific experience in receivables management of a large company and prior experience of working with Parts Dealers business is an added advantage. Ideally, we are looking for candidates with the below skills and behavioral competencies: \nExcellent communication skills, both verbal and written\nKnowledge of Arabic is an added advantage \nAbility to work as a strong team player \nlead a large and diverse team and coach them into top performers\nAble to talk to all levels of the organization, both internal and external\nHighly computer literate, knowledge of SAP will be an advantage\nStrong analytical skills. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}