{
    "Job ID": "4742836",
    "Description": "OverviewCommercial bank Innovation Services is looking to hire a senior developer ,, acquiring systems under in our cards and tokenization technology department within Information Technology Key AccountabilitiesThe Senior Developer in the Acquiring systems domain is a crucial role within the Cards Technology team. This position is responsible for delivering high-quality products and ensuring the smooth performance of the Acquiring systems, particularly on POS and ATM networks. The Senior Developer will work closely with both internal and external stakeholders to understand business requirements, develop effective solution proposals, and adhere to corporate software development standards and practices. They will also play a pivotal role in ensuring the uninterrupted service of the Acquiring systems, which is crucial to the organization's operation and customer service. The Senior Developer will demonstrate technical proficiency, strong problem-solving skills, and a commitment to excellence, contributing significantly to the team's objectives and the broader business goals.\nOther Accountabilities\nEvaluate business requirements and design effective solution proposals based on these needs. Develop, test, and implement software solutions for Acquiring systems, focusing on POS and ATM networks.\nDevelop and change the States flows and ATM configurations.\nMonitor and maintain the performance of Acquiring systems, ensuring uninterrupted services on POS and ATM networks. \nIdentify and resolve system issues promptly, minimizing downtime and maintaining high service levels. \nImplement and manage system enhancements to improve performance and user experience. Collaborate effectively with internal and external stakeholders, including the Cards Team, other IT and Business teams, Payment schemes, Domestic Switch regulator, and vendors. \nCommunicate system updates, issues, and resolutions effectively to all stakeholders.Skills",
    "Skills": [
        "Competencies",
        "Adaptability/Flexibility",
        "Creativity/Innovation",
        "Decision Making/Judgment",
        "Dependability",
        "Initiative",
        "Integrity/Ethics",
        "Problem Solving/Analysis",
        "Education",
        "Bachelor’s degree in Computer Science or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}