{
    "Job ID": "4742622",
    "Description": "We are looking for an experienced operations supervisor to help us execute and implement the right processes across the company to enable efficiency and reduce cost. You’ll assess all departments operational methods and propose ways to improve them. Review data analysis procedures such as, but not limited to databases, customer service and inventory control procedures. You are expected to monitor and keep track of key performance indicators (KPIs) across different functions and departments and monitor staff compliance with operational policies and the progress of administrative tasks. Job Duties:Perform the assigned duties as per the set policies and procedures in order to achieve the company goals.\nSupervise, monitor, and manage all the daily operations and activities, report to COO.\nSet and develop the annual projects plan to support the overall strategic objectives.\nDevelop, review, and implement the approved operations policies and procedures.\nEnsure cooperative and productive work environment for all employees.\nEnsure compliance of the daily operations schedules, policies, procedures, and regulations in order to avoid any discrepancies or unsatisfactory results.\nEnsure that all aspects of performance and work are following the set specifications and completed within planned time and budget constraints.\nEnsure safe working conditions and efficient operations for the manufacturing facilities through the establishment and execution of operating procedures, timetables and schedules.\nProvide direction for the operations functions' managers regarding any issues or questions.\nProvide continuous training sessions for all employees to improve their skills.\nPrepare and submit update reports to manager in charge COO regularly.\nAnalyzing and reporting on performance (KPI).Skills",
    "Skills": [
        "Excellent communication skills English and Arabic.\nPrevious experience as an operations supervisor or similar role.\nHands-on experience implementing operational processes - SOP.\nExcellent project management skills.\nKnowledge of operational principles and policies.\nOrganizational skills and attention to detail.\nTeam leadership."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4 Max: 10",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Industrial Production; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}