{
    "Job ID": "4742935",
    "Description": "As a Production Operator, you will be responsible for operating and maintaining production equipment in a manufacturing environment. Your main goal will be to ensure that production runs smoothly and efficiently while following all safety procedures. You will work closely with other team members to meet production targets and maintain quality standards.Responsibilities:Set up and operate production equipment, such as machines, conveyors, and assembly lines.\nMonitor production processes and make adjustments as necessary to ensure optimal efficiency and quality.\nPerform routine maintenance on production equipment to prevent breakdowns and delays.\nInspect finished products for defects and ensure they meet quality standards.\nFollow all safety procedures and wear appropriate personal protective equipment.\nMaintain accurate production records and report any issues or concerns to the supervisor.\nCollaborate with other team members to meet production targets and deadlines.\nEnsure that the work area is clean and organized at all times.\nParticipate in continuous improvement initiatives to enhance production processes and reduce waste.\nAdhere to all company policies and procedures.Skills",
    "Skills": [
        "Preferred Candidate:",
        "High school diploma or equivalent.\nPrior experience working in a manufacturing environment.\nStrong mechanical aptitude and troubleshooting skills.\nAbility to read and interpret technical documents and drawings.\nAttention to detail and ability to follow instructions accurately.\nGood communication and teamwork skills.\nAbility to work in a fast-paced environment and meet production targets.\nFlexibility to work different shifts, including nights and weekends.\nBasic computer skills.\nPhysical stamina to stand, walk, and lift heavy objects for extended periods.",
        "Machine operation\nEquipment maintenance\nQuality control\nAttention to detail\nTeamwork"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}