{
    "Job ID": "4742963",
    "Description": "As per your request, stated below the job responsibilities :Tender Document Preparation: Assisting in the preparation of comprehensive and accurate tender documents, including technical specifications, drawings, quantities surveying and cost estimates . Market Research: Conducting market research to identify potential suppliers, contractors, and subcontractors, and maintaining a database of reliable contacts . Bid Analysis: Evaluating bids and proposals from suppliers and subcontractors to ensure compliance with project requirements and regulations . Cost Estimation: Assisting Tendering manager in accurately estimating project costs based on materials, labor, equipment, and other relevant factors. Coordination: Collaborating with cross-functional teams to gather necessary information and ensure timely submission of tenders. Governmental Projects (KSA): For governmental projects in Saudi Arabia, monitoring the government platform for new marine tenders. This includes. a. Regular Monitoring: Keeping a close watch on government websites and platforms where marine tenders are announced. b. Information Gathering: Gathering key details about new tenders, including scope, deadlines, and submission requirements. c. Documentation: Ensuring all required documents and forms are prepared accurately and in a timely manner for tender submissions. d. Regulatory Compliance: Ensuring that all tendering processes adhere to the specific regulations and guidelines set by the Saudi Arabian government. e. Communication: Liaising with relevant stakeholders within the company to ensure a coordinated approach to tender submissions. f. Deadline Management: Keeping track of tender submission deadlines and ensuring that all necessary preparations are made well in advance.Skills",
    "Skills": [
        "Bachelor's degree in Engineering",
        "-Minimum of 8 years of experience in tendering and proposal preparation for construction projects in Saudi Arabia",
        "-Excellent knowledge of tendering procedures, policies, and regulations in Saudi Arabia",
        "-Strong communication and negotiation skills",
        "-Ability to work under pressure and meet tight deadlines",
        "-Fluent in Arabic and English"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}