{
    "Job ID": "4742663",
    "Description": "*Project Planning:* Collaborating with architects and project managers to understand project requirements and goals.\n*Site Inspection:* Regularly visiting the construction site to ensure work is progressing according to plans and specifications.\n*Quality Control:* Monitoring the quality of materials and workmanship to ensure they meet project standards.\n*Safety Compliance:* Enforcing safety regulations and ensuring that workers and equipment operate safely.\n*Progress Reporting:* Providing regular progress reports to project managers and stakeholders.\n*Problem Solving:* Identifying and addressing construction-related issues, such as delays, design changes, or unexpected site conditions.\n*Cost Management:* Tracking project expenses and helping to control costs within the budget.\n*Resource Management:* Managing on-site resources, including labor, equipment, and materials.\n*Documentation:* Keeping accurate records of site activities, changes, and incidents.\n*Communication:* Serving as a liaison between different parties involved in the project, including contractors, subcontractors, and government authorities.\n*Testing and Inspections:* Overseeing testing and inspections of materials and systems to ensure compliance with specifications.\n*Environmental Compliance:* Ensuring that the project adheres to environmental regulations and standards.\n*Scheduling:* Developing and maintaining project schedules to meet deadlines.\n*Problem Resolution:* Resolving disputes and conflicts that may arise on the construction site.\n*Coordination:* Coordinating the work of various trades and contractors to ensure a smooth construction process.\n*Design Changes:* Managing and implementing design changes as required during construction.\n*Client Relations:* Maintaining positive relationships with clients and addressing their concerns.\n*Final Inspection:* Conducting a final inspection to ensure that all work is completed correctly before project handover.Skills",
    "Skills": [
        "Previous experience as a site engineer or similar role\nWell-versed in technical aspects of field projects, including machinery and equipment\nUnderstanding of safety guidelines\nAttention to detail\nProject management skills\nCommunication skills\nDegree in Engineering, Computer Science or similar field"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}