{
    "Job ID": "4742731",
    "Description": "We are seeking a Junior Interior Designer/Architect with 1-3 years of experience in Interior Design or Architecture to join our team. Reporting to our Senior Interior Architect, you will play a crucial role in supporting our design projects. Your responsibilities will include assisting in the design process using software tools like Autocad, Sketchup, Enscape, V-ray, and Lumion, and contributing to the development of design concepts and drawings. This is an excellent opportunity to gain practical experience, refine your skills, and contribute to meaningful design projects. If you have a passion for design and are eager to grow in a collaborative environment, we invite you to apply.Skills",
    "Skills": [
        "Responsibilities:",
        "Collaborate with the Senior Interior Architect to manage the design process, from concept development to project completion.\nAssist in creating and refining design concepts and drawings, taking into account client feedback and specifications.\nProvide support in addressing contractor inquiries and reviewing shop drawings for ongoing projects.\nWork closely with the Senior Interior Architect, benefiting from mentorship, and contributing to project success.",
        "Requirements:",
        "A Bachelor's degree in Interior Design or Architecture.\n1-3 years of experience in Interior Design or Architecture.\nKnowledge of design software, including Autocad, Sketchup, Enscape, V-ray, and Lumion.",
        "Kindly upload your CV and Porfolio when applying."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Architecture; Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}