{
    "Job ID": "4742021",
    "Description": "We are currently seeking an efficient Administrative Assistant to join our team. As an Administrative Assistant, you will play a crucial role in maintaining the day-to-day operations of our organization. Your ability to handle various administrative tasks with precision and professionalism will be essential in supporting the smooth functioning of our business.ResponsibilitiesHandle incoming calls, emails and messages on social media.\nHandle posting on social media\nHelp our students in navigating through their studies and with troubleshooting (we will provide training for this)\nPrepare and edit documents, reports, and presentations as needed.\nHandle sensitive and confidential information discreetly.\nAccurately input data into our company database and update records regularly.\nAssist in coordinating company events, meetings, and conferences.Working Days: Monday to FridayWorking hours: 9am - 5pmLocation: GemayzeSalary: 500 USDSkills",
    "Skills": [
        "Requirements:",
        "Proficiency in using office software, including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and other relevant tools.\nStrong communication and organizational skills.\nAbility to manage multiple tasks efficiently and meet deadlines.\nDiscretion and integrity in handling confidential information.\nProblem-solving abilities and a proactive approach to challenges.\nA professional and business-like demeanor.\nFluency in English & Arabic.\nA passion for fashion is a plus.",
        "To apply, please submit your resume along with any relevant information that showcases your administrative capabilities. Thank you for your interest in joining our team."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}