{
    "Job ID": "4742817",
    "Description": "Responsibilities and Duties:Set up Zoom meetings to conduct interviews in order to determine the student’s level and offer the suitable program.Explain more details about Monglish teaching technicalities & techniques to clarify for customers which methodology we did in our programs.Test the four skills of English within the interview (reading, writing, speaking and listening).Determine the weakness points & areas of improvements for students.Upsell the most effective programs to students/ parents based on student’s level.Record & update the drive & data base sheets with customer’s data.Present, promote and sell Academy's services using solid arguments to existing and prospective customers.Meet and contact customers by chats, zoom meetings, and any other channels to clarify & offer all details related to our programs & services.Maintain and grow relationships with existing customers.Strive to improve customer satisfaction through excellent communications & follow up.Identify and respond to client needs about Academy courses and services, prices & report with to sales team leader.Follow up on customers’ requests as needed.Meet sales targets as assigned & make sure that you follow the required weekly/monthly targets.Giving sales presentations to all of prospective customers.Inform customers with all payment’s details like payment link, total amount, Service level of transaction reflection.Identify prospects, set appointments, make effective qualifying sales meetings & calls and manage the full sales cycle.Possess in-depth product knowledge and be able to conduct demos and handle objections.Achieve sales goals by assessing current client needs and following a defined selling process with potential buyers, often including product demos and presentations.Coordinate with sales team leader to ensure that quotas & targets are being met.Skills",
    "Skills": [
        "Job Requirements:",
        "English Teaching Background is a must.",
        "BS degree in Education, or any relevant field.",
        "Experience 1-2 years in sales, preferred in educational industry.",
        "Excellent in English writing & speaking.",
        "Details oriented.",
        "Outstanding presentation skills.",
        "Outstanding communication, negation skills, and solving problems.",
        "Professional user for Microsoft Office Programs."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Alexandria, Egypt",
        "Company Industry": "Training & Education Center",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}