{
    "Job ID": "4743832",
    "Description": "Job Summary:Study, design, costing, preparation of proposals and submittals, coordinate internally and externally with concerned parties, control and follow up. (For small, medium, and large projects, as well as, for flow sales requirements, which are called all later as Projects)Tasks, Duties and Responsibilities:·      Study, analyze, design projects (In coordination with design department) to meet or exceed projects' requirements in the most professional engineering way and according to best practices.·      Prepare accurate projects costing & breakdowns.·      Prepare complete Techno-commercial proposals and compliance / deviation sheets, along with all related technical documents, drawings and submittals.·      Obtain quotations from internal and external suppliers / subcontractors for electromechanical works, in coordination with concerned persons in the company.·      Make necessary efficient communication and coordination with all project internal and external stakeholders, including consultants, contractors and customers. Send queries and reply to technical issues.·      Draw complete plan and time schedule, for fastest deliverables and meeting deadlines.·      Keep all project documents organized and properly archived, both in hard and soft copies.·      Submit reports when necessary or needed.·      Make site surveys and visits, when needed.·      Deliver technical presentations where required.·      Support Power Systems salespersons in technical issues.Skills",
    "Skills": [
        "Qualifications:",
        "-          Bachelor degree in Electrical Engineering (BaC+5)",
        "-          Minimum 3 years of experience as an Application Engineer.",
        "Knowledge Required:",
        "·      Computer skills (Microsoft office, AutoCAD, ERP, and other required software’s).",
        "·      High level of knowledge of all Power Systems products and solutions.",
        "·      Electromechanical calculations and drawings.",
        "·      Project specs, docs, and drawings reading, understanding and handling.",
        "·      Projects procedures, practices, management and communication with projects stakeholders.",
        "Competencies & skills Required:",
        "·      Problem solving, Budgeting and cost control",
        "·      Time management, Quality control, Resource allocation",
        "·       Strong organization and time management skills",
        "·      Ability to communicate effectively, both verbally and in writing.",
        "·      Excellent follow up and fast replies",
        "·      Accuracy and reliability",
        "·      Perseverance and motivation",
        "·      Taking initiative",
        "·      Flexibility",
        "·      Creativity",
        "·      Reporting"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Lebanon",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}