{
    "Job ID": "4743971",
    "Description": "Responsible for serving as the first point of contact for ASC’s clients (external as well as internal) via phone, eSupport and/or other media for support and training related requests to services & solutions with the key focus on achieving high standards in first contact resolution.Policies & Procedures:Implement the department’s policies and follow the set processes in order to achieve the department’s objectives.Help Desk Activities:Answer all inbound calls in an efficient and professional manner in order to provide the proper response and solution to the clients’ enquiries/ complaints.\nDevelop, maintain and update clients’ files and log all the calls on the system to safeguard fast retrieval of information when needed.\nFollow up on clients’ calls and enquiries where necessary in order to maintain high levels of customer satisfaction.\nMaintain information on the latest updates and changes in the client’s system in order to provide accurate information and high-quality services to ASC’s clients.\nIdentify high critical client issues and transfer them to the Team Leader - Help Desk in order to take proper action.\nIdentify high technical client issues and transfer them to the Concerned Department under the Information Technology Division.\nUpdate the Team Leader - Help Desk on work progress, pending tasks, complaints and incidents in order to ensure all clients’ requests are resolved in a professional and timely manner.\nRecord all planned / unplanned Internet outages including the areas affected and down time while finding the proper solution for the cause behind these outages.\nPerform other duties related to the job as assigned by the Direct Manager.Reports:Prepare reports covering the main activities required by the job role such as recurring complaints reports or other customized reports as requested by the Direct Manager.Skills",
    "Skills": [
        "Diploma or bachelor’s degree in Information Technology, Computer Engineering or related field.\nMinimum of 1 - 3 years of experience in the same or related field.\nGood command in English and Arabic.\nMust have a valid Kuwait Driving license.\nAble to work with different shifts\nHaving at least below certificates:",
        "Nutanix\nMCSE\nCCNA\nA+\nN+"
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}