{
    "Job ID": "4743025",
    "Description": "Operate as the lead point of contact for all matters specific to LHL local / inetrnational customers.\nBuild and maintain strong, long-lasting customer relationships\nDevelop a trusted advisor relationship with key accounts, customer stakeholders.\nEnsure the timely and successful delivery of our solutions according to customer needs and objectives\nAssist with high severity requests or issue appreciations as needed.\nConduct Service review meetings with key customers\nCommunicated with Sales Manager to develop a quarterly rolling revenue and monitor actual progress\nMonitor & Report variances against forecast and budget on a monthly basis to the Designated Authority.\nIdentify innovative, analytical ways and tools for the customer satisfaction and service loyalty.\nDevelop new customers and Provide after sales service in line with company vision, mission and values.\n Lead sales development process including bidding, contract negotiation, contract approval and closure for appointed accounts.\nIdentify and grow opportunities within territory and collaborate with teams to ensure growth attainment.\nIdentify and actively hunt for new projects opportunities and develop sales to expend our services in the regions.\nMaintain existing accounts and develop long term / Short term win-win strategic relationship through sales visits\nEnhance internal and external customers' experience through excellent CRM - The Quality and Timely Delivery of contracted Services.\nAnalyze reports to identify and determine causes of problems develop & implement solutions for improvement.\nProvide effective Grievance Management for Customer delight. Develop and maintain effective strategic relationships and communication channels with other key stakeholders including the Business leadership and\nManagement, Employees, Staff leadership, other Department Heads, Contractors, and Vendors.\nForecast and track key account metrics (e.g. quarterly sales results and annual forecasts)\nContributes information to sales strategies by evaluating current product results; identifying needs to be filled; monitoring competitive products; analyzing and relaying customer reactions.\nManage and solve conflicts with clients\nTo use alternative dispute resolution methods which includes mediation and arbitration to resolve conflicts with Clients to ensure effective business relations.\nPrepare reports on account status\nCommunicate clearly the progress of monthly/quarterly initiatives to internal and external stakeholders.\nDefine goals and key performance indicators for each member of the team and ensure effective application of the group's performance and development review process\nEnsure proper handover / kick off meeting with the operation / project management team for awarded jobs.\nSupport operation / prject management team\nInitiate in coordinate with operation / project management for lesson learned evaluation meetings as per project requirement.Skills",
    "Skills": [
        "Solid experience with CRM software and MS Office (particularly MS Excel)\nExperience in delivering client-focused solutions based on customer needs\nProven ability to manage multiple projects at a time while paying strict attention to detail."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 6 Max: 0",
        "Residence Location": "All GCC Countries; Bahrain; Oman; Saudi Arabia; United Arab Emirates",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}