{
    "Job ID": "4743759",
    "Description": "We are looking for Call Center Agents in Dubai who meet the following requirements:* Must have good English communication and customer service skills both verbal and written. Arabic speaking is an advantage.* Proficiency with computers especially with CRM software and strong Typing / Data entry skills.* Respond to customer questions in a polite and timely manner.* Should be able to sell for your incentives * Attend large amounts of Inbound / Outbound customer interactions via phone, email, chat or social media.* Capture / Resolve customer feedback & complaints and manage as per process.* Ability to work in a team environment of different nationalities & culture* Flexible to work in rotational shifts (3AM logout), week offs, breaks and adjust to changing business requirements. * Ready to join immediately* Candidate only with a Positive Attitude requiredSkills",
    "Skills": [
        "* Experience: 0-1 year preferred ",
        "* Qualifications: Degree or Diploma in any discipline. Education documents should be UAE attested.",
        "* Salary: AED 2500 + incentives (Salary inclusive of transport & accommodation)",
        "* Working Hours: 9hrs (Incl 1hr break). 6 working days a week. Rotational weekoff",
        "* Gender: Any Gender",
        "* Nationality: Any Nationality",
        "* Language Skills: Fluent in English (written and spoken) is a must. Arabic & any other language is an added advantage",
        "* Computer Skills: Basic Microsoft Office and typing",
        "* Current Location: Dubai Silicon Oasis, Dubai. Should be available to visit for an interview on call.",
        "* Level: Entry level",
        "* Contract: 2 years. Quitting within contract will lead to penalty",
        "* Visa Status: Visit or Canceled",
        "* Benefits: Company visa, Emirates ID, Insurance and other benefits as per UAE law",
        "* Share your updated contact number and CV",
        "Please read carefully: Only if you feel that you meet the above criteria’s and are interested you may apply"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Business Process Outsourcing (BPO)",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}