{
    "Job ID": "4743697",
    "Description": "Manages and directs the external operations - customers and daily tripsPlans, schedules and reviews workload and manpower to ensure targets are being met on a cost-effective basis based on monthly operational index.  Performs visual controls by ensuring all trucks and compactors are mechanically fit.  Analyzing data to increase business operational efficiency by checking company’s fleet and drivers' performance Ensure to create updates and close the RO’s after getting complaints from the drivers.  Communicates with all relevant clients to ensure delivery times are met according to tasks assigned.  Responsible for resolving accident-related communication Monitoring driver behavior and ensuring a high level of customer service.  Communicates any changes in OPS to all external parties and follows up on interruptions to the trips.  Adhere to washing of equipment schedules and preventive maintenance through ICMAS along with MTC Department Accept Customer Calls in Case of emergencies  Working with the HR department to schedule employee training on vehicles or equipment  & perform driver evaluations. Improves operational systems, processes, and best practices for organizational well-being.  Contributes towards the achievement of Company’s strategic and operational objectives.  Responsible for handling internal drivers, labors queries, resolving their issues and providing best solutions.  Assigning and following up trips on IcMas with LOG Visit each existing customer after every three months.  Ensure new site inspections Responsible for providing recommendations regarding suitable equipment for the clients.  Responsible for reviewing all trips against contracts.  Assign tasks from TEAMS and update every week with progress.  Responsible for sharing the accident report with HR with necessary details in the prescribed format.  Initiate the food allowance request to accounts department every week.  Review, collect and approve supplier invoices.Managing invoice deliveries on time, via Drivers and follow up collections. Any other tasks assigned by management.  Skills",
    "Skills": [
        "Proven working experience as an Operations Supervisor.  ",
        "Record of successful distribution and logistics management.  ",
        "Demonstrable ability to lead and manage staff.  ",
        "Proficient in standard operations software.  ",
        "Excellent analytical, problem solving and organizational skills.  ",
        "Ability to work independently and on multiple projects.  "
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Gender": "Male",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Waste Disposal & Recycling",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}