{
    "Job ID": "4743929",
    "Description": "Position Title:             Restaurant ManagerEmployment Type:     Full-timeSalary:                        up to 12.5K AED, all-inclusive depending on experience and qualifications plus uniform, centralized tips and service chargeJob Location:             Dubai, UAE About the Client: A prominent 3-star international hotel, welcoming Dubai guests in a vibrant comfortable setting perfect for business and leisure travels. Job Responsibilities:Coach, schedule, and manage restaurant staff, including servers, kitchen staff, and support personnel and address any issues that arise internally within the team.\nEnsure that customers receive exceptional service and have a positive dining experience by being present and approachable, being able to handle customer complaints and concerns.\nManage inventory levels for both kitchen ingredients and front-of-house supplies to avoid shortages and wastage and coordinate with suppliers to ensure timely delivery of fresh and quality ingredients while minimizing food waste.\nOversee daily operations, including opening and closing procedures, reservations, seating arrangements, and order taking while following health and safety regulations.\nMonitor sales, expenses, and profitability, and take actions to achieve financial targets by preparing financial reports, such as sales reports, cost of goods sold, and labor costs. Skills",
    "Skills": [
        "Qualifications",
        "Open to Mediterranean countries\nFemale, 28 to 40 years old\nShould have at least 3 years’ experience on the same role\nOpen to overseas applicant",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}