{
    "Job ID": "4743008",
    "Description": "Manager – Products and Service (SMS)As the product lead for SMS for the Kalaam Group, the one-stop digital solutions provider, you will be working a lot on coordinating and communicating with internal departments and partners as well as other administrative tasks. We are looking for someone that is proactive and highly motivated towards carrying out their responsibility of performing a range of administrative tasks to support the Group Director of Commercials, as well as providing general support for the Department.Duties and Responsibilities:Leading Enterprise and wholesale SMS business vertical.\nDeveloping SMS service business roadmap and strategies to enhance SMS business.\nManaging SMS business unit (Technical and Commercial) to achieve the agreed roadmap and goals.\nManagement and coordination with carriers and SMS providers.\nPerforming process automation to enhance internal and external user experience, avoid revenue leakages, Auto provisioning etc.\nSupport sales team Identifying and Approaching potential clients in each sector.\nPerform Cross Selling between SMS partners.\nResponsible to increase sales for Wholesale and Enterprise SMS business.\nManage SMS process, policies, and procedures as well as the teams.\nBe well-versed with SMS sender ID policies, rules, and regulations for all SMS destinations.\nResponsible for maintaining and increase profitability on SMS services.\nIntroduce innovation and continuous enhancement to product portfolio\nManagement of product Capitals and Operating ExpenditureSkills",
    "Skills": [
        "Education:",
        "   Bachelor’s degree in Business administration BBA, Bachelor’s degree of commerce B. Comm or any relevant degree. ",
        "Required Skills, Abilities, and Experience:",
        "Minimum 3 to 5 years relevant experience is must.\nDeep knowledge and experience on SMS service technically as well as commercially.\nBe well-versed with SMS sender ID policies, rules, and regulations for all SMS destinations.",
        "•       Should possess coordination skills and project-based experience.",
        "•       Hands-on experience with relevant systems.",
        "•       Extensive computer skills in Microsoft Word, Excel, PowerPoint, and Outlook.",
        "•       Excellent time management, organization and prioritization skills.",
        "Excellent Customer Service skills\nEffective communicator - verbal, written and presentation skills\nExcellent Teamwork and cooperation skills\nExcellent Problem-Solving skills",
        "•       Knowledge of Networks and Telecom Technologies",
        "•       Experience in group product trainings"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5"
    },
    "Data": {
        "Job Location": "Al Muharraq, Bahrain",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}