{
    "Job ID": "4743827",
    "Description": "Lead end-to-end project management efforts, including planning, execution, monitoring, and successful delivery.\nFoster collaborative relationships with clients, taking on an Account - Manager role to understand their requirements and maintain a high level of customer satisfaction.\nCollaborate closely with our pre-sales team to develop project proposals, offering insights and recommendations that align with client goals.\nUtilize your pre-sales acumen to contribute to solution design, ensuring technical feasibility and alignment with client needs.\nEffectively communicate project progress, timelines, and potential roadblocks to stakeholders, both internal and external.\nDrive cross-functional teams, harnessing the strengths of diverse departments to achieve project milestones.\nEmploy agile methodologies where applicable to enhance project efficiency and adaptability.Skills",
    "Skills": [
        "Bachelor's degree in a relevant field.\n5-7 years of proven project management experience.\nExperience in the telecom or network sector.\nAbility to handle mega projects.\nDemonstrated success in client-facing roles such as Account Management.\nProficiency in pre-sales activities, including proposal development and solution design.\nStrong organizational and communication skills.\nAbility to lead cross-functional teams and inspire collaboration.\nPMP, PRINCE2, or equivalent project management certification is a plus.\nFluent in English and Arabic."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Hail, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}