{
    "Job ID": "4743923",
    "Description": "Position Title:             Junior Sous ChefEmployment Type:     Full TimeSalary:                         up to 9K AED, all-inclusive depending on experience and qualifications plus uniformJob Location:            Dubai, UAEAbout the Client:A prominent 3-star international hotel, welcoming Dubai guests in a vibrant comfortable setting perfect for business and leisure travels.Job Description:Execute cooking techniques and recipes specific to Mediterranean cuisine, which often includes grilling, roasting, sautéing, and working with ingredients like olive oil, fresh vegetables, seafood, and various herbs and spices.\nFollow established recipes and guidelines provided by the head chef to maintain consistency in flavor, presentation, and portion sizes.\nMonitor the quality of ingredients and finished dishes, making sure they meet the restaurant's standards for taste, texture, and presentation.\nCollaborate with other kitchen staff, such as line cooks, prep cooks, and other sous chefs, to ensure smooth communication and coordination during busy service times.\nAdhere to strict hygiene and safety standards, including proper food handling, storage, and sanitation practices, to prevent contamination and ensure a clean working environment while serving on a timely manner.Skills",
    "Skills": [
        "Qualifications:",
        "Male, 28 to 40 years old\nBachelor’s degree in Chemistry; Master’s degree is a plus\nMinimum 3 years’ experience in the same role from mediterranean cuisine background\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Gender": "Male",
        "Nationality": "Albania; Algeria; All Arab Countries; Bosnia and Herzegovina; Croatia (Hrvatska); Cyprus; Egypt; France; Greece; Jordan",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}