{
    "Job ID": "4743835",
    "Description": "Job purposeResponsible for writing and preparing visitor programs for all ages, and delivering some programs to ensure enjoyable, safe, and educational visits in compliance with Education and Program department and Museum policies and procedures.Summary:The Children’s Museum Jordan is seeking a full-time Content Developer to develop non-formal activities and programs, looking for a person who is equal parts scientist and creative writer. Someone as passionate about accuracy, fun, and science as they are the experience.Responsible for writing and preparing visitor programs for all ages, and delivering some programs to ensure enjoyable, safe, and educational visits in compliance with Education and Program department and Museum policies and procedures.Functional Duties:• Write content and prepare related kits for high-quality programs.• Develop program content, write brief, upload, and archive all content.• Review and evaluate existing content.• Train all facilitators (science, literacy, tinkering, early childhood development, etc.) on program content.• Evaluate the facilitator and reflect on the results on a program or project basis.• Document program content on the Museum system.• Prepare and submit periodic reports including feedback on program activities.• Adhere to Education and Program Department and Museum policies and procedures.• Perform other tasks related to the job assigned by the direct manager.CommunicationInternal Communication:• All DepartmentsExternal Communication:• Partners and solicited artists/scientists• Families, school groups, and teachersWorking conditionsPhysical Requirements• LowWork Environment• Office workWork Risks• LowSkills",
    "Skills": [
        "Qualifications:",
        "Bachelor’s degree in any field.\nHave a minimum of three years in the development and delivery of science or drama or literacy programming for children, parents, teachers, and caregivers with a primary focus on children ages 1-12 years old. , preferably in schools or educational institutes \nSignificant science communication experience (via video, social media, improvement, teaching, etc.) engaging diverse audiences in STEM.\nFamiliarity with informal STEM education and its principles.",
        "General Skills:",
        "Attentive to details.\nCreative writers in Arabic, English, or both.\nFast learner\nGood researcher\nHand sketching\nAbility to produce prototypes.\nProject planning and time estimating.\nExcellent planning, organizational, and problem-solving skills.\n• Ability to handle sensitive/confidential information professionally\n• Problem-solving and analytical abilities\n• Excellent communication and interpersonal skills\n• Leadership and motivational abilities\n• Ability to work under pressure.",
        "Technical Skills:",
        "Cost analysis capabilities.\nCreative, innovative, and always generating ideas.",
        "Language",
        "·       English: excellent writing and speaking"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}