{
    "Job ID": "4743628",
    "Description": "Manage and supervise the daily operations and tasks that take place within the accounting department of the company.\nAnalysing the differences and deviations resulting from the comparison of actual expected revenues and expenses, and identifying the reasons for the fundamental deviations.\nOrganizing and preparing annual inventories.\nImplementation and application of appropriate accounting methods, principles and policies.\nDeveloping and applying new systems in accounting for collecting and analysing information and writing reports on it.\nWork directly with employees in the finance department and the financial manager.\nClosing accounts at the end of a month and at the end of a year.\nReview and approval of payment and receipt vouchers.\nCalculating the cash revenues collected by the company and implementing and monitoring the inventory of capital assets.\nMonitoring the general ledger.\nSupervising the process of paying salaries and all payments and expenses.\nPreparing and managing budgets.\nMake suggestions.\nImproving the company's financial accounting systems and procedures.\nDefining projects and assigning team members to work on them in the best way to achieve the goals.\nAchieving the goals of financial accounting.\nCreate and maintain financial files and records to document all transactions and movements that have been made.\nPlanning, implementing and supervising the company's comprehensive accounting strategies.\nRecruitment of new employees in the Accounting and Finance Department.\nRecording financial and economic operations in a comprehensive and orderly way.\nClassification, recording, posting, and summarizing, in addition to writing, organizing, and arranging financial transactions and presenting them in a way that allows users to understand them.\nPreparing periodic reports containing income statements and an analysis of debts and cash flow.\nDetermine the expected future financial resources and expenditures.Requirements for working in the position of Account Manager:Bachelor's degree in Commerce Department of Accounting or a related field .Eight years of experience inaccounting, of which three years should be in an account manager position.Language preferred Hindy-EnglishSkills",
    "Skills": [
        "Analytical capabilities for various work matters.",
        " Mathematical and technical skills.",
        " The ability to solve problems.",
        "the ability to work in a team,",
        "Building strong relationships within the business.",
        " Possession of technological skills",
        "Necessary, strong knowledge of tables",
        "Electronic data."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 8",
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Ras Al Khaimah, United Arab Emirates",
        "Company Industry": "Merchandising",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}