{
    "Job ID": "4743477",
    "Description": "To maintain traceable record of reports in computer.\nTo ensure all record (soft and hard copies) are secured and traceable.\nTo ensure reports submission to contractors and main clients as per customer requirement.\nTo ensure minimum paper waste during the coordination process, less than 1%.\nTo coordinate testing schedule with customers and laboratory teams\nTo prepare schedule for lab and field testing\nTo Assign field technicians for scheduled activities\nTo update field activities on company online platform.\nTo ensure full cooperation and coordination with customers as and when required.\nTo collect, evaluate and analyze multiple data for different operational activities.\nTo prepare multiple business reports instructed and guided by respective HOD.\nTo perform data analysis of sales & marketing activities of relevant department.\nTo perform data analysis of QA/QC activities of relevant department.\nTo perform in QA/QC activities for the implementation of ISO management systems.\nTo prepare multiple requests like MRR, PRs etc. and maintain their records.\nTo assist the management in payment recovery activities.\nTo perform all other related jobs assigned by Management.\nYour job description may vary from time to time with the sole discretion of the company.\nLogging new samples in Computer and Logbooks and preparing Information/Worksheets for required tests.\nAssigning control numbers to new Samples.\nSchedule testing of new samples.\nMaintaining a soft copy of all new worksheets with control numbers for reference.\nPreparation and submission of Reports to superiors for Verification and Authorization.\nRectification of reports and re-submission to Supervisor for verification and approval.\nLess than 1% clerical error in reports.\nSuggest improvement in reporting format for effectiveness.\nTo ensure full cooperation and coordination with customers\nTo maintain traceable record of all inquiries, proposals and purchase orders.\nTo ensure all record (soft and hard copies) are secure and traceable.\nTo send reminders to all the clients well in time.\nTo market and develop the business all over the kingdom through different strategies\nTo prepare the report of daily visits of marketing team\nTo make follow ups with the clients through calls and emails.\nTo prepare and send the quotations/ proposals to clients based on the RFQs received.\nTo conduct analysis for business development of those areas for which we do not have the capabilities.\nTo coordinate with clients on regular basis\nTo maintain the data on CRM for leads, opportunities, and communications.\nTo provide back-office support to the sales and marketing team\nTo perform all other related jobs assigned by Manager/ marketing team Communications with Customers\nTo submit Prequalification to customers for vendor registration.\nTo prepare and submit documents for project-based approvals.\nTo perform QC reviews of internal and external certificates and reports.Skills",
    "Skills": [
        "Passed Linked In assessment results of Microsoft Excel\nMicrosoft Office\nFluent in English and Arabic\nTyping Speed 30 words/ minute in English\nTime management and organizational skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 10"
    },
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Civil Engineering; Chemicals Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}