{
    "Job ID": "4743970",
    "Description": "Plan and coordinate all aspects of exhibition operations, including interior design, product displays, and promotions.\nLead and guide the sales team in achieving sales targets and increasing the company's market share.\nDevelop and implement effective sales strategies to boost revenue and achieve financial goals.\nBuild and maintain strong relationships with customers, delivering high-level service.\nMonitor and evaluate employee performance, providing necessary guidance and training.\nAnalyze market trends and provide regular reports on performance and future trends.المسؤوليات:التخطيط والتنسيق لجميع جوانب عمليات المعرض، بما في ذلك التصميم الداخلي، وعرض المنتجات، والترويج.\nقيادة وتوجيه فريق المبيعات لتحقيق أهداف المبيعات وزيادة حصة الشركة في السوق.\nوضع وتنفيذ استراتيجيات مبيعات فعّالة لزيادة الإيرادات وتحقيق الأهداف المالية.\nبناء والحفاظ على علاقات قوية مع العملاء، وتقديم خدمة عالية المستوى.\nمراقبة وتقييم أداء الموظفين، وتقديم التوجيه والتدريب اللازم.\nتحليل اتجاهات السوق، وتقديم تقارير دورية حول الأداء والاتجاهات المستقبلية.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Previous experience as an Exhibition Manager or in related sales roles.\nExcellent leadership skills and the ability to motivate and guide a team.\nEffective communication skills and the ability to build strong customer relationships.\nDeep understanding of exhibition management and organizing promotional events.\nExperience in marketing and agency management within the advertising field.\nProficiency in various design software programs (Illustrator, Photoshop, CorelDRAW).\nExperience in video editing software.\nFamiliarity with operating a laser cutting machine.",
        "المؤهلات والمهارات:",
        "خبرة سابقة كمدير معرض أو في مجالات المبيعات ذات الصلة.\nمهارات قيادية ممتازة، والقدرة على تحفيز وتوجيه الفريق.\nمهارات اتصال فعّالة، والقدرة على بناء علاقات قوية مع العملاء.\nفهم عميق لإدارة المعارض وتنظيم فعاليات الترويج.\nخبرة في مجال التسويق وإدارة وكالات الإعلان.\nإجادة استخدام برامج التصميم المختلفة (الإليستريتور، فوتوشوب، كورل درو).\nخبرة في برامج تحرير الفيديو.\nمعرفة بالعمل على ماكينة قص الليزر."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Marketing; Market Research",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}