{
    "Job ID": "4743896",
    "Description": "E-commerce Strategy and Planning:Developing and implementing e-commerce strategies to increase sales and improve customer experience.\nConducting market research and identifying e-commerce trends and best practices.\nCreating and managing product listings and descriptions.\nNegotiate annual commercial agreements with e-commerce partners.\nResponding to customer inquiries and resolving issues related to orders, payments, and deliveries.\nDeveloping customer service policies and procedures.\nCollaborating with internal and external stakeholders, including sales and marketing teams, to achieve e-commerce goals.\nDevelop & maintain relationships with e-commerce partners.\nParticipating in cross-functional meetings and projects.Skills",
    "Skills": [
        "Strong understanding of e-commerce platforms, tools, and technologies.\nExcellent negotiation skills.\nKnowledge of e-commerce best practices, including pricing, promotions, and customer engagement strategies.\nExperience with online payment processing and order fulfillment.\nFamiliarity with e-commerce analytics and reporting tools.",
        "Marketing Skills:",
        "Strong understanding of digital marketing principles and strategies.\nExperience with email marketing, social media marketing, and search engine optimization (SEO).\nAbility to develop and execute effective marketing campaigns.\nExperience with data analysis and reporting to measure the success of marketing campaigns.",
        "Technical Skills:",
        "Knowledge of web development, HTML, and CSS.\nExperience with content management systems (CMS) and web analytics tools.\nFamiliarity with e-commerce integrations, such as payment gateways.",
        "Communication and Collaboration Skill:",
        "Excellent communication skills and ability to work collaboratively with cross-functional teams.\nStrong interpersonal skills and ability to build relationships with customers and partners.\nAbility to negotiate and resolve conflicts.",
        "Analytical Skills:",
        "Strong data analysis skills and ability to interpret website traffic and sales data.\nAbility to identify trends and insights and develop actionable recommendations.\nExperience with A/B testing and conversion rate optimization (CRO).\nAbility to create and deliver reports and presentations."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}