{
    "Job ID": "4743625",
    "Description": "Core ResponsibilitiesEnsure all disbursements are processed completely and promptly\nMaintain, disburse and oversee Petty cash – funding and operational floats\nImplementing the treasury policies and procedures\nInvolve in monthly closing procedures for recording of deferred revenue, prepayment and accrual\nGroup commission calculation, payment & ongoing monitoring.\nAssist in preparation of monthly trial balance reports, income statements, balance sheets and cash flow forecast reports.\nPrepare VAT calculation and ensure timely submission of the Return and payment of tax\nMaintain books of accounts with complete accuracy\nAssist in external annual audit for preparing lead Schedules.Due Diligence:Analyse financial and non-financial/operational results of target companies using accounting information\nIdentifying and understanding key drivers of a business and potential deal breakers (financial and non-financial)\nIdentify diligence issues which may affect purchase price, deal structure or deal termination\nAdvanced analytical skills with experience collecting, organizing, analyzing, and disseminating abundant information with accuracy\nImprove, execute, and effectively communicate significant analyses that identify meaningful trends and opportunities across the businessSkills",
    "Skills": [
        "• 6 - 8 years UAE experience with corporate services provider/legal service.",
        "• Bachelor’s Degree in Accounting or Finance",
        "• CPA/ACCA/CMA would be added advantage",
        "• Proficient in MS Office (MS word & MS excel etc.)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Corporate Management Office; Management Consulting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}