{
    "Job ID": "4743729",
    "Description": "Are you an Exhibition Stand Designer, looking for your next challenge? This role will create designs for Exhibitions, interiors and events.A minimum of 2-year exhibition experience is MANDATORY.If this is you, Ncube Expo would like to talk to you!The exhibition stand designer will work with the client and sales team in meeting objectives and exceed client expectations by delivering best-in-class, creative, innovative, and captivating designs which will help elevate the brand.Who we areNcube Expo is a global provider of 360-degree exhibition solutions specializing in designing, building, and curating custom exhibition stands and event operations promoting industry advancements. By upholding our well-known reputation, we offer creative, persuasive, and motivating solutions that improve the whole experience. We support worldwide organizations and event planners in providing the best event experiences. We provide professional, innovative, and high-impact exhibition booths, collaborating with companies across a wide range of industries. Ncube operates across all significant geographical areas, with a focus on South East Asia, India, and the Middle East. In emerging economies like Saudi Arabia, the United Arab Emirates, India, and Singapore, we are renowned as a trustworthy partner as well as one of the top exhibition stand contractors.What you will doYou will:Develop and execute ideas from conceptualization for exhibitions, events & fit-outs\nWork closely with the sales teams in ensuring the design is aligned with the client’s requirements.\nAssist in Projects where teamwork is required.\nGenerate and prepare design plans and ideas for new design concepts and specifications.\nVisit events for inspiring ideas, and the latest technologies used by other brands and find ways to incorporate innovation in the designs.\nTravel to show venue (local and international) to assist operations teams to fulfill client requirements for the show, if required\nOrganize/ attend meetings with the clients and internal teams for a better understanding of the projects or feedback and revision\nHave in-depth knowledge of designing tools and current trendsYou have:Minimum Diploma or Degree in Interior/Space/Exhibition Design or related discipline (Education no bar for the right candidate)\nMinimum 2-3 years of relevant experience.\nWell-versed in 3D Studio MAX, V Ray, and SketchUp.\nGood communication and presentation skills.\nExperience in AutoCad, illustrator, photoshop\nExperience in floor planning for exhibitions is a plus\nAbility to work without supervisionLocation:Al Barsha Office, Dubai*May also require you to work from Riyadh and Bangalore offices for a short period, if requiredDevelopment and BenefitsNcube Expo is proud to be an equal opportunity employer. We help discover the champion within you. We look to equip you with the tools required for you to progress in your career with us. With plenty of internal opportunities to move within the business and the backing of senior exhibition pioneers, we believe in providing the right support, assistance, and career growth, nurturing and valuing each of its team members.This is a full-time role offering a competitive salary between AED 2500 to AED 4000 per month, dependent on experience. Other benefits include incentives, travel opportunities, medical insurance, and visa.Skills",
    "Skills": [
        "Designers AutoCad, illustrator, photoshop,ell-versed in 3D Studio MAX, V Ray, and SketchUp"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Advertising; Events Management; Entertainment",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}