{
    "Job ID": "4743833",
    "Description": "We are currently seeking a dedicated and detail-oriented Financial Collector to join our team in Riyadh, Saudi Arabia. As a Financial Collector, you will be responsible for managing and collecting outstanding debts from our clients. This role requires strong communication skills, attention to detail, and the ability to work independently. The ideal candidate will have a minimum of 5 years of experience in financial collections and a strong understanding of debt recovery processes.Responsibilities:Contact clients to discuss outstanding debts and negotiate payment plans\nMonitor and follow up on overdue accounts\nResearch and investigate delinquent accounts to determine reasons for non-payment\nPrepare and send collection letters and notices to debtors\nDocument all communication and actions taken in the collection system\nWork closely with the finance and legal departments to resolve any escalated issues\nProvide regular updates on collection activities to management\nDevelop and implement strategies for improving collection efficiency\nStay up-to-date on industry regulations and best practices in debt recoverySkills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum of 5 years of experience in financial collections or related field\nStrong negotiation and communication skills\nExcellent attention to detail and problem-solving abilities\nAbility to work independently and meet deadlines\nProficient in using collection software and Microsoft Office Suite\nKnowledge of debt recovery processes and legal requirements\nAbility to handle high-pressure situations and difficult clients\nStrong organizational and time management skills\nFluency in Arabic and English is required",
        "Strong negotiation and communication skills\nExcellent English Language skills\nAbility to work independently and meet deadlines\nProficient in using collection software and Microsoft Office Suite\nKnowledge of debt recovery processes and legal requirements"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 11",
        "Residence Location": "Riyadh, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}