{
    "Job ID": "4743006",
    "Description": "Education and Experience Requirements Faculty members will be placed in the appropriate rank based on their education and experience. The broad criteria are noted below. For Senior Lecturer and LecturerA Master's Degree in English, Linguistics (ESL, TESOL), Writing Studies, (Technical) Communication, or a related program of study from a recognized, accredited institution. ExperienceA minimum of three (3) years full-time teaching experience in upper secondary, post-secondary, or higher education institution.\nA mix of academic and professional experience is welcome.\nDemonstrated ability to use a variety of educational technology and platforms.\nDemonstrated academic and information literacy skills. Scholarship and Research Contribution to the advancement of knowledge through applied research, scholarship, publications, knowledge transfer or professional practice which would be expected to be international in its scope. Other required skillsCommitment to applied and experiential learning as a pedagogy and a key feature of UDST's mandate.\nAbility to design, develop, deliver, and evaluate authentic learning experiences and assessments incorporating contemporary tools and resources to maximize content learning in context and to develop the knowledge, skills, and attitudes identified in program outcomes.\nDigital literacy and demonstrated fluency in technology systems, and an ability to model and facilitate use of current and emerging digital tools to support research and learning.Job Details",
    "Skills": [],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 0",
        "Degree": "Master's degree",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}