{
    "Job ID": "4743023",
    "Description": "Perform the assigned duties as per the set policies and procedures in order to achieve the department goals.\nExecute the approved HSE policies and procedures, plans and programs in the plant.\nDevelop health and safety guidelines, policies and procedures.\nAlign with the latest health and safety techniques standards and accordingly recommends updating policies and procedures.\nDevelop plant's safety analyses or other plant risk management methods to control high risk activities.\nIdentify potential conditions and practices in systems, equipment, machines or processes to be used in plant and develop methods for managing such conditions.\nConduct random health and safety checks in the plant to ensure compliance with the health and safety policies and guidelines based on the set plans.\nParticipate in the investigation of health and safety incidents and ensure effective investigation, analysis and reporting of all health and safety incidents.\nEnsure incidents are reported to the concerned manager if any and indicating the recommended course of action.\nAssist in the implementation measures to prevent recurrence of such incidents after coordination with the concerned manager.\nReport non-compliance with the health and safety policies and guidelines along with recommended rectification actions.\nApply and use the HSE tools, forms, mechanisms needed to gather data and information.\nDevelop the relevant health and safety reports including the incidents that occurred, the recorded time & place of the incident and the recommended course of action.\nDevelop safety programs in the plants; that includes ensuring the availability of safety manuals, hazardous area instructions, safety materials, safety publications and posters.\nGather and compile data generated from inspection visits and discuss them with the concerned parties.\nEvaluate plant commitment to ensure providing a safe work environment.\nPrepare and submit update reports to the direct manager regularly.\nAny other tasks related to the job assigned by the direct manager.Skills",
    "Skills": [
        "Ability to identify health hazards and nip them in the bud.\nProficient with risk identification alongside dynamic problem resolution.\nExcellent communication and interpersonal skill.\nDecision making skills.\nMonitoring Skills.\nAnalytical and problem-solving skills\nGood knowledge in Microsoft Office."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 6",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}