{
    "Job ID": "4743529",
    "Description": "Being successful with this application will enable you to join an industry leader of Domestic Services here in Dubai. Joining our professional and experienced Call Centre Team where you can display your outstanding sales and customer service skills and competencies and grow and develop further with our excellent onsite training and mentoring.Immediate opening- Joining for 1st September or before.Working between 2 shifts: 8am- 5pm or 10am- 7pm 5.5 days per week.Deliver a high level of customer service, displaying excellent language skills per client, for example Bilingual in English or Arabic, written and oral.\nEnsure that a high level of quality standard and attention to detail is applied throughout, and the correct information is obtained from the customer for the use of contracts, changes in services, and renewals.\nDisplay exceptional product and service knowledge, taking pride in the company you work for and our product and service at all times.\nWork within clearly outlined KPI’s and targets.\nMaintaining fruitful relationships with existing and new customers\nIdentify and assess the client’s needs and obtain client information.\nProvide accurate and complete information about the services offered by the Company.\nPersuade potential clients to purchase a service from the Company.\nTake the client through the booking process in a clear and informative manner.\nRecommend new services, value added services, upgrades and renewals.\nFollow up on initial contacts and build relationships through open communication.\nHandle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution\nMaintain enquiries and the client data bases\nFollow up on initial contacts and build relationships through open communication.\nHandle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution\nContact businesses or private individuals\nKeep records of all conversations in our call center database\nDegree Holder\nExperienced in IT applications and call center management systems\nAccurate typing and database management\nLanguage skills, (English /Arabic Preferred)\nSales and Customer-Centric\nPersuasive in verbal communication, negotiation skills and adaptabilitySkills",
    "Skills": [
        "Deliver a high level of customer service, displaying excellent language skills per client, for example Bilingual in English or Arabic, written and oral.\nLanguage skills, (English /Arabic Preferred)\nSales Focused and Customer-Centric\nPersuasive in verbal communication, negotiation skills and adaptability"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}