{
    "Job ID": "4743624",
    "Description": "Network Support Technician Responsibilities:Collaborating with the IT department on the deployment and maintenance of network technologies.\nEnhancing intranet performance and creating internet domains.\nTesting the exchange of data between computers, servers, modems, and routers.\nInstalling, configuring, and updating network software, as well as maintaining hardware and network devices.\nPerforming diagnostic tests and repairs, as well as developing data archiving, backup, and retrieval procedures.\nOptimizing server capacity to keep up with demand in online traffic.\nTesting network protocols and ensuring stable and secure server connectivity.\nTraining junior IT personnel, providing onsite or remote or technical support, and preparing user manuals.\nDocumenting network processes and layouts, as well as enhancing network security.\nKeeping abreast of developments in network infrastructure and technologies.Skills",
    "Skills": [
        "Bachelor's degree in computer science, information technology, or similar.\nCertified Microsoft, CompTIA, or Cisco network professional preferred.\nAt least two years' experience as a network support technician.\nIn-depth knowledge of network infrastructure, architecture, connectivity, and security.\nSuperb analytical and problem-solving skills.\nExceptional organizational and time management skills.\nExcellent interpersonal, communication, and collaboration skills.\nWillingness to travel to client locations.\nAvailability to perform urgent network repairs outside of business hours."
    ],
    "Preferred": {
        "Residence Location": "Philippines"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}