{
    "Job ID": "4743888",
    "Description": "Quality Control Building Inspection Trainer - Immediate StartSince 2014, Niagara College KSA (NC KSA) has operated technical and vocational training colleges throughout the Kingdom of Saudi Arabia in support of the Vision 2030 initiative and in partnership with the Colleges of Excellence (CoE). Headquartered in Riyadh, Saudi Arabia, NC KSA provides community and customized training based on Niagara College Canada's expertise and international track record as one of Canada’s most innovative and enterprising applied learning post-secondary institutions. With a strong focus on developing ‘world-’ and ‘work-’ ready graduates. A strategic partnership between Saudi Aramco, the Ministry of Labor and Social Development, TVTC & HRDF resulted in the establishment of the first academy for females in Al Khobar, Leading National Academy (LNA), which is a not-for-profit legally independent entity aiming at leading diversification of employment opportunities and building the capabilities of the Saudi female workforce through economy driven, elite, and agile training; committed to the values of integrity, excellence, diversity, citizenship, and safety responsibility. In partnership with NCKSA, LNA provides a specialized two-year diploma training program for entry-level jobs in new market opportunities. The first year, the Academic Program solidifies English, IT, Math, and H&S skills as part of the performance-based curriculum. In the second year, the Job Skills Program provides the latest knowledge and skills training in different vocational trades and sectors (e.g. Supply Chain Management, Chemical Lab Technician, Business Administration, Electrical Technician, Quality Control Building Inspection, and Health, Safety & Environment). LNA prides itself on its integral reliance on smart learning solutions (e.g. iPads, Smartboards, blended learning) to efficiently equip carefully selected trainees (A2 minimum) through high-quality training. Applicants are invited for the position of Trainer, Building Inspection at Niagara College KSA, Leading National Academy (LNA) in Al Khobar. Reporting to the Head, Job Skills Program, the Trainer, Building Inspection is responsible for delivering and facilitating Job Skills Training Programs in classrooms and relevant workshops to qualified Saudi Females for respective sponsoring companies. This involves monitoring the effectiveness and efficiency of the training programs and introducing blending learning methodologies which fosters exceptional performance of trainees and faculty.Responsibilities include but are not limited to:Deliver approximately 25-30 hours of training per week. \nPlan and deliver high-quality, function-based lessons in a dual setup (online and/or face-to-face) to non-native English-speaking learners of various abilities and levels in a vocational context.\nInstruct trainees on techniques, methods, language, and procedures required in basic vocational /or intermediate-level programs for clerical and business administration.\nOptimize the use of educational technologies to meet trainee learning needs.\nLiaise with community members and engage in program promotion.\nPrepare and maintain training materials in accordance with LNA practices such as Lesson Plans, in-house quizzes, tests, tools, and training aids.\nAssist, as assigned by management, and support in-house training programs and orientation of new hires.\nManage trainees and maintain class discipline.\nMake recommendations on and assist in the development, implementation, and evaluation of curriculum and training aids.\nParticipate in the development of the course curriculum and the production of high-quality teaching and learning resources, including resources in electronic formats.\nDevelop and administer a variety of assessment tools and assess trainee work in compliance with LNA practices and requirements from sponsoring companies\nLeverage technology to ensure high-quality blended learning solutions and teaching in the online and face-to-face classroom.\nEnsure compliance with the internal verification process and assume the role of the internal verifier for the given Specialization.\nPursue professional development opportunities in the field to provide the most up-to-date information and techniques to the trainees.Skills",
    "Skills": [
        "Required skills and qualifications, at a minimum, include:",
        "A Bachelor’s Degree in an appropriate scientific or engineering discipline (i.e. Building & Construction, Mechanical Engineering, Electrical Engineering, Industrial Engineering, Manufacturing Engineering, Architecture, or Civil Engineering) from a recognized university where the language of instruction is English; a Master’s Degree is preferred.\nMinimum of six (6) years of Building Inspection training delivery experience in an industrial, commercial, technical, vocational, or post-secondary environment. Three (3) out of the six years in a related work experience in an industrial or commercial Building Inspection field is preferred.\nApproved trades certification in the relevant discipline.\nNon-native speakers shall have either an overall Academic IELTS score of at least 6 or a TOEFL score of at least 79 on the internet-based test, 550 on the paper-based test or 213 on the computer-based test.\nDemonstrate ability to use technology to enhance teaching and learning using web-based technology.\nExceptional classroom management skills and the ability to create a learning environment that promotes and enhances trainee motivation.\nAbility to function as a team player within a multi-cultural work environment.\nEffective presentation and communication skills, both written and oral.\nAbility to work independently and to meet tight deadlines.\nStrong organizational, problem solving, and analytical skills.",
        "How to Apply:",
        "Position will be posted on the job portal website, Bayt\nSelect the \"Apply Now\" button displayed in the job posting and follow the instructions provided.\nIt is required that the mandatory questionnaire be completed.\nEnsure that your Bayt profile and CV information provided is up-to-date, and that you list all relevant work experience and education.\nCandidates will be shortlisted based solely on the information they provide through Bayt.\nIf experience is not included, the system will fail to recognize your qualifications and may automatically screen out your application.\nAll applications must be received through Bayt in order to be considered for review.\nNiagara College Saudi Arabia is committed to workplace diversity and provides accommodations to applicants with disabilities throughout our hiring process. If you require an accommodation, please inform us.\nWe thank all applicants; however, only those selected for an interview will be contacted."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}