{
    "Job ID": "4743537",
    "Description": "Assistant Financial ControllerCome join us and Make Every Moment Matter!Are you a passionate number cruncher? Have you got what it takes to solve problems, and drive people and profits? If you say Yes I Can! here at the Radisson Blu Hotel, we’re looking for fast paced individuals just like you!At Radisson Blu Hotel, we stand out together as one team and make memorable moments for our guests.Our Assistant Financial Controllers are pro-active and refreshing; making numbers stylish by supporting a team of passionate hoteliers who have the guest in the heart of all that they do.Do you want to be the payroll icon, are you pedantic for profit & loss, always with the guest in mind?We are looking for someone Yes I Can! ready, who can do it all!Key Responsibilities of Assistant Financial Controller:• Maximises cash flow performance of the• Assisting and providing financial guidance in the formulation and implementation of the hotel business plan and budget• Ensuring the payroll process is correct• Working with the outsourced Stock company to ensure that stock takes are correctly conductedSkills",
    "Skills": [
        "Requirements of Assistant Financial Controller:",
        "• A proven track record in a similar role within a hospitality environment and to be able to demonstrate excellent standards and team member management",
        "• Commercially aware and a natural problem solver",
        "• Driven and ambitious to inspire the team to consistently deliver and exceed",
        "• Clear thinker with excellent communication abilities",
        "• Strong working knowledge of Opera Property Management System",
        "• Strong knowledge of payroll, budget and revenue systems",
        "• An ability to build relationships with key internal and external stakeholders",
        "Are you ready to add some style to the month's end? Then this job is for you!"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Lebanon"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}