{
    "Job ID": "4743482",
    "Description": "Job Overview:We are seeking a highly motivated and detail-oriented Quality Engineer to join our team. The Quality Engineer will play a critical role in ensuring that our products meet the highest standards of quality and reliability. The successful candidate will work closely with cross-functional teams to implement and maintain quality control processes, conduct testing and inspections, analyze data, and drive continuous improvement initiatives.Responsibilities:Develop, implement, and maintain quality control procedures, processes, and standards to ensure compliance with industry regulations and company policies.\nCollaborate with engineering, manufacturing, and other departments to identify and address quality-related issues, ensuring timely and effective solutions.\nConduct thorough testing and inspections of products, materials, and processes to identify defects, deviations, and areas for improvement.\nPerform root cause analysis for quality issues, identify corrective and preventive actions, and track their implementation to prevent recurrence.\nUtilize statistical methods and data analysis tools to monitor process performance, identify trends, and proactively address potential quality concerns.\nLead or participate in cross-functional teams to develop and implement process improvements, reducing defects and enhancing overall efficiency.\nMaintain accurate documentation of quality assessments, test results, corrective actions, and process changes.\nCollaborate with suppliers to ensure the quality of incoming materials and components through audits, evaluations, and performance monitoring.\nProvide training to employees on quality control methods, procedures, and best practices to promote a culture of quality awareness.\nMonitor and report key performance indicators (KPIs) related to quality, presenting findings to management and stakeholders.\nStay informed about industry trends, advancements, and regulatory changes related to quality management.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Quality Engineering, Mechanical Engineering, Industrial Engineering,Civil Engineering or a related field.\nProven experience (1-5 years) in quality engineering or a similar role within (industry/sector).\nStrong knowledge of quality management principles, methodologies (e.g., Six Sigma), and industry standards (e.g., ISO 9001).\nProficiency in statistical analysis and data-driven decision-making.\nExcellent problem-solving skills with the ability to conduct root cause analysis and implement effective corrective actions.\nSolid understanding of manufacturing processes, materials, and quality control techniques.\nDetail-oriented mindset with exceptional attention to accuracy.\nStrong communication skills for effective collaboration with cross-functional teams and stakeholders.\nAbility to work independently and within a team, managing multiple projects and priorities.\nCertification in quality engineering (e.g., CQE) or relevant certifications in Six Sigma is a plus.\nProficiency in quality control software and tools is an advantage.\ncorrective actions.\nSolid understanding of manufacturing processes, materials, and quality control techniques.\nDetail-oriented mindset with exceptional attention to accuracy.\nStrong communication skills for effective collaboration with cross-functional teams and stakeholders.\nAbility to work independently and within a team, managing multiple projects and priorities.\nCertification in quality engineering (e.g., CQE) or relevant certifications in Six Sigma is a plus.\nProficiency in quality control software and tools is an advantage."
    ],
    "Preferred": {
        "Residence Location": "Tabouk, Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}