{
    "Job ID": "4743481",
    "Description": "Direct, manage and develop the marketing team.\nStudy relevant marketing techniques and analyze industry trends for planning new promotional tactics.\nCollaborate with different departments to align marketing goals and product development.\nExamining the marketing tactics for further improvement and effectiveness.\nDevelop plans for trade marketing investments and ensure expenses are within the assigned budget limits to create a positive financial impact on business revenue.\nIdentify and recommend improvement opportunities to the Sales and Brand teams to reduce business costs and enhance customer satisfaction.\nDevelop plans for trade marketing investments and ensure expenses are within the assigned budget limits to create a positive financial impact on business revenue\nIdentify and recommend improvement opportunities to the Sales and Brand teams to reduce business costs and enhance customer satisfaction.\nDesign and drive implementation of promotional strategies (discounts and incentives) and loyalty programs with Sales and Marketing teams across channels to improve customer engagement metrics\nManage third-party Suppliers / Brand principals to ensure alignment with the company’s marketing policies and objectivesSkills",
    "Skills": [
        "Strong knowledge of various marketing and analytics tools.\nMinimum graduate-level education in the field of Marketing or other relevant sectors.\nBachelor's in Marketing from a reputed educational institute with good command of all the necessary prerequisites in the field.\nEstablished record of marketing products or services in a professional setup.\nAdvance Excel and PowerPoint skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}