{
    "Job ID": "4743498",
    "Description": "Cultivate and maintain strong relationships with banks and insurance companies.\nCollaborate with insurance companies, advisors, and stakeholders to manage insurance-related matters.\nMonitor and process incident reporting, initiating claims in accordance with insurance policies.\nFollow up on outstanding insurance claims, ensuring timely settlement.\nOrganize and maintain insurance policy documentation, providing necessary policies to internal stakeholders and under various contracts.\nCoordinate the issuance, collection, and submission of Insurance certificates.\nRequest and evaluate insurance quotes, conducting comparisons to inform decision-making.\nAccount for banking transactions and provide allocation entry details to the General Ledger (GL) team for Borrowing costs and Insurance Premiums.\nPerform reconciliations and create payment schedules for Insurance companies.Skills",
    "Skills": [
        "Bachelor's degree in Finance, Accounting, or a related field (Master's degree preferred).\nProven experience in cash management, banking operations, and insurance coordination.\nStrong understanding of financial procedures, banking products, and insurance policies.\nExcellent communication skills, both written and verbal.\nExceptional organization and multitasking abilities.\nProficiency in financial software (Oracle) and Microsoft Office Suite, especially Excel.\nAttention to detail and accuracy in all work.\nAbility to collaborate effectively with cross-functional teams and external partners.\nProblem-solving and analytical skills for resolving complex financial issues.\nStrong negotiation skills for managing banking and insurance relationships.\nKnowledge of regulatory requirements related to finance, banking, and insurance."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}