{
    "Job ID": "4743622",
    "Description": "The Sales function is the most critical commercial function in the company. Sales need to convince incoming customers to buy a high-quality product through a specialized kitchen retail and fitting company. Make the customer buying, by providing customized kitchen designs meeting 100% of customers’ needs and budget. Act as a first-class ambassador of the brand – proactively follows the Sales Process.·        Execute the documented Sales process, translate it into your personal action, to give your sales approach the required personal touch.·        Develop trustful relation with the customer to finally make him buy even more than initially planned.·        Convince client through high end 3D animation and inspiring showroom tours, all guided by the principle that you would like to support to find the customers dream kitchen, being able to select from the preselected options.·        Attract the customer to purchase appliances through company – providing appliance set collections in different price categories – incorporate appliances display picture in CARAT 3D animation to show him final look out of his kitchen.·        Secure maximum revenue to the company, use developed customer relation to sell Appliances and Accessories, avoid customer buys outside company.Translate customer needs (Discover sheet) in highly effective 3D animation solutions in CARAT.\nMeeting with clients and working collaboratively to determine the design goals.\nPlanning overall appearance and function of kitchen.\nCoordinate colours, materials, and lighting for kitchen to achieve design goals.\nMaintaining awareness of trends and product development as they relate to interior design.\nAttract customer with a fast and easy simulation of his kitchen – grab his visual attention to his future kitchen.\nMake the customer like to spend time on the kitchen project with the you.\nSecure welcoming routine with your colleagues at the moment customer enters the showroom.\nMake any walk-in customer to the showroom seating at your desk – convince customer excepting a customized kitchen design, where you can demonstrate your competence.\nIn case customer is not ready to sign the contract Stay open to provide different kitchen designs\nIn case customer is not ready to sign the contract Stay open to provide other solutions to not lose the customer.\nSecure accurate measurement of kitchen space in customer premises\nProduce technical precise and complete Purchase Order documentation, better review again to avoid time intense and costly revision later.\nAct as the company face to the customer, single point of contact during the kitchen project·        Collect contact details of walk-in customers who do not spend time to receive kitchen design - follow up marketing activity.·        Make sure Kitchen project is being followed up in a timely manner by back-office activities, monitor your projects on a regular basis.       ·        Keep in touch with customer and follow the process of each stage till installation about Kitchen project status.·        Make sure customer pays 1st down payment in timely manner, to not delay the kitchen delivery.·        Strive to meet expectations with first design, if required produce different designs in CARAT Kitchen design software, meeting customer needs, documented in the discovery sheet.Skills",
    "Skills": [
        "  Experience",
        "·        Min 2 years of Sales experience in retail business, Proven work experience as a Retail Sales Representative, Sales Associate or similar role.",
        "·        Technical knowledge in furniture/room dimensions.",
        "Qualifications, SKILLS & KNOWLEDGE",
        "·        Essential: High School degree",
        "·        Preferred: Bachelor in related field"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}