{
    "Job ID": "4744397",
    "Description": "The FPP Development Supervisor is responsible for Co-packing & Assist the product Development & improvement Process under management of R&D manager and in accordance with company strategy & standards.Fully responsible on daily internal & external activities related to co-packing process to ensure smooth supply of all products that are produced under company brands based on required volume & quality standards.\nLead & organize new product development process inside the factory with production & quality teams to achieve the targets based on overall project’s scopes and timeline.\nResponsible for evaluating Product’s Specifications and doing Technical Audits for all new raw materials, Packaging materials & Ingredients from new supplies including design protocols, conduct trials, quality evaluation, shelf life study, and stability testing assuring that any new material is complying with company standards.\nDesign & apply all required procedures & standards of new products and reins changes in current product procedures & standards based on company quality system. And follow up the implementation with all related departments.\nEnsuring all new products are complying with ISO, SASO, MEWA & SFDA & quality management system.\nIdentify and initiate corrective actions for any deviation with regard to products, processes and related to food safety and quality management system.\nAssist R&D Manager in other tasks that might raise and/or during his absence.Skills",
    "Skills": [
        "Flexibility\nCooperation & Teamwork\nOrganizing & Communication\nCreative & Proactive\nTeam leader & Department Management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}