{
    "Job ID": "4744845",
    "Description": "Collaborating with your fellow team members, you will contribute to a positive and efficient work environment by assisting colleagues when necessary and maintaining a sense of teamwork.\nAddressing guest inquiries and special requests, you'll exhibit an in-depth familiarity with the menu, offering well-informed recommendations whenever necessary.\nAttending to guest queries and unique preferences, you'll showcase an extensive menu knowledge, readily providing insightful suggestions when the need arises.\nYour duty as a waiter involves extending a warm reception to diners, recording their preferences flawlessly, and orchestrating their dining adventure to perfection.\nAssuming the responsibilities of a waiter, you'll play a crucial part in greeting guests warmly, noting down orders accurately, and ensuring an enjoyable dining encounter for all.\nIn the capacity of a waiter, you'll be tasked with providing a hospitable welcome, taking down orders with precision, and managing the entire dining episode proficiently.Skills",
    "Skills": [
        "Efficient Order Management: Skilled in accurately recording and transmitting customer orders to the kitchen, minimizing errors and ensuring timely delivery of meals while maintaining order integrity.\nProficient in the art of upselling, adeptly recommending daily specials, beverages, and desserts to enhance the dining experience and contribute to increased revenue.\nThrives in fast-paced settings, displaying adaptability by seamlessly transitioning between tasks, managing varying demands, and ensuring each guest receives timely attention.\nDemonstrates effective conflict resolution skills, adeptly addressing guest complaints with a patient and understanding demeanor to achieve mutually agreeable solutions.\nWell-practiced in delivering outstanding customer service by connecting with guests, understanding their preferences, and ensuring their time at the restaurant is enjoyable."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "30"
    }
}