{
    "Job ID": "4744525",
    "Description": "Manage IT applications, operations, service requests, network, and security for assigned Business Units\nEnsure corporate IT policies & Procedures are implemented in BUs and adhered to for compliance purposes.\nEnsure Oracle Fusion ERP and other business critical applications are implemented efficiently for the assigned Business Units.\nOverseeing the annual IT budget and ensuring cost-effectiveness.\nMonitoring daily operations, including server hardware, software, printing and operating systems.\nCoordinating technology installations, upgrades, and maintenance.\nSelecting and purchasing new and replacement hardware and software, when necessary.\nTesting, troubleshooting, and modifying information systems so that they operate effectively.\nGenerating performance reports for operating systems.\nAssuring all IT activities are performed within the parameters of applicable laws, codes, and regulations.\nEvaluating technology risks to develop a system & network disaster recovery plan and backup procedures.\nRemaining up to date with advances in technology and industry best practices.\nResponsible for administration, licensing and deployment of new and existing services that are part of the Office 365 platform.\nResponsible for assuring the operational security, integrity, maintenance, and governance of Office 365 and SharePoint environments, MS-Teams, OneDrive for Business, Intune, and Azure Active Directory.\nResponsible for configuration and use of the Microsoft Teams Collaboration Suite and SharePoint Online,\nResponsible for the creation, deployment and maintenance of standardised IT policies based on industry best practice.\nTraining and educating end-users on IT applications including but not limited to Oracle Fusion, Manufacturing plant applications, O365 capabilities, and collaboration tools (OneDrive, Teams, Outlook etc).\nSupport end-users by troubleshooting Office 365 & SharePoint services and performance issues on PCs, Macs, and mobile devices in a timely and professional manner.\nEnsure all changes are made in accordance with change control, security, and risk assessment policies.\nExperience utilizing various backup software in a cloud environment. Ability to review troubleshoot and restore systems from backup software as needed.\nMaintains a working knowledge of continuing developments in the field of Computer Security.\nAnalyses information and evaluates results to recommend process improvements, choose effective solutions, and solve problems.\nConduct routine monitoring and analysis to include audit log reports evaluation, system and storage utilization reports, site and system usage, growth reports, and manage site collection quota settings\nBuilds positive customer relationships and works with clients to understand and respond to issues.\nInvestigates and provides solutions to issues, incidents, and problemsSkills",
    "Skills": [
        "Bachelor’s degree in information technology, computer science, software engineering, or a related field.\nAt least 10 years of experience in managing IT infrastructure and services, preferably for manufacturing industry.\nExperience with computer networks, network administration, and network installation.\nProficient in computer hardware, cabling installation and support, wireless technology applications and interface, and IT security.\nProficient in Office 365 collaboration and productivity tools.\nMulti-tasking and time-management skills, with the ability to prioritize tasks.\nAbility to take direction and perform at a high level with autonomy.\nExperience in configuration, troubleshooting and support of Office 365 Online, SharePoint Online, Teams, OneDrive for Business, and Intune. Must have completed at least two deployments.\nStrong knowledge of Microsoft Office 365 Exchange and the interaction with Active Directory\nEffective organizational skills to meet schedules and timelines. Specifically, must be able to work independently and produce deliverables to management deadlines.\nMust be able to handle multiple tasks simultaneously and balance priorities with good time management skills.\nStrong coordination and planning skills with the ability to effectively prioritize tasks and work independently with minimal supervision.\nDemonstrated ability to work in a collaborative team environment.\nGood verbal and written communications skills. Ability to communicate and interact effectively with all levels\nStrong analytical skills, attention to detail, and the ability to creatively challenge current methods and procedures.\nIndependent learner and self-directed; takes the initiative while working within a team context.\nMust enjoy researching new technologies, learning, and expanding one’s knowledge.\nResilient and adaptive.\nGood organizational skills.\nWork independently with a degree of responsibility.\nAbility to effectively prioritize and multi-task in a fast-paced environment\nForward-thinking and inclusive."
    ],
    "Preferred": {
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}