{
    "Job ID": "4744806",
    "Description": "-Deliver superior service and maximize customer satisfaction.-Respond efficiently and accurately to customer complaints.-Regularly review product quality and research new vendors.-Organize and supervise shifts.-Appraise staff performance and provide feedback to improve productivity.-Estimate future needs for goods, kitchen utensils and cleaning products.-Ensure compliance with sanitation and safety regulations.-Manage restaurant’s good image and suggest ways to improve it.-Control operational costs and identify measures to cut waste.-Create detailed reports on weekly, monthly and annual revenues and expenses.-Promote the brand in the local community through word-of-mouth and restaurant events.-Recommend ways to reach a broader audience (e.g. discounts and social media ads).-Train new and current employees on proper customer service practices.-Implement policies and protocols that will maintain future restaurant operations.Skills",
    "Skills": [
        "-Proven work experience as a Restaurant Manager, Restaurant General Manager, Hospitality Manager or similar role.",
        "-Proven customer service experience as a manager.",
        "-Extensive food and beverage (F&B) knowledge, with ability to remember and recall ingredients and dishes to inform customers and wait staff.",
        "-Familiarity with restaurant management software, like PO system and inventory data entry.",
        "-Strong leadership, motivational and people skills.",
        "-Acute financial management skills.",
        "-Must have driving license and a car."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 20"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}