{
    "Job ID": "4744356",
    "Description": "Review drawings for correctness and clarity of information and take necessary action to ensure sufficient information is available, Monitor and ensure that only current / latest revisions of Issued for Construction drawings are being used, and withdraw all superseded drawings from site.\nSupervision of work activities on site and reporting any trends for delays to the Section Engineer.\nRecord and maintain daily site events.\nMonitor progress of work against Construction programme to ensure that the progress is in accordance to the Construction Programme.\nTake necessary corrective actions on work requiring rework or remedial actions as instructed and directed by Section Engineer.\nMonitor, control, and coordinate the works of different trade subcontractors and report on their progress and or trends for problems / delays to Section Engineer.\nEnsure that safety procedures are implemented on site and report any risks to Safety Officer/Section Engineer.\nMaintain at all time site diary, recording daily site activities and any circumstances that have adverse effect on the Project.\nIdentifies and plans the inspection requirement for internal process along with his schedule on next days planned inspections.\nEnsure that no work is submitted for inspection unless it is complete and complies with all specified requirements.\nDistributes manpower with General foremen, including equipment and materials to achieve the required progress and in compliance with the project quality requirements in coordination with his Section Engineer.\nSupervises the activities of foremen, trade foremen, and land surveyors, each according to his assigned duties and responsibilities.\nEnsures that only approved materials are used.Skills",
    "Skills": [
        "Education - Bachelor’s degree in civil/Architecture Engineering.\nExperience - Must have a Minimum of 2 and maximum of 5 years of experience with the main contractor.\nMust be fluent in English language."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Civil Engineering; Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}