{
    "Job ID": "4744807",
    "Description": "TEE H Banking Services - Sales Agent Position - Dubai Why Tee H: • Leadership in Innovation: Pioneering the banking brokerage arena, TEE H is shaping Dubai's financial landscape. • Collaborative Partnerships: Teaming up with the UAE's elite banks, our offerings encompass superior banking solutions. • Empowering Environment: Dive into a fusion of state-of-the-art banking tactics and streamlined sales strategies. • Focused Product Portfolio: Lead the charge in Personal Finance, Home Mortgage, and Credit Cards. • Dedicated Role for Women: We're scouting for spirited female talents eager to be our brand ambassadors. Job Description: • Product Sales: propose Tee H’s extensive banking suite. • Customer Relations: Build and nurture enduring client rapport. • Lead Acquisition: Innovatively scout and secure promising sales leads. • Client Conversion: Engage and win over prospects to join our esteemed banking partners. • Multichannel Outreach: Harness leads through social channels, personal networks, cold calls, and face-to-face engagements. • Sales Targets: Regularly hit and exceed sales benchmarks. • Customer Support: Ensure pristine client service, promptly addressing concerns. • Trend Adaptation: Stay attuned to industry breakthroughs and market dynamics. • Teamwork: Integrate smoothly within the Tee H team, driving collective milestones. Job Specifications: • Job Type: Full-time engagement. • Location: Business Bay - Dubai • Language: arabic (both oral and written) is essential. • Tools Proficiency: Skilled in MS Office and related admin tools. Skills",
    "Skills": [
        "Ideal Candidate: ",
        "• Sales Expertise: Rich sales background, bonus points for banking sector insights. ",
        "• Communication Maven: Exemplary communication skills backed by stellar relationship building. ",
        "• Negotiation Pro: Proven negotiation talents crowned by a history of successful deals. ",
        "• Driven & Adaptive: An intrinsic motivation paired with the adaptation to excel in varied environments. ",
        "• Sales Savvy: Updated with the latest sales techniques and industry high standards. ",
        "• Educational Qualification: Minimum: Bachelor’s degree in Business, Marketing, or related fields. ",
        "• Special Consideration: Visa holders, will be offered specials packages.",
        " Step Into The World of TEE H: Elevate your career dimensions with us. ",
        "Be part of our story and success Tee H's relentless journey of excellence. TEE H: Where Dreams Find Their Wings."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "6"
    }
}