{
    "Job ID": "4744715",
    "Description": "Job SummaryThe Officer will be responsible for ensuring that The Commercial Bank (CB) and its staff fully comply with all applicable national and international sanctions and embargoes.The Officer will primarily review and investigate payment messages and CB customers concerning potential breach of Sanctions, Money Laundering (ML), or The Bank’s policy requirements.The Officer will assist in maintaining compliance with OFAC, EU, UK and State of Qatar sanctions regulations as well as The Bank’s policies.Key AccountabilitiesMonitor and provide advice/guidance for all funds transfers and payments, both for Corporate as well as Retail sectors from sanctions perspective. Investigate and ensure the blocking of any transactions and/or freezing of any assets belonging to sanctioned parties\nAssess transactions flagged as suspicious by the bank’s sanctions screening systems and take decisions as to whether to process the ‘hit’ payments or otherwise \nAssess new and existing customers flagged as suspicious by the bank’s sanctions monitoring systems and take decisions as to whether to block their accounts or otherwise\nMake sure to adhere with sanction risk appetite and TAT for clearing sanctions alerts are meticulously followed\nAssist in Designing parameters to monitor Sanctions related transactions and periodic screenings.\nAbility to understand and support the analytics components to assist in developing statistical models and patterns\nAddress all daily correspondent banking inquiries, from the timely and accurate preparation and provision of updated due diligence material and request for information (RFI), to coordination and review of responses received from branches, RMs, FI, etc.\nProvide correspondent banks with the necessary assistance and information related to the Bank’s payment/s that failed their screening tests.\nSupport sanctions-relevant reporting obligations involving countries in the region to the competent authorities and assist in the collection of information in response to law enforcement, regulatory, or internal inquiries\nAssist in the preparation of timely and accurate departmental statements and reports to meet CB’s and department requirements, policies and standards.\nPerforms other duties and responsibilities as requested by the immediate manager or Compliance & FCC SBU’s Senior Management.Skills",
    "Skills": [
        "Education",
        "Bachelor’s Degree, in Business-related major"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}