{
    "Job ID": "4744710",
    "Description": "Key AccountabilitiesAnalyze and evaluate business requirements, translating them into high-quality, scalable, and maintainable software solutions.\nDevelop, test, and deploy software applications and enhancements, ensuring compliance with corporate software development standards and best practices.\nCollaborate with cross-functional teams to deliver customer-centric solutions and ensure seamless integration with existing systems and platforms.\nImplement and maintain quality assurance processes, ensuring that developed solutions meet or exceed established standards.\nProactively identify and address performance bottlenecks in the software, ensuring optimal system performance and user experience.\nCollaborate with IT and business teams to establish and monitor key performance indicators (KPIs) for the Cards and Tokenization technology systems.\nEstablish and maintain strong working relationships with internal and external stakeholders, including regulators, system vendors, and card schemes.\nCommunicate effectively with all levels of the organization, presenting technical concepts in a clear and concise manner.\nAdvocate for the Cards Technology team and its initiatives, promoting the benefits and value of the solutions being developed.Other AccountabilitiesAdapting to rapidly changing business requirements and priorities, while ensuring timely delivery of high-quality solutions.\nStaying current with emerging technologies, industry trends, and best practices to ensure that the organization remains competitive in the marketplace.\nNavigating the complexities of integrating new solutions with legacy systems, while maintaining security, compliance, and performance standards.\nBalancing the need for innovation and the delivery of customer-centric solutions with cost and resource constraints.\nFostering a collaborative and inclusive work environment, managing diverse perspectives, and driving the professional growth of team members.Skills",
    "Skills": [
        "Education",
        "Bachelor’s degree in Computer Science or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}