{
    "Job ID": "4744557",
    "Description": "We are looking for a motivated and experienced Sales Executives to join our team. The Sales Executives will be responsible for managing and growing our customer base in order to achieve sales targets and increase revenue. The successful candidate will possess excellent communication skills, a strong understanding of the sales process, and a proven track record of achieving sales targets.Responsibilities:Develop and execute sales strategies to achieve sales targets and increase revenue.\nIdentify potential customers and build relationships to expand our customer base.\nConduct market research to identify opportunities for growth and stay up-to-date with industry trends.\nCollaborate with other departments, including warehouse and accounts, to ensure customer needs are met and orders are fulfilled.\nPrepare and present sales proposals, negotiate contracts, and close sales deals.\nMaintain accurate sales records and reports.\nProvide exceptional customer service to ensure customer satisfaction and repeat business.Skills",
    "Skills": [
        "Requirements",
        "Any qualification is welcome\n0-1 year of experience in sales\nProven track record of achieving sales targets.\nExcellent communication and interpersonal skills.\nAbility to build and maintain relationships with customers.\nStrong organizational and time-management skills.\nKnowledge of sales strategies and techniques.\nAbility to work independently and as part of a team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 7",
        "Gender": "Male",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Textile & Apparel Production; Retail & Wholesale; Fashion & Apparel",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}