{
    "Job ID": "4744714",
    "Description": "Job SummaryThe Senior Officer will be responsible for ensuring that The Commercial Bank (CB) and its staff fully comply with all applicable national and international sanctions and embargoes.The Senior Officer will primarily review and investigate payment messages and CB customers concerning potential breach of Sanctions, Money Laundering (ML), or The Bank’s policy requirements. he Senior Officer will assist in maintaining compliance with OFAC, EU, UK and State of Qatar sanctions regulations as well as The Bank’s policies.The Senior Officer will keep abreast of related rules, regulations and best practices pertaining to sanctions through Notices that are received from the sanction authorities i-e OFAC, UN, EU, HMT and local regulatorsThe Senior Officer will ensure that any required process or control is initiated for sanction related riskKey AccountabilitiesMonitor and provide advice/guidance for all funds transfers and payments, both for Corporate as well as Retail sectors from sanctions perspective.\nInvestigate and ensure the blocking of any transactions and/or freezing of any assets belonging to sanctioned parties\nAssess transactions flagged as suspicious by the bank’s sanctions monitoring systems and take decisions as to whether to process the ‘hit’ payments or otherwise Assess new and existing customers flagged as suspicious by the bank’s sanctions monitoring systems and take decisions as to whether to block their accounts or otherwise.\nMake sure to adhere with sanction risk appetite and TAT for clearing sanctions alerts are meticulously followed.\nMonitor addition and amendments in internal lists used for screening and make sure that all names are added/amended within allowed time.\nConduct searches in bank date base for the names or other details shared for screening or listing purpose by any regulatory/reporting agencies\nAssist superiors in implementing Sanctions related projects and system enhancements\nConduct Bank wide Risk Based Assessment on ML & Sanctions related process and controls.\nSupport the analytics components to develop statistical models and identify patterns\nAssist in Designing parameters to monitor Sanctions related transactions and periodic screenings.\nStrategically assist in tuning screening thresholds and rule-based screening\nSupport sanctions-relevant reporting obligations involving countries in the region to the competent authorities and assist in the collection of information in response to law enforcement, regulatory, or internal inquiries\nAssist in the preparation of timely and accurate departmental statements and reports to meet CB’s and department requirements, policies and standards.\nPerforms other duties and responsibilities as requested by the immediate manager or Compliance & FCC SBU’s Senior Management.\nEnsures proper tracking of requests via updating an internal tracking sheet and keeping records of researchSkills",
    "Skills": [
        "Education",
        "Bachelor’s Degree, in Business-related major",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Banking",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}