{
    "Job ID": "4744862",
    "Description": "Greet every guest in a friendly and welcoming manner on their way in/out of, club Take payment for glove and gears hire, hand wrap purchase etc.Build relationships and loyalty with current and new Members.Welcome first timers with a brief tour, instructor introduction and follow up after class.Manage the flow of guests coming in and out of the clubTrack class occupancy and complete attendance report.Appropriately handle sensitive information (credit cards, bank details, personal information).Maintain a clean and organized work areaCarry out ‘follow up’ and ‘service' calls as per SOPAlways communicate in a respectful and courteous way using English language.Be a regular presence on the studio floor to be trusted and known by all members.Receive customer service and sales training from Sales Manager/Sales Coordinator.Maintain self-control and behavior when dealing with guests at all times.Track member progress and interactions.Use appropriate “language” when answering telephones or emails.Learn members names and use them whenever appropriate.Follow all given SOP’s.Communicate any relevant information to coachesJob Type: Full-timeSalary: 2000 - 3000 AED per monthAbility to commute/relocate:Ability to work with gym management and classes time table softwares Dubai: Reliably commute or planning to relocate before starting work (Required)Experience:receptionist: 2years (Preferred)Language:EnglishSkills",
    "Skills": [
        "Good organizational skills with attention to detail.\nAbility to work well under critical Situations.\nAn eye for accuracy and details.\nproblem solving skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Sports & Outdoor Activities",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}