{
    "Job ID": "4744461",
    "Description": "1 Execute the assigned maintenance order with right quality & timely to give actual reliability in the operation lines.2   Participate in SAP N3 Breakdowns Notifications, breakdown orders Participation in the RCA if required .3   Achieves Zero maintenance jobs rework.4   Full response to production requirements by following the operational team leader instruction during shift.5   Follow the Team leader Priorities if there are multiple breakdowns.6   Attend Shift Handover meeting which lead by operational team leader to discuss last shift activities & plan accordingly.7   Complies with line housekeeping (5S) of Maintenance workshop standards and Shop floor (5S) lead by operation team leader8   Support AM team by applying defect elimination system and processes via OPLs & KAIZEN9   Participate in action plan \"CA/PA\" & orders completion, permits, audits, tours10 Read and interpret equipment manuals and work orders to perform required maintenance and service11  Perform mechanical jobs with lead role in the shift & support electrical, pneumatic, hydraulic, troubleshooting and repair machines. 12 Fill all needed log sheets accurately with detailed activities of shift13 Check the repetitive corrective maintenance if possible to transfer to TBM.14  Follow up QA, Safety, Food Safety and TPM requirements in the department to achieve the targets . 15 Follow up chronic issues to Support Operation team to achieve daily manufacturing targets.16  Work with PDM (vibration , alignment , thermal ) tools and supplies necessary to complete projects17  Ensure to achieve the targets MPSA & achieve < 2% PR of breakdown .Leading his team effectively to ensure production plans are delivered on time, safely and according to established quality standards. Also, to build the technical capability in operation Skills",
    "Skills": [
        "Technical writing skills and ability to document per GMP;\nAbility to work with minimal supervision;\nAbility to plan, schedule, and execute scheduled plant shutdowns for high voltage,\nHigh school diploma or equivalent."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}