{
    "Job ID": "4744429",
    "Description": "Job Opportunity: Real Estate Agent at Classy Home Real Estate LLCAre you a proactive and dedicated individual with a passion for real estate? Do you possess strong negotiation skills and a keen eye for identifying investment opportunities? Classy Home Real Estate is seeking talented and motivated individuals to join our vibrant team as Real Estate Agents.Position: Real Estate AgentLocation: Fifty One Tower, Business bayPreferred Candidates: Russian, European & Middle East GirlsRequirements: We're looking for candidates who meet the following criteria:Experience: 1 year or less than 1 year of experience as a Real Estate Agent or in a relevant role is a plus, though not mandatory.\nNegotiation Skills: You should have strong negotiation skills coupled with a sense of urgency to drive successful property transactions.\nCustomer Service: Excellent customer service and communication skills are essential to provide an exceptional experience to our clients.\nInvestment Insight: A keen eye for identifying potential investment opportunities in the real estate market.\nMarket Knowledge: Knowledge of the UAE real estate market is advantageous, though not a strict requirement.\nIndependence and Teamwork: The ability to work both independently and collaboratively as part of a team.\nPreferred Candidates: Only Russian, European & Middle East Girls will be considered for this role.What We Offer: In return for your dedication and contribution, we provide:* Competitive Compensation: AED 3,500 Salary along with an attractive commission structure.* Professional Growth: Opportunities for professional development and advancement in your career.* Dynamic Environment: Enjoy a fun, dynamic, and supportive work environment that encourages your growth.* International Exposure: Gain exposure to international real estate markets, broadening your industry perspective.* Exciting Projects: Be a part of some of the most thrilling real estate projects in the UAE.Skills",
    "Skills": [
        "Experience: 1 year or less than 1 year of experience as a Real Estate Agent or in a relevant role is a plus, though not mandatory.\nNegotiation Skills: You should have strong negotiation skills coupled with a sense of urgency to drive successful property transactions.\nCustomer Service: Excellent customer service and communication skills are essential to provide an exceptional experience to our clients.\nInvestment Insight: A keen eye for identifying potential investment opportunities in the real estate market.\nMarket Knowledge: Knowledge of the UAE real estate market is advantageous, though not a strict requirement.\nIndependence and Teamwork: The ability to work both independently and collaboratively as part of a team.\nPreferred Candidates: Only Russian, European & Middle East Girls will be considered for this role."
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "Brazil; Egypt; European Union; Russian Federation; Syria; Ukraine"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}