{
    "Job ID": "4744748",
    "Description": "Responsibilities:•           Capable of efficiently operating and demonstrating all types of material handling equipment (MHE) to forklift operators and operation teams of clients, including diesel/LPG forklifts, electric forklift, warehouse equipment, attachments, and very narrow aisle trucks (VNA)•           Sufficient knowledge of proper usage of batteries & chargers of electric forklifts and warehouse equipment.•           Conduct physical inspection of newly received trucks.•           Perform equipment inspection prior to delivery to client and liaise the delivery and ensure safe arrival at client site.•           Conduct familiarization training following the truck’s delivery.•           Arrange & teach operational training and instruction materials to operators & supervisors.•           Maintain professional relationships with stakeholders and operators of clients.•           Attend training, and orientations as and when required.•           Monitor closely the delivery, installation, commissioning, and operational startup of supplied equipment at the site ensuring the client’s maximum satisfaction on the job quality.•           Commitment to applying higher safety standards always.•           Demonstrate company value.Skills",
    "Skills": [
        "Qualifications & Experience:",
        "•           High School Diploma or equivalent degree. Vocational / technical training is preferred.",
        "•           10+ years of experience as senior operator or trainer of Material Handling Equipment (MHE).",
        "•           Proficiency in English, Hindi & Urdu and is a must. Other languages are advantageous (e.g. Malayalam, Tamil or Tagalog)",
        "•           Valid UAE driving license is a must.",
        "•           Must hold a valid forklift operator license.",
        "•           Having wide knowledge of material handling equipment (MHE) and its applications."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 10 Max: 17",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Degree": "Certification / diploma",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Industrial Engineering & Automation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}