{
    "Job ID": "4744776",
    "Description": "Carpenter with UAE Driving LicenseTo install long-lasting complete kitchen sets at customers sites and to supervise the work of Fitting Technicians to server the company commitment to quality.Supervise Fitting installation in compliance with company’s policies.\nRead blueprints, drawings, and sketches to fully grasp requirements of delivery.\nTake measurements and check the size to kitchen set dimensions and actual delivered items.\nCut, shape and smooth lumber and other material (e.g., fiberglass) according to measurements.\nLay out floorings, roofing’s or drywalls ensuring they are levelled and compatible.\nCarve and assemble furniture, cabinets, shelves, and other items and install them where designated.\nInspect places and conduct repairs or maintenance where applicable.\nBuild scaffolding and other construction structures.\nSecure and maintain complete set of installation tools, make sure all tools are clean and functional, take immediate replacement action if required.\nWear clean company shirt and support the quality of German kitchen sets through clean and professional clothing and respectful appearance.Skills",
    "Skills": [
        "Must have valid UAE manual LTV driving license.",
        "·        Excellent understanding of carpentry techniques and methods of installation and construction",
        "·        Proficient in using electrical and manual equipment and measurement tools (powered saws, hammers, rulers etc.)",
        "·        Ability to read technical documents and drawings.",
        "·        Willingness to always follow safety guidelines.",
        "·        Good physical condition and endurance",
        "·        Leadership skills to run a multi-culture team.",
        "·        Able to give clear directions to direct reports, and workers in their tasks.",
        "·        Able to improvise, customer committed, does his utmost to secure the installation on the day.",
        "·        Planning skills, look ahead and make sure all information that might impact fitting operations are available and appropriate actions are planned.",
        "·        Report any kind of shortfall in process to Fitting Manager and work actively on solution to avoid reoccurrence.",
        "·        Good knowledge of Arabic",
        "·        Good understanding of basic math"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Umm Al Qaiwain, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}