{
    "Job ID": "4744787",
    "Description": "Manage Put away a Move items from Inbound Locations and place them on shelf to become active inventory.\nEnsure FIFO is maintained in floor organization.\nManage Batch Creation\nManage Picking Assignments a Set a criterion for pickers to ensure fast, accurate picking\nIn case of inventory is short with items a Dedicate team member to react to find the items for the customer order, Fix the existing stock for the upcoming orders.\nStock Movement a Prepare stock movement reports and monitor the movement.\nManage Cycle Count\nManage Transfer Orders Between Boutiqaats’ warehouses and stock locations\nApprove Transfer Orders Reversal\nManage Purchase Returns with Vendors\nManage Expiry Checks and Validation\nManage Stock Locations and Prepare Capacity Reports.\nManage Free Bins, physically and systematically.\nManage Stock with FEFO (First Expiry First Out) and FIFO (First in First Out) wherever relevant.\nValidate and approve the transfer of stock from Selling Stock to Damage Stock.\nReview the disposal of Damage stock\nSet criteria for aging stock.\nSet criteria for fast moving items.\nEnsure right stock is picked (Lot Mechanism)\nEnsure placing the stock in a right placement\nEnsure segregation of Damaged items (Open Box, Box Damage Only, Full Damage of Product and actively communicate with superiors and other departments\nSet, review, and manage the returns QC criteria for the returns processing center (RPC).\nSet, review, and manage the returns put away guidelines that aligns with the inventory storage policies.\nManage the returned shipments’ handover with the logistics team (both local and international).\nCommunicate with the logistics team (local) for the damaged, mismatched, PNR, and the wrong shipments received.\nCommunicate with the logistics team (International) for the damaged, mismatched, and the wrong shipments received.\nReview the return tickets created by Contact Center team.\nReview the transfer process from QCFAIL bin to the sales return damage location.\nManage the sales return damage location.\nPrepare the required documents and details for Finance during SRDMG location’s audit.\nHandle the communication with the Contact Center team for the CIR orders pending for refund.\nReview, approve, and submits all the transfers documents to the inventory manager.Skills",
    "Skills": [
        "8 to 10 Years of Experience. (At least 5 Years Managing Inventory – Supervisor Level)\nPerforms quick typing (Speed 35 to 45 wpm)"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 20",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}