{
    "Job ID": "4744743",
    "Description": "Keep recruiting reports from pre-screening to onboarding stages ready for timely evaluation and analysis.\nDevelop a systematic approach to plan an efficient hiring schedule for the prescribed profiles.\nAnalyze the current organizational demand and plan cost-effective measures for hiring suitable talent.\nImplement a successful end-to-end recruitment cycle covering all crucial aspects of the profile requirements and company culture.\nDevelop and update job descriptions and job specifications.\nResearch different recruitment models and develop descriptions for attracting suitable talent.Job Summary:The HR Recruitment Officer will be responsible for attracting and hiring top talent to meet the organization's staffing needs. This includes identifying potential candidates, conducting interviews, and managing the hiring process from start to finish. The HR Recruitment Officer will work closely with hiring managers to understand their staffing needs and develop effective recruitment strategies.Responsibilities and Tasks:Coordinate with hiring managers to identify staffing needs\nDetermine selection criteria by using KPIs & job analyses.\nSource potential candidates through online channels (e.g. social platforms and professional networks)\nPlan interview and selection procedures, including screening calls, assessments and in-person interviews\nAssess candidate information, including resumes and contact details\nDesign job descriptions and interview questions that reflect each position’s requirements\nLead employer branding initiatives.\nOrganize and attend job fairs and recruitment events\nForecast quarterly and annual hiring needs by department\nFoster long-term relationships with past applicants and potential candidates reflect the requirements for each position.\nResponsible for the design, development, and implementation of talent development activities related to essential and soft skills.\nManage schedule planning, announcement, registration, practice test results, assessment, and related to essential and soft skills.\nFollow up with managers about all employee evaluations.\nCreate a Manpower plan & monitor with senior recruitment.\nresponsible for data entry for new employees in Qiwa, Tawteen & HRDF programs.\nCreate Reports for the recruitment division \nMaintaining Saudization rates and making monthly Reports.\nPerforms all other duties as assigned.Skills",
    "Skills": [
        "Adept in portraying excellent soft skills during interviews and formal meetings.\nPortraying sound knowledge of the recruitment cycle through streamlined thinking and clear decision-making.\nTime management skills;\nProven work experience as a Recruiter\nIn-depth knowledge of telephonic, lunch, puzzle, video, and group interviews.\nProfessional education in Human Resource Management or subsequent domain. (Minimum Bachelor's degree preferred)",
        "Required skills/abilities:",
        "Experience working with a learning management system\nExperience compiling data and creating reports\nExperience presenting in small/medium groups\nPatience and listening skills to respond appropriate and interact positively with upset customers\nInterpersonal skills to create a pleasant experience for all customers, such as being personable and attentive\nTyping; Computer Skills\nExcellent verbal and written communication skills\nAbility to function well in a high-paced and at times stressful environment\nProficient with Microsoft Office Suite, Visio or related software",
        "Education and Competency:",
        "Requirements and skills\nProven work experience as a Recruitment officer or similar role.\nFamiliarity with social media, resume databases and professional networks\nHands-on experience with full-cycle recruiting using various interview techniques and evaluation methods\nKnowledge of Applicant Tracking Systems\nExcellent verbal and written communication skills\nA keen understanding of the differences between various roles within organizations\nBSc in Human Resources Management or relevant field\nProficient with Microsoft Office Suite or related software\nCIPD certification is an advantage\nBSc/BA in Business Administration or relevant field; Additional education in Human Resource Management will be a plus"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Ubhur al Janubiyah, Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 21 Max: 35"
    },
    "Data": {
        "Job Location": "Ubhur al Janubiyah, Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}