{
    "Job ID": "4744781",
    "Description": "·      Attaching relevant service request/mail/fax correspondence from customers/internal departments with job cards.·      Sending Parts request to Parts Department/Parts Follow up with Hari.·      Follow up with Inventory Department for Parts not having Master and Price.·      Preparing Purchase request for sublet and bought out items procured through job cards.·      Follow up with Purchase departments for items receipt/Delivery Order/invoice.·      Manual entry of Missed hours in the job cards.·      Receiving Machines coming to the CE workshop.·      Preparing Inventory Check list for machines coming to CE workshop/T-card.·      Job Card Invoicing-Customers, Internal & Warranty Job cards.·      Commercial Invoice Print Outs, Photo copying and sending them to Accounts Department.·      Preparing Proforma Invoices for CASH customers.·      Job Card filing, all customer service related reports filing.·      Maintaining Service Vehicle Details with HR Department.-log Book, Service follow up, fines, vehicle passing. Preparing Monthly report of service vehicle users.·      In charge for Admin Stores for stationaries·      Delivery Note/Order to be prepared on daily basis.·      Daily Job allocation to be updated in the Library board.·      Supplier Quotes enquiry/follow up with different suppliers for Non Franchisee Equipment.·      Non Franchisee parts to be received and to be coordinated with Tool Room in charge/Team Leaders.Skills",
    "Skills": [
        ".Attention to Detail: Warranty administrators need to meticulously review warranty claims, documentation, and records to ensure accuracy and compliance with warranty policies.\nOrganizational Skills: Managing warranty claims and documentation requires strong organizational skills to keep track of various claims, deadlines, and paperwork.\nCommunication: Effective communication is essential when dealing with customers, suppliers, and internal teams. Clear and concise communication helps in understanding warranty issues and providing solutions.\nCustomer Service: Providing excellent customer service to address warranty-related inquiries, concerns, and claims with empathy and professionalism is crucial.\nAnalytical Skills: Warranty administrators need to analyze warranty data, trends, and patterns to identify potential product defects, areas for improvement, and opportunities for cost reduction.\nProblem-Solving: When unexpected issues arise with warranty claims, warranty administrators must be able to identify root causes and find appropriate solutions to resolve them.\nTechnical Knowledge: Depending on the industry, having a basic understanding of the technical aspects of the products covered by the warranty can be beneficial. This knowledge aids in accurately assessing warranty claims."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 3 Max: 10",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Mechanical Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}