{
    "Job ID": "4744672",
    "Description": "Overview:We are a leading IT service provider in Kuwait, specializing in the diagnostics, repair, and maintenance of a wide range of electronic devices. We are seeking a dedicated Electronics Technician with expertise in computer motherboard repairs to join our dynamic team.Key Responsibilities:Diagnose and identify faults in computer motherboards and related hardware components.\nPerform intricate soldering tasks to replace or repair damaged components.\nUse rebelling techniques to restore the quality and functionality of BGA components on motherboards.\nUtilize heat guns and other required tools effectively and safely to perform repairs.\nTest and verify the functionality of repaired motherboards and components.\nMaintain a detailed record of all repairs and components used.\nCollaborate with the IT team to understand and rectify software and firmware-related issues, if any.\nEnsure all repairs are done in accordance with company standards and protocols.\nStay updated with the latest techniques, tools, and components related to motherboard repair.\nProvide guidance and support to junior technicians and interns.Skills",
    "Skills": [
        "Visa & Work Authorization:",
        "Applicants must have a transferable visa to work in Kuwait.",
        "Required Qualifications & Skills:",
        "Diploma or degree in Electronics, Computer Hardware, or a related field.\nMinimum of 5 years of hands-on experience in computer motherboard repair.\nProficiency in soldering, rebelling, and the use of heat guns.\nSolid understanding of electronic circuits, components, and schematics.\nFamiliarity with the latest tools and techniques in the field of electronics repair.\nBasic IT skills to manage software and firmware-related tasks.\nStrong troubleshooting and problem-solving abilities.",
        "Desirable Qualities:",
        "Detail-oriented and precision-focused.\nStrong communication and interpersonal skills.\nAbility to work both independently and as part of a team.\nCommitment to maintaining high-quality service standards.\nEagerness to learn and adapt to changing technologies."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "IT Services; Computer Hardware & High-Tech Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}