{
    "Job ID": "4744315",
    "Description": "Our client provides engineering, project management, asset management, and integrity services to the worldwide energy industry. They are currently hiring a Financial Accountant to run the accounting for their Al Khobar, Branch, KSA. Reporting to the Finance Manager, the Financial Accountant will be responsible for the day-to-day financial operations of the company and compliance with all local government and tax filings, etc.Perform general ledger accounting and bookkeeping duties.\nLocal compliance and filing of all local government and tax returns.\nPreparation of local management accounts, project KPIs, and reports.\nManagement and reconciliations of debtors.\nLocal creditor administration and payments.\nManagement of local employee payroll and expenses.\nGathering information in response to auditor requests.  \nAssist the Finance Manager and Group Finance on ad hoc projects, as required.Skills",
    "Skills": [
        "The successful candidate will be a detail-oriented self-starter with strong local tax compliance experience and a sound understanding of accounting principles.\nBachelor's degree in Accounting or a related field.\nMinimum 7 to 10 years prior experience in accounting or finance roles, preferably in a similar industry or sector.\nStrong knowledge of Saudi Arabian accounting principles tax regulations and filing requirements.\nStrong attention to detail to ensure accuracy in financial records and Arabic reporting.\nExcellent written and verbal communication skills in English and to effectively interact with remote teams and effectively communicate issues.\nProficient in using accounting software and Microsoft Office applications, particularly Excel. \nDemonstrates honesty, ethics, and professionalism in handling financial matters.\nExcellent Arabic and English communication skills are essential."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Dammam, Saudi Arabia ; Dhahran Al Janoub, Saudi Arabia ; Khobar, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 32"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}