{
    "Job ID": "4744358",
    "Description": "Company DescriptionOxygen Aerospace is a DCA authorized aviation company located in Sharjah Emirate, United Arab Emirates. We specialize in mid-life narrow-body commercial and business aircraft sales as well as new and after-market aircraft parts supply. We deal in civil aircraft trading and parts supply with a focus on aviation solutions tailored to meet our clients' unique needs.Role DescriptionThis is a full-time on-site role for a Sales Executive. The Sales Executive will be responsible for generating new business, managing existing accounts, and cultivating relationships with customers. They will be responsible for identifying customer needs and providing solutions through effective communication, presentation, and negotiation. The Sales Executive will also be responsible for developing sales strategies and achieving revenue goals.Skills",
    "Skills": [
        "Execute all sales tasks for the assigned region or clients’ accounts, including Proposals, Sales Orders, invoicing, Packings, and Customs. etc.\nIdentify and target sales lead\nContributing to the development of marketing strategies.\nBuild and maintain customer relationships\nMeeting/realization of sales targets\nHandle the full spectrum of shipping Customs Clearance Documentation\nLiaise and coordinate with forwarders, shipping companies, and third-party logistics providers, including handling order processing, fulfillment, and timely delivery to customers including storage, packaging, and tagging of goods supplied.\nCommunicate status of Orders, and shipping/receiving activities to management and business units, as necessary."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Sharjah, United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Aviation Support Services; Sales Outsourcing; Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}