{
    "Job ID": "4744606",
    "Description": "Key Responsibilities:Supervises, leads, and develops assigned employees.\nTrains assigned employees to meet operational, safety and company and government regulatory and safety criteria.\nResponsible for monthly grain inventory measurements.\nResponsible for grain handling including incoming, stored, and outgoing grain. Maintains the grain quality, blending, and providing grain drying services.\nIn coordination with Sales Managers and operations, oversees the production, management and distribution of and seed inventories.\nProvides professional customer service that result in increased sales.\nEnsures the maximum utilization efficiency of storage and grain handling equipment.\nActs as a liaison for the department between branches and other company departments.\nResponsible for compliance (or exceeding) all operational, quality, government, regulatory and health and safety regulations as well as the maintenance and professional appearance of equipment, rolling stock and facilities.\nIn collaboration Senior Management, ensure record keeping adheres to all required legislation.\nPrepare and present monthly reports as directed by the General Manager with regards to HR, financial statements and other data\nFollow direction to complete other tasks and projects as required.\nAll other duties as assigned.Skills",
    "Skills": [
        "Key Knowledge, Skills, and Abilities:",
        "A degree or diploma in Ag Economics, Ag Marketing or Agri-Business, or engineering a combination of related education and experience.\n3+ years of supervisory experience demonstrating the ability to provide successful leadership for location management.\nPrior experience in the agricultural industry with grain and crop inputs is required.\nProficient in MS Office Suite programs (Word, Excel, PowerPoint, Outlook) as well as additional web-based sites, and the ability to quickly learn and utilize new software."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 3 Max: 8",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22 Max: 40"
    },
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Manufacturing; Food & Beverage Production; Animal Production",
        "Company Type": "Unspecified",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}