{
    "Job ID": "4744630",
    "Description": "Marketing Strategy development·       Develop an effective and efficient marketing strategy, fully aligned with business objectives and focused on growing audiences for all business units, enhance brand & product awareness and create product demand, using various marketing tools & techniques.·       Manage the brand to ensure that the Brand Identity, Brand Values and key benefits are communicated and contribute to fulfilling the Brand objectives.·       Achieving targeted level of brand awareness and brand positioning in the market.·       Create and implement the communication plan ATL, BTL, Digital with a 3-year horizon to achieve Hisense & Gorenje Brand objectives and the long-term business plan. Brand Marketing·       Create and manage branding strategy and campaigns, including TVCs, print, Outdoor, Digital marketing, social media, PR and influencer & partnership to drive brand awareness and build demand for the business units.·       Ensure our brand message is strong and consistent across all channels and marketing efforts (like events, Social campaigns, web pages and promotional material). Oversee marketing efforts that build awareness and positioning for the respective brand.·       Select agencies, consultants, freelancers and other suppliers including contract negotiation and management.·       Prepare overall PR plan along with product review in major relevant publications, including content development, messaging & budget mnagement etc.·       Manage and lead all sport marketing campaign, as per Global sports initiatives like Euro Cup, FIFA W/Cup, PSG etc. Digital / Social Marketing/PR·       Manage and Oversee the digital & social marketing strategy and plan to generate awareness, traffic and conversion as well as creating and managing the organic social media calendar, drive followers and community engagement.·       Development and implementation of effective influencer campaign.·       Oversee paid marketing, including PPC, SEO, Affiliates, Paid Social and Media Planning to deliver forecast traffic and conversion goals.·       Oversee content and work to maintain and innovate an effective, lead-generating website and improve the online user experience for prospects, leads, and customers. End to end management of website.·       Coordinating all public relations activities·       Developing a marketing communications plan including strategy, goals, budget and tactics·       Developing a media relations strategy, seeking high-level placements in print, broadcast and online media·       Develop a marketing communications plan including strategy, goals, budget and tactics·       Develop media relations strategy, seeking high-level placements in print, broadcast and online media·       Coordinate all public relations activities·       Direct social media team to engage audiences across traditional and new media·       Leverage existing media relationships and cultivate new contacts within business and industry media·       Manage media inquiries and interview requests·       Create content for press releases, byline articles and keynote presentations·       Monitor, analyze and communicate PR results on a quarterly basis Offline Marketing·       Overseeing implementation of ATL / BTL activities across business units that includes Radio, Billboard, Media Planning & Buying to maximize brand awareness and visibility.·       Experience in handling PR, Media & Agencies to execute various marketing campaigns.·       Oversee the creation and delivery of PR, press releases, advertisements, print ads, publications and other marketing collateral & materials.·       Approve all production-related tasks such as Signage, Branding, Graphics, Collateral as per global CI and brand guidelines.·       Oversee and quality check all events for the company including Promotional Events, Trade Fairs, Exhibitions and partners events, etc. Ensure all events are executed in a timely manner, adhering to corporate and branding guidelines. Ensure good response and lead generation. Reporting & Budgeting·       Identify short-term and long-term scheduling, budget, and resource needs, including the development and management of an annual marketing budget, expenditure spending, and other financial considerations.·       Create and maintain metrics reports on marketing and sales activities, effectiveness, and business impact.·       Analyze marketing and sales data to develop insights and make recommendations on areas for optimization.·       Report on the effectiveness of marketing campaigns using pre-determined KPIs to the Board.Vendor Management·       Have existing relationships with external vendors, magazines, publications, PR companies and media.·       Deepen these relationships to ensure the most effective messaging and positioning of the organization.Skills",
    "Skills": [
        "·       Marketing or Business Management Degree.",
        "·       An Advanced certification in Digital and social media marketing / Communication practices is preferred. Hands on experience on digital and social media marketing.",
        "·       Must have a minimum of 5 years Marketing Management experience across ATL/ BTL/ Digital.",
        "·       Consumer Electronic and/or Consumer Durable, experience is a must. Demonstrable track record of delivering high level of marketing campaign. Expertise in Digital and Social media marketing will be advantageous.",
        "·       Must have strong media and communication skills.",
        "·       Deep understanding of consumer insight and leverage the understanding for developing Marketing Plans."
    ],
    "Preferred": {
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Public Relations (PR); Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}