{
    "Job ID": "4744521",
    "Description": "Are you ready to step into a world where the physical world will meet the virtual world? 🌐At Metaverse Real Estate we're not just in the business of selling properties, in the near future we aim to sell virtual assets also!We are looking for an enthusiastic Licensed Real Estate Agent, hungry for success!The ideal candidate must be: passionate, eager to help and guide clients to find their right real estate investment or their dream home, prospecting, building relationships, and result oriented.✅Responsibilities:Assisting clients in buying, selling, and renting properties;Researches and prospect and maintain a database to develop new business opportunities to achieve the sales target;Prioritizing and managing tasks to meet sales goals;Keeping up-to-date with market trends and regulations.Skills",
    "Skills": [
        "✅Requirements:",
        "Have a good knowledge of the UAE Real Estate Market, selling off plans, and secondary markets (Minimum of 1 year);",
        "Strong communication, negotiation skills and ability to achieve sales targets and work independently;",
        "Excellent communication skills in English and additional language (Arabic, French, Chinese, and Russian) is a bonus;",
        "Proven track record of sales success, and solid network of existing and potential clients and connections;",
        "Comfortable speaking in front of the camera;",
        "Deep knowledge of Dubai's leading developers and owners, keeping up to date with market trends, project launches, and investment options;",
        "Strong sense of team spirit, friendly and sociable;",
        "Driver license (preferred);",
        "Can start to work immediately.",
        "✅We Offer:",
        "Full competitive commission-based position;",
        "Employment visa;",
        "Premium office location in Business Bay;",
        "Registered with all major developers in UAE & premium listing access;",
        "Back office support to coordinate administration tasks;",
        "Marketing/social media/camera public speaking support;",
        "With all the necessary training and assistance to close a deal, your success is our top priority.",
        "__________",
        "#realestatehiring #hiringpost #realestateagent #dubairealestate #realestatejobs #dubaijobs #uaejobs"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}