{
    "Job ID": "4744580",
    "Description": "Registrations and prequalification:Conducting the registration process with potential clients to secure ALSUWEIDI’s prequalification and receiving RFQs and advising on additional and requirements of current licenses to secure maximum access to prospect clients and RFQs.Understanding Project Requirements:Analyzing and understanding the detailed requirements of Requests for Proposals (RFPs), tenders, or bids from clients.Coordinating Proposals:Collaborating with engineering, design, finance, and other departments to prepare competitive and compelling proposals that align with the firm's capabilities and clients' needs.Pricing Strategy:Developing pricing strategies that reflect both competitive market rates and the value provided by the firm, ensuring that the bids are financially viable.Compliance:Ensuring that the proposals comply with all legal and contractual requirements and standards.Vendor List:Continuously updating ALSUWEIDI data base of sub-consultants, specialists and associates required for services demanded by clientsSubmission Management:Managing the entire submission process, including document preparation, submission timelines, and following up with clients during the evaluation phase.Risk Analysis:Assessing potential risks associated with the project and providing strategies to mitigate them in the proposal.Post-Submission Activities:Coordinating with clients after submission, addressing any queries, and making necessary amendments to the proposal.Monitoring and Reporting:Keeping track of all bids and proposals, providing regular reports to management, and analyzing success and failure factors to improve future bidding strategies.Maintaining Relationships:Building and maintaining relationships with clients, subcontractors, and suppliers to facilitate the bidding process.Professional Development:Keeping up-to-date with industry trends, regulations, and best practices through continuous learning and professional development.Aligning with Company Objectives:Ensuring that the bid management process aligns with ALSUWEIDI's strategic objectives and values, fostering a culture of excellence and continuous improvement.Skills",
    "Skills": [
        "Educational Background:",
        "Degree in Engineering (Civil/Architectural), Business, or related field, with a focus on understanding the interdisciplinary nature of bidding in the AE industry.",
        "Relevant Experience:",
        "Minimum of 10 years of demonstrated experience in the engineering field.",
        "Minimum of 5 years of experience in bid management, project management, or a related field within the architectural engineering industry.",
        "Minimum of 2 years of experience in bidding section with an Engineering Consultancy firm in Abu Dhabi.",
        "Understanding of Industry:",
        "Knowledge of industry standards, regulations, and best practices, as well as familiarity with common tools and software used in bid preparation.",
        "Project Management Skills:",
        "Proven ability to manage complex projects with multiple stakeholders, meeting deadlines, and ensuring compliance.",
        "Communication Skills:",
        "Exceptional written and verbal communication skills, essential for creating compelling proposals and interacting with clients, suppliers, and internal teams.",
        "Analytical Abilities:",
        "Strong analytical and problem-solving skills to evaluate project requirements, assess risks, and develop strategic solutions.",
        "Negotiation Skills:",
        "Experience in negotiating contracts, prices, and terms with clients, subcontractors, or suppliers.",
        "Team Collaboration:",
        "Ability to work effectively with cross-functional teams, fostering a collaborative environment.",
        "Customer Focus:",
        "Commitment to understanding and meeting client needs, contributing to long-term relationships and business growth.",
        "Cultural Fit:",
        "Alignment with ALSUWEIDI's values, mission, and business goals, and a commitment to excellence and continuous improvement.",
        "Software Proficiency:",
        "Familiarity with bid management software and tools, as well as other relevant applications such as MS office specially, Excel, word, power point, Adobe acrobat pro etc.",
        "Leadership Qualities:",
        "Demonstrated leadership capabilities, including the ability to guide, inspire, and manage team members."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 50"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}