{
    "Job ID": "4744394",
    "Description": "Major FunctionThe Human Resources Recruitment Officer responsible for managing all aspects of staff recruitment. She oversees the process to ensure procedures are followed in a fair and transparent manner. she works closely with hiring managers to process forms, shortlist candidates, schedule interviews, and communicates with candidates and provides a high quality and professional human resources Recruitment service through the effective administration of HR recruitment system based on Recruitment policies and procedures for all WWF offices. Major Responsibilities• Supporting and participating in all recruitment Processcollecting applications, facilitating the candidate’s assessment (written Test and Interview), sending reference checks, negotiation, offering and employment contract. • Lead all recruitment processes in coordination with hiring managers• Preparing the induction frame works by coordination with all relevant departments to provide the full inductions to the new staff (local, expatriate, regional staff)• Communicate the outcome of interview and process recruitment paper work for Approval.• Send the reference check to ensure the successful candidate qualified for the role• Send job offer in verbal and written to successful and notify unsuccessful candidateSkills",
    "Skills": [
        "Excellent communication skills;\nProfessional education in Human Resource Management or subsequent domain. (Bachelor's degree )"
    ],
    "Preferred": {
        "Gender": "Female",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}