{
    "Job ID": "4744840",
    "Description": "Product Specialist in the Vascular DivisionJob SummaryThe post holder is responsible for executing MSS’ sales and marketing strategic imperative to increase market presence in the Middle East. The post holder manages three to five Class B & C hospitals and one-two MOH area depending on area size and importance. The post holder is responsible for identifying, developing, maintaining & supporting key clients and optimizing tender management through providing medical and clinical solutions for HCPs to improve the patient’s quality of life. The post holder will be part of MSS’ Sales and Marketing department, he/she will report to the Sales Manager while coordinating some of his/work with the Marketing manager and team support.Key Responsibilities and Elements of the RoleSell and promote high-end surgical solutions to public and private hospitals in Riyadh and Jeddah\nMeet with existing and potential clients and HCP’s (e.g., physicians, nurses, purchasing etc,) to identify their clinical needs, goals, and constraints related to patient care and to discuss and demonstrate how our product portfolio can help them achieve their goals.\nAttend clinical procedures in labs and operating theatre in hospital accounts.\nEstablish productive, professional relationships with key personnel in assigned Healthcare establishments, and provide solutions for their needs.\nOrganize training and educational activities and deliver clinical training programs to Health Care Professionals as well as hospital staff (Nurses etc.).\nExecute and follow through MSS sales and marketing strategy to increase market presence and market share in Riyadh and Jeddah.\nCoordinate evaluations of new products with healthcare professionals.\nOffer bids to governmental tender sales and prepare the paper work needed to submit and execute the bid once chosen.\nMonitor and analyze marketing data and channel to HOD and Marketing team.\nNegotiate prices, terms of sales, service agreements with clients ensuring sales maintain high margins.\nCompile and maintain a client database that includes appropriate client information and contacts on CRM or ERP.\nRespond to customer needs and complaints regarding products and services by developing creative and feasible solutions or working and collaborating with other departments to develop optimal solutions.\nSpend at least 95% of working time in the market.\nAny other task or project related to sales or otherwise as requested by HOD and management.Skills",
    "Skills": [
        "Education & Experience  ",
        "Bachelor degree in Business Administration, Biology, Biomedical Engineering, Nursing or any other related field to medicine.\n2-3 years’ Sales experience in medical industry",
        "Technical/ Clinical Skills",
        "3 to 5 years of surgical & technical experience\nGood clinical knowledge in the surgical field  \nFair knowledge of competitor’s products  \nKnowledge of the structure of English and Arabic language for both verbal and written communication",
        "Core Competencies",
        "Excellent Communication Skills\nAdaptability / Flexibility\nGood Negotiating and Influencing Skills\nSelf-directedness\nClient Focus\nPlanning - Organization Skills\nNetworking Skills\nTeamwork",
        "Special Requirements",
        "Ability to work in a hospital setting, primarily in operating rooms\nValid driver’s license and clean driving record\nAble to learn and handle medical Equipment"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}