{
    "Job ID": "4744737",
    "Description": "Position Title:               F&B SupervisorEmployment Type:     Full TimeSalary:                        up to 3K AED depending on experience and qualifications plus accommodation, transportation, food, tips, and service chargeJob Location:                Dubai, UAE  About the Client:  A prominent 3-star international hotel, welcoming Dubai guests in a vibrant comfortable setting perfect for business and leisure travels. Job Description:  Schedule shifts, manage staff rotations, and ensure adequate coverage during peak hours.\nLead the FOH team in providing guests a warm welcome and guide them to their seats, ensuring they have a pleasant dining experience from the moment they enter the restaurant.\nAddress guest inquiries, concerns, and complaints, striving to resolve issues promptly and to the guest's satisfaction.\nMonitor table turnover and manage reservations to optimize seating arrangements and minimize wait times.\nHave a thorough understanding of the menu, including ingredients, preparation methods, and flavor profiles, in order to guide guests and make recommendations.Skills",
    "Skills": [
        "Qualifications: ",
        "Open to Mediterranean countries\nMale, 28 to 40 years old\nDiploma or any relevant certificate\nAt least 2 years of experience in the same role or as Sr. Waitstaff / FOH Team Leader\nCandidates who can join immediately will be prioritized \nOpen to overseas candidates"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Gender": "Male",
        "Nationality": "Albania; Algeria; Bosnia and Herzegovina; Egypt; Jordan; Monaco; Morocco; Syria; Tunisia; Türkiye",
        "Age": "Min: 28 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Recruitment Agency",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}