{
    "Job ID": "4745810",
    "Description": "Perform delivery receipt confirmation; by holding, endorsing, getting signatures for each trip as assigned by implemented procedures.\nKeep the vehicle in a good condition and ask for maintenance upon need, and collaborate in issuing needed reports stands for this purpose\nMaintain high level of safety, cargo, vehicle, and other passengers while driving, uploading, and downloading or at any period.\nAbide to the implemented practice for driving and any local regulations; speed, specified detours for trucks, parking…etc.Provide the transportation as the services provided to customers; play a main role while handling the cargo for customers in providing any recommendations and other issues to ensure smooth operations.Process simple documentation to ensure or confirm receipt and delivery, and hold them to send these documents for the assigned parties.Follow up certificates and other governmental issues concerned the truck and his driving license to be handled by the concerned parties.Keep the vehicle in a good condition and ask for maintenance upon need and collaborate in issuing needed reports stands for this purpose.\nReport about any problem occurred during driving or any accident and keep the supervisory or follow up concerned employees posted about status as desired by them.Conduct simple maintenance needed to the truck and conduct routine check.Operates vehicle in a safe and proper manner and obeys local traffic laws and regulations.Complies with, at all times, with all Company safety procedures / regulations and strictly enforces them with the workforce under his responsibilitySkills",
    "Skills": [
        "Valid Heavy Vehicle Driver's License from Saudi or his country of origin\nFamiliarity with Arabic language and or English.\nCommercial Driving Skills\nManeuvering vehicle at varying speeds in difficult situations such as heavy traffic, inclement weather or in and around tight areas.\nLong distance Driving\nWith excellent communication and interpersonal skills with basic Arabic & English\nExperience for more than 02 years as Heavy Vehicle preferably for a reputed logistics or transport organization"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2 Max: 20",
        "Gender": "Male",
        "Degree": "High school or equivalent",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "50"
    }
}