{
    "Job ID": "4745987",
    "Description": "1- متابعة حسابات البنوك وتقديم بيان بالارصده اليومية والشيكات تحت التحصيل و الشيكات المصدرة ولم تسدد بعد و حصر مدفوعات الشركة ومقبوضات وتحليلها شهرياً ومراجعة حركة النقدية بالخزينة يومياً وباقى الخزائن الفرعية وما يرتبط بها من سندات قبض واذون صرف شيكات\n2- متابعة أوراق القبض الصادرة لصالح الشركة و أوراق الدفع المستحقة على الشركة ومتابعة مواعيد استحقاقها\n3- اعداد المطابقات لكافة حسابات البنوك سواء حسابات جارية او قروض وتسهيلات شهرياً ومعرفة اسباب الفروقات و اعداد قيود التسوية\n4- تجهيز المستندات المطلوبة لطلب الائتمان من البنوك ومتابعة تفعيل الائتمان بعد اصداره ومراجعة أرصدته ( للاعتمادات & خطابات الضمان/ القروض).\n5- متابعة ارصدة القروض طويلة الأجل والفوائد المدينة واقساط سداد القرض ومطابقة الحسابات مع البنك واعداد القيود المحاسبية الخاصة بالقروض والفوائد المستحقة\n6- متابعة الودائع البنكية في مختلف البنوك التي تتعامل معها الشركة ومتابعة اشعارات الربط والاستحقاق ومطابقة الفوائد المستحقة مع البنوك واعداد القيود المحاسبية الخاصة بالودائع\n7- متابعه حسابات تسهيلات الجارى المدينة والفائدة المستحقة وعمولات اعلى رصيد مدين وتسجيل القيود الخاصة بهذه العمليات\n8- متابعة ومراقبة ومراجعة المصاريف والعمولات البنكية ومطابقتها مع العقود المبرمة وتحليلها ورفع تقاريرها للمدير المباشر\n9- إصدار خطابات الضمان المطلوبة طبقاُ للتعاقد مع الجهة المستفيدة\n10- تجهيز خطاب الضمان الابتدائى لدخول المناقصات واعادتها بعد الترسية و تجهيز خطاب الضمان النهائى بعد الترسية طبقا ً لنص التعاقد واصداره وتسليمه للعميل، واعادتها بعد انتهاء الصلاحية أو انتهاء التوريد او بعد فترة الضمان .وتجهيز خطاب ضمان الدفعة المقدمة طبقاً لنص التعاقد واصداره ومراجعته وتسليمه واعادتها بعد انتهاء مدة التوريد أو تخفيض ماتم توريده\n11- تجهيز مستندات فتح الاعتمادات مثل ( طلب الفتح من الشركة يشمل الشروط وطريقة الدفع ومستندات الشحن و طلب الفتح من البنك) ومراجعة الاعتمادات بعد صدورها من البنك وإرسالها إلى المورد بالخارج وعمل تعديلات على الاعتمادات بعد مخاطبة المورد فى الخارج مثل ( مـد فترة الشحن أو سماح بتجزئة الشحن) ومراجعة مستندات الشحن الواردة من الخارج طبقاً لنص التعاقدSkills",
    "Skills": [
        "١- تحمل ضغط العمل .\n٢- مهارات جيدة في ادخال البيانات. \n٣-مهارات جيدة في المراجعة و التدقيق .\n٤- الالمام بالبرامج المحاسبية .\n٥- مهارات تواصل جيدة. \n٦- مهارات العمل مع الفريق .\n٧- القدرة على حل معوقات العمل "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}