{
    "Job ID": "4745506",
    "Description": "Receiving and Inspection:Receive incoming shipments from suppliers, ensuring accuracy in quantity and quality.\nInspect received goods for damages, discrepancies, or defects, and document findings.\nVerify inventory records against received products and update the database accordingly.Stock Storage and Organization:Properly label, tag, and categorize items before storing them in designated locations.\nUtilize warehouse management systems (WMS) to identify optimal storage locations and maintain an organized inventory layout.\nRotate stock as necessary to ensure the use of older inventory first (FIFO principle).Order Picking and Fulfillment:Retrieve items from storage areas based on order requirements, following picking lists or digital orders.\nAssemble and pack products securely, ensuring accurate quantities and proper packaging.\nPrepare orders for shipment and coordinate with shipping personnel to ensure timely dispatch.Inventory Maintenance:Perform regular stock counts to maintain accurate inventory levels and resolve discrepancies.\nAssist in regular inventory audits and reconciliation processes.\nKeep track of stock levels and report low-stock situations to supervisors for reordering.Quality Control and Safety:Maintain a clean and organized work environment to ensure safety and efficiency.\nFollow safety protocols and guidelines while handling equipment, materials, and products.Skills",
    "Skills": [
        "High school diploma or equivalent (relevant certifications or coursework are a plus).\nPrior experience in a warehouse or stock-handling role is preferred.\nFamiliarity with inventory management software or warehouse management systems.\nBasic math skills for accurate counting and calculations.\nAttention to detail and strong organizational skills.\nEffective communication skills and the ability to work in a team.\nKnowledge of safety guidelines and practices in a warehouse environment."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}