{
    "Job ID": "4745850",
    "Description": "    المسؤوليات العملية:\n\nتطبيق برنامج التوافق مع نظام المنافسة.\nتمثيل الشركة لدى لجان التسويات العمالية والمحاكم العمالية والمحاكم الشرعية.\nتمثيل الشركة أمام الجهات الأمنية والعدلية وتقديم الشكاوى والبلاغات وحضور جلسات التحقيق مع موظفي الشركة بتلك الجهات.\nإعداد ومراجعة تعاقدات الشركة مع الأطراف الخارجية بما يحقق مصالح الشركة.\nتحضير الوثائق والمستندات اللازمة والموثقة لإخلاء طرف الشركة من أي دعوى قضائية ضدها.\nإعداد خطط العمل الخاصة بالأعمال القانونية بما يحقق الأهداف الرئيسية للشركة.\nدراسة كافة القضايا المتعلقة بالشركة لدى أية جهات حكومية أو قضائية وابداء الرأي النظامي حيالها.\nابداء الرأي القانوني والنظامي فيما يحال له من مدير عام الشركة أو نائبة بخصوص إعداد القرارات أو اللوائح التنظيمية أو لوائح العقوبات والتعليمات اللازمة لإدارات ومصانع وأفرع الشركة.\nأرشفة عقود الشركة مع الجهات الخارجية بشكل مهني.\nالمشاركة في إعداد الصياغة القانونية للقرارات الإدارية الصادرة عن الإدارات ذات العلاقة.\nاجراء التحقيقات الإدارية في المواضيع التي تحال من مدير عام الشركة أو نائبة ورفع نتيجة التحقيق الإداري والتوصيات القانونية حيال ما انتهى إليه التحقيق.\nالعمل على دراسة شكاوى الموظفين المحالة له من مدير عام الشركة أو نائبة وإبداء الرأي القانوني فيها.\nالعناية بتصاريح الشركة-السجلات التجارية-الترخيص الصناعي- رخص هيئة الدواء والغذاء-رخص البلديات-رخص الدفاع المدني-رخص البيئة من مصلحة البيئة والأرصاد-بطاقات الممارسين الصحيين-أية رخص أخرى يستلزمها ممارسة نشاط الشركة بالتأكيد من استمرارها سارية الصلاحية والتنسيق مع القسم المختص بالشركة بتجديد ما يوشك على الانتهاء منها قبل موعد الانتهاء بتسعين يوم.\nأية أعمال قانونية أخرى تتعلق بالشركة أو الشركات الشقيقة أو أعضاء مجلس الإدارة بالمنطقة الجنوبية (جازان/عسير/الباحة/نجران/وادي الدواسر).\nإدراج الأعمال اليومية لحظة بلحظة من خلال برامج الشركة المعدة لهذا الغرض.\nرفع التقارير الدورية إلى مدير عام الشركة ونائبة ومدير عام الإدارة القانونية بالمجموعة لبيان ما تم إنجازه ونسبة الإنجاز وما تم تأجيله مع ذكر سبب التأجيل.  Skills",
    "Skills": [
        "المؤهلات التعليمية والفنية:\n   بكالوريوس كحد أدنى في الشريعة او القانون أو الحقوق أو العدالة الجنائية.\nالخبرة العملية:\n لا تقل الخبرة عن 3 سنوات في العمل القانوني.\n\nالمهارات:        \nالدراية الواسعة بالقوانين والأنظمة والتشريعات.    \n  التعامل الجيد مع برامج الحاسب الآلي والأجهزة المكتبية.\n  القدرة على صياغة المكاتبات والتقارير والمحاضر بطريقة قانونية مناسبة.     \n مهارات التفاوض في مجالات العمل.    \n العمل ضمن فريق.     \n   القدرة على الإبداع وتنمية المهارات.\n\nاللغات:  \n   اللغة العربية بطلاقة تحدثاً وكتابة. \n   اللغة الإنجليزية جيد جداً تحدثاً وكتابة.\nالحاسب الآلي:   البراعة في استخدام برامج ال MS Office 365 او SAP      "
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Khamis Mushait, Saudi Arabia",
        "Company Industry": "Consumer Packaged Goods Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}