{
    "Job ID": "4745402",
    "Description": "We are looking for a talented Recruiting Officer to join our team and participate in the hiring process from beginning to end. You will be responsible for attracting candidates, evaluating resumes, scheduling and conducting interviews, and managing the hiring paperwork.Implement an overall recruiting strategy\nWrite and post job descriptions on career websites\nSource candidates by using databases and social media\nEvaluate and screen resumes and cover letters\nUse recruiting tools like tests and assignments to assess candidates’ skills.\nConduct phone, Skype and/or in-person interviews\nProvide a shortlist of qualified candidates to hiring managers\nHelp the hiring team with recruiting methods and interview questions\nContact new employees and prepare onboarding sessions\nPrepare new hire paperwork, ensuring legislation requirements are met\nMaintain a complete record of interviews and new hires\nStay up-to-date with current recruiting methods\nAttend job fairs and careers eventsSkills",
    "Skills": [
        "Proven work experience as a Recruiting coordinator or recruiter\nExcellent communication skills\nAbility to prioritize and complete projects within deadline\nSolid knowledge of HR policies and best practices\nPrevious experience in the onboarding process and sessions\nHands-on experience with various selection processes like phone interviews and reference checks\nAbility to conduct different types of interviews (e.g. structured, competency-based and behavioral)\nFamiliarity with HR databases, applicant tracking systems and candidate management systems\nAbility to use psychometric tests and other assessment tools\nFamiliarity with social media, especially LinkedIn\nBSc degree in Human Resources Management, Organizational Psychology or relevant field"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Home & Office Furniture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}