{
    "Job ID": "4745788",
    "Description": "SalesManages and leads staff in achieving section’s targets\nDrives section’s sales activities to achieve targets in cash, credit, warranties & accessories\nEnsures proper implementation of promotional activities to support higher sales results\nEnsures adequate involvement of section team in analyzing sales data to maximize business results\nFollows up with sales associates on section & individual achievements\nAssists sales staff in completing difficult sales transactionsCustomer ServiceProvides exceptional customer service and ensures sales associates also provide the same level of service.\nHandles and follows on section customer’s complaints and inquires;\nInteracts with section customers to ensure the quality of services provided.\nEnsures reviewing section’s CSI results and takes necessary actions  OperationsPlans and prepares work schedules and assigns section’s employees to specific duties, manages break periods, working hours, sick leaves, and vacations;\nInspects section merchandise to ensure it is correctly priced and displayed\nRequests and suggests section’s product range/variety and maintain stock levels\nEnsures full implementation of merchandise, planogram, display, saleable as per merchandise guidelines at section level\nSecures section merchandise by implementing security systems and measures.\nReports to Store Manager on section operations, performance and resources\nEnsures all section’s activities in alignment with organizational policies & procedures.\nMaintains section’s cost control measures in alignment with business objectives.\nEnsures section’s adequate level of merchandise and supplies through coordination with relevant departments\nEnsures sending section’s perpetual count to store manager on monthly bases\nMaintains adequate section’s manpower according to budget\nConducting yearly appraisals and performance reviews with development plans for section employees\nConduct section’s checklist\nProvides constant coaching, mentoring and training for all section staff\nEnsures providing safe & secured work environment at section level\nEnsures sound housekeeping at section level\nEnsures section employee awareness of safety and emergency procedures.Cont. Job ResponsibilitiesTalent DevelopmentTrains section staff on store policies, department procedures, and job duties;\nLeads section employees engaged in sales activities and conducting of inventories,\nEnsures compliance of section employees with established location security, sales, cleanliness and record-keeping procedures and systems;\nMonitors and evaluates section staff performance and training needs;\nDevelops, inspires, motivates and provides coaching and mentoring to section staff;\nEnsures section employees’ commitment to organizational objectives.Skills",
    "Skills": [
        "Candidate Requirements:",
        "2+ years of experience,\nGood English language\nGood communication skills\nAbility to work under pressure"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}