{
    "Job ID": "4745378",
    "Description": "We are seeking a highly skilled and motivated Internal Auditor to join our retail organization's internal audit team. The Internal Auditor will be responsible for evaluating and improving the effectiveness of internal controls, risk management processes, and compliance with financial regulations within the retail industry. This role involves conducting thorough audits, identifying areas of improvement, and providing actionable recommendations to enhance operational efficiency and mitigate risks.Execute audits by performing detailed testing of financial data, transactions, and internal controls.\nVerify the accuracy and completeness of financial records, transactions, and reports.\nIdentify potential risks within retail operations, such as inventory management, sales, purchasing, cash handling, and compliance with industry regulations.\nEvaluate the adequacy and effectiveness of internal controls to prevent and detect errors, fraud, and non-compliance.\nEnsure compliance with relevant retail industry regulations, accounting standards, and company policies.\nKeep abreast of changes in regulatory requirements and industry best practices to adjust audit procedures accordingly.\nMaintain clear and organized audit documentation, including workpapers, findings, and recommendations.\nPrepare comprehensive audit reports summarizing observations, risks, and suggested improvements for management review.\nStay up-to-date with evolving retail industry trends, audit techniques, and best practices.\nParticipate in training and professional development opportunities to enhance audit skills and knowledge.Skills",
    "Skills": [
        "Bachelor's Degree in Accounting, Finance, Business Administration, or a related field. Master's degree or professional certification (e.g., CIA, CMA, CPA) is a plus.\nProven experience (3+ years) as an internal auditor in the retail industry or a related field.\nStrong understanding of retail operations, processes, and associated risks.\nExcellent written and verbal communication skills for effective reporting.\nAbility to work independently, manage multiple priorities, and meet deadlines.\nExperience on SAP is an added advantage"
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Home & Office Furniture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}