{
    "Job ID": "4745739",
    "Description": "Agnext is a fast-growing Agtech startup searching for flexible go-getters who welcome the challenge of meeting the needs of a growing business. We're looking to hire a Customer Acquisition Manager to lead our subscriber acquisition marketing strategy, tactics, planning and execution. He/she should be highly analytical, data driven and will seek to improve upon our key KPIs by acquiring the right type of customer.Positions: 2Employment Type: Full Time, PermanentLocation: Abu Dhabi, UAEWhat opportunities will make up your splendid career at AgNext?● Great opportunities in various geographies for a technologically advanced product in composition and contamination analysis, with traceability and digital payment capabilities● A true, impactful career opportunity with a company that does meaningful work● Extensive opportunities to grow your skill set and enjoy career growth● The camaraderie of energetic, highly talented team of innovatorsWhat kind of professional exposure/technical skills should you have?● Define, develop and use metrics to drive the vision and manage a business unit independently.● Guides and train teams to accomplish set revenue and product targets.● Responsible for sales governance activities including lead to conversion, warm lead management, CRM, Other Efficiency Metrics.● Managing the gamut of tasks including manpower planning, recruitment, induction and training of Sales Teams.● Develop and implement Marketing Plans with focus on improving sales efficiencies, launching of new programs, and other local promotional activities.● Know the financial performance of the business at a granular level.● Relentlessly explore ways to improve profitability and cash generation to exceed the best industry standards in all activities.● Opportunities for inorganic growth to enter new segments, or build scale and market share in existing and unexplored areas.Skills",
    "Skills": [
        "We are looking for accomplished and highly passionate professionals, who have the zeal to build out-of-the-box, high-quality products; dream big, thrive on change and innovate for today and tomorrow.",
        "Experience: 8+ Years",
        "What key traits /professional skills should you have?",
        "● An entrepreneurial spirit who is looking to have an impact on the overall success of the company",
        "● Experience with SAAS selling, worked with B2B companies",
        "● An individual that is passionate and highly motivated to meet and exceed both personal and professional targets",
        "● Experience in Customer Acquisition roles in cut through organizations.",
        "● Proficient in data analysis.",
        "● Comfortable using collaboration tools such as Salesforce.",
        "● Must be a strong public speaker, comfortable in front of large, senior groups, and a solid writer.",
        "● Excellent people and management skills to interact with staff, colleagues, cross-functional teams and third parties. Team player!",
        "What kind of educational background should you have?",
        "● A bachelor’s degree or higher, preferably in Business, Marketing,",
        "Advertising, Math or a related analytical field",
        "● Preferred Colleges: Tier-1"
    ],
    "Preferred": {
        "Nationality": "All Arab Countries; All Eastern European Countries; All GCC Countries; Lebanon"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Agriculture & Crop Production; IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}