{
    "Job ID": "4745270",
    "Description": "• مراقبة مستويات المخزون وتجديد المخزون حسب الحاجة.\n• تطوير وتنفيذ أنظمة وممارسات مراقبة المخزون.\n• الاتصال والتفاوض مع البائعين والموردين لضمان جودة مشتريات الأسهم.\n• تنسيق الخدمات اللوجستية لأوامر الشراء وتحويلات المخزون والتسليم ووضع العلامات والمعالجة.\n• التنبؤ بمتطلبات العرض والطلب لضمان توفر المخزون.\n• تتبع الطلبات الواردة والصادرة لمنع زيادة المخزون ونفاد المخزون\n• تحليل ومراجعة بيانات سلسلة التوريد لتحديد المشكلات وحلها.\n• إنشاء تقارير الشراء والتسعير وتحليل سلسلة التوريد وأنظمة إدارة المخزون.\n• إجراء عمليات فحص المخزون بشكل منتظم وإبلاغ المشرف بأي مشاكل.\n•مسك وتحديث سجلات أوامر الشراء وتقارير التسعير وسجلات الجرد\n• المشاركة بالجرد الدوري للفرع والمستودعات \n• اتباع جميع السياسات والعمليات وإجراءات التشغيل القياسية والتعليمات ذات الصلة وضمان تنفيذ العمل بطريقة متسقة ومسيطر عليها\n• المساهمة في تحديد فرص التحسين المستمر للأنظمة والعمليات والممارسات ، مع مراعاة الممارسات الرائدة ، وتحسين العمليات التجارية ، وخفض التكاليف وتحسين الإنتاجية\n• تعزيز التنفيذ والالتزام بالسياسات ذات الصلة والعمليات وإجراءات التشغيل للآخرين\n وضع استراتيجية مراقبة المخزون وسياساتها وخططها ومتابعة تنفيذها، وتوجيه أنشطة مراقبة المخزون اليومية وتنسيقها، ووضع الخطط اللازمة والتأكد من فاعليتها، ومراقبة أداء العمليات ومقارنتها بالأهداف المحددة، وإعداد الوثائق والتقارير المتخصصةSkills",
    "Skills": [
        "• ما لا يقل عن 1-3 سنوات من الخبرة ذات الصلة\nالتحليل المالي: القدرة على تحليل البيانات المالية المتعلقة بالمخزون، وفهم الاتجاهات والنماذج المالية، وتقديم تقارير مالية دقيقة ومعلومات مفصلة للإدارة.\nإدارة المخزون: القدرة على تنظيم وإدارة الأنشطة المتعلقة بالمخزون، بما في ذلك التخطيط لاحتياجات المخزون، وتنفيذ استراتيجيات إدارة المخزون، ومتابعة مستويات المخزون، وتحديث قوائم المخزون.\nالدقة والتفتيش: القدرة على العمل بدقة عالية وتنفيذ عمليات فحص دقيقة لضمان التطابق بين السجلات المحاسبية والكميات الفعلية للمخزون.\nاستخدام البرمجيات المحاسبية: الخبرة في استخدام برامج المحاسبة والجداول الإلكترونية لإدخال وتحليل البيانات المتعلقة بالمخزون.\nمهارات تقريرية: القدرة على إعداد تقارير متعلقة بالمخزون بشكل دقيق وموجز، وتوضيح الفروق والتباينات واتخاذ إجراءات تصحيحية عند الضرورة.\nالتعاون والتواصل: القدرة على التواصل بفعالية مع أفراد الفريق الآخرين، ومع الإدارة، وتنسيق مع الموردين والعملاء عند الحاجة.\nمعرفة بتقنيات المخزون: فهم جيد لمختلف تقنيات إدارة المخزون مثل تقنيات JIT (Just-In-Time) وABC (Activity-Based Costing) وغيرها.\nالقدرة على التحسين المستمر: القدرة على تحليل العمليات وتحديد فرص التحسين في إدارة المخزون وتنفيذ تلك التحسينات."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}