{
    "Job ID": "4745472",
    "Description": "Responsible for the daily operation of assigned position in Entrance Operations including but not limited to Ticketing, Turnstiles, Group Sales, Annual Pass Processing, Guest Services, VIP Guest and Rental Services. Follows all cash handling and operating procedures of the assigned area and maintains a vigilant focus on positive guest service and strict revenue management. Offers excellent guest service while meeting capacity objectives of the assigned position. Always polite, courteous and helpful. Entry Operations are the first impression of motiongate. InternalEntry Operations Management Team, Entry Operations Front Line Team & Park Operations Senior Management.  Coordinate & Attend regular departmental meetings and team briefings.ExternalGuests. Attend relevant operational meetings at other DPR attractions and with other departments outside of Operations.Handling and assisting theguests.\nResponsible for the operation of the entry operations position ensuring proper cash handling, exemplary guest service and positive employee relation whilst conveying a cheerful and positive guest experience attitude at all times.\nUnderstands the products on offer and can relate these to the needs of the guest, suggesting the best ticket packages to maximize guest experiences and park revenue. Has good employee relations whilst conveying a cheerful and positive guest experience attitude at all times.\nDaily operation of the entry operations position ensuring proper cash handling followed by the cash handling policy, exemplary guest service and positive employee relations\nPerforms duties as per SOP for the given area of work\nConveys cheerful and positive guest experience attitude at all times\nUnderstands and appreciates the varying needs of guests and reacts accordingly in a helpful and proactive manner\nComplete all position training stays current on operational changes and signs off on any procedural change\nMaintain the cleanliness of the workstations and the working areas\nRespect and follow the entry operations grooming standards at all the times\nAny other duties as may be reasonably requested by the Management Team.Skills",
    "Skills": [
        "Essential",
        "Previous work experience with cash handling in the hospitality industry\nFollows all directions given by supervisory and team leader colleagues\nOffers consistent quality guest service, interacting in a positive manner, and diffuses any negative guest situation following company protocols\nFluent in English\nExcellent Guest and employee service skills\nProven team leader that works well in a fast-paced, hourly goal-driven environment\nBackground in hospitality management\nExtensive Cash Handling Experience\nPositive can-do attitude, genuine smile\nAdapt to a changing work environment",
        "Desirable",
        "•  Theme park cash handling experience preferred",
        "•  Conversational in Arabic",
        "•  Strong interpersonal skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}