{
    "Job ID": "4745736",
    "Description": "Work Experience• At least eight years of progressively responsible and relevant experience in relief services and/or social development programmes, four years of which in management, preferably in a similar programme. is required.Languages• Excellent command of spoken and written English and Arabic.Assessment• Technical Test. • Competency-based Interview.Special NoticeContract Status: • Fixed-Term Appointment for 3 years; including 1 year probation period, with the possibility of further extension, subject to the availability of funds, satisfactory performance and continuing need.Benefits:• Grade 18, Monthly Salary JD 1246.60 Fils. plus, SOA 69.90% of basic salary, other benefitsinclude Provident Fund contribution (15.4% of basic salary paid by the Agency), medical insurance and annual leave:• Dependency allowances (if applicable).• 30 days of annual leave.• Compulsory medical insurance.Department: UNRWA - Relief and Social Services Programme.Duty Station: JFO.Other Information: • The incumbent should have a valid driving license.Desirable Qualifications: • Knowledge of the socio-economic conditions of the Palestine Refugees.• Provided very good understanding of the context of Palestine refugees and UNRWA operations.• Demonstrated experience in programme/project planning and implementation.• PRINCE II or PMP Certification is an asset.Equivalency:• When the minimum requirements are not fully met, the Director of Human Resources may exceptionally substitute part of the unmet requirements with a combination of relevant academic qualifications and progressive relevant work experience.• NB: Work experience alone or formal qualifications with no relevant work experience are not considered an acceptable combination.General Information:الرجاء تقديم طلبك باللغة الإنجليزية وملئ صفحة خطاب التغطية •• This vacancy notice is open to internal and external candidates. Only candidates residing in Jordan, and within commuting distance of the duty station with authorization to work in the duty station at the time of application are eligible to apply. The Agency will not assume responsibility or accountability to support or facilitate the issuance of a work permit in Jordan, and without a valid work permit, the appointment may be rescinded.• Since the Vacancy is an Area Staff post, the Agency will not provide coverage for relocationcosts.• Preference will be given to registered Palestine refugees and candidates assisting the Agencyto meet its commitment to gender parity. UNRWA welcomes applications from qualified candidates with disabilities.• UNRWA encourages applications from qualified and experienced women.• A roster may be created from the selection exercise, and successful candidates may become eligible for appointment to the same post or a similar post.• For UNRWA internal staff, they are required to specify and include their current UNRWA grade level. To do so applicants should select under \"Category\" RLG, scroll down to see all categories, then select their local grade.• Advertisements published only in English will only accept applications in English, and Arabic submissions will not be considered.• The Agency may disqualify applicants whose name appears on the UN Sanctions List or a UN database of staff separated for reason of misconduct or of staff who separated whilst misconduct processes were pending.• UNRWA shares investigation and misconduct information with other UN Agencies, and past and prospective employers, about staff members who have been separated for misconduct, or who have separated whilst an investigation and/or disciplinary process for misconduct is underway, and such persons may be prohibited from employment with the United Nations.• The Agency will immediately disqualify applicants who are ineligible for any reason in accordance with the Agency's regulatory framework.• UNRWA is funded almost entirely by voluntary contributions from UN member states, regional bodies, business foundations, and individual contributions. The mission of UNRWA is to help Palestine refugees achieve their full potential in human development under the difficult circumstances in which they live.• Applications from UNRWA staff members who had been demoted with deferred eligibility for promotion will not be considered.• Applications from Staff members who were recipients under the Early Voluntary Retirementor Exceptional Voluntary Separation Schemes will not be considered.• Applications from Internal candidates serving for less than one year in your current post willnot be considered.• Provided a very good understanding of the context of Palestine refugees and UNRWA operations.• The Agency reserves the right not to make an appointment, to make an appointment at a lower grade, or to make an appointment with a modified job description or to change the contract Modality.• A candidate is not eligible for consideration if he or she was short-listed and found not suitable for the same post within the previous 12 months unless the post description has since been altered by 30% or more, as determined by ODCSJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}