{
    "Job ID": "4745334",
    "Description": "Call Center Agent - Jeddah (People with disabilities) ممثل خدمة إتصال - جدة (أشخاص ذوي إعاقة)• Contributes to assigned learning events using prescribed methods to acquire understanding of the Company business (services, roles & responsibilities of other functions, systems, processes, products etc.) and Customer Experience strategy, together with the Customer's business requirements.• Organizes assigned types of transactions/new work requests received via agreed channels using appropriate methods and tools to organize & document the learning materials & information provided.• Performs realistic assessments of progress and escalates potential issues to maintain required progress to consistently meet Customer expectations/Company standards.• Contribute to the achievement of individual, team and service level goals by performing all activities in accordance with defined standards for performance and conduct.• Work on more complex requirement with guidance and/or supervision by providing information and standard solutions to meet Customer requirements.• Respond to less complex types of written Customer queries with an appropriate level of guidance from the managers.• Develops effective Team alignments including roles and responsibilities of the other functional groups, key contacts, and the role they can play in problem evaluation or implementation of special requirements.• Works with relevant contacts to progress requirements and builds professional working relationships within the Customer Experience center/structure that support cooperation, teamwork and goal achievement.• Perform less complex elements of the problem resolution process by adhering to defined standards and procedures.• Actively supports the introduction of revised processes, procedures and tools.• Identifies opportunities by initiating defined actions to optimize realization of each opportunity to improve Customer loyalty or close additional business.• Performs any other related duties, including providing contingency cover, when requested by management.• يساهم في فعاليات التعلم المعينة باستخدام الأساليب المحددة لاكتساب فهم لأعمال الشركة (الخدمات، الأدوار والمسؤوليات للوظائف الأخرى، الأنظمة، العمليات، المنتجات الخ) واستراتيجية تجربة العملاء، جنبًا إلى جنب مع متطلبات أعمال العملاء.• ينظم أنواع المعاملات/طلبات العمل الجديدة المعينة التي تم استلامها من خلال القنوات المتفق عليها باستخدام الأساليب والأدوات المناسبة لتنظيم ووثائق المواد التعليمية والمعلومات المقدمة.• يقوم بتقييم واقعي للتقدم ويصعد المشكلات المحتملة للحفاظ على التقدم المطلوب لتلبية توقعات العملاء/معايير الشركة بشكل منتظم.• يساهم في تحقيق الأهداف الفردية والجماعية ومستوى الخدمة من خلال أداء جميع الأنشطة وفقًا للمعايير المحددة للأداء والسلوك.• يعمل على متطلبات أكثر تعقيدًا بتوجيه و/أو إشراف من خلال تقديم المعلومات والحلول القياسية لتلبية متطلبات العملاء.• يستجيب لأنواع أقل تعقيدًا من استفسارات العملاء المكتوبة بمستوى مناسب من التوجيه من الإدارة.• يطور تنسيقًا فعالًا للفرق بما في ذلك أدوار ومسؤوليات المجموعات الوظيفية الأخرى وجهات الاتصال الرئيسية والدور الذي يمكن أن يلعبوه في تقييم المشكلات أو تنفيذ المتطلبات الخاصة.• يعمل مع جهات الاتصال ذات الصلة لتقدم المتطلبات ويبني علاقات عمل مهنية داخل مركز/هيكل تجربة العملاء تدعم التعاون وروح الفريق وتحقيق الأهداف.• يؤدي عناصر أقل تعقيدًا في عملية حل المشكلات من خلال الالتزام بالمعايير والإجراءات المحددة.• يدعم بنشاط إدخال العمليات والإجراءات والأدوات المعدلة.• يحدد الفرص عن طريق بدء إجراءات محددة لتحسين ولاء العملاء أو إغلاق صفقات تجارية إضافية.• يؤدي أي واجبات أخرى ذات صلة، بما في ذلك تقديم تغطية طتلباً للطوارئ، عندما يتم طلب ذلك من الإدارة.Skills",
    "Skills": [
        "• Knowledge of the “7 Steps of Customer Handling” by TMC",
        "• Usable knowledge of Microsoft Excel and Outlook software programs",
        "• Bachelor's Degree",
        "• Minimum of 2 years in Customer Handling",
        "• Business and Customer knowledge",
        "• Self-organization",
        "• Problem assessment & resolution",
        "• Quality and Continuous Improvement",
        "• Team and functional alignments",
        "• Commercial opportunities",
        "• معرفة بـ \"7 خطوات للتعامل مع العملاء\" من قبل TMC.",
        "• معرفة قابلة للاستخدام ببرامج Microsoft Excel و Outlook.",
        "• درجة البكالوريوس.",
        "• خبرة لا تقل عن سنتين في التعامل مع العملاء.",
        "• معرفة في مجال الأعمال والعملاء.",
        "• التنظيم الذاتي.",
        "• تقدير وحل المشكلات.",
        "• الجودة والتحسين المستمر.",
        "• تنسيق الفريق والوظائف.",
        "• فرص تجارية."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 0 Max: 3",
        "Nationality": "Saudi Arabia",
        "Degree": "High school or equivalent",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}