{
    "Job ID": "4745647",
    "Description": "NEW DUBAI TAXI JOBS 2023 HIRING TAXI DRIVERS IN DUBAIDubai Taxi Hiring Fresh And DriversThe Roads and Transport Authority, Dubai Taxi Corporation (DTC) is hiring fresh and experienced drivers in Dubai. Apply online for Dubai Taxi Jobs in UAE. The application process is simple, allowing you to submit your details conveniently. Be a part of a reputable organization and contribute to Dubai’s transportation sector. Apply for Dubai Taxi Jobs today and kickstart your career.Why Should I Apply For Dubai Taxi Driver?If you’re looking for a unique and fulfilling job opportunity, applying to be a Dubai taxi driver might just be the perfect fit for you. Not only does this role offer competitive earning potential, but it also allows you to immerse yourself in the vibrant and diverse culture of Dubai. As a taxi driver, you’ll have the chance to explore every nook and cranny of this breathtaking city while meeting people from all walks of life. Additionally, with Dubai being a major tourist destination, you can expect a constant influx of visitors eager to experience everything it has to offer.Benefits and Monthly Earning Dubai Taxi DriverBeing a taxi driver in Dubai offers numerous benefits and opportunities for monthly earnings. Drivers have the freedom to choose their working hours, ensuring a healthy work-life balance. With a constant influx of tourists and residents, there is a steady stream of customers throughout the day, leading to potentially high earnings. Dubai’s government regulates fares and charges, guaranteeing fair compensation for drivers. Additionally, being a taxi driver allows you to explore the vibrant cityscape, meet people from diverse backgrounds, and enjoy job security in Dubai’s growing economy. Overall, it provides financial stability and a chance to experience the charm of this cosmopolitan city.37% commission based salary. Earn 3500 AED up to 6500 AED monthly.\nGet 2 year Employment Visa from semi government company under RTA.\nGet leave vacation of 2 months after each year.\nGet a room by the company after visa on Salary deduction.\nRegular car service and maintenance by the company.\nNo advance payment or deposit is required to apply.\nEveryone inside UAE can apply for this job even without having a Driving License\nFree medical and health facilitySkills",
    "Skills": [
        "Eligibility Criteria Dubai Taxi Driver",
        "To become an eligible Dubai taxi driver, one must fulfil certain criteria.",
        "Any Country Driving License\nAged between 24 and 58 years old\nFluency in English\nGood Communication Skills",
        "Dubai Taxi Corporation offers comprehensive training programs for successful candidates covering defensive driving techniques, customer service skills, and knowledge of city routes and landmarks. Overall, meeting these eligibility criteria ensures a safe and pleasant journey for passengers in Dubai taxis while maintaining high professional standards in the industry.",
        "Document Requirements for Dubai Taxi Driver",
        "Must bring Original Passport or Emirates ID (anyone available) along with colour scan hard copies of all listed documents at the time of attending the Dubai Taxi Interview.",
        "Passport\nEmirates ID (if have)\nCv (one page)\nVisa\nPassport-size photos\nAny Country driving license copy"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Recruitment Agency",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "50"
    }
}