{
    "Job ID": "4745528",
    "Description": "Working as an Accountant would include any of the below work aspects according to the team task rotation:1- PayableReviewing of Supplier invoices\nReviewing of Pettycash\nRecording AP invoices on SAP\nPreparaion of payment request and obtain approvals\nRecording of Payments on SAP\nSupplier Reconciliaiton\nPreparaion of any required reports related to AP2- ReceivableExtracting of Sales reports from System and arranging the data in Excel\nExtacrt Bank statement of accounts to check Cash/Span deposits\nRecord Sales Entries on SAP\nRecord Bank transaction entries on SAP\nReview \"Delivery companies\" invoices, record invoices & reconcile accounts\nPreparaion of any required reports related to AR3- InventoryFood Cost Rate (FCR) report\nMonthly Full Stock taking for warehouse\nFollow up on stock issuances and stock reports, ensure variences are properly resolved.\nPrepare monthly stock movement report and esnure matching module with GL4-Cash ManagementBank recnciliation\nClassify all bank transactions into cash flow categories to ensure existence and completeness.5-ArchivingEnsure all month related filing is done\nScaning of documents + Saving scaned files in their related VAT folders\nArranging of VAT supporting documents for monthly VAT report\nEnsure all company contracts are updated both on internal log and on Kitopi Sharing6-AuditParticipate during Audit, ensure Audit/Tax requirements are ready on time, communicate with Auditors in area of responsibility and fulfill requirements.Skills",
    "Skills": [
        "Pertinent educational qualification in the field of Commerce, Finance, and Economics.\nStrong attention to detail and good analytical skills.\nQualified Microsoft Suite professional with a proven track record of implementing technology in financial tasks."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}