{
    "Job ID": "4745785",
    "Description": "Sr. Sales professional (Recruitment industry)Number of positions - 3 (mid to senior level)Company – People Dynamics, Qatar (Part of IHorizons group, Qatar as a parent company)URL -  ppldynamics.comAbout People Dynamics: We are the most trusted and reliable HR solution provider in the Qatar region. It’s more than 16+ years we have been offering high-quality HR services to our clients. We realized the rising demand for job opportunities in and around Qatar and thus started offering the best recruitment and staffing solutions for corporate clients. At present, we offer our reliable HR services in more than 20 countries, covering almost the entire Globe. Because of our strong local connections in different countries, it is easy for us to deliver the best local resources to the organizations. Our experienced recruiters understand the business culture of clients and accordingly, design a unique recruitment process for them. Maintaining and developing relationships with existing customers via meetings, telephone calls and emails;\nSearch for prospective customers in the defined territory which includes existing accounts and new accounts.\nEnsure achievement of all sales targets and analyze all company objectives.\nMaintain accurate records of all sales and prospecting activities to analyze the sales prospects.\nBoost company reputation by approaching existing and potential prospects persons and on a remote basis.\nCollaborating with the design, development, and executive teams to understand a product or a service for subsequent promotional activities.Skills",
    "Skills": [
        "Ability to analyze the goal, target customer, and challenges to overcome before planning sales-oriented activities.\nExcellent written and verbal communication skills.\nApproaching new and existing customers by following optimum consumer service standards.\nAbility to prioritize targets as per the requirements set forth by the company.\nExcellent phone and presentation skills.\nDemonstrated ability to forge long-lasting work relationships by leveraging information, tactics, and excellent communication."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 20",
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}