{
    "Job ID": "4745651",
    "Description": "Perform purchasing activities, including following up suppliers offers from distributors, suppliers, price negotiation and closing.\nSourcing materials, goods, products, and services and negotiating the best or most cost-effective contracts and deals on reasonable terms for pricing and supply.\nAssist in organizing and preparing price list and documents received by suppliers at time of purchase order submission or delivery of goods.\nAssist in monitoring all inventory level and determine appropriate delivery dates of all products and forecast all order requirements and maintain records of all activities and prepare all products for shipments.\nOrganize and update database of suppliers, delivery times, invoices, and quantity of supplies.\nAnalyse price proposals, financial reports, and other information to determine reasonable prices.\nCollaborate with logistics section to ensure compliance to all shipping dates and deadlines.\nEnsuring all stock is packaged appropriately and delivered to the correct location in a timely manner.\nCoordinate with warehouse department informing delivering dates and monitor stock level regularly.\nMaintains long term relationships with local and foreign supplier.\nExamine and review products and supplies to ensure quality.\nComparing the prices of different suppliers for gaining maximum ROI.\nEnsuring stock availability and placing orders as and when required.\nPerforming inventory inspections and reordering supplies and stock as necessary and reporting any faulty items or inconsistencies immediately.\nVerifying receipt of items by comparing items received to items ordered.\n Staying up to date with the latest market and industry trends.Skills",
    "Skills": [
        "Bachelor’s degree in Business or a related field.\n2 to 3 Proven work experience in purchasing field.\nGood knowledge of suppliers sourcing practices (researching, evaluating, and liaising with Suppliers).\nAbility to gather and analyze data.\nGood timing management skills.\nMaintain successful working relationships.\nNegotiation skills, Financial Acumen, Networking and resourcefulness, and result-oriented skills.\nThe ability to identify market trends and make decisions in a high-stress environment.\nThe ability to follow client specifications.\nAbility to build and maintain relationships with clients and vendors.\nAbility to multitask and manage multiple deadlines. "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Perfume & Cosmetics",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}