{
    "Job ID": "4745853",
    "Description": "A leading group working majorly on Government projects is looking for Mobile React native developer – 2 resource – Package up to AED 14,000specializes in building mobile applications using the React Native framework. React Native allows developers to create cross-platform mobile apps using a single codebase, which can be deployed on both iOS and Android platformResponsibilities:App Development: Design, develop, and maintain mobile applications using React Native for both iOS and Android platforms.\nCoding: Write clean, maintainable, and efficient code while adhering to best practices in React Native development.\nUI/UX Implementation: Implement user interfaces that are both visually appealing and highly usable, ensuring a seamless user experience.\nFeature Development: Collaborate with cross-functional teams to define, design, and implement new features and enhancements for the mobile application.\nBug Fixing: Identify and fix bugs and performance bottlenecks in the application, ensuring its stability and responsiveness.\nCode Reviews: Participate in code reviews to maintain code quality, share knowledge, and provide constructive feedback to team members.\nOptimization: Optimize application performance by analyzing and implementing performance improvements.\nCross-Platform Compatibility: Ensure the application functions correctly and looks consistent across different devices and screen sizes.\nAPI Integration: Integrate with backend APIs to fetch and update data in the mobile application.\nVersion Control: Use version control systems (e.g., Git) to manage and track changes to the codebase.\nDocumentation: Document code, workflows, and processes to facilitate knowledge sharing and future development.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\nProven experience in mobile application development using React Native.\nProficiency in JavaScript and its modern ES6+ syntax.\nFamiliarity with native build tools, like Xcode and Android Studio, for app deployment.\nUnderstanding of mobile app design principles and user experience guidelines.\nExperience with RESTful APIs and asynchronous programming.\nStrong problem-solving skills and the ability to debug and resolve complex issues.\nKnowledge of state management libraries like Redux or MobX.\nExperience with testing and debugging mobile applications.\nFamiliarity with version control systems, particularly Git.\nStrong communication and collaboration skills to work effectively in a team.\nAbility to learn and adapt quickly to new technologies and tools."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}