{
    "Job ID": "4745343",
    "Description": "The social media manager is responsible for running advertising campaigns and driving engagement by creating high-quality original content as well as In charge of handling Social media accounts of clients.Perform research on current benchmark trends and audience preferences\nDesign and implement social media strategy to align with business goals\nSet specific objectives and report on ROI\nGenerate, edit, publish and share engaging content daily (e.g. original text, photos, videos and news)\nMonitor SEO and web traffic metrics\nCollaborate with other teams, like marketing, sales and customer service to ensure brand consistency\nCommunicate with followers, respond to queries in a timely manner and monitor customer reviews\nOversee social media accounts’ design (e.g. Facebook timeline cover, profile pictures and blog layout)\nSuggest and implement new features to develop brand awareness, like promotions and competitions\nStay up-to-date with current technologies and trends in social media, design tools and applicationsيتولى مدير وسائل التواصل الاجتماعي مسؤولية تشغيل حملات الإعلان وتعزيز التفاعل من خلال إنشاء محتوى أصلي عالي الجودة.\nإجراء أبحاث حول الاتجاهات الحالية وتفضيلات الجمهور.\nتصميم وتنفيذ استراتيجية وسائل التواصل الاجتماعي لمواءمة أهداف الأعمال.\nوضع أهداف محددة والإبلاغ عن عائد الاستثمار.\nإنشاء وتحرير ونشر ومشاركة محتوى جذاب يوميًا (نصوص أصلية، صور، فيديوهات، وأخبار).\nرصد مقاييس تحسين محركات البحث وحركة الويب.\nالتعاون مع الفرق الأخرى مثل التسويق والمبيعات وخدمة العملاء لضمان توافق العلامة التجارية.\nالتفاعل مع المتابعين، والرد على الاستفسارات في الوقت المناسب، ومراقبة مراجعات العملاء.\nإشراف على تصميم حسابات وسائل التواصل الاجتماعي (صفحة الفيسبوك، الصور الشخصية، تصميم المدونة).\nاقتراح وتنفيذ ميزات جديدة لتعزيز وعي العلامة التجارية، مثل العروض والمسابقات.\nمتابعة التقنيات والاتجاهات الحالية في وسائل التواصل الاجتماعي وأدوات التصميم والتطبيقات.Skills",
    "Skills": [
        "Bachelor’s or master’s degree in marketing or a related field\nMinimum 3 year’s experience in social media field preferred in Ecommerce industry. \nAdvanced Social Media Certification Training Course is a plus.\nStrong knowledge and confident use of social media platforms including Facebook, #Tiktok, #Snapchat, #Twitter, #Instagram, and #Youtube.\nDemonstrable experience leading and managing social media advertising campaigns.\nSolid knowledge of social media analytics tools\nCreative thinking, leadership and time management skills.\nAnalytical skills with the ability to quickly adapt to new tools and platforms.\nStrong problem-solving and strategic thinking skills.\nAbility to work in a fast-paced, high-pressure environment.\nAbility to measure the success of campaigns.",
        "درجة البكالوريوس أو الماجستير في التسويق أو مجال ذي صلة.\nخبرة لا تقل عن3 سنوات في مجال وسائل التواصل الاجتماعي مفضلة في صناعة التجارة الإلكترونية.\nدورة تدريبية متقدمة في شهادة وسائل التواصل الاجتماعي هو إضافة إيجابية.\nمعرفة قوية واستخدام واثق لمنصات وسائل التواصل الاجتماعي بما في ذلك فيسبوك، تيك توك، سناب شات، تويتر، إنستغرام، ويوتيوب.\nخبرة واضحة في قيادة وإدارة حملات الإعلان عبر وسائل التواصل الاجتماعي.\nمعرفة قوية بأدوات تحليل وسائل التواصل الاجتماعي.\nتفكير إبداعي، مهارات قيادية، ومهارات إدارة الوقت.\nمهارات تحليلية مع القدرة على التكيف بسرعة مع أدوات ومنصات جديدة.\nمهارات قوية في حل المشكلات والتفكير الاستراتيجي.\nالقدرة على العمل في بيئة سريعة الخطى وذات ضغط مرتفع.\nالقدرة على قياس نجاح الحملات."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries; All Eastern European Countries; All Western European Countries; Canada; Philippines; United States",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}