{
    "Job ID": "4745823",
    "Description": "1. Assist the sales team to achieve sales targets, provide all-round sales support, and ensure customer satisfaction. 2. Responsible for processing sales orders, tracking order status and timely providing customers with shipping information, answering orders related questions. 3. Coordinate internal team resources to ensure orders are delivered on time and address issues that may affect delivery. 4. Handle customer inquiries and complaints, listen patiently to customer needs, find solutions, and ensure that customer problems are properly handled. 5. Gather market information, understand competitor dynamics, and provide information to sales teams about market trends and customer feedback. 6. Assist the sales team in preparing sales presentations, proposals and quotations, and customize relevant materials according to customer needs. 7. Maintain a customer relationship management system (CRM) to keep track of sales activities, customer communications, and progress. 8. Assist in organizing sales activities and promotion activities to enhance the company's product awareness and market share. 9. Responsible for maintaining and updating the enterprise resource planning (ERP) system to ensure that sales data and order information are accurate. 10. Serve as a bridge between the sales team and other departments, coordinate cross-departmental cooperation, and solve coordination problems in work. 11. Participate in sales meetings, share sales and customer feedback, and suggest improvements to optimize the sales process. 12. Continuously learn the company's product knowledge and sales skills, maintain an understanding of industry trends, and provide customers with professional consultation.Skills",
    "Skills": [
        "1. Bachelor degree or above, marketing, business management or related professional background is preferred. ",
        "2. Have good communication skills and teamwork skills, and be able to work effectively with internal departments. ",
        "3. Patient and adaptable, able to deal with customer issues and complaints, and maintain a positive work attitude. ",
        "4. Basic sales philosophy and market sensitivity, understanding of sales process and customer relationship management. ",
        "5. Proficient in office software and CRM systems, able to effectively manage sales-related data. ",
        "6. Familiar with enterprise resource planning (ERP) system operation and maintenance to ensure data accuracy. ",
        "7. Good command of English reading and writing is preferred, able to communicate with international clients on a basic basis. ",
        "8. Ability to learn quickly and adapt, and be able to work in a fast-paced environment. ",
        "9. Be able to coordinate interdepartmental work, solve problems in cross-departmental cooperation, and ensure smooth work"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}