{
    "Job ID": "4745548",
    "Description": "To maintain vendor’s details and assist the Procurement Officer (Procurement – Admin.) to update & maintain the Centralized Vendor Master in accordance with Company procedures and approvals.\nTo receive Requisitions, review requisitions and process and follow the company Procurement procedure by initiating RFQs and follow the procedure until goods are received, invoices settled and orders closed in total and records updated.\nTo maintain records and documents in proper order including documents related to Technical details, payment details, shipping documents, Orders Status reports etc., in good order.\nTo communicate with suppliers and other Departments / vendors / Inspection companies, Logistics etc., to follow up and expedite prompt action.\nTo assist the Processing or Tender requirements in processing RFQs, obtain offers, attend to queries if any through the Originators and make final Summary and submit to the Tendering through the Departmental procedure.\nTo assist the procurement & Agencies Manager as and when required.\nTo assist the Department & Agencies Manager as and when required.\nFollow the set KPI s and standard departmental performance expectations to achieve results.\nSending the RFQ to the right vendors\nTo ensure correctness of information in the quotes received\nObtaining the correct price\nPlaying an important role in finalizing/ helping to finalize the vendor\nPreparing Orders with correct information\nExpedite Material Delivery\nArranging all documents required for Customs Clearance\nInsurance for Projects & departments Coordinate with FAD and follow-up Payment to vendors\nResolve discrepancy with vendors regarding material / payment\nPerformance evaluation of existing Vendors\nEvaluate & add New vendorSkills",
    "Skills": [
        "Bachelor’s degree / Diploma in any discipline\ncommunication skills – English Verbal & Written.\ncomputer skills.\nwith Procedure and Documentation with regard to procurement of spares & services, Stores, related to Equipment & vehicles.\n4 to 6 years of work experience in the Procurement / Stores / Spares environment.\nexperience in Purchasing, Stores, and spare parts and inventory.\nTo follow all activities as mentioned in the Procurement Manual & execute works as per company procurement procedure"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}