{
    "Job ID": "4745357",
    "Description": "1       الإشراف الإداري العام على المشروع.\n2         التواصل والمتابعة المستمرة مع إدارة الخدمات بشكل خاص وأدارة الجامعة بشكل عام.\n3         التواصل والمتابعة مع الإدارة المالية. (استلام وتسليم المستخلصات دون أية تأخيرات).\n4         أستقبال طلبات الخدمة من إدارة الخدمات و تحويلها للمشرف الفني.\n5         الإجتماعات الإدارية داخل المشروع والتي تتطلب تمثيل الشركة.\n6         إرسال طلبات المواد الكيميائية والمعدات الخاصة بالعمل داخل المشروع للأدارة الرئيسية لشركة هيت بعد التنسيق مع المشرف الفني حول جميع الطلبات.\n7         عمل التقارير الأسبوعية والشهرية والربع سنوية عن أداء عمل شركة هيت داخل المشروع وذلك بالتنسيق مع المشرفين الفنيين في الموقع.\n8         إعتماد طلبات صيانة الآلات والمعدات داخل المشروع بعد موافقة مدير التشغيل.\n9         رفع التقارير الفنية الأسبوعية والشهرية الخاصة بالعمل داخل المشروع بعد مراجعتها مع المشرفين الفنيين في الموقع لأدارة المشروع.\n10       رفع الطلبات المختلفة للعمال داخل المشروع للأدارة الرئيسية للشركة.\n11       متابعة المركبات ( صيانة ، فحص دوري ، تغيير الزيوت والكفرات، الخ ...).\n12       عقد أجتماعات دورية مع جميع موظفين المشروع وأرسال محاضر الأجتماعات بشكل دوري لمدير التشغيل.\n13       متابعة جميع المشاكل والتحديات والمتطلبات التي تواجه فريق العمل داخل المشروع.\n14       تنسيق جداول العمل للفنين والمشرفين.\n15        عمل دورات تدريبة بشكل شهري للفنيين مع التنسيق مع المشرفين الفنيين.\n16       متابعة نظافة المركبات وسكن الفنيين وذلك بالتنسيق مع المشرفين الفنين.\n17       متابعة صيانة المعدات بشكل دوري.\n18       مراقبة مخزون المستودع ( المواد الكيميائية ، المعدات ).\n19       متابعة مصاريف عهدة المشروع.\n20       تحمل مسؤولية أية مخالفات من أدراة المشروع والتي تنتج عن الأهمال الأداري أو العملي لفريق العمل.\n21       اتباع سياسات وإجراءات الصحة والسلامة العامة لجميع العاملين في المشروع.\n22       الاشراف والتأكد من توفر القطع الاحتياطية لقطع غيار معدات التشغيل.\n23       الاشراف والتأكد من توافر المواد الخام ووجودها بمستودع المشروع.\n24       مسئول مسئولية مباشرة عن استهلاك المواد الخام .\n25       مسئول مسئولية مباشرة عن المواد الخام/ المعدات/ العناصر الموجود بالسيارة .\n26       مسؤول عن مساعدة السائقين في عمليات صيانة سيارات الشركة أو توجيه أحد المشرفين.\n27. الشواغر الوظيفية متوفرة في مدينة الاحساء, الرياض وجدة.Skills",
    "Skills": [
        "1- مهارات قيادية.\n2- مهارات الحاسب.\n4- معرفة في مكافحة الآفات والحشرات."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Utilities",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}