{
    "Job ID": "4745702",
    "Description": "Provide support to the operations manager in the day to day running of the organization.\n     Develop work rules and guidelines for company employees.\n     Identify what is required for staff to carry out their duties.\n     Schedule projects and ensure assignments are carried out as planned.\n     Work hand-in-hand with top management staff concerning work/operational issues and other activities.\n     Draw up reports regarding operations in the company and pass them to top management whenever it is requested for.\n     May be responsible for preparing yearly budget for the company so that at the end of the year, performances (profits or losses) will be analysed alongside the budget that was used.\n     Serve as a guide to fresh employees so as to make sure that they adhere to company rules and that the result of their various tasks meets company standard.\n     Oversee financial issues and the development of long-term goals that enhance company growth.\n     Carry out evaluation of company’s present operational goals and suggest ways of improving important areas.\n     Maintain and organize company’s facilities.\n     Educate operations team on company policies and excellent service standards.Skills",
    "Skills": [
        "     Must possess good communication skills on all fronts and must be someone that gets along pretty well with other people, i.e., musty have good interpersonal skills.\n     He/she must also portray good leadership abilities.\n     Must be able to work and deliver within limited time range or frame.\n     Should be able to work as part of a team on a regular basis.\n     He/she must have good analytical, problem solving, and organizational abilities.\n     He/she must have a good understanding of how an administrative setting operates and also know what is required at any given time.\n     A degree in any management or business-related field\n     Experience of not less than 2 years in an administrative capacity\nCertification in basic computer appreciation programs is also of great importance."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Degree": "High school or equivalent",
        "Age": "Min: 20 Max: 47"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Corporate Management Office; Administration Support Services; Business Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}