{
    "Job ID": "4745973",
    "Description": "Administrative: Follow-up on general administrative work and secretarial duties at the office.\nDocument Controlling: Organizing, filing, archiving and retrieving documents.\nCoordinate with clients and service providers: Respond and communicate with clients and service providers to ensure smooth flow of work. Prompt handling of calls, messages, emails, and other correspondences. Maintain the company's reputation by greeting customers, clients, and visitors in a cordial, charming, and helpful manner.\nMarketing and Market Research: Follow-up and updating the company's social media. Conduct market research as per the company's requirements.\nDraft quotations and invoices: Issue quotations and invoices for clients and service providers.\nPublic Relations: Represent the company at meetings and trade shows when required.Skills",
    "Skills": [
        "Experience: Experience in business support and office administrative work.\nEducation: College Diploma / University Degree\nMarketing Skills: Marketing skills (online) and promotional channels over the internet is required. Knowledge of market research techniques and social media will be an advantage\nComputer skills: Thorough knowledge of MS Office (Word, Excel, Outlook) and other basic apps. Previous work experience and knowledge on Zoho CRM and its related applications will be an advantage.\nOther Skills: Command ofEnglish Language / Public Relation Skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Administration Support Services; Marketing; Market Research",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}