{
    "Job ID": "4745856",
    "Description": "Our company \"Doctor Guard pest control\" is looking for a supervisor of pest control with good work experience.Skills",
    "Skills": [
        "We are looking for an experienced pest control engineer/supervisor approved by Dubai Municipality. job description:",
        "• Determine the type of treatment necessary for the destruction of a particular type of pest, and consult technical specialists and customers about the type of treatment necessary for the destruction of identified pests.",
        "• Inspect the clients' premises to determine the necessary dimensions of the area in need of pest control.",
        "• Fill out all necessary paperwork according to customer requirements.",
        "• Ensure that technical personnel use suitable pesticides by following the instructions on the label and following safety procedures.",
        "• Respond to customer requests for various pest control services.",
        "• Sale/marketing of pest control services",
        "REQUIRED SKILLS:",
        "• The identity card of the head of the Dubai Municipality is mandatory",
        "• UAE driver's license is mandatory",
        "• Timely completion of work.",
        "• Bachelor's degree in Agriculture / Zoology / Entomology",
        "• Certified Supervisor/engineer with proven experience as a supervisor/pest control engineer or a similar position.",
        "• The ability to stand for a long period of time when working in uncomfortable conditions.",
        "• Understand and manage all equipment and chemicals.",
        "• Knowledge of pest and termite control measures is of paramount importance.",
        "• Candidates should have knowledge of the preparation of reports on the work done. Must have good customer service skills and be customer-oriented.",
        "• Must have managerial skills.",
        "• Good communication skills in English - read, speak and write."
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Safety & Environment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}