{
    "Job ID": "4745712",
    "Description": "We are hiring for an HR ManagerLocation - DubaiJob Overview - Our Client is looking to hire an HR manager who can lead a team of over 450+ employees (Retail & Production Unit). The individual should be experienced, motivated and capable of leading and developing the existing team as well as securing new team members for various departments within our organization. He must take ownership of all HR matters across the company from recruitment to performance reviews, wage reviews, disciplinary action and learning and development.Responsibilities and Duties● Forecasting hiring needs, particularly at peak seasons● Consistently recruiting excellent staff● Calculate and report on employee turnover rates (monthly, quarterly and annually)● Training, counseling and coaching our team● Plan and strategize methods to increase retention● Resolving any conflicts or employee grievances in a professional and positive manner● Reviewing performance of each employee on a monthly, quarterly and annual basis● Reviewing salary based on performance appraisals● Managing payroll● Nurturing a positive working environment● Report to management and provide decision support through HR metrics● Leading a team of HR executives Skills",
    "Skills": [
        "Qualifications & Skills",
        "● Bachelor’s degree in human resources or a related field",
        "● 3-5 years experience as HR manager in a medium to large-sized retail organization",
        "● Excellent interpersonal and communication skills (English & Hindi)",
        "● Effective negotiation skills",
        "● Good analytical skills and comfortable to work with large amounts of data",
        "● Ability to give presentations Duty Timings",
        "● Working hours - 9 hours",
        "● Weekly one day off"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Jewelry & Gold",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}