{
    "Job ID": "4745855",
    "Description": "A leading group working majorly on Government projects is looking for Application Administrator – 2 resources – package up to 12,000AEDResponsible for the installation, configuration, maintenance, and support of software applications used within an organization. This role involves ensuring that applications are running smoothly, securely, and efficiently to meet the needs of users and the business. Below is a typical job description for an Application Administrator: Responsibilities:Application Deployment and Configuration:Install, configure, and maintain software applications, ensuring proper integration with other systems.\nCollaborate with development and infrastructure teams to ensure successful application deployment.Monitoring and Performance:Monitor application performance, troubleshoot issues, and optimize performance parameters.\nIdentify and resolve performance bottlenecks to ensure optimal user experience.Security and Access Control:Implement security measures and access controls to protect sensitive data and ensure compliance with security policies.\nRegularly update and patch applications to address security vulnerabilities.User Support:Provide technical support to end-users, addressing application-related questions and issues.\nTroubleshoot user-reported problems and provide timely resolutions.Data Management:Manage application data, including backups, restores, and data migrations.\nEnsure data integrity and consistency within the application.Configuration Management:Manage configuration settings and parameters for applications.\nImplement changes and updates in alignment with business requirements.Documentation:Maintain accurate documentation of application configurations, procedures, and troubleshooting steps.\nCreate user guides and training materials for application users.Collaboration:Collaborate with developers, system administrators, and business stakeholders to ensure seamless application operation and alignment with business needs.Testing and Quality Assurance:Conduct testing, including regression testing, after application updates and changes.\nEnsure new features or changes do not adversely affect the application's functionality.Upgrades and Enhancements:Plan and execute application upgrades and enhancements in coordination with vendor recommendations and business needs.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor's degree in Computer Science, Information Technology, or related field (or equivalent experience).\nProven experience as an Application Administrator or in a similar role.\nFamiliarity with application deployment, configuration, and management.\nUnderstanding of software development lifecycle processes.\nStrong problem-solving skills and attention to detail.\nProficiency in troubleshooting application-related issues.\nKnowledge of database management systems and SQL queries.\nFamiliarity with operating systems, networking, and security concepts.\nEffective communication and collaboration skills.\nAbility to work independently and manage tasks with minimal supervision.",
        " "
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}