{
    "Job ID": "4745471",
    "Description": "Assisting the AVP Quality Assurance in managing the responsibility of being an overall brand custodian by tracking image/ perception in the market, and suggesting plans to amend and enhance any quality assurance-based programs.\nAssisting in ensuring compliance with all policies/procedures and manuals which define the scope of the reviews and which are in consonance with applicable guidelines/regulations in this regard.\nMaintaining adequate supply levels of display and merchandising material and arranging distribution to branches, ATM locations and other outlets, ensuring consistency with established corporate brand standards is maintained.\nProviding recommendations on potential printing companies, suppliers merchandising items and promotional material which meet up to the quality standards.\nAssisting in drafting annual brand audit “domestically & internationally” and keep record of progress / changes.\nImplementing and conducting scheduled branches/ offices visits for checking proper usage of brands and images (i.e., logos, merchandising items, stationeries, collateral).\nListing audit findings and prepare reports to communicate outcomes of quality assurance visits, assisting in evaluating audit findings and implementing appropriate corrective actions.\nAssisting in monitoring risk management activities within the communication department.\nPerforming any other function as directed by the Head of Quality Service and the GM Communications\nPossessed knowledge of integrated quality assurance techniques and how to select and apply the use of them to meet the organization’s objectives.\nIdentifying areas for professional development of self and all direct reports, and act to enhance professional development of self and others.\nMaintaining an understanding of all pertinent regulations as well as best practices pertaining to the overall operations of the Group.Skills",
    "Skills": [
        "5 years of experience in merchandising and quality assurance functions."
    ],
    "Preferred": {
        "Nationality": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Banking; Islamic Banking",
        "Company Type": "Recruitment Agency",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}