{
    "Job ID": "4745812",
    "Description": "We are currently seeking a highly skilled and experienced Supply Chain and Procurement Manager to join our team in the Eastern Province, Saudi Arabia. As the Supply Chain and Procurement Manager, you will be responsible for overseeing all aspects of the supply chain and procurement process, ensuring efficient and cost-effective operations. You will work closely with suppliers, vendors, and internal stakeholders to optimize inventory levels, minimize costs, and maximize customer satisfaction.Responsibilities:Develop and implement strategic procurement plans to support the company's growth objectives.\nManage and coordinate the procurement process, including sourcing, supplier selection, and negotiation of contracts.\nMonitor supplier performance and ensure compliance with contractual agreements and quality standards.\nCollaborate with cross-functional teams to forecast demand, plan inventory levels, and optimize supply chain operations.\nIdentify cost-saving opportunities and implement initiatives to reduce procurement costs.\nEnsure timely delivery of goods and materials to meet production schedules and customer requirements.\nOversee the inventory management process, including tracking stock levels, conducting regular audits, and implementing measures to prevent stockouts or overstocking.\nDevelop and maintain strong relationships with key suppliers and vendors, fostering long-term partnerships.\nStay up-to-date with industry trends and best practices in supply chain and procurement management.\nLead and mentor a team of procurement professionals, providing guidance and support as needed.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in supply chain management, business administration, or a related field.\n7-10 years of experience in supply chain and procurement management, preferably in the [industry] industry.\nProven track record of successfully managing end-to-end procurement processes and delivering cost savings.\nStrong negotiation and contract management skills.\nExcellent analytical and problem-solving abilities.\nAbility to work under pressure and meet tight deadlines.\nStrong leadership and team management skills.\nKnowledge of relevant laws, regulations, and industry standards.\nProficiency in using supply chain management software and tools.\nExcellent communication and interpersonal skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 10"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}