{
    "Job ID": "4745678",
    "Description": "Reports to: Group IT DirectorJob Purpose:Recruiting for a Dynamics 365 PSA/FinOps with Dynamics 365, Supply Chain Techno Functional and Power BI knowledge.The objective of this role is to maintain and support business processes in the Microsoft Dynamics 365 environment for diversified business verticals.Key ResponsibilitiesØ Responsible for the execution of tasks related to the support, maintenance and documentation of information systems running on Microsoft Dynamics 365 FinOps/PSA, Microsoft Azure DevOps, Microsoft Flows, Custom Portal, and Power Platform environments.Ø Perform system enhancements, platform upgrades, new solution or plugin implementations, Integrations and Flows.Ø Liaise with business departments and understand business processes and ensure these are correctly mapped with the system. Analyze business requirements and recommend an implementation approach. Web development methodologies, and development, experience with web-based technologies, including HTML code, CSS layout, Dynamics 365 APIs and CSSØ Execute deployments in production and non-production environments and be willing to support deployments outside of normal working hours. D365 applications process design and configuration.Ø D365 application design, development, integration, testing and deployment.Ø D365 application technical architecture. Leading the D365 Supply Chain WorkstreamØ Converging business requirements into the most eﬃcient technical modelsØ Break down business processes, to map out and link any functional and non-functional requirements.Ø Analyzing and designing solutions for applications, matching processes that ﬁt application requirements seamlessly.Ø Manage gaps detected during prototyping.Ø Leading the testing of the proposed system.Ø Documenting the process, informing, and preparing clients during critical moments in the projectØ Prototyping and conﬁguring Microsoft Dynamics 365 processes that make the business systems run smoothly and swiftly.Ø Training users and explaining complex reasoning behind changes.Ø Create, conﬁgure, and support Power Apps, Power Automate workﬂows & Power Bi dashboards.Ø Translate abstract business requirements into atonable technical requirements which can be executed using Power Apps, utilizing best practices within the Power Platform CommunityØ Supports users by developing documentation and assistance tools.Skills",
    "Skills": [
        "Ø Should have completed at least 2-3 Dynamics 365 implementation life cycles.",
        "Ø Should have strong technical and functional knowledge of Project Management and Financial Modules.",
        "Ø Should have strong understanding of Microsoft ﬂows and integration between modules mainly PSA to FinOps. Should be able to create and resolve flows/integration errors.",
        "Ø Should demonstrate skills to lead team of ERP as well as with team members in diﬀerent locations.",
        ".    Requirement open for all nationals.",
        "2.    B.S. in Computer Science or Masters in Finance",
        "3.    5-8 years of experience",
        "4.    Dynamics 365 Certification in relevant modules",
        "5.    Working knowledge of at least one software development methodology",
        "6.    Working knowledge of Microsoft platform skills",
        "7.    Working knowledge of Microsoft Project."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}