{
    "Job ID": "4745614",
    "Description": "تعهد مشروع التصميم بداية من الفكرة وحتى التنفيذ على أرض الواقع.\nإنشاء تصميمات داخلية مميزة تلبي احتياجات العملاء، وتوفير خيارات الألوان أو قطع الأثاث.\nتصميم الديكورات الداخلية للمنازل والمكاتب والفنادق، بالإضافة إلى المحالّ التجارية والمباني العامة وغيرها.\nالتعاون مع العملاء لتحديد الأهداف والتعرف على المتطلبات الأولية للمساحة المراد العمل عليها.\nترجمة متطلبات العميل إلى خطط تقريبية.\nتصميم الرسومات وغيرها من الأدوات البصرية لتوضيح التصاميم الأولية للعميل.\nالاستجابة إلى أي تعديلات يريدها العميل في التصميم.\nالتشاور مع العملاء من أجل تحديد الديكورات وألوانها ونوع المفروشات وغيرها.\nاستخدام التطبيقات الخاصة بالتصميم لإعداد الخطط والتصاميم النهائية.\nتحديد الجداول الزمنية للانتهاء من العمل وتقديم تقديرات دقيقة للعملاء حول تكلفة المشروع.\nتحديد متطلبات المشروع وعمل تقرير بشأن المواد اللازمة لتنفيذه وتسجيل الأدوات التي تم شراؤها وكمياتها.\nالالتزام بمواصفات المشروع وأيضا الميزانية المخصصة.\nالإشراف على تركيب المواد وعناصر التصميم المختلفة.\nزيارة المشروع مع العميل بعد الانتهاء منه للتأكد من رضاء العميل ومعالجة أي شكاوى.\nالتعامل مع المصممين الآخرين والمهندسين المعماريين وعمال البناء.\nعمل تجديدات في المباني القديمة أو الإنشاءات الجديدة.\nاختيار الإضاءات والأثاث وكافة التركيبات.Skills",
    "Skills": [
        "يجب أن يكون حاصلا على بكالوريوس هندسة ويفضل حصوله على ماجستير في التصميم الداخلي أو أي مجال آخر ذات صلة.\nمهارات تنظيمية ممتازة وقدرة على حل المشكلات.\nيجب أن يتمتع بذوق رفيع لخلق تصميمات مميزة ورائعة.\nمهارات ممتازة في التصميم.\nالقدرة على استخدام البرامج الخاصة بالتصميم بمساعدة الحاسوب.\nالفهم التام للقوانين الخاصة بالبناء، والمعايير الخاصة بالتصميمات الداخلية.\nمهارة التمييز بين الألوان المختلفة ودرجاتها.\nخبرة علمية عالية في تزيين المساحات الداخلية وتخطيط المساحات.\nمهارات إبداعية عالية وقدرة على التخيل لابتكار تصميمات جديدة.\nمهارات تواصل ممتازة.\nمهارات إدارة أكثر من مشروع في وقت واحد.\n\nالمهارات البرمجية:\nAutocad\nRevit\n3D Max\nSketchup\nPs - Pi"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Muwanisiyah, Riyadh , Saudi Arabia",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}