{
    "Job ID": "4745769",
    "Description": "Qualification & Work Experience·       Sales Representative with Vehicle Access/Parking Solutions with 2+ years GCC experience. ·       Handle sales operations in UAE and Oman with possible expansion to other GCC countries. ·       Create and execute a strategic sales plan that meets Sales Targets and achieves a consistent Market Share growth. ·       Track and Analyze Market Dynamics, reporting Product enhancement aspects. ·       Represent Company in Local and Regional Exhibitions ·       Manage full Sales cycle from Initiation of opportunity till Handover and Collection. ·       Share Monthly reports reflecting Sales Plan achievements based on key quantitative metrics. ·       Handle necessary Product Certifications, Prescriptions and Approvals by Government Authorities. Benefits·       Multi-national, Friendly and Cooperative work environment ·       Market standard compensation with generous commission and bonus schemes. ·       Mostly autonomous work profile backed up by Engineering, Pre-Sales and Commercial teams. ·       Focused and highly engineered quality Product line with In-House R&D team. ·       Immense growth opportunitiesSkills",
    "Skills": [
        "·       Minimum 2+ years previous sales experience in Vehicle access & Parking solutions related field.",
        " ",
        "·       Excellent command of English both written & spoken",
        " ",
        "·       Preference to Arabic speakers and holders of Engineering degrees.",
        " ",
        "·       Strong communication skills and Professional Sales Attitude. Ability to initiate and close projects.",
        " ",
        "·       Good Research and self-learning ability",
        " ",
        "·       U.A.E Driving License"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}