{
    "Job ID": "4745776",
    "Description": "We are hiring a Planning Manager who has expertise in Contracts and claims.Location - DubaiThe ideal candidate will have excellent analytical and problem-solving skills, as well as a strong background in project management. This individual will be responsible for developing and implementing project plans, tracking progress, and ensuring that projects are completed on time and within budget.Responsibilities:Develop and implement project plans, including defining project scope, goals, and deliverables.\nCreate and maintain project schedules, ensuring that all tasks and milestones are identified and tracked.\nMonitor project progress and make adjustments as necessary to ensure that deadlines are met.\nCollaborate with cross-functional teams to identify and resolve any issues or roadblocks that may impact project timelines.\nConduct regular project meetings to communicate updates, discuss challenges, and make decisions.\nPrepare and present project reports, including status updates, key metrics, and risks.\nEnsure that projects are completed within budget by monitoring expenses and making cost-saving recommendations.\nIdentify and implement process improvements to enhance project efficiency and effectiveness.\nStay up-to-date with industry trends and best practices in project management.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum 1-5 years of experience in project planning and management.\nBachelor's degree in Engineering or a related field.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal skills.\nAbility to work well under pressure and meet tight deadlines.\nProficiency in project management software.\nKnowledge of construction industry practices and regulations.\nAttention to detail and strong organizational skills.\nAbility to work independently and as part of a team.\nProject management\nAnalytical thinking\nProblem-solving\nCommunication\nTime management"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}