{
    "Job ID": "4746699",
    "Description": "Functional DescriptionThis position carries out all painting repairs required on the customer's cars. Major Duties and Responsibilities• Carry out all required paint repairs as indicated on the repair job card by the workshop controller or service advisor on the customer's cars within allocated time.• File, grind, sand and smooth filled or repaired surfaces, using power tools and hand tools.• Sand body areas to be painted and cover bumpers, windows, and trim with masking tape or paper to protect them from the paint.• Prime and paint repaired surfaces, using paint spray guns and motorized sanders.• Check the car for any prior unidentified additional defects.• Carry out a final check on the repairs carried out.• Apply diagnostic measures on the vehicle.• Maintain speedy and correct rectification of the paint defects.• Follow the work instructions as indicated by the workshop controller or factory literature.Note: this job description shall include, but is not necessarily limited to the above duties. May temporarily perform other duties assigned to maintain operations and services. Reporting LineThis position reports to the Lead Painter. Span of ControlThis position has no supervisory authority.Skills",
    "Skills": [
        "Qualifications",
        "• Diploma in Mechanical Engineering or any related Technical field.",
        "• Minimum 1-3 years of related experience.",
        "• Excellent communication and interpersonal skills.",
        "• Good commands of Arabic and English."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 0",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}