{
    "Job ID": "4746840",
    "Description": "A Talent Acquisition Specialist is responsible for sourcing, attracting, and hiring top talent for our company. The ideal candidate will have experience in full-cycle recruiting and a strong understanding of different sourcing techniques. They will be responsible for developing and implementing recruitment strategies, conducting interviews, and ensuring a positive candidate experience throughout the hiring process.Responsibilities:Collaborate with hiring managers to understand their recruitment needs and develop job descriptions and specifications\nSource potential candidates through online channels (e.g. social platforms, job boards, professional networks) and offline methods (e.g. career fairs, referrals)\nScreen resumes and applications to identify qualified candidates\nConduct phone, video, and in-person interviews to assess candidate qualifications and cultural fit\nCoordinate and schedule interviews with hiring managers and candidates\nAdminister and evaluate pre-employment assessments and tests\nConduct reference checks and verify employment and educational qualifications of candidates\nPresent job offers and negotiate compensation packages\nMaintain candidate databases and ensure compliance with data protection regulations\nStay up-to-date with best practices in recruitment and talent acquisitionSkills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in Human Resources or a related field\nProven experience as a Talent Acquisition Specialist or similar role\nStrong knowledge of recruitment techniques and best practices\nExperience using applicant tracking systems and HR databases\nExcellent communication and interpersonal skills\nAbility to handle multiple tasks and prioritize workload\nStrong attention to detail and problem-solving skills\nAbility to work independently and as part of a team\nFlexibility and adaptability to changing priorities and requirements\nKnowledge of labor laws and regulations",
        "Experience with recruitment tools and platforms\nExcellent sourcing and networking skills\nAbility to assess candidate qualifications and cultural fit\nStrong negotiation and influencing skills\nKnowledge of industry trends and best practices in talent acquisition"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 4"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}