{
    "Job ID": "4746660",
    "Description": "Receptionist - RiyadhObjectivesEnsure the highest level of customer care and satisfaction at all times \nEnsure all customers and visitors receive a pleasant and courteous welcome, promoting the professional image of  the company \nAnswer all internal and external calls swiftly and direct them effectively and transfer the calls to the sales staff ∙ Help Retailer to achieve industry-leading standards of process efficiency and cost control\nEnsure compliance with company policies and industry guidelines \nCount the showroom traffic and the received phone calls and report to the sales manager on a daily basis.\nSupport the sales staff in the delivery process documentation. MeasuresVQM / dealer audit \nCustomer satisfaction (CEM) \nDepartmental administrative costs Key TasksObjective: Ensure the highest level of customer care and satisfaction at all times ∙ Maintain presence at reception desk, ensuring that all customers queries, whether in person or on the  telephone, are answered and dealt with immediately. ∙ Page members of staff as needed, monitoring where and to whom customers are referred. ∙ Establish message and sign in and out systems to monitor whereabouts of key personnel at all times. Objective: Ensure all customers and visitors receive a pleasant and courteous welcome, promoting the professional  image of the company. ∙ Develop and maintain excellent working relationships with customers by meeting and exceeding their  expectations. ∙ Direct all customers towards the seating area when waiting for attention and offer refreshments. ∙ Ensure the reception desk is kept tidy to promote the professional image of the Retailer. ∙ Handle dissatisfied customers calmly and bring customer complaints to the attention of the Brand Manager  immediately. Objective: Answer all internal and external calls swiftly and direct them effectively ∙ Answer all calls promptly and in a consistently professional and friendly manner. ∙ Ensure all calls are properly identified and announced and the caller's business is established. ∙ Notify the Brand ManageSkills",
    "Skills": [
        "Key Competencies",
        "Customer Focus ",
        "∙ Approach every situation with a desire to understand and deliver \n∙ Listen effectively and communicate clearly \n∙ Use every contact with the customer to build a relationship \n∙ Take responsibility to ensure nothing is left to chance \nOperational Focus \n∙ Deal with the arrival of customers and visitors \n∙ Operate Retailer systems on behalf of customers \n∙ Use technology effectively \n∙ Manage own performance \n∙ Contribute to effective working \nBusiness Focus "
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 0 Max: 0",
        "Degree": "Certification / diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}