{
    "Job ID": "4746853",
    "Description": "Job Purpose:Provide Environmental and Regulatory direction, guidance, and leadership to Onshore EPC PMT and CONTRACTOR(s) for fieldwork across all EPC Packages.\nPerform oversight of CONTRACTOR(s) and effectively manage a team of Environmental Specialists and/or leads to ensure compliance with all Project Environmental requirements.\nTake the lead in the site implementation and verification of the Onshore EPC Environmental Plans & Procedures, MME Consent to Construct (CTC) and Environmental Permitting requirements through clear planning, formal communication, and interface between all involved parties.\nSupport the Onshore EPC CONTRACTOR(s) in the preparation for site mobilization and to provide expert Environmental advice and guidance to all PMT and CONTRACTOR Project Area Division Managers, and disciplines during all phases of the Project, to achieve the clients Mission to protect its people, assets and environment.Manage the relevant elements of the Project SHES Management system, its procedures and programs and ensures the effective and efficient implementation of risk control and mitigation measures at site in accordance with the requirements stipulated in the Contract Exhibit 5, Appendix III, SHES Instructions Part 1 to 5, with a particular focus on Environmental requirements.Skills",
    "Skills": [
        "Required qualifications and experience:",
        " ",
        "Minimum of fifteen (10) years of years industry relevant Environmental experience.\nenvironmental science or engineering Degree\nISO 14001 Lead Auditor.\nUtilizes a systematic approach to problem solving that ensures accuracy, timeliness, and quality of documentation in resolution.\nAble to work moderately complex tasks to completion within time constrains of Project, with minimal guidance from more experienced staff.\nAble to make decisions and solve problems with minimal supervision. \nResponsible for own work product with minimal guidance and oversight from immediate supervisor.\nStrong communication and interpersonal skills.\nGood teamworking and facilitation skills.\nGood analytical, organisational, and problem-solving skills.\nExperienced in developing and leading effective project interface organizations.\nExcellent oral and written English skills. Able to write technical reports in English."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}