{
    "Job ID": "4746918",
    "Description": "The purpose of this position is to handle all HR Admin & Payroll administrative and customer services for all edara employees.AccountabilitiesAssist in monthly payroll cycles in order for timely data inputting and payroll processing thus ensuring all employees are paid as per the agreed payroll cycles.\nHandle payroll and personal data related grievances from employees ensuring such grievances are resolved with minimal effect on the employee and company interests.\nHandle all transactional HR Admin & Payroll requests received from line departments and employees ensuring necessary changes/ updates are made in the HRMS system as per the guidelines (SOPs) ensuring utmost accuracy.\nHandle employee database ensuring correct data are centrally available at all times. Execute processes to capture and rectify errors and mismatches to upkeep the database at the highest quality for all company-wide users.\nAssist in monitoring key HR Admin & Payroll processes and procedures to ensure all HR Admin and Payroll activities are conducted in a timely and smooth manner. Constantly watch the processes and identify where and when they fail and formulate more accurate processes and procedures.\nHandle all pension related transactional activities in respect of existing and ex-employees until the end results are achieved.Skills",
    "Skills": [
        "Experience",
        "Minimum 4-6 years of experience in a system oriented administrative role in HR/ Payroll industry\nSound knowledge of the country legislation, policies, rules and regulations. Excellent PC/ Ms Office skills. Training and exposure to ORACLE based systems.\nGood customer service skills. Ability to work with a team of support staff, strong communication skills in both written and spoken English. Good negotiating and persuasive abilities. Arabic language skills are desirable.\nMinimum bachelor's degree in HR/ general management/ finance",
        "Knowledge & Skill",
        "Handle complaints and resolve grievances and conflicts, or otherwise negotiating with others.\nCommunication\nJudgment / Problem Solving\nTeamwork / Collaboration\nQuality Orientation /Attention to Details\nCustomer Service Orientation"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications; Consumer Electronics; Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}