{
    "Job ID": "4746757",
    "Description": "-      Coordinates and implements all HR activities including recruitment, contracting, registration, record keeping, payroll, employee development and termination.-      In partnership with the respective Head of Department / Office Manager, identify and recruit all hiring and human resources activities of the company including labour and contractors on a timely manner.-      Draft, gather and submit needed documents for work visas (Iqamas), business visas and its maintenance.  -      Guarantee compliance of the Human Resources area with local norms, regulations and with company’s policies and internal guidelines.-      Support in the optimization of labour costs.-      Support the field activities of the company.-      In partnership with the respective Head of Department, support in drafting contracts with third parties guaranteeing compliance with local regulations and internal procedures. -      Support Office Manager in purchases execution.-      Implementation of Time Sheets and administrative policies of the company along with Office Manager.-      Implementation of HSLP procedures with employees and contractors.-      Payroll management.-      Review Expenses Sheets and reimbursements along with Office Manager.-      Engagement and release of employees and contractors.-      Establishment of Human Resources program focused on the personal and professional development of employees via training and related activities in compliance with local regulations.-      Ensure compliance with Nitaqat and optimization of Human Resources-      Keep an updated file for each employee.-      Control and follow up for medical leave, holiday leave, etc.-      Implement local communities development as per local labour laws. -      Assist Office Manager in all administration activities.-      Assist in what the company needs when needed.   Skills",
    "Skills": [
        "Communication & Interpersonal Effectiveness.\nSkilled in using HR software and Microsoft Office.\nStrong interpersonal skills.\nArabic and English\nFamiliar with all Saudi Employment Regulations"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Jeddah , Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Mining & Quarrying",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}