{
    "Job ID": "4746436",
    "Description": "1. Bank Treasury Operation:a) Ensure that all transactions executed by the Treasury department are successfully matched, validated, confirmed, and settled within the agreed time frames.b) Ensure that all life cycle events are captured, booked, and instructed accurately.c) Monitor all breaks derived from the reconciliation report, resolve them, and escalate where necessary.d) Conduct SWIFT messages of MT 5XX and MT 2XX series.e) Prepare daily cash flow forecasts for money market business and corporate clients' large cash needs to ensure adequate and efficient use of funds to meet ongoing operational and capital investment needs.f) Set up counter party SSI & SSA with the operational management team.2. Process the fund clearing and settlement business.3. Handle the accounting processing of various business applications submitted by customer and other departments.4. Participate in the Rotation of Weekend/Holiday Duty for AED clearing and settlement.5. Compile and submit data reports on treasury business to the relevant parties.6. Implement Anti-Money Laundering and Anti-Terrorist Financing Requirements.7. Complete Other Tasks Assigned by the Supervisor.Skills",
    "Skills": [
        "1. At least 3 years of experience in Bank Treasury Operation within the banking sector.",
        "2. Good understanding of the lifecycle of treasury products, such as FX, bonds, repo, reverse repo (cross-currency), and borrowing/lending.",
        "3. Solid understanding of bank clearing and settlement networks.",
        "4. Fluency in English.",
        "5. High level of personal independence.",
        "6. Strong cross-cultural awareness.",
        "7. Excellent communication and teamwork skills.",
        "8. Bank Treasury Operation experience is required. Experience with other banking products is preferred but not required. However, you must be a fast learner."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}