{
    "Job ID": "4746851",
    "Description": "Job Purpose Ensures the effective implementation of the Project Management Systems\nProviding continuous communication, coordination and advice to the Offshore Project Manager Topsides & Pipelines on quality issues concerning PMT discipline execution and the oversight of Contractors/Suppliers.\nResponsible for ensuring the implementation of quality surveillance tools and manages development and maintenance of quality plans that provide direction and guidance to Quality Assurance Coordinators, practitioners, and Quality Teams.\nProvides PMT evaluation and feedback on quality related issues and Contractor performance metrics to the Offshore Project and Business Manager.Skills",
    "Skills": [
        "QualificationsBSc in Engineering or equivalent\nSignificant knowledge of Quality Management philosophies, strategies and practices.\nSound written and verbal communication skills with the ability to communicate at all organizational levels.\nSound technical, supervisory and interpersonal skills.\nFormal Risk Assessment Training.\nFormal Quality Auditor Training.\nMore than 12 years’ experience in the delivery of Quality Management Systems for Projects.\nWorking knowledge of Quality and or services/consultancy practices in oil and gas industry.",
        "Knowledge / Experience",
        " ",
        "15 years of experience in the area of Quality Management of offshore Oil and Gas Production Processes for Topsides and Pipeline facilities.\nSuccessful completions of international Offshore Projects from FEED to EPCI contracts up to including handover activities."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}