{
    "Job ID": "4746865",
    "Description": "Job descriptionAn exciting and  professional role , which involves meeting with property owners and prospective and clients, scheduling property viewings, and prospecting properties for clients to secure financial transactions.Who are we looking for?- A highly motivated individual who is self-disciplined and has 'a passion' for real estate.- Excellent time Management and organizational skillscommunicate clearly and effectively with clients.- Well-versed in English (Verbal and Written)- Several years of verified sales experienceSkills",
    "Skills": [
        "We offer:",
        "- A generous commission pay structure with unlimited earning potential.",
        "- Excellent platform and 'on-going' 1 month training to embark your real estate career.",
        "- Access to lead generation system and maximum exposure on all property portals.",
        "- Employment visa, RERA training and commission incentives.",
        "- Area Specialist Focus to gain competitive advantage.",
        "B - Key Duties",
        "- Prepare a daily action plan and set regular targets.",
        "- Generate new property listings via networking, site-visits and regular meetings and cold-calls.",
        "- Schedule property viewings with potential clients and take notes on client requirements and",
        "follow up.",
        "- Follow proper documentation on all transactions and ensure full compliance of Laws and",
        "Regulations and Company Policies.",
        "- Understand client requirements, and present several options to buyers/tenants for their property",
        "search to short-list properties and finalise the deal.",
        "- Provide honest feedback to clients and promote ethics and integrity on all transactions.",
        "Job Type: Commission"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}