{
    "Job ID": "4746854",
    "Description": "Responsible for managing all fleet management activities and providing clients with the right vehicles at the right price and time in line with the company’s set standards, in order to maximize client satisfaction and company revenues.\nDevelop the Fleet Management Department’s strategic objectives and KPIs and ensure all employees are working towards achievement of these objectives.\nReview the operating results of the Fleet management Department and follow-up to ensure appropriate measures are taken to correct insufficient results.\nDevelop the Fleet management Department’s annual budget and ensure all employees are working within the assigned budget by setting the required targets and responsibilities.\nImplement the Fleet management Department’s policies and the set procedures in order to achieve the Fleet management Department’s objectives.\nCommunicate and discuss the Fleet management Department’s guidelines and procedures with employees to ensure responsibilities, authorities and accountabilities are defined and understood.\nManage, analyze and review the investigations/ market surveys conducted by subordinates in order to gather information regarding the selling/ leasing prices offered by dealers.\n Keep up to date with current market vehicles’ prices by surveying local selling/ leasing rates.\nOversee inbound/ outbound logistics operations, such as transportation, safety performance, or logistics quality management.\n Analyze and utilize all fleet information and user surveys to forecast new requirements.\n Ensure fleet availability to meet all clients’ requests by scheduling, forecasting and surveying current clients’ trends.\n Ensure vehicle registration, insurance and documentation regarding induction of new vehicles in existing fleet.\nOversee data management system to organize fleets as per various schedules and requests.\nMonitor the maintenance of an up to date and secured database including documents related to sales, registration, inspections and maintenance of fleet vehicles.\nDevelop and implement standard operational standards to maintain vehicles by advocating best practices in the industry.\nPlan, process and execute vehicle purchase and vehicle replacement through efficient settlement.\nOversee activities related to utilization, repair, preventative maintenance and replacement of the vehicle fleet.\nAuthorize requisitions for parts, supplies and equipment in; as well as, oversee automotive damage repairs and all activities related to the mechanical repairs and maintenance of fleet vehicles to obtain maximum utilization of fleet and prevent operational delays.\nGuide and assist subordinates whenever required to ensure smooth workflow of operations.\nMaintain a solid relationship with current clients and attract new clients in order to increase client’s database and profitability.\nReview and present reports on Fleet Management activities, including identification of potential problems and recommendations for corrective action, forecasts trends and make recommendations.\nPrepare and submit reports (daily, weekly, monthly, etc.) to Direct Management, as required, that cover all Fleet Management Department’s activities and other related fields.Skills",
    "Skills": [
        "Bachelor’s Degree in mechanical engineering, business administration or automotive technology related field.\nMinimum of 8 – 10 years of experience in the transportation industry, logistics field.\n Ability to work effectively under pressure and to meet deadlines, while handling multiple tasks.\nExcellent strategic planning abilities\nAbility to develop specific goals and plans to prioritize, organize, and accomplish the work.\nThorough knowledge of the occupation hazards and corresponding safety precautions necessary for the safe performance of assigned duties.\n Excellent leadership and customer experience skills.\nProficiency in English and Arabic is an added value.\nGood level of verbal and written communication skills."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}