{
    "Job ID": "4746822",
    "Description": "Job SummaryCustomer Service Advisor is a primary point of contact for clients at Branches & Premium Banking Hubs. The duties responsibilities include; (i) addressing customers’ transaction needs at point of contact, (ii) act as digital concierge and help educate clients on the usage of mobile functionality, (iii) providing prompt & holistic solutions to client complaints independently, (iv) Identifying client’s product needs, offer basic products (deposits, cards, PL & insurance) and refer for high value transactions (Investments, Mortgages) To Specialists. Key responsibility of the role is to deliver delightful client experiences at all interaction stages and customer touch points.  Key Accountabilities-   Manage & Digitize incoming banking transaction traffic at Branches & Premium Banking Hubs-   Build sustainable relationships and trust with customer through open and engaged communication model-   Well presented in terms of manners, dress, turnout and client attitude. -   Identify and assess client needs holistically at point of contact & deliver delightful experiences-   Collect customer feedback on product ranges and new releases, as well as preparing reports, and work as client advocates with product teams to collaboratively deliver desired product / service solutions.-   Generate sales leads at point of contact based on assessment of client needs. -   Provide accurate, valid and complete information by using the right tools & process-   Meet personal/customer service team sales targets and call handling quotas-   Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution-   Follow communication procedures, guidelines and policies-   Tracking customer experiences across online and offline channels.-   Collaborating with other Retail teams to enhance customer services and brand awareness.-   Aligning customer experience strategies with marketing initiatives. as well as informing customers about new product features and functionalities.-   Performing product tests, evaluating after-sales and support services, and facilitating improvements.-   Documenting processes and logging technical issues, as well as customer compliments and complaints-   Identifying customer needs and taking proactive steps to maintain positive experiences.-   Developing feedback surveys-   Scheduling in-person and video meetings with customers & prospects as and when needed.-   Thinking of ways to show appreciation for loyal clients and improving overall brand experienceSkills",
    "Skills": [
        "Key Interactions",
        "Competencies",
        "Communication",
        "Customer Service",
        "Integrity/Ethics",
        "Interpersonal Skills",
        "Quality",
        "Risk Management",
        "Strategic Thinking/Management",
        "Teamwork",
        "Skills",
        "Ability to work under pressure",
        "Accuracy and attention to detail",
        "Communications",
        "Extensive knowledge of the banking sector in Qatar and the region",
        "Knowledge of Retail Banking Industry and branch banking",
        "Numerical skills",
        "Risk Management",
        "Time Management skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}