{
    "Job ID": "4746890",
    "Description": "Perform the assigned duties as per the set policies and procedures in order to achieve the department goals.\nGreet visitors and clients warmly and make sure they are comfortable.\nMaintain a pleasant and tidy reception area, by arranging newspapers and magazines in order to present an excellent image of the company.\nMaintain the standard quality service of internal and external customers.\nInterface with external visitors, vendors, and others as required by internal customers to support timely resolution of the related concerns at the assigned office.\nEnsures all the administrative activities of the office are handled effectively and efficiently.\nMonitor daily attendance and submit periodical attendance reports.\nFollow up on employees' absence and ensure justifications are provided.\nResponsible for travel desk activities including visa processing, ticketing, hotel reservation.\nPrepare notices and advertisements for vacant staff positions.\nCoordinate staff recruitment and selection process in order to ensure a timely organized and comprehensive procedure is used to hire staff.\nAssist the direct manager in preparing documents, and follow-up on timelines and deliverables.\nMaintain human recourses records by recording new hires, termination, changes in job classification and sick leaves.\nProvide support and secretarial services such as typing, filing, scanning, manage and maintain office files and documents.\nOrganize and file all the administrative documents in order to reach them easily.\nSchedule and organize appointments and meetings.\nReceive, reply and send any business emails and calls when required.\nAssist in preparation of documents, and follow-up on timelines and deliverables.\nPrepare and modify documents including correspondence, reports, drafts, memos and emails.\nProvide support and secretarial services such as typing, photocopying, filing, scanning and manage and maintain office files and documents.\nSave and keep all records of benefit plans.\nPrepare and submit salary reports, legal requirements and government reports to the direct manager.\nPerform any other tasks related to the job assigned by the direct manager.Skills",
    "Skills": [
        "Organizational skills\nVery good attention to details\nAbility to work well under pressure\nFollow up and monitoring skills\nAbility to manage multiple tasks\nKnowledge in Microsoft Office"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "South Jeddah, Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}