{
    "Job ID": "4746421",
    "Description": "JOB PURPOSE:The Trade and Investment Manager is responsible for managing and promoting trade and investment opportunities in the agricultural and food industries among IOFS/OIC member states. They will play an essential role in analyzing market trends, identifying investment opportunities, and facilitating partnerships and trade agreements. KEY RESPONSIBILITIES:• Develop, implement and analyze strategies for promoting trade and investment in the food and agricultural sectors.• Conduct detailed project and market analysis to identify viable investment opportunities.• Liaise with stakeholders including governments, private sector entities, and international organizations to promote and facilitate trade and investments.• Provide expert guidance on investment structures and their relevant legal and financial aspects.• Monitor and evaluate the progress of trade and investment projects, ensuring compliance with relevant regulations and policies.• Develop, maintain, and leverage networks with key stakeholders and partners within the IOFS community.• Organize and participate in international trade fairs, exhibitions, conferences, and seminars.• Provide training and capacity building in trade and investment best practices.• Prepare and present detailed reports and recommendations to the Director General of the IOFS.Skills",
    "Skills": [
        "QUALIFICATIONS AND REQUIREMENTS:",
        "• To be a national of one of the Member States of Islamic Organization for Food Security (IOFS).",
        "• Bachelor’s degree in International Business, Economics, Finance, Agricultural Economics, or a related field. ",
        "• A Master’s degree will be considered an asset.",
        "• A minimum of 5-7 years of experience in trade, investments, or a related field, with at least 3 years in an international organization.",
        "• Proficiency in at least two working languages of the IOFS (Arabic, English, French).",
        "• Strong understanding of investment structures and experience in project management and market analysis.",
        "• Excellent negotiation, communication, and networking skills.",
        "• Ability to work effectively in a multi-cultural environment and collaborate with various stakeholders.",
        "• Strong analytical, problem-solving, and decision-making skills.",
        "• Knowledge of project management rules.",
        "• Achievements in the field (attracted project funding, success in investment/trade negotiations, projects implemented).",
        "• Good understanding of food supply chain theory and practice.",
        "• Capacity to resolve multiple tasks properly and effectively."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Sultan, Nur, Kazakhstan",
        "Company Industry": "International Humanitarian Organization; Investment, Securities & Funds; Economics & Financial Consulting",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}