{
    "Job ID": "4746821",
    "Description": "Job ResponsibilitiesEnsure work output in operations is of the highest quality.\nPrepare client's and markets presentations in Excel, Word and PowerPoint formats.\nFinalize market submissions and design risk solutions with client service teams.\nReview and finalise contracts, quotations, negotiate renewals and placements with reinsurers.\nMaintain strong relationships with clients, colleagues, and insurance/reinsurance companies to efficiently communicate client demands and requests internally.\nWork with the existing clients’ service team on day-to-day handling of accounts dealing with enquiries and endorsements of new and existing placements.\nPrepare and maintain technical documentation and ensure risks and documentation conform to regulatory requirements.\nKeep abreast of changing market conditions and inform client service team, carriers, partners and/or clients of major development affecting various types of coverage.\nAdhere to all best practices and the highest standards of professionalism and ethical behavior in all activities.Internally Relates - Cross functional teams in client management, finance, compliance, and any other designated internal resources.Externally Relates - Reinsurers and clientsSkills",
    "Skills": [
        "Required Qualifications & Experience",
        "12 years' experience working in reinsurance within the UAE and/or the Middle east.\nWorking knowledge of facultative and Treaty reinsurance in ME markets. It is an additional advantage if experience is in other international or regional markets.\nExperience in multi-lines of business",
        "Key Skills & Attributes",
        "Adaptability\nEntrepreneurial mindset\nSavvy with relevant technology tools and applications\nFlexible and Resilient\nSelf-motivated\nPassionate and Energetic"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Insurance & TPA",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}