{
    "Job ID": "4746934",
    "Description": "Regional Country Manager - Cleaning Services CompanyManage the company operations and sales in the fields of all types of Cleaning Products and Services such as (Industrial Vacuum Cleaners, Floor Machines, Power Sweepers, Steam Generators, Pressure Washers, Chemicals, Detergents, Polishes, Hygiene & Industrial Paper Products, Dispensers & Holders, Trolleys, Containers & Litter Bins, Cleaning Tools and Accessories, Catering Consumable & Disposables and more... \nManage admin- legal- logistics – operation within the company points of sales and locations; and managing the overall operations in the company such as (freight, logistics, deliveries, sales, procurement activities and supporting other related business units). \nManage the company, including providing support, absence management, discipline and grievance, and recruitment activities\nEffectively set out goals and objectives for your team, including those for supervisory roles\nAct as a role model and always act in line with our company values\nDrive employee engagement by personal interaction and engagement with your team in order to develop and coach them in their duties and responsibilities\nManage contractual budgets in line with financial targets\nEnsure all aspects of the required services are being delivered to the customers’ satisfaction and in accordance with contracts\nEnsure there are sufficient trained and vetted staff working at all times to meet customer and contract requirements\nDevelop professional customer relationships, responding appropriately to customer requests and concerns\nComplete effective health & safety assessments, ensuring accurate and timely reporting of any incidents, involvement in subsequent investigations and providing input into health & safety committees or forums.\nComplete risk assessments and site evaluations as well as complete Quarterly performance reports and billing schedulesSkills",
    "Skills": [
        "Bachelor’s Degree in Business Administration or a related field of study\nAt least 10 years of experience working in a similar general, operational or country management role , must be within the cleaning industry\nExperience of over 10 years in a similar role in the cleaning industry is a must\nExcellent verbal and written communication skills,\nExcellent customer service and organizational skills\nAbility to successfully manage a large team\nAble to adapt and remain flexible\nStrong planning and organizational skills\nEnthusiastic and committed approach with a track record of building strong, trust based relationships with colleagues and stakeholders at all levels\nTrack record of working in a fast paced and demanding environment\nHighest levels of integrity, respectfulness and professionalism required at all times.\nOpen, trusting and in the spirit of mutual support, especially when dealing with conflicts of interests.\nAn engaging and proactive ‘can do’ attitude where successes and failures are shared.\nAbility to plan ahead as far as possible and share information to prevent surprises.\nWell knowledgeable about KSA locations, related legislation)"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Safety & Environment; Other Healthcare Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}