{
    "Job ID": "4746380",
    "Description": "Position Title:        Duty EngineerEmployment Type: Full-timeSalary:        up to 8K AED, all-inclusive depending on experience and qualificationsJob Location:        Dubai, UAEAbout the Client: One of the most luxurious hotels in UAE with operations globally.Job Description:  Coordinating with contractors and suppliers for several projects in the hotel and other sites.   Regularly inspect, maintain, and repair mechanical, electrical, and plumbing systems throughout the hotel. This includes HVAC (Heating, Ventilation, and Air Conditioning), elevators, lighting, water supply, drainage systems, fire safety tools, and crucial facilities. Troubleshoot and resolve issues concerning equipment malfunctions, leaks, faulty wiring, or other technical glitches. Follow safety protocols and compliance standards, including fire regulations, health guidelines, and building codes. Respond to emergencies like power outages, equipment failures, or critical situations.Skills",
    "Skills": [
        "Qualifications: ",
        " Open to Asian nationals",
        " Male, 45 y/o and below",
        " Engineering degree or other relevant academic qualifications",
        " Minimum 5 years relevant experience in handling several projects, preferably from hospitality industry",
        " Must have experience handling team members, small team is acceptable",
        " Must be open to travel for business trips inside and outside UAE to oversee projects"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "South Asia; Southeast Asia",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}