{
    "Job ID": "4746859",
    "Description": "Key Job Accountabilities•   Review and comment on Consultant's/Contractor's concept/design / working drawings, specifications and submittals to ensure compliance with OP standards and project briefs, conforming with the following:•   Review design brief with Senior Project Engineers and where necessary seek further clarification before proceeding with task.•   Ensure designs accommodate the space requirements.•   Working with other Discipline Engineers assigned to the project, ensure compatibility between interior systems / FF&E systems and architectural systems, structural systems and building services elements.•   Ensure interior designs, finishes and FF&E selections are feasible, practical, and appropriate to the project, meet the end-user needs and are cost effective.•   Recommend changes as necessary.•   Identify problem areas and suggest solutions.•   Demonstrate initiative in design solutions and work with due care and thought.•   Act responsibly in carrying out instructions from Lead Project Engineers, Head Designer and Senior Project Engineers•   Maintain confidentiality at all times with respect to OP activities and policies.•   Coordinate FF&E / Signage tender packages including the development of performancebased specifications that comply with all relevant sourcing policies and the completion of the technical evaluation of bids. Work with Materials Department to ensure timely execution of FF&E / Signage tender packages and FF&E / Signage supply and installation.•   Achieve familiarization with the EDS - Special Projects Archive and Architectural, Interior, Civil, Structural and Building Services record drawings and retrieve there from when directed by the Head Designer/ Lead Discipline and Lead Project Engineers/ Senior Project Engineers.•   When required coordinate with Senior Designers (Architectural/Civil) to arrange for update to drawings to meet the requirements of the Design brief.•   Assist in the updating of a register of materials standards, specifications and standard details.•   Estimate and report to Head Designer and/or Senior Project Engineers on the man-hour requirement to meet each task in good time to enable all work to be programmed.•   Carry out checks on existing Architectural, Interior Design and FF&E drawings to ensure they are correct and no discrepancies exist and notify Head Designer and/or Senior Project Engineers accordingly, seeking and acting on guidance on appropriate action there from.•   Organize directly with Head Designer for supply and maintenance of all hardware and material supplies necessary to meet the requirement of this job description.Skills",
    "Skills": [
        "--Minimum Requirements--",
        "Qualifications",
        "•   BSc/SA or equivalent in Interior Design, Civil or Architectural Engineering.",
        "Knowledge and Key Skills",
        "•   Minimum 8 years broad experience in building projects, and ability to identify and formulate practical solutions to the spectrum of architectural and interior design issues.",
        "•   Experience in both design and construction works, prepare scope of works and specification writing, with knowledge in reviewing and recommending a large range of building materials, is essential.",
        "•   Carries out his duties in accordance with accepted Engineering practices keeping his supervisor(s) informed on routine matters."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}