{
    "Job ID": "4746423",
    "Description": "Local Hiring We are seeking a talented and motivated bilingual (Arabic and English) Advertising Account Manager/communication manager to join our team and contribute to our continued growth and success.Job Overview:As an account Manager, you will play a pivotal role in driving client satisfaction, project success, and overall agency growth. You will serve as the primary point of contact for assigned clients, collaborating closely with cross-functional teams to develop, execute, and optimize client objectives. Your ability to foster strong client relationships, manage campaigns, and ensure seamless communication will be crucial to achieving exceptional results.Responsibilities:Client Relationship Management: Build and nurture strong, long-lasting relationships with clients, understanding their goals, challenges, and industry trends to provide strategic guidance and tailored solutions.\nCampaign Development: Collaborate with internal teams (creative, media, strategy, etc.) to conceptualize and develop internal and external campaigns that align with client objectives and target audiences.\nProject Coordination: Lead end-to-end project management, ensuring the timely and successful execution of campaigns, from initial ideation to final delivery.\nMarket Research: Stay current with industry trends, competitive landscape, and emerging technologies to offer innovative ideas and maintain a competitive edge.\nPresentation and Communication: Prepare and deliver persuasive client presentations in Arabic, conveying campaign strategies, performance results, and proposed optimizations.Qualifications:Bachelor's degree in Marketing, Advertising, Business, or a related field.The applicant must be bilingual (Arabic and English) and must be a resident of Qatar with a valid Qatari IDProven experience (4+ years) as an Advertising Account Manager or similar role in communication advocacyStrong understanding of advertising principles, campaign development, and marketing strategies.Exceptional client relationship management skills with a focus on client satisfaction and retention.Excellent project management abilities with the capacity to manage multiple projects concurrently.Ability to thrive in a fast-paced, collaborative, and deadline-driven environment.Effective communication, presentation, and negotiation skills.Creative thinking and problem-solving skills to address challenges and capitalize on opportunities.Please apply.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Marketing, Advertising, Business, or a related field.",
        "The applicant must be bilingual (Arabic and English) and must be a resident of Qatar with a valid Qatari ID",
        "Proven experience (4+ years) as an Advertising Account Manager or similar role in communication advocacy",
        "Strong understanding of advertising principles, campaign development, and marketing strategies.",
        "Exceptional client relationship management skills with a focus on client satisfaction and retention.",
        "Excellent project management abilities with the capacity to manage multiple projects concurrently.",
        "Ability to thrive in a fast-paced, collaborative, and deadline-driven environment.",
        "Effective communication, presentation, and negotiation skills.",
        "Creative thinking and problem-solving skills to address challenges and capitalize on opportunities"
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Advertising; Marketing; Public Relations (PR)",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}