{
    "Job ID": "4746861",
    "Description": "Produced Water Disposal [PWD] Project – Subsea CSRJob Purpose:Identify, develop, coordinate, expedite and steward closure of EPC Contract Interfaces with other External parties.\nMajor Projects involve the development of new offshore platforms bridge linked to the existing facilities, installation of subsea pipelines and debottlenecking of the produced water treatment, all these activities could be executed across several international sites. Projects will require complex interfaces with other entities of CLIENT .\nEPCI Engineering may take place at Contractor premises,\nPossibility of multiple worldwide missions or relocations to follow-up engineering development and EPCI execution with various contractors.\nInput to other related projects, e.g., New Fibre link 100km FO cable installation oversightJob Challenges & Accountabilities:To adopt and demonstrate an exemplary behaviour with regard to HSSE and to implement HSSE rules and requirements within his area of responsibility.\nTo adopt, implement and inculcate ‘Incident Free’ approach during project execution.\nTo liaise with other interface and discipline engineers, involved in the management of the PWD project and with contractor personnel handling technical design and interfaces. The job holder shall also make sure that non contractual obligations are properly addressed by EPCI contractor.\nTo organize and/or attend technical interface meetings, as necessary.\nTo ensure consistence and correct design compliance both under area of responsibility and with other areas during the various phase of project such as CFT Documentation, Early Engineering, detailed design, procurement, fabrication, logistics, installation, construction and animate dedicated transverse technical, schedule and cost coordination between packages as required to ensure all requirements for EPCI activities are complied with.\nTo ensure timely review of documentation by CLIENT interfaces to identify clashes/conflicts.\nTo develop an interface, register for scope to combine with the Project master interface register.\nTo prepare EPCI Turnkey contractor SOW & related Exhibits.\nTo manage technical communication interface with other Operators during project execution.\nEnsure, control and coordinate the proper realization of the design, method statements etc of the subsea facilities of PWD project and its specific brownfield and SIMOPS scope.\nAssist in developing agreements with Other CLIENT and government entities.\nTo follow up 3rd party interfaces (i.e., Logistic) during project execution.\nTo develop an interface, register for scope to combine with the Project master interface register.\nTo attend all interface-related meetings, including in particular interface workshops, HIRA/HAZID / HAZOP, Constructability, RISK workshops, meetings with Contractor(s), etc. in order to ensure the permanent control of the battery limits.\nTo organize, control and follow up process to have all deliverables timely issued by contractors for all interfaces, and to control the quality of these deliverables during project execution.\nTo assist EPCI Contractor(s), as required, in the closing out of interfaces. To expedite the exchange of Interface Task Sheet involving Contractor(s) as necessary.\nTo ensure that EPCI Contractors provide proper reporting of the progress of their interfaces activities and ensure subsequently report on progress of interface management process implementation to PWD Project Manager and refer to him in the event of any deviation or conflict with proposed remedial actions.\nTo avoid change orders and delays caused by interface issues by ensuring timely follow-up of interfaces. To anticipate problems and work together with Contractor(s), CLIENT MP Engineering Manager and as a general manner with all discipline Engineers in MP, Operations / Drilling and Marine depts. to propose technical solutions.\nEvaluate Vessel compatibility, flowline laying & subsea installation method statements, JSA and provide technical inputs.\nTo liaise with other departments like Drilling & Wells, Field Operations, HSEQ etc for the management of interface up to their close-out.\nTo liaise with project team and discipline engineers on all interface matters and/or help expedite the development of the design process, construction method statements and Job Safety Analysis.\nTo liaise with the Document Control team to assist consolidation of the technical review records for all project packages.\nWhen necessary, participate in monitoring interfaces between different subcontractors of a main EPCI contractor.\nHave core understanding of all aspects related to Construction of subsea flowline/pipelines (rigid/flexible), PLEM, PLET, transition spools, Jumpers, subsea structures etc, and associated Installation Engineering, onshore fabrication, temporary works etc tasks to be performed by CTRs.\nTo resolve and chase Technical Queries and Derogations Requests in liaison with discipline engineers and CLIENT Technical Reference Persons.\nTo timely report to the PWD Project Manager, highlighting progress and areas of concerns encountered in the performance of his duties.\nTo ensure confidentiality of all the documentation produced (whatever its support)\nTo ensure technical coordination between packages and in close coordination with PWD Project Manager and Engineering and Operational Leads\nTo Ensure/Close follow-up of DER/TQ/SCN and the like during project execution in close coordination with MP Head QA/QC\nEnsure readiness for all internal/external audits required (PR, Third parties, Partners)\nBe onboard vessel/offshore platforms as needed to perform tasks assigned in timely manner.\nAssist PWD Project Manager upon request on project management matters during project execution such as, EPCI CFT processes, EPCI contract management and execution and Project Close out.Skills",
    "Skills": [
        "Required qualification and experience:",
        " ",
        "Bachelor or master’s in engineering in any discipline\nOverall Professional Experience (years): 20\nRelevant Professional Experience in construction of subsea flowline/pipeline/cables (years): 10\nMust have been COMPANY REP onboard vessel for at least 2 pipeline/flowline laying project.\nLarge spectrum of skill and competencies in various engineering disciplines and/or in Interface Management\nSpecialist Subsea construction of subsea flowline/pipeline, PLET, PLEM, Jumper supports, transition spools, DOP structure, dive team management, marine spread management.\nA good knowledge of Contractual matters would be necessary, and a good knowledge of subsea pipeline & facility design would be a plus.\nLanguages: English mandatory\nKnowledge of relevant codes and standards\nH2S OPITO and T-BOSIET trainings."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}