{
    "Job ID": "4746929",
    "Description": "About Hamad International Airport:Hamad International Airport enjoys a dominant position in the aviation industry. It has been voted the best airport in the world by Skytrax in 2021 and 2022 and ranked the second-best airport in the world by Skytrax in 2023. The airport's passenger volumes are on a steady and fast-growing path thanks to an unprecedented facility expansion that enhanced operational capacity and will drive business growth in the next years.About the role:Responsible for developing the HIA asset management framework for the passenger terminal and managing the delivery of comprehensive 5-star facility management service including day-to-day maintenance services to the passenger terminal complex (PTC), by outsourced FM contracts, ensuring all assets are maintained in a safe and effective manner to meet business defined KPls.Key responsibilitiesDevelop and promote collaborative relationships with internal and external stakeholders, through regular and effective communication forums, to ensure departmental objectives, KPls and targets are aligned with their requirements and any challenges/opportunities are quickly addressed.\nChampion a continuous improvement culture within the PTC direct employed and contract employed teams, by leading the identification and delivery of sustainable continuous improvement projects which support the delivery of a world class airport facility.\nPeriodically review the scope applicability and commercial value of the various FM contracts responsible for the delivery of maintenance services across the PTC, to ensure the output meets with stakeholder requirements and delivers best value to the business.\nDevelop the HIA Asset Management System (AMS) across the PTC asset portfolio, by deploying the Strategic Asset Management Plan (SAMP) to achieve and maintain the ISO 55001 accreditation for the facilities in scope.\nManage the successful completion of all planned maintenance activities on all assets across the PTC under the scope of HIA FM, by regularly monitoring the delivery performance of outsourced maintenance contracts through effective   data analysis from   Oracle   Enterprise Asset   Management (eAM) Computerized Maintenance Management System (CMMS).\nEnsure all corrective maintenance activities are responded to and completed by the outsourced maintenance contractor, within agreed contractual Service Level Agreements (SLAs), by monitoring output performance from Oracle eAM and chairing regular performance review forums with the FM contractor.\nCo-ordinate directly with internal and external stakeholders to deliver a maintenance access strategy, which facilitates the FM contractor to perform preventive maintenance activities with minimal impact on operations.\nResponsible for driving an effective and inclusive safety culture across both direct employed and contract employed teams, through regular safety audits, monitoring safety performance KPls and delivering improvement actions.\nManage a team of direct employed engineers and technical officers, who are responsible for providing; onsite coordination of the outsourced FM contractors, quality assurance of completed maintenance activities and response to operational issues raised by internal and external stakeholders.\nAccountable for compliance to the HIA Asset Management System by both direct employed teams and the FM contractors operating within the PTC, through regular communications and engagement, internal audits, management reviews and by monitoring performance against KPls defined in the Strategic Asset Management Plan.\nAccountable for developing and implementing the required Standard Operating Procedures (SOPs), by liaising with the appropriate departments and ensuring the required output is achieved, to standardise all business as usual, emergency and continuity processes.\nOrganize, manage and conduct regular on-site maintenance quality audits to ensure regulatory compliance, clean, safe and efficient FM operations.\nResponsible for preparing the annual maintenance budget for the PTC and managing expenditure against this, by conducting regular budget reviews identifying variance against forecast and implementing containment actions.\nResponsible for preparing the annual maintenance budget for the PTC and managing expenditure against this, by conducting regular budget reviews identifying variance against forecast and implementing containment actions.\nResponsible for preparing the annual maintenance budget for the PTC and managing expenditure against this, by conducting regular budget reviews identifying variance against forecast and implementing containment actions.Skills",
    "Skills": [
        "About you:",
        "·         Bachelors level of Electrical / Mechanical / Electronics Engineering or equivalent.",
        "·         Minimum 8 years of relevant experience.",
        "·         Facilities and Maintenance Management",
        "·         Operations and maintenance of airport facilities",
        "·         Use of Computerized Maintenance Management Systems (CMMS)",
        "·         Practical experience in safety management and regulations governing buildings, facilities and infrastructure.",
        "·         Contract management."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Ground Fleet, Aviation, & Marine Refuelling",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}