{
    "Job ID": "4746462",
    "Description": "Project Quality Inspectors (Civil/ Mechanical/ Electrical)Looking For a Rewarding Career in NEOM KSA, Saudi ArabiaHere's Your Golden OpportunityWe are Hiring Project Quality Inspectors (Civil/ Mechanical/ Electrical) for NEOM, Saudi Arabia. The position is based out in KSAEmployer Name: Intertek Group About the Role:The Project Quality Inspector shall inspect, monitor NEOM projects in relation to the Quality Assurance and Quality Control; escalates non-compliance and violation of scope, codes and standards; reviews Project Quality Documents and perform other tasks in relation of Projects Quality in area of his specialty.Skills",
    "Skills": [
        "Required Knowledge",
        "Knowledge of standards and project design and construction requirements in area of his specialty \nKnowledge of QA / QC standards \nKnowledge of design and construction regulation and requirements in KSA Required Qualifications \nBachelor’s degree in Architecture, Engineering or related field to his specialty. Diploma holders need to have a minimum of 10 years of relevant experience.",
        "Prequalification Document Sequence required",
        "Applicant's Latest CV with Personal Photo – in word file\nIdentification Iqama (Aadhaar in case Indian candidate), Passport, Driving License – 1 attachment\nLatest Certification – (Degree/ Diploma, Experience Certificates, approvals, etc) – 1attachment. Diploma holders need to have minimum 10 years of relevant experience.",
        "Required Experience",
        "10+ years proven experience in quality assurance and quality control or construction related areas\n8+ years in construction or a project QA / QC related position · Certifications of wielding inspection (if relevant)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Construction & Building; Civil Engineering; Electrical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}