{
    "Job ID": "4746893",
    "Description": "A local Boutique Hotel located in West Amman is seeking a highly motivated and experienced Sales Manager.The ultimate goal is to drive both revenues and occupancy rates, while providing exceptional customer service.The position requires excellent communication and interpersonal skills, strong sales mindset and a thorough understanding of the market trends.Key Responsibilities:Sales Strategy: Develop and implement sales strategies to meet or exceed revenue targets for the Boutique Hotel.\nClient Relationship Management: Build and maintain strong relationships with corporate clients, travel agencies, event planners, and other potential sources of business.\nBooking Management: Oversee the booking process, negotiate rates, and close sales deals with individual guests and group bookings.\nMarket Analysis: Conduct market research to identify trends, competitive pricing, and opportunities for the hotel.\nMarketing Initiatives: Collaborate with the marketing team to create promotional campaigns, advertisements, and online presence to attract potential guests.\nNetworking: Attend industry events, trade shows, and networking opportunities to promote the hotel and establish valuable connections.\nCustomer Service: Ensure that guests' needs and requests are met to provide an exceptional experience during their stay.\nReporting: Generate reports on sales performance, market trends, and customer feedback for hotel management.\nBudgeting: Develop and manage the sales and marketing budget effectively.\nTeam Leadership: Supervise and train the sales and marketing team to achieve their targets.المسؤوليات١- رفع نسب الاشغال٢- خدمة العملاء٣- تطوير قنوات تسويق جديدة٤- التواصل مع البعثات و الشركات الأجنبيةSkills",
    "Skills": [
        "فرصة لتحقيق دخل مميز ( راتب + عمولة )",
        "مبنى شقق فندقية مميز في عبدون يتطلع لتوظيف مدير مبيعات يتقن اللغة الانجليزية و مهارات البيع بخبرة لا تقل عن ٤ سنوات، يتمتع بشخصية منطلقة و يجيد استخدام مهارات التواصل الاجتماعي. ",
        "Skills and Qualifications:",
        "Experience: Several years of experience in sales, preferably in the hospitality industry.\nCustomer Relationship Management: Strong relationship-building skills and the ability to cultivate and maintain client relationships.\nCommunication: Excellent communication skills, both written and verbal, for effective negotiation and presentation.\nSales Strategy: Proficiency in developing and executing effective sales strategies.\nMarket Awareness: An understanding of market trends, competition, and customer preferences in the local hospitality industry.\nNetworking: Ability to network and establish connections within the local and regional business and hospitality communities.\nMarketing Knowledge: Familiarity with marketing principles and the ability to collaborate with marketing teams to create effective campaigns.\nCustomer Focus: A commitment to providing exceptional customer service to meet and exceed guest expectations.\nBudget Management: Strong budgeting and financial management skills to maximize revenue while controlling expenses.\nLeadership: Leadership and team management skills to guide and motivate the sales and marketing team.\nAdaptability: The ability to adapt to changing market conditions and guest preferences.\nTech Proficiency: Familiarity with hotel management software and customer relationship management (CRM) systems.",
        "The Sales Manager for a Boutique Hotel plays a critical role in driving revenue and promoting the hotel's unique offerings. Their ability to build relationships, develop effective sales strategies, and provide exceptional customer service contributes significantly to the hotel's success."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}