{
    "Job ID": "4746687",
    "Description": "Functional Description This position carries out all body repair required on the customer's cars.Major Duties and Responsibilities Carry out all required body repairs as indicated on the repair job card by the  workshop controller or service advisor on the customer's cars within allocated time.\nCheck the car for any prior unidentified additional defects. \nRemove damaged sections of vehicles using metal-cutting guns, air grinders, and wrenches, and install replacement parts using wrenches or welding equipment. \nCut and tape plastic separating film to outside repair areas in order to avoid damaging surrounding surfaces during repair procedure, and remove the tape and wash surfaces after repairs are complete.  \nMix polyester resins and hardeners to be used in restoring damaged areas. \nChain or clamp frames and sections to alignment machines that use hydraulic pressure to align damaged components.  \nFill small dents that cannot be worked out with plastic or solder  \nFollow the work instructions as indicated by the workshop controller or factory literature.  Note: This job description shall include, but is not necessarily limited to the above duties. Maytemporarily perform other duties assigned to maintain operations and services.   الوصف وظيفيالقيام بتنفيذ جميع عمليات إصلاح الهيكل المطلوبة لسيارات العميل.الواجبات والمسؤوليات الرئيسيةالقيام بتنفيذ جميع إصلاحات الهيكل المطلوبة كما هو موضح في بطاقة مهمة الإصلاح بواسطة مراقب ورشة العمل أو مستشار الخدمة على سيارات العميل في غضون الوقت المخصص.\nفحص السيارة بحثًا عن أي عيوب إضافية سابقة مجهولة الهوية.\nالقيام بإزالة الأجزاء التالفة من المركبات باستخدام مسدسات القطع المعدنية ، وطواحين الهواء ، ومفاتيح الربط ، وتركيب قطع الغيار باستخدام مفاتيح الربط أو معدات اللحام.\nالقيام بقص فيلم الفصل البلاستيكي ولصقه على مناطق الإصلاح الخارجية لتجنب إتلاف الأسطح المحيطة أثناء إجراء الإصلاح ، وإزالة الشريط وغسل الأسطح بعد اكتمال الإصلاحات.\nخلط راتنجات البوليستر والمواد الصلبة لاستخدامها في ترميم المناطق المتضررة.\nإطارات وأقسام سلسلة أو مشابك لمحاذاة الآلات التي تستخدم الضغط الهيدروليكي لمحاذاة المكونات التالفة\nملء الخدوش الصغيرة التي لا يمكن معالجتها بالبلاستيك أو اللحام\nاتباع تعليمات العمل كما هو موضح بواسطة مراقب ورشة العمل أو مطبوعات المصنع.Skills",
    "Skills": [
        "Diploma in Mechanical Engineering or any related technical field. \nMinimum 1-3 years of related experience.  \nExcellent communication and interpersonal skills.  \nGood commands of Arabic and English.\nSalary Package: SR4,050 to SR5,500",
        " ",
        "دبلوم في الهندسة الميكانيكية أو أي مجال تقني ذي صلة.\n1-3 سنوات خبرة ذات صلة كحد أدنى.\nاتصالات ممتازة ومهارات التعامل مع الآخرين.\nإجادة اللغتين العربية والإنجليزية.\nحزمة الراتب: 4050 ريال سعودي إلى 5500 ريال سعودي"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Other",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}