{
    "Job ID": "4746541",
    "Description": "الاطلاع الدائم مع التغييرات في جميع منصات التواصل الاجتماعي لضمان تحقيق اقصى استفادة.\nإعداد تقارير تحليلية لحركة زيارات الموقع ومراقبة تقدم تحسين محركات البحث SEO.\nمراقبة التغييرات والتطورات في جميع منصات التواصل الاجتماعي لتحقيق الأهداف المرجوة.\nإنتاج محتوى مرئي مميز يتضمن المعلومات اللازمة عن المنتجات الجديدة.Build and execute social media strategy through competitive research, platform determination, benchmarking, messaging and audience identificationGenerate, edit, publish and share daily content (original text, images, video or HTML) that builds meaningful connections and encourages community members to take actionSet up and optimize company pages within each platform to increase the visibility of company’s social contentModerate all user-generated content in line with the moderation policy for each communityCreate editorial calendars and syndication schedulesContinuously improve by capturing and analyzing the appropriate social data/metrics, insights and best practices, and then acting on the informationCollaborate with other departments (customer relations, sales etc) to manage reputation, identify key players and coordinate actionsSkills",
    "Skills": [
        "معرفة جيدة بتهيئة محركات البحث وتحديد الكلمات الرئيسية.\nالخبرة في العمل كمنسق شبكات التواصل أو متخصص في التسويق الرقمي.\nامتلاك مهارات تنظيمية ممتازة مع القدرة على ترتيب الأولويات.\nإمكانية تحسين ترتيب الموقع على محركات البحث من خلال تحديد الكلمات الرئيسية المناسبة.",
        "Proven working experience in social media marketing or as a Digital Media Specialist",
        "Excellent consulting, writing, editing (photo/video/text), presentation and communication skills",
        "Demonstrable social networking experience and social analytics tools knowledge",
        "Adequate knowledge of web design, web development, CRO and SEO",
        "Knowledge of online marketing and good understanding of major marketing channels",
        "Positive attitude, detail and customer oriented with good multitasking and organisational ability",
        "Fluency in English",
        "BS in Communications, Marketing, Business, New Media or Public Relations"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}