{
    "Job ID": "4746732",
    "Description": "Functional Description This position is responsible for the efficient and effective operations and inventory management of spare of parts in the company to ensure that objectives are met and high levels of customers' satisfaction is achieved. Major Duties and Responsibilities  •Maintain efficient spare parts inventory levels in the branches and CPD. •Place orders with the suppliers in order to have the correct parts in the required quantities available at the right time. •Ensure adequate levels of spare parts availability and efficient stock management. •Assist other staff with Parts Technical Information. •Ensure speedy supply of customer back orders. •Update and maintain accurate records in the DMS database. •Produce inventory reports and co-ordinate physical inventory counts. •Have full responsibility for spare parts inventory and management. •Contact vendors regarding defective parts return and process shipment for defective parts return to vendor. •Analyze spare parts consumption and forecast for replenishment. •Design, develop and implement strategies, procedures and quality controls that contribute to effective inventory control, cost reduction, and customer service. Note: this job description shall include, but is not necessarily limited to the above duties. May temporarily perform other duties assigned to maintain operations and services.   Reporting Line This position reports to the National / Regional Spare Parts Manager. Span of Control This position has no supervisory authority.Skills",
    "Skills": [
        "•Bachelor Degree or Diploma in Business Administration or any related field.",
        " ",
        "•Minimum 5 years of related experience.",
        " ",
        "•Excellent communication and interpersonal skills.",
        " ",
        "•Excellent written and verbal communication skills in Arabic and English.",
        " ",
        "•Excellent Computer skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 0",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}