{
    "Job ID": "4746783",
    "Description": "As an Application Manager, you will be responsible for overseeing the development and management of applications within our organization. You will collaborate with various teams to ensure the successful delivery of high-quality applications that meet the needs of our business and customers. This role requires strong technical expertise, project management skills, and the ability to effectively communicate and collaborate with stakeholders.Responsibilities:Manage the entire lifecycle of applications, from requirements gathering to deployment and maintenance.\nCollaborate with cross-functional teams, including developers, testers, and business analysts, to define project scope, objectives, and deliverables.\nCoordinate and prioritize application development projects, ensuring that they are delivered on time and within budget.\nOversee the development and implementation of application development methodologies and best practices.\nMonitor application performance, identify and resolve issues, and implement enhancements and optimizations.\nManage vendor relationships and ensure the timely delivery of outsourced application development projects.\nEnsure compliance with industry standards and regulations, such as data privacy and security.\nProvide technical guidance and support to the development team, ensuring the use of appropriate technologies and frameworks.\nStay up-to-date with emerging trends and technologies in application development, and recommend innovative solutions to improve efficiency and effectiveness.\nLead and mentor a team of application developers, fostering a culture of collaboration, continuous learning, and growth.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum of 8 years of experience in application development, with at least 2 years in a managerial role.\nBachelor's degree in computer science, Information Technology, or a related field.\nStrong technical expertise in application development frameworks, such as NET, ERP SAP, Java, or Python.\nProven experience in managing the development and delivery of large-scale, complex applications.\nExcellent project management skills, with the ability to prioritize tasks, manage resources, and meet deadlines.\nStrong leadership and communication skills, with the ability to effectively collaborate with cross-functional teams and stakeholders.\nExperience in implementing and managing agile development methodologies.\nKnowledge of industry standards and best practices in application development, including security and performance optimization.\nExperience in managing vendor relationships and outsourced development projects.\nAbility to adapt to a fast-paced and dynamic work environment and handle multiple projects simultaneously.",
        "Strong technical expertise in application development frameworks\nProject management skills\nLeadership and communication skills\nKnowledge of industry standards and best practices in application development\nAdaptability and ability to handle multiple projects"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 10"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}