{
    "Job ID": "4746936",
    "Description": "Financial Analyst is responsible for analyzing financial statements and reports, developing financial models, preparing projections, and performing research and analysis as may be required by management. \nAssist and work with each BUs on their respective budgets and business plan for the year, Consolidate, manage and review all budget data uploaded, Build and prepare BOD presentations on completion of budgeting process. \nClosely work with each BUs on their respective Order Books and Pipelines and report the forecasted sales and margin numbers with accuracy. \nPrepare Forecasted P&L for BUs, consolidate them and report to the Management. \nReview and report on a monthly basis the performance of each business unit and performance at a consolidated level.  \nPrepare monthly MIS Reports  \nMaintain Business Intelligence Framework by continuously making available reports that enable quick and effective decision making.  \nPrepare reports and liaise with external stakeholders like banks and auditors.  \nAssist in implementation of new ERP system and continue to suggest enhancement for better control. \nLiaise with IT Department for preparation and customization of reports. \nMaintain Business Intelligence Framework by continuously making available reports that enable quick and effective decision making.  \nPrepare reports and liaise with external stake holders like banks and auditors.  \nSuggest and initiate cost-cutting measures. Play pivotal role in following through with recommended initiatives. \nPrepare financial analysis and feasibilities for prospective new projects, acquisitions, redevelopments, and divestments. \nCoordinate with supply chain department to maintain optimum stock order level. \nMonitor product costing on periodic basis and coordinate with and sales department to control cost and prices. Skills",
    "Skills": [
        "Master’s degree in Finance & Accounting from an accredited institution or equivalent. \nMinimum 10 years’ experience in a similar role.\nProficiency with spreadsheets, databases and financial software applications. \nStrong knowledge of financial and management accounting concepts coupled with excellent financial and analytical capability.\nAbility to analyze financial data and to prepare accurate reports in a timely manner. "
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Hardware & Building Materials",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}