{
    "Job ID": "4746897",
    "Description": "إتقان استخدام أدوات التسويق الرقمي.\nالمشاركة في عملية التسويق من خلال تقديم الاقتراحات المتعلقة بتحسين المحتوى وإعداد الخطط الإعلامية.\nتقديم الأفكار المبتكرة لتطوير حملات التسويق.\nتقديم توصيات واقتراحات لتحسين المحتوى وتطوير الخطط الإعلانية.• Develop marketing strategies that align with the organization's business goals • Manage and execute campaigns across various digital channels, including email, social media, search engines, and display advertising• Measure and report on the performance of digital marketing campaigns, and assess against goals (ROI and KPIs)• Conduct market research and analyze trends to identify new opportunities and improve campaign performance• Collaborate with cross-functional teams, including creative, content, and web development, to produce engaging content and optimize user experience• Stay up-to-date with emerging digital marketing trends and technologiesIdentify trends and insightsAllocate marketing investments Plan and direct marketing campaignsManage an organization's website and maintain it, keeping best practices in mindOptimize content for the website and social media platformsWork with various content formats such as blogs, videos, audio podcasts, etc.Track the website traffic flowImplement and analyze performance metricsMeasure and assess goals vis-à-vis ROISkills",
    "Skills": [
        "القدرة على استخدام أدوات الاتصال الرقمي المختلفة.\nالإلمام بأدوات تصميم وتطوير مواقع الويب ونظم إدارة المحتوى.\nإتقان استخدام أدوات تصميم وتطوير المواقع الإلكترونية وأنظمة إدارة المحتوى.\nإجادة استخدام أدوات التسويق الإلكترونية والترويجية.",
        "Digital Strategy Development",
        "Content Creation and Marketing",
        "Search Engine Optimization (SEO)",
        "Social Media Management",
        "Pay-Per-Click (PPC) Advertising",
        "Data Analysis and Interpretation",
        "Marketing Automation Tools",
        "Conversion Rate Optimization",
        "Digital Advertising Platforms",
        "Analytics and Reporting",
        "Creative Design Basics",
        "Basic HTML and Website Management",
        "Understanding of UX/UI",
        "Communication Skills",
        "Adaptability",
        "Project Management",
        "A/B Testing",
        "Customer-Centric Mindset"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}