{
    "Job ID": "4746809",
    "Description": "Company registration Project Manager in various jurisdictions in the UAE.Mainland and Free Zone.Responsibilities:1. Interacting with clients at all stages of collaboration.2. Preparing and presenting commercial proposals, including all necessary information about the company registration process, potential structuring options, legal requirements, and related services, considering client needs and strategies.3. Providing optimal solutions when choosing the best jurisdiction in the UAE for business setup (Mainland and Free Zone).4. Offering a wide range of specialized consulting services in business consulting.5. Providing support to clients in emerging aspects and challenges throughout the business registration process.6. Advising clients on UAE legislation, corporate law, and taxation.7. Establishing relationships and coordinating processes with government agencies, banks, and Free Zone departments.8. Opening accounts in banks and payment systems in various legal areas of the UAE, taking into account their specifics and rules.9. Organizing visa support for clients.10. Quality task assignment to the executor and monitoring their completion.11. Thoroughly monitoring compliance with timelines at each stage of the company setup process.Conditions:1. Salary 10000 – 18000 AED + KPIDepends on work experience and desired position within the department.2. Probation period - 3 months.3. Employment visa, insurance.4. During the interview stage, you will need to complete test questions and assignments.Skills",
    "Skills": [
        "Requirements:",
        "1. Experience in the field of company registration in the UAE.",
        "2. Fluent in English and Russian languages as a must.",
        "Skill in handling a large volume of information, multitasking, stress resistance, result-oriented, and ability to work in a team."
    ],
    "Preferred": {
        "Nationality": "Belarus; Central Asia; Estonia; Latvia; Moldova; Poland; Russian Federation; Serbia; Ukraine; West Asia"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Business Consultancy Services; Law Firm; Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}