{
    "Job ID": "4746684",
    "Description": "Functional Description This position is responsible to promote the sales of the brand's products by applying a range of marketing techniques. Major Duties and Responsibilities •Complete price index that measures the brand position against competitors. •Carry out market visits to gather market intelligence information and update the brand. •Manage and maintain an up to date customer database. •Prepare different marketing activities reports including visits and prospects. •Ensure that proper updated point of sales materials are constantly available and displayed according to the corporate identity standards. •Maintain pleasant atmosphere in the showroom according to the corporate identity standards to promote high quality image of the brand and company. •Place product's brochures orders from manufacturers and ensure continuous availability in the showroom. •Coordinates with manufactures for marketing projects. •Mange events, exhibitions and below the line events. •Ensure the availability of promotional material. •Coordinates with the IT Department for the brand website updates and analyze reports such as number of website visitors per day/month. •Maintain and up to date media file for the brand activities. •Facilitates and liaisons with services providers, media houses, advertising agencies and other marketing agencies in all marketing related issue and payments. Note: this job description shall include, but is not necessarily limited to the above duties. May temporarily perform other duties assigned to maintain operations and services. Reporting Line This position reports to the Brand General Manager. Span of Control This position has no supervisory authority.Skills",
    "Skills": [
        "•Bachelor Degree or Diploma in Business Administration, Marketing or any related field.",
        " ",
        "•Minimum 1-3 years of related sales, marketing experience.",
        " ",
        "•Excellent communication, presentation and interpersonal skills.",
        " ",
        "•Excellent written and verbal communication skills in Arabic and English.",
        " ",
        "•Excellent Computer skills."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}