{
    "Job ID": "4746884",
    "Description": "Office Manager (German)The office manager is responsible to overseeing general office operation and ensure the smooth running of the office on a day-to-day basis.Responsible for managing the activities of the CEO’s Office and oversee the provision of administrative support to include handling information of a highly important and confidential nature.\nCoordinate and liaise with internal and external resources and clients.\nWork with team members to obtain information and cascade requests as required to meet deadlines.\nResponsible for researching, compiling and maintaining special reports, presentations, contact details, organization charts, etc.\nPrepare and manage the issuance of various documents (letters, memos, correspondence, agendas, notes and minutes of meetings) as requested by management.\nMonitor and coordinate KPIs with all departments and prepare report as per best practice ensuring employees are working towards achievement of these objectives.\nOversee office interactions, responding to requests and questions.\nPlan and arrange schedules and budgets.\nCreate presentations and other management-level reports.\nProactively manage appointment scheduling, coordinate meetings and managing calendars and schedules, including Board of Directors meetings, record and distribute minutes of meetings.\nOversee and maintain office equipment for uninterrupted function, identify and fulfill office supply needs, maintain and manage vendors, and coordinate food delivery as needed.\nManage all aspects of the office’s space/infrastructure planning (moves, adds, and changes to workstations) and provide answers, resources, and solutions as requested\nProvide direct administrative supports as needed, including scheduling appointments, meetings, and events, booking travel, maintaining filing system, mailing and shipping packages.\nArrange programs, events, or conferences by arranging for facilities, issuing information or invitations, coordinating speakers, and controlling event budget.\nTranscribe dictation, and compose and prepare confidential correspondence, reports, and other complex documents.\nCoordinate reception of high-level guests and visiting delegations.\nArrange complex and detailed travel plans and itineraries; compile documents for travel-related meetings.\nAssemble and analyze information, prepare reports, and agendas.\nMaintain files, keep records, compile reports and process documents in a timely manner.\nImplement established policies and procedures, develop administrative procedures and offer suggestions for process improvements.\nExhibit behavior consistent with company code of conduct and QHSE Management System in line with:\nISO 9001\nISO 14001\nISO 45001\nPerform other duties related to the job as assigned by the Direct Management.Skills",
    "Skills": [
        "Candidate must possess proficiency in English and German languages, verbal and written communication skills.\nBachelor’s degree in Business Administration and or any other equivalent.\n5 –6 years of proven experience in office management experience.\nHigh level of communication and organizational skills.\nProficiency in English and German languages verbal and written communication skills.\nPrevious experience of having managed a range of support functions & demonstrating leadership skills with the ability to improve organizational effectiveness.\nMust exhibit strong time management and organizational skills, and possess the ability to multi-task.\nMust be able to work in a high-stress, fast paced environment and demonstrate the flexibility required to handle a very dynamic work environment.\nA high level of accuracy ,attention to details and Ability to handle confidential information.\nMust possess professional interpersonal skills and the ability to work well with others, as well as the ability to work independently, in a fast paced environment with changing priorities.\nAdvanced computer skills and experience with online platforms\nProficiency Microsoft Office (Word, PowerPoint, Excel), with aptitude to learn new software and systems.\nProblem solving abilities.\nDesired start date: As soon as possible"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}