{
    "Job ID": "4746493",
    "Description": "Gather information about all the needed paperwork for all the processes and procedures pertaining to tenders and government relations.\nShare the information with the concerned departments, inform them of the deadlines for submitting the paper, and follow up with the departments to ensure timely and complete submissions.\nEstablishing rapport and relations within the relevant government institutions and officials for the best interest of the company’s healthcare division.\nKeeping a keen eye on the status of tenders and quotations.\nUtilizing public relations skills to inquire about declined quotations and strategizing on ways to improve future proposals.\nEstablishing an effective communication channel between the contracts team and the central medical stores, promoting transparent and efficient information exchange.\nServing as a bridge between the tender team and the stock-keeping system of pharmaceutical suppliers to ensure smooth and timely communication of needed quantities.\nConducts a thorough check of invoices and items before they are delivered to the warehouse, ensuring that every document and item is accounted for.\nMaintaining high standards by performing quality checks on items and invoices, spotting, and rectifying discrepancies quickly and efficiently.\nPerform other duties related to the job as assigned by the Direct Manager.\nPrepare and submit reports tracking the status of tenders and pending government procedures to the direct manager.Skills",
    "Skills": [
        "Communication Skills\nInterpersonal Skills and Networking\nAttention to Details\nOrganizational Skills and Time Management\nProblem-Solving Skills\nProficiency in Arabic and proficiency in English would be an advantage."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Pharmaceutical Manufacturing; Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}