{
    "Job ID": "4747150",
    "Description": "The Licensing and Compliance Senior Specialist is responsible for assisting with the development of licensing policies and procedures, as well as ensuring that appropriate updates are reflected when regulations change.\nAssist in the drafting of regulatory instruments such as approvals, partial cancellations, and exemptions.\nIn charge of reviewing new license applications and evaluating them in accordance with law, legislation, and relevant regulations.\nOversee the day-to-day licensing process, which includes reviewing applications, tracking statuses, and tracking the progress of submissions to company and any other applicable authorities, as well as assisting with the preparation of sector-wide recommendations to ensure excellent licensing services.\nSupport the development and implementation of a licensing framework for the energy sector, ensuring an effective and efficient process is developed and implemented.\nAssist in the creation of regulatory instruments such as approvals, partial cancellations, and exemptions.\nAssist in reviewing documentation and entering data into the system for the licensing and re-licensing of applicable entities operating in the energy sector.\nDisseminate formal licensing documents and communications to licensed companies.\nAssist in the preparation of regular and accurate reports and updates on compliance of licensed entities in the energy sector and distribute to internal and external stakeholders as needed.\nAssist in the development of licensing policies and procedures and ensure that appropriate updates are made when regulations change.\nExamine new license applications, evaluating them in accordance with the law, legislation, and applicable regulations.\nMonitor the day-to-day licensing process, which includes reviewing applications, tracking statuses, and tracking the progress of submissions to company and any other applicable authorities.Skills",
    "Skills": [
        "Bachelor’s degree in a relevant discipline, e.g., Business Management.\nMinimum of 3 - 5 years of experience in the Licensing environment."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Energy & Renewables",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}