{
    "Job ID": "4747840",
    "Description": "As a Reception and Administration Assistant, you will be the first point of contact for our company, providing essential administrative support to ensure smooth daily operations. Your role will encompass a blend of receptionist and administrative duties, making you a crucial part of our team.Key Responsibilities:1. Front Desk Management: Greet visitors, answer phone calls, and direct inquiries to the appropriate department or individual.2. Visitor Assistance: Ensure a welcoming and professional environment for guests and provide assistance as needed.3. Mail and Packages: Receive, sort, and distribute incoming mail and packages.4. Appointment Scheduling: Coordinate and schedule appointments, meetings, and conference rooms as required.5. Maintain Reception Area: Keep the reception area organized, clean, and well-stocked with necessary supplies.6. Visitor Records: Maintain a visitor log and ensure security procedures are followed for visitor access.7. Data Entry: Assist with data entry tasks, maintaining accurate records and databases.8. Document Handling: Organize and file documents, both physical and electronic, ensuring accessibility and confidentiality.9. Correspondence: Draft and distribute internal and external communications, emails, and memos.10. Office Supplies: Monitor and restock office supplies as needed.11. Travel Arrangements: Assist in making travel arrangements for employees when required.12. Meeting Support: Prepare meeting materials, agendas, and take minutes as requested.13. Record Keeping: Assist with record-keeping, including employee attendance and leave requests.14. General Administrative Support: Provide support to various departments and managers as needed.Skills",
    "Skills": [
        "High school diploma or equivalent; relevant college education is a plus.",
        "• Previous experience in a receptionist or administrative assistant role is preferred.",
        "• Proficiency in Microsoft Office Suite (Word, Excel, Outlook).",
        "• Excellent communication and interpersonal skills.",
        "• Strong organizational abilities and attention to detail.",
        "• Ability to handle multiple tasks and prioritize effectively.",
        "• Professional and friendly demeanor."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}