{
    "Job ID": "4747745",
    "Description": "Music is My Life is seeking a highly motivated and experienced Artist Manager to join our Music and talent department.As an Artist Manager, you will play a crucial role in discovering and nurturing exceptional musical talent that has the potential to make waves on a global scale.Responsibilities:Overseeing the development and production of music projects\nCollaborating with artists to create and execute successful marketing and promotional strategies.\nStaying up to date with industry trends and emerging artists\nAttending industry events and networking to expand the company's talent pool.\nYou will scout and sign talented regional and international artists who are demonstrating the potential to make waves on a global scale.\nManage the recording process of each artist project according to label deadlines and within label pre-determined budgets through mastering and delivery to label and marketing teams.\nMaintain awareness and understanding of modern musical, cultural, technological, and production trends to keep our artists, their songs, and their production values relevant, with particular reference to social media and content trends.\nMaintain strong relationships with managers, lawyers, radio programmers, media, promoters, and commercial partners to stay in the loop on new and emerging artists.\nYou will maintain existing relationships with Music is My Life Recordings artists and nurture/develop your own acts.\nYou will maintain strong relationships with artists, writers, producers, toplines, remixers, and other specialized creatives, while actively searching for new contacts able to contribute or add to the quality of our releases and our repertoire.\nYou will match the right people by making perfect use of your connections within the music industry.\nYou will visit performances, showcases, nightclubs, festivals, and similar events across the region to discover new talent and maintain existing relationships,\nYou will chase information and details to pass on to our legal department.\nYou will create and oversee release plans made in tandem with the assigned Product Manager, Digital and Streaming teams (and any other internal and external stakeholders).\nYou will use your knowledge of the regional music market to help releases realize their potential.\nYou will assist the Product team in developing marketing assets, strategies, marketing plans, and campaigns.\nYou will assist in the day-to-day management of more junior members of the A&R team.\nAny other role as required from time to time by the business.Skills",
    "Skills": [
        "A bachelor's degree in business management\nYou are extremely passionate and knowledgeable about music both within the MENA region and on a global scale.\nStrong network of industry contacts.\nExcellent communication and interpersonal skills.\nYou know all about the main music distribution partners (from physical distribution to digital distribution and streaming).\nYou know how record labels operate, especially in terms of product marketing, business affairs, Artist management and administration, and more.\nYou have strong analytical skills to assess artists and release performance.\nYou’re able to cope with pressure and changing deadlines extremely well; you’re able to keep your head straight while working on multiple projects at the same time.\nNegotiating deals is part of your DNA.\nYou love working in tandem with all of the company’s different departments to get results fast.\nYou have a broad musical taste and knowledge of music’s many different genres.\nYou are resourceful and creative, and you live and breathe music.\nWilling to work nights, and weekends and travel as needed.\nSalary 1000$ to 2000$ depending on experience.",
        "To be successful in this role, you should have a deep passion for music and a keen ear for talent. You should also have excellent communication and negotiation skills, as well as a strong understanding of the music industry.",
        "If you are a music enthusiast with a knack for discovering exceptional talent, we would love to hear from you. Join our dynamic team at Music is My Life and be part of shaping the future of the music industry."
    ],
    "Preferred": {
        "Age": "Min: 28 Max: 35"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Media Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}