{
    "Job ID": "4747545",
    "Description": "Knowledge and understanding of international freight forwarding, domestic and gateway operations.\nDefining, developing and evaluating the marketing strategy, based on the organization's goals, market needs, cost factors and profit margin.\nDeveloping pricing strategies and striking a balance between enterprise goals and customer satisfaction.\nBuilding a comprehensive database about the markets, competitors and everything related to competitors, their products, prices and marketing plans.\nThe ability to generate new sales revenue independently and for a designated geographic region.\nCreate and drive a sales plan strategy that successfully meets monthly sales goals and initiatives.\nManage typical conversion rate, sales call, revenue, and other reports in a precise manner for accurate evaluation.\nEnsure dynamic communication with clients through online and offline modes, thereby promoting company products and services.\nBoosting sales prospects through effective utilization of consumer sales, dealer, PR, and business promotion techniques.Skills",
    "Skills": [
        "Understanding of the sales process and dynamics.\nAdept at communicating with the in-house team, clients, and management through formal documentation and discussions.\nKnowledge of customer service principles and processes.\nA high level of focus on driving sales with consistent performance and teamwork.\nApt in dealing with clients and engagingly presenting product data for potential leads.\nStrong negotiation skills.",
        "Qualifications:",
        "Sales Experience in UAE or GCC with Shipping/Freight Forwarding Company: 3-5 years (preferred)\nBachelor’s Degree in Logistics, Operations Management.\nKnowledge and experience in MS Office, Logistics Management software is preferred.\nIn addition to English, ability to converse in one of these languages is preferred - Hindi or Arabic."
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Distribution, Supply Chain & Logistics; Shipping",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}