{
    "Job ID": "4747631",
    "Description": "About the company: Our client is Middle East's leading digital signage company that specializes in everything from LED displays and kiosks to meeting room solutions and AV tech.Job Title: Country Manager - Saudi Arabia The primary responsibility is to be in charge of business development and growth in Saudi Arabia. The Country Manager will represent our client in Saudi Arabia and will manage all operations, including recruitment, planning, and submitting reports. The Country Manager will be responsible for the revenue, profit, working capital, and project delivery quality goals of our client. This position holds a high level of autonomy; however, will report directly to the Managing Partner. The candidate must have a sound knowledge of the Audio Visual industry.Management Activities:Acquire a thorough understanding of AV requirements and objectives including, but not limited to contractual, financial, technical schedules,\nsite coordination. AV equipment, personnel, and scope of work.\nFacilitate internal project kick-off meeting that includes critical participants from 2point0 Concepts, clients, and consultants.\nMaintain and develop working relationships with civil contractors as appointed by the client and all other stakeholders of the project.\nCoordinate all in-house activities associated with project execution, including but not limited to assisting the procurement of AV equipment, submittals, engineering fabrication and installation, programming, commissioning, testing, and troubleshooting.\nRegularly inspect AV installation work performed by staff and/or subcontractors.\nTest, or certify the performance of, installed AV systems and generate inspection reports.\nDesign new company offerings/solutions through in-house research, testing and development efforts.Pre Sales & Solutions Analvze inbound customer requirements to vet and understand client needs.\nCommunicate and consult with customers through in person and online meetings to fully understand their needs and requirement to offer the best solution.\nCreate Cost Analysis which includes designing a solution and attaining pricing, product availability and timelines through coordination with vendors.\nAnalyze the profitability of a project based on the Cost Analysis and communicate this to the Managing Partner for each project.\nPrepare quotation and proposals for end clients.\nEvaluation of client drawings and floor plans, RCP plans and MEP plans to assess architectural layout, electrical, power, and structural to design in AV endpoints.\nCommunicating infrastructure and architectural requirements to the project team and contractors.\nEngineer audio visual and digital signage solutions to support the proposal process including the bill of material, manpower and logistical requirements including AV Networking + 1 opoiogy, System Diagrams & Block Diagrams, Design Floor Box, Wall plates and overlays, Video Conferencing Systems, LCD Displays / LED Displays & Systems, Digital Signage Systems, Complex Audio-Visual Systems\n Present designed solutions to clients through professional sales presentations.\n.Develop engineering and architectural drawings to determine power load calculations, acoustical requirements, and weight calculations.\nProvide on-site engineering assistance when needed.\n. Assist project manager in project sign offs as needed.\n. Act as a technical resource for associate engineers, technicians, and operating staff.\n. Software Proficiency - MS Office applications especially Microsoft Excel and AutoCAD required. Education Requirements:- A background in engineering/electronic communications.Work Experience:- At least 8-10 years of work experience in technical pre-sales or business development role in the Audio Visual industrySkills",
    "Skills": [
        "Technical skills: Info Comm CTS D/I desired."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}