{
    "Job ID": "4747569",
    "Description": "Would you like to become a part of the MarbillCare family? You are more than welcome to send us your application, and we will review your CV as soon as we have an open position!!MarbillCare is a dynamic and innovative company committed to delivering exceptional Customer Service to our clients. We take pride in our dedication to quality, innovation and customer satisfaction.Our Customer Support agents are the first point of contact for our valued users, assisting them with all kinds of queries, providing a first-time resolution, using internal tools and focusing on giving the best service.Online troubleshooting technical issues relating to customers, payments and products, guiding them through solutions, and escalating problems as needed.\nProvide support to customers, demonstrating empathy, patience and an understanding of their needs.\nRespond to customer inquiries by phone, e-mail and Live Chat and provide accurate information regarding our services.\nDocument customer interactions, issues, and resolutions in our CRM system.\nMaintain a positive and professional attitude while handling challenging situations.\nStrive to achieve and exceed individual and team performance metrics, ensuring high levels of quality.Skills",
    "Skills": [
        "We are seeking customer-service minded agents that are fluent in English.\nOther languages such as Spanish, Italian, German, Arabic, Russian, French, Portuguese or Polish will be considered as an advantage.\nHigh school diploma or equivalent.\nProven experience in customer support or similar role.\nGoal-driven with strong problem-solving skills, with the ability to think critically under pressure.\nFamiliarity with CRM software and ticketing systems.\nAbility to work independently and collaboratively within a team.",
        "Benefits",
        "This position is 100% remote\nType of contract: freelance/ contractor\nFull-time position\nFun and supportive work environment\nAn informal tone and flat organization\nHigh-paced environment, where you can quickly go from idea to action"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1"
    },
    "Data": {
        "Job Location": "Tunis, Tunisia",
        "Company Industry": "Call Centers & Customer Care Outsourcing",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}