{
    "Job ID": "4747707",
    "Description": "We are a growing restaurant brand looking for a Sales and Marketing Specialist to drive customer acquisition and retention. You'll manage our online and offline marketing efforts, optimize ROI, and actively pursue new sales opportunities. This role is perfect for a data-driven individual with a strong background in both sales and marketing and a passion for the food and restaurant industry.Key ResponsibilitiesDevelop and implement integrated marketing campaigns both online and offline to drive customer acquisition and retention.\nManage social media accounts including Instagram, TikTok, and Facebook. Assist in the creation and editing of written, video, and photo content, and collaborate with the team to maintain a social media calendar.\nInteract with customers and respond to social media messages, inquiries, and comments.\nManage Google Business profile, monitor customer reviews, and execute crisis management strategies for handling negative feedback.\nAnalyze customer behavior, sales trends, and other ROI metrics to evaluate the effectiveness of marketing campaigns.\nConduct market research to identify opportunities, threats, and trends in the industry.\nPromote special events, discounts, and menu changes to both new and existing clients.\nActively pursue leads and close sales through various channels including social media accounts and WhatsApp.\nProactively identify new sales opportunities, generate leads, and foster relationships by cold-calling prospective customers or securing invitations to submit Requests for Proposals (RFPs).\nBuild and maintain relationships with local businesses and clients for partnerships and collaborations.\nPrepare data-driven reports for management, focusing on sales targets and ROI.Skills",
    "Skills": [
        "Bachelor's degree in Marketing, Business Administration, or related field is preferred.\nAt least 2 years of experience in a similar role focusing on both sales and marketing in the UAE.\nData-driven mindset with the ability to analyze and interpret metrics.\nStrong proficiency in social media advertising as well as traditional sales methods.\nStrong interpersonal and written/verbal communication skills in English and Arabic\nProficient in Microsoft Office Suite, Google Workspace, and CRM software.\nDemonstrated experience and a genuine passion for the restaurant and food industry."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}