{
    "Job ID": "4747528",
    "Description": "Job Title: Sales EngineerDepartment: SalesReports To: CEOSummary:Beirut ElectroCity is seeking a Sales Engineer who will be responsible for supporting the sales operations of our company's technical products and services. This role involves providing technical expertise and assistance in product selection, as well as implementing projects and customized solutions. The ideal candidate should have a strong technical background, excellent communication skills, and the ability to build strong relationships with customers.Essential Duties and Responsibilities:- Understanding customer needs and providing recommendations for products and solutions.- Placing orders for product preparation.- Collaborating with customers to troubleshoot technical issues.- Staying updated on the latest technical advancements in our industry.Benefits:- Opportunity to work with a team of talented professionals.- Chance to make a significant impact on the company's success.Work Schedule:- Monday to Friday, 9:00 am to 5:00 pm.Location: Msaytbeh, Beirut Starting Salary: 500 USDIf you are a highly motivated and results-oriented individual with a passion for technology, we encourage you to apply for this exciting opportunity.Skills",
    "Skills": [
        "Qualifications:",
        "- Bachelor's degree in engineering or a related field.",
        "- Fresh graduate with a BS in CCE or Mechatronics.",
        "- Strong technical knowledge of electronic components, microcontrollers, and microprocessors (such as Arduino and Raspberry Pi).",
        "- Familiarity with programming concepts.",
        "- Strong analytical and problem-solving skills.",
        "- Self-motivated and driven to achieve results."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Electrical Engineering; Mechanical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}