{
    "Job ID": "4747896",
    "Description": "Personalized Internet Ads Assessor – Korean Speakers (Philippines)In this job, you will be reviewing online advertisements in order to improve their content, quality, and layout. You will be required to provide feedback and analysis on advertisements found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this opportunity will involve reviewing the language used in advertisements by examining grammar, tone, and cultural relevanceSkills",
    "Skills": [
        "Who is suitable for this work?",
        "We are looking for dynamic people who have strong communication skills and use the Internet daily. ",
        "This is a freelance, independent contractor position. You will have the flexibility and freedom to work from your own home, working your own hours.",
        "What are the main requirements for the opportunity?",
        "You must be living in The Philippines for the last 3 consecutive years\nYou must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in The Philippines\nFull professional proficiency in English and Korean Language\nAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expense\nExperience in use of web browsers to navigate and interact with a variety of content\nAccess to and use of an Android (version 4.1 or higher) or IOS Smartphone (version 8 or higher) to complete tasks\nA Barcode Scanner application must be installed on your smartphone to complete certain tasks\nActive daily user of Gmail and other forms of Social Media"
    ],
    "Preferred": {
        "Residence Location": "Philippines",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Manila, Philippines",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}