{
    "Job ID": "4747504",
    "Description": "B2C Jewelry Sales Manager / Advisor / Consultant (E-Commerce)BS Jewelry was established in 2013 and today it is a leading moissanite and lab-grown stones premium jewelry brand. We design, manufacture and sell our jewelry directly to customers through e-commerce channels such as online shop and social media. Jewelry quality and highest standards customer service are our major priorities. We have expanded our operations to UAE's fast-growing market recently.Job DescriptionWe are looking for an ambitious female Sales Manager who will be the first team member in the Sales department, working together with the company co-owners to grow the company sales in the region and overseas.B2C / Direct Sales:Manage sales generated from Social Media outreach including Website, Instagram, WhatsApp.Process the orders in Prestashop CRM and Odoo ERP.\nMake calls to confirm orders and write down all the details.\nAnswer to Facebook, Instagram and WhatsApp messages, send photos, videos and prices to customers.\nInvite customers to the showroom / office or arrange a delivery with DHL Express or own company staff.\nBe ready to meet customers outside of the office if needed.\nMake a high grade jewelry presentation, confidently describe all the advantages of moissanite and other lab-grown stones along with jewelry quality and brand valuables.\nPass orders to the manufacturing department.\nCommunicate with company management for price calculation on custom jewelry and other customer requests.\nEnsure orders are quality checked and elegantly packed before customer delivery\nMaintain and communicate updates on the customer database and sales pipeline leads.Our office is located in a nice modern building in Dubai Silicon Oasis.Skills",
    "Skills": [
        "Fluent English is necessary, Arabic would be beneficial.\nKnowledge of customer service principles and processes.\nPerformance-driven and capable of achieving targets under pressure.\nPortraying superb soft skills during customer interaction.\nDemonstrated ability to forge long-lasting work relationships by leveraging information, tactics, and excellent communication.\nJewelry, premium or luxury products experience would be beneficial.\nKnowledge of the diamond grading system (4C) would be beneficial.\nExperience with CRM software would be beneficial."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "All Anglophone Countries; Russian Federation; United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Anglophone Countries; All Eastern European Countries; All Western European Countries; Belarus; Russian Federation; Ukraine",
        "Degree": "High school or equivalent",
        "Age": "Min: 25 Max: 37"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Jewelry & Gold",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}