{
    "Job ID": "4747473",
    "Description": "We are seeking a highly motivated and experienced Sales and Account Manager to join our team. The successful candidate will be responsible for driving sales, nurturing client relationships, and overseeing the smooth operation of warehouse and delivery procedures to ensure customer satisfaction. This role is critical in achieving our mission to deliver quality food products on time and as efficiently as possible.ResponsibilitiesDevelop and execute sales strategies to meet and exceed revenue targets.\nIdentify and nurture client relationships within the food supply sphere, including retailers, hotels, restaurants, wholesalers, and other business partners.\nCommunication with potential customers and business partners.\nCurrent customers support and communication (incl.accurate document flow). Development of long-term, trusting relationships with customers.\nNegotiate contracts and close agreements to maximize profits.\nWarehouse operation control, Work closely with the warehouse team to optimize inventory control, including stock levels and turnover.\nСontrol of delivery of goods from the warehouse to the customer.\nEnsure the timely and successful order delivery. \nHandle customer inquiries, complaints, and other feedback, providing excellent customer service to maintain high levels of customer satisfaction.\nConnecting with key business executives and stakeholders and preparing sales reports.\nWork in compliance with food safety standards and regulations.Skills",
    "Skills": [
        "Bachelor’s degree in a related field.\nA minimum of 3 years’ experience in a sales or account management role, preferably within the food supply chain or a related industry.\nStrong understanding of warehouse operations, logistics, and supply chain management.\nExceptional verbal and written communication skills.\nAbility to work independently and as part of a team.\nProficiency in Microsoft Office Suite, and familiarity with CRM software.\nStrong problem-solving skills, with an ability to think quickly under pressure.\nMust be willing to travel as required."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}