{
    "Job ID": "4747472",
    "Description": "Parisima Talent is looking to hire Specification Specialist with one client in Building Materials industry in Saudi Arabia.Position: Specification Specialist / Pre-Sales EngineerJob location: Riyadh, Saudi ArabiaJob Responsibilities:Organize seminars and lunch & learns sessions across the territories and with a focus on hospitality, healthcare, education, retail and government buildings segments.\nKeep a closer eye on the projects potential and the tendering volume.\nExpand contacts across pre-sales targeted entities namely architects, designers, planners, developers, consultant engineers, project managers and government influencers as applicable.\nConstruct global account & key account platform in order to sustain the pre-sales strategy notably in hospitality, healthcare, retail and government segments.\nMaintain an up-to-date educational curriculum to architects, developers and consultants.\nConnect to major architectural and planning firms in order to stay alerted on new projects’ master plans and similarly augment the projects potential for higher tendering abilities in the growing markets.\nShow innovative initiatives towards new approaches to potential accounts in order to enhance the dynamics for an expanded penetration plan in specifications and KAM accounts.\nMaintain high focus in CRM cockpit per market, by segment and under each large account.\nPenetrate key consultants, designers, planners, architects & developers network in an aim to maturing high level relationships across KSA.\nOrganize local training, seminars and conferences for the architects/designers and consultants with the purpose of transferring knowledge at all times.\nAchieve annual budget / targets with the purpose of continuous market share growth across product categories and pre-sales / sales channels\nRepresent the company at the highest level in the territory and showcase top class behaviour at all times.Skills",
    "Skills": [
        "Job specifications:",
        "Bachelor’s University degree in civil engineering / industrial engineering / information systems engineering / architecture / interior design\n2+ years’ experience in projects specifications & business development within the building materials, preferably ceramic sanitary ware / Construction industry in KSA market\nGood track record in KSA construction market.\nThe ability to engage in effective English language; verbal and written communication skills. Arabic language is a plus.\nProven engagement with KAM Accounts.\nExcellent communication, presentation, and socializing skills.\nNatural inclination to pre-sales.\nStrong engineering and architectural awareness."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}