{
    "Job ID": "4747666",
    "Description": "An experienced Project Manager (10 years + with a Bachelor Degree in Engineering) required for a well- known Saudi Engineering Consultancy Company for projects within Saudi Arabia, for a minimum period of 12 months contract, offering a competative salary.Responsible for overseeing the successful delivery of complex projects, managing client relationships, and providing strategic direction to ensure project success. This role requires a strong background in project management, excellent leadership capabilities, and the ability to drive project teams towards achieving business objectives. Responsibilities:1.      Project Leadership and Strategy:-         Provide strategic guidance and direction to project teams, ensuring alignment with client goals and objectives.-         Define project strategies, including scope, deliverables, timelines, and resource allocation.-         Establish project governance frameworks and ensure adherence to project management best practices. 2. Client Engagement and Relationship Management:-         Serve as the primary point of contact for clients, building strong relationships based on trust and collaboration.-         Understand client requirements and translate them into actionable project plans and deliverables.-         Continuously engage with clients, addressing concerns, managing expectations, and seeking opportunities for business growth. 3. Team Management and Development:-         Lead and mentor a team of project managers, providing guidance, support, and professional development opportunities.-         Foster a collaborative and high-performance team culture, encouraging innovation and continuous improvement.-         Ensure effective resource allocation and utilization, balancing workloads and leveraging individual strengths. 4. Project Execution and Monitoring:-         Oversee the execution of multiple projects, monitoring progress, and ensuring adherence to project plans.-         Mitigate risks and proactively address issues, making necessary adjustments to keep projects on track.-         Monitor project financials, budgets, and profitability, ensuring efficient resource utilization and cost control. 5. Stakeholder Management:-         Engage with key stakeholders, including senior management, clients, and partners, to ensure alignment and manage expectations.-         Communicate project progress, risks, and opportunities, providing regular updates and addressing any concerns.-         Facilitate effective communication and collaboration between stakeholders to drive project success. 6. Quality Assurance and Process Improvement:-         Develop and implement quality management processes, ensuring the delivery of high-quality project outcomes.-         Continuously assess project management methodologies and tools, identifying opportunities for process improvement and efficiency.-         Promote a culture of excellence, driving the adoption of industry best practices and ensuring compliance with relevant standards.Skills",
    "Skills": [
        "Qualifications:",
        "-         Bachelor's degree in a relevant field (Project Management, Engineering, Business, etc.). Advanced degree preferred.",
        "-         Proven experience as a Project Director or in a similar senior project leadership role.",
        "-         Strong knowledge of project management methodologies, tools, and best practices.",
        "-         Excellent leadership, communication, and negotiation skills, with the ability to influence and inspire teams.",
        "-         Demonstrated ability to manage complex projects and multi-disciplinary teams, delivering results within budget and timelines.",
        "-         Proficiency in project management software and tools."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 10 Max: 15",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 35 Max: 55"
    },
    "Data": {
        "Job Location": "As Sulaymaniyah, Riyadh , Saudi Arabia",
        "Company Industry": "Construction & Building; General Engineering Consultancy; Project & Construction Planning",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$6,000 - $7,000",
        "Number of Vacancies": "5"
    }
}