{
    "Job ID": "4747793",
    "Description": "Media Search Analyst - Arabic Speakers (UAE)Media Search Analyst - An exciting work-from-home opportunity related to Siri Music, Video, Books, App Store, Podcast and HomePod! We offer flexible hours and schedule completing tasks in a web-based evaluation tool.The Role:Evaluation of online task types related to Siri Music, Video, Books, App Store, Podcast, and HomePod to help improve the overall quality and relevance of online content and research.What does the job involve?Evaluation of many different task types including Music and Video judgments across media domains\nResearch using online tools to determine and judge the intent and accuracy of queries\nApplying market knowledge with provided guidelines to judge the relevance and intent of task information for your marketBenefits & Perks:Flexible hours to work around home life\nBetter Work-Life Balance.\nRemote work & location independence\nPositive environmental impact\nIndependent contractor role.Skills",
    "Skills": [
        "What are the main requirements for the job?",
        "Fluency in English & Arabic is essential\nYou must be living in UAE for a minimum of 1 year\niOS device owner & user\nApple user - Your email address must be associated with an Apple ID, this should be used when registering\nA screenshot of your Apple ID must be provided for verification\nMust own and use an iOS device (iPhone, iPad, iPod Touch) supporting the latest iOS version\nExperience/know-how of Apple products is mandatory\nFamiliarity with current Applications, Music and Video trends\nStrong attention to detail and excellent communication are essential\nAbility to work independently and flexibility to new techniques/processes\nPreferred level of education/certification - High School degree or higher Further opportunities may arise to contribute to other tasks on a freelance basis"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}