{
    "Job ID": "4747774",
    "Description": "Location : remote\nStart date : October 2023\nType : Part timeKayros GamesKayros Games is a French Paris-based startup, born in May 2022 and operating remotely from every corner of the globe. Our flagship product, Kayros Wallet, went live in July 2023. The journey since has been nothing short of a thrill ride. We're a committed team of eighteen full-timers, all driven by one shared dream: to dominate the world of GameFi. As we gear up for global expansion, we're seeking ambitious, fun-loving talents to join us. Think you can bring something to the table? Let's conquer the GameFi world together! Join the fun, join the revolution, join Kayros Games.Kayros Wallet : the wallet that rewards Web3 gamersKayros is a pioneer in the \"X to earn\" movement combining gaming, learning, community, and business. Kayros Games is a Web3 game store that provides the ultimate GameFi experience. It offers access to over 100 P2E games on all blockchain networks with just one click. Kayros Games users can earn rewards by completing quests or quizzes, as well as playing Web3 games. They can also buy and sell game tokens and in-game NFTs.TeamWithin the Global Social Media Manager team, Kayros Games is looking to hire a remote part-time Social Media Manager to strengthen the team and work on an international level.The OpportunityAs we strengthen our brand and awareness, we want to make Kayros Games more vocal across Arabic markets. We are looking for a versatile and creative social media manager who will help us craft powerful and differentiating pieces of content to promote Kayros, educate, and engage with our communities of gamers.What You'll DoBe able to create and implement a social media strategy across multiple channels\nHave managed brand social media accounts previously, demonstrating an ability to create engaging content, drive follower engagement and audience growth\nWork closely with the Marketing team to review all content and ensure alignment with brand strategy and guidelines\nHave an understanding of gaming content\nThink outside the box when it comes to creating content. You don’t shy away from challenging the norm, being in people’s faces and creating bold and playful contentSocial mediaIdentify and outreach to potential partners including gamers, live streamers, media and influencers\nManage brand relationships with key gamers, content creators and influencers\nPlan, ideate and execute social media strategies throughout the calendar year that reaches and engages new audiences\nOwn and implement a content calendar for all Kayros social media channels, ensuring content is planned monthly in advance and aligns with the overarching social media strategy\nCo-ordinate the briefing and execution of all social media content with the copywriting and design teams where their support is required\nCreate, schedule and post social media content for both an always-on engagement strategy, as well as developing campaign content around key calendar themesSkills",
    "Skills": [
        "Required Skills",
        "2+ years experience working in social media, content creation, influencer management or similar\nHave a thorough understanding of social media and trends (particularly Twitter, Youtube, Linkedin, Instagram and TikTok)\nUnderstanding of social networking\nHave a strong grasp on what types of content and style perform well on individual platforms\nSelf-starter, you’re confident single handedly undertaking tasks, managing timelines and delivering high quality work\nExcellent writing and editing skills (in both english and arabic) with a passion for storytelling & creativity while having meticulous attention to detail.\nA passion for telling captivating stories through words, and an understanding of how copy and design work hand-in-hand\nGood knowledge of social trends\nCurious, versatile and ability to execute fast & well",
        "Nice to have",
        "Interest or previous experience in gaming and/or crypto space\nExperience working in a fast-growing tech start-up environment\nContent creation experience on personal social media (Twitter, LinkedIn, Instagram, TikTok, Youtube)\nSkills in video creation & editing"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}