{
    "Job ID": "4747040",
    "Description": "القيام بالمهام الموكلة وفقاً للسياسات والإجراءات المعمول بها لتحقيق أهداف الشركة.\nمراقبة المبيعات النقدية والتأكد من تحصيل قيمتها.\nالمساعدة في تسجيل وإعداد المدخلات اليومية لجميع الفواتير، وإعداد التسويات المصرفية الشهرية.\nالتأكد من صحة تسلسل وبيانات سندات القبض ومتابعة الإيداعات وتسجيل الحركة اليومية للفروع.\nمراقبة التحصيل للفروع يومياً والتأكد من إغلاق الصناديق.\nتسوية حسابات الصندوق (نقدي وشيكات) والموردون والبنوك والذمم المدينة.\nمتابعة الخصومات الممنوحة للعملاء ومرتجعات البضاعة من العملاء.\nترصيد جميع فواتير العملاء المدفوعة وتسجيل حركات البيع والتحصيل في أرصدة الشركة بهدف تعديل وتحديث حسابات العملاء والمطابقات بشكل يومي.\nمطابقة أرصدة حسابات العملاء بشكل دوري عن طريق الزيارات الميدانية للعملاء والتواصل المباشر معهم.\nعمل تسويات ذمم العملاء عن طريق مطابقة كشف حساب العميل مع الكشف الموجود على النظام الخاص بالشركة.\nايداع متحصلات المبيعات النقدية والآجلة في البنوك.\nمتابعة وتدقيق العمل الإضافي الخاص بالرواتب شهريا.\nمراجعة المستندات المؤيدة للبضاعة المرتجعة من العملاء.\nالقيام بعملية الجرد الدوري للبضاعة بالمستودعات لغايات المطابقة، ومعالجة أية فروقات.\nالمشاركة في جرد البضاعة التالفة وتجهيز محضر جرد للتوالف والإفادة حول حالة البضاعة.\nحفظ وإدارة العهد النقدية.\nصرف النثريات من العهد النقدية وتجهيز كشف دوري بالمصاريف النثرية لإعتماده من الإدارة.\nقيد مصاريف الفروع.\nحفظ كافة الملفات والوثائق والتقارير والمعلومات المالية، والمحافظة على جميع الدفاتر المحاسبية والمستندات المالية بطريقة آمنة بما يضمن سهولة الرجوع إليها.\nالقيام بأي مهام أخرى موكلة إليه من المدير المباشر.Skills",
    "Skills": [
        "المعرفة الجيدة بالمبادئ المحاسبية\nالمعرفة ببرنامج ال MS Office \nمهارة الإدارة والتنظيم\nالتنسيق والمتابعة\nالقدرة على التحليل والتدقيق\nالسرعة في حل المشاكل\nالقدرة على تحمل ضغط العمل\nحسن الاستماع و التواصل مع الآخرين بمهنية وبلباقة\nتنظيم الوقت والدقة في إنجاز العمل"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Medina, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Merchandising",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}