{
    "Job ID": "4748780",
    "Description": "Job TypeFull-Time / Remote (Within Dubai) / 1 Position Available\nHours To Be DeterminedJob DescriptionTravelyfe, a lavish travel and transportation company based in Dubai, is in search of a committed and adept Creative Social Media Content Creator & Manager. This full-time permanent role transcends mere content creation; it calls for a genuine devotion to encapsulating the allure of exotic destinations through masterful storytelling. Our goal is to captivate our diverse audience across multiple platforms, including TikTok, YouTube, Instagram, Facebook, and Twitter/X. Your contributions will help paint vivid narratives that inspire exploration, discovery, and, ultimately, bookings for adventures with Travelyfe. If this sounds like a role tailored to your skills and passions, we are eager to delve deeper into what makes you the ideal candidate for our team.Job Duties:Crafting Content: Develop engaging and delightful content for our social media channels and website blog.\nMulti-Format Creativity: Produce a variety of content types, including but not limited to videos and infographics, to diversify our content offerings.\nInterdepartmental Collaboration: Work closely with other departments and colleagues to ensure a cohesive and impactful brand voice.\nInnovation: Continuously explore new digital content formats and strategies to keep our brand at the forefront of the industry.\nResearch: Act as the company's in-house \"Sherlock Holmes,\" investigating travel trends, consumer behaviour, and other relevant data to inform content strategy.\nSEO Practices: Implement SEO best practices to enhance the visibility of our content on search engines.\nAnalytics: Regularly monitor content performance through analytics tools, making data-driven adjustments as necessary.Company Perks & Benefits:Employee Discounts: Special discounts on Travelyfe services.\nWork-Life Balance: Consideration for personal needs and flexibility in scheduling.\nCompetitive Salary: Attractive salary package with potential performance bonuses.\nCareer Growth: Opportunities for ongoing professional development, career progression and training.Salary Range:Between AED 4,000.00 to AED 6,000.00 per month based on experience.Got What It Takes?If you're passionate about blending your content creation skills with the dynamic and diverse world of travel, we're excited to meet you. To set yourself apart, we invite you to create a captivating well-edited 60-second TikTok video that showcases a location in Dubai, delving into its offerings and historical significance. When submitting your application, please include the TikTok video link in the designated field. Don't forget to attach your resume and portfolio to complete your application. We wish you a safe journey and look forward to the possibility of welcoming you to our team soon.Other Information:Travelyfe is committed to fostering an inclusive and diverse work environment. We believe in investing in our employees and ensuring a respectful, rewarding, and positive workplace culture.To apply, please submit your resume, and any relevant information, licenses or certifications. Only shortlisted candidates will be contacted for interviews.If you have a genuine passion and wish to be part of a team that takes pride in excellence, we encourage you to apply for this exciting opportunity with Travelyfe.Skills",
    "Skills": [
        "Job Requirements:",
        "Experience: 1 to 2 years of experience in content creation, bonus points for experience in the travel and tourism sector.\nLocation: Candidates must either be currently residing in Dubai or willing to relocate at their own expense. Travelyfe does not provide accommodation or a relocation package but will assist with the work visa and its related benefits.\nCommunication Skills: Excellent communication skills in English; knowledge of Arabic is advantageous.\nDeadlines And Multitasking: Ability to work under tight deadlines and manage multiple projects simultaneously.\nAttention To Detail: An eye for detail and branding consistency.\nStorytelling: Excellent storytelling as well as writing and editing skills.\nPlatform Expertise: Proven experience in creating engaging short-form informational content on TikTok, YouTube, Instagram and Facebook.\nContent Management: Proven ability to create and manage successful content, with particular expertise in using Notion, our primary platform for content storage and organisation.\nTechnical Skills: Strong proficiency in video editing software such as TikTok, CapCut, Adobe Premiere Pro, or Final Cut Pro; familiarity with Canva, Adobe Photoshop and Adobe Illustrator. Experience with audio recording and mixing is a plus.\nPortfolio: A digital portfolio showcasing the ability to create compelling travel-related content.\nSEO Knowledge: Familiarity with SEO best practices to make content rank highly in search results.\nBlog Writing: Comfort with writing engaging and informative blogs; bonus for experience with WordPress.\nCultural Sensitivity: A genuine interest in exploring the world and understanding diverse cultures.\nTeamwork: Strong communication skills and the ability to thrive in a collaborative environment."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Marketing; Graphic Design; Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}