{
    "Job ID": "4748427",
    "Description": "Production Supervisor (Joinery / Carpentry)Position Overview:The Production Supervisor in Joinery / Carpentry is a key role in ensuring the efficient and effective manufacturing of joinery products. This position involves overseeing daily operations, managing production teams, and maintaining high-quality standards within the joinery workshop. The Production Supervisor plays a critical role in meeting production targets, optimizing resources, and ensuring product quality.Key Responsibilities:Team Management:Led, motivated, and managed production staff in the joinery workshop.\nAssign tasks, set goals, and monitor individual and team performance.\nConduct training and development activities to enhance the skills of the production team.Production Planning:Collaborate with the production manager and project managers to develop production schedules and timelines.\nEnsure that production plans align with project requirements, deadlines, and resource availability.\nMake adjustments to schedules as needed to meet changing demands.Quality Control:Implement and enforce quality control procedures to maintain high standards of joinery product quality.\nConduct regular inspections of finished products to identify and address defects or issues.\nWork with the quality assurance team to continuously improve product quality.Resource Allocation:Allocate manpower, equipment, and materials efficiently to maximize production output.\nCoordinate with procurement and inventory teams to ensure the availability of raw materials and components.\nMonitor inventory levels to prevent shortages and excesses.Production Efficiency:Streamline production processes and workflows to optimize efficiency and minimize waste.\nIdentify and resolve bottlenecks or production delays.\nPromote a culture of continuous improvement within the production team.Health and Safety:Enforce safety protocols and ensure a safe working environment for all production staff.\nConduct safety training and address any safety concerns promptly.Documentation and Reporting:Maintain accurate records of production activities, including work orders, production reports, and quality control documentation.\nGenerate regular reports on production performance, efficiency, and quality.Problem Solving:Identify and address production-related issues, equipment malfunctions, and process inefficiencies.\nCollaborate with maintenance teams to ensure equipment reliability.Skills",
    "Skills": [
        "Bachelor's degree in Production Management, Woodworking Technology, or related field (preferred)\nMinimum 5 years proven experience as a Production Supervisor in the joinery or woodworking industry.\nIn-depth knowledge of joinery manufacturing processes, materials, and equipment.\nStrong leadership and team management skills.\nExcellent problem-solving and decision-making abilities.\nProficiency in using production management software and tools.\nUnderstanding of health and safety regulations in a manufacturing environment.\nAttention to detail and commitment to quality.\nEffective communication and interpersonal skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Fit-Out & Joinery",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}