{
    "Job ID": "4748614",
    "Description": "Our client is an ambitious and fast-growing FMCG products distribution, manufacturing and B2B ecommerce company that connects suppliers with retailers worldwide.As a part of their business expansion to Middle East region, they are setting up a regional office in Dubai and looking for a Talent Acquisition Head. This role offers a unique opportunity to build a high-performing team, shape our talent acquisition strategy, and contribute significantly to our company's growth and success.Key Responsibilities:Strategic Planning: Develop and execute a comprehensive talent acquisition strategy aligned with our regional expansion goals.\nTeam Leadership: Build and lead a talented team of recruiters and HR professionals, fostering a culture of collaboration, growth, and excellence.\nRecruitment Process: Oversee end-to-end recruitment processes, from sourcing and screening to offer management and onboarding, ensuring a seamless candidate experience.\nPartnerships: Establish and nurture strong partnerships with internal stakeholders to understand hiring needs and priorities.\nEmployer Branding: Enhance our employer brand in the market, positioning [Your Company Name] as an employer of choice in the FMCG sector.\nDiversity and Inclusion: Drive diversity and inclusion initiatives to ensure a diverse and inclusive workforce.\nMetrics and Reporting: Implement and analyze key recruitment metrics to continuously improve and optimize the hiring process.\nCompliance: Ensure compliance with regional labor laws, regulations, and company policies throughout the recruitment processSkills",
    "Skills": [
        "Bachelor's degree in Human Resources, Business Administration, or a related field; Master's degree preferred.\nProven experience in talent acquisition leadership, ideally within the FMCG or related industries.\nStrong knowledge of recruitment best practices, including sourcing strategies, interview techniques, and onboarding processes.\nExceptional leadership and team-building skills.\nExcellent communication and interpersonal abilities.\nResults-driven mindset with a focus on data and analytics.\nExperience with applicant tracking systems and HR technology.\nFamiliarity with regional labor laws and regulations."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}