{
    "Job ID": "4748634",
    "Description": "KEY RESPONSIBILITIES:Define and execute upon a vision for design and user experience within our portfolio of products\nProvide leadership using your experience with analytics, research, design methodologies and product launches\nWork closely with development team, to ensure that new product development and your design direction blend efficiently\nLead and motivate a team of talented product designers (including automotive designers, lifestyle designers, industrial designers, and other relevant roles) by providing mentorship, coaching, regular feedback and career planning\nChampion innovation and creativity within the design team, encouraging new ideas and pushing the boundaries of design excellence.\nEstablish standards and KPIs, ensure adherence, assess quality, and maximize efficiency.\nPlan and monitor the day-to-day running of Product Design team to ensure smooth progress\nStay updated with industry trends, design tools, and emerging technologies to continuously enhance the design process and output.\nConduct regular design reviews and maintain design standards to ensure a cohesive and consistent brand identity across all products.\nBalance the creative aspects of design with practical considerations such as technical feasibility, manufacturing constraints, and budgetary requirements.Skills",
    "Skills": [
        "QUALIFICATIONS & SKILLS:",
        "Bachelor’s or Master’s degree in design, Visual Arts, Automotive Industrial Design, or a related field.",
        "20+ years of proven experience in product design.",
        "Strong portfolio showcasing a wide range of design projects, including consumer products, digital interfaces, and/or physical objects.",
        "Proficiency in design software such as Autodesk alias, Rhino 3d, Render tool, Adobe Creative Suite, Sketch, etc.",
        "Deep understanding of user-centred design principles and methodologies.",
        "Excellent communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams.",
        "Strong leadership and people management skills, with the ability to motivate and inspire a creative team.",
        "Strategic thinking and the ability to align design initiatives with business goals.",
        "Experience in iterative design processes, rapid prototyping, and usability testing.",
        "Knowledge of manufacturing processes, materials, and design for manufacturability is a plus.",
        "A passion for staying up to date with design trends, industry advancements, and emerging technologies."
    ],
    "Preferred": {
        "Years of Experience": "Min: 18"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Automotive Manufacture",
        "Company Type": "Recruitment Agency",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}