{
    "Job ID": "4749316",
    "Description": "STANDARD MINIMUM QUALIFICATIONSEducation:Completion of secondary school education. A post-secondary certificate in the related functional area is desirable.  Experience:Five or more years of progressively responsible work experience in the relative business stream with experience in general administrative work. Knowledge & Skills:Demonstrating a high level of professionalism and confidentiality when dealing with sensitive information.\nThe ability to prioritize tasks, manage time, and handle multiple responsibilities while maintaining attention to detail is essential.\nBuilding and maintaining relationships with stakeholders, partners, and other relevant individuals or organizations.\nAdept at building relationships, collaborating with diverse teams, and working with people from various backgrounds and levels of seniority.\nCapable of identifying challenges, analysing situations, and proposing practical solutions to address issues that arise.\nGiven the dynamic nature of international work, being able to adapt to changing circumstances and unexpected challenges is crucial.\nProficiency in using office software (such as Microsoft Office) and possibly other specialized software or tools used within the organization.\nThe ability to gather, synthesize, and present relevant information on various topics to support decision-making.\nAccuracy in handling administrative tasks, preparing reports, and managing data is important for maintaining the quality of work.\nSkill in planning and coordinating events, workshops, meetings, and conferences. Language:Fluency in both oral and written communication in English is required, as well as in Arabic and French.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Algiers, Algeria",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}