{
    "Job ID": "4749593",
    "Description": "Develop and implement proactive solutions and cost-cutting measures.\nImprove project process by developing and implementing cost structure, and then manage job-specific code of accounts for WBS approvals.\nPrepare monthly write-ups reports for the cost performance and EAC (Estimate of Completion) forecast.\nFacilitate project team's operating expense budgets, forecast, variance comments and reporting.\nPrepare High-level dashboards/Analysis of the projects and find the root-cause.\nWork in conjunction with all department heads to ensure maximum profitability with analysis of projects and sharing ideas.\nRoll out clear cost-saving programs with timelines and assessment goals.\nProvide critical assessment of all budgets and cost projections.\nAssess all 3rd party bids for requested resources, and services to ensure the best price.\nRemain acutely aware of market trends that could affect resource costs.\nAnalyze invoices to ensure correct products/services were received at the expected cost.\nCommit to maximizing efficiency at all levels without compromising quality.\nPerform quarterly/periodic physical inventory reconciliations.\nParticipate in the development of unit standard costs and BOM's for new and existing products.\nEvaluate engineering change releases to determine applicable component level changes based on each specific with project Engineers and heads.Skills",
    "Skills": [
        "Bachelor's degree in finance or relevant field strongly preferred and or long term experience more-than 10Years.\nMinimum 10 years' experience working in cost control.\nManagement experience strongly preferred.\nOutstanding communication skills, both written and verbal\nAble to generate budgets and reports.\nStrong presentation skills, able to explain concepts.\nAble to develop strong, cooperative relationships with department heads.\nProficient in Microsoft Office & Oracle/SAP"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Residence Location": "All GCC Countries; Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}