{
    "Job ID": "4749225",
    "Description": "As a Service Manager, you will be responsible for the efficient and effective management of our service department, specifically focusing on Chinese electric vehicles. Your key responsibilities will include:Manage and lead a team of skilled technicians and service advisors.\nOversee the timely maintenance and repair of Chinese electric vehicles, ensuring high service quality.\nUphold our commitment to exceptional customer service, addressing inquiries and resolving issues.\nCollaborate closely with other departments to optimize overall dealership operations.\nDevelop and implement service procedures and policies to improve efficiency and customer satisfaction.\nMonitor and manage service department performance, including key performance indicators (KPIs) and financial goals.\nStay up to date with the latest developments in electric vehicle technology and ensure the team is trained accordingly.\nHandle escalated customer concerns and ensure their swift resolution.\nMaintain a safe and compliant working environment, adhering to all safety regulations.\nFoster a positive and motivated team culture, encouraging continuous learning and development.\nPrepare reports on service department activities and present findings to senior management.\nManage inventory and parts ordering to ensure timely repairs and maintenance.\nWork closely with the sales team to ensure a seamless customer experience from purchase to service.\nLead service department meetings and provide regular feedback and coaching to team members.Skills",
    "Skills": [
        "Proven experience in automotive service management with a successful track record.\nStrong understanding of electric vehicle technology, including charging systems, batteries, and diagnostics.\nExceptional leadership and interpersonal skills to motivate and guide the team effectively.\nPassion for delivering outstanding customer service and maintaining long-term customer relationships.\nAdaptability to thrive in a fast-paced and dynamic automotive environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}