{
    "Job ID": "4749635",
    "Description": "Lead and supervise a team of technicians in the Mechanical, Technical, and Utility department.\nEnsure the team follows standard operating procedures, safety guidelines, and quality standards.\nAssign work tasks and responsibilities to team members based on their skills and expertise.\nMonitor and manage the team's performance, providing feedback, coaching, and support as needed.\nConduct regular performance evaluations, setting performance goals and objectives for team members.\nCoordinate and prioritize work schedules to ensure timely completion of service jobs and customer requests.\nMonitor the progress of ongoing service jobs, addressing any issues or challenges that may arise.\nProvide technical guidance and support to the team, assisting in complex problem-solving and troubleshooting.\nMaintain effective communication with customers, keeping them informed about service progress and addressing their concerns.\nCollaborate with other departments, such as Parts and Sales, to ensure seamless coordination and customer satisfaction.\nIdentify training and development needs within the team and coordinate training programs to enhance technical skills and knowledge.\nEnsure compliance with warranty procedures, warranty claim processing, and documentation requirements.\nMonitor and control service-related costs, ensuring efficient utilization of resources and adherence to budgetary guidelines.\nStay updated with the latest industry trends, technological advancements, and service procedures to enhance the team's expertise.\nFoster a positive team culture, encouraging teamwork, collaboration, and a customer-centric approach.\nImplement continuous improvement initiatives to enhance service efficiency and customer satisfaction.\nHandle customer escalations and complaints, working towards effective resolution and customer retention.\nMaintain accurate service records, reports, and documentation related to team performance, service jobs, and customer interactions.\nAdhere to company policies, procedures, and ethical standards, promoting a safe and inclusive work environment.\nStay abreast of industry regulations and compliance requirements, ensuring the team's adherence to legal and regulatory obligations.\nPerform other department duties related to his/her position as directed by the Head of the DepartmentSkills",
    "Skills": [
        "Primary : Certificates from an MTU authorized training center on the following Models :",
        "路        Series 2000M ( M1+M3 )* 3 or 6 ( this will qualify the technician up to QL4 service level which means full engine overhauling ) with a dedicated on hand experience not less than 5 years .",
        "路        Series 4000M ( M1+M3) *3 or 5 ( this will qualify the technician up to QL4 service level which means full engine overhauling ) with dedicated on hand experience not less than 5 years .",
        "Additionally : ( not necessary to have but will empower technical experience ) Certificates from an MTU authorized training center on the following Models :",
        "路        Series 183M ( M1+M3)",
        "路        Series 1600G ( M1+M3) "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}