{
    "Job ID": "4749629",
    "Description": "1.   Validation of separation action in system with the documents and validate different components of calculation.2.   Validation of all recurring payments in system such as car subsidy, HRA and MGRP of Kuwaiti employees.3.   Run off cycle payroll for the leave salaries during the month.4.   Validation of monthly overtime, incentive, and other payments before running the payroll5.   Familiar with uploading employee payment information in system (New Labor accounts) monthly.6.   System data integration monitoring to ensure smooth payroll run.7.   Headcount validation before monthly payroll8.   Pay results validation for all business for monthly payroll and do the correction if it requires.9.   Monthly bank file generation - Executing Pre-DME, DME, to generate the salary files for all the banks and validate with pay register to ensure accuracy.10.   Upload monthly cash salaries in system and disbursement to business units.11.   Closely work with system consultant for any changes as and when required in the existing process or new business setups are required. End to end testing of all the scenarios before moving to production for any changes.12.   Review system process with Business HR partners on a quarterly basis to understand new requirements and change an existing process.Skills",
    "Skills": [
        "1.   A minimum of 4-6 years professional experience working on ERP Payroll systems ",
        "2.   Educated to university degree level, preferably from a business-related program, HR qualifications preferred but not essential.",
        "3.   High level of attention to detail ensuring data is accurate and precise. ",
        "4.   The successful candidate will have access to sensitive information, so a high degree of confidentiality is required.",
        "5.   Strong communication and customer facing skills, able to respond appropriately to employee queries. Arabic language skill is mandatory.",
        "6.   A high degree of energy, enthusiasm, and flexibility ",
        "7.   Highly organized and able to plan work and manage priorities",
        "8.   Well versed with Kuwait Labor law."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Nationality": "All Arab Countries; All GCC Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale; Automotive Dealership & Distributor; Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}