{
    "Job ID": "4749161",
    "Description": "Responsibilities• Overseeing all marketing efforts• Define the company's growth plans• Planning and executing the growth plans and working closely with different departments• Optimizing the revenue funnel; customer growth, acquisition, retention, and up-sell• Balance business goals and revenue targets• Work on integrated campaigns, starting with strategy, brief and working on executing and measuring performance• Ideate, test, iterate and optimize growth via paid acquisition, retargeting, and product optimizations across the web and native-app growth channels• Lead Our SEO initiatives and plans• Bring overall oversight into product & customer journeySkills",
    "Skills": [
        "Skills",
        "• marketing experience in real estate industry.",
        "• Experience with both App and Web-based paid marketing campaigns is a must.",
        "• A track record of demonstrable business results through testing and deploying effective acquisition, Activation and Retention campaigns across different channels with a trial-and-learn mindset.",
        "• Excellent project management and communication skills with the ability to balance rigorous attention to detail with swift execution.",
        "• Experienced in working with data, product & engineering teams on the marketing-tech & automation front",
        "• Excellent communication, and cross-functional skills to collaborate with all teams.",
        "• Self-motivated with an ability to think independently and analytically, comfortable working as an individual contributor, but also able to lead and motivate others toward a goal"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}