{
    "Job ID": "4749221",
    "Description": "Chief Accountant- RiyadhOur client a Saudi Consulting Company, a leader in unifying corporate, non-profit, and governmental sectors is seeking a Chief Accountant for their Riyadh Head Office.Reporting to the Support Services Director you will oversee the Finance Department, develop financial strategies, and investment decisions, help the organization with strategic planning, and ensure they comply with Saudi Arabia's financial regulations.Ensure all necessary documents, are requested, collected, and compiled.\nReview corporate, and client income tax returns.\nProvide clarity, and support through the financial/business analysis/ benchmarks to facilitate the decision-making process.\nFinancial modeling, and meaningful information consolidation.\nEnsure accurate forecast.\nMaintain accurate financial business records.\nEnsure all transactional, and tax requirements are met.\nKeep updated with changes in regulations and legislation.\nPrepare and interpret monthly management accounts and annual reports.\nImplement financial plans.\nAssess and manage risks.\nReconcile balance sheets, analyze margins, manage budgets, handle debtors, monitor cash flow statements, and predict future trends.\nConduct reviews and evaluations for cost reduction.\nAdvise business owners and individuals regarding VAT.\nMaintain and garner new client relationships.\nManage and oversee the entire accounting team, and conduct training and mentoring.Skills",
    "Skills": [
        "Bachelor’s degree in Accounting or Finance.\nQualified Accountant ACCA, CMA, or CPA\nFive years in managing finance, accounting budgeting, control, and reporting.\nFluent in English and Arabic languages both speaking, reading, and writing.\nStrong attention to detail.\nGood analytical skills.\nReporting Skills\nQualified Microsoft Suite professional with a proven track record of implementing technology in financial tasks."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 26 Max: 32"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Business Consultancy Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}