{
    "Job ID": "4749247",
    "Description": "Job Description / RoleDaily Bookkeeping.\nMonitoring Day-To-Day Business Operations And Cash Flow Transactions\nVerifying and Ensuring The Financial Transactions Are Properly Recorded And Accounted For As Per The Company System.\nPreparation Of Monthly, Quarterly, and annual Accounting Activities And Financial Reports.\nCoordination And Financial Reporting To the Department Head.\nRecording And Posting Of Accounting Entries In the Accounting System.\nCash Management Including Payment And Receipts Processing (Petty Cash, Cheque, Online Bank Transfer & Payment).\nDealing With The Suppliers, Banks And Auditors (Internal And External Audit) Payroll Processing And Payment.\nAdministrative Assistant. Collection, Purchasing.\nOther Tasks As Needed.Skills",
    "Skills": [
        "     ·           Bachelor's Degree Holder With A Proven Track Record Of Academic And Work Experience In The Finance Sector.",
        "Minimum 3 To 5 Years Gcc Experience As An Accountant.\nStrong Understanding Of Accounting Aspects Like Balance Sheets, Cash Flow Management, Business Forecast, And Profitability.",
        "       ·           Ability To Prepare Detailed And Accurate Reports Within The Given Timeframe As Per Requirements.",
        "Fluent In English And Arabic Will Be An Advantage\nOrganization And Attention To Detail.\nAnalytical And Problem-Solving Skills.\nTime Management.\nSystems Analysis.\nMathematical And Deductive Reasoning.\nProfessional Using Microsoft Office And Accounting Applications.\nCandidate Can Work Independently.\nAbility To Manage Multiple Tasks.\nCandidate Must Be Locally Available In Qatar With Valid QID & Noc.\nImmediate Joining."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Qatar",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}