{
    "Job ID": "4749096",
    "Description": "A U.S based non profit dedicated to helping individuals and families with Autism. seeking a skilled Project Manager to lead our website strategy and development efforts in a remote work environment. This is an excellent opportunity to contribute to a meaningful cause while working independently and taking full ownership of all website-related responsibilities.Responsibilities:As the sole Project Manager responsible for our website, you will be accountable for the following:Website Ownership: Take full ownership of our website, including developing a strategic vision, overseeing the creation of new web pages, and optimizing the user experience (UX/UI). Ensure regular updates and maintenance.\nVisitor Journey Optimization: Define, measure, and enhance the web visitor/prospect journey. Collaborate with the Growth Marketing team on lead scoring initiatives and Marketing Operations for traffic and lead analysis. Provide ongoing performance reports.\nAgency Project Management: Manage agency development efforts and work closely with the Brand team to ensure that new designs align with our brand guidelines.\nLanding Page Management: Lead the design and maintenance of landing pages in collaboration with the Growth Marketing team, design/development agency, and Marketing Operations.\nGlobal SEO Leadership: Drive global SEO efforts, including content audits, content updates, technical issue resolution with our agency, internal linking, and backlink strategy in partnership with our PR agency.\nCompetitive Research: Continuously research and analyze organic, paid, and content marketing efforts, offering recommendations to the Content and Growth Marketing teams to optimize their strategies.\nProject Management: Utilize strong project management skills to track and communicate project statuses, ensuring the timely delivery of personalized experiences and operational projects.\nWebsite Marketing Strategy: Develop and execute a comprehensive website marketing strategy to engage our target developer audience with our Skyflow Data Privacy Vault.\nCollaboration with Product Marketing: Collaborate closely with the Product Marketing team to ensure accurate representation of our API-driven solution's features, benefits, and use cases on the website.\nConversion Rate Optimization: Optimize website content and user experience to increase conversion rates and overall engagement metrics.\nWebsite Roadmap: Create and maintain a roadmap for website improvements, prioritizing initiatives that enhance user experiences, boost conversion rates, and drive engagement.\nDeveloper Community Engagement: Work closely with the developer relations team to promote events, webinars, and other initiatives through the website, fostering engagement within the developer community.\nSEO and SEM Best Practices: Collaborate with the Demand Gen team to implement and maintain best practices for SEO and SEM, with a focus on increasing organic traffic, generating leads, and driving conversions.Skills",
    "Skills": [
        "The ideal candidate has previous prior web marketing experience and a deep understanding of web systems and modern marketing technologies",
        "5+ years of web management experience, including maintaining websites utilizing the Webflow CMS preferred\nExpertise leading SEO efforts and campaigns, with a clear understanding of search engine algorithms, ranking methods, keyword research, measurement and data mining tools\nWell versed in analytics and tracking tools such as Google Analytics, Google Webmaster, Google Tag Manager, Hotjar, and ahrefs or similar tools\nComfortable developing and/or guiding the development of content for the web\nExcellent written, verbal, and interpersonal communication skills\nBonus points for experience in the developer and technology buyer space\nWhile this position is remote, it is preferable that the candidate be able to easily join meetings and regularly communicate with colleagues located in the US. Eastern Time\nProven experience setting channel targets and managing KPIs",
        "Benefits include:",
        "100 to 150k (PKR) Base monthly",
        "Paid Time Off",
        "Medical /Dental/ Vision Allowance",
        "Qtrly bonuses",
        "Yearly increment",
        "Remote Wok",
        "Must have :",
        "Laptop or Desktop",
        "High Speed Reliable Internet",
        "Availability from 9am to 5pm Eastern Daylight Time",
        "Time zone in New York, NY (GMT-4)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Islamabad, Pakistan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}