{
    "Job ID": "4749273",
    "Description": "Sales Supervisor - Food Service• Lead the Restaurant channel to deliver Revenue & GP Targets by analyzing, planning, and motivating the restaurant sales executives.• Achieve sales target by customer, sub-channel, category and any other quantitative target set by management.• Manage customer credit and payments; ensure timely collections and strict credit terms• Develop sales plans for each sub channel & category in accordance with company sales targets and distribution strategy• Analyze sales data to recommend, implement and administer methods and procedures to enhance the sales activities• Ensure 100% coverage of the customers by the team every month and grow QNIE share in thecustomers basket.• Regularly engage with Category team to gain knowledge on products & drive penetration of such products with the customers to maximize sales.• Gain information about Competitors products and prices in the market and share it with theconcerned individuals.• Establish and maintain the constructive relationship with all customers.Skills",
    "Skills": [
        "• Minimum 5 years in a team-handling role with a reputed organization. FMCG / HORECA exposure is an added advantage.",
        "• Mathematical and Analytical skills are pre-requisite.",
        "• Must be conversant with Excel and PowerPoint applications",
        "• Planning, Execution and Delivering desired results.",
        "• Bachelor's Degree/MBA Graduates",
        "• Qatar Driving License is a must"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5 Max: 0",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}