{
    "Job ID": "4749518",
    "Description": "Analyze balance sheets, income, cash flow statements, and other reports to assess accuracy.\nAssist with monthly closings procedures. - Assist with tax computations & returns.\nAssist the independent auditor in conducting an annual evaluation of company records.\nHandle monthly, quarterly and annual closings.\nAssist the top-level management in making critical business decisions by providing accurate financial assessments.\nCoordinate with the management and uphold the standard laws and regulations for monitoring, updating, and maintaining fiscal activities.Skills",
    "Skills": [
        "Apt in handling financial tasks like budgeting, planning, and calculating variance which reduces business expenses.\nAbility to interact with the company's management and other departments in a clear and concise manner.\nAn analytical personality, apt in understanding data by investigating the interplay between various information.\nReporting Skills\nAbility to handle relevant software like Microsoft Suite for efficient preparation of reports and statements.\nBachelor’s degree in commerce with professional certification\nAt least 5 years of overall professional experience in a reputable organization; preferable in manufacturing sector.\nGood computer skills and ERP systems\nTo be Carried out all audit related works\nGood Knowledge in IFRS\nGood communication skill in Arabic and English (Written and Verbal).\nAbility to work independently"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Residence Location": "Medina, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}