{
    "Job ID": "4749693",
    "Description": "Responsible of managing inventory levels and coordinating stock replenishment.\nReceiving new purchase materials (inventory and non-inventory) from suppliers, count, verify, storing of material and make Goods Receipt Note.\nFollow up on pending invoices to be delivered from suppliers.\nArrange all received materials properly in store locations using bin card and items codes.\nArrange all assembly components in properly and issue to technical on the basis of approved material request.\nIssuance of material to relevant department on the basis of store material requisition.\nRecording of all issued material in ERP software on daily basis.\nPack and dispatch goods to customers on the basis of customer orders.\nPreparation of Outward Gate Pass for all deliverable goods. \nCollaborate with suppliers to place orders, track deliveries, and negotiate terms.\nAll materials loading and unloading by Assistant under your supervision.\nReporting damage stock if any with valid proof to pass spoilage.\nKeep always a track and backup of good moving stocks.\nStock taking of all inventories quarterly and yearly and when instructed by the management.\nMaintain an organized and neat store layout.\nAssist in managing petty cash expenses and maintaining accurate financial records.\nServe as a liaison between various departments and external stakeholders.\nCommunicate effectively within the team to ensure smooth operations.\nIdentify operational challenges and propose solutions to enhance efficiency.\nAssist in resolving any issues related to store operations and administration.Skills",
    "Skills": [
        "Should have the experience of Store operations (Raw Material Handling, Finished Good Handling) Etc.\nShould have experience of Manufacturing Industry working within ERP environment.\nProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\nStrong organizational and multitasking abilities.\nExceptional communication skills, both written and verbal.\nAttention to detail and high accuracy in tasks.\nAbility to work collaboratively within a team as well as independently."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 21 Max: 31"
    },
    "Data": {
        "Job Location": "Alahsa, Saudi Arabia",
        "Company Industry": "Manufacturing; Pharmaceutical Manufacturing; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}