{
    "Job ID": "4749653",
    "Description": "•       Design, plan and implement all types of computer network tech that directly supports the goals of CITRA.•       Revamping, restructuring, and implementing team-determined system standards.•       Build and test simulations to test issues within the network infrastructure.•       Work with the team to uphold and maintain the network (LAN/WAN) to its highest level of performance and promptly address issues reported by other departments/entities.•       Understand a variety of network tools and be able to deliver knowledge to CITRA’s staff if needed.•       Establish the networking environment by designing system configuration, directing system installation and defining, documenting and enforcing system standards.•       Propose, design, and implement new solutions and improve resilience of the current environment.•       Maximize network performance by proactively monitoring performance, troubleshooting network problems and outages, scheduling upgrades and providing network optimization.•       Undertake data network fault investigations and resolution in local and wide area environments using information from multiple sources. Providing Root Cause Analysis in case of network incidents is a must with professional documentation reports.•       Secure network systems by establishing and enforcing policies and defining and monitoring access.•       Report network operational status by gathering and prioritizing information and actively contributing and participating in projects as guided by CITRA.•       Upgrade data network equipment to the latest stable firmware releases.•       Configure all network equipment (including but not limited to routers and switches) and hosted IP voice services. Cabling/patching/labeling is a major part of the scope of work.•       If needed, provide remote support to CITRA’s on-site engineers and end users/customers in other CITRA’s locations.•       Provide troubleshooting and fault finding if issues occur.•       Undertake capacity management and audit of IP addressing and hosted devices within data centers.•       Liaise with project management teams, third-line engineers and service desk engineers on a regular basis and based on CITRA’s policies and business processes.•       Network/related items inventory management is a major part of the scope of work•       Provide training and knowledge transfer for CITRA’s employees.•       Provide detailed manuals and documentations for the tasks within the scope of work.•       Design a reliable and fully redundant network implementing various routing protocols OSPF, BGP, EIGRP.Skills",
    "Skills": [
        "Required Qualifications and Certifications",
        "• A bachelor's degree in Computer Engineering, Computer Systems Engineering, Network Engineering, Information Technology, Computer Science or other IT-related field of study. (Must)",
        "• Cisco Certified Network Professional (CCNP), Routing, Switching and Troubleshoot (Must)",
        "• Cisco Certified Collaboration (CCNA) (recommended)",
        "• Cisco Certified Wireless (CCNA) (recommended)",
        "• Cisco Certified Cloud (CCNA) (recommended)",
        "• Cisco Video Network Specialist (recommended)",
        "• Data Center Virtualization Essentials (recommended)",
        "• Cisco Certified Design Associate (CCDA) (recommended)",
        "Skills & Experiences",
        "• Excellent communication skills",
        "• A minimum of 10 years’ experience in IT & Networking",
        "• Ability to work and to complete tasks during working hours, after working hours and during weekends/public holidays…etc.",
        "• Ability to work and complete tasks individually and together with teams",
        "• Comprehensive knowledge in programming",
        "• Very good hands on experience using cisco switches (access, layer 3, distribution, Nexus), routers, Call managers, Wireless controllers, Access controllers",
        "• Ability to manage and configure hybrid and heterogenous networks",
        "• Ability to work under stress and multiple tasks",
        "• Professional in writing manuals",
        "• Professional in writing Incident reports",
        "• Professional in knowledge transfer",
        "• Expert in doing search/research",
        "• Professional problem solver",
        "• Very good planning skills",
        "• Very good organization skills",
        "• Very good hands on experience using/reading logs",
        "• Working knowledge of MPLS and other WAN topologies",
        "• Working knowledge of IPSEC Site-to-site VPN",
        "• Proven experience solving complex problems and making impactful decisions",
        "• Comprehensive knowledge on ADSL configuration and installation",
        "• Professional hands on experience using different network monitoring tools and programs.",
        "• Ability to develop and to provide recommendations based on International and well known. standards to maintain the stability of the network and to maximize the network performance."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}