{
    "Job ID": "4749569",
    "Description": "We are seeking an experienced Toys sales and distribution Manager with related Toys industry experience to lead and optimize our distribution operations within the Toys & Leisure wholesale industry. The ideal candidate will be responsible for efficiently managing the flow of toys from manufacturers to our warehouses and ultimately to our retail partners. The Sales & Distribution Manager will play a pivotal role in ensuring timely deliveries, inventory control, and maintaining high-quality standards in the distribution process.Key Responsibilities:Distribution Strategy: Develop and implement a strategic distribution plan tailored to the unique needs of the toy wholesale industry.Team Leadership: Supervise and lead a team of distribution professionals, including warehouse staff, drivers, and logistics coordinators.Inventory Management: Monitor and maintain optimal toy inventory levels, minimizing overstock and stockouts.Supplier Relations: Collaborate with toy manufacturers and suppliers to ensure on-time product availability and quality control.Logistics Optimization: Efficiently manage transportation routes, carriers, and modes to reduce costs and improve delivery efficiency.Quality Assurance: Ensure that toys are handled, stored, and shipped according to safety and quality standards.Performance Metrics: Establish and track KPIs to evaluate and enhance distribution efficiency, accuracy, and timeliness.Cost Control: Develop and manage the distribution budget while seeking cost-effective solutions.Regulatory Compliance: Stay up-to-date with industry regulations and ensure adherence to safety and compliance standards.Continuous Improvement: Identify opportunities for process improvement and implement best practices specific to the toys wholesale sector.Skills",
    "Skills": [
        "Proven experience in sales & distribution management, with a minimum of 5 years in a leadership role within the toys & Leisure wholesale industry.\nComprehensive knowledge of toys distribution processes, logistics, and inventory management.\nStrong leadership, team management, and interpersonal skills.\nAnalytical mindset with problem-solving abilities.\nProficiency in relevant software and tools, such as ERP systems and logistics software.\nFamiliarity with safety and quality standards in the toys industry."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "As Salimiyah, Kuwait",
        "Company Industry": "Retail & Wholesale; Business Support Services; Distribution, Supply Chain & Logistics",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}