{
    "Job ID": "4749543",
    "Description": "JOB REQUIREMENTS Engineering Degree (BSEE / BEng preferred) with >15 years of relevant experience in chemical / refinery / gas plant maintenance / inspection / engineering / commissioning. \nExperience in Front End Loading and Detailed Design engineering project development through to construction and commissioning. \nKnowledge and application of industry codes and standards applicable to Oil and Gas and Refining Industries (API, ISA, NEC / IEC, NFPA, ASME, etc.) and preferably also Saudi Aramco standards and working practices. \nExperience in leading and guiding teams of experts with the ability to review and comment effectively on technical documents such as narratives, procedures, data sheets, drawings and schematic diagrams as well as following and marking up of P+IDs is essential. \nExperience in the following areas is highly desirable: Steam, Gas and Power control systems in particular Gas and Steam Turbine machinery.\nDemonstrated “hands-on” ability to configure, troubleshoot, and identify design and construction including commissioning requirements for various plant machinery following modifications. \nExperience with Bently Nevada and Woodward CCS and field devices. Experienced in engineering modifications to machinery settings a key machinery components requirement replacement/upgrade as a result of modifications.\nKnowledge & appreciated understanding of the principles of Functional Safety, experienced in HAZOP & HAZID workshops and working with EPC engineering teams in design development. \nCandidates should possess demonstrated troubleshooting and problem-solving skills, and an ability to think logically and systematically in an efficient manner.   \nEmphasis placed on safety, teamwork, and aptitude toward challenging work. Skills related to outage planning, organization and communication are highly desirable. Good interpersonal and teamwork skills with the ability to communicate clearly and effectively throughout all levels within the organization. \nProficiency in English speaking and writing is essential.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}