{
    "Job ID": "4749246",
    "Description": "Parts Manager - Automotive DelershipAs a Parts Manager, you will be responsible for managing the parts department, ensuring the availability of high-quality parts, and maintaining efficient inventory processes for Chinese vehicle dealerships.Key Responsibilities:Oversee the procurement, stocking, and distribution of parts for Chinese electric vehicles, maintaining optimal inventory levels.\nDevelop and maintain strong relationships with parts suppliers, negotiating favorable terms and pricing agreements.\nEnsure the quality and authenticity of parts, conducting regular quality checks and inspections.\nLead and motivate a team of parts personnel, providing guidance and training as needed.\nProcess parts orders efficiently, coordinating with service and sales departments to meet customer needs.\nMonitor and control parts department expenses to maximize profitability.\nPrepare regular reports on parts department performance and inventory status, presenting findings to senior management.\nProvide excellent customer service to internal departments and external customers, resolving parts-related inquiries and issues.\nEnsure compliance with all safety and environmental regulations related to parts storage and handling.\nIdentify opportunities for process improvement and cost reduction within the parts department.Skills",
    "Skills": [
        "Proven experience in automotive parts management, with knowledge of Chinese vehicle parts preferred.\nExceptional leadership and interpersonal skills to motivate and guide the parts team effectively.\nStrong inventory management skills, including ordering, stocking, and optimizing inventory levels.\nAbility to develop and maintain positive relationships with parts suppliers.\nA commitment to providing outstanding customer service.\nThe flexibility to thrive in a fast-paced automotive environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}