{
    "Job ID": "4749379",
    "Description": "Ensure that the crewing department budget is maintained and variances have been communicated to the Operations Manager.\nAssist Senior Management Team in forecasting, preparing, and setting up the crewing department budget.\nMaintain vessel manning costs in actual against figures and inform Operations Manager of all observed variance, underage or overage concerning the allocated budget.\nOverall in charge of all Crewing Department activity.\nAssure that the workflow for all Crewing Department staff is ongoing, not stopped, and functional by being aware of all aspects of the Crewing Department processes.\nResponsible for the crewing activities of the company’s owned/managed vessels and ensuring the vessels are manned as per the regulations and client requirements to their satisfaction with Zero downtime.\nEnsure he/she is well aware of Company policies and procedures, particularly of all sections relevant to the crewing department.\nEnsure effective implementation of the Safety Management System & Control Cycles as promulgated in the internal control audit cycle to the extent of all crewing-related activities identified within various sections of Company Manuals.\nResponsible for the crewing process to ensure vessels are crewed and continuously operated with competent and qualified personnel. \nCooperate with HR department coordinators for the effective functioning of the crewing department.\nEnsure that proper familiarization, mentoring, and coaching of all crewing department personnel is completed and performed. \n24x7 Point of contact for all crewing requirements for all fleet vessels.\nEnsuring department KPIs are maintained and improved from previous quarters and submitted as per timelines to Operations Manager.\nBe thoroughly familiar with all aspects of the responsibilities of crewing coordinators employed in the crewing department and be able to take over any of the roles assigned to the crewing coordinator at any given time if so required by the management.\nEnsure that vessel assignment for crewing department staff is adequately identified, communicated, and updated to optimize department functioning.\n Ensure that a comprehensive, updated CRP (Crew Rotation Planner) is maintained and made available to management at all times.\nEnsure that effective retention of quality officers and Crew is maintained. \nCrew Sourcing through Agents basis vacancy identified through CRP and any additional requirements advised by Technical Manager, Operations Manager.\nEnsure adequate reference checks for officers/Crews are completed and records maintained.\n Clearly communicate the Terms and Conditions of the contract (if approved to join) to the Crew and/or crewing agency. \nVerify & Submit CV and documents for Client approval in consultation with Operations Manager / Technical Manager where required. \nIdentify crewing agencies with valid certifications, documentation, and reputation within the industry to ensure adequate available resources to the company.\n Coordinating, reviewing, and finalization of agency contracts with final approvals from the Operations Manager. \nMaintained updated records of crewing agency agreements, valid documentation, and invoicing structure. \n Maintain relevant matrices for crew documentation for area/client/operations-specific requirements with clear guidance provided to subordinate staff for effective implementation.\n Periodically verify that all crew-related documents are valid and maintained to company requirements. \nEnsure crew payroll verification is completed in consultation with the HR department. \nEnsure all payroll, invoices, and expenses by the crewing department and/or the Crew are vetted and approved before being passed to the Finance Department. \nLiaise with the HR department to assist the Crew with payroll, salary, or allowances-related grievances.\nEnsure any complaints the onboard Crew raises are adequately recorded, tracked, and closed out in cooperation with the QHSE Manager/DPA.Skills",
    "Skills": [
        "Capable of utilizing any crewing software and ensuring crewing department's effective implementation. \nCapable of measuring the department gap and conducting a proper analysis to plug the gap. \nSufficient leadership skills to contain his team to enhance the work environment. "
    ],
    "Preferred": {
        "Age": "Max: 50"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marine Transport Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}