{
    "Job ID": "4749652",
    "Description": "Key Responsibilities:Assist Dental Procedures: Assist the dental team during various dental procedures, including but not limited to examinations, cleanings, fillings, extractions, and root canals.\nPatient Care: Greet and prepare patients for treatment, take and record vital signs, and provide reassurance and support to anxious patients.\nSterilization and Infection Control: Follow strict sterilization and infection control protocols to maintain a clean and safe dental environment in compliance with MOPH guidelines.\nInstrument Maintenance: Ensure dental instruments are properly cleaned, sterilized, and organized for use. Report any malfunctioning equipment.\nDocumentation: Maintain accurate patient records, including dental charts, treatment plans, and medical histories.\nPatient Education: Provide patients with oral hygiene instructions, post-treatment care guidelines, and answer any questions they may have.\nRadiography: Perform dental radiographs (X-rays) as directed by the dentist and ensure patient safety during the process.\nInventory Management: Monitor and restock dental supplies and equipment as needed.Skills",
    "Skills": [
        "Qualifications:",
        "Certified Dental Assistant License from the Ministry of Public Health (MOPH) in Qatar is mandatory.\nBachelor Degree in General Nursing .\nPrevious experience as a Dental Assistant\nKnowledge of dental procedures and terminology.\nStrong communication and interpersonal skills.\nAttention to detail and excellent organizational skills.\nAbility to work well in a team and adapt to a fast-paced environment.\nKnowledge of infection control and sterilization procedures."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 0",
        "Gender": "Female",
        "Nationality": "Philippines",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Medical Clinic",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "6"
    }
}