{
    "Job ID": "4749523",
    "Description": "Key Accountabilities•   Work with the Customer Insights Technology (CIT) team to build and maintain the technical aspects of MS Dynamics CRM (development, administration, maintenance) including but not restricted to analysis, design, estimation, development of business requirements.•   Collaborate with project and vendor teams on related projects•   Design and development of CRM modules and business processes for improved customer and staff experience.•   Support data migration from and integration with source applications•   L2/L3 troubleshooting of Dynamics CRM•   Work in a structured waterfall development as well as agile methodology•   Lead in the set-up, deployments and maintenance of all environments including production.•   Conduct code reviews, testing and work closely with QA team (where applicable) for SIT and with business for UAT•   Contribute to the overall enterprise architecture and adapt to new technology domains & associated integrations•   Support the training of new team members on existing business processes and required tools Skills",
    "Skills": [
        "Other Accountabilities",
        "•   Development experience in the .NET Framework (including Asp.NET Web API)",
        "•   Experience developing reports, dashboards forms, plugins, workflows in Microsoft Dynamics CRM",
        "•   Exposure on mobile applications via Dynamics CRM is desirable",
        "•   Extensive use of the Common Data Service SDK for writing solutions, server-side code, client applications, extensions, custom business logic, plug-ins, integration modules and custom workflow.",
        "•   Support the Installation and configuration support of on-premise (preferable)/online Dynamics CRM. ",
        "•   Strong understanding of MS Dynamics CRM functional and security framework",
        "•   Perform debugging and testing of all related code and assist with troubleshooting both development and production issues",
        "•   Understanding of web application development principles and proficient with JavaScript, HTML, CSS, XML.",
        "•   Knowledge of SOAP, REST.",
        "•   Good understanding of relational database concepts, entity framework and data-driven systems. ",
        "•   Strong knowledge of how data structures work",
        "•   SQL and Microsoft SQL Server (including SSIS/SSRS), TFS skills ",
        "•   Good understanding of Unit Testing ",
        "•   Extensive customization experience with Workflow, Business rules, Form and View Configuration, Solution Management",
        "•   Knowledge in software development lifecycle methodology",
        "•   Experience in Kingsway soft preferred",
        "•   Strong collaboration and investigative skills and the ability to cross reference information for accuracy",
        "•   Strong verbal and written skills, especially around code documentation",
        "•   Ability to work in a team environment, independently, take direction, and follow instructions.",
        "•   Ability to work under pressure, multitask and adapt quickly to changing priorities",
        "•   Banking knowledge preferred",
        " ",
        "Education",
        "Bachelor’s degree in Computer Science or equivalent"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}