{
    "Job ID": "4749597",
    "Description": "We are looking for a highly motivated and experienced Procurement Speacialist that will be responsible for the purchasing of office supplies to join our team. The ideal candidate will have a strong understanding of the office supplies industry, as well as experience in sourcing, negotiating, and purchasing office supplies for businesses.The Procurement Speacialist will be responsible for a variety of tasks, including:Sourcing office supplies: This involves identifying and contacting suppliers, researching prices and terms, and negotiating contracts.\nPurchasing office supplies: This involves placing orders, tracking shipments, and ensuring that supplies are delivered on time and in good condition.\nManaging inventory: This involves keeping track of inventory levels, ordering supplies as needed, and ensuring that supplies are stored properly.\nProviding customer service: This involves responding to customer inquiries, resolving problems, and ensuring that customers are satisfied with their orders.\nMaintaining records: This involves keeping track of orders, invoices, and other relevant documents.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in business administration, supply chain management, or a related field\n2+ years of experience in the office supplies industry\nStrong understanding of the office supplies market\nExcellent negotiation and communication skills\nExcellent English language\nAbility to work independently and as part of a team\nProficiency in Microsoft Office Suite"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 8",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}