{
    "Job ID": "4749298",
    "Description": "Executive Support:Provide high-level administrative support to senior executives, including managing calendars, scheduling meetings, and coordinating travel arrangements.\nPrepare and edit correspondence, reports, presentations, and other documents as requested by executives.\nHandle incoming phone calls and emails, responding on behalf of executives or directing them to the appropriate parties.Document Control:Develop and maintain a systematic document management system to ensure the proper storage, retrieval, and tracking of critical company documents.\nMonitor and control document versions and revisions, ensuring that documents are up to date and in compliance with organizational standards.\nEstablish and enforce document retention and disposal policies to maintain data integrity and compliance with legal and regulatory requirements.Record Keeping:Maintain accurate records of important company documents, contracts, and agreements.\nCreate and manage a secure and organized digital and physical filing system for easy document retrieval.\nTrack and report on document status, including approvals, signatures, and expiration dates.Communication and Collaboration:Serve as a liaison between executives and other departments or external partners.\nCoordinate and schedule meetings, conferences, and appointments for executives, ensuring efficient communication and follow-up.\nFacilitate effective communication flow by distributing documents, reports, and memos as needed.Confidentiality:Handle sensitive and confidential information with the utmost discretion and professionalism.\nImplement and maintain strict security protocols for confidential documents and data.Compliance:Ensure all documents are in compliance with relevant industry standards, regulations, and company policies.\nAssist in audits and compliance checks related to document management processes.Skills",
    "Skills": [
        "Bachelor's degree in business administration, office management, or a related field preferred.\nFluent in Arabic.\nProven experience as an executive assistant or document controller.\nStrong organizational skills with an acute attention to detail.\nProficiency in document management software and Microsoft Office Suite.\nExcellent written and verbal communication skills.\nAbility to handle multiple tasks and prioritize effectively in a fast-paced environment.\nStrong problem-solving and decision-making abilities.\nDiscretion and integrity in handling confidential information.",
        "The Executive Assistant / Document Controller plays a crucial role in ensuring the smooth operation of an organization by providing vital administrative support and maintaining a structured document management system. This position requires a proactive and organized individual capable of handling a wide range of responsibilities efficiently and professionally."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Qatar",
        "Gender": "Male",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 40"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}