{
    "Job ID": "4749560",
    "Description": "EDUCATION AND EXPERIENCE:10+ Years working experience\nPreferable; 3rd Level qualification in Quantity Surveying, Economics, Business, Engineering, Accounting or related disciplines\nIndustry Sector Experience, Oil & Gas, Energy, Industrial Gases ……\nContractual Form(s) experience\nExtensive technical comprehension of Construction & EPC jobs and markets, of the industry (ideally in Oil & Gas & Industrial Gas sectors)\nCompetent knowledge & understanding of contract law and commercial/contracts management\nAbility to quickly assimilate and retain data and information\nVersatile, with ability to grasp broad variety of issues (technical and economic) that span from risk management to procurement, financial reporting and management of the supply chain\nFlexibility and capability of identifying solutions\nDemonstrated awareness to details in commercial agreements and implications in highly complex environments (impact on schedule, early identification of risks and opportunities).\nCommercial writing skills to illustrate briefly, clearly and exhaustively the facts, the points of friction/misunderstanding, the probable outcome of such situation/behavior and the suggested solutions (addressing Client, Subcontractors and Vendors, partners and colleagues).\nAbility to work with or without legal resources to draft contract clauses which capture the essential commercial issues of any situation\nConversant with operating in a ‘Functionally’ structured organization.\nAnalytical skills associated with developing and utilizing performance measures and cost savings COMPETENCIES:Not limited to Excel, Word, Outlook, PowerPoint, Access for the purpose of information retrieval in spreadsheets, word processing of documents and contracts and presentations of goals and results\nExcellent knowledge of system and application for the construction and engineer industry eg. Cost Control Systems, DMS and Planning tools\nStrong management and team leadership expertise (preferably with experience in Managing and Leading a multicultural group)\nAbility to work in a multi-cultural environment\nDeveloped negotiating skills (with both internal and external counterpart)\nAbility to influence, motivate, mentor and build relationships\nStrong sense of responsibility with a professional attitude and reputation\nSolid problem solving, decision making and analytical capabilities\nProven organizational and analytical skills\nDecisive and able to remain focused and thoroughJob Details",
    "Skills": [],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Dhahran Al Janoub, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}