{
    "Job ID": "4749180",
    "Description": "Graphic Designer/MarketingCompany DescriptionWe are a U.S. company with a small team in JODDB Industrial Park Mafraq, Jordan. We have multiple online retail stores in the United States of America. Our main requirement for this position is someone who can demonstrate WRITTEN and SPOKEN fluency in the English Language. Candidates will also handle website design and graphic design. This role is a marketing role utilizing some computer science principles. Mainly using AI (MidJourney, ChatGPT) for image generation, product descriptions, and optimizing websites for a better user friendly interface for our customers. This is an ON-SITE ROLE in JODDB Industrial Park Mafraq, Jordan.Roles & ResponsibilitiesCandidates will use AI to generate pictures and third party software to edit these pictures for our retail websites.\nDesign and implement visually stunning and user-friendly website interfaces using modern web technologies such as BigCommerce, Shopify, and other third party software.\nOptimize search engine results on our online retail stores.\nYou will need to communicate with teams in the United States to understand project requirements and translate them into functional website features.\nTroubleshoot issues and perform debugging to maintain the website's functionality and resolve technical challenges.NOTE: This is an ON-SITE ROLE in JODDB Industrial Park Mafraq, Jordan.Qualifications:PROFICIENT IN ENGLISH. Candidates will work with multiple teams in the United States and fluency in the English language is a MUST. NO EXCEPTIONS.\nBachelors in Computer Science or Business (Marketing) is recommended but not required. (Recent Graduates are encouraged to apply!)\nExperience with image generation techniques, computer graphics, image processing, or related areas is a plus.\nExcellent problem-solving skills and a proactive attitude towards learning new technologies.\nEffective communication skills and ability to work both independently and as part of a team.SALARY:500 JDs/MonthNOTE: This is an ON-SITE ROLE in JODDB Industrial Park Mafraq, Jordan.Skills",
    "Skills": [
        "Computer skills\nWritten and spoken fluency in English\nProblem Solving\nGreat communication skills\nWork in a team or independently"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Mafraq, Jordan",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}