{
    "Job ID": "4749434",
    "Description": "Staff Management: Supervise, train, schedule, and evaluate housekeeping staff, including room attendants, janitors, and laundry personnel.\nCleaning and Maintenance: Oversee and participate in cleaning activities, ensuring rooms, public areas, and facilities are clean, well-maintained, and presentable.\nInventory Management: Maintain and manage inventory of cleaning supplies and equipment, ensuring adequate stock levels and efficient usage.\nQuality Assurance: Inspect rooms and public areas to ensure they meet cleanliness and hygiene standards. Address any deficiencies or issues promptly.\nGuest Satisfaction: Ensure guest satisfaction by promptly addressing requests and concerns related to housekeeping services.\nTraining: Conduct training sessions for housekeeping staff on cleaning procedures, safety protocols, and customer service standards.\nBudgeting: Assist in budgeting and cost control efforts related to housekeeping operations.\nReport Generation: Generate reports on housekeeping performance, including room occupancy and cleaning productivity.Skills",
    "Skills": [
        "Experience: Minimum 5 years of experience in housekeeping in hotels or a related field, with some supervisory experience, is often required.\nknowing how to deal with the cleaning heavy equipment is a must.\nLeadership: Strong leadership and team management skills to effectively supervise and motivate housekeeping staff.\nCommunication: Excellent verbal and written communication skills to interact with staff and guests effectively.\nAttention to Detail: Meticulous attention to detail to ensure cleanliness and maintenance standards are met consistently.\nProblem-Solving: Ability to address and resolve issues promptly, whether related to guest requests or staff performance.\nOrganizational Skills: Effective organization and time management skills to schedule staff and manage resources efficiently.\nCustomer Service: A customer-centric approach to ensure guest satisfaction and respond to their needs promptly.\nKnowledge of Cleaning Procedures: Familiarity with cleaning techniques, equipment, and chemicals used in the industry."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}