{
    "Job ID": "4749296",
    "Description": "IT Solution Bid Engineer- Kuwait/ Immediate joiner.A. Overview:To manage the writing and production of bids and quotations in response to expressions of Interest (EOIs), Pre-Qualification Questionnaires (PQQs), Invitations to Tender (ITTs) or Request for Proposals (RFPs) from potential customers. This involves leading technical and sales teams to produce winning proposals, and often managing multiple bids simultaneously.\nThis role requires extensive interaction with sales and technical staff, as well as other support functions. Interaction with partner companies will also be required.B. Accountabilities:Responsible for acting as program officer for all bids and taking responsibility for project completion and handover in liaison with Pre-Sales, Technical, Support, and Sales Members.\nMonitor and follow all bids and prepare proposals accordingly.\nPrepare and supervise all proposals and templates for sales and account Managers.\nLiaise with the concerned departments to get the relevant documents to be incorporated in the Bid.\nDesign the contents, organization and aesthetics of the bids and proposals.\nCompile complete bids with all the relevant information.\nCreate and maintain a date base of the bids submitted.\nLiaison with other departments for day- to-day activities.\nSupervise and process any additional assignment given by the Management . Skills",
    "Skills": [
        "C. Experience:",
        "At least 1/- year experience of IT ( Software/ hardware) co-ordination role within an office environment.\nExperience of reviewing, writing, editing and producing large commercial documents .\nExperience of writing, editing and producing sales and marketing material would be desirable, but not essential.",
        "D. Education :",
        "Bachelor degree in Computer , Information Technology, Electronics or equivalent.",
        "E. General Skills:",
        "Soft skills training.\nProposal writing .\nProject costing techniques .\nFluency (verbal / written) in the English and Arabic languages.\nMeticulous attention to detail and an appreciation of process and quality.",
        "F. General Remark:",
        "The role is in Diyar United Company- Kuwait.\nThe budget for this role is around KWD 300/- KWD 400/-.\nImmediate Joiners are preferable.\nArabs nationals only will be contacted.\nMale gender is a must.\nFresh graduates with relevant education background can apply."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "3"
    }
}