{
    "Job ID": "4749551",
    "Description": "Minimum Requirements and QualificationsGeneral Experience: Sound knowledge, proven skills and competencies in application of project cost control principles, methodologies and tools, supporting all phases of project execution, especially around Project Cost Control, Forecasting, Change Management and Reporting, within a large project-oriented EPC or Owner Organization. Must be able to deliver accurate cost information, reporting and guidance to management. SAP experience within Project Systems module.\nProject Controls Experience: Proven skills and experience of cost, planning and document control management for projects on global basis. Understanding of a variety of project types, structures and contract terms. This includes EPC, third party Sale of Equipment (SOE), joint ventures, capital, and cost sharing type arrangements.\nSite EPC Experience: Experience of managing similar sized projects at a construction site\nFlexibility: Potential travel internationally to other regional engineering and project sites.\nCore competencies: Commercial and technical acumen, working knowledge of project cost, planning and document management tools and systems. Working knowledge of project management, business development and finance.As a Project Controls Manager, you will have:Education – Bachelor’s degree in Engineering, Numerate or related field preferred\nMinimum of 15+ years of work experience in Project Execution / Project Controls\nAbility to work within an established team to achieve targets and goals.\nStrong organizational and time management skills.\nExcellent knowledge and proficiency with the Microsoft office suite (Excel, Word, Powerpoint, One Note)\nWorking knowledge of SAP, Primavera P6, Deltek Acumen is desirable\nExcellent oral and written English proficiency is a must. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}