{
    "Job ID": "4749574",
    "Description": "DUTIES AND RESPONSIBILITIESMaintains Project Interface Registers.\nTracking, follow up of Operations/Third Parties comments/resolution and maintaining status on Interface registers.\nDay to day support to EPC Contractors, PMT and Operations Interface team for Interface Management Software related queries/resolution, assignment of responsibilities, etc.\nCoordination with Information Management team for document transfer through QG Share drive & Lan folder links.\nEnsure RLIC Technical Package submission documents through (QatarEnergy portal) through eFSM Link.\nProvide leadership and accountability for the NFS Onshore Project with NFE EPC’s (EPC-1, EPC 2, EPC 3, and EPC 4 Contractors, NFS Offshore Contractors and other Qatargas Project Teams and Qatargas Groups.\nCoordination of the Onshore interface activities between the Project team, Third Parties and other End-users operating within RLIC.\nSupports scheduling of meetings, issue of minutes of meetings and supports close out of action items with interfacing organizations on a frequent basis, consistent with project needs.\nResponsible for generating weekly and monthly Interface reports. Provides input to weekly management reports.\nAttend Interface Weekly and Monthly meetings; attend to the Project Monthly Meeting with EPC Contractor. Ensure minutes of meetings are issued and steward close out of action including update of the Interfaces Registers and Databases.Skills",
    "Skills": [
        "EXPERIENCE:",
        "Must have 10 years minimum work experience in Oil and Gas industry with Projects.\nMinimum 5 years’ experience as Document Controller/Technical Assistant with a Major project team.\nWork experience in RLIC and other stake holders is preferred.\nProficient Information Technology (IT) skills.\nExpert level knowledge of Microsoft Excel, Word, Access, and other industry utilised databases.\nWill need to work from various locations Qatargas Head Quarters in Doha, EPC Contractors site offices in Ras Laffan, Qatargas facility in Ras Laffan."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}