{
    "Job ID": "4749555",
    "Description": "إدارة العمليات: تخطيط وإدارة جميع العمليات في المستودع بما في ذلك استلام البضائع، وتخزينها، وتوزيعها.\nالمراقبة والمخزون: مراقبة مخزون المستودع وضمان توفر المنتجات بشكل دائم وفقًا للحاجة.\nالتخزين الآمن: ضمان تخزين المواد والمنتجات بشكل آمن وفقًا للمعايير وتوجيهات السلامة.\nفحص الجودة: التحقق من جودة المنتجات والمواد عند استلامها وتوزيعها والإبلاغ عن أي عيوب أو مشكلات.\nتنسيق التسليمات: تنظيم عمليات التسليم وضمان توصيل البضائع في الوقت المناسب.\nإشراف على الفريق: إدارة وتوجيه فريق المستودع، بما في ذلك التوظيف والتدريب والتقييم.\nالتقارير والوثائق: إعداد التقارير اللازمة حول أداء المستودع والمخزون والنفقات.\nالامتثال للمعايير: التأكد من الامتثال لجميع اللوائح والمعايير القانونية والصناعية المتعلقة بإدارة المستودع.\nصيانة المعدات: الاهتمام بصيانة المعدات والأدوات المستخدمة في المستودع.Skills",
    "Skills": [
        "التعليم: درجة جامعية في إدارة الأعمال أو مجال ذي صلة.\nالخبرة: خبرة سابقة في إدارة المستودعات أو اللوجستيات.\nالقيادة: مهارات القيادة والإشراف لإدارة الفريق بفعالية.\nالتواصل: مهارات التواصل الجيدة للتفاعل مع العملاء والموردين والفريق الداخلي.\nالتخطيط: القدرة على التخطيط وتنظيم العمليات والمخزون بشكل فعال.\nالمعرفة التقنية: فهم جيد لنظم إدارة المستودع وبرامج الحاسوب ذات الصلة.\nالقرار: القدرة على اتخاذ قرارات سريعة وفعالة.\nالمرونة: القدرة على التكيف مع التغيرات في البيئة العملية.\nالالتزام بالسلامة: التزام بإتباع إجراءات السلامة وضمان سلامة العمليات.\nاللغات: يفضل وجود اللغة الانجليزية."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Alkharj, Saudi Arabia ; Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Alkharj, Saudi Arabia",
        "Company Industry": "Retail & Wholesale; Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}