{
    "Job ID": "4749570",
    "Description": "Key AccountabilitiesProject management in general, preparation or finalization of technical notes and presentations, transverse coordination with the EPC-1 Project Management Leadership Team, interface coordination and reporting for engineering, procurement, construction, pre-commissioning, commissioning, handover and completion.\nProvide daily support to the EPC-1 Area Division Managers for Utilities and Inlet/Offsites/HeRu#4/CO2 in all aspects of the works, with a strong management of change interface within the EPC-1 Project Management Leadership team and with the EPC-1 Contractor CTJV for the review and assessment of CTJV’s change requests and change orders.\nUnderstand interdisciplines dependencies to be able to make judgements on project management and technical decisions. Communicate key project management, technical issues and risks to the EPC-1 Area Division Managers for Utilities and Inlet/Offsites/HeRu#4/CO2 to facilitate mitigations /actions and decision making to maintain project schedule.\nCoordinate, prepare, review and finalize Project documents and correspondences such as: technical notes, schedule and critical paths analysis, decision records, progress reporting, outline budget, minutes of meeting, letters, memos, PowerPoint presentations, MOC trends, interface queries and agreements.\nMotivated to be based at the construction site from assignment until handovers to ensure coordination and involvement in field engineering (Site modifications), QA-QC, construction, vendor assistance, pre-commissioning, commissioning, handover and completion activities. Participate in the coordination of site activities where other EPC’s interface with EPC-1 (site visits, schedule reviews, method statement reviews etc.) and be a proposal lead when interface issues, gaps, misalignments arise.\nCoordinate inputs to the EPC-1 Project Weekly meeting, minutes of meeting and actions list, similarly with the monthly meeting with OES Start-up managers.Skills",
    "Skills": [
        "Experience required:Bachelor’s Degree in engineering – generalist engineer also acceptable.\nMinimum 15 years of experience in multicultural project execution related environment within the oil and gas industry (LNG would be a plus) with proven knowledge and experience of project management, detailed engineering, interfaces management, project controls and planning, construction and commissioning.\nStrong communication and interpersonal skills.\nExcellent written and spoken English skills.\nStrong technical and analytical skills.\nGood planning and organisational skills.\nGood influencing and negotiation skills.\nComputer literacy involving the regular use of professional office and technical applications.\n“Think out of the box” approach technical skills required to successfully perform the role."
    ],
    "Preferred": {
        "Years of Experience": "Min: 15"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}