{
    "Job ID": "4750683",
    "Description": "About UsRing N Bring is at the forefront of redefining the hospitality experience, leveraging state-of-the-art technology to transform the way hotels, restaurants, and various businesses within the sector engage with their guests. If you are a visionary Product Lead with the passion and drive to deliver industry-changing solutions, we want you on our team.Job OverviewWe are actively seeking a seasoned Product Lead to join our product team. You won't just manage our existing product line; you'll envision and execute the next big innovations in our roadmap. Your strategic thinking and leadership will shape the future of the entire hospitality experience.Key Responsibilities- Lead the development and execution of a data-driven product strategy in line with the company’s vision and business objectives.- Manage a cross-functional team, including design, development, and QA, to ensure successful roll-out of product features.- Own the end-to-end product lifecycle: from ideation and research to implementation and post-launch optimization.- Prioritize feature development, enhancements, and bug fixes based on analysis of market trends, customer feedback, and business impact.- Collaborate closely with Marketing, Sales, and Customer Support to ensure product-market fit and effective go-to-market strategies.- Use a variety of metrics and user feedback loops to continually assess both functional and business performance.Qualifications- Bachelor’s degree in Business, Computer Science, or related field; Master’s degree is a plus.- Minimum of 5 years of experience in product management, with at least 2 years in a leadership role.- Exceptional communication, leadership, and project management skills.- Proficiency in agile methodologies and tools like Jira or similar project management software.- Strong analytical abilities, including experience with user behavior analysis and A/B testing.- Proven track record in launching successful and innovative products.- Ability to think both strategically and tactically in a high-energy, fast-paced environment.Skills",
    "Skills": [
        "Qualifications",
        "- Bachelor’s degree in Business, Computer Science, or related field; Master’s degree is a plus.",
        "- Minimum of 5 years of experience in product management, with at least 2 years in a leadership role.",
        "- Exceptional communication, leadership, and project management skills.",
        "- Proficiency in agile methodologies and tools like Jira or similar project management software.",
        "- Strong analytical abilities, including experience with user behavior analysis and A/B testing.",
        "- Proven track record in launching successful and innovative products.",
        "- Ability to think both strategically and tactically in a high-energy, fast-paced environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}