{
    "Job ID": "4750349",
    "Description": "About the CompanyPOSCO International Corporation was founded as DAEWOO Industrial Corp. The company is South Korea's largest trading company and a subsidiary of POSCO GROUP. POSCO INTERNATIONAL Corporation has its head office in KOREA and its global network consists of over 100 overseas branches and subsidiaries. Its main business are Steel/Chemical/Energy/Agri Commodity and global investment business development.Position Title:      Office AssistantEmployment Type: Temporary with possibility to become permanent depending on company's requirementSalary:   From AED2500 or more monthly depending on experience and qualificationsJob Location:  Dubai, UAEJob Description:·       Perform clerical duties, maintain files, and organize documents; photocopy, scanning, etc. as needed.·       Answer phone inquiries, direct calls, and provide basic company information.·       Oversee mail deliveries, packages, and couriers.·       Assist in preparing marketing materials.·       Run general office and banking related errands.Skills",
    "Skills": [
        "·       Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)",
        "·       Knowledge in operating various office equipment",
        "·       Excellent written and verbal communication skills",
        "·       Self-directed and able to work without supervision",
        "·       Willing to work as temporary employee as needed"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Energy & Renewables",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}