{
    "Job ID": "4750476",
    "Description": "o   Responsible for preparing all required GL entries related to Bank deposits/withdrawal and any other modules entry.o   Processes the cancellation and refund of cash/credit invoices after securing all required approvals as per Magrabi policies.o   Reviews all payroll entries done by HR Department; ensures that all supporting documents and required approvals are provided before processing the transactions; prepares the monthly statement of Physicians Incentives to be included in the monthly payroll.o   Receives all invoices related to fixed assets; reviews them against the received asset; processes the entry of the asset to the fixed assets module.o   Processes the monthly GL entries of Fixed Assets depreciation.o   Responsible for Receiving the Warehouse/Stores Transactions:Reviews the purchasing order (PO), vouchers and reconcile them with the store notes (store received note).\nReviews the returned vouchers.\nReviews the journals vouchers.\nFollows up any transactions difference by coordination with storekeeper and payable accountant. o   Responsible for the Warehouse/Stores Dispensing Transactions:Reviews the dispensing voucher.\nReviews the returned vouchers.\nPrepares all dispensing accounts fields.\nReviews the journals vouchers for store transactions.·        Responsible for conducting all types of inventories. o   Prepares the GL entries related to the cash based on the documents received from the Cashier.o   Reviews other departments petty cash and prepares summary sheet to be authorize before fund.o   Records all required GL transactions, branches relations, closing journal etc.…o   Follows up with Medical Coordinating Department to avoid postponing of the journal companies' entry such as (companies' receipts & Med. report) & follows up the returned receipts for correction.o   Responsible for the limitation of the returned company claims to avoid deduction from our account.o   Performs all duties in a professional, effective and confidential manner.o   Perform other duties/tasks within the realm of his/her knowledge and ability as required and directed by immediate supervisor.Skills",
    "Skills": [
        "·Bachelor's degree in Accounting, Business Administration or equivalent professional qualifications.",
        "·Minimum two (2) years' experience in accounting work.",
        "·Working knowledge of Accounts Payable, General Ledger and Payroll.",
        "·Current knowledge of accounting procedures and systems.",
        "·Working knowledge of computerized accounting systems.",
        "·Excellent knowledge of cash management, banking and treasury  functions.",
        "·Working knowledge of spreadsheet software (Word, Excel or Quattro).",
        "·Must have good communication skills in both oral and written English."
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Medical Clinic",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}