{
    "Job ID": "4750353",
    "Description": "Responsibilities:Evaluating current recruiting procedures to determine whether they can be modified for increased efficiency and effectiveness.\nModifying current recruiting procedures or developing new procedures as needed.\nMonitoring key recruitment metrics to identify and resolve issues affecting recruiting procedures.\nSupervising and providing overall guidance to the recruitment team.\nEvaluating the performance of the recruitment team.\nRegularly attending conferences, seminars, job fairs, and other industry events to network and develop long-lasting professional relationships.\nReviewing and selecting suitable job advertising options.\nConducting interviews with job applicants and creating a shortlist of suitable candidates.\nDraft job descriptions, business contracts, and other related forms in coordination with the concerned parties.\nUpdate the team on the latest market trends and related country laws and ensure zero violation.\nPrepare business proposals, conduct research, and participate in feasibility studies.\nSearch the market and identify potential clients.\nUsing sales, business development, marketing techniques and networking to attract business from client companies.\nHeadhunting - identifying and approaching suitable candidates who may already be in work.Skills",
    "Skills": [
        "Minimum Qualifications:",
        "Bachelor's degree in human resource management, business management, or equivalent.\nat least 5-7 years’ proven experience working as a HR-Recruitment Manager, managing recruitment projects and activities, etc.\nExcellent experience and knowledge of mass recruitment and recruitment campaigns (locally & internationally overseas).\nExperience in Tendering requirements\nEffective communication skills.\nExcellent negotiation and presentation skills\nExcellent interviewing and assessment skills.\nExcellent management and leadership skills.\nSound knowledge of UAE labour laws and HR practices.\nSound knowledge in UAE market\nSound knowledge Oil and Gas industry\nOrganizational and decision-making skills.\nStrong analytical and problem-solving skills.\nArabic Speaker"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}