{
    "Job ID": "4750891",
    "Description": "Job Title: Travel Agency ManagerCompany: Skyline Travel AgencyLocation: Irbid, JordanSkyline Travel Agency is seeking a dynamic and experienced Travel Agency Manager to lead our team in Irbid, Jordan. As the Travel Agency Manager, you will play a pivotal role in overseeing the day-to-day operations of our agency, ensuring exceptional customer service, and driving growth in the travel business. If you have at least five years of experience in the travel industry, are registered with the Jordanian Travel Agency Association, and possess strong leadership skills, we invite you to apply for this exciting opportunity.Skyline Travel Agency is an equal-opportunity employer. We welcome candidates of all backgrounds and experiences to apply.Customer Service Excellence: Ensure that customers receive outstanding service by maintaining a high level of knowledge about travel destinations, products, and services.\nBusiness Development: Develop and implement strategies to increase sales, profitability, and market share. Identify new business opportunities and partnerships.\nFinancial Management: Oversee budgeting, financial reporting, and expense management to ensure the agency's financial health.\nCompliance: Ensure that the agency complies with all relevant laws, regulations, and industry standards. Maintain up-to-date knowledge of travel-related regulations.\nMarketing and Promotion: Develop and execute marketing plans to attract new clients and retain existing ones. Utilize online and offline marketing channels effectively.\nTravel Planning: Assist clients in planning and booking travel itineraries, including flights, accommodations, tours, and other travel-related services.\nSupplier Relationships: Build and maintain strong relationships with travel suppliers, negotiate contracts, and ensure favorable terms for the agency.\nDocumentation: Oversee the accurate preparation and maintenance of travel documents, itineraries, and invoices.\nCustomer Feedback: Collect and analyze customer feedback to continually improve services and resolve any issues promptly.Skills",
    "Skills": [
        "If you are a dedicated, motivated, and experienced Travel Agency Manager looking to lead a successful team in the travel industry, we encourage you to apply. Join Skyline Travel Agency in Irbid, Jordan, and be a part of our mission to provide unforgettable travel experiences to our clients.",
        "Team Leadership: Lead, motivate, and manage a team of travel consultants and support staff, fostering a positive and collaborative work environment.",
        "Qualifications:",
        "Five years or more of experience in the travel industry, with a proven track record of leadership and managerial skills.\nRegistered with the Jordanian Travel Agency Association or relevant industry associations.\nStrong understanding of travel industry trends, regulations, and market dynamics in the Jordanian context.\nExceptional communication and interpersonal skills, with the ability to build and maintain relationships with clients, suppliers, and team members.\nExcellent organizational and multitasking abilities, with a keen attention to detail.\nFinancial acumen, including budgeting and financial reporting skills.\nProficiency in travel booking software and other relevant tools.\nAdaptability and problem-solving skills, especially in handling unexpected travel disruptions.\nBachelor's degree in a related field is preferred but not mandatory."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan"
    },
    "Data": {
        "Job Location": "Irbid, Jordan",
        "Company Industry": "Tourism, Museum, & Cultural",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}