{
    "Job ID": "4750724",
    "Description": "Accountabilities & Key Roles:Drive Bank’s car to transport executives or authorized personnel and visitors.Ensure proper maintenance and cleanliness of Bank’s car at all times.Arm/disarm office alarm in the mornings/weekends for contract cleaners or vendors.Attend to minor breakdowns of office equipment, eg. photocopier, shredding machine,light bulbs etc. when necessary.Attend to errands and hand-dispatch requests as co-ordinated by Assistant Manager,Receptionist or Administrators.Daily collection of incoming mails from our post box, newspapers and periodicals fordispatch to respective departments and to prepare circulation slips for SWIFT and otherperiodicals.Receive, send, circulate, archive and file incoming and outgoing faxes for the office.Franking of mails, preparing postal franking docket for postage used and daily trips to PostOffice to send outgoing mails.Shredding of unwanted documents in the shredding bin.Replenish copier papers, pantry supplies, mineral water and coffee beans and taking care ofthe coffee machine and to ensure cleanliness in the pantry.Deposit cheques and encashment of cash.Perform switchboard duty, accompany cleaners/contractors/delivery men when they arecarrying out services within the office premise, standby for contractors after office hoursjobs, as and when required.Stock take on general office stationery e.g letterheads, envelopes, copier papers, tonersand cartridges and inform Receptionist to procure.Serve as back-up for Receptionist in handling incoming calls, registered incoming andoutgoing mails and mails by courier service, report breakdowns/faults to vendors, etc.Complies with all internal policies and procedures as well as the relevant laws andregulations, ethical standards at all times.Key Performance Indicators:Manage office registers and recordsCost savings in car related expensesContinuous improving on mailing, reception and administration supportPrompt and punctual at all times when attending to driving errandsProfessional Work ApproachMaintain AB Properties Functional & EEP ImplementationSkills",
    "Skills": [
        "Job Requirements (to be verified by HR):",
        "Education: GCE ‘O’ level.",
        "Experience: Minimum 5 years’ working experience. Good driving",
        "track records.",
        "Competencies:",
        "Basic understanding on car maintenance.",
        "Good knowledge on road directions and regulations.",
        "Able to work long hours."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Iraq",
        "Nationality": "Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}