{
    "Job ID": "4750363",
    "Description": "Successful incumbent is required to develop and execute efficient strategy for ATC Contracts & Procurement\nUltimately, position holder will work with leaders in ATC to understand the needs of our organization and ensure we achieve our supply goals in a timely & professional manner.\nWill prepare, review, negotiate, and administer contracts and purchase orders thru deployment of multinational standards.\nIdentifying new suppliers/vendors, ensuring that all purchased products and materials meet set specifications.\nConducting effective negotiations with supplier/vendors as needed\nHandle the process of pre-arrangement procurement budget in coordination with concerned stakeholders.\nPerforming regular evaluation to ATC suppliers/vendors vs. agreed on services.\nAlways ensuring approved purchases are cost-efficient and of high quality.\nProvides technical support and ensure procurement basic cycle is implemented.Duties/Responsibilities: Develop and implement new efficient procurement and sourcing strategies/policies/forms, aligning with ATC involved industries and best practices\nLead the Procurement process at all stages cross-functionally with all internal and external stakeholders\nMonitoring and enforcing the implementation of approved ATC’s contracts/procurement policies and procedures\nMaintain weekly supplier/vendors communication channels to stay on top of all outstanding/expected orders\nEnsure on-boarding documentation for all supplier/vendor have been properly completed and stored properly on the server\nPrepares and administers contracts and purchase orders with specific vendors\nPrepare contract change notices, and report the status of provider/supplier deliverables, to ensure services conform to the contract requirements\nNegotiating contracts/prices to make professional decisions in a fast-paced environment\nConfirms that all initiated contracts with vendors/suppliers’ terms, conditions and delivery dates are approved by Senior Management\nPrepare and draft purchase orders and upload in the system\nPrepare proposals, request quotes and negotiate purchase terms and conditions to the best interest of ATC\nRegular evaluation to vendor/supplier performance and resolve issues and concerns on the spot\nInspect and evaluate the quality of purchased items and resolve shortcomings\nPeriodically analyze industry and demand trends and support senior management with the development and implementation of contracting/sourcing strategies\nReviews cost proposals and pricing information\nCompares bids from vendors and determines, or assists with determination, to whom contracts will be awarded\nEvaluates vendor proposals to ensure that all requirements are met.\nMaintains database regarding vendors performance and quality of product(s).\nFollowing up the periodic maintenance of the rented cars, providing ATC's management with detailed reports in this regard and ensure that this applies in accordance with organized standards and rules.\nPerforms other related duties as assigned. Skills",
    "Skills": [
        "A bachelor’s degree in business administration, supply chain management or a similar field preferred\nProven work experience as a Procurement Specialist or similar role (Multinational Background is a Must)\nExtensive knowledge of contract principles and procedures.\nExcellent communication, interpersonal and negotiation skills\nStrong analytical thinking and problem-solving skills\nExcellent administrative skills and ability to multitask\nAttention to details\nMust demonstrate initiative and ownership of assigned responsibilities.\nProficiency in Microsoft Office and with business application software, purchasing and resource planning systems."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 10",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Maadi, Cairo , Egypt",
        "Company Industry": "Call Centers & Customer Care Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}