{
    "Job ID": "4750148",
    "Description": "We are currently seeking a highly experienced Buyer with sound market knowledge in negotiating tankers for sewerage collection, sweet water supply, irrigation water supply, sludge removal, and other water and sewerage works. The ideal candidate will have a minimum of 5 years of relevant experience and a strong understanding of the procurement process in this industry.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "- Minimum 5 years of experience as a Buyer in water and sewerage infrastructure projects, with a focus on tankers for sewerage collection, sweet water supply, irrigation water supply, sludge removal, etc.",
        "- Strong market knowledge and understanding of the procurement process in the water and sewerage industry.",
        "- Excellent negotiation and contract management skills.",
        "- Ability to analyze and evaluate supplier performance and identify areas for improvement.",
        "- Proven track record of successful procurement and cost-saving initiatives.",
        "- Strong communication and interpersonal skills to effectively collaborate with internal teams and external suppliers.",
        "- Attention to detail and strong organizational skills to maintain accurate records and manage multiple procurement activities simultaneously.",
        "- Knowledge of relevant regulations and industry standards related to water and sewerage infrastructure projects.",
        "- Proficiency in using procurement software and tools."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 5",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Water & Waste Water Treatment",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}