{
    "Job ID": "4750757",
    "Description": "Who We Are:Hewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Job Description:   ResponsibilitiesResponsible for sales of storage products and solutions in assigned territory, industry or accounts.\nSeeks out new opportunities by expanding and enhancing existing opportunities.\nDevelops pursuit plans and builds and manages the storage sales pipeline.\nContributes to proposal development, negotiations and deal closings.\nBuild sales readiness and reduces client learning curve through effective knowledge transfer in storage.\nWorks closely with and supports the Account Manager, providing technical expertise and support. Participates in client engagements up to C- level for complex solutions in smaller accounts.\nDirects and coordinates supporting sales activities related to pipeline hygiene through account managers, Presales, channel partners and other relevant stakeholders.\nEffectively uses internal sales tools to maintain a healthy pipeline and the account plan in a timely fashion.\nCollaborates across the HPE teams to deliver a consistent approach to developing business, including account planning for end to end solutions\nAssesses solution feasibility from a technical and business perspective to determine \"\"\"\"qualify-in\"\"\"\"/\"\"\"\"qualify-out\"\"\"\" status.\nNegotiates profitable deals so that the company can expand opportunities based on the existing business, and increase the company's footprint and revenue in storage.\nDrives sales of the Storage portfolio, using strong leadership and initiative to successfully prospect, negotiate and close deals.\nEstablishes a professional and consultative relationship with the client by achieving a developed understanding of the unique business needs of the client within the industry.\nInterfaces with both internal and external/industry experts to anticipate customer needs and facilitate solutions development.\nFocuses on and works with the channel to forge relationships, provide enablement of key technologies, and co-sell to end-users.\nEffectively leads, evangelizes, and helps to coordinate Storage marketing campaigns (digital/new techniques) to ensure successful launches and maintenance of campaign momentum, in alignment with the account strategy.\nActs as a trusted storage solutions consultant for the slated accounts/region.\nReinforces and articulates HPE's strategy and portfolio to partners and champions to uncover new business opportunities and contacts, including new logos when appropriate.\nEffectively uses references to craft a story that makes complex technologies seem simple and understandable for the customers.\nActively generates customer interest and understands the customer's buying trends. Links business and financial benefits with technology offerings. Illustrates the ROI & TCO advantages of HPE offerings for the customer's business.\nSupports deal closure in partnership with relevant internal stakeholders, including account managers and channel partners.Skills",
    "Skills": [
        "Education and Experience",
        "University or Bachelor's degree preferred.\nDemonstrated achievement of progressively higher quota, interface with diverse business customers.\nTypically 4-8+ years of sales experience.\nStorage related sales experience strongly desired.\nExtensive vertical industry knowledge required.",
        "Knowledge and Skills",
        "Storage Specialist- Sales Acumen & Behaviors",
        "Possesses expertise to be able to assess solution feasibility from a technical and business perspective, to determine \"\"\"\"qualify-in\"\"\"\"/\"\"\"\"qualify-out\"\"\"\" status.\nUses expertise to negotiate and drive deals, to ensure successful closure and a high win rate.\nUses client engagement skills in collaboration with account leads to propose expansive systems or service solutions to client.\nDemonstrates hunter mentality to actively pursue solution opportunities in acquisition and development accounts and to pursue new business.\nPossesses the ability to independently articulate the technical solution and the commercial benefits to the client.\nPossesses knowledge of digital and modern methods to connect and sell.\nUses storage knowledge to actively prospect within accounts, to discover or cultivate sales opportunities.",
        "Technology Focus",
        "Deep knowledge of storage, cloud, solution or service offerings as well as competitor's offerings, to be able to sell expansive systems or services and attached products.\nUnderstands the outside-in view and possesses solid knowledge of industry trends. Stays abreast of competitors and key partner/ISV solutions, including both traditional and emerging vendors. Leverages HPE's opportunities and mitigates challenges.\nUnderstands the role of IT within the area of storage. Understands how the company's solutions differentially address specific vertical industry challenges, as well as their cross-segment capabilities.\nDemonstrates high service knowledge in researching and sharing service-related information with account teams and customers.",
        "Solutions Acumen",
        "Understands the industry and market segments in which key accounts are situated, and integrates this knowledge into consultative selling.\nUnderstands services as part of strategic product sales.",
        "Partnering Acumen",
        "Understands how and when to engage different types of partners effectively, and is able to map the right partner to an opportunity.\nExpertise in mapping the right partner skills to the required storage related opportunity.\nPossesses deep understanding of the business models of service providers, to be able to engage and sell.",
        "Leadership",
        "Solid communication skills and actively supports account team with expertise, proposal support, presentations, and other customer/partner communications.\nMotivates, coaches and supports peer sales team members to ensure effective selling; counsels through selling challenges.\nUnderstands how changing requirements and unintended consequences impact success, and builds contingencies to manage these factors.\nWilling to take calculated risks in line with the vision from senior leadership.\nRecognizes and celebrates successes.",
        "Other",
        "Possesses advanced financial acumen and leverages the available tools to profile each account’s business unit.\nGood prioritization and delegation skills in order to focus on the key client opportunities.",
        "Impact/Scope",
        "Account size ranges; may work in a Small, medium, Enterprise, or corporate segment; varied sales cycle.\nAssigned average or higher size quota.",
        "Complexity",
        "May coordinate internal & external partners to deliver appropriate solution sale.\nEstablishes relationships with customer/partner at all organizational levels; able to interface with senior levels in internal and external groups.",
        "Join us and make your mark!",
        "We offer:",
        "• A competitive salary and extensive social benefits",
        "• Diverse and dynamic work environment",
        "• Work-life balance and support for career development ",
        "• An amazing life inside the element! Want to know more about it? ",
        "Then let’s stay connected!",
        "HPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}