{
    "Job ID": "4750616",
    "Description": "We are seeking a dynamic Sales Manager with expertise in SMS marketing to join our team in Doha. As a Sales Manager, you will be responsible for developing and executing effective sales strategies, leveraging your extensive network and market knowledge, and leading a dedicated sales team to achieve and exceed targets. You will play a pivotal role in promoting our SMS marketing services, building strong client relationships, and ensuring client satisfaction.Key Responsibilities:Develop and implement effective sales strategies focused on SMS marketing services.\nUtilize your extensive network and local market knowledge to identify and engage potential clients.\nLead the entire sales cycle from prospecting to closing deals, achieving and exceeding sales targets.\nEstablish and maintain strong relationships with decision makers in potential client organizations.\nConduct cold calls, presentations, and negotiations to showcase the value of our SMS marketing solutions.\nCollaborate with our internal teams to tailor marketing strategies that align with client needs.\nLeverage your digital marketing expertise to showcase the agency's capabilities and offerings.\nUtilize your strong PR skills and database to generate leads and build a solid pipeline.\nProvide exceptional account management to ensure client satisfaction and ongoing success.\nUtilize your leadership skills to motivate and guide the sales team toward achieving collective goals.\nMonitor and analyze performance metrics, utilizing your numerical skills to calculate ROIs.\nUtilize Google Analytics and other tools to refine marketing strategies and demonstrate results.Skills",
    "Skills": [
        "SMS Marketing Expertise: Proven experience in SMS marketing strategies and a track record of successful deal closures.\nDigital Marketing Proficiency: Strong understanding of digital marketing techniques, including Google Analytics and various marketing methods."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}