{
    "Job ID": "4750593",
    "Description": "Objective of PostDisseminates information regarding the GECF's objectives, policies, and decisions, using appropriate communication channels.Establishes and ensures good relations with media and other relevant international institutions and as well fair and reasonable presentation of GECF's views and actions.Main duties & responsibilitiesUnder the supervision of the International Affairs and PR Coordinator:Assists with developing and implementing the Forum’s PR strategy, yearly program, and related actions.\nKeeps an up-to-date list of international events/conferences/workshops that are of relevance to the Forum.\nMonitors news on GECF, peer energy organizations and prepares daily briefs to be submitted to the Secretary General.\nOrganizes and manages press conferences and interviews.\nAssists the media during GECF official meetings and events such as the Gas Summit, high-level meetings, interviews or conferences.\nMaintains and updates the PR and media directories - lists of journalists, news agencies, analysts, economists.\nMaintains and prepares media coverage reports.\nPrepares properly reasoned and documented responses to adverse publicity about GECF.\nResponsible for all publications (electronics or otherwise) of the Forum and monitors closely production of special publications (brochures, specialized publications, flyers, posters etc.) for strategic audiences with the objective of disseminating positive messages about the Forum.\nCooperates with technical departments for monitoring the gas market to be reported to the Secretary General and the Member Countries and prepares summaries for the website.\nEnsures adherence to GECF brand guidelines.\nAccompanies the Secretary General during his/her participation in international events if so required.\nRecommends in-house PR relevant to potential stories.\nCarries out any other tasks assigned to him/her by Secretary General as pertaining to his/her background, qualifications and position.Skills",
    "Skills": [
        "Education",
        "Advanced university degree in Journalism, Mass Communications, Media, Strategic Communication, Public Relations, International Relations, or Marketing, Energy-related discipline",
        "Work experience",
        "Minimum of eight (8) years of relevant PR  experience, preferably in the media, government, or international organizations operating in the energy and gas-related sectors.",
        "Experience in the development and execution of PR programs is a must.",
        "Preparation of articles, press releases, speeches, and other press and PR materials is essential.",
        "Language(s): Excellent command of written and spoken English. Capable of writing reports, speeches, press releases, and other relevant publications. ",
        "Age: Maximum 58."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Degree": "Master's degree",
        "Age": "Max: 58"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}