{
    "Job ID": "4750628",
    "Description": "Company Overview:With over 50 years of experience in the industry, Cybertronix is a trusted partner in the IT Infrastructure Finance and Consumer Electronics category. We are one of UAE’s largest independent distributors of products and solutions with a diversified portfolio of the industry’s most renowned brands.  Job Description:As an IT Project Sales Executive, you will play a pivotal role in driving our company's growth by identifying and securing new IT project opportunities. You will collaborate closely with our technical teams to tailor solutions that meet the unique needs of our clients. Your expertise in IT sales and project management will be essential in successfully closing deals and ensuring the successful execution of projects.Identify and qualify new business opportunities in the IT project space.\nBuild and maintain strong relationships with prospective and existing clients.\nUnderstand client requirements and collaborate with technical teams to develop customized project proposals.\nDevelop and implement sales strategies to meet and exceed sales targets.\nPrepare and deliver compelling presentations and proposals to clients.\nNegotiate contract terms and close sales deals.\nOversee the execution of projects, ensuring client satisfaction and project success.\nCollaborate with cross-functional teams to ensure seamless project delivery.\nKeep abreast of industry trends, market conditions, and competitor activities.Compensation:Salary: AED 2000-AED 4000 plus Commission(after 6 months)\nCandidate should be a freelancer/ on sponsored visa.\nNo other benefits will be provided.\nPreferred candidates with own laptop.\nRemote/Office (both options are available).\nTarget 100000 per month.Skills",
    "Skills": [
        "Previous experience in telesales or sales, preferably in the IT industry.\nMinimum Qualification: Bachelors Degree.\nShould have own database.\nStrong understanding of IT products, software, hardware, and services.\nExcellent communication skills.\nAttention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}