{
    "Job ID": "4750595",
    "Description": "Position Title:             Social Media SpecialistEmployment Type:     Full TimeSalary:                        up to 8K AED all inclusive depending on experience and qualificationsJob Location:            Dubai, UAE About the Client:A Dubai-based Indian modern snack bar mainly serving samosas, other Indian snacks and sweets. Job Description:Platform Management: Manage and optimize our social media presence on platforms LinkedIn, Twitter, TikTok , You Tube and Instagram. This includes regular posting, monitoring engagement, responding to comments and messages, and building a strong online community.\nBrand Reputation Management: Monitor online conversations and respond to any potential issues or inquiries in a timely and professional manner, maintaining a positive brand image.\nInfluencer Partnerships: Identify and establish partnerships with influencers, industry experts while staying up to date with the latest social media trends and industry best practices.\nCollaboration: Coordinate with cross-functional teams, including marketing, design, and product, to ensure cohesive messaging and branding across all channels\nContent Creation: Generate compelling and visually appealing content using creative AI tools. This includes creating images, graphics, videos, and written content.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Indians\nAt least 3 years of experience as a Social Media or Marketing Specialist\nFull understanding on soc media brand awareness and impressions.\nExcellent knowledge of Facebook, Twitter, LinkedIn, Pinterest, Instagram, Google+ and other social media best practices\nUnderstanding of SEO and web traffic metrics\nExperience with doing audience and buyer persona research.\nGood understanding of social media KPIs\nMust be interested to work for 6 days per week\nSample works or portfolio links must e included in the CV"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}