{
    "Job ID": "4750637",
    "Description": "SEW EURODRIVE is a global player that keeps things moving with pioneering technologies and tailored solutions in the fields of drive and automation technology. We owe our success worldwide and across many industries to over 21,000 employees in 54 countries.Our location in Dubai, United Arab Emirates is looking for anInternal Sales Support - Order ProcessingAs a member of SEW-EURODRIVE, you will benefit from excellent career prospects in an exciting technological growth industry. Work independently to provide our customers with optimal solutions and continue developing your skills.Your tasks– Check orders from customers and process orders in the system.– Process emergency orders in a timely manner.– Verify all details of the orders including shipping instructions.– Manage customer portals and replies related to the order.– Check the Order Acknowledgments received from suppliers.– Send Proforma Invoice and follow up on payments or order changes.– Check the delivery dates and manage communication with customers on delivery date.Other responsibilities– Internal reporting – Order status– Support the sales team with tasks such as creation of service quotes, vendor registration, collection of receivables and statutory.Team Reporting Details:– Location : Jabel Ali Freezone, Dubai–Member of Internal Sales Team (Team of 7)What we offer– Attractive salary package with housing and transportation allowances–Yearly ticket to home country– Health insuranceWe look forward to your application!Skills",
    "Skills": [
        "Your qualifications",
        "– Aware of GCC and Egypt import/export custom requirements.",
        "– Bachelors degree. Diploma in Electrical, Electronics or Mechanical would be beneficial.",
        "– Experienced in the similar kind of role for minimum of 2 years",
        "– Aware of JAFZA rules and regulations, Incoterms 2020, Letter of Credit, Bank Guarantees.",
        "– Very good knowledge of Microsoft Office tools such as Outlook, Word and Excel.",
        "– Added advantage of a known ERP/CRM would be beneficial.",
        "– Quality and accuracy of information, at work",
        "– Result oriented, able to prioritize tasks, quick and efficient, able to multi-task.",
        "– Native Arabic speaking candidate with excellent English communication skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 3",
        "Gender": "Female",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}