{
    "Job ID": "4750807",
    "Description": "Duties & ResponsibilitiesDirect and oversee all aspects of the Maintenance department, including but not limited to: budgeting, scheduling, training, and employee development\nEnsure that all maintenance activities are carried out in a safe, efficient, and effective manner\nDevelop and implement policies and procedures to ensure compliance with all applicable laws and regulations\nEstablish and maintain positive working relationships with employees, contractors, and regulatory agencies\nPlan, direct, and coordinate the work of subordinates, ensuring that all work is completed in a timely and efficient manner\nMonitor and evaluate the performance of subordinates, taking corrective action as necessary\nInvestigate complaints and incidents, taking appropriate action to resolve issues\nPrepare and submit reports to upper management as required\nStay abreast of new developments in the field of maintenance and make recommendations for improvements to management\nPerform other duties as assigned\nManage the departmental budget, ensuring that all expenditures are within allocated limits\nNegotiate contracts with vendors and service providersSkills",
    "Skills": [
        "Heads of maintenance need the following skills in order to be successful:",
        "Technical skills: Maintenance professionals use technical skills to perform their duties. These skills include knowledge of tools and equipment, electrical systems, plumbing, HVAC systems and other aspects of a building’s infrastructure. Having strong technical skills can help you perform your job efficiently and safely.",
        "Communication skills: Maintenance professionals often work with a variety of people, including other maintenance staff, supervisors, engineers and other employees. Effective communication skills, including active listening, can help you build trust and understanding with others. You may also need to communicate complex information about machinery or technical processes, so it’s important to be able to explain technical information in a way that others can understand.",
        "Problem-solving skills: As a maintenance head, you may be responsible for overseeing the maintenance of several different pieces of equipment. This can include everything from small tools to large machinery. It’s important to be able to identify problems and find solutions to fix them. This can help you save time and money and keep your workplace running smoothly.",
        "Organizational skills: As a maintenance head, you need to be organized to ensure that you complete all of your tasks on time. You may also be responsible for managing the schedules of your maintenance team, so having strong organizational skills can help you manage your team effectively.",
        "Leadership skills: As a head of maintenance, you may be responsible for managing a team of maintenance workers. Leadership skills can help you to motivate your team and encourage them to work hard. You can also use leadership skills to delegate tasks and assign responsibilities to your team members."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 20"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}