{
    "Job ID": "4750754",
    "Description": "Job overview:Are you a skilled administrator with a passion for business administration, retail, and entertainment? Proud Angeles is seeking an experienced individual to join our team as an Administrator. As a brand deeply rooted in Saudi Arabia, we are ideally looking for candidates who are fluent in both Arabic and English. The position is based in Riyadh, Saudi Arabia, though remote work arrangements are possible. Anticipated starting date no later than September 30th.Qualifications:- 2+ years of experience in business administration, preferably in the retail and entertainment sectors.- Familiarity with Saudi regulations and business practices is essential.- Proficiency in both Arabic and English is mandatory.- Strong skills in Microsoft Office suite, including the ability to create reports, presentations, and templates.- Comfortable working with various software platforms and technologies, including AI tools.- Experience with software/platforms such as Zoho, Asana, Shopify, G Suite, Notion, Miro, and Linkedin and others.- Outstanding communication skills in both written and verbal forms.- Excellent time management and organizational abilities.- Proficient in conducting research and gathering relevant information.- Ability to perform data entry and maintain accurate records.- Comfortable with coordinating and collaborating with HR, accounting, and logistics partners.- Capable of taking meeting minutes and managing customer support inquiries.- Detail-oriented with strong follow-up and reminder skills.- Basic business accounting knowledge.Skills",
    "Skills": [
        "Roles and Responsibilities:",
        "- Efficiently handle filing, labeling, and document organization.",
        "- Assist in scheduling and planning activities, ensuring smooth coordination of tasks.",
        "- Collaborate with various teams, including HR, accounting, and logistics, to facilitate seamless operations.",
        "- Conduct research to support decision-making and strategic initiatives.",
        "- Perform data entry tasks accurately and maintain updated records.",
        "- Prepare meeting minutes and assist in organizing meetings.",
        "- Provide exceptional customer support, addressing inquiries and concerns.",
        "- Send follow-ups and reminders to internal and external stakeholders.",
        "Our Offering:",
        "- Competitive salary package based on qualifications and experience.",
        "- Medical insurance coverage.",
        "- Sponsorship assistance for non-Saudi nationals.",
        "- Standard work week of 5 days, with 8 hours per day.",
        "- Possibility of remote work, with occasional in-person meetings if based in Riyadh.",
        "If you are an accomplished administrator with a keen eye for detail, a strong aptitude for technology, and a passion for contributing to the growth of a dynamic brand, we invite you to apply. Join the Proud Angeles team and play a vital role in our continued success."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}