{
    "Job ID": "4750693",
    "Description": "Account Executive Sales ( Jeddah, Dammam ). JOB RESPONSIBILITIES & TASKS Duties include but are not limited to Conduct customer visits when assigned, and relay outcome of visit to Account Manager. \n  Follow up with assigned customers to assist Account Manager in securing sales orders. \n  Assist Account Manager in identifying customer needs and propose possible solutions. \n  Assist Accounts Manager in evaluating and analyzing customer complaints. \n  Provide input to Accounts Manager regarding forecast in order to assist where applicable. \n Identify any cross-selling opportunities within the assigned accounts and suggest to Accounts Manager. \n  Collect payments to maintain receivables aging and DSO ratios within the approved credit limits. \n  Assist Accounts Manager in converting assigned prospects to Marketing Qualified Prospects (MQPs), and later into customers. \n Collect feedback on competitor activities from the field, and relay to Accounts Manager to build and update competitor profiles. \n  Seek new ideas and remain updated on latest trends, technologies and processes within the field\n  Plans and carries out responsibilities with minimal direction \n  Sets priorities taking into account short and long-term needs of the business. Skills",
    "Skills": [
        "Proven Account Management skills required in order to create, maintain and enhance customer relationships\nMinimum 3 years of Account/project management experience \n  Extremely detail-oriented  Technical competence \n Motivated, goal-oriented, persistent, and a skilled negotiator \n  High level of initiative and work well in a team environment \n  Excellent written and oral communication skills \n  Handles stressful situations and deadline pressures well "
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}