{
    "Job ID": "4750577",
    "Description": "Senior Structural DesignerOverview About the job:Structural designers are responsible for the design and construction of large-scale structures. They work with a wide range of materials, including concrete, steel, wood, and other building materials. Their job is to ensure that all aspects of a structure from its foundation to its roof are structurally sound and safe for people to occupy or use.Structural designers may also be involved in the planning stages of a project. This might include working with architects and engineers to determine which materials should be used and how they should be assembled. Structural designers must understand engineering principles and know how these principles apply to different types of structures. Responsibilities:Design steel and concrete structures for such as buildings, bridges, water tanks etc.\nCreate structural models by using computer-aided design software.\nMeasure loads and pressures caused by environmental or human influence.\nFollow construction safety guidelines.\nChoose appropriate materials based on structural specifications.\nCollaborate with contractors and project managers.\nDeliver projects from scope and through to project completion.\nPrepare reinforcement concrete and structural steel 2D framing and detail drawings for projects lift and installation drawings.\nDeliver discipline specific design and drafting services that meet the project’s and applicable statutory and regulatory requirements.\nPerform design and drafting assignments on time and within budget.\nPrepare engineering drawings and documentation; check drawings and participate in project reviews as required.\nProvide technical support and assistance within the discipline team and liaise with the project team.\nFollow construction safety guidelines.\nChoose appropriate materials based on structural specifications.\nAssist and support junior personnel within the discipline team.\nIdentify issues and problems, develop appropriate solutions, and ask for assistance if required.\nMonitor on-site construction processes and supervise construction workers.\nTrack and report on project progress.\nCollaborate with contractors and project managers. Skills",
    "Skills": [
        "Education & Experience",
        "Bachelor’s degree in structural engineering, civil engineering, or equivalent field, a master’s degree is a plus.\n12+ years minimum experience.\nAt least 10 years shall have been in a designer role in the structural discipline.\nProducing design layouts, detailing and fabrication drawings\nDemonstrated ability to work independently with good initiative and interpersonal skills.\nDemonstrated experience with engineering teams to deliver complex projects whilst exceeding client expectations.\nGood knowledge of structural software CAD, SAFE, ETABS, STAAD and SAP.\nExcellent knowledge of construction methods and regulations.\nGood communication ability (both written and verbal)."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Malaz, Al, Riyadh , Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Architecture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}