{
    "Job ID": "4750631",
    "Description": "Job Description-We are seeking a detail-oriented and experienced Payable Accountant to join our finance team. As a Payable Accountant, you will be responsible for managing the accounts payable process, ensuring accurate and timely payments to vendors and suppliers.Responsibilities:Charge expenses to accounts and cost centers and control petty cash spending.\nVerify vendor accounts, pay vendors, and resolve purchase issues, invoices, or payment discrepancies.\nMonitor payroll expense claims, including salary advances and overtime payments.\nReconcile account transactions with the general ledger.\nPerform recordkeeping and prepare financial reports.\nOversee the daily operations of the accounts payable department, managing workflows, and ensuring accuracy and timeliness of payments.\nMonitor accounts and ensure that any discrepancies are identified and resolved.\nPrepare monthly and annual reports for management.\nSupport for the preparation of the annual audit.Skills",
    "Skills": [
        "Your expertise in financial management, attention to detail, and strong analytical skills will be crucial in maintaining the accuracy of our financial records and supporting our organization's financial stability.",
        "Demonstrates advanced understanding of financial accounting, reporting, planning, controlling, assurance, internal control, treasury, or investment a strong plus.\nExhibits a strong grasp of financial knowledge, that involves financial accounting, reporting, planning, treasury, and investment.\nComplete mastery of general ledger functions to track all financial transactions within an organization.\nExpertise in financial accounting, reporting, planning, controlling, assurance, and investment.",
        "Requirements and skills:",
        "Proven work experience as an Accounts Payable Specialist or similar role.\nAdvanced competency in accounting and business management software/ERPs.\nIn-depth knowledge of accounts payable principles, accounting standards, and industry regulations.\nExcellent collaboration and communication abilities.\nExtensive experience in account reconciliation.",
        "Qualification & Experience:",
        "At least 5 years experience in handling accounts payable in a multi-national company\nBachelor’s degree in accounting & finance or higher education.\nProfessional qualifications will be preferred."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Investment, Securities & Funds",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}