{
    "Job ID": "4750348",
    "Description": "Duties & Responsibilities:Develop business and marketing plans in coordination with General manager to achieve revenue goals.\nDevelop business proposals for existing and new customers.\nSearch the labor market and identify potential clients.\nArrange business meetings with prospective clients to secure businesses. Finding business partners.\nMaintain strong relationship with clients and ensure high standards of service.\nMaintain healthy business relationship between the team internally, and between the team and the external clients.\nPrepare monthly business reports as assigned by the General Manager.\nDraft business contracts, and other related forms in coordination with the concerned parties.\nUpdate the team on the latest market trends and related country laws and ensure zero violation.\nPrepare business proposals, conduct research, and participate in feasibility studies.\nResponsible for understanding the trends in his/her company’s field of specialty.·        Explain to potential customers about the various benefits offered by company services; following them up to close the business deals.·        Willingness to do or assist with any job needed within the company work.Skills",
    "Skills": [
        "Minimum Qualifications:",
        "·        Arabic Speaker",
        "·        Bachelor’s degree in business administration, HR, or any related field.",
        "Thorough knowledge of sales and administration. Market knowledge.\nMinimum 5 years’ experience of business development, Sales, Administration, Recruitment.",
        "·        Sound knowledge in UAE market",
        "·        Sound knowledge Oil and Gas industry",
        "·        Experience in Tendering requirements and registration",
        "Possess effective communication skills to interact with diverse groups of people both in writing and in speaking without getting misunderstood.\nPossess very good sales skills.\nPossess problem solving skills.\nAbility to build rapport.\nshould have the ability to build and maintain relationships and contacts in and outside the company.\nAbility to constantly generate new ideas for the company’s advancement and success.\nshould have the ability to plan for a project and follow it up to its completion.\nmust be analytical thinkers with the ability to analyze new and prospective opportunities in business.\nExcellent computer skills required. Must have experience with Microsoft Office such as Excel, Powerpoint and word."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}