{
    "Job ID": "4750221",
    "Description": "Are you a passionate and results-driven professional with a knack for ERP sales? Do you have a proven track record of cultivating client relationships and driving growth? If so, we have an exciting opportunity for you to join our dynamic team as a Senior Business Development Executive at eresource.Role Overview:As a Senior Business Development Executive, you will play a pivotal role in expanding our footprint in the UAE market by identifying and capitalizing on new business opportunities. You'll leverage your expertise in ERP sales to drive revenue growth and establish lasting client relationships.Key Responsibilities:Identify and target potential clients to initiate and nurture relationships.Develop and implement effective sales strategies to achieve and exceed sales targets.Conduct thorough market research to identify trends, competition, and opportunities.Present our cutting-edge ERP solutions to potential clients, highlighting their value propositions.Collaborate closely with our technical and sales teams to ensure smooth project handover.Maintain accurate records of sales activities and opportunities in the CRM system.Qualifications and Requirements:Minimum of 2 years of proven success in tech sales, ideally in ERP or software solutions.Bachelor's degree in Engineering, Management, Marketing, or related field (preferred).Valid driving license is mandatory.Proficiency in Arabic is a plus, but not mandatory.Excellent communication and negotiation skills.Strong networking and relationship-building abilities.Proven ability to work independently and as part of a team.Ambitious, results-oriented, and adaptable mindset.What We Offer:Competitive compensation package with performance-based incentives.Opportunity to work with a leading ERP solutions provider.Collaborative and innovative work environment.Professional growth and development opportunities.Join us in revolutionizing the tech industry by delivering transformative ERP solutions to businesses. If you're ready to take your tech sales career to the next level, we encourage you to apply.Skills",
    "Skills": [
        "Business Development; ERP Sales; Communication Skills; Proficiency in Arabic & English"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}