{
    "Job ID": "4750632",
    "Description": "•Strategically plan and manage logistics, warehouse, transportation and customer services.•Direct, optimize and coordinate full order cycle.•Make import documents according to export contracts and packing lists, including invoices and packing lists, and submit them to agents, must ensure the accuracy of documents.• Make export documents according to export contracts and letters of credit, including invoices, packing lists, certificates of origin, bills of lading, etc., and submit them to banks or customers, must ensure the accuracy of documents.• Timely deal with document problems in the import and export customs clearance process to ensure smooth. shipment and customs clearance.•Liaise and negotiate with suppliers, manufacturers, retailers and consumers.•Keep track of quality, quantity, stock levels, delivery times, transport costs and efficiency.•Arrange warehouse, catalog goods, plan routes and process shipments.•Resolve any arising problems or complaints.•Supervise, coach and train warehouse workforce.•Meet cost, productivity, accuracy and timeliness targets.•Maintain metrics and analyze data to assess performance and implement improvements.•Comply with laws, regulations and ISO requirements.•Conducting product research and sourcing new suppliers and vendors.•Sourcing materials, goods, products, and services and negotiating the best or most cost-effective contracts and deals.•Performing inventory inspections and reordering supplies and stock as necessary.•Conducting market research to keep abreast of emerging trends and business opportunities.•Inspecting stock and reporting any faulty items or inconsistencies immediately.•Updating and maintaining records of all orders, payments, and received stock.•Coordinating with the delivery team and following up on delays or orders that have been rescheduled.•Attending product launches and networking with industry professionals.•Establishing professional relationships with clients as well as vendors and suppliers.•Ensuring all stock is packaged appropriately and delivered to the correct location in a timely manner.Skills",
    "Skills": [
        "• Record of successful distribution and logistics management.",
        "• Demonstrable ability to lead and manage staff.",
        "• Proficient in standard logistics software.",
        "• Excellent analytical, problem solving and organisational skills.",
        "• Ability to work independently and handle multiple projects.",
        "• BS in Business Administration, Logistics or Supply Chain."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "China"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Automotive Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}