{
    "Job ID": "4750625",
    "Description": " Position Title:             AccountantEmployment Type:     Full TimeSalary:                         up to 10K AED all-inclusive, depending on experience and qualificationsJob Location:            Dubai, UAE About the Client:A group of companies involved in various growing industries such as equity investment, automotive, food & beverage, real estate, trading, and immigration services Job Description:Manage the company’s portfolio of investment, to record the investment activities, to analyse the possible variances and to make the necessary entries in the journals by interacting with the portfolio managers.\nPerform detailed review of the yearly audited financial statements, make plans for alternative investment options, and after properly reviewing it, document it in an appropriate manner to be reviewed by the internal and external resources\nProvide assistance in the preparation of valuation materials and to assist in monitoring of valuation procedures\nCoordinate and manage all the aspects related to the general ledger accounting for all the investment and to interact with the investment accounting system as well as the portfolio manager\nTrack AP aging and update weekly schedules for payment facilities payment of invoices due by sending bill reminder and contacting clients, process accounts and incoming payments in compliance with financial policies and proceduresSkills",
    "Skills": [
        "Qualifications:",
        "40 years and below\nBachelor’s degree in accounting, finance, business, and auditing.\nAt least 5 years UAE experience in the similar role\nMust have background with group of companies, automotive or restaurant\nMust have SAP or Oracle experience\nAdditional certification (e.g. CPA/ACCA) is a plus\nCandidates who can join immediately will be prioritized"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}