{
    "Job ID": "4750448",
    "Description": "Junior Engineer (Emiratization – NAFIS Program)3W Networks an Elsewedy Electric Company:We are the largest telecommunications, safety and security systems integrator operating in the Middle East, Africa and Asia Pacific regions providing turnkey solutions for energy, transport and telecom industries. All our telecommunications, safety and security solutions are engineered and supported locally, giving our customers the advantage of getting support for their businesses when and where they need it. We are fully integrated turnkey solutions provider in Telecommunications, Safety & security, Fiber cabling & connectivity and Automation.Job Title: Junior Engineer (Emiratization – NAFIS Program)Location: Dubai Silicon Oasis, Dubai, UAEDuration: Full TimeOffice Timings: 9AM to 6PM (5 Days Working)Role Overview:Perform a variety of executive and administrative support tasks.Participate as a multidisciplinary engineering team member.Developing electrical engineering reports, documentation, analysis and support drafting Telecom equipment drawings.Duties and Responsibilities:Supporting Lead Engineers in Dubai with their daily workload including but not limited to formatting, preparation of PRs, packing lists, Power consumption, manuals, collecting information from layouts, preparation of BOMs, datasheets, rollup documents, reviewing CRs quality and thorough understanding of Network Systems technology to be able to handle FDS, BD, GA & Wiring in the future.The role entails engineering data entry, filing, design documents, records management, submittals, and shop drawings to Project Engineers for approvals & site work.Coordination with Draftsman and Document Controller for preparation of Shop Drawings & Material submittals, respectively.Coordination of projects with the projects team and all related activities.Note:Please do not apply if you are pursuing/in between of ongoing studies. Should be able to work as a full-time employee upon successful completion of Intern Program.Skills",
    "Skills": [
        "Education and Experience:",
        "Bachelor’s degree with 1-2 years of experience or fresh graduate in Electrical/Electronics/Instrumentation or Computers.\nGood knowledge in Microsoft office tools (using outlook, Visio, Excel, word,).\nTraining courses/certifications in IT Networking like (Cisco/Networking/Cyber Security skills) to understand Telecom Systems Terminology or Familiarity with Network Topology.\nBehavioral Competencies\nDesire to continuously increase personal capabilities and engineering skills.\nAbility to effectively plan and organize.\nResults driven.\nStrong time management\nEffective communication, collaboration, and interpersonal skills\nGood knowledge in Microsoft office tools (using outlook, Visio, Excel, word,).\nBasic Electrical, IT or Networking terminologies."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Dubai, United Arab Emirates ; Sharjah, United Arab Emirates",
        "Nationality": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}