{
    "Job ID": "4750206",
    "Description": "Key Responsibilities:Value Added Tax:\nPerson is responsible to support Asst. Manager in preparing the VAT returns related to various markets like KSA, Oman and other markets as applicable. Download various standard reports from SAP system and update the VAT return.\nDuly filled the returns and also check on sample basis supplier invoices to ensure that VAT regulation is duly complied or not in supplier invoices.\nPrepare and compile the data from SAP to ensure that annual VAT compliance requirements or authority queries are addressed on a due time.\nExplore automation opportunity in various process to ensure VAT return is filled on time with accurate information.\nExcise Tax:\nCollect the required information and submit to tax consultant in registering products with tax authority\nFile periodical returns monthly, quarterly and annually as applicable by GCC markets.\nAnswer queries from tax authority on various details from time to time\nExplore automation opportunity in getting various details from SAP system and ensure timely return is filed without any delay\nAny other tax filing requirement – Assist the team in various other tax matters as required.\nAnnual corporate tax return – Provide information to tax consultant in filing annual corporate tax return as per due time.\nConsult with Tax consultants for timely update on various tax regulations in various GCC countries to ensure that all tax regulations are complied with.Skills",
    "Skills": [
        "Bachelor's degree in business administration, accounting, or a related field is preferred.\nOr, A qualified CMA or ACCA or equivalent qualification\nMandatory to have strong written and verbal communication skills in English and Arabic\nFlexibility to travel to different store locations, as required.\nAttention to detail and ability to maintain accuracy under pressure.\nAbility to work independently and as part of a team."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}