{
    "Job ID": "4750720",
    "Description": "Accountabilities & Key Roles:Monitor operations and cost procedures as well as all related transactions and follow up on the controlreports to ensure adherence to P&P.Validate/sign various requests and transactions according to the authority matrix.Ensure all audit notes are fully adhered to and closed in due time and that no recurrence exist in future.Ensure high level of customer service including the review of complaints related to operations area andresolve such to maintain the highest level of customer satisfaction.Check and approve transactions/applications as per the granted authorities to ensure that work iserror-free and adheres to P&P’s.Monitor, Carry out and handover of custody items and keys between employees in accordance tocustodian matrix and related P&P.Manage and ensure functionality of security & control systems in branch and follow up on its periodicmaintenance as necessary.Manage subordinates' personnel related issues and provide performance improvement opportunitiesaligned with work requirements.Validate ECC reports .Handle all branch operational issues related to IT, Compliance and COU.To ascertain that the branch’s employees are complying with the procedure guide on theimplementation of AML/CFT legal and regulatory texts, and that the KYC forms are properly filled.To control cash operations, transfers, and any other account-related operations.To verify transfers credited to customers’ accounts, particularly electronic transfers that do not includethe name of the originator (ordering customer), exceed a specified amount and do not follow a usualpattern, in view of the nature and size of the customer’s activities. To verify also the accounts in whichrecurrent or unusual transfers are made, and to ascertain the validity of these transfers in relation tothe veracity of their sources.To give caution and attention to checks endorsed to a third party and to bank checks that are notdeposited by the first beneficiary, as well as to traveler’s checks and checks issued by institutions inforeign countries, in addition to those in which the identity of the account holder is not specified.To inform the Compliance Unit about any unusual operations, and about the extent of the branch’scompliance with the required procedures. And report any doubtful transfer and any check deemedsuspicious that may involve money laundering or terrorist financing operations.The OM should report to the AML compliance unit as an MLRO.To ascertain that all customers filled and signed all cash transaction slip (CTS)Comply with AB Code of Conduct, related P&P and Local Laws and Regulations.Key Performance Indicators:Compliance with AML/CFT local requirements.No. of audit notes and its timely resolution.Errors Rate related to service.Compliance to P&P and Ops control guidelines.Capture of overall cash differences(shortage/excess).Skills",
    "Skills": [
        "Job Requirements :",
        "Education:",
        "- Min. of Bachelor Degree in business",
        "administration or finance from a recognized",
        "university.",
        "Experience:",
        "5 years of experience in Banking, 3 of which in",
        "branch operations.",
        "Competences:",
        "Min. of level 3 in English according to AB",
        "classification.",
        "Excellent service orientation.",
        "Ability to manage people & resolve conflict.",
        "Computer Literacy.",
        "Sufficient knowledge of AB and Central Bank",
        "P&P."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Iraq",
        "Nationality": "Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}