{
    "Job ID": "4750483",
    "Description": "• Deliver related training by teaching theory, technical principles and practical application through classroom lectures and hands-on practical training in a Refrigeration and Air Conditioning/ Automotive Workshop Environment• Developing and updating course materials and curriculum in conjunction with foundational and technical education faculty will be an essential job function.• Maintain up-to-date course outlines, objectives, assignments and tests.• Maintain accurate records of students' progress and provide them to administration when appropriate.• Design interactive, engaging, technology-enriched and applications-focused student learning experiences.• Participate fully in the academic assessment of student learning in alignment with the expectations of accreditation and governing entities.• Supervising and monitoring students' use of tools and equipment.• Observing and evaluating students' work to determine progress, providing feedback, and making suggestions for improvement.• Assume daily responsibility of housekeeping and maintenance of classrooms and laboratories.• Provide tours for prospective students, parents and other campus visitors.• Attend and participate in special events, e.g. graduation, student extra-curricular activities, advisory committee meetings, studentmove-in day, employee recognition functions, student club activities, field trips, etc.• Participate on appropriate curriculum committees.• Foster and maintain collaborative relationships with industry representatives and partners.• The instructional load may consist of day or night classes or workshop training/learning.• Work with Refrigeration team to develop and improve training facilities• Fulfill other responsibilities to meet the needs of the Institute.Skills",
    "Skills": [
        "Needs Assessment: Skilled at conducting thorough training needs assessments to identify gaps and develop targeted training programs that align with organizational objectives.\nProficient in conducting comprehensive training needs assessments, identifying gaps and tailoring learning programs to meet organizational goals effectively.\nProficient in leading dynamic training workshops, using facilitation techniques that encourage active participation and reinforce participants' grasp of the content.\nAdept at flexibly adjusting training approaches to cater to different learning preferences, ensuring effective knowledge transfer and skill enhancement.\nExperienced in employing facilitation skills to deliver captivating training sessions, ensuring participants remain engaged and comprehend the material deeply.\nWell-versed in the art of instructional design, capable of designing training materials that resonate with various learning preferences and lead to successful learning outcomes."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 26"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Vocational Education; Higher Education; Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}