{
    "Job ID": "4750937",
    "Description": "**Job Description: Senior Accountant - Food and Beverage Industry****Position Overview:**We are seeking an experienced Senior Accountant to join our team in the food and beverage industry, with a particular focus on restaurants. The ideal candidate will have a strong background in accounting, particularly in food costing, pricing and a deep understanding of the intricacies of financial management within the culinary sector. As a Senior Accountant, you will play a vital role in ensuring accurate financial reporting, cost analysis, and overall fiscal responsibility within our organization.**Responsibilities:**1. **Financial Reporting and Analysis:**  - Prepare and analyze monthly, quarterly, and annual financial statements for multiple restaurants within the organization.  - Provide insights into financial performance, highlighting trends, opportunities, and areas for improvement.  - Collaborate with the management team to create actionable plans based on financial analysis.2. **Food Costing and Inventory Management:**  - Manage and maintain accurate food cost calculations and inventory records for each restaurant.  - Work closely with culinary and procurement teams to ensure timely and accurate recording of food and beverage inventory transactions.  - Analyze and report on variances between actual and expected food costs, identifying opportunities to optimize cost-efficiency.3. **Budgeting and Forecasting:**  - Assist in the development and maintenance of annual operating budgets and forecasts for the food and beverage operations.  - Monitor actual performance against budgets, providing explanations for variances and recommending corrective actions as necessary.4. **Cost Control and Expense Management:**  - Implement effective cost control measures to streamline operational expenses while maintaining quality standards.  - Collaborate with operational teams to identify cost-saving opportunities and process improvements.5. **Financial Compliance:**  - Ensure compliance with all relevant accounting standards, regulations, and internal policies.  - Support audits by providing accurate financial data and documentation as needed.6. **Team Leadership and Collaboration:**  - Mentor and guide junior members of the finance team, fostering their professional growth.  - Collaborate with cross-functional teams, including operations, procurement, and culinary, to align financial goals with business objectives.7. **System and Process Improvement:**  - Identify opportunities to enhance financial systems, reporting tools, and processes to increase efficiency and accuracy.**Qualifications:**- Bachelor's degree in Accounting, Finance, or a related field. Master's degree or CPA designation is a plus.- Minimum of 5 years of experience in accounting, with a substantial focus on food and beverage operations, within the restaurant industry.- Strong understanding of food costing principles and inventory management in a restaurant setting.- Proficiency in accounting software and Microsoft Excel; experience with restaurant-specific software is advantageous.- Solid knowledge of accounting principles, financial reporting, and budgeting.- Exceptional analytical skills and attention to detail.- Excellent communication and interpersonal abilities, with the capacity to collaborate effectively across teams.- Strong leadership qualities and experience in mentoring junior staff.- Ability to thrive in a fast-paced and dynamic environment, adapting to changing priorities.Skills",
    "Skills": [
        "d"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}