{
    "Job ID": "4751339",
    "Description": "Position Title:                  Arts TeacherEmployment Type:        Full TimeSalary:                              up to 11.5K AED depending on experience and qualifications plus accommodation, transportation and with tuition fee discount up to 3 childrenJob Location:                 Abu Dhabi, UAE About the Institution:A private co-educational K-12-day school in Abu Dhabi.Job Description:Develop an annual and quarterly plan for the curriculum according to the content and performance standards.\nManage the educational learning process in accordance with modern learning strategies and effective learning, effectively employing educational tools according to the daily plan.\nDevelop and design various tests and exams, work on evaluating and measuring students’ performance, analyze students’ results, read national tests, study, and benefit from them in addressing weaknesses, and complete evaluation and documentation work in a timely and accurate manner.\nDeal with all students professionally and fairly, coordinating with the counselling specialist to deal with special and individual cases, and determining their needs for care and follow-up.\nInteract and coordinate with various parties to deal with educational problems, work to address them, and communicate with parents. Skills",
    "Skills": [
        "Qualifications:",
        "45 years old and below\nMust have Bachelor’s Degree in specialized subject or related fields\nMust have an educational qualification such as Teaching Diploma, PGCE, PGDE or M.Ed.\nAt least a year of experience as an Arts Teacher\nIELTS rating must be at least band 6 or is willing to take one\nBackground in American curriculum is preferable\nOpen to home country experience",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Higher Education",
        "Company Type": "Recruitment Agency",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}