{
    "Job ID": "4751662",
    "Description": "Accountabilities & Key Roles:Implementing the country credit review process based on country credit set policies& procedures.Generating executive summary reports for complex transactions. .Accessing and evaluating financial data and proposed facilities structure.Review & assess credit reports submitted by the business lines based on respectivepolicies, procedures and approved authority matrix.Recommend the (Approval/Rejection) of credit requests to the respective creditcommittee.Implement the credit rating / scoring system(s) and ensure it is upgraded timely inline with country credit head guidelines.Provide feedback / recommendations to country credit head regarding creditpolicies and procedures.Adherence to all Information Security policies and standards to protect the Bank’semployees, assets, resources and data from illegal or damaging actions byindividuals, either knowingly or unknowingly.Key Performance Indicators:Timely turn around of all received credit reports.Quality of the credit portfolio / volume of each credit ratingclass .Level of coordination between all concerned parties.Clearing related complaints and looses.Skills",
    "Skills": [
        "Education: Graduate degree in Accounting or any related field",
        "from a recognized university.",
        "Experience: 5-7 years experience in banking, of which around",
        "5 years experience in Credit issues and 2 years in a relevant",
        "business in a leading international/Regional Bank.",
        "Competences:",
        "Good in English & Arabic",
        "Interpersonal & communication skills",
        "Computer skills",
        "Solutions oriented"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Iraq",
        "Nationality": "Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}