{
    "Job ID": "4751333",
    "Description": "Detailed design and project delivery (const, engineering, & project control): Manage the engineering team to ensure specs and detailed design are as planned and according to regulations. \nLend technical expertise to ensure smooth translation of master plan into design. \nRecommend design standards that ensure cost-effectiveness and innovation \nApprove horizontal/ vertical designs after making sure they adhere to the master plan. \nDecide on any changes to the master plan once the design phase is underway – approve mission-critical changes and draw plans to minimize cost and time effects. \nManage the construction team to ensure the contractor delivers the project according to the specific design specs, timeline, and budget. \nOversee 3rd party work on construction. \nManage the project controls to ensure the project is delivered according to schedule, timeline, and quality. \nEnsure budgetary, and schedule compliance of projects. \nCross-communication between construction, engineering, and project controls. \nDecide on committing internal resources based on department labor standards and benchmarks. \nReview and recommend project timelines, and make capital and resource decisions as projects hit critical milestones. \nSet up a triage process to address any slippage in schedule or cost overruns, and mitigate the financial impact on the landed cost of the project. \nEscalate issues regarding changes to project timeline or cost to Manager, Landscape & Utilities Projects \nDevelop accurate project costing estimates for new projects, and feed  information to property development for initial studies/design \nDecide on committing delivery resources based on department labor standards and benchmarks \nDefine in agreement with procurement project requirements Skills",
    "Skills": [
        "10 years of experience in Real Estate delivery with large developers, multi-asset classes sizeable annual profits, and in-depth knowledge of GCC.\nBachelor's degree in civil/structural, civil engineering or architecture or Mechanical.\nProven ability to successfully deliver (on cost, on time, and on specs) high-profile and multiple concurrent projects.\nProfound technical knowledge (engineering) of real estate delivery processes, having managed at least one of the sub-functions directly\nDemonstrated management skills, including relationships with 3rd party suppliers (contractors, consultants, etc.)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Real Estate",
        "Company Type": "Recruitment Agency",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}