{
    "Job ID": "4751765",
    "Description": "Plan and execute digital marketing campaigns across various platforms.\nCreate engaging and relevant content for online channels.\nMonitor and analyze the performance of campaigns, using data-driven insights to refine strategies.\nManage SEO and SEM activities to improve organic search rankings and drive paid traffic.\nUtilize social media platforms to build brand awareness and engage with the audience.\nCollaborate with design and content teams to develop compelling visuals and messaging.\nStay updated on industry trends and emerging digital tools to drive innovation in campaigns.\nMeasure and report on the success of digital marketing efforts to stakeholders.Skills",
    "Skills": [
        "Bachelor's degree in Marketing, Digital Media, or a related field.\nProven experience in developing and managing digital marketing campaigns.\nProficiency in using digital marketing tools and platforms (Google Ads, Facebook Ads Manager, etc.).\nSolid understanding of SEO principles and best practices.\nFamiliarity with content management systems and social media scheduling tools.\nAnalytical mindset with the ability to interpret data and generate actionable insights.\nCreative thinking and the ability to conceptualize and execute unique campaign ideas.\nStrong written and verbal communication skills.\nDetail-oriented with excellent project management and organizational abilities.\nAbility to work in a fast-paced, collaborative environment."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}