{
    "Job ID": "4751364",
    "Description": "Who We AreKyndryl is a market leader that thinks and acts like a start-up. We design, build, manage, and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers, and our communities.The RoleHave you been wanting to get into IT but don’t have tech experience, this could be your gateway. Do you love how it feels to help someone solve a problem? Want a chance to see lots of career options up close before you choose your path forward? Then there’s a good chance you’ll love being a Customer Service Representative at Kyndryl.Being great in this job is less about your resume and more about your personality. We are looking for friendly, helpful, and empathetic people who have an interest in technology but not necessarily tech experience. As a Customer Service Representative, you’ll be the face and voice of Kyndryl, helping customers solve their problems every day.A Customer Service Representative combines the know-how of tech support with problem solving and customer service, so bring your people skills and we’ll teach you the rest. It’s a fun and fast-paced role where you’ll start learning and contributing right away. The first month, you learn the ropes and get set up with one client on production. Soon, you’ll be multi-tasking and providing interactive solutions (chat, email, MS Teams) while treating our customers to concierge-level care.You will also work with back-office teams to handle escalations. This is your chance to work alongside senior co-workers who will share their knowledge. As you interact with many different people on a variety of problems, you’ll grow your experience, skill, and grasp of what other job roles do. In addition, there are plentiful opportunities to find and work with mentors.You can become an expert with Microsoft 365, especially Excel, and get trained on a variety of different platforms. And you can earn certifications including Google Cloud, Azure, Microsoft, etc. In fact, the learning opportunities are what most people like best about this role. It’s fun, challenging, and fast-paced – you definitely won’t be bored!Your future at KyndrylThis is a true “start here, go anywhere” opportunity. As you get a close-up look at a wide variety of Kyndryl job roles, you can choose your career path. Many have moved up to the 2nd or 3rd level escalation team. Others go on to further education/certifications and more senior or technical roles.Skills",
    "Skills": [
        "Who You Are",
        "You’re good at what you do and possess the required experience to prove it. However, equally as important – you have a growth mindset; keen to drive your own personal and professional development. You are customer-focused – someone who prioritizes customer success in their work. And finally, you’re open and borderless – naturally inclusive in how you work with others.",
        "Required Skills and Experience",
        "· Knowledge of Windows, Mac, or Linux operating systems",
        "· Support help desk knowledge",
        "· Troubleshooting and problem-solving skills",
        "· Customer support knowledge",
        "· Active listener with flexibility to modify approach and adapt to customer needs",
        "Preferred Skills and Experience",
        "· Experience working with Windows, Mac, or Linux operating systems",
        "· Troubleshooting and problem-solving expertise",
        "· Support help desk experience",
        "· Customer support experience",
        "· Experience modifying approaches and adapting to customer needs",
        "Being You",
        "Diversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way."
    ],
    "Preferred": {
        "Residence Location": "Egypt"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}