{
    "Job ID": "4751882",
    "Description": "World Bank Treasury Summer Finance Internship ($20-$24/hr)All prospective applicants are encouraged to read the World Bank Treasury Student Careers portal before applying: treasury.worldbank.org/studentcareersWith us, you will not just work in financial markets: you will help create new ones.The Treasury Summer Internship Program is a junior professional training program designed to develop the skills necessary to have an exciting and rewarding career in the financial industry. The Program aims to bring exceptional college students with a demonstrated interest in a financial career to support the World Bank’s development mandate. The internship lays the foundation to become a Junior Analyst, a two-year position on one Treasury team, immediately after the intern graduates from their degree program. Interns are expected to be in their second to final year in the equivalent of a four-year college degree program. Hear directly from past interns and current junior analysts at the World Bank Treasury’s Student & Graduate Careers portal.The World Bank GroupThe World Bank Treasury is one of the few places where you can be on the leading edge of finance as it sits at the only nexus of finance, innovation, and international development. We manage the institution's finances to enable all World Bank operations and lending. Each year, we issue over $50 billion in bonds, prudently manage over $180 billion in assets, and process over $7 trillion in transactions. You can learn more at treasury.worldbank.org. The World Bank Group is one of the largest sources of funding and knowledge for developing countries; a unique global partnership of five institutions dedicated to ending extreme poverty, increasing shared prosperity and promoting sustainable development. With 189 member countries and more than 120 offices worldwide, we work with public and private sector partners, investing in groundbreaking projects and using data, research, and technology to develop solutions to the most urgent global challenges. For more information, visit worldbank.org.About the InternshipTreasury Summer Interns will work full-time for ten weeks from May 28 through August 5, 2024, in Washington, DC. Interns receive a custom onboarding program in the first week before beginning three three-week rotations across Treasury teams. Throughout the summer, interns participate in weekly discussions with the program director and attend a career perspectives speaker series to hear from various Treasury officers, managers, and directors. Interns have access to the nearly 300-employee Treasury, including meetings with the Vice President & Treasurer. Interns complete each rotation with a presentation to their respective team and complete the internship by presenting their work in a capstone project to the management team.Internship CalendarOnboarding Week: May 28 – 31Rotation 1: June 3 – June 21Rotation 2: June 24 – July 12Rotation 3: July 15 – August 2Capstone Presentation: August 5Observed Holidays: June 19, July 4Interns join on a short-term temporary contract and are paid between $20.40 (net – for non-US Citizens) and $24.60 (gross – for US Citizens) per hour for a total of 400 hours. All interns are expected to be in person, full-time, in Washington, DC, for the entire internship (May 28 – August 5). HR policies may change, but interns are expected to work at least four days in the office per week. Each intern will receive a World Bank laptop at the start of the internship. If required, the World Bank sponsors the appropriate visa for an incoming intern to work in the United States.Internship teams and work programsThe program will hire up to 16 interns across Treasury’s 16 teams this summer, and each intern will have a different rotation schedule to create a different experience. Treasury has four departments and a compliance & controls team. It is highly encouraged for applicants to read more about our organization and each team.Each team has an intern mentor and coordinator to supervise and support their work. Interns will be responsible for specific individual tasks or projects in one of Treasury’s departments and, depending on interest and skills, will perform some or all of the following:Asset Management: Create daily market reports, shadow portfolio managers to understand asset management best practices, and work on Bloomberg terminal with asset managers.\nClient Advisory: Support the engagement managersand member services through RAMP, Reserve Advisory & Management Partnership, which has over $24 billion of assets under management. Support the branding and marketing of products to central banks, international financial institutions, pension funds, and sovereign wealth funds.\nCompliance & Risk Management: Work on one of the fastest growing sectors of the financial industry through understanding operational risk, business continuity, trade compliance, and conflicts of interest risk.\nFinancial Infrastructure & Banking Operations: Shadow full-time employees who liaise with hundreds of banks and custodians and communicate complex ideas and solutions with potential and existing clients.\nFintech & Innovation: Work on the cutting edge of finance through research, presentations, and event management on leading issues in digital and cryptocurrencies.\nFinancial Solutions: Provide background research on catastrophe bonds and currency and commodity hedging products for sovereign clients, including joining calls with finance ministries and supporting client presentations.\nFunding: Participate in investor calls, observe trades across Asian, European, and American markets, and learn about the issuance programs and supporting legal documentation.\nProducts, Knowledge & Research: Organize, clean, and visualize data for internal and external reports, support subject matter experts on issues of reserve management, ESG, and more.\nSustainable Finance & Investor Relations: Draft investor presentation materials, memos, and responses to serve existing clients and investors and generate new business.\nStructured Finance & Quantitative Modeling: Apply statistical analysis, mathematics, and computational finance to support our teams in trading and structured finance, market-making operations, and asset management.\nPension Investments: Review and assess the completeness of ESG-related due diligence documents submitted by external managers that the Plans partners with.\nPension Middle Office: Review of Benchmark Transparency Analysis to identify gaps and analyze potential enhancement to the Pension Annual Report.How we evaluate applicantsWe believe poverty has no borders, and neither does excellence. With employees based in Chennai, Paris, Sofia, Singapore, Tokyo, and Washington, the World Bank Treasury represents over 60 nationalities, and our leadership team hails from all regions of the world. We are proud to be an equal opportunity and inclusive employer. We do not discriminate based on gender, race, ethnicity, religion, disability, sexual orientation, or gender identity. Treasury also has a dedicated Diversity, Equity & Inclusion Team that advises on hiring protocols, career growth, and outreach. Learn more about Treasury’s greatest strength: its diverse and dedicated staff.Any candidate who is found to have misrepresented their application may be disqualified or terminated.How to applyAll applicants must submit a one-page cover letter and a one-page resume. View articles and webinars to learn what we look for in an application. All of this is available at treasury.worldbank.org/studentcareers.The World Bank Treasury is proud of its strong community of colleagues from incredibly diverse backgrounds. Although entirely optional, applicants are encouraged to submit a maximum half-page to describe their background and how they believe this would contribute to our workplace.Successful applicants may be asked to complete a remote test before interviewing. All applicants will be notified of the result by mid-December 2023.Job Types: Full-time, InternshipPay: $20.40 - $24.60 per hourPhysical setting: OfficeSchedule: 8 hour shiftAbility to commute/relocate: Washington, DC 20036: Reliably commute or planning to relocate before starting work (Preferred)Skills",
    "Skills": [
        "Eligibility Requirements",
        "We ask that all applicants meet the following core eligibility requirements to be consistent with the program’s goals. Applicants must have these core requirements to be considered.",
        "Must be enrolled in the second-to-last year of the equivalent of a four-year college degree program in finance, business, economics, or a related field;\nMust be prepared to graduate with the equivalent of a four-year college degree between January and September 2025;\nMust be in good academic standing at their college or university;\nMust be available full-time throughout the internship;\nMust not have a concurrent employment contract or internship.",
        "Successful Applicant Profiles",
        "Demonstrated paid work experience, previous internship, or leadership in a financial organization or club is strongly encouraged;\nExcellent communication and presentation skills, both verbal and written;\nStrong interpersonal skills and ability to collaborate and develop productive relationships to achieve the team’s objectives;\nProactive, resourceful, and flexible to work on a range of assignments and adapt to rapidly changing business requirements and priorities;\nExperienced with programming languages, such as Python, or specialized software for managing and visualizing economic and financial data;\nStrong research, analytical, and quantitative skills in data management;\nDemonstrated ability to research, extract, and process financial and economic data from various source systems and repositories, especially Bloomberg, World Bank Group or International Monetary Fund databases, and online sources;\nHighest ethical standards;\nFluency in a second language is a plus.",
        "Experience: Microsoft Excel: 1 year (Preferred)",
        "Language: English (Preferred)",
        "Work Location: In person"
    ],
    "Preferred": {
        "Career Level": "Student/Internship"
    },
    "Data": {
        "Job Location": "District of Columbia, United States",
        "Company Industry": "Financial Services; Banking; Investment, Securities & Funds",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Internship",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "16"
    }
}