{
    "Job ID": "4751537",
    "Description": "Prepare quotation for RFQ's & send them through mail to customers.Handle all sorts of communication with clients on behalf of salesmanEnter new customers into the software according to the company's policy.For example, taking all relevant documents CR, VAT certificates filled up the credit application form.To articulate professional solutions, written and oral.To advise on bid / no bid decisions based on technical and commercial consideration.Work with supply chain team to ensure all orders are fulfilled on time.\nMaintaining and developing relationships with existing customers via meetings, telephone calls and emails;\nPresent reports of potential prospects to the management for aiding critical business decisions.\nEnsure achievement of all sales target and analyses all company objectives.\nManage typical conversion rate, sales call, revenue, and other reports in a precise manner for accurate evaluation.\nTake charge of promotional and sales activities by brainstorming new product or service launches with appropriate team members.\nLeveraging different promotional modes like traditional marketing, social media, email marketing, etc., to advertise the company's products.Skills",
    "Skills": [
        "Ability to analyze the goal, target customer, and challenges to overcome before planning sales-oriented activities.\nExcellent written and verbal communication skills.\nAbility to implement the 'customer first' approach by providing a personalized and convenient sales pitch.\nPerformance-driven and capable of achieving targets under pressure.\nExcellent phone and presentation skills.\nDepicting remarkable command to convert leads into customers through passionate discussions and debates."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}