{
    "Job ID": "4751744",
    "Description": "Sr. QA/QC Engineer ( Civil / Arch /Mechanical/ Structural / Electrical )Accountable for the quality and quality of every activity, precise knowledge of all aspects of engineering construction relating to Civil, Architectural, Structural, Mechanical, and Electrical disciplines interfacing the multidisciplinary processes.\nResponsible for QA/QC documents of the complete project, including certificates, calibration, test results, inspection requests, non-compliance reports and site instruction/observations, permanent materials delivered, and other important QA/QC documents.\nDevelop and determine all standards to perform inspections and tests on all procedures, oversee all testing methods, and maintain high-quality standards for all processes.\nReview the quality of all materials at the site, ensure compliance with all project specifications and quality, and collaborate with the department for all material procurement and quality materials.\nSupervise the effective implementation of all test and inspection schedules, ensure adherence to all procedures, and coordinate with various teams to perform quality audits on processes.\nAssist employees in ensuring knowledge of all quality standards, ensure compliance with all quality manuals and procedures, and collaborate with contractors and suppliers to maintain the quality of all systems.\nManage to lift all equipment, handle the efficient storage of all hazardous materials, and perform quality audits per the required schedule.\nMonitor an efficient system, record all project activities, and analyze all processes to ensure all work meets quality requirements.\nManage all work methods, maintain knowledge of quality assurance standards, monitor continuous application for all quality assurance processes, and recommend corrective actions for all operations.\nDevelop a method statement for the activity, including risk assessment, job safety environmental analysis, and Inspection\nTest Plan and Checklist based on project specifications.\nLiaise with the Technical Engineer for submission of material submittals to the Consultant\nCoordinate with the Consultant’s representative and Site Charge for Inspection.Skills",
    "Skills": [
        "A Bachelor’s degree in Engineering.\nExcellent written and verbal communication skills\nAbility to work in a cross-functional team environment\nExtremely detail-oriented\nGreat troubleshooting skills\nWorking knowledge of product development and manufacturing processes\nExcellent organization and time-management\nAbility to juggle multiple projects simultaneously\nPC software proficiency"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 12"
    },
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "20"
    }
}