{
    "Job ID": "4751368",
    "Description": "Who We AreKyndryl is a market leader that thinks and acts like a start-up. We design, build, manage, and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers, and our communities.The RoleDefine a unique value proposition for your respective area of expertise. Responsible for looking at the solution from a cross domain perspective to bring full value to the customer.\nMaintain and develop relationships with key alliance partners and ecosystems; create referenceable customers.\nAct and become our customers’ trusted advisor within your specialty. Work within your technical domain of expertise but be also responsible for adjacent domains to provide a complete Kyndryl customer journey.\nsupport the close of sale with the Commercial Partner for both cloud consulting engagement and managed services.Responsible to utilize the full breath of Kyndryl’s value propositions to develop profitable deals. Work with the pricing / commercial / solution teams to ensure suggested solutions bring value to the customer and are profitable for KyndrylSkills",
    "Skills": [
        "Who You Are",
        "Digital transformation.\nHybrid and native cloud computing technologies.\nModern IT operating models Deep domain knowledge of Services offerings and technical solutions in a domain of expertise.\nCommunication and presentation skills.\nDemonstrated experience translating distinctive technical knowledge into actionable customer insights and solutions.\nConsultative selling.",
        "Externally recognized as an expert in the hyperscalers capabilities , including technical certifications",
        "Being You",
        "Diversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way.",
        "What You Can Expect",
        "With state-of-the-art resources and Fortune 100 clients, every day is an opportunity to innovate, build new capabilities, new relationships, new processes, and new value. Our employee learning hub gives you access to the best learning in the industry to receive certifications and accreditations, including Microsoft University, AWS Cloud Center of Excellence, Udemy, and the Harvard Business Review. Through our company-wide volunteering and giving platform, you can donate, start fundraisers, volunteer, and search over 2 million non-profit organizations.  At Kyndryl, we invest heavily in you! We want you to succeed so that together, we will all succeed."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}