{
    "Job ID": "4751493",
    "Description": "Junior Process Operator in the refinery field (EPCL) ENOC Jebel Ali - UAE NationalsAre you a UAE national high school graduate looking for an exciting opportunity to kickstart your career journey? We have a great vacancy waiting just for you!ENOC is searching for bright and motivated UAE national high school graduates who are eager to gain real-world experience in Refinery. This is your chance to work with a dynamic team, learn new skills, and make a positive impact.About the Position:We are delighted to offer our - Technical Training program to UAE Nationals. The program will offer a full salary and run for 3 years with a combination of classroom learning / practical and on the job training in a highly reputed training institute ( PETROFAC ) . You will work on real life process operation-based tasks and will receive full mentoring and coaching support throughout the program . On successful completion of the program, you are expected to be an independent operator with a clearly defined career path.We are looking for motivated, hardworking individuals who have the desire to build a successful career in Process Operation in the Oil & Gas industrySkills",
    "Skills": [
        "**Key Requirements:**",
        "- UAE National",
        "- High school graduate - 12 Grade",
        "- IELTS 5.0 or an international equivalent",
        "- Passion for Refinery",
        "- Flexible in traveling to Oman for 9 months.",
        "- Able to work in rotating shift schedules",
        "- Good command of written and spoken English with good communication and interpersonal skills.",
        "- Age Limit between 20 – 25 years",
        "- Must hold valid UAE passport + Kolasat Al Qaid (Family book)",
        "- Work Pattern – First 12 Month:8 am to 4 pm : 5/2 days’ work schedule",
        "- Work Pattern – After 1st year: Shift schedule",
        "- Shift Pattern: Onsite Job – must wear coverall , safety shoes, helmet and designated PPE at all times.",
        "- Salary starting total package- AED 16,000/-",
        "- Salary – after initial 12months: In line with the Career & Incremental Development Progression Plan passed on competency achieved. ",
        "- Must pass the English, Math, Science and medical Assessment",
        "- Must successfully pass the HR and business interview",
        "**What You'll Gain:**",
        "- Hands-on experience in Refinery",
        "- Mentorship and guidance from industry experts",
        "- Opportunity to work on exciting projects",
        "- A chance to develop skills that will set you up for future success",
        "- International accredited Level 2 NVQ Diploma from City and Guilds / OPITO"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "United Arab Emirates",
        "Age": "Max: 26"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}