{
    "Job ID": "4751651",
    "Description": "Operations Deputy Manager – Qatar (Italian Speaker)Manage all day-to-day activities (administrative and functional) conducted at the Visa Application Centre which involves.\nConduct regular Audits for all processes & implement all new process rollouts or changes.\nIdentify incorrect or incomplete information by regular quality checks thereby ensuring accuracy of the visa application.\nEnsure regular Error Monitoring - To monitor track and reduce the number of errors every month, within acceptable limits.\nMaintain & improve level of customer & mission satisfaction by enhancing procedures and continuously innovating methods to increase productivity and cost-effectiveness. Ensure that the Teams are aligned &\ncontribute towards the achievement of parameters enlisted in the Team Objective Tracker.\nMaintain adherence to the Service Level Agreements for all processes and ensure adherence to Standard Operating Procedures, manuals etc. without any deviation. Ensure that the Teams are mentored & work towards adherence of all SOP’s/ processes, required to be complied with, from an Organizational & ISO perspective.\nEnsure compliance with VFS Global-defined principles, policies & procedures as applicable to the role.\nMaintain high standards of ethics, integrity, and compliance with corporate procedures.\nEnsure that the entire process is completed within the mandated Turn Around Time.\nEnsure that the Teams are aligned & contribute towards achievement of parameters enlisted in the Team Objective Tracker.\nEnsure no penalties are incurred and monitor , track and maintain internal errors.\nEnsures that the Teams are aligned & contribute towards achievement of parameters enlisted in the Team Objective Tracker.\nEnsure personal & professional development for self and team by conducting trainings on regular basis (product & process). Ensure that all staff attends trainings scheduled by HR & ensures effective Process\nMonitoring, by conducting Internal Process Certifications (OCL’s), for all staff.\nProvide assistance to staff when needed and handle applicant/customer escalations.\nLiaise with various support functions to handle team related queries.\nEnsure delivery of Value-Added Services options and achievement of the VAS targets for the VAC.\nManage VAC productivity and VAC security (Physical & data).\nMentor the team on a regular basis, thereby ensuring a successor is created for the position – assist Manager/Unit Manager in Succession planning.\nEnsure judicious use of natural resources.\nAdhere to the environment health and safety policy/objectives and guidelines of the organizationSkills",
    "Skills": [
        "Residents of Qatar (is a must)\nQatari nationals are preferred.\nBachelor’s Degree in business sciences or any related field\nExcellent Verbal and Written skills in Italian, English, Arabic.\n6-8 years Proven Experience in leadership specially in customer service field.\nProficiency in MS Office\nShowcase good leadership skills to carry team members along.\nExcellent skills for communicating and relating with both staff members and customers.\nGood interpersonal skills to create a cordial relationship with team members.\nAbility to multitask.\nHave good temperate to handle disputes and emergencies."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Travel Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}