{
    "Job ID": "4751561",
    "Description": "We are an innovative business technology services company in Qatar. Our specialists tailor design solutions to our customers’ needs. We understand that each customers deserves, which is tailored to their specific need. We have been serving Qatar market being a Technology solutions provider for many years delighting our customers with professional service delivery.We are seeking a highly motivated Senior ELV Presales Engineer responsible for provision of the required quality technical services.Carryout Concept definition and engineering studies, design, scopes, and preparation of engineering documents as per approved standards / procedures.\nVerify and sign-off technical designs and bids in accordance with approved standards.\nDeliver timely service to meet the project requirements.Under supervision, engages in highly technical systems design with complete knowledge of all aspects of most every Physical Security System, involving a significant group of sub-systems under the physical security function.Analyzes client needs and provides detailed design and implementation plan for clients, based upon their needs and requirements.Provides support during pre-sales, Implementation and Post-Sales Support.Responsibilities and Duties:Design, Estimation and Presales activity of ELV Systems Projects and Tenders.\nEnd-to-end system design, including costing of ELV system projects like CCTV, Access Control, PAVA, Gate Barriers and turnstiles, Structured Cabling.\nVerification of tender drawings, IFC drawings, project specifications, etc and preparation of compliance/deviation statements.\nMaterial Submittals, Compliance documents, design calculations preparation.\nKnowledge of MOI-SSD regulations and familiarity with the MOI processes and submissions.\nCoordinate with consultants, contractors, and clients for design level approvals.\nCoordinate with vendors, negotiations.\nSupport presales team with site surveys, technical meetings, demonstrations, etc.\nHandover of design documents to implementation team after project award.Skills",
    "Skills": [
        "Minimum 6 Years of ELV Presales, Design and Estimation experience\nMinimum 3 Years of ELV implementation experience\nA generic knowledge of the IT market in Qatar is required.\nCertifications by major ELV Systems manufacturers would be a plus.\nFluent English Speaker, excellent English required.\n3 to 5 years’ experience in ELV Presales in Qatar ***Mandatory***\nKnowledge in system architecture of leading ELV manufacturers.\nKnowledge of ACAD, Visio, and Excel."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 3",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}