{
    "Job ID": "4751878",
    "Description": "Job descriptionJob descriptionA Marketing Manager specializing in Digital Marketing and social media should have both graphic design expertise and a solid understanding of digital marketing strategies. The candidate is responsible for planning, executing, and overseeing all digital marketing and social media efforts to achieve business goals both online and offline.Responsibilities1.      Create and develop a wide range of digital content, including graphics, videos, infographics, animations, and other multimedia assets.2.      Create visually stunning social media posts, website content, email campaigns and digital advertisements.3.      Design visually appealing and engaging graphics, images, and multimedia content for digital marketing campaigns and social media platforms as per the guidelines provided.4.      Develop custom graphics, infographics, banners, and visual assets that align with brand guidelines and marketing objectives.5.      Create and edit videos and animations to enhance online content and engagement.6.      Create and implement digital marketing and social media strategies that align with the company's objectives and target audience.7.      Design and maintain the company website, ensuring a user-friendly and visually appealing experience.8.      Ensure website content is up-to-date and reflective of the latest company offering.9.      Plan and execute online marketing campaigns, including SEO, SEM, email marketing, content marketing, and paid advertising, across various digital platforms.10.   Develop and manage content calendars, ensuring consistent, high-quality content that engages the target audience and drives brand awareness.11.   Manage and grow the company's social media presence on platforms like Facebook, Instagram, Twitter, LinkedIn, and others.12.   Monitor key performance metrics, analyze data, and prepare regular reports to assess campaign effectiveness and make data-driven decisions.13.   Stay updated on industry trends, competitive landscape, and emerging digital marketing technologies to maintain a competitive edge.14.   Ensure that all digital and social media content aligns with the company's brand voice, values, and guidelines.15.   Continuously optimize digital marketing efforts to improve conversion rates, lead generation, and customer acquisition.16.   Stay informed about digital advertising regulations and ensure all campaigns adhere to legal and ethical standards.17.   Collaborate with cross-functional teams, including sales, product development, to align marketing efforts with broader company goals.18.   Keep up with the latest trends in digital marketing and social media to remain innovative and adaptable.19.   Monitor online mentions and discussions related to the brand, ensuring that brand reputation es maintained and protected.20.   Provide insights and recommendations for brand enhancement based on market trend and customer feedback.21.   Prepare applications for nominations.22.   Prepare answers for articles.QualificationsKnowledge:The employee must have proficient knowledge in the following areas:Proficiency in digital marketing channels, including SEO, SEM, email marketing, content marketing, and paid advertising.\nStrong knowledge of various social media platforms, their algorithms, and best practices for engagement and growth.\nProficiency in graphic design software such as Adobe Photoshop, Illustrator, and InDesign.Experience & Education Background:The employee must possess the following:A bachelor's degree in marketing, digital marketing, communications, or a related field is required.\nPossess 5-9 years of experience in digital marketing and social media management, with a proven track record of successful campaigns and team leadership.\nProven experience in graphic design for digital marketing and social media.Skills",
    "Skills": [
        "Skills:",
        "The employee must demonstrate the following skills:",
        "Fluent in Arabic and English, both written and spoken.\nAbility to analyze data using tools like Google Analytics, social media analytics, and marketing automation platforms to make data-driven decisions.\nStrong creative and artistic skills with an eye for detail and aesthetics\nAbility to work within tight deadlines and manage multiple projects simultaneously.\nStrong creative and strategic thinking skills to develop compelling content and campaigns that resonate with the target audience.\nAbility to work on your own initiative.\nTeam building and leadership skills\nAttention to detail and high level of accuracy.\nDiscretion and an understanding of confidentiality issues."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}