{
    "Job ID": "4751486",
    "Description": "Our company is seeking an experienced Estimation Supervisor to join our team in the Eastern Province of Saudi Arabia. The Estimation Supervisor will be responsible for overseeing the estimation process, ensuring accuracy and efficiency, and providing guidance and support to the estimation team.Responsibilities:Manage and supervise the estimation team, providing guidance and support as needed.\nReview and analyze project documents, including drawings, specifications, and contracts, to determine the scope of work and project requirements.\nPrepare detailed cost estimates, including material, labor, and equipment costs, based on project specifications.\nCoordinate with suppliers and subcontractors to obtain accurate pricing information.\nReview and evaluate bids and proposals from suppliers and subcontractors, making recommendations for selection.\nPrepare and submit accurate and timely cost estimates and proposals to clients.\nMonitor and track project costs, ensuring that actual costs align with estimated costs.\nIdentify and analyze cost-saving opportunities and value engineering options.\nPrepare and present reports and presentations on project costs and estimates to management and clients.\nStay updated with industry trends and best practices in estimation and cost control.Skills",
    "Skills": [
        "The ideal candidate will have a minimum of 12 years of experience in the field, with a strong background in estimation and cost control.",
        "Strong knowledge of construction materials, methods, and techniques\nProficiency in estimation software and tools\nExcellent analytical and problem-solving skills\nAbility to work independently and manage multiple projects simultaneously\nStrong communication and interpersonal skills",
        "Preferred Candidate:",
        "Bachelor's degree in Civil Engineering or a related field.\nProven experience in estimation and cost control, with a minimum of 12 years in a similar role.\nStrong knowledge of construction materials, methods, and techniques.\nExcellent analytical and problem-solving skills.\nProficiency in estimation software and tools.\nAbility to work independently and manage multiple projects simultaneously.\nStrong communication and interpersonal skills.\nAbility to work well under pressure and meet tight deadlines.\nAttention to detail and accuracy.\nAbility to lead and motivate a team."
    ],
    "Preferred": {
        "Years of Experience": "Min: 12 Max: 18"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}