{
    "Job ID": "4751685",
    "Description": "The SharePoint Developer & Administrator will be responsible for designing, developing, and maintaining SharePoint applications and sites. They will also be responsible for managing and administering SharePoint environments. The ideal candidate will have a strong understanding of SharePoint architecture, development methodologies, and best practices. They should be able to work independently and collaborate with cross-functional teams to deliver high-quality solutions.Responsibilities:Design, develop, and implement SharePoint solutions, including custom applications, workflows, and web parts.\nCreate and maintain SharePoint sites, lists, libraries, and permissions.\nPerform regular maintenance and troubleshooting of SharePoint environments, including performance monitoring and optimization.\nCollaborate with business users to gather requirements and translate them into technical specifications.\nProvide training and support to end users on SharePoint features and functionality.\nStay up-to-date with the latest SharePoint trends, technologies, and best practices.\nManage SharePoint security, including user access and permissions.\nAssist in the migration of SharePoint sites and content.\nParticipate in the planning and execution of SharePoint upgrades and patches.\nDocument and maintain technical and process documentation related to SharePoint.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in Computer Science or a related field.\n4-7 years of experience in SharePoint development and administration.\nStrong knowledge of SharePoint architecture and best practices.\nExperience with SharePoint Online and Office 365.\nProficient in SharePoint development tools and technologies, including SharePoint Designer, Visual Studio, and PowerShell scripting.\nExperience with SharePoint migration tools and methodologies.\nAbility to work independently and take ownership of projects.\nExcellent problem-solving and troubleshooting skills.\nStrong communication and collaboration skills.\nAbility to work in a fast-paced, deadline-driven environment.\nSharePoint development and customization\nSharePoint administration and maintenance\nSharePoint workflows and business process automation\nSharePoint Designer and Visual Studio\nPowerShell scripting for SharePoint"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}