{
    "Job ID": "4751833",
    "Description": "Job PurposeEffectively managing, developing, and supporting the Service Desk provision across EITC organizationEmbedding a culture of continuous improvement, including ensuring that all Service Desk processes are thoroughly documented, consistently audited, and regularly improvedEnsuring that the Service Desk performance provides a consistent and effective colleague experience, best supporting the business needs and based on delivery to agreed SLAs and KPIsShaping and delivering the Group Service Desk strategyCoordinating and managing all relevant stakeholders (internal and third party), including the Service Desk teams, customer operations and wider teams involved in Service Desk operations and incident/request resolution.Key accountabilitiesOversee the day-to-day operations of the Service Desk ensuring a high level of quality and colleague satisfaction. This includes front line incident and request management\nLead, motivate, coach and further develop the technology Service Desk team\nLead the team to identify, and develop innovative solutions to improve the technology experience across the Functional units\nManage and communicate SLAs to key stakeholders.\nProactively provide reporting, metrics and insights for stakeholders, which includes analyzing data/usage of applications, incidents and requests to identify problems and proactively reduce incidents and request volumes\nDevelop and implement the strategy, standards and procedures for the Service Desk and other related services.\nEnsure all incidents and service requests are handled effectively across each channel within agreed SLAs to deliver colleague satisfaction\nDrive continuous improvement opportunities across the team to further optimize service delivery, service levels, and colleague satisfaction. This includes actively seeking opportunities for automation and process efficiencies.\nEnsure relevant legislative and organizational requirements are met; keep up to date on all key changes to relevant regulations.Skills",
    "Skills": [
        "Minimum experience:",
        "5 years of experience managing service desk\nGood understanding of IT solutions\nMonitor tickets to ensure resolution.\nStrong with Windows and Active Directory\nHPSM, CRM & Beyond Trust ticketing system\nManage all endpoints including PC’s, laptops, MAC, printers and mobile\nExperience with remote access, Netscaler VPN, Citrix, SharePoint\nITIL V4 Foundation certified\nAbility to work with vendors",
        "Minimum education:",
        "Bachelor's of Engineering (B.E) in electronics & communication",
        "Knowledge and skills:",
        "Proven ability to lead large transformation projects.",
        "Ability to lead teams and groups.",
        "Strong negotiation and facilitation skills",
        "Proven track record of managing vendors.",
        "Proven track record in governance and financial management",
        "Strong management skills in a multi-cultural and multi-national environment"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telecommunications; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}