{
    "Job ID": "4751879",
    "Description": "Ensure that HR & Admin services are provided to the employees in a timely fashion.\nDesigning, developing and executing best-practice initiatives for core human resources policies and programs, including succession and career planning, performance appraisals, recruitment, onboarding and employee retention, records and documentation processes.\nConduct job analysis and create job descriptions for all relevant positions required by the organization.\nImplement a robust selection, interviewing, recruiting and on boarding process to support the institute human resources needs on a regular basis.\nProviding senior level advice and recommendations to senior management and departmental managers on matters relating to human resources issues;\nOverseeing and providing strong mentorship to a team of human resources professionals through effective training, coaching and team building;\nManaging the day-to-day operations of the department, ensuring security and accuracy of employee records, consistency of practice and maintenance of optimum service levels;\nEnsuring effective benefit and compensation policies, practices and systems are in place in accordance with government guidelines and best practices;\nEnsuring appropriate communication with the institute community regarding matters relating to human resources issues\n1Ensure that HR & Admin services are provided to the employees in a timely fashion.\nEnsure that Company is operating legally, effectively and efficiently by guaranteeing compliance with organizational policies and other governmental and legal requirements across the Company.\nProvide information and services to internal clients to ensure that they are aware of, and comply with, relevant policies and procedures\nCommunicate effectively overseas and local recruitment agencies for manpower supply.\nPerforming other related duties as requiredSkills",
    "Skills": [
        "• Bachelor degree in HR or Business Administration",
        "• Minimum of 3 year of managerial experience.",
        "• Excellent command of spoken and written English language.",
        "• Communication ability.",
        "• Strong analytical skills.",
        "• Team player.",
        "• Managerial competencies; motivating, influencing, developing and leading a team of subordinate.",
        "• P&C skills; Word, Excel and Power Point.",
        "• Having a practical working knowledge of HR or Employee-Relations concepts.",
        "• Dynamic enough to meet the stress of work and deadlines.",
        "• Initiative in providing solutions and alternatives as well as development.",
        "• Requiring high persuasion and negotiation skills."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Vocational Education; Higher Education; Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}