{
    "Job ID": "4751801",
    "Description": "In 8 years, we have won 120+ awards, including Webby, Red Dot, The Drum Awards, and others. We’ve teamed up with over 500 startups and big-name global brands all around the world. We grew into a team of more than fifty creative minds, including UX strategists, business analysts, UI/UX, Product and Motion designers.As an Operational Manager in the e-commerce industry, you will play a pivotal role in overseeing and optimizing the day-to-day operations of our enterprise-level direct-to-consumer (D2C) store across 30 countries, with a focus on the MENA region. Your expertise will be essential in ensuring a smooth and efficient e-commerce experience for our customers while driving business growth. Here are some key responsibilities you will be entrusted with:Supply Chain and Inventory Management: You'll be responsible for maintaining optimal inventory levels across multiple regions to meet customer demand. Collaborating with suppliers and logistics partners will be crucial to ensure timely order fulfillment while minimizing stockouts and excess inventory.\nCross-Functional Collaboration: Collaboration will be a cornerstone of your role. You'll work closely with various teams including marketing, sales, IT, and customer support to align strategies, streamline processes, and deliver a cohesive customer experience across all touchpoints.\nProcess Optimization: Efficiency will be at the heart of your efforts. You'll identify bottlenecks in the order processing, fulfillment, and delivery processes, implementing improvements to enhance operational efficiency and reduce turnaround times.\nPerformance Monitoring and Analytics: Utilizing data-driven insights, you'll closely monitor key operational metrics such as order fulfillment rates, lead times, and customer satisfaction. Your analytical skills will contribute to identifying trends and areas for improvement.\nQuality Assurance: Maintaining high standards of product quality and ensuring accurate order fulfillment will be a critical responsibility. You'll implement quality control measures to prevent errors and address any issues that arise.\nTechnology and Systems Oversight: You'll work with IT teams to ensure that the e-commerce platform, inventory management systems, and other technologies are functioning seamlessly. Any technical issues will be promptly addressed under your supervision.\nRisk Management and Compliance: Mitigating risks related to fraud, payment processing, and data security will be a priority. You'll ensure compliance with industry regulations and standards to protect both the business and our customers.\nCrisis Management: In the dynamic e-commerce landscape, unforeseen challenges can arise. Your ability to adapt to change and make quick, well-informed decisions will be crucial in effectively managing unexpected situations.Along with projects you’ll be proud of, you’ll get:a team — you will work with people with whom you want to have fun outside of work;\nfreedom of action — we are against micromanagement and trust your decisions;\nchallenging tasks that will constantly take your skills to a new level;\ngrowth — you will have free access to internal workshops, and we cover paid external training by 50%;\nsupport — you will not be left alone with your questions, you will have a mentor who will help you figure everything out;\npaid vacation and sick leave.We’re all about passion for what we do, mixed with being positive, real, open, and wanting to keep on getting better. Sound like you? Join us, and together we’ll reach new heights!Skills",
    "Skills": [
        "Requirements:",
        "Fluent in written and conversational English\n3 years of experience generating outstanding results as a operations manager at e-commerce\nProven ability to successfully launch a product in a new market\nStrong communication and time management skills\nExperience with clients from UAE"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}