{
    "Job ID": "4751467",
    "Description": "1.    Maintain a first-class level of customer service, ensuring that all end-users are treated efficiently and in an appropriate manner.2.    To diagnose and resolve software and hardware incidents, including operating systems (Windows and Mac) and across a range of Engineering applications such as AutoCAD and Revit.3.    To assist all our users with any logged IT related incident when called upon.4.    To take ownership of issues by carrying out problem analysis to implement temporary or permanent fixes with the aim of restoring service to the end-users as soon as possible; escalating incidents to other support teams (Network team, System Administration, Applications team, and Security team) where necessary.5.    Utilize the Service Desk tracking software to monitor Service Desk for tickets assigned to the queue and process first-in first-out based on priority.6.    Install, test, and configure new workstations and deployment for new employees using standard hardware, and software.7.    Modify configurations, utilities, software default settings, etc. for the local workstation.8.    Resolve incidents with printers, plotters, copiers, and scanners.9.    Ability to do the passive network work and build simple network topologies.10. Assist with onboarding of new users to ensure proper knowledge transfer for IT procedures and basic system know-how.11. Engage in research and in-depth troubleshooting to resolve technical issues.12. Prepare for the end user the IT training material and build the knowledge base in the IT portal as well as the service desk portal.13. Train users to use new or modified equipment, systems, or software packages.14. Maintain the IT asset List and apply Asset Tagging and monitoring.Skills",
    "Skills": [
        "Bachelor’s degree from an accredited college or university with a major in Computer engineering, Information Technology, Computer Science, or a related field.\nCompTIA A+ Certification\nMCSA Certificates.\nAbility to demonstrate practical troubleshooting and problem analysis techniques.\nGood attention to detail and ability to show initiative.\nAbility to plan and prioritize workload without supervision. \nMinimum of 5 years of experience in IT Support\nExperience in Windows 10/11 and office 365\nExperience in Autodesk platforms"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Hawali, Kuwait",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}