{
    "Job ID": "4751842",
    "Description": "الإشراف على كافة العمليات المتعلقة بإدارة المشتريات، وتقع على عاتق مدير المشتريات العديد من المسؤوليات والمهارات وهي : \nالإشراف على العمليات اليومية لعمليات الشراء.\nتطوير وتحسين استراتيجيات الشراء وتنفيذها.\nمراقبة وإدارة علاقات الموردين والتفاوض على العقود والاتفاقيات والجداول الزمنية والأسعار.\nمتابعة المخزون وإدارة المخزون ومتطلباته.\nالاحتفاظ بالأوراق والسجلات والمستندات المتعلقة بالشراء، بالإضافة إلى قاعدة البيانات التي تحتوي على معلومات الموردين.\nالتأكد من أن كل ما يتم الحصول عليه يتوافق مع المتطلبات ومعايير الجودة اللازمة.\nتثقيف وتوجيه الموظفين الجدد في الاستخدام السليم لنظام المشتريات وعملية الشراء.\nيقوم مسؤول المشتريات باجراء الدرسات التي تساعد المنظمة على اتخاذ القرار السليم في ما يتعلق بعمليات الشراء.\n الاحتفاظ بسجلات/ملفات في الحاسب الآلي عن مشتريات الشركة و عن الموردين والأسعار والأصناف التي يتم التعامل فيها بطريقة تسهل الرجوع إليها عند الحاجة.\nوضع السياسات وجميع الشروط اللازمة لاتمام عمليات الشراء.\nعمل دراسة جيدة للسوق وتحديد وضع الشركات والمؤسسات المنافسة.\n ترتيب وتسجيل كافة البيانات الخاصة بعمليات الشراء وفق السجلات المحددة لذلك.\nجلب عينات من الأصناف المراد شراؤها من السوق لمعاينتها مع جهة الطلب قبل البت في الشراء.\n متابعة وصول الأصناف و التأكد من مطابقتها للمواصفات المدونة في أمر الشراء بالنتسيق مع المخازن و جهة الطلب.\nالمتابعة مع قسم المخازن بشأن إصدار سندات الإدخال الخاصة بالمواد المستلمة و العمل على تسديد فواتير الموردين في الوقت المناسب.\n متابعة التوريد بشأن الطلبات المتأخرة.\nإعداد التقارير الدورية عن مشتريات الشركة.\nالتخلص من الأصناف المخزنة غير الضرورية.Skills",
    "Skills": [
        "القدرة على التنظيم والتخطيط وبناء الاستراتيجيات الجديدة.  \nالقدرة على التفاوض وعقد الاتفاقيات والتحلي بمهارات التفكير النقدي.\nسرعة التواصل سواء شفوياً أو كتابياً.\nإتقان لغات أخرى غير اللغة الأصلية \nإتقان استخدام برامج الأوفيس.\nاستطاعة العمل بشكل فردي ومستقل أو ضمن فريق.\nالسرعة في اتخاذ القرارات الصحيحة. \nاكتساب مهارات جيدة في القيادة.\nإمكانية إعداد التقارير والدراسات المتعلقة بقسم المشتريات .\nالإلمام بكافة إجراءات صياغة العقود."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Hofof, Saudi Arabia",
        "Company Industry": "Supermarket",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}