{
    "Job ID": "4751366",
    "Description": "Who We AreKyndryl is a market leader that thinks and acts like a start-up. We design, build, manage, and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers, and our communities.The RoleUnleash your expertise and embark on a thrilling journey with Kyndryl Consult, the professional services arm of Kyndryl. We are seeking an exceptional and visionary Consult Associate Partner (AP), Consult Partner (P) and Consult Senior Partner (SP) on a global scale, individuals who possess the power to transform customer IT outcomes and revolutionize businesses. As a Consult AP/P/SP, you will be at the forefront of driving digital transformation, mitigating risks, and achieving operational excellence, all while solving the most critical challenges faced by our customers. At Kyndryl, we believe in harnessing the full potential of our mission-critical global strength, combined with the cutting-edge technology capabilities of our Global Practices. From the vast realms of Cloud, Mainframe, Networking and Edge, Data & Application, Security & Resilience, to Digital Workplace, you will have the opportunity to leverage these tools to create a remarkable impact.Joining our high-growth Consult business, you will be an integral part of multi-disciplinary teams, guiding them through complex consulting engagements and responsible for creating and positioning value for Kyndryl's largest accounts and groundbreaking opportunities. Picture yourself immersed in a start-up-like environment, where you will engage with senior leaders both internally and among our esteemed clientele. Kyndryl, as the world's largest provider of mission-critical IT operations and infrastructure services, offers an unrivaled platform for you to thrive.As a Consult AP/P/SP, you will wield immense influence within the customer and Kyndryl account teams, forging senior-level relationships and driving value-based outcomes. Your role will encompass leading small teams of practitioners across multiple projects, nurturing your leadership skills, and propelling your career within one of the fastest-growing IT consulting businesses on a global scale.Are you ready to take the helm, navigate uncharted territories, and leave an indelible mark on the world of digital transformation? Join Kyndryl Consult as a Consult AP/P/SP and embark on an extraordinary adventure where passion meets purpose, and innovation knows no bounds.Your Future at KyndrylEvery position at Kyndryl offers a way forward to grow your career, from Associate Partner to Senior Partner, we have opportunities in all industries and technologies that you won’t find anywhere else. At Kyndryl, we work with clients in a variety of industries and markets, so whether you want to broaden your knowledge base or narrow your scope and specialize in a specific sector, you can find your opportunity here.•Builds cross-unit notoriety as a subject-matter expert, has demonstrated subject-matter expertise externally with clients and/or through publications, speaking events, industry forums, blogs on the above specialization•Leads or has participated in complex sales efforts, seeks appropriate assistance as required, and has positive impact on sales closure•Build engagement-specific consultant teams, based on skills required to meet SOW requirements and leads consulting engagements•Delivers complex projects and/or fixed price components with mix of global, local and subcontractor employees and product development challenges to price case and client satisfaction•Instills in clients a sense of confidence, trust and credibility; builds and sustains strong, long-term relationships as demonstrated through NPS scores or development of client success stories•Proactively seeks assistance in difficult delivery situations; gets right SMEs involved in delivery as requiredSkills",
    "Skills": [
        "Required Skills and Experience",
        "Consulting Subject Matter Expertise Domain:",
        "•Proven track record in IT Consulting or IT Management Consulting with regional or global consulting firm with delivery and business development success and growth",
        "•Recognized externally & internally as a Consult leader on multiple specialization areas provided above. Ability to create, position and deliver Modern IT Strategies, OpModels, Complex Digital Transformations and Business/Financial value realization engagements and roadmaps",
        "•Has experience (and/or willingness) to increase Kyndryl’s intellectual property assets by expanding existing Consult offerings, developing new offers when needed, developing or improving consulting methods, tools and techniques",
        "•Able to operate in a “newly” forming business unit and able to “roll-up-sleeve” and contribute in an entrepreneurial fashion to help lead and deliver client outcomes",
        "Consulting Business Development Domain:",
        "•Demonstrates success in creating, developing and closing pipeline to achieve signings targets of 5-10M annually on specific accounts, sectors or geography",
        "•Able to drive smaller sales efforts, to close after initial identification with minimal oversight and support",
        "•Has participated in sales cycles across multiple offering solutions and has been exposed to a diverse set of client proposals",
        "•Has been exposed to sales involving global resourcing components",
        "Consulting Engagement Delivery Domain:",
        "•Drive team and personal billable and chargeable utilization as required by the business.",
        "•Demonstrates a lead role in resolving a complex contract, client, solution, technical or political issues which are critical to delivery",
        "Consulting People & Team Leadership Domain:",
        "•Behaves in a Player/Coach model to act as coach or mentor to fellow team members, as well as carry individual targets",
        "•Role model to others outside of project team(s); large sphere of influence",
        "•Effectively collaborates across Consult service areas, functions or entities while inspiring a positive employee experience and enhanced climate",
        "Preferred Skills and Experience",
        "•Productivity skills: Exceptional and advanced Powerpoint, Word & Excel skills to help convey messages and deliverables through modern consulting techniques. Ability to “roll up sleeve” and create/provide content for proposals, SOW and deliverables. Ensure client and deliverable deadlines, consult management system compliance. Takes pride in creating polished work products",
        "•Communication: Possesses excellent verbal and written communication skills to clearly articulate the insights from findings to relevant stakeholders. Able to manage communication at working levels and also C-level gravitas. Able to drive and participate in workshops, clearly outlining outcomes and creating/presenting materials and deliverables",
        "•Work with Empathy: Lead and participate in client and internal Kyndryl teams with empathy. Ability to understand and recognize multiple points of view but get to outcomes with kindness and resolve. Works well within a complex matrixed business and client environment as well as independently",
        "•Leadership: Demonstrates a self-starter mindset and with client and Kyndryl outcomes top of mind. Ability to mentor and mentee, create an environment and workplace of choice for peers and team members, be the role model of professional excellence",
        "•Execution: Possesses critical thinking capabilities to analyze data and inputs with objectivity and provide strategic roadmaps and recommendations. Always intellectually curious an brings innovative ideas to solve critical business problems. Clearly accountable on commitments. Able to pivot change in client and business priorities and manage work across multiple projects and teams",
        "Being You",
        "Diversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handedly: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}