{
    "Job ID": "4751797",
    "Description": "III, NATURE AND SCOPE Leadership of diverse construction teams in a brownfield environment to achieve the goals and objectives set by the project team and the business.\nConstruction / Project Management skills to manage a diverse group of multidiscipline Construction Managers, Construction Leads and Construction Engineers\nKnowledge of and familiarity with Saudi Aramco Engineering Standards, Procedures, Best Practices and Inspection Procedures (SAES, SAEP, SABP and SAIP), MOC and permit to work systems in the operating plantV. MINIMUM REQUIREMENTS AND QUALIFICATIONS Bachelor's or Master’s degree in Construction Management, Engineering or Project Management.\nMinimum 20+ years of experience in Construction / Project Management in Oil & Gas, Power plant and/or process industry. Commissioning, plant Start-Up and Brownfield experience is a must.\nProficient with Construction Management and Business processes including planning, contract management and procurement, Management of Change, Control of Work, Quality Management Systems and EHS management systems.\nUnderstanding of Saudi Aramco MOC and permit to work systems in the brownfield environment is a must.\nMust have strong leadership and multi-discipline coordination skills and be able to plan and execute work with the construction team assigned to support execution of multiple projects.\nHardworking, proactive and possesses teamwork attitude with leadership and problem-solving skills.\nExcellent English communication (written and verbal) skills.\nCompetent in using MS word, Excel and PowerPoint applications.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}