{
    "Job ID": "4751897",
    "Description": " شركة مختصة في صناعة الدهانات تبحث عن مرشح مناسب لوظيفة رجل مبيعات متواجد بمنطقة الرياض المسؤوليات والمهام:1.     بيع مختلف أنواع الدهانات مثل طلاء الأخشاب، السيارات والطلاء الزخرفي وإلخ.2.     إنشاء و تطوير العلاقات التجارية وبناء وتكوين علاقات مع العملاء .3.     تحقيق أهداف المبيعات والنتائج ضمن الجدول الزمني المتفق عليه4.     تنسيق جهود المبيعات مع أعضاء الفريق وإلادارات الأخرى.5.     البقاء على الاطلاع المستمر بأفضل الممارسات المحلية والاتجاهات الترويجية. Company in Paints Manufacturing sector is looking for qualified Salesman based in Riyadh.Responsible to:-> Sell various types of paints products, such as wood, auto, decorative, etc.> Establish, develop and maintain positive business and customer relationships> Achieve agreed upon sales targets and outcomes within schedule> Coordinate sales effort with team members and other departments> Keep updated on local best practices and promotional trendsSkills",
    "Skills": [
        "مؤهلات ومهارات مندوب المبيعات:",
        "1.     خبرة في مجال بيع الدهانات والطلاءات السطحية لا تقل عن ثلاث سنوات.",
        "2.     مهارات قوية في التحليل وحل المشكلات.",
        "3.     مهارات ممتازة في التواصل والتعامل مع الآخرين",
        "4.     القدرة على العمل باستقلالية وكجزء من الفريق.",
        "5.     متواجد بالرياض.",
        "6.     رخصة قيادة سارية المفعول.",
        "Candidate Profile:-",
        "> Min. 3 years in Sales of Paints & Surface Coatings",
        "> Strong analytical and problem-solving skills",
        "> Excellent communication and interpersonal skills",
        "> Ability to work independently and as part of a team",
        "> Located in Riyadh",
        "> Valid driving license",
        "> Ability to speak & understand Arabic is a must"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}