{
    "Job ID": "4751501",
    "Description": "Monitoring and analyzing market trends.\nDevelop affiliate marketing programs and market research.\nStudying competitor’s product and services.\nExploring ways of improving existing products and services and increasing profitability.  \nPreparing and managing marketing/branding plans and budgets (New & Old Launches).\nMedia vehicle selection including newspapers and magazines.\nCoordinate in all the exhibitions branding and marketing material set ups.\nLiaising with other internal departments like Sales, Finance, Design & PR.\nManage the production of indoor/outdoor marketing/branding promotional props;\nTravelling to different regions/countries (Outlets and Exhibitions) to know the market scenario and trends.\nLoyalty Program effectiveness (Customer Relationship Management).\nSnow Ball Effect Analysis & ROI analysis against Marketing Budget spent.\nPrepare, maintain & present quarterly, half yearly & annual reports.\nFollow up with the professional photographer (Company Employee) to cover all the company events including, Promotions, Exhibitions, etc.\nPlan and execute all digital marketing, including SEO/SEM, marketing database, email, social media and display advertising campaigns.\nDesign, build and maintain our social media presence.\nResponsible to manage social media influencers (Bloggers)\nCoordinate with PR companies and handle all the PR activities, Editorials, write ups and events with the approval and coordination of sales department\nMaintain and handle weekly/monthly PR editorial with calendar (Newspaper & Magazines)\nManage social media accounts (Ads, Posts, Comments, Enquiries and Bloggers)\nDevelop and implement department objectives, individual staff objectives along with KPI’S and manage performance review and appraisal of subordinate staff based on these objectives by annually/quarterly.Skills",
    "Skills": [
        "Critical thinker and problem-solving skills.\nPrior exposure to the field of marketing as a manager or executive.\nA skilled manager with an ability to handle several tasks using relevant tools and techniques.\nGood understanding of conventional and modern marketing tools for planning effective multi-channel campaigns.\nKnowledge of local and international publications and opportunities"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5",
        "Residence Location": "All Arab Countries",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 25 Max: 40"
    },
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Retail & Wholesale; Perfume & Cosmetics",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}