{
    "Job ID": "4751659",
    "Description": "Key Roles:Manage the budgeting and forecasting activities in coordination with seniormanagement.Develop and implement comprehensive reporting packages which monitor andanalyze the bank’s financial performance.Provide insights and analysis to support senior management strategic planning anddecision making.Enhance the process and tools used to deliver management reporting to providerelevant timely financial information to support decision making, aligned withorganizational objectives.Assess overall financial trends and develop appropriate financial action plan.Monitor and analyze the bank’s financial performance against budget and businesstarget.Measure the performance and achievements of lines of business.Monitor and report capital budget expenditure.Prepare and update market peer reporting and analysis.Prepare Yield and COF reporting and analysis.Manage the bank’s profitability and cost accounting system with reviewing the TPrates applied and cost drivers Vs. policy.Capital planning with coordination with Risk and LOB’s.Submit Financial analysis and recommendations to management on a regularbasis.Provide analytical support to the assets and liabilities management Process.'Key Performance Indicators:Consistency and accuracy of Financial Planning andanalysis.Level of adherence to P&P, and guidelines.Skills",
    "Skills": [
        "Job Requirements:",
        "Education: Bachelor degree in Finance, Accounting or any",
        "related field from a recognized university, a degree in CPA or",
        "CMA is a plus.",
        "Experience:",
        "9 years experience in Finance or Accounting from a",
        "Leading International Bank.",
        "Good understanding in Accounting and financial",
        "analysis.",
        "Competencies:",
        "Fluent in English (Arabic is a plus).",
        "Strong analytical & numerical skills .",
        "Strong computer skills.",
        "Good presentation, communication, & interpersonal skills.",
        "Team building and team player."
    ],
    "Preferred": {
        "Years of Experience": "Min: 9",
        "Residence Location": "Iraq",
        "Nationality": "Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}