{
    "Job ID": "4751361",
    "Description": "·        Develop and implement SAP S/4  systems for business clients. ·        Determine clients' business needs, create customized SAP S/4 solutions and smoothly integrate SAP applications with existing IT infrastructure.                     ·        Interact with clients both for business and technical specifications and validate final output with the team manager.·        Ensure implementation is done based on the client’s needs.·        Provision of technical and professional support, solving problems of the customers.·        Troubleshooting and resolving issues to optimize performance.·        Ensure appropriate follow-up on issues till resolution.·        Contribute to troubleshooting guide to clients describing the first level of support expected from them for each type of case.·        Contribute to training for the client’s support team and the end users.·        Contribute actively to internal streams: internal training, documentation writing, and, QA testing..      Provide feedback to team leaders on the progress of issues and tasks and escalate problems when necessary.Skills",
    "Skills": [
        "Education:",
        "·        Bachelor of Computer Science, Management Information System, or any related field.",
        "Profile:",
        "·        3 to 5 years of experience in the SAP S/4 Hana Financial system (FICO).",
        "·        More than 5 years of experience in ERP systems",
        "·        SAP 4/HANA modules implementation experience is a plus. ",
        "·        Knowledge of ERP practices, compliance, and technology. ",
        "·        Excellent command of Arabic, English, French is a plus",
        "·        Client orientation",
        "·        Teamwork and cross-group collaboration",
        "·        Ability to work under pressure in a continuously evolving environment",
        "·        Work on multiple projects in various industry environments. ",
        "    For National and International Projects, travel may be required. "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}