{
    "Job ID": "4751531",
    "Description": " HR Manager will be the first point of contact for all HR communications, leading the HR team to ensure that all day-to-day duties and responsibilities are proactively undertaken and that all relevant professional standards are met.Develop and implement HR Plans, strategies and initiatives aligned with the overall business strategy. Manage HR Reports, maintaining and improving ERP systems.  Bridge management and employee relations by addressing demands, grievances or other issues. Manage all HR Sections: Government relations, Recruitment, Payroll, Employee relations. Support current and future business needs through the development, engagement, motivation and preservation of human capital. Develop and monitor overall HR strategies, systems, tactics and procedures across the organization. Nurture a positive working environment. Oversee and manage a performance appraisal system that drives high performance. Maintain pay plan and benefits program. Assess training needs to apply and monitor training programs. Report to management and provide decision support through HR metrics. Ensure legal compliance throughout human resource management.Support departments in developing and delivering strategic HR plans that fit with the overall business direction.Plan, monitor, and appraise HR activities by scheduling management conferences, resolving employee grievances, training managers in how to coach and discipline, and counseling employees and supervisors.Maintain management guidelines by preparing, updating, and recommending human-resources policies and procedures.Build strong relationships with different sites, projects, fostering trust and promoting collaboration.Handle confidential matters with discretion.Provide advice and direction where needed to the HR team on work priorities, budget and staff resources, strategic, policy, organization and staff management issues.Current regulation compliance, including accepted professional standards, policies and procedures and legislation (including legislation on data protection, the Equality Act and health and safety).  Manage the implementation of employment policies. Ensure HR policy, best practice and workforce development are applied.Manage the execution of the HR Strategy to ensure achievement of the objectives.Support HR staff to ensure that all relevant professional standards are met. Continuously improve engagement and welfare activities, maximizing productivity, devolving HR responsibilities to line managers and building leadership capability.  Identify HR trends so that attention can be directed to key issues and resources.Identify staffing needs and manage the creation of job descriptions and handbooks.Develop and implement management talent planning.Develop the organizational structure to support future growth, using best practice principles. Manage the company’s employee programmes, staff benefits and packages. Control the performance review programme to deliver continuous employee development. Regularly coach, mentor, and support colleagues to identify individual strengths and development needs.Ensure employee training requirements are well managed and monitored. Manage the training and development plans and ensure they are of a high standard. Conduct annual remuneration and benefit surveys and reviews. Determine relevant Key Performance Indicators (KPIs) for incentive schemes.Manage the diversity, equality, and inclusion values and practices within the company.Enabled all team members to access appropriate guidance and information to manage their workload.Ensure the offboarding process is handled in a professional manner to ensure everyone is consistently treated fairly.Manage the allocation of HR budgets.Ensure internal HR communications, including any issues, initiatives and programmes are well planned, coordinated, relevant, timely and adhere to the company’s values. .Manage Medical Insurance for All Employees, ensure that medical insurance is active for all employees.Control Gizan , Farasan, Amluj administration task.Hotels, housing, building, and payment issue with landlords.Responsible on Government Relations, Iqama, Visit Visa, Leave request, and government process.Support Project Managers in other locations.Compliance with Saudi Labor Law regulation, other regulations, and Saudization.Saudi Crew Management and hiring.Skills",
    "Skills": [
        " Strategic thinking abilities.\nCommercial acumen. \nStrong organizational skills.\nExcellent interpersonal skills. \nProactive, agile work ethic.\nExperience of managing a skilled team.  \nLeads with integrity, an inspiring role model and encouraging collaboration. \nAdvanced Knowledge of Saudi Labor Law. \nExperience of using metrics for driving performance. \nThorough and methodical attention to detail.\nConfidence to use initiative.\nExcellent presentation skills.\nGood time management skills and the ability to prioritize.\nExcellent communication and presentation skills.\nProblem-solving skills and initiative. \nPositive and approachable manner.\nAdaptable to change and possess a willingness to embrace new ideas and processes.\nCommitment to continual personal development. \nProficient I.T. skills.  ",
        "Advanced Data Mining Skills"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marine Transport Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}