{
    "Job ID": "4751719",
    "Description": "We are looking for a passionate Creative Director to spearhead our live experiences division and art studio. In this role, you will be responsible for driving the creative vision, overseeing the production process, and ensuring the delivery of extraordinary live events that leave audiences mesmerized. You will collaborate with cross-functional teams to conceptualize and execute innovative, immersive, and unforgettable entertainment experiences.Skills",
    "Skills": [
        "Responsibilities",
        "Develop and communicate a clear and compelling creative vision that aligns with the project's brand and objectives.\nLead brainstorming sessions to generate innovative concepts for our new projects, ensuring they are unique, engaging, and on-brand.\nManage and inspire a team of creative professionals, including writers, designers, artists, and technical experts, to bring concepts to life.\nOversee all aspects of event production, from scheduling to casting, set design, and technical production that fits the project budget.\nProvide artistic direction to ensure the visual and audio elements of live experiences are of the highest quality and meet artistic standards.\nCollaborate closely with vendors, and key stakeholders to ensure seamless execution for our new projects.\nStay up-to-date with industry trends and emerging technologies to infuse fresh ideas and innovation into live experiences.\nIdentify potential risks in the creative and production process and develop contingency plans to mitigate them.",
        " ",
        "Qualifications",
        "Proven experience as a Creative Director or in a similar creative leadership role within the entertainment industry.\nBachelor’s degree / Masters in marketing, design or any art related field.\nProven English & Arabic language skills.\nA strong portfolio showcasing successful live experience productions and creative work.\nExcellent leadership and team management skills.\nExceptional creative thinking and problem-solving abilities.\nIn-depth knowledge of current entertainment trends and technologies.\nStrong communication and presentation skills.\nFlexibility and adaptability in a fast-paced, dynamic environment.\nPassion for pushing creative boundaries and creating extraordinary live experiences.\n“Roll up your sleeves” attitude."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Entertainment",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}