{
    "Job ID": "4751621",
    "Description": "Job Brief The Quality Assurance Officer is responsible for monitoring and improving the quality of operational processes and procedures in the restaurant organization and production facility. Playing a key role in identifying areas for improvement, implementing quality control measures, and ensuring compliance with industry standards and regulations. Responsibilities Conduct regular audits and inspections of operational processes to assess compliance with quality standards.\nIdentify areas where operational processes can be optimized for efficiency and effectiveness.\nDevelop and implement quality control measures and procedures to minimize errors and defects in operations.\nMonitor and enforce adherence to quality control procedures.\nProvide training to staff on quality control procedures and best practices. Skills",
    "Skills": [
        " ",
        "Qualifications & Skills:",
        " ",
        "Bachelor's degree in a related field (e.g., Business, Quality Management, Operations Management) or equivalent work experience related to Hospitality.\nProven experience in quality control, process improvement, or a related role.\nStrong analytical and problem-solving skills.\nKnowledge of quality management systems and methodologies (Basic Food Hygiene or PIC Certification).\nFamiliarity with regulatory requirements and industry standards relevant to the organization.\nExcellent communication and interpersonal skills.\nDetail-oriented with a strong commitment to accuracy and precision.\nAbility to work independently and collaboratively with cross-functional teams."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 4",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 23 Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}