{
    "Job ID": "4751624",
    "Description": "المسؤوليات الرئيسية:\nاستراتيجيات الموارد البشرية: وضع وتنفيذ استراتيجيات الموارد البشرية التي تتناسب مع أهداف المؤسسة وتعزز نموها وازدهارها.\nاستقطاب المواهب: تطوير وتنفيذ استراتيجيات استقطاب المواهب لضمان توظيف المرشحين المناسبين والموهوبين في المؤسسة.\nتوظيف واختيار: إجراء عمليات التوظيف والاختيار بعناية، بما في ذلك إعداد الوظائف، وإجراء المقابلات، واختيار المرشحين المناسبين.\nتطوير الموظفين: تطوير وتنفيذ برامج تدريب وتطوير لتعزيز مهارات وأداء الموظفين.\nبرامج المزايا والتعويضات: إدارة وتطوير برامج المزايا والتعويضات لضمان إرضاء الموظفين ومواكبة أحدث اتجاهات السوق.\nتقدير الأداء: تطوير نظام تقييم أداء فعال يعزز تحسين أداء الموظفين.\nتنظيم الهيكل التنظيمي: المساهمة في تطوير وتنفيذ تغييرات في الهيكل التنظيمي لزيادة الكفاءة والفاعلية.\nمراقبة التوجيهات القانونية: ضمان الامتثال للتشريعات واللوائح العمالية السارية وتحديث السياسات والإجراءات بناءً على التغييرات القانونية.\nإدارة العلاقات العمالية: التعامل مع الشكاوى والمشكلات العمالية بطريقة فعالة وتعزيز العلاقات الإيجابية مع الموظفين.Skills",
    "Skills": [
        ".المهارات والمؤهلات:\nخبرة سابقة: خبرة مسبقة كمدير موارد بشرية أو وظيفة ذات صلة.\nإدارة الاستقطاب: خبرة في استقطاب وتوظيف المواهب المؤهلة.\nمهارات الاتصال: مهارات اتصال ممتازة باللغة العربية والإنجليزية.\nمعرفة بالقوانين: فهم جيد للقوانين واللوائح العمالية.\nتطوير الموارد البشرية: معرفة بإدارة التدريب وتطوير الموظفين.\nمهارات التفاوض: قدرة على التفاوض وحل النزاعات بفعالية.\nمهارات القيادة: القدرة على قيادة فريق الموارد البشرية.\nمهارات التحليل: القدرة على تحليل البيانات وتقديم تقارير مستندة إلى الأدلة."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}