{
    "Job ID": "4751335",
    "Description": "Liaise and communicate with relevant departments on materials or services required to deliver the scope of work and fulfill the needs, including consultant/contractor/construction materials etc. \nImplement standardized tendering methods for project procurement, using standard templates, tools and documents that facilitate tender preparation \nAssist in maintaining accurate vendor database (contractors, suppliers, consultants); ensure database reflects the latest information on pricing, delivery time and resources. \nManage end-to-end RFP process-from bid scoping, bid conditioning and evaluation (technical and commercial), shortlisting/selection to award \nPrepare invitation letter in case of pre-qualification and/or, shortlisting for tender Issues.  \nAssist with the preparation of tender documentation with guidance and assistance from relevant departments advising on the most suitable contracting strategy given the scope of work. \nPrepare contract documentation to ensure clarity of scope and requirements for deliverables and timing in line with our client objectives, and draft contract agreements with the most compatible legal and commercial terms. \nIssue documents/contracts for review by Head/Manager-C&P. \nDraft responses to tender queries that relate specifically to contractual, commercial and financial aspects of the tender agreement. \nRecommend vendors based on bids along with vendor scorecards \nCreate and maintain list of Tier 1, 2 and 3 suppliers and their performance scorecards \nCollect feedback from relevant departments on supplier/service performance. \nAssist in negotiation with contractors to ensure the highest quality service at the most effective price. Skills",
    "Skills": [
        "7+ years of experience in a similar position, covering Infrastructure projects, particularly within the Real Estate environment. \nExtensive experience in awarding and managing Infrastructure contracts \nExpert knowledge of Infrastructure tendering and contracts processes commercial, technical, and legal. \nSpecific knowledge of local Infrastructure contract laws and other applicable contractual terms. "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Real Estate",
        "Company Type": "Recruitment Agency",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}