{
    "Job ID": "4751935",
    "Description": "A Plastic Masterbatch producing company located in UAE is seeking a motivated and results-driven Sales Executive to join our dynamic sales team. The Sales Executive will be responsible for identifying potential clients, establishing rapport, and closing deals to achieve sales targets. This role requires excellent communication skills, a deep understanding of our products, and a passion for exceeding customer expectations.Key duties:Identify and research potential clients and leads.\nGenerate new leads through various channels.\nBuild and maintain strong relationships with existing and prospective clients.\nUnderstand client needs and offer solutions.\nAddress client inquiries and concerns promptly.\nDevelop and execute effective sales strategies to achieve and exceed sales targets.\nPresent and demonstrate products or services to clients.\nNegotiate and close sales deals.\nStay updated on industry trends, market conditions, and competitor activities.\nProvide feedback to the management team on market insights and opportunities.\nMaintain accurate records of sales activities, opportunities, and deals in the CRM system.\nWork closely with cross-functional teams, such as marketing and customer support, to ensure a seamless customer experience.Skills",
    "Skills": [
        "Minimum of 5 years of experience in plastic masterbatch international sales\nWillingness to travel as needed.\nProfessional appearance and demeanor.\nApt in dealing with clients and engagingly presenting product data for potential leads.\nAbility to find the right balance between client requirements and company terms, thereby improving profit margins and maintaining fruitful customer relationships."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Algeria; Egypt; India; Jordan; Morocco; Oman; Saudi Arabia; Tunisia; United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28 Max: 45"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Chemicals Manufacture; Petrochemicals & Refined Petroleum Products Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}