{
    "Job ID": "4751872",
    "Description": "This is a full-time on-site role for a Marketing Manager located in Dhahran. The Marketing Manager will be responsible for the following:Conduct market research to identify trends and opportunities\nDevelop and implement strategic marketing plans to achieve business objectives\nCollaborate with cross-functional teams including sales, operations, and culinary departments to ensure successful execution of marketing initiatives.\nManage social media accounts and create content for various platforms.\nEstablish communication with influencers and work with them to achieve marketing objectives.\nAnalyze marketing data and adjust marketing strategies as neededSkills",
    "Skills": [
        "Bachelor's degree in Marketing, Business, or a related field required\n5+ years of experience in marketing and/or advertising with at least 1 year in F&B\nStrong understanding of market research and analysis.\nProven track record of developing and executing successful marketing campaigns\nExperience with influencer marketing\nExperience managing social media accounts\nGood understanding of SEO/SEM, email marketing, event planning, customer acquisition, and retention strategies\nAbility to collaborate with cross-functional teams and interact effectively with management and stakeholders\nCreative problem-solver with a can-do attitude and willingness to take initiative\nExcellent written and verbal communication skills in English and Arabic"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production; FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}