{
    "Job ID": "4751293",
    "Description": "Sales Engineer - Forklifts & Warehouse EquipmentsProduct Knowledge: Develop a comprehensive understanding of various forklift models, warehouse equipment, and related technologies. Stay updated on industry trends, advancements, and competitors' products.\nCustomer Engagement: Identify potential customers and industries where forklifts and warehouse equipment are needed.\nBuild and maintain strong relationships with existing and potential clients.\nAssess customer requirements and recommend suitable equipment solutions.\nProvide technical expertise and guidance to customers during the sales process.\nSales and Marketing: Develop and execute sales strategies to meet or exceed sales targets and revenue goals. Collaborate with the marketing team to create promotional materials and campaigns.\nAttend trade shows, conferences, and industry events to network and generate leads.\nQuoting and Proposals: Prepare accurate and competitive price quotations and proposals for customers.\nWork closely with the sales support team to ensure timely delivery of quotations.\nProduct Demonstrations: Conduct product demonstrations and presentations to showcase the features and benefits of forklifts and warehouse equipment. Address technical questions and concerns from potential customers.Skills",
    "Skills": [
        ".Minimum 3 Years of Experience in UAE.\nMust have sales experience into Forklifts, VNA, Reach Trucks, Scissor Lifts and Order Pickers and other Warehouse Equipment.\nVisiting and arranging meeting with customers, demonstrating service, Negotiating, closing agreements.\nQualification - Bachelors in Mechanical or Automobile Engineering.\n·Proficiency in English and preferably in Arabic\nMust have UAE Driving License\nLocation - Dubai, United Arab Emirates"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Industrial Engineering & Automation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}