{
    "Job ID": "4751835",
    "Description": "Capital Real Estate UAE Hiring Now!!Property Consultant (Female Only)Experience in UAE Real Estate Market only.UAE Residents – Company Location DUBAI – Business Bay - Job applicants must be of Arab Nationalities.This is a full-time, on-site role at Capital Real Estate Broker in Dubai - UAE for as Property Consultant.The role entails identifying and selling properties to potential clients, building relationships with current and prospective clients, providing excellent customer service, and offering creative solutions to optimize sales opportunities. The Property Consultant will be expected to generate leads, conduct market research, and provide timely and accurate reports to management.Job Responsibilities:Conduct calls to potential clients.•          Generate lists of projects for sale, including details such as location and features.•          Promote properties through advertisements and listing services.•          transfer calls to visits and go with prospective clients to developers to close the deals.•          Evaluate the clients’ desires and economic capabilities to discover the appropriate suggestions.•          Mediate negotiations between the prospective clients and developers.•          Ensure all terms of purchase contracts are met.Job RequirementsSkills",
    "Skills": [
        "Excellent written and spoken English",
        "Excellent Communication and Customer Service skills",
        "Independent personality",
        "Motivation for sales",
        "Consulting, Sales, and Real Estate skills",
        "Highly motivated with a sales-oriented mindset",
        "Ability to work in a fast-paced environment as part of a team",
        "Strong negotiation and closing skills",
        "Experience in the real estate developer/Brokerage from ( 2 : 3 ) years.",
        "Proficiency in English and Arabic languages"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}