{
    "Job ID": "4751657",
    "Description": "Key Roles:Ensure the key components of the financial statement are recorded properly &accurately and according to adopted IAS & IFRS.Monitoring the reconciliation of country accounts within the Arab Bank branches,external banks and local branches, moreover, ensure that all accounts are up to dateand followed up.Monitor all country expenses and ensure its adherence to (Budget limits, Guidelines,and proper posting G/L).Accountable for cost accounting and payment control for effective cost managementFollow up / Ensure the timely settlement of outstanding amounts.Participate in managing end of month closing process, and ensure the key componentsof the financial statement are recorded properly and accurately.Ensure that expenses are allocated & reflected in accordance with P&P and budget.Works closely with External and internal Auditors to ensure full compliance andfinancial reporting matches best international practice.Supervising the monthly process of closing fixed assets and review monthlydepreciation of the assets in accordance with the proper classification.Monitor and control Prepayment , accrued expenses internal accounts, stationary,other assets and other liabilities account.Ensures proper supervision of assigned staff in processing payments and maintainingfinancial records within target TAT. Reviews, signs-off payments in accordance withBanking policy and procedures.Ensure proper posting of expenses to correct ledgers and Revision the payment of alltypes of taxes owed on the bank.Ensure the Bank meets vendor expectations and written agreements in relation tohonoring Bank’s payables.Follow up closely on all Tax issues and yearly submissions to Tax authorities andexaminers.Key Performance Indicators:Level of reconciliation correctness and accuracy.Up to date reconciliationsThe reduction in country actual expensesTimeliness and quality of country submitted reportsParticipate in some committees bid opening, and a review ofprocurement committees before being approved by the FinancialController.Skills",
    "Skills": [
        "Education: Bachelor degree in Accounting, Finance, or any related",
        "field, a degree in CPA, CFM, CMA is a plus.",
        "Experience: 9 years experience in Accounting, preferable auditing",
        "experience from a Leading International Regional Bank, and good",
        "experience in MIS projects management.",
        "Competencies:",
        "Fluent in English (Arabic is a plus).",
        "Strong analytical & numerical skills .",
        "Good understanding of Internal and Central Bank work",
        "procedures.",
        "Full knowledge of country regulations .",
        "Team building and team player."
    ],
    "Preferred": {
        "Years of Experience": "Min: 9",
        "Residence Location": "Iraq",
        "Nationality": "Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Banking",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}