{
    "Job ID": "4751796",
    "Description": "We are looking to hire two Account Directors for our offices in Riyadh and Jeddah. If you are looking for a challenging opportunity and you believe that you have what it takes to succeed in such a challenging role, then take a couple of minutes to read the below job description, responsibilities and duties and then apply.Job Description:The Account Director will serve as a liaison between us as an advertising agency and our clients. The Account Director is basically the client servicing executive who will manage the accounts team and will also supervise creatives and other staff to ensure projects meet client expectations and are delivered on time, and within budget. The Account Director pitches ideas to clients, develops strategies for new products and coordinates events.Account Director Duties and Responsibilities:The Account Director will oversee the day-to-day requirements needed to complete tasks for advertising and public relations accounts. This position pitches new clients, drives sales and manages a team of people dedicated to the accounts, working with both internal employees and internal or external clients to meet goals.Examples of tasks an Account Director may need to perform include:Pitch concepts and summarize results during multiple client meetings.Generate sales for client accounts.Create account strategies, leading projects from conception to final execution.Establish goals and objectives for internal teams to follow.Meet deadlines and project budgets.Work with teams to develop materials, coordinate events and provide support and direction.Supervise staff and projects, motivating and mentoring staff to hit goals and produce successful materials for clients, as well as providing feedback.Maintain relationships and serve as the point of contact and liaison for clients.Skills",
    "Skills": [
        "The successful Account Director should have at least 8 years of work experience in the advertising industry.",
        "There are several skills and qualifications the Account Director we are looking for should have, including:",
        "Bachelor’s degree in communications, marketing, public relations",
        "8+ years working at an advertising, public relations or in-house agency",
        "Exceptional storytelling and writing skills",
        "Ability to manage multiple projects and thrive under pressure",
        "A creative mindset and ability to think outside of the box",
        "Exceptional presentation skills",
        "Proven skills or experience in sales can be helpful",
        "Time-management, organization and leadership skills",
        "Strong communication and negotiation skills"
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 8 Max: 15",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 55"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Advertising; Media Production; Events Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}