{
    "Job ID": "4751148",
    "Description": "As a 3D Furniture Modeler, you will play a pivotal role in our creative team, responsible for crafting highly detailed and photorealistic 3D models of furniture items. Your work will contribute to the visual representation of our products, ensuring they are accurately depicted for marketing, design, and e-commerce purposes. This role requires a keen eye for detail, a passion for design, and proficiency in 3D modeling software.Key Responsibilities:3D Modeling: Create accurate and detailed 3D models of various furniture pieces, including chairs, tables, sofas, and other interior furnishings, while maintaining a high level of realism.\nTexture Mapping: Apply textures, materials, and finishes to 3D models to achieve lifelike appearances, considering factors such as wood grain, fabric textures, and reflective surfaces.\nQuality Assurance: Review and refine 3D models to ensure they meet quality standards, match design specifications, and are optimized for performance and rendering.\nCollaboration: Work closely with cross-functional teams, including designers, product managers, and developers, to align 3D models with project requirements and design concepts.\nResearch and Innovation: Stay up-to-date with industry trends and emerging technologies in 3D modeling and rendering to continuously improve the quality and efficiency of our work.\nFile Management: Organize and maintain a library of 3D models, textures, and assets for easy access and reuse in various projects.\nEfficiency and Optimization: Identify opportunities to streamline workflows and optimize the 3D modeling process for increased productivity.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree or equivalent in 3D modeling, computer graphics, or a related field.\nProven experience in 3D modeling and texturing, with a strong portfolio showcasing furniture modeling work.\nProficiency in industry-standard 3D modeling software such as Solid Works, Autodesk 3ds Max, Blender, Maya or similar.\nExcellent attention to detail and a creative mindset.\nStrong problem-solving skills and ability to work collaboratively.\nAbility to meet deadlines and manage multiple projects simultaneously.\nKnowledge of CAD software for precision modeling.\nExperience with parametric modeling for customizable furniture designs."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}