{
    "Job ID": "4751747",
    "Description": "Duties and Responsibilities:\nStaff Common Function:\nTo write and or revise Quality Management procedures when required.\nComply with all safety policies, practices and procedures\nProtect confidential information by not communicating, disclosing to, or using for benefit of third parties.\nTo participate at the identification and resolution of technical non-conformities.\nTo prepare and write technical reports, technical procedures, quotations\nDetailed Function:\nOptimize the use of personnel on sites.\nImplement quality control procedures during disassembly, inspection, and assembly of turbines and related equipment.\nReview disassembly data and clearances and provide recommendations.\nReview unit start-up and post outage operation data and abnormalities.\nDevelop and maintain positive relationship with customer personnel.\nManage outage implementation budget control.\nGenerate detailed field report and daily reports in a timely manner.\nAssist with improvements to outage tools and equipment.\nDevelop, review, revise field procedures, and related technical information.\nInterpret and apply drawings, field procedures, and technical documents to open/close activities.\nHold permits if required\nTo work as TA/Supervisor and Tech is required.\nInstruct training courses for supervisors and mechanical specialists.\nAssist regional offices and other Mitsubishi groups as required.\nSupport the Programme Manager in all technical, commercial and contractual matters\nSupport Programme Management with pre-outage planning for service projects (resource coordination, subcontractor coordination, parts list development and consumables, etc.).\nAssist Programme Management in developing outage schedules for the projects, planned and unplanned maintenance, and outage safety documentation as needed such as (method statements, and risk assessments).\nForecast and schedule resources for field service outages.\nProvide support for post outage activities (site restoration and parts shipment) upon completion services.\nProvide support to Programme Management for proposal development (work scope documents, Division of Responsibilities document, etc.).\nSupport customer/internal negotiation and implementation meetings as required.\nInterface on site with service organizations (MPSA/MHI/MP) as needed in order to plan outage implementation requirements.\nAssist Programme Management in developing cost estimates for Gas Turbine.\nReporting.\nOther Duties and Responsibilities:\nResponsible of the communication with all involved parties i.e. Programme Manager, Inventory Department, London Engineering, MPSS, MHI, MPSA, MP, vendors\nResponsible to solve Customers technical problems (“end” Customer and “internal” Customer)\nTemporary responsible of the daily responsibilities of Programme Manager in case of his absence.\nTo approve the service release.Skills",
    "Skills": [
        "In Communications (conversation and writing of official letters) with client, subcontractors and own organisation.\nDiplomacy\nAble to lead an outage team\nNegotiation skills\nAbility to work in a multidisciplinary team with people with different cultures and nationalities"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Technical Maintenance & Repair",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}