{
    "Job ID": "4751914",
    "Description": "B2B Sales Representative - QatarAs a B2B representative, you will be responsible for building an effective sales workflow, generating leads and meeting sales targets. Duties will include prospecting, networking and presenting to potential customers. In order to be successful in this role, you should have previous experience in a sales role and be able to demonstrate strong communication skillsResponsibilities:• Negotiating contracts with clients to ensure mutual satisfaction with each transaction• Preparing proposals for new business opportunities or contracts with existing clients• Developing and maintaining relationships with clients to increase future business opportunities• Scheduling appointments with prospective clients to discuss products or services offered by the company• Creating client proposals based on product information provided by marketing staff members• Keeping track of all communications with clients, such as emails, phone calls, letters, and faxes• Reviewing proposals from clients for possible problems or conflicts with company policies• Identifying potential customers through research and networking activities, then contacting them to set up meetings or presentations• Managing accounts receivable and payable, including sending billing notices, collecting payments from clients, and submitting payments to vendors for supplies used in projects• Researching market trends to identify opportunities for new products or services that might appeal to specific clientSkills",
    "Skills": [
        "Bachelor’s degree in Business Administration, Sales & Marketing or relevant fields.",
        "• 5-7 years of proven experience in a similar role and previous experience in dealing with business-to-business contracts/interactions.",
        "• Excellent strategic planning abilities",
        "• Ability to develop specific goals and plans to prioritize, organize, and accomplish the work.",
        "• Understanding contract negotiations and proposal development",
        "• Strong Negotiation skills and persuading ability",
        "• The ability to use logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems",
        "• Be able to multi‐task and prioritize so that deadlines are met in a timely and accurate manner.",
        "• Customer oriented.",
        "•  Emotional intelligence.",
        "•  High level of verbal and written communication skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Qatar",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Energy & Renewables; Facilities & Property Management; General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}