{
    "Job ID": "4751654",
    "Description": "Preference to Candidates :having NEBOSH certificateHaving UAE Job ExperienceQualification:BE / Diploma Civil or Equivalent+ Advance diploma in industrial Safety [ADIS] or equivalent.Experience : 2- 5 years in SafetyJob BriefWe are looking for a responsible Safety Officer to facilitate compliance with occupational health and safety (OHS) guidelines. You will provide advice on measures to minimize hazards or unhealthy situations. You will also be on a constant lookout for violations.The ideal candidate will be a responsible individual who swears by OSH regulations. Your work will be largely focused on prevention so you need to be conscientious and farsighted. The ideal candidate will also be detail-oriented and ready to act in emergencies.The goal is to establish a safe workplace according to legal standards and foster a culture of attention to health and safety.ResponsibilitiesSupport the development of OHS policies and programs\nAdvise and instruct on various safety-related topics (noise levels, use of machinery etc.)\nConduct risk assessment and enforce preventative measures\nReview existing policies and measures and update according to legislation\nInitiate and organize OHS training of employees and executives\nInspect premises and the work of personnel to identify issues or non-conformity (e.g. not using protective equipment)\nOversee installations, maintenance, disposal of substances etc.\nStop any unsafe acts or processes that seem dangerous or unhealthy\nRecord and investigate incidents to determine causes and handle worker’s compensation claims\nPrepare reports on occurrences and provide statistical information to upper managementSkills",
    "Skills": [
        "Proven experience as safety officer\nIn depth knowledge of legislation (e.g. OSHA/EPA) and procedures\nKnowledge of potentially hazardous materials or practices\nExperience in writing reports and policies for health and safety\nFamiliarity with conducting data analysis and reporting statistics\nProficient in MS Office; Working knowledge of safety management information systems is a plus\nOutstanding organizational skills\nDiligent with great attention to detail\nExcellent communication skills with the ability to present and explain health and safety topics"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "India; Qatar; Saudi Arabia; United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Degree": "Certification / diploma",
        "Age": "Min: 21 Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Civil Engineering; Construction & Building; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "2"
    }
}