{
    "Job ID": "4751909",
    "Description": "On behalf of our client, we are seeking for Horeca Sales Manager who will be responsible for supervising all sales activities, achieving sales targets, actively seeking out new sales opportunities through cold calling, networking, and social media, identifying selling possibilities, evaluating customer needs and ensure the service levels are as per the company standards.Roles & Responsibilities:Identify opportunities for expanding sales channels, including coffee shops, bakeries, schools, health clubs, and similar locations.\nAllocate sales personnel to pre-defined and balanced routes that optimize sales opportunities and coverage within the available time, aligned with the sales force's skills and expertise.\nEnforce the implementation of company policies, programs, schedules, and directives within the designated area.\nReview and analyze sales reports and schedules from all sales representatives, offering guidance, advice, and direction to enhance their activities.\nCollaborate with sales representatives and merchandisers to periodically assess sales objectives for current and potential customers, as well as sales and merchandising demands for effective coverage.\nMonitor records and reports of customer visits, sales, and achieved outcomes.\nMaintain meticulous records as required by management and promptly submit all requested reports.\nConduct daily checks and reports on sales calls and returns made by the assigned sales team.\nEnsure comprehensive coverage of all customers, recording details such as addresses, phone numbers, and customer classifications based on product movement.\nDevelop daily, weekly, and monthly sales plans for sales representatives, outlining a list of sales points to be visited within those timeframes.\nEnsure comprehensive coverage of all customers according to sales and merchandising plans, including accurate and timely deliveries.\nMonitor returns in adherence to the \"No Return Policy.\"\nIdentify strong, growing, and underperforming customers and devise solutions.\nConduct monthly performance evaluations of sales representatives, considering sales and returns, and recording results for year-end assessment.\nEnsure timely departure of sales representatives to guarantee timely and appropriate product delivery to customers.\nHandle all complaints related to sales representative behavior, product quality, and customer relations, maintaining the company's positive image.\nRegularly review and adjust customer accounts to ensure full coverage.\nStrategically cover the designated area to optimize sales growth.\nProvide training to company staff, enabling them to perform effectively, interact positively with clients, and enhance the company's sales and brand image.\nStay well-informed about the local market, competition, customer conditions, consumer preferences, and industry trends, and promptly communicate such information with recommendations to the Head Office.\nReport any launches of competitive brands or SKUs with comprehensive details.\nAssist in conducting market surveys as needed by the management.\nCollaborate with company executives, department heads, and other personnel as required to achieve increased sales volume and customer satisfaction.Skills",
    "Skills": [
        "Bachelor's Degree in Business Administration or related field.\n7+ years of experience, with a minimum of 5 years of similar experience to the responsibilities of this job.\nThorough knowledge and experience of marketing and sales.\nPresentable, self-motivated, and driven by targets.\nIn-depth knowledge of company products.\nFluent in Arabic and English.\nValid driving license."
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}