{
    "Job ID": "4751848",
    "Description": "About UsWe are at the forefront of redefining the hospitality experience, leveraging state-of-the-art technology to transform the way hotels, restaurants, and various businesses within the sector engage with their guests. If you're an imaginative, strategic individual with a passion for marketing groundbreaking products, you're in the right place. Job OverviewWe are in search of a dynamic and experienced Marketing Manager to lead our marketing team. In this role, you will be responsible for defining and executing marketing strategies to increase brand awareness, drive user engagement, and ultimately grow revenue. You will work closely with other departments and report directly to the COO. Key ResponsibilitiesDevelop and implement a comprehensive marketing strategy to build brand equity, awareness, and customer acquisition.\nLead and manage a team of marketing professionals across various disciplines (digital marketing, PR, content, etc.)\nCreate, execute, and monitor performance of all marketing campaigns and advertisements across various channels.\nAnalyze key performance indicators (KPIs) to measure campaign effectiveness and to guide future marketing strategies.\nPartner with Sales and Product teams to develop and implement strategies for product launches, customer engagement, and revenue growth.\nManage the marketing budget and ensure high ROI on marketing spend.\nContinuously evaluate the competitive landscape and market trends to inform marketing strategies. QualificationsBachelor's degree in Marketing, Business, or a related field. Master's degree is a plus.\nMinimum of 5 years of experience in a senior marketing role, preferably in the technology or hospitality industry.\nStrong leadership skills, with proven ability to manage and inspire a team.\nExpertise in various aspects of digital marketing including SEO, SEM, Social Media, Email Marketing, and Content Marketing.\nExcellent communication, analytical, and project management skills.\nProven track record in developing and executing successful marketing campaigns.\nFamiliarity with marketing software and analytics tools, including CRM platforms.Skills",
    "Skills": [
        "Qualifications",
        "Bachelor's degree in Marketing, Business, or a related field. Master's degree is a plus.\nMinimum of 5 years of experience in a senior marketing role, preferably in the technology or hospitality industry.\nStrong leadership skills, with proven ability to manage and inspire a team.\nExpertise in various aspects of digital marketing including SEO, SEM, Social Media, Email Marketing, and Content Marketing.\nExcellent communication, analytical, and project management skills.\nProven track record in developing and executing successful marketing campaigns.\nFamiliarity with marketing software and analytics tools, including CRM platforms."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}