{
    "Job ID": "4752125",
    "Description": "Key Responsibilities:Product Knowledge:Develop a deep understanding of the pharmaceutical products, medications, and medical devices offered by the company.\nStay informed about industry trends, competitors, and the latest developments in healthcare.Customer Engagement:Identify and target healthcare professionals, including physicians, pharmacists, and hospital staff, as potential clients.\nBuild and maintain strong relationships with healthcare providers and decision-makers.\nArrange meetings and presentations to introduce products and discuss their benefits.Sales and Marketing:Develop and implement effective sales strategies and plans to meet or exceed sales goals and revenue targets.\nCollaborate with the marketing team to create promotional materials and educational resources.\nAttend medical conferences, seminars, and exhibitions to network and generate leads.Product Presentations:Conduct product presentations and demonstrations to healthcare professionals, highlighting the efficacy, safety, and clinical benefits of pharmaceutical products.Skills",
    "Skills": [
        "According to the following requirements: ",
        "1) Should have more than 5 years experience in pharmaceuticals manufacturing.",
        "2) Should have more than 5 years experience in pharmaceuticals marketing.",
        "3) Should be familiar with pharmaceuticals in Saudi Arabia local market.",
        "4) Should have connections with purchasing and operations departments in many pharmaceutical plants in Saudi Arabia.",
        "5) Marketing Skills",
        "6) Negotiation"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Pharmaceutical Manufacturing; Pharmacies",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}