{
    "Job ID": "4752735",
    "Description": "Job Purpose:Responsible to deliver exceptional customer service, answering all customer questions and concerns regarding Mohamed Naser Al – Hajery & Sons Medical Equipment to ensure Customers make the most informed buying choice possible, while complying with Mohamed Naser Al – Hajery & Sons Policies and Procedures.Product Specialist ActivitiesContinuously expand knowledge of all Mohamed Naser Al – Hajery & Sons SHC department product lines.\nImplement and ensure delivery of exceptional customer service in line with Mohamed Naser Al – Hajery Standards.\nAnswer all questions accurately and address all concerns that the customer may have regarding any of Mohamed Naser Al – Hajery Medical Product Line up.\nEnsure to lead Customers to make the correct decision regarding which product is the right choice for their specific needs.\nDemonstrate product functionality accurately, completely and competently and in line with Mohamed Naser Al – Hajery Policies and Procedures.\nCommunicate all technical specifications to Customers to ensure awareness of the same.\nExpand relationships with existing customers by directing and supporting collaborative sales efforts to grow one or more assigned product lines.\nClose qualified opportunities referred by the Sales Representative, Medical Representatives, or other sales personnel, while actively collaborating with these team members.\nLead demand-generating marketing activities in the assigned market for the assigned product specialty.\nRemain in compliance with regulatory and Mohamed Naser Al – Hajery & Sons guidelines at all times.\nLog all customer contacts including contact information for follow-up by SHC Sales Team, when needed.\nOffer related products and services to new customers.\nPerform other duties related to the job as assigned by the Direct Manager.Skills",
    "Skills": [
        "Skills & Qualification",
        "Bachelor’s degree in Surgical/Medical or equivalent \nMaster’s Degree would be an advantage.\nMinimum of 4–6 years of experience in the same or related field.\nCommunication Skills\nProblem Solving Ability\nOrganizing and Planning Skills\nAnalytical\nTeam Work\nDetail Oriented\nNegotiation Skills\nInterpersonal Skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 6",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Medical & Healthcare Equipment; Medical Hospital; Pharmaceutical Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}