{
    "Job ID": "4752970",
    "Description": "Position Title:              Senior Market Intelligence AnalystEmployment Type:      ConsultantSalary:                         up to 45K AED all-inclusive depending on experience and qualificationJob Location:              UAE About the Client:  A leading oil and gas company in UAE Job Description:  Conducting market research: The analyst will be responsible for conducting market research and competitive analysis to understand the trends and dynamics of the oil and gas market, including supply and demand, pricing, and industry regulations.\nDeveloping marketing strategies: Based on the insights generated from the market research, the analyst will collaborate with the marketing team to develop marketing strategies that align with the company's objectives and goals and consider the unique challenges and opportunities of the oil and gas industry.\nAnalysing marketing campaigns: The analyst will monitor and analyse the performance of marketing campaigns, such as trade shows, conferences, and digital marketing, to identify areas for improvement and optimization. They will work closely with the marketing team to make data-driven decisions and improve campaign effectiveness.\nCreating marketing dashboards: The analyst will be responsible for creating and maintaining marketing dashboards that provide senior management with a clear understanding of the effectiveness of marketing campaigns and their impact on business performance, as well as key performance indicators (KPIs) related to the oil and gas industry.\nForecasting and budgeting: The analyst will work closely with the finance and control team to create marketing budgets and forecasts that align with the company's financial objectives and reflect the specific challenges and opportunities of the oil and gas industry.\nProviding insights to senior management: The analyst will provide senior management with regular reports and presentations that highlight trends and opportunities in the oil and gas market, and offer recommendations on how the company can optimize its marketing strategies to achieve its objectives. They may also collaborate with other departments, such as supply chain and operations, to ensure that marketing strategies are aligned with broader business objectives.Skills",
    "Skills": [
        "Qualifications: ",
        "Must have a Bachelor’s Degree in Finance and relevant field\nAt least 15 to 20 years of experience in the oil and gas industry\nImmediate joiners will be prioritized",
        " "
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 35 Max: 60"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$10,000 - $15,000",
        "Number of Vacancies": "1"
    }
}