{
    "Job ID": "4752898",
    "Description": "Job DescriptionWho are we?At Bayt.com we are committed to empowering people to lead better lives by providing them with the tools and information to build their lifestyle of choice. We are passionate about our services and seek to deliver the best experience for our customers. Not only are we devoted to our work and customers but most meaningfully to each other's success. We want to better every life we come in contact with and have a lasting positive impact on the community. What do we value?1- We strive to be the best 2- We obsess about empowering others to lead better lives3- Create value by doing more with less4- Embrace change with a positive attitude5- Communicate openly, honestly, and often Job SummaryAs Business Development Officer you will be responsible for driving the business growth of the company by developing a network of contacts and by scheduling potential clients on behalf of the relationship managers. Job Description Responsible for promoting the company and its value proposition for C-suite executives and HR professionals.\nSchedule qualified appointments with prospective clients over the phone on behalf of the relationship managers\nEnsure the growth of a quality company and email lists for high-yielding campaigns.\nConstantly be on the lookout for resources of companies, human resources professionals, and C-Suite executives.\nUpdate CRM for all historical interactions with companies\nConduct online research to update CRM database info - companies' contact details, edit inaccurate data, and delete duplicate\nEnsure data repository integrity and reliability\nCarry out other marketing, sales, and operational activities as requested by the management.\nConduct research by calling all new companies to create records with all mandatory fields of all companies in CRM.Skills",
    "Skills": [
        " Skills",
        "Qualification",
        "Diploma or Bachelor's Degree preferably in Business administration, Sales and Marketing, or any related field.\n 1+ years of proven working experience experience in a sales, marketing or customer service role  is preferred\nFluency in English and or Arabic is a must (Any additional languages would be an advantage)",
        "Required Skills",
        " Ability to work independently and with others.\nStrong negotiation skills \nAbility to build rapport with clients \nExcellent written and verbal communication skills.   \nAttention to details\nExtremely organized with strong time-management skills\nProcess-oriented and systematic"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 0 Max: 2",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}