{
    "Job ID": "4752543",
    "Description": "A leading private sector company in Saudi Arabia is seeking a highly skilled and experienced Technical office manager to join their team. The Technical office manager will be responsible for overseeing the day-to-day operations of the office, managing administrative tasks, and providing technical support to the team. This is a challenging and rewarding role that requires strong leadership abilities, excellent problem-solving skills, and the ability to work under pressure. The successful candidate will have a proven track record of delivering high-quality results and will be able to effectively communicate with both internal and external stakeholders.Responsibilities:Oversee the day-to-day operations of the office, ensuring that all administrative tasks are completed accurately and efficiently.\nManage the office budget, including tracking expenses and preparing financial reports.\nCoordinate with other departments to ensure that all technical requirements are met.\nProvide technical support to the team, including troubleshooting hardware and software issues.\nDevelop and implement office policies and procedures to improve efficiency and productivity.\nMaintain office equipment and supplies, including ordering new supplies as needed.\nManage the office calendar and schedule appointments and meetings.\nPrepare and distribute meeting agendas and minutes.\nCoordinate travel arrangements for the team, including booking flights and accommodations.\nHandle confidential and sensitive information with discretion.Skills",
    "Skills": [
        "The ideal candidate will have a minimum of 9 years of experience in a similar role and possess exceptional organizational and technical skills.",
        "Preferred Candidate:",
        "Minimum of 9 years of experience in a similar role.\nBachelor's degree in a relevant field.\nStrong leadership abilities and the ability to manage and motivate a team.\nExceptional organizational and time management skills.\nExcellent problem-solving and decision-making abilities.\nAbility to work under pressure and meet tight deadlines.\nExcellent communication and interpersonal skills.\nProficiency in Microsoft Office Suite.\nAbility to multitask and prioritize tasks effectively.\nKnowledge of office management systems and procedures."
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Age": "Min: 30 Max: 50"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}