{
    "Job ID": "4752974",
    "Description": "Greet customers in a friendly and welcoming manner, and approach them to offer assistance and determine their needs.\nMaintain a professional and presentable appearance at all times.\nUse your knowledge of sanitary and tile products to advise customers on suitable products, features, and benefits.\nAchieve personal sales targets by converting as many customers as possible into making a purchase.\nFoster a culture of cooperation, professionalism, and optimism within the sales team, while displaying a positive attitude at all times.\nRegularly check and maintain your area of the showroom, ensuring that products are replenished, displays are clean and tidy, and issues are resolved promptly.\nImplement promotions, layout changes, and seasonal moves within the showroom effectively.\nHandle products safely and carefully to minimize damage and keep shrinkage costs to a minimum.\nMaintain regular, open, and honest communication with the Section Head / Showroom Supervisors.\nProvide feedback to the Section Head on the product, pricing, and commercial matters, gathered from customer interactions and your own observations.Skills",
    "Skills": [
        "High school diploma or equivalent; some college coursework in sales, marketing or related field preferred.\nPrevious experience in sales in the sanitary and tile industry.\nIn-depth knowledge of sanitary and tile products, features, and benefits.\nStrong communication and customer service skills.\nAbility to meet personal sales targets and work independently.\nPositive attitude and ability to foster a cooperative and professional team environment.\nAttention to detail and ability to maintain a clean and organized showroom."
    ],
    "Preferred": {
        "Residence Location": "All GCC Countries; Kuwait; Lebanon"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}