{
    "Job ID": "4752683",
    "Description": "Provide technical sales support and application design of Low Voltage, Services & solutions, and support sales representatives in the field or meeting.\nDesign and prepare bills of quantities for comprehensive Low Voltage for businesses, commercial & industrial clients, etc.\nProvide expert-level technical design and assistance to the sales team/presales team in the field of Low Voltage.\nPlan, design &/or engineer Low Voltage.\nProvide guidance, direction, and assistance in the resolution of customer issues, presales team, and sales team.\nContribute to Requests for Pricing (RFPs) and Requests for Information (RFI’s) responses.\nBuild, maintain, and enhance customer relationships as applicable.\nEnsure complete customer satisfaction which should result from proficient design and honest commitment.\nCheck design compatibility/fitness of proposal for Low Voltage.\nPreparing Technical submittals for projects designed and supporting if required team members' technical submittals.\nSustain a positive teamwork environment when required.\nContact vendor and manufacturer and follow up on requested quotes and designs.\nFully responsible on Bill of quantity and proposals prepared.Skills",
    "Skills": [
        "Degree qualification in a related field\n7- 10 years of experience in Low Voltage specially in (experience in Physical security ((CCTV, Barriers, Access Control, Audio Visual solutions, Networking and Communications ,Infra structure cabling & Data Centers.))\nAt least completed 3-5 mega projects in Low Voltage",
        "Minimum Certification requirements CCNA, MCSE,"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7 Max: 10",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}