{
    "Job ID": "4752951",
    "Description": "Job Responsibilities:· Maximize income generation for the company and achieve sales targets.· Coordinate all aspects of the sales process from initial inquiry through to the closing of the opportunity.· Generate project/business opportunities to meet the company’s business plans and growth strategies.· Ensure that all marketing materials, documents, and correspondence are updated and adhered to the corporate image.· Always professionally represent the company.· Develop solid, long-term relationships with prospects and maintain existing customer relationships within the commercial construction industry.· Follow up with the client during the execution of the project.· Track and report the current status of potential projects, markets, Customer news, and developments.· Lead the development and preparation of RFPs, Pre-Qualification, formal presentations, proposal, and contracts.· Ensure all communication with customers is by our standards and correct in content and format.· Implement Company Policies and Procedures.· Perform other duties as assigned.Required Qualification:· Bachelor’s degree preferably in engineering or business administration with a strong Sales background.· 3+ years prior work experience in Project Sales, Business Development, or related positions.· Demonstrated results in meeting sales quotas or business development goals.· Proficiency in using Ms 360 tools & CRM software to track and analyze sales metrics.· Excellent written and verbal communication skills. Fluency in Arabic is a plus.· Preferable experience in construction/fit-out/ electromechanical industries. Knowledge and hands-on experience in building materials, bathroom equipment, and swimming pool fittings will be appreciated.· Knowledge of the sales process with the ability to understand and interpret customer needs using fact-finding to identify sales opportunities.Skills",
    "Skills": [
        "Job Details",
        "- Career Level: Mid-Career",
        "- Years of Experience: Minimum three (3) years of experience in UAE/Dubai",
        "- Residence Location: Dubai, United Arab Emirates",
        "- Degree: bachelor’s degree / higher diploma in Engineering or business administration",
        "- Age: Minimum 25 and Maximum 40",
        "- A UAE Driving license is mandatory.",
        "- Preference for the immediate joiners who are based in Dubai.",
        "Industry",
        "Health, Wellness & Fitness"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}