{
    "Job ID": "4752805",
    "Description": "Responsibilities:Act as the primary point of contact between the company and government entities.\nEnsure compliance with all relevant laws and regulations.\nPrepare and submit all necessary paperwork, permits, and licenses required for the company's operations.\nMonitor changes in regulations and provide guidance to internal stakeholders.\nDevelop and maintain positive relationships with government officials.\nAdvocate for the company's interests with government entities.\nAttending meetings and conferences with government officials.\nKeep abreast of political and economic developments that may Impact on the company.\nCollaborate with internal departments to ensure compliance with government regulations.\nPrepare reports and presentations on government relations activities.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Must have experience in Handling Govt portals like, QIWA, GOSI, Muqeem, Mudad, Taminat\nBachelor’s degree in political science, Public Administration, or a related field.\nExperience working in government relations or a related field.\nStrong knowledge of Saudi Arabia's political and regulatory landscape.\nExcellent communication and negotiation skills.\nAbility to build and maintain relationships with government officials.\nAttention to detail and strong organizational skills.\nAbility to work independently and handle multiple tasks simultaneously.\nProficient in Microsoft Office Suite.\nFluent in Arabic and English, both written and spoken.\nStrong analytical and problem-solving skills.\nKnowledge of government regulations and procedures\nStrong networking and relationship-building skills\nExcellent communication and interpersonal skills\nAbility to handle sensitive and confidential information\nDetail-oriented and organized"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 20",
        "Residence Location": "Dammam, Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}