{
    "Job ID": "4752583",
    "Description": "Duties & Responsibilities:Act as a liaison among all parties including legal affairs, holding company, subsidiaries, and external stakeholders for all legal matters.\nAssist management with drafting legal documents, including contracts, agreements, legal opinions, correspondence, and other documents.\nFacilitate, save, track, and coordinate all contracts.\nAssists in implementing changes to contracts to comply with legislation/regulations.\nRenewing and maintaining company licensing.\nLiaison and process documents as may be required with government entities for company-related work.\nResponsible for reviewing, tracking, and monitoring legislation that impacts the company’s processes.\nManage and organize legal files and documents.\nAttend meetings and participate in conference calls as required.\nUpdating management with timely analysis and summaries of new legislation/regulations affecting the business.\nResponsible for support related to litigation, mediation, arbitration, and responses to complaints.\nSchedule meetings when needed.\nConsult with internal and external partners as necessary.\nKeeping track of changes in the legal framework providing timely updates on these changes and following up with outside counsel for this purpose.\nPerform legal research, investigate facts, and develop arguments.\nMonitor changes in legal frameworks and provide timely updates, following up with outside counsel as necessary.\nConduct research, investigate facts, and develop legal arguments.Skills",
    "Skills": [
        "Requirements:",
        "Proficiency in English and Arabic, both written and verbal.\nExcellent understanding of the basic principles, concepts, and methodology of legal proceedings.\nStrong organizational skills and attention to detail, with the ability to multi-task effectively in a high volume and complex environment with changing priorities.\nProficient Word Processing Skills, including Outlook, Word, PowerPoint, and Excel.\nStrong interpersonal skills.\nExcellent organizational skills, research skills, analytical skills, critical thinking skills, planning and organizing, and information monitoring.\nDemonstrate a comprehensive understanding of legal practices, principles, research methodologies, terminology, and communication norms.\nExhibit outstanding skills in organization, research, analysis, critical thinking, planning, and monitoring information.\nPossess extensive knowledge of legal principles, practices, research techniques, terminology, and communication protocols."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 7",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Investment, Securities & Funds",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Legal",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}