{
    "Job ID": "4752531",
    "Description": " Complete lifecycle management of internet technology and web3 blockchain products, from market research and analysis, conceptual planning, product design to development and launch.2. Conduct requirements analysis, prototype design, requirements design, development advancement, and product iteration.3. Plan the front-end and back-end modules of the product, product functionality, interactive interface, and flowchart design.4. Coordinate with development, testing, operations, design, and project resources to ensure product launches as planned and be responsible for the final product outcome.5. Responsible for product operations, channel operations, and online operations, acquire user traffic, promote user conversion, and enhance operational efficiency.6. Monitor the operation of live products, compile user feedback, periodically analyze competitors' movements, and improve the product based on data analysis. Complete regular product iterations.7. Assist with other product-related tasks.Skills",
    "Skills": [
        "1. Fluent in both Chinese and English, communication with overseas partners is required.",
        "2. Prior experience in blockchain, internet technology, and digital marketing is preferred.",
        "3. Knowledge or experience in the computer industry is a plus.",
        "4. Good communication skills, a high sense of responsibility, a spirit of teamwork to overcome challenges, strategic thinking, determination and perseverance to grow together; innovate and create, independent thinking, and eagerness to grow."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}