{
    "Job ID": "4752738",
    "Description": "-Identify equipment and spare parts needs based on sales forecasts and customer demands.· Collaborate with the sales and operations teams to determine procurement requirements and priorities.· Research potential suppliers, comparing pricing, quality, and delivery options.· Negotiate favorable terms, pricing, and delivery schedules with suppliers.· Maintain strong relationships with existing suppliers and cultivate new vendor partnerships.· Ensure timely and accurate processing of purchase orders and related documentation.· Monitor inventory levels and optimize stock levels to meet customer demands and minimize excess stock.· Conduct regular market analysis to stay updated on industry trends and pricing fluctuations.· Coordinate with logistics and warehouse teams to ensure smooth inbound shipments and inventory management.· Resolve any discrepancies or issues related to orders, deliveries, and invoices.· Track and report key performance metrics related to procurement activities.Skills",
    "Skills": [
        "· Bachelor's degree in Business Administration, Supply Chain Management, or a related field (preferred but not required).",
        "· Proven experience in purchasing, procurement, or supply chain management, preferably in the heavy equipment / spare parts (preferred).",
        "· Strong knowledge of heavy equipment and spare parts, including technical specifications and industry standards.",
        "· Excellent negotiation skills and the ability to build and maintain strong vendor relationships.",
        "· Proficiency in using SAP is a plus.",
        "· Strong analytical and problem-solving abilities.",
        "· Effective communication skills and the ability to work collaboratively in a team environment.",
        "· Detail-oriented with a high level of accuracy in processing orders and documentation.",
        "You can share your CV to lady(dot)dupaya(at)zpmc(dot)ae",
        "· Ability to work under pressure and meet tight deadlines."
    ],
    "Preferred": {
        "Gender": "Male",
        "Nationality": "Philippines"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}