{
    "Job ID": "4752550",
    "Description": " Organization Skills - Is systematic with regard to evaluating project status and is able to balance key dimensions of project status (e.g., schedule in MS Project, budget in Microsoft Dynamics, resources MS, etc.) against one another.\nOrganization Skills - Is systematic with regard to evaluating project status and is able to balance key dimensions of project status (e.g., schedule in MS Project, budget in Microsoft Dynamics, resources MS, etc.) against one another.\nJudgment - Able to make and defend decisions (e.g., regarding project quality standards); makes timely decisions exhibiting sound rationale, includes appropriate people in decision-making processes, and supports decisions with facts and data.\nAccuracy - Ensures that complete and comprehensive information has been received and vetted to correctly convey divisional and corporate status to the overall Strategic Plan.\nDependability - Takes responsibility for own actions and adheres to deadlines; requests and offers help, as needed.\nAnalytical - Able to structure project deliverables and tasks based on conveyed objectives; gather and interprets data required to make project decisions, complementing these with intuition and experience to develop meaningful recommendations.\nProblem Solving - Able to review projects which are behind plan and make recommendations regarding time, budget, and/ or resource allocation; understand when to escalate issues to superiors and/ or divisional leadership.\nOral Communication (English & Arabic) - Speaks persuasively to project resources; is comfortable presenting challenging findings to groups; listens well and requests clarification, when required; responds to requests promptly and professionally.\nWritten Communication (English & Arabic) - Captures information using PMO templates; oversees written communication from the PMO to divisional stakeholders, as required.\nInterpersonal - BJob Details",
    "Skills": [],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 7",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Management",
        "Employment Type": "--",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}