{
    "Job ID": "4752955",
    "Description": "EXCELLENT LEVEL OF WRITTEN AND SPOKEN FRENCH IS A MUSTThe Company: Prodie Santé is a company specialized in the recruitment of Doctors worldwide, and a member of the United Nations Global Compact.A few key points about Prodie Santé: - We are specialists in the ethical recruitment of healthcare professionals (doctors, surgeons and nurses) worldwide. - We have 25 years' experience dedicated exclusively to the healthcare sector. - We have created a medical community of over 350,000 practitioners on every continent. - We are a \"Golden Member\" of the United Nations Global Compact, and as such, are accountable to the UN for the ethical standards of our practice. - We recruit caregivers for 3,000 hospitals and clinics in 50 countries. - We have developed a capacity for immediate mobilization of large-scale healthcare personnel.- We are the agent for internationally renowned Flying Visiting Doctors.- We founded the \"Alliance des Médecins en situation d'exil dans le monde\" (doctors in exil’s situation) developed a humanitarian aid program for poor countries. - We created the NGO \"Prodie Philanthropy\", whose message is embodied by the international French actor Jean Reno.Prodie Santé is a reliable and efficient partner for all doctors, and a major asset for healthcare systems and the generalization of access to care. Missions: - Search, selection and positioning of candidates (physicians of all medical and surgical specialties) for various customer requests (temporary assignments and permanent jobs).- Recruitment, Locum, Matching profiles- Talent pool management- Customer portfolio retention and developmentSkills",
    "Skills": [
        "Profile required:",
        "Swiss Army knife! You're a proactive thinker, able to challenge yourself without getting bogged down by the first obstacle and get things moving in line with the company's DNA. You are resourceful and versatile, dynamic, loyal and have an excellent level of written and spoken French. You have an acute sense of confidentiality, as well as an eye for detail and rigor. You have good interpersonal and commercial skills.",
        "Roles & Responsibilities",
        "EXCELLENT LEVEL OF WRITTEN AND SPOKEN FRENCH IS A MUST\nresourceful\nversatile\ndynamic\nacute sense of confidentiality\nan eye for detail and rigor\ngood interpersonal\ncommercial skills.",
        "Job location: Dubai (United Arab Emirates) ",
        "Starting date: September or October 2023 ",
        "Conditions : ",
        "- Training and supervision ",
        "- Salary according to profile and experience ",
        "- Health insurance"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}