{
    "Job ID": "4752581",
    "Description": "The Role : The Sales Manager is responsible for the sales & commercial partnership for the countries assigned to him/her. This primarily includes comprehensive distributor management. In this role the SM will be responsible for planning sales to the distributor based on the agreed target, ensuring timely input of purchase plans, managing the distributor sell out by taking needed actions, optimizing value for the brand, building a reliable communication chanel with the distributor & driving distribution excellence in the countries assigned. Reporting Structure & Relationships :The Sales Manager – HA reports to the CE HOD. He interacts externally with customers & internally develops close working relationships with Supply Chain, Finance, Service & Marketing who are involved in execution.  Key Areas of Responsibility :To achieve the targeted Sales Revenue, Sales Quantity & Product- mix.\nTo achieve the targeted profit margin, planning /forecast accuracy & timely payments from customers\nTo deploy the Annual, Target Letter to the distributors/ countries in consultation with deputy Director\nTo carry out periodic Distributor Business Reviews, Assessment and Distribution Effectiveness\nTo provide timely inputs of distributor’s purchase plans to the HA Product Planner  \nTo agree with the distributor the Annual Marketing Plan & Activities and to ensure full visibility of its implementation. This includes space rentals with Key Accounts & promoter deployment.\nMaintaining Key Account interface & relationships in the countries\nLocking – in financial commitments (like rebates, support etc.) with GM & Finance team based on pre-agreed discussions & contractual terms with distributor.\nProviding a regular update of market intelligence on competition pricing, market trends, benchmarking, distribution and visibility. Skills",
    "Skills": [
        "Skills, Capabilities & Attitude :",
        "Good understanding of the Home Appliances business & the Consumer Electronics industry in general\nGood level of communication & interaction skills\nAbility to manage discussions at various levels internally & externally\nStructured, methodical & detailed way of working \nAbility to work under pressure & flexible in approach\nTeam player – willing to go the extra mile\nIT skills – MS office (Excel, Word & Powerpoint)\nSAP experience preferred",
        "Education & Experience :",
        "Minimum requirement - Graduation level. MBA- preferred\nMinimum experience of 3 – 5 years in a distributor management role in consumer electronics especially HA and preferably with a known brand\nKnowledge of GCC markets is an added advantage"
    ],
    "Preferred": {
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}