{
    "Job ID": "4752870",
    "Description": "We are Urgently looking for an efficient, courteous cashier , Waiter and Waitresses who possesses excellent customer service skills.The cashier will scan the customer’s selections, ensure that prices and quantities are accurate, accept payments, issue receipts, answer inquiries, and provide helpful information to customers products, promotions, or item location. You will also respond to complaints, process refunds or exchanges of items, and maintain a clean workspace.To succeed as a cashier, you should have a strong work ethic and high level of accuracy. You should be responsible, attentive to customer needs, and committed to providing excellent service.Responsibilities:Welcoming customers, answering their questions, helping them locate items, and providing advice or recommendations.\nOperating scanners, scales, cash registers, and other electronics.\nBalancing the cash register and generating reports for credit and debit sales.\nAccepting payments, ensuring all prices and quantities are accurate and proving a receipt to every customer.\nProcessing refunds and exchanges, resolving complaints.Skills",
    "Skills": [
        "Requirements:",
        "High school diploma or equivalent.\nCustomer service or cashier experience.\nAbility to handle transactions accurately and responsibly.\nHigh level of energy with strong customer service skills.\nBasic math and computer skills.\nHelpful, courteous approach to resolving complaints.",
        "NOTE: THOSE WHO ARE INTERESTED MUST BE INSIDE UAE AND MUST KNOW HOW TO SPEAK IN ENGLISH OR HINDI."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "7"
    }
}