{
    "Job ID": "4752497",
    "Description": "Performing design review services for all projects for the following but not limited to, high end residential, commercial, hospitality, retail, shopping centers, hotel, hospitals, universities, both high-rise and low-rise developments etc.\nReviewing all design documentation deliverables including but not limited to; drawings and specifications at all design phases and determine the following; compliance with the project design brief, project goals and objectives, building code compliance, design optimization, set quality of design is achieved, design efficiency, determine risks and opportunities, determine cost saving solutions, functionality, effective space planning appropriate material selection, quality of coordination of documentation with other disciplines, conduct QAQC and ensure the client receives added value from the design review services.\nConducting value engineering assessments and activities as part of the design review process.Skills",
    "Skills": [
        "Expertise in working on design, production, quality control, manufacturing, planning, or CAD projects.\nAdept in implementing knowledge of conventional and recent analysis methods and techniques.\nBachelor's degree holder in Mechanical or Production Engineering.\nFamiliar and well versed with the International and local codes and standards.\nMathematical computing and analysis tools knowledge.\nAdept at solving real-time challenges by providing technically-sound insights and suggestions.\nA proven record for handling a multidisciplinary sustainable building designs from within an engineering consultancy.\nHaving a strong experience of preparing authorities submission documentation and strong knowledge with updated authorities’ guidelines and standards.\nHaving a strong understanding of NFPA and QCDD standards.\nExtensive experience in using current technology analysis software for firefighting, heat load calculations and energy modeling.\nAbility to work independently and proactively as part of a team on project delivery."
    ],
    "Preferred": {
        "Residence Location": "Qatar"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Mechanical Engineering; Project & Construction Planning",
        "Company Type": "Unspecified",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}