{
    "Job ID": "4752810",
    "Description": "Creative Design: Produce high-quality, creative, and visually appealing designs for various digital platforms, including but not limited to social media posts, product catalogs, and creative banners.\nConcept Development: Collaborate with the creative team to develop fresh and innovative design concepts that align with project goals and client requirements.\nSocial Media Graphics: Design engaging and shareable social media content, ensuring it aligns with brand identity and resonates with target audiences.\nProduct Catalogs: Create eye-catching product catalogs that showcase our products in the best possible light, making them appealing to our customers.\nBanner Design: Design attractive and attention-grabbing banners for various online platforms, including websites and social media channels.\nVideo Editing: Edit and enhance video content to create compelling visual stories that captivate our audience.\nAnimation: Create animations and motion graphics that add a dynamic and interactive element to our designs and marketing materials.\n3D Product Modeling (Plus Point): If you have experience in 3D product modeling, it's a plus! You may be involved in creating three-dimensional representations of our products.\nCollaboration: Work closely with other team members, including copywriters, marketers, and project managers, to ensure the successful execution of design projects.Skills",
    "Skills": [
        "Experience: Minimum 6 to 10 years of experience as a Graphic Designer, preferably with a background in an agency or reputed company.\nPortfolio: A strong portfolio showcasing your creative abilities, with examples of your work in social media posts, product catalogs, banners, video editing, animation, and any 3D modeling if applicable.\nCreativity: Demonstrated ability to generate fresh and unique design concepts and ideas.\nSoftware Proficiency: Proficient in industry-standard design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign), video editing software, animation tools, and 3D modeling software if applicable.\nAttention to Detail: A keen eye for detail and a commitment to producing error-free designs.\nCommunication Skills: Strong communication skills to effectively collaborate with team members and clients.\nAdaptability: Ability to adapt to changing project requirements and priorities.",
        "Nice to Have:",
        "Knowledge of emerging design trends and technologies.\nFamiliarity with web design principles.",
        "Note: This position does not require experience in only print media design or 3D game design."
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 5",
        "Age": "Min: 27"
    },
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Lubricants & Greases Blending",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}