{
    "Job ID": "4752572",
    "Description": "As a Technical Writer, you will be responsible for creating and maintaining high-quality documentation for our company's products and services. This includes user manuals, technical guides, online help, and other supporting materials. You will work closely with our development and product teams to gather information and ensure that the documentation meets the needs of our customers. Additionally, you will be responsible for conducting research and staying up-to-date with industry trends and best practices. The ideal candidate will have excellent writing and communication skills, attention to detail, and the ability to work independently.Responsibilities:Create and update user manuals, technical guides, and other documentation for our products and services\nGather information from subject matter experts and other stakeholders to ensure accurate and comprehensive documentation\nCollaborate with development and product teams to understand new features and changes in our products\nConduct research and stay up-to-date with industry trends and best practices in technical writing\nEnsure consistency and adherence to style guidelines across all documentation\nManage multiple documentation projects and prioritize tasks to meet deadlines\nReview and edit documentation for grammar, clarity, and accuracy\nWork closely with cross-functional teams to gather feedback and incorporate changes into documentation\nProvide support and training to internal teams and customers on how to use our documentation\nContinuously improve documentation processes and tools to enhance efficiency and qualitySkills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in Technical Writing, English, or a related field\nMinimum of 3 years of experience as a Technical Writer\nExperience in the software or technology industry is preferred\nExcellent writing and communication skills in English\nStrong attention to detail and ability to maintain accuracy in documentation\nAbility to work independently and manage multiple projects simultaneously\nProficiency in using documentation tools and software, such as Microsoft Office, Adobe Acrobat, and content management systems\nExperience with Agile and Scrum methodologies is a plus\nFamiliarity with HTML and CSS is a plus\nAbility to quickly grasp complex technical concepts and explain them in a clear and concise manner\nExcellent writing and communication skills\nAttention to detail\nAbility to work independently\nProficiency in documentation tools and software\nAbility to quickly grasp complex technical concepts"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 6",
        "Nationality": "Egypt"
    },
    "Data": {
        "Job Location": "Maadi, Cairo , Egypt",
        "Company Industry": "General Engineering Consultancy; Computer Hardware & High-Tech Manufacture; Cyber & Network Security",
        "Company Type": "Recruitment Agency",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}