{
    "Job ID": "4752848",
    "Description": "As a Junior Product & Packaging Designer - Accessories, you will be responsible for supporting the Product Design Manager and Accessories Buyers in developing product & packaging design concepts.•   Work closely with the Product Design Manager to execute the seasonal design & colour direction.•   Support the Accessories Buyers in developing new products and updating existing portfolio with new design concepts.•   Designing new packaging concepts•   Ensuring supplier implementation of Packaging Designs•   Handling daily edits and changes to artwork, graphics and sketches•   Produce good quality mock up visuals for each project.•   Producing user friendly guidelines and manuals. •   Develops and updates project presentations & moodboards as required•   Work closely with suppliers & China office team to ensure understanding of design concepts•   Monitoring of design samples & design approvals •   Keeping up to date with latest colour & design trends at a local & global level•   Travel as required (store visits, market visits, site meetings).Skills",
    "Skills": [
        "•   Ability to manage multiple projects requiring organization, time management, and problem-solving skills. ",
        "•   Ability to work under guidance and supervision. ",
        "•   Basic skills in Adobe Illustrator, Photoshop and In Design, software programs",
        "•   Excellent organization skills with attention to detail and follow-up",
        "•   Flexible with the ability to self-manage and handle multiple priorities",
        "•   1-2 years of experience in this field prefered. ",
        "•   Good communication and influencing skills. ",
        "•   Creative thinking. ",
        "•   Quality focused and results-driven. ",
        "•   Team-oriented attitude, attention to detail, and ability to meet deadlines."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}