{
    "Job ID": "4752664",
    "Description": "·        Follow all relevant unit policies, processes, standard operating procedures and instructions so that work is carried out in a controlled and consistent manner while delivering a quality service to customers and stakeholders.·        Manage all sorts of inbound and outbound communication channels including answering phones from customers professionally and maintain a relationship with them.·        Provide information on the company’s products or services and generate interest in the offer.·        Contact potential or existing customers to inform them about our services to generate sales.·        Take orders and processed in it with an accurate manner.·        Initiating follow up phone calls after the customers' orders.·        Respond to Customers’ inquiries and complaints related to the provided services, prices, Boutiqaat profiles, available specialties, and sub-specialties through all available communication channels accurately and within a certain timeframe consequently give advice/recommendations to the Customers about the possible remedies or solutions targeting their problems to preserve the company’s reputation.·        Listen actively to the Customer’s interests and needs to be able to promote the right service or even upsell whenever possible.·        Document and report on customer feedback to improve the customer experience·        Maintain detailed records of contacts, constantly update Customers’ information on the system used (New & Existing customers) and document all calls information according to standard operating procedures.·        Keep Customers’ data confidential and adhere to the contact center values, rules and predefined guidelines.·        Handle the lead or call (any required activity) within a specified time defined by the business’ needs and requirements and follow-up on Customers whenever necessary.·        Maintains knowledge of all current and upcoming services.·        Accepts ownership for accomplishments and explores opportunities to accomplish new things in order to enhance company’s reputation.·        Commit in the training sessions as required which reflect in career development and growth.Skills",
    "Skills": [
        "1.   Bachelor’s degree or equivalent, preferred on business management.",
        "2.   Preferrable one to two years of Experience in the customer service contact.",
        "3.   General knowledge about Boutiqaat products to be able to support the customer on the same concerns.",
        "4.   Excellent in Microsoft office.",
        "5.   Excellent listening, verbal, and written communication skills in English and Arabic.",
        "6.   Ability to handle stressful situation appropriately.",
        "7.   Good in multi-task and time management skills.",
        "8.   Familiarity with call centre softwares and phone systems is a plus."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Gender": "Female",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}