{
    "Job ID": "4752537",
    "Description": "Experienced Swimming Pool Engineer with a minimum of 8 years of on-site experience Provide overall construction management from pre-construction till project completion.\nAssists the Design Engineer and Project Sales Manager on pre-site evaluations to ensure that any site concerns are addressed prior to entering into a construction agreement.\nOnsite experience and deep technical knowledge from setting out to excavation, construction, waterproofing, and final finishes of swimming pool and water features.\nWorking from technical drawings with the ability to conduct Installation and setting out of plant room equipment including filtration system, heating/cooling equipment, dosing, water treatment, and its pipework and supports.\nSupervising site installations, conducting work inspections at the site, raising MIR and WIR, and getting approval from a consultant.\nChecking technical designs and drawings to ensure that they are followed correctly\nProvide site reviews and reporting to identify variations and job progress.\nResponsibilities include training and engaging employees; planning, assigning, and directing work; appraising performance; addressing complaints, and resolving problems.\nTrack and evaluate subcontractor performance. Address deficiencies directly with subs by making appropriate back charges and/or clarifying performance expectations.\nDay to day liaison with operations crew regarding work program, material & labor requirements. Skills",
    "Skills": [
        "Requirements",
        "Minimum 8 years’ experience in swimming pool construction and 5 years’ experience as site engineer in the Swimming pool industry.\nDegree in Civil or Mechanical Engineering with sound construction experience and onsite supervision (MEP & civil) of swimming pool works.\n Proven track record of managing multiple swimming projects.\n Capable of shouldering responsibility of site management and construction of pools.\n coordinate all activities to ensure the completion of projects on time and within budget.\nShould have Valid UAE driving license.\nShould have knowledge on both civil & MEP works of swimming pool.",
        "IF YOUR PROFILE MATCHES THE ABOVE REQUIREMENTS THEN SEND CV ON"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Project & Construction Planning; Construction & Building; Hardware & Building Materials",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}