{
    "Job ID": "4752705",
    "Description": "Ronak Empire – Professionally Managed Multinational Business Group, Having International Marketing Network in over 57 countries across the globe. Golden Job opportunity: We are currently hiring for Sales & Business Development Manager well versed with Perfume Industry with hands on experience in global exports. The ideal candidate will be responsible for Sales & Business development driving revenue growth for our Perfume Products. You will play a crucial role in developing & implementing sales strategies, managing key accounts & expanding our customer base independently.Desired Roles & Responsibilities:Sales & Business Development Manager with Independent Entrepreneurial leadership ability.\nAn Individual with Tremendous Performance track records, who can take up our group in the “J Curve” grid in the shortest time period.\nCollaborate with the senior management team to develop sales strategies and action plans that align with the company's objectives and market trends in the perfume industry.\nThis is an opportunity where you can exhibit your skills & showcase your talent as we are looking for a Subject Matter Expert who has the ability to enhance sales & business development Activities to ensure the achievement of individual sales targets.\nRepresent the company at industry trade shows, events, and exhibitions, networking with potential clients and partners to expand business opportunities.Remunerations / Salary Range: Attractive Salary Package: No Specific Limit – (Open) “Depending on your Experience Level, Abilities, Capabilities & ExpertiseSkills",
    "Skills": [
        "good interpersonal skills.\nnegotiating skills.\nknowledge of international contract terms, foreign currencies, tariffs and trading regulations.\nverbal communication skills.\nthe ability to work to deadlines."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}