{
    "Job ID": "4752460",
    "Description": "Production Monitoring and Control:\nMonitor daily production operations to ensure adherence to quality standards and production schedules.\nCollaborate with production teams to troubleshoot and resolve operational issues promptly.\nOptimize production processes for maximum efficiency and output.\nQuality Assurance:\nConduct quality checks and inspections to ensure that soap and detergent products meet or exceed established quality standards.\nAssist in implementing quality control measures and corrective actions when necessary.\nProcess Improvement:\nWork with senior engineers to identify areas for process improvement and cost reduction.\nParticipate in continuous improvement initiatives, including Lean or Six Sigma projects.\nDocumentation and Reporting:\nMaintain accurate production records and reports.\nGenerate production performance reports and analysis.\nSafety and Compliance:\nPromote and adhere to safety protocols and best practices.\nEnsure compliance with governmental regulations and company policies.\nEquipment Maintenance:\nAssist in the maintenance and calibration of production equipment and machinery.\nReport equipment malfunctions and coordinate repairs.\nTraining and Development:\nParticipate in training programs to enhance technical skills and knowledge.\nSupport the training of production operators in best practices and safety procedures.\nPerform ad-hoc and other duties related to the job as assigned by Direct Manager.Skills",
    "Skills": [
        "Minimum of 1 – 2 years of experience in the same or related field.\nExcellent verbal and written communication skills.\nProject Management and maintenance experience.\nStrong technical knowledge across FMCG, personal care products, and detergent manufacturing and packaging technology.\nStrong engineering leadership credentials with a proven ability to eliminate loss and waste.\nLeadership skills.\nCommunication skills.\nReliable and Dependable.\nTeamwork.\nAttention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Industrial Production; FMCG; Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}