{
    "Job ID": "4752516",
    "Description": "عن مدير ادارة مالية متميز للانضمام إلى فريقنا في القطاع الخاص في مدينة الرياض. سيكون المرشح المثالي مسؤولاً عن ادارة وتخطيط النشاطات المالية للشركة. ستشمل مهامه تحليل البيانات المالية، والتنبؤ بالايرادات والتكاليف، وإعداد التقارير المالية، وتوجيه القرارات المالية الاستراتيجية، وتحقيق الأهداف المالية للشركة.\n\nالمسؤوليات:\nتحليل البيانات المالية وتقديم توصيات لتحسين الأداء المالي.\nالتخطيط والتنبؤ بالايرادات والتكاليف.\nإعداد التقارير المالية الدورية وتحليلها لتقديم تقييم شامل للأداء المالي للشركة.\nتوجيه القرارات المالية الاستراتيجية وتحقيق الأهداف المالية للشركة.\nتطوير وتنفيذ استراتيجيات النمو المالي.\nالتعامل مع الجهات الخارجية مثل المصارف والمستثمرين والمحاسبين القانونيين.\nإدارة فريق العمل في قسم الادارة المالية وتطوير قدراتهم.\nالامتثال للقوانين واللوائح المالية المحلية والدولية.\nتوفير الدعم والمشورة المالية للإدارة التنفيذية ومجلس الإدارة.Skills",
    "Skills": [
        "المرشح المفضل:\nخبرة لا تقل عن 9 سنوات في إدارة الأعمال المالية.\nشهادة جامعية في المحاسبة أو التمويل أو مجال ذي صلة.\nمهارات تحليلية قوية وقدرة على تفسير البيانات المالية.\nمعرفة عملية بالقوانين واللوائح المالية المحلية والدولية.\nمهارات اتصال ممتازة وقدرة على التواصل مع جميع المستويات داخل المنظمة.\nقدرة على التعامل مع الضغط واتخاذ القرارات في بيئة سريعة الخطى.\nمعرفة بأنظمة إدارة الموارد المالية والتكنولوجيا المالية.\nرؤية استراتيجية وقدرة على التخطيط للمستقبل المالي للشركة.\nمهارات قيادية وقدرة على توجيه وتطوير فريق العمل."
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 51"
    },
    "Data": {
        "Job Location": "As Salam, Riyadh , Saudi Arabia",
        "Company Industry": "Market Research",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}