{
    "Job ID": "4752721",
    "Description": "We are looking for an enthusiastic Customer Service Representative to join Salamtak and contribute in generating sales for our company. You will be responsible for closing sales deals over the phone and maintaining good customer relationships.A qualified telesales representative must have an excellent communication skill and have superior people skills. They must be comfortable presenting products or services over the phone as well as dealing with complaints and doubts.The goal is to help Salamtak grow by bringing in customers and developing business.*Telesales hiring requirements: -·    Proven experience as telesales representative or other sales/customer service role·    Proven track record of successfully meeting sales quota preferably over the phone is a plus·    Good knowledge of relevant computer programs (e.g. CRM software) and telephone systems·    Ability to learn about products and services and describe/explain them to prospects·    Good knowledge of English.·    One-year experience at least.·    Excellent communication and interpersonal skills.·    Cool-tempered and able to handle rejection.·    Outstanding negotiation skills with the ability to resolve issues and and address complaints.Max age 27 years oldResponsibilities: -·    Contact potential or existing customers to inform them about a product or service using scripts·    Answer questions about services or the company·    Ask questions to understand customer requirements and close sales·    Enter and update customer information in the database·    Take and process orders in an accurate manner·    Handle grievances to preserve the company’s reputation·    Go the “extra mile” to meet sales quota and facilitate future sales·    Keep records of calls and sales and note useful information·    Gathering and documenting customer information, payment methods, purchases, and reactions to our services·    Initiating sales with potential customers over the phone.Location: 6 of October (Transportation NOT provided)Must be located in 6 of October or nearest.Benefits:· Fixed SalarySkills",
    "Skills": [
        "Prior work exposure in the field of customer support and service.\nAdept in using customer relationship management software to offer the best client services.\nStrong phone handling skills and active listening.\nCommendable presentation skills to convey important points to the audience effectively.\nThorough understanding of setting priorities for a task to comply with the set deadlines and responsibilities.\nProficient in operating the latest versions of appropriate CRM software and Office Suite."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "6th of October, Cairo , Egypt",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Unspecified",
        "Job Role": "Customer Service and Call Center",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}