{
    "Job ID": "4752950",
    "Description": "Are you a creative and organized individual with a passion for influencer marketing?Do you thrive in a fast-paced environment and have a knack for building and nurturing relationships? If so, we want you to be a part of our team!As a Project-Based Influencer Account Manager at Trendster, you will play a crucial role in our influencer marketing campaigns. You will work closely with our clients to understand their goals, identify the right influencers, and manage influencer partnerships from start to finish. This is a project-based position, making it perfect for those who enjoy the flexibility of freelancing while being a part of a dynamic Team.Key Responsibilities:Collaborate with clients to understand their objectives and develop influencer marketing strategies.\nIdentify and recruit the most suitable influencers for each campaign.\nNegotiate contracts and manage relationships with influencers.\nDevelop and execute influencer marketing campaigns, ensuring they align with client goals and brand guidelines.\nMonitor campaign performance and make data-driven recommendations for optimization.\nProvide regular updates and reports to clients on campaign progress.\nStay up-to-date with industry trends and emerging influencers.Skills",
    "Skills": [
        "Experience working with influencers or marketing related field.\nStrong understanding of social media platforms and influencer trends.\nExcellent communication and negotiation skills.\nHighly organized and able to manage multiple projects simultaneously.\nCreative thinker with a knack for developing innovative influencer strategies.\nProficiency in influencer marketing tools and platforms is a plus.\nBachelor's degree in marketing, communications, or a related field is preferred."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Marketing; Advertising; Public Relations (PR)",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}