{
    "Job ID": "4752388",
    "Description": "We are seeking an experienced WordPress Developer to join our team in Pakistan. If you have a strong track record of designing and implementing WordPress websites, we want to hear from you.Responsibilities:Develop and maintain WordPress websites, ensuring functionality, performance, and security.\nCustomize and extend WordPress themes and plugins to meet project requirements.\nCollaborate with the design and content teams to implement website updates and enhancements.\nTroubleshoot and resolve technical issues and bugs.\nKeep up-to-date with the latest WordPress trends and best practices.\nSalary Range Rs 40k- Rs 80kHierarchy:Techbente values a structured hierarchy that reflects our commitment to recognizing and rewarding loyalty and dedication within our organization.The salary structure for Wordpress Developers within the company is as follows:1. **WD1 (Worker Level 1):** The salary for this position is set at Rs 75,000.2. **WD2 (Worker Level 2):** Employees at WD2 level receive a competitive salary of Rs 105,000.3. **WD3 (Worker Level 3):** Those at WD3 level are rewarded with a salary of Rs 175,000, reflecting their dedication and expertise.4. **WD4 (Worker Level 4):** The highest tier within our hierarchy, WD4 employees, are compensated with a substantial salary of Rs 450,000, recognizing their exceptional commitment and contribution to our organization.We believe in fostering a work environment where dedication and commitment are acknowledged and appropriately compensated, allowing our employees to thrive and grow within Techbente.Skills",
    "Skills": [
        "Requirements:",
        "Minimum 2 years of experience in WordPress development.\nProficiency in HTML, CSS, JavaScript, Elementor & Drag&Drop style Design Development\nStrong knowledge of WordPress themes, plugins, and custom post types.\nExperience with responsive design and mobile optimization.\nFamiliarity with SEO best practices.\nExcellent problem-solving and communication skills.\nAbility to work independently and meet project deadlines."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Islamabad, Pakistan",
        "Company Industry": "IT Services; Software Development",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "3"
    }
}