{
    "Job ID": "4752533",
    "Description": "We are seeking a talented and experienced Engineering Department Manager to join our team in Riyadh, Saudi Arabia. As an Engineering Department Manager, you will be responsible for overseeing and managing all engineering projects within the organization. You will collaborate with cross-functional teams to ensure the successful completion of projects while adhering to strict timelines and budgets. The ideal candidate will have a strong background in engineering and project management, with excellent leadership and communication skills.Responsibilities:Plan, organize, and manage all engineering projects from start to finish\nCollaborate with cross-functional teams to define project scopes, objectives, and deliverables\nDevelop project plans, including timelines, budgets, and resource allocation\nMonitor project progress and ensure adherence to project timelines and budgets\nIdentify and mitigate risks and issues that may impact project success\nCoordinate and communicate with stakeholders, including clients, contractors, and team members\nEnsure compliance with all relevant regulations, codes, and standards\nReview and approve project designs, drawings, and specifications\nProvide technical guidance and support to project teams\nReport on project status, including progress, milestones, and challenges, to senior managementSkills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum of 9 years of experience in engineering and project management\nBachelor's degree in Engineering or a related field; Master's degree is preferred\nProven track record of successfully managing and delivering complex engineering projects\nStrong leadership and decision-making skills\nExcellent communication and interpersonal skills\nAbility to work effectively in a fast-paced and dynamic environment\nStrong problem-solving and analytical skills\nKnowledge of industry best practices and regulations\nProficiency in project management software\nFluency in English and Arabic"
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Age": "Min: 30 Max: 50"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Market Research",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}