{
    "Job ID": "4753550",
    "Description": "Join our team at a leading GCC investment holding company that values teamwork, honesty, respect, responsibility, innovation, excellence, and creativity. As a family-owned company with divisions in investments, real estate, manufacturing, and hospitality, we have a rich history of growth and profitability, underpinned by our commitment to responsible business practices that benefit society.We're currently looking for an Accounting Manager to oversee our accounting department, ensuring the timely and accurate delivery of financial statements and reporting. If you're ready to be part of our dynamic team, apply now!THE ROLEReporting to the Financial Controller, the Accounting Manager (AM) leads an 8-member specialized accounting team covering investments, real estate, banking, general ledger, and accounts payable/receivables. The AM oversees financial operations, providing technical guidance, training, and evaluations to ensure team success and effectiveness. They set expectations, goals, and promote a cohesive work culture, also managing accounting policies, controls, monthly closings, and accurate financial statements.The AM supervises financial statement preparation, collaborates with other departments, and manages general ledger reconciliation, ensuring timely month-end/year-end closings and compliance with standards. They stay updated on regulations, integrate changes, and participate in system enhancements.The role involves risk assessment, discrepancy resolution, and addressing accounting concerns, making it ideal for an ambitious and dynamic Accounting Manager.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Accounting Manager should have:",
        "10+ years of accounting experience with at least 5 years working as Accounting Manager.\nCertificate in IFRS, FCA, ACCA, CPA, ICAEW, or related accounting qualification is required.\nGraduate degree in business, finance, and related fields. An undergraduate degree is a minimum requirement.\nExperience in one or more of the following industries is preferred investment and real estate.\nAbility to think critically and strategically with strong applied quantitative skills related to finance, statistics, and modeling.\nAbility to lead a team and achieve goals.\nAbility to contribute effectively to a team environment.\nAbility to establish positive working relationships demonstrating integrity and a high degree of ethics.\nPatience, meticulous with strong communication skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Manufacturing; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}