{
    "Job ID": "4753033",
    "Description": "We are looking for a professional Female Real Estate Sales Agent to be an intermediary between developers/sellers and buyers. Real Estate Sales Agent responsibilities include market listings and providing guidance to developers/sellers and buyers. This is a great opportunity for someone looking to grow their career in real estate industry.ResponsibilitiesProvide guidance and assist sellers and buyers in marketing and purchasing property for the right price under the best terms\nDetermine clients’ needs and financials abilities to propose solutions that suit them\nIntermediate negotiation processes, consult clients on market conditions, prices, mortgages, legal requirements and related matters, ensuring a fair and honest dealing\nPerform comparative market analysis to estimate properties’ value\nDisplay and market real property to possible buyers\nPrepare necessary paperwork (contracts, leases, deeds, closing statements etc)\nManage property auctions or exchanges\nMaintain and update listings of available properties\nCooperate with appraisers, escrow companies, lenders and home inspectors\nDevelop networks and cooperate with attorneys, mortgage lenders and contractors\nPromote sales through advertisements, open houses and listing services\nRemain knowledgeable about real estate markets and best practicesSkills",
    "Skills": [
        "Requirements and skills",
        "Proven working experience as a Real Estate Agent or Real Estate Salesperson in the UAE\nFluency in Spanish language is a must.\nProven track of successful sales record\nAbility to work independently combined with excellent interpersonal skills\nStrong sales, negotiation and communication skills\nPleasant and trustworthy\nKnowledgeable with RERA Forms and other documentations.\nMS Office familiarity\nReal estate agent’s or broker’s licence\nWith driver's license and car, preferable.",
        "Salary Package",
        "a. For Fresher - AED 2,500 basic salary + 25% commission",
        "b. For with Experience (with driver's license / car) - AED 2,500 basic salary OR 50% to 50% commission"
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 2"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Business Consultancy Services; Tourism, Museum, & Cultural",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}