{
    "Job ID": "4753032",
    "Description": "Hola! We are Hiring! Greetings form Luxury Elite Hair and Skin Care Home Services. A wonderful opportunity awaits you to fulfill your dreams by working with us in Hair & Skin Care services as Beautician and Massage Therapist. We are looking for Beautician and Massage Therapist with relevant experience. Beautician (Female) must be experienced in ----1. Eye lashes2. Hair straightening3. Pedicure, manicure, etc… Massage Therapist (Female) must be experienced in  ---1. Lymphatic Madero therapy,2. Cellulite massage,3. Deep tissue4. Hot stone, etc..  Benefits: Competitive Salary + Tips + Commission + Company Visa  Visa will be provided by company with good salary benefits.We are looking for massage therapists to provide home services by our company. Preferred: Filipino nationality (Female). Skills",
    "Skills": [
        "Hola! We are Hiring!",
        " ",
        "Greetings form Luxury Elite Hair and Skin Care Home Services.",
        " ",
        "A wonderful opportunity awaits you to fulfill your dreams by working with us in Hair & Skin Care services as Beautician and Massage Therapist.",
        " ",
        "We are looking for Beautician and Massage Therapist with relevant experience.",
        " ",
        "Beautician (Female) must be experienced in ----",
        "1. Eye lashes",
        "2. Hair straightening",
        "3. Pedicure, manicure, etc…",
        " ",
        "Massage Therapist (Female) must be experienced in  ---",
        "1. Lymphatic Madero therapy,",
        "2. Cellulite massage,",
        "3. Deep tissue",
        "4. Hot stone, etc..",
        " ",
        " ",
        "Benefits:",
        " ",
        "Competitive Salary + Tips + Commission + Company Visa",
        " ",
        " ",
        "Visa will be provided by company with good salary benefits.",
        "We are looking for massage therapists to provide home services by our company.",
        " ",
        "Preferred: Filipino nationality (Female).",
        " "
    ],
    "Preferred": {
        "Nationality": "Philippines"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Personal Services",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "3"
    }
}