{
    "Job ID": "4753668",
    "Description": "Job Summary: The Trade Marketing Specialist‘s primary objective is to identify, plan and achieve growth opportunities by channel to ensure top line growth. Following the principles of the GTRC division, the Trade Marketing Specialist defines and develops each category role and objective via the effective initiation of consumer, trade and customer marketing activities and promotions to achieve the company’s monthly and yearly budgets in volume and value.The Trade Marketing Specialist leads the marketing team and supports the sales operations to successfully develop and deliver the GTRC sales fundamentals: distribution, shelving, pricing and merchandising for all categories across all trade channels.Job Responsibilities:Support the sales operations and customer service teams to reduce business inefficiencies and maximize productivity and resources\nEnsure sales and merchandising team input into activity planning to ensure full alignment and flawless in market execution\nCommunicate with principals on all trade marketing issues; e.g. activity planning and launching (central or local), inventory and forecasts, A&P support, displays and equipment placement, logistics and new product development and introductions\nPrepare and suggest trade and consumer promotions to improve distribution and generate consumer off-take\nIdentify business opportunities and growing all categories in the business\nConduct analysis of retail audits, investigate in-house data and consumer research to evaluate market trends and present findings and opportunities to management and principles\nCoordinate and lead the “Monthly Activity Cycle Meetings” between principles and the sales management to ensure clear and consistent communication of planned projects and activities\nAgree on annual and monthly A&P spend with suppliers and in-line with agreed top line targets and GTRC budgets\nResponsible for the administration and field supervision of all plans / Activities (i.e. consumer promotion, sampling campaigns, exhibitions, special events).\nControl point of sale materials and produce a monthly report detailing quantities of POS material used, balance stock and requirements.\nEnsure principal provided and agreed planograms are implemented successfully in the market.\nEnsure that the budget allowances, claims and distribution of POS materials set by the Division Manager are achieved.\nEnsure that the marketing campaigns are achieved within budgeted guidelines as agreed with the principal and / or the Division Manager.Skills",
    "Skills": [
        "Resourceful and creative.\nTakes initiative with an ability to set priorities\nExcellent leadership qualities combined with effective communication skills\nSolid presentation skills, proficient in using MS Office\nExcellent communication and presentation skills\nBilingual is essential (Arabic - English)\nMotivational Skills\nTeamwork skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Nationality": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}