{
    "Job ID": "4753609",
    "Description": "Join our team at a leading GCC investment holding company that values teamwork, honesty, respect, responsibility, innovation, excellence, and creativity. As a family-owned company with divisions in investments, real estate, manufacturing, and hospitality, we have a rich history of growth and profitability, underpinned by our commitment to responsible business practices that benefit society.We're looking for a Financial Controller to join our finance team. If you're an ambitious professional seeking a dynamic organization, consider this opportunity!THE ROLEThe Financial Controller (FC), reporting to the CFO, oversees a team of nine, including the Accounting Manager and specialists in investments, real estate, banking, general ledger, facility, and accounts payable/receivable. Responsibilities include accurate financial reporting, regulatory compliance, and robust financial controls.The FC prepares financial statements, management reports, and ensures compliance with International Financial Reporting Standards (IFRS). They collaborate with stakeholders, support budget development, and provide recommendations for cost optimization and risk mitigation. Strong internal controls, compliance with financial laws, and SAP implementation for efficiency and automation are key priorities.If you're an experienced Financial Controller, consider joining us to apply your expertise in this role.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Financial Controller should have:",
        "10+ years of finance experience with at least 5 years working as Financial Controller.\nFCA, ACCA, CPA, ICAEW, or related accounting qualifications are required.\nGraduate degree in business, finance, or related fields. An undergraduate degree is a minimum requirement.\nExperience in one or more of the following industries is preferred investment, real estate, manufacturing, and trading.\nAbility to think critically with strong applied quantitative skills related to finance.\nAbility to lead a team and achieve goals.\nAbility to contribute effectively to a team environment.\nAbility to establish positive working relationships demonstrating integrity and a high degree of ethics.\nPatience, meticulous with strong communication skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Manufacturing; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}