{
    "Job ID": "4753871",
    "Description": "Job Purpose•   Reporting to Head of Commissioning NFXP Offshore, the Commissioning Telecom Specialist is responsible for managing Telecom Commissioning activities during preparation and execution stage of NFXP Offshore to ensure objectives are safely met within the approved scope and schedule. •   Commissioning Telecom Specialist shall ensures that all his scope of work is completed in accordance with safety and quality standards applicable.Key Job Accountabilities•   Focal point for Telecommunication Sysytem commissioning activites starting from preparation stage to the complete execution stage, for promoting and implementing of system completion and system completion database at site, Implement system completion including reporting, monitoring and control.•   Assist the NFXP Offshore Commissioning Division Manager in executing Project responsibilities for system completion, onshore/ offshore Telecom commissioning and preservation scope of work.•   Champion initiatives with the Contractor to deliver on the project objectives i.e. safety, quality, cost and schedule and review for contractor’s commissioning execution effort and provide recommendations as necessary.•   Provide guidance and timely review on contractor’s commissioning execution plan and processes verifying fitness for purpose and compliance with contract requirements including codes and standards.•   Ensure coordination and communication for site activities with other discipline such as contruction, Hook up and Completion Team and SHE representative and provide technical support with contractor , quality, safety, planning, engineering and start up/ performance testing.•   Review, approve and implement Commissioning system completion and commissioning technical documents prepared by EPC Contractor.•   Ensure Contractor Commissioning submitted all documents as per schedule and timely reviewed and approved in accordance with the EPC contract requirements. Review and propose mitigation for Commissioning aspects of the Risk Management Plan and Monitor the mitigation when defined •   Review all Commissioning changes, including justification for cost and schedule impacts, in accordance with the PMOC procedure.Maintain a register of lessons learnedSkills",
    "Skills": [
        "Minimum Requirements--",
        "Qualifications",
        "•   Relevant degree or HNC , or significant relevant experience and trade qualification.",
        "Knowledge and Key Skills",
        "•   Min 8+ years of total experiences with at least 6 years demonstrated as commissioning experience in major capital projects",
        "•   Experiences for preparation and set up of system completion data base and technical commissioning deliverable for Telecom commissioning. ",
        "•   Experiences for commissioning execution of Telecom equipments package such as RADIO (UHF/VHF, VHF MARINE), AIS, RACON, Access control, PAGA, Data LAN & WAN, Meteorological, CCTV, Telephone, etc. fabrication yard and onshore and offshore included interface work with other contractor.",
        "•   Experience managed EPC contractors, sub-contractors and vendors involved in the oil and gas project at many locations.",
        "•   Hand on experiences with system completion database ICAPS and OPERCOM Methodology.",
        "•   Worldwide commissioning experience with contractors or under company in particular those involved in the Commissioning and start up support of Offshore production facilities.",
        "•   Excellent interpersonal and communication skills with a focus on teamwork and the ability to communicate and interact within a PMT",
        "•   Application and in depth knowledge of stakeholder specifications, International standard and a working knowledge of Industry standards"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}