{
    "Job ID": "4753890",
    "Description": "Primary Duties and Responsibilities:Coordinate with all locations Electrical engineers in order to manage Electrical maintenance for non-operational buildings/facilities at all FM locations. Direct and monitor planning, tendering and execution of Electrical maintenance works with cost optimization and compliance to HSSE/relevant procedures.\nProvides direction and technical assistance to subordinates for handling non-routine works and/or situations involving high costs to QP’s best advantage.\nReviews and approves BOQ/Scopes and Technical Specifications of new tenders for submission to concerned authorities. Reviews and approves RO, SES, EIP based on manual of authority.\nParticipates/delegate in pre-tender meetings, related technical and commercial evaluations on contract bids received and administered by the Electrical section and submits Technical Evaluation reports. Provides clarification on technical matter as required by the superiors in this regard.\nCoordinates various activities related to site mobilization of Contractor’s following issue of\nLetter of Intent by client, arranges various access permits and passes including co-ordinating the placement of Contractor’s site offices, material storage area and camp as applicable. Assists Contractor’s in the orderly mobilization of facilities, equipment and manpower on site.\nEnsures compliance that Corporation’s established contract procedures are being implemented within the Section. Develops / reviews maintenance procedures / guidelines. / Work instruction within the division. Familiarize subordinates with latest procedures / guidelines.\nReview/finalize SOW/estimate and SO, MWC/LTC/GTC, process arranges / attends technical / kick off meetings and also provide input to FM on budgeting. Attends or delegates to answer queries related to Direct Order and Limited / General Tender Committees.\nPlan and reports Electrical works inspection of client buildings/takeover of completed buildings or facilities with user Department and final acceptance from Contractor. Arranges inspections of new buildings/accommodations to be leased and finalize reports from subordinates to identify any work that may be required to bring the property up to Client Standard standards.\nReview and finalize justifications, cost estimates and outline programmes for new projects/works for inclusion in annual budget and submissions, based on input from Sr.\nElectrical Engineers. Accept drafts specifications and sketches together with preliminary estimates for various non-routine contracts and scheduled contracts work.\nDevelops specifications for modifying facilities and or special requirements for clubs and industrial installations and participate in determining the availability and quality of materials on the local market and reviews alternative material sources.\nCoordinates with other sections within FM and outside FM for feasibility/work permit/work coordination. Attends any other task assigned by superiors. Develop year plan and smart objectives guidelines for Electrical team.Skills",
    "Skills": [
        "Experience:",
        "10-12 years’ experience in electrical and/or Instrument maintenance work, including 7 years at Supervisory level dealing with costs, budgets and contracts and familiar with preparation of tender specifications, associated standards pertaining to local and international regulations.\nA good knowledge of local contractors and an aptitude to understand other disciplines is desirable."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 12"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}