{
    "Job ID": "4753612",
    "Description": "Join our team at a top GCC investment holding company. We're committed to integrity, excellence, innovation, sustainability, and social impact. As a family-owned firm with core divisions in investments, real estate, manufacturing, and hospitality, we have a rich legacy of decades of growth and profitability.We're hiring an Internal Audit Manager. If you're ambitious and seeking a dynamic role, consider joining us!THE ROLESeeking an experienced Internal Audit Manager (IAM) reporting to the Chairman and Audit Committee.The IAM will ensure governance, risk management, and regulatory compliance. Responsibilities include developing audit plans, assessing controls, conducting audits, and offering insights to enhance efficiency and reduce risks.Focus areas include financial, operational, and compliance audits in investments and manufacturing.The IAM will collaborate with management, foster positive relationships, and provide data-driven recommendations.If you're a proactive IAM with governance expertise in investments or manufacturing, apply now!Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Internal Audit Manager should have:",
        "Minimum 10 years of experience in leading and executing internal audit engagements.\nGraduate degree in accounting and finance. An undergraduate degree is a minimum requirement.\nPossession of relevant professional certifications such as Certified Internal Auditor (CIA) is a must.\nStrong understanding of operational risk in real estate, financial services and manufacturing sectors along with the ability to apply auditing techniques tailored to their unique characteristics.\nAdaptability and a willingness to learn about diverse industries and business processes are key attributes for success in this role.\nExcellent communication and interpersonal skills are required to effectively convey complex audit findings to senior management.\nAbility to work independently, take ownership of audit projects, and meet deadlines.\nPrior experience in establishing internal audit functions or working in a newly created role is a must."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Manufacturing; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}