{
    "Job ID": "4753826",
    "Description": "Job Summary:As a Marketing Specialist at LaunchTech, you will be a key part of our team. Your role involves planning, executing, and analysing marketing campaigns, rebranding initiatives, and optimizing our online presence, primarily on our website and LinkedIn.Your goal is to boost lead generation and raise awareness of our software among the engineering and scientific audience in the Middle East. This position offers a unique opportunity to showcase and grow your creativity, diverse marketing skills, and work with a diverse team in a fast-growing market.Key Responsibilities:• Collaborate with the technical sales team to develop an annual marketing plan targeting audiences in the Aerospace & Defense industry, Energy & Materials industry, Industrial Equipment sector, and Engineering and Science colleges in the Middle East, primarily the GCC region.• Coordinate and execute marketing campaigns across various channels, including online webinars, physical seminars, participation in exhibitions, email campaigns, and both inbound and outbound calls.• Manage digital marketing activities to increase lead generation, encompassing search engine optimization (SEO), pay-per-click (PPC) campaigns, social media advertising, and performance tracking.• Oversee social media management, primarily on LinkedIn and YouTube, by creating content calendars, engaging with the audience, and analyzing social media metrics to optimize performance and boost lead generation.• Collaborate closely with the team to optimize website design, content, performance, and search visibility.• Assist in company rebranding activities, contributing creative and meaningful insights.• Work closely with the technical engineering sales team to develop engaging marketing content, including brochures, webinar/seminar scripts, blogs, and more.Skills",
    "Skills": [
        "Required:",
        "A degree in marketing, business or related fields\nExperience with LinkedIn, Google Ads, and SEOs.\nExperience on using HubSpot for Marketing activities.\nExperience in Event management (online and physical ones)",
        "Preferred",
        "Background Engineering knowledge\nFamiliarity with all or one of the following markets in the GCC countries: Aerospace & defense industry, Energy & Materials industry, Industrial equipment and Engineering and Science academics industry.\nArabic and English Speaking\nUI/UX design "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Marketing; Market Research; Mechanical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}