{
    "Job ID": "4753273",
    "Description": "Are you a skilled and experienced LMS System Administrator passionate about Cyber Security? If so, we have an excellent opportunity for you! We seek a highly motivated and results-oriented individual to join our team and help us deliver a world-class Cyber Security Skilling Program.As an LMS System Administrator, you will oversee the management and maintenance of the Moodle learning management system. You will work closely with a Systems Integrator to ensure the successful setup, installation, and initial base configuration of the Moodle platform. You will also be responsible for the ongoing administration of the system in both UAT/Staging and production environments. This includes working closely with stakeholders to provide technical expertise, implement security measures, and ensure fault tolerance and system reliability.Equipping workforces with digital skills to succeed in the future.Elev8 is the leading partner for global skilling and transformative education initiatives for enterprises and governments. The most respected organizations rely on us to help them reach their digital transformation goals. Governments look to us to prepare their citizens for the jobs of the future. If you want to grow in your career and make an impact every day, come join our global team.Responsibilities:Work with Systems Integrator to set up, install, and configure Moodle LMS platform.\nProvide technical guidance and requirements for fault tolerance and scalability.\nPartner on design and implementation of server infrastructure, database management, and storage systems.\nEnsure successful migration of Moodle system from UAT/Staging to production environment.\nAdminister and maintain the Moodle LMS platform in UAT/Staging and production environments.\nManage user accounts, roles, and permissions.\nPerform regular backups, updates, and upgrades.\nPartner with the Systems Integrator to implement fault tolerance measures.\nWork with trainers and content developers to create and deliver learning experiences within the Moodle learning management system (LMS). This includes developing learning paths, courses, sub-course activities (quizzes, workshops), self-study materials, and classroom support documentation.\nEnsure that courses and learning materials are properly organized and structured to be easy to use and navigate for learners.\nWork with the Systems Integrator to ensure seamless integration between Moodle and other third-party systems or tools.\nPartner with reporting designers to configure and maintain the integration between Moodle and Power BI for advanced reporting and analytics.\nExtract data from the Moodle system and populate the data warehouse for analysis, design, and publishing of KPIs, dashboards, and reports.\nPartner with the Systems Integrator in configuring and maintaining the fault-tolerant setup for data warehousing and reporting.\nImplement and maintain security measures and best practices to protect the Moodle system and user data from unauthorized access, data breaches, or other security threats.\nEnsure compliance with relevant data protection regulations and policies.\nCollaborate with the Systems Integrator to perform security audits, vulnerability assessments, and penetration testing of the Moodle platform.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Education: Bachelor's degree in computer science, information technology, or a related field.\nExperience: 5+ years of experience in the same field, with a proven track record of success in installing, configuring, and administering Moodle platforms.",
        "Skills:",
        "Strong technical knowledge of Moodle architecture, server infrastructure, and database management (PostgreSQL preferred).\nFamiliarity with open-source technologies and web application deployment.\nProficiency in server administration, Linux operating systems (Red Hat Linux preferred), and server virtualization.\nExperience in integrating Moodle with third-party systems and tools.\nKnowledge of data warehousing, business intelligence, and reporting tools (Power BI preferred).\nExcellent problem-solving and troubleshooting skills.\nStrong communication and interpersonal skills, with the ability to work effectively with stakeholders at all levels.\nAttention to detail and ability to handle multiple tasks and priorities in a fast-paced environment.\nFluency in English and Arabic, both written and spoken.",
        "Other:",
        "Experience working with Systems Integrators for setup, installation, and initial base configuration of enterprise-level systems.\nFamiliarity with UAT/Staging and production environments, including migration processes and change management.\nUnderstanding of fault tolerance and high availability concepts and implementation strategies.\nKnowledge of security best practices and compliance requirements for enterprise systems.\nExperience with server virtualization technologies and Linux operating systems (Red Hat Linux preferred).\nStrong analytical and problem-solving skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services; Cyber & Network Security; Training & Education Center",
        "Company Type": "Unspecified",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}