{
    "Job ID": "4753685",
    "Description": "Job Summary:The Procurement Manager is responsible for overseeing procurement activities and ensuring effective and efficient procurement and delivery planning. Strategic / General Duties and Responsibilities:Develop the procurement department’s annual budget and ensure all employees are working towards achievement of the department’s goals and objectives within the assigned budget by setting the required targets and responsibilities for the department staff.\nDevelop the Annual procurement plan and capture procurement intensions for the forthcoming years high and low workload periods and avoid sudden shortages or excess items or services\nTrack and report key functional metrics to reduce expenses and improve effectiveness\nCraft negotiation strategies and close deals with optimal terms\nPartner with stakeholders to ensure clear requirements documentation\nForecast price and market trends to identify changes of balance in buyer-supplier power\nAssess, manage and mitigate risks\nSeek and partner with reliable vendors and suppliers\nDetermine quantity and timing of deliveries\nReview the operating results of the procurement department and compare them to established objectives and goals, and follow-up to ensure appropriate measures are taken to correct unsatisfactory resultsOperational Duties and Responsibilities:Manage and optimize the following specific processes:\nReceiving Purchase Requisitions (PR’s)\nCreating Request for Quotations (RFQ’s)\nMaintaining Vendor Quotations\nMaintaining Vendor Lists and Prices\nNegotiation Vendor Quotations\nCreating Purchase Orders (PO’s)\nVendor Selection in (coordination with the concerned department)\nEstablish and maintain a Vendors Management system which should include all information related to all vendors that company work with. \nDevelop and maintain positive relationships with suppliers, to ensure smooth operations and benefit from deals.\nPurchase Orders (PO’s), Request of Quotations (RFQs), and any other related documents to ensure they comply with company policies and procedures and communicate with Stores Manger/supervisor to manage inventory levels and assist in achieving precise re-order point.\nEnsure the completeness of the (PO) related documents by ensuring that each (PO) is accompanied by an approved requisition document, a quotation analysis and other supporting documents (i.e. original quotations, special agreements with Vendors, etc…)\nMaintain purchasing documentation in order to provide accounting with the necessary information for invoicing.\nEvaluate the letter of credit and collaborate with Finance Department to ensure timely financial obligations avoiding any delays due to late payments for procured items.\nEnsure that the price list of items from vendors is regularly updated in the system to maintain accuracy as per the PR’s and the PO’s.\nParticipate in negotiations with vendors to determine the most suitable vendor in terms of price, quality and service level as per company policies and procedures.\nMonitor the purchasing process to ensure receipt of accurate items as per PO’s.Key KPIs:Provide advice, guidance, direction, and authorization to function's personnel to carry out major plans and procedures, consistent with established policies.\nCommunicate and discuss the function’s guidelines and procedures with employees to ensure responsibilities, authorities and accountabilities are defined and understood.\nDelegate some of the responsibilities to appropriate subordinates in order to benefit from smooth running of the function’s operation\nProvide guidance and leadership to all function's employees to ensure effective and efficient flow of work, and ensure all employees recognize their fundamental role in the function.\nMonitor the adherence of function's employees to company guidelines, policies and procedures\nEnsure effective function's performance through the selection, development, deployment and motivation of competent staff.\nPerform other duties related to the job as assigned by the Line Manager.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor’s degree in supply chain or relevant field\nIndustrial operation with a 10 years’ experience and 3 years in relevant field.\nComputer Skills: MS Office.(Word, Excel), ERP\nLanguage know Read and Write : English,\nLanguage Speak: English and Arabic. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}