{
    "Job ID": "4753737",
    "Description": "Coordinate with project teams to ensure all documents are correctly filed in the appropriate department file archives.\nVerify and submit project documents ahead of submission deadlines to ensure compliance with schedules.\nCopy, scan, and securely store both physical and digital documents in an organized manner.\nReview files, including contracts, for accuracy and make necessary edits as required.\nDistribute project-related document copies to internal teams as per project requirements.\nManage the meticulous filing of documents in both physical and digital record-keeping systems.\nDevelop templates for various document types to enhance efficiency and consistency.\nRetrieve requested files promptly for employees and clients to support operational needs.\nMaintain the flow of documentation across the organization, promoting accessibility and transparency.\nConduct quality checks on document details, such as file names and submission accuracy, prior to distribution.\nAssist in creating procedure manuals and system packages related to document control.Skills",
    "Skills": [
        "Bachelor's degree.\nProven experience in document control, preferably in the engineering sector.\nStrong attention to detail and accuracy in document management.\nProficient in using document management software and tools.\nExcellent organizational and multitasking skills.\nEffective communication and teamwork abilities.\nProblem-solving mindset with the ability to identify and address issues proactively.\nFamiliarity with relevant industry standards and regulations.\nStrong computer skills, including MS Office Suite and file management tools.\nPrior experience in managing a small team or leading document control initiatives is a plus.\n - SAUDI NATIONAL"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}