{
    "Job ID": "4753899",
    "Description": "Duties and Responsibilities:To observe and implement Company Quality, Health, Safety and Environment Policies and Procedures inside company premises as well as where applicable at customer and Suppliers / Services providers sites.\nTo comply with Legal and others (Govt. Authorities, customer requirements etc.)\nGive support to supervisors with regards to accomplishing tasks while referring uncommon personnel or technical issues to QHSE Manager.\nPrepare and Maintain List of the Equipment, plan and schedule preventive and shutdown maintenance of the equipment in coordination with the concerned departments (e.g. Shops, warehouse & QHSE etc.).\nMaintain repair history of the equipment.\nOffer suggestions for performance evaluation; oversee the duties of designated crew members.\nCarry out diverse skilled activities involving the repair and maintenance of equipment and facilities; designate and monitor the work of personnel in order to achieve the completion of diverse tasks in relation to building and construction.\nArrange to repair & maintain appliances, wooden & Steel structures, furniture and equipment facilities.\nArrange painting and varnishing for company facilities as required.\nCarry out diverse heating, plumbing, and refrigeration related tasks.\nAssemble, cut, thread, and lay pipes while also offering assistance in the repair, installation, maintenance, and purchase of various heating, plumbing, and air-conditioning fixtures.\nIssuance of Purchase Requests (PR) for Maintenance / Repair relevant material and their receipt.\nCoordinate and communicate with vendors for the repairs and maintenanc.\nCarry out metal and welding; perform diagnosis and repairs on electronic ignition systems for furnaces and heaters, as well as for hot water heaters.\nWork with diverse machines and equipment, such as hand and power tools, and drill presses saws in carrying out maintenance and repair tasks.\nEnsure the maintenance of equipment and tools in a clean, secure, and appropriate working condition.\nEngage in thorough troubleshooting to replace or repair fans and motors, bells, clocks and lightening circuits, as well as audio visual and communication equipment.\nEngage in diverse skill activities such as repairs of roof, doors, windows and other building components.\nMake an estimate of cost of labor and items needed for work orders; acquires competitive prices for supplies and equipment required by the district.\nTrack the key reason for malfunctioning of the equipment, analyze the fact and provide the easiest rectification method.\nperform and coordinate all the service related to buildings, shops, water, gas, firefighting pumps/system, FA system, water pumps, electrical panels and septic /sewage and other services that performed by contractor and sub-contractor.\nFollowing up daily task/ Turn Around Maintenance (TAM). As per the objectives mentioned by QHSE manager.\nCarry out monthly/weekly inspection for buildings, shops, tanks, FF system, FA system, plumping lines and lighting to ensure the facility preventive maintenance.\nTo carry out monthly inspection and services for all ACs in the buildings and shops to ensure that gas refrigerant, fans, filters in good condition.\nPerform monthly services for all ACs in the facility (Cleaning filters and washing inside/outside units).Skills",
    "Skills": [
        "Communicate effectively with all levels of employees\nKnow how to place a purchase request on SAP System\nLeadership skills\nPerform multiple tasks efficiently"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Technical Maintenance & Repair",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}