{
    "Job ID": "4753770",
    "Description": "Following established protocols to keep all patients' health reports ready for accurate medical evaluation.\nUnderstand all cleanliness norms for contributing to a clean, hygienic, and safe environment, emphasizing patient and staff safety.\nAdministration of injections, IV fluids, and oral medications.\nMaintain necessary precautions to safeguard all health information of patients and the organization.\nKeep constant track of patients' vitals for preparing accurate and timely health records.\nWork with the medical staff and doctors to provide excellent healthcare treatment for patients.\nPrepare the dental surgery for each patient, ensuring all relevant materials and supplies are in place\nEnsure all dental equipment is sterilised prior to each patient appointment\nProvide chair-side assistance to the dentist ensuring thy have the correct instruments and equipment\nPrepare dental materials and prepare filling mixtures\nMaintain patient clinical records and take notes as dictated by the dentist during patient examinations\nEnsure the care and welfare of all patients including monitoring patients during treatment, and offering support where needed\nAdvise patients on effective oral hygiene including proper teeth brushing techniques and the importance of flossing\nComplete regular stock checks of dental materials, ensuring there is adequate stock of materials within the surgery\nAssist with administrative duties including greeting and checking in patients, booking appointments, calculating treatment costs, and taking paymentsSkills",
    "Skills": [
        "Proven nursing experience.\nappropriate medical qualification from a recognized, reputable institution.\nFluent communicator with an ability to convey clear messages by following appropriate professional etiquette.\nTalented individual with the potential to handle daily tasks and responsibilities fluently irrespective of the practical challenges.\nKind-hearted individual sensitive to the requirements of patients for offering apt medical and emotional support.\nAdept at working with medical professionals and staff, managing various activities fluently."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Nationality": "India; Philippines"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Dental Center & Clinic",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "7"
    }
}