{
    "Job ID": "4753903",
    "Description": "Job Purpose:Monitor, analyse and propose solutions regarding the integrity of all ALS wells.\nResponsible for ensuring that any well related derogations are thoroughly analysed prior to submission for approval in the CMS system.\nResponsible for ensuring that CLIENT has in place a fit for purpose well integrity model (and associated) software for monitoring and keeping track of Well Integrity issues.\nEnsure training courses and/or training material are provided to all personnel that require a level of well integrity competence.\nEnsure that the day to day well integrity surveillance systems and processes are functioning.\nValidates any technical programs of WS &WHM that have a specific well integrity content.\nDrives technological innovations or processes improvements for all aspects of well integrity.\nEnsure onsite technical assistance is available to Field Ops and Well Intervention team for technical integrity problems.\nLead Operational Risk Assessments and ensure DGS forms are completed for all well related failures.\nProvide any well related safety critical element (SCE) reliability numbers.\nPerform well integrity related calculations; MAASP, tubing leak rate, remaining burst/collapse etc. Participates in the creation and validation of procedures and other CMS documents related to own Well Integrity activity.\nMonitors & analyses well integrity KPIs and dashboards to optimize activity.\nPrepares well integrity input for regular and ad-hoc meetings/presentations both for internal and external stakeholders.Skills",
    "Skills": [
        "Required qualification and experience:Extensive knowledge of all aspects of well integrity, including management systems, well integrity related software's, well failure model, API relevant rules, annulus management, corrosion management/control, tubing + casing integrity and leak detection surveys and etc.\nExtensive knowledge of well integrity industry standards and best practices.\nExtensive understanding of well integrity management systems.\nAbility to conduct risk assessments and evaluations.\nAbility to evaluate well integrity issue, risk assessment, risk ranking and mitigation planning.\nFully autonomous.\nKnowledge of wells (drilling, completion, Csg and cementing), well Intervention, wellhead maintenance, drilling and completions and workovers equipment.\nKnowledge of well performance, production operations, and reservoir engineering.\nLevel and type of initial higher education: Mechanical Engineering degree or equiv.\nNumber of years of relevant experience: 20 years in Oilfield with minimum 5 years well integrity specialization. Offshore exposure 3yr minimum\nTechnical, personal and / or linguistic competencies: fluent English compulsory, good communication skills\nProfessional or HSE certifications: IWCF level 4(Well Intervention or Drilling."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}