{
    "Job ID": "4753617",
    "Description": "Join our team at a leading investment holding company. We value family, integrity, excellence, innovation, sustainability, and commitment. As a family-owned company with core divisions in investments, real estate, manufacturing, and hospitality, we have a track record of decades of growth and profitability.Our Real Estate Division focuses on property development, including commercial buildings, towers, and hotels. We're currently hiring a Project Manager for our Real Estate Development team. If you're an ambitious professional seeking a dynamic role, consider joining us!THE ROLEThe Project Manager (PM), reporting to the Project Director, represents the client's interests and ensures real estate projects align with budgets and standards.The PM oversees contractors and consulting offices, ensuring efficient project management within design specs, timelines, and budgets. They handle diverse projects based on expertise.Responsibilities cover the entire project lifecycle, from planning to completion. The PM collaborates with stakeholders, manages design and construction, and ensures timely delivery.They coordinate resources, manage timelines, mitigate risks, and maintain quality standards. Regular progress reports to the Project Director are essential.Budget-wise, the PM develops and manages budgets, estimates costs, monitors spending, and prepares for potential risks with open communication and lessons learned reporting foster collaboration and improvement.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Project Manager should have:",
        "10+ years of experience in building services working on a range of different commercial projects within the GCC Market.\nBachelor’s degree in civil engineering or a related field (Architectural background with extensive construction experience will also be considered).\nProven experience in managing real estate development projects, with an emphasis on commercial properties, towers, and hotels.\nDemonstrated expertise in risk management, cost control, and schedule adherence.\nExcellent communication skills with fluency in Arabic (spoken and written) to effectively interact with stakeholders.\nFamiliarity with local construction regulations and permitting processes in GCC is highly desirable.\nWillingness to travel as required for project-related activities across the country.\nAbility to contribute effectively to a team environment.\nAbility to establish positive working relationships demonstrating integrity and a high degree of ethics.\nPatience, meticulous with strong communication skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Hospitality & Accomodation; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}