{
    "Job ID": "4753895",
    "Description": "•   To provide, with full responsibility and accountability, a technical service to Corporation in the areas of Health and Safety during definition, detailed design and execution stages to ensure contractor(s) compliance to established HSE policies, procedures and regulations.•   Carries out duties and responsibilities for all areas of work covered in HSE aspects of Major Projects. Ensures adherence by client and contractor personnel to HSE policies, procedures and regulations with respect to active/passive fire safety systems, special protection systems, life safety and fire risk assessment, safety studies/reviews, security systems, emergency response programs, emergency lighting and communication systems. etc.•   Responsible for monitoring related activities within project sites and conducting daily inspection and ensuring the work being carried out is in line with approved JSA, Risk Assessment, and Method Statement and approved Permit to Work System.•   Responsible for identifying and implementing risk reduction measures in all areas and phases of construction.•   Participate and assist in checking and reviewing method statements, JSA's, safety certifications and other related documents submitted by contractors/ project consultant. To take necessary action by highlighting and reporting to immediate Supervisor in case of any lapse and/or lagging.•   Participate and provide inputs to Sr. HSE Engineer for the implementation of Project HSE Performance Monitoring, HSE Objectives and Initiatives, HSE related procedures, guidelines, standards, and policies to ensure Project activities are conducted in a safe, secure and healthy manner and in compliance with DT HSE and Corporate requirements.•   Monitor implementation of HSE Legal requirements, regulatory bodies, national laws and regulations, and State of Qatar-ratified international conventions and protocols within Project activities.•   Participate and provide support to carry out and maintain records of Project HSE risk register to ensure proper recording, monitoring, and close-out of Project HSE Risks throughout project duration.•   Participate in review of contractors HSE documentations (HSE Plan, HSE Procedures and other HSE requirements) to ensure contractors are compliant to HSE requirements.•   Participate in review of contractor's Safety Officers CV's and competence assessment test/ personal interview prior to mobilization of contractors HSE personnel at project site to ensure compliance with Corporate HSE Regulations for contractors.•   Carry out incident investigation, reporting including implementation of close-out of preventive and corrective actions of incidents/accidents that occur within projects to ensure compliance with corporate procedure for Incident management.•   Conduct site safety meetings and HSE awareness amongst client project staff and Contractors.•   Conducts safety audits on the project involving all parties to ensure compliance with safety policies and advise corrective actions and follow-up on the suggested actions to ensure proper implementation.•   Responsibility for identifying and implementing risk reduction measures based upon hazard identification and risk assessment studies in relation to all client Construction/Operations. Incumbent should work closely with the risk assessment specialist and other parties.•   Compilation of reports and preparation of statistical and trend analysis reports to assess safety performances.•   Contributes towards updating HSE Codes, Standards, Specifications and Philosophies.Skills",
    "Skills": [
        "Minimum Requirements--",
        "Qualifications",
        "•   HNC or equivalent in engineering discipline. Associate member of recognized safety institution.",
        "Knowledge and Key Skills",
        "•   Minimum 12 years experience in operational safety, preferably in Oil, Gas & Petrochemical Industry specifically infrastructure/construction projects, with thorough knowledge on various safety regulations, standards, procedures etc.",
        "•   Competent in the use of PC including MS Word, Excel, Access, PowerPoint and any other relevant software.",
        "•   Experience in the Arabian Gulf is desirable."
    ],
    "Preferred": {
        "Years of Experience": "Min: 12"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}