{
    "Job ID": "4753729",
    "Description": "GRADUATE ENGINEER - GEOTECHNICALAssist in the design of geotechnical, geophysical and geo-environmental site investigations including recommendations for best intrusive techniques to be employed and specification of in-situ and laboratory testing.\nAssist in procurement of site investigation contractors.\nSupervise site investigation contractors, and have previous experience of undertaking site investigations and logging of soils and rocks.\nUndertake terrain evaluation, geohazard identification and field mapping of rock slopes/outcrops\nUndertake scheduling of geotechnical and geo-environmental testing and also interpretation of the test results.\nAssist in the review of factual and interpretative geotechnical, geophysical and geo-environmental reports produced by others.\nAssist in the production of geotechnical and geo-environmental factual and interpretative reports – including the interpretation of geotechnical data.\nEvaluate and interpret data using 2D/3D geological and geotechnical modelling.\nProduce technical notes and geotechnical specifications.Skills",
    "Skills": [
        "Degree qualified within a geo-science, geology or geotechnical related field\nHolding a driver's license.\nAble to undertake project based travel and site work depending on business and client needs.\nKnowledge and experience in the following areas (as many as possible):\nSite investigation techniques with experience in supervising field investigation works.\nDescribing soil and rocks to international standards.\nA good understanding of engineering geology, structural geology and geological mapping principles.\nExperience with large data integration and development of geological models and engineering parameters.\nAn understanding of Geotechnical Interpretative Reports including recommendations for deep and shallow foundations and shoring works.\nAn understanding of foundations and shoring walls within soils and rocks would be advantageous.\nGood working knowledge of software packages such as Holebase, Dips, and other Rocscience software or similar.\nKnowledge of software packages such as WALLAP, Pdisp, Slope W or similar would be advantageous.\nAn understanding of various ground improvement techniques.\nExperience of slope stability analyses using appropriate software with associated rock mass classifications, LE and FE modelling and kinematic analyses.\nUnderstanding of geo-environmental assessments including Phase 1, 2 and 3.\nSome construction experience in deep foundations, Bulk Earthworks, shoring and ground improvement etc.\nAny skills with AutoCAD and Civil 3D software would be advantageous."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}