{
    "Job ID": "4753790",
    "Description": "The Marketing Manager is responsible for executing, optimizing and taking part of the development of assigned digital advertising campaigns, on different digital advertising platforms like Facebook Ads, LinkedIn Ads, Google Ads and YouTube. You will also be responsible for tracking and optimizing campaigns to maximize ROI.Responsibilities:● Manage the monthly content planner with clear objectives that are in line with the company’s strategy and business objectives.● Execute the targeting and audience segmentation for digital campaigns across a variety of programs and initiatives.● Develop and execute A/B testing in paid campaigns and brand studies to refine messaging and drive brand lift.● Leverage data to analyze results, establish benchmarks, identify trends, report and execute on key findings.● Analyze campaign results and provide actionable recommendations for improved performance● Conduct ongoing content, keyword, and URL audits to improve user and search engine relevancy of key pages● Collaborate with leadership team on strategy and coordinate campaign benchmarks, projections, and success metricsNote: Friday is a work from home day.Skills",
    "Skills": [
        "Qualifications",
        "● At least 3 years of digital marketing experience in campaign management, email marketing, analysis & reporting, project management, social media & eCommerce desired",
        "● Experience in B2B digital marketing preferred.",
        "● Experience with Hubspot preferred.",
        "● Excellent knowledge of digital advertising platforms (Facebook Ads, LinkedIn Ads, Google Ads, Bing Ads, etc.)",
        "● Ability to set forecasted goals and to develop business strategy that achieves those goals.",
        "● Experience managing search engine marketing and social marketing budgets and campaigns.",
        "● Working knowledge of SEO best practices.",
        "● Understanding of HTML, CSS and code structure including XML sitemap submissions, internal linking and keyword generation.",
        "● Analytically driven, including experience with Google Analytics."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 7",
        "Nationality": "Lebanon",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Marketing; Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}