{
    "Job ID": "4753526",
    "Description": "*Job Title: Lighting Sales Representative*Language: English and Russian (Preferred)*Company Name: Telepixel General Trading LLC*Job Location: Abu Dhabi*Job Type: Full-time*About Us:Telepixel General Trading LLC is a leading provider of architectural and decorative lighting solutions, specializing in creating captivating lighting experiences for a wide range of projects. We are committed to delivering innovative products, exceptional customer service, and cutting-edge design solutions.*Job Description:              LED lighting solutions, Lighting fixtures, chandeliers Sales Representative, you will be responsible for driving sales and building strong relationships with clients in the architectural and design industry. Your primary goal will be to promote and sell our extensive range of lighting products and solutions.*Responsibilities:- Identify and prospect potential clients, including architects, interior designers, contractors, and developers.- Develop and maintain relationships with existing clients, providing exceptional customer service and support.- Understand client requirements and recommend suitable lighting solutions based on their needs and project specifications.- Conduct product presentations and demonstrations to clients, showcasing the features and benefits of our lighting products.- Prepare and present sales proposals, negotiate pricing, and close sales deals.- Stay updated on industry trends, market conditions, and competitor activities.- Collaborate with the design and technical teams to provide customized lighting solutions.- Attend industry trade shows, conferences, and networking events to expand your professional network and generate leads.- Achieve sales targets and contribute to the overall growth and success of the company.*Qualifications:- Proven track record in sales, preferably in the lighting industry or a related field.- Strong knowledge of architectural and decorative lighting products, manufacturers, and industry trends.- Excellent communication and interpersonal skills.- Ability to build and maintain strong client relationships.- Self-motivated and target-driven, with a passion for sales.- Exceptional presentation and negotiation skills.- Ability to work independently and as part of a team.*How to Apply:If you are enthusiastic, results-oriented, and passionate about lighting design, we want to hear from you! Please submit your resume, along with a cover letter detailing your relevant experience and why you believe you would be a great fit for this position.*Note:* Only shortlisted candidates will be contacted.Join our dynamic team and be part of creating remarkable lighting experiences that inspire and transform spaces!We appreciate your interest in joining Telepixel General Trading LLC.           Skills",
    "Skills": [
        "- Proven track record in sales, preferably in the lighting industry or a related field.",
        "- Strong knowledge of architectural and decorative lighting products, manufacturers, and industry trends.",
        "- Excellent communication and interpersonal skills.",
        "- Ability to build and maintain strong client relationships.",
        "- Self-motivated and target-driven, with a passion for sales.",
        "- Exceptional presentation and negotiation skills.",
        "- Ability to work independently and as part of a team."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}