{
    "Job ID": "4753056",
    "Description": "Domus Group is an international leading exhibition specialist with over 20 years experience in the field. We are looking for an Events Sales Executive to join our team. The candidate will be responsible for bringing in new business and revenue for events/exhibitions/conferences.ResponsibilitiesMain job would be: Exhibition Space & Conference Sponsorship Sales\nContact the key clients and maintain good relationship with existing clients\nSearch new clients or generating business via cold calling and networking\nUnderstand company’s full service offering\nDesign and implement a strategic business plan that expands the company’s customer base and ensures its strong presence\nUse CRM daily to track opportunities for each event enquiry they receive.\nIdentify and act on opportunities to up-sell.\nFollow up on previously hosted events for potential repeat business.\nCapable to propose and present fantastic ideas for events based on solid research\nConsult with clients about every detail of an event to ensure that it runs smoothlyWhy Join Us:Attractive salary plus a high percentage of sales commission\nGreat working hours Mon-Friday (half days on Fridays) plus weekends off\nOpportunity to work with a dedicated and passionate team in a collaborative environment.\nChance to make a meaningful impact on the growth and success of our company.Candidate must be in UAE. Salary will be discussed upon interview.Skills",
    "Skills": [
        "Qualifications",
        "Must have at least 2 years UAE experience with sponsorship, delegates plus exhibitions space selling for events, exhibitions and conferences\nStrong team player\nClear and concise communicator\nDriven and motivated\nA background in hitting and exceeding sales targets\nMust be able and willing to work on all events, including evenings and weekends\nEvent planning experience"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Events Management",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}