{
    "Job ID": "4753876",
    "Description": "Primary Duties and Responsibilities:Conduct Civil/Structural Engineering activities throughout all stages of the assigned projects.\nCheck and review all project drawings and documents (civil, structural, specifications, calculations and proposed materials) submitted by others in accordance with the project scope, specifications, appliable standards,\nParticipate and provide assistance in projects pre-commissioning, commissioning and Hand-over activities.\nReview and evaluate the Contract Changes/Variation to approved guidelines and applicable codes, standards and practices., make recommendations for approval or rejection of technical deviations.\nReview and approve method statements developed by contracted organizations for scope compliance. Liaise with contracted organizations to resolve technical issues.\nConduct evaluation of technical bid packages for scope compliance. Participates in pre[1]tender meetings, related technical and commercial evaluations on contract bids received and administered by the Division and submits Technical Evaluation reports.\nPlan and co-ordinate activities of a team of multidiscipline engineers for providing timely delivery of technical services to meet the project requirements.\nCo-ordinate engineering designs, develop and review multi-disciplinary work-scopes for projects and other engineering activities. Ensure that the work-scope is comprehensive and clear.\nSupport the development of personal technical competency and skills and those of Coworkers. Participate in structured training for Associate Qatari Engineers.\nAbility to work in multi discipline/cultural environment.\nAbility to resolve technical challenges related to Civil/Structural Engineering work and adjacent discipline issues.\nConducts civil works inspection of leased buildings/takeover of completed buildings or facilities with user Department and final acceptance from Contractor / Project Department.\nEnsure achievement of approved KPI and customer satisfaction. Attends any other task assigned by the managementSkills",
    "Skills": [
        "Qualification:",
        "Bachelor’s Degree or Equivalent degree in Civil Engineering.",
        "Experience:",
        "Minimum 10-12 years’ experience in Structural Design & Construction Minimum 06 years’\nexperience in Structural Design & Construction, in large buildings and civil/infrastructure\nprojects, including at least 6 years’ experience at Supervisory level.\nGood knowledge in construction activities and project management.\nExperience in projects’ pre-commissioning, commissioning and Hand-over activities.\nPossess good communication and presentation skills.\nGood knowledge of English, both written and spoken.\nComputer literate in mainstream MS Office products and structural design packages."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 12"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}