{
    "Job ID": "4753059",
    "Description": "Job summary: Cash van salesman (Bring new customers, maintain them and achieve their goal.ResponsibilitiesKnowledge and understanding of the coffee industry & FMCG.\nPrepare the work plan of the daily visit and present it to the responsible manager.\nDaily visit to the clients to make orders and collection.\nMake daily visits reports.\nCheck the competitor's activities in the market and report the managements on daily basis.\nSet a schedule for visits and always place alternatives in case an appointment fails.\nTrying to close the sale on the first visit, so all sales-related papers must be available.\nReceiving perpendicularity from customers\nFollow customers during intermittent periods and maintain the lowest levels of relationship.\nAchieving the desired sales target\nDirect customers towards the product and services provided by the company that the customer does not buy or are not convinced of and try to increase the company's sales through this directive.\nDo any other related tasks assigned to them by their immediate boss.QualificationsCoffee industry experience at less 2 years.\nDegree in marketing or business or any related field.\nArabic & English language needed.Skills",
    "Skills": [
        "Good knowledge of the products or services being sold, including their features, specifications, and applications.\nExceptional organizational and time management skills for task prioritization and deadline adherence.\nStrong organizational and time management abilities to effectively prioritize tasks and meet deadlines\nProficient organizational and time management skills for efficient task prioritization and meeting deadlines."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}