{
    "Job ID": "4753287",
    "Description": "We're looking for a Senior Solutions Designer to join our team and develop learning and development programs on emerging technology for our customers. In this role, the Senior Solutions Designer will work closely with the Pre Sales & Sales team on developing learning and development programs.Equipping workforces with digital skills to succeed in the future.Elev8 is the leading partner for global skilling and transformative education initiatives for enterprises and governments. The most respected organizations rely on us to help them reach their digital transformation goals. Governments look to us to prepare their citizens for the jobs of the future. If you want to grow in your career and make an impact every day, come join our global team.Responsibilities:Architect learning solutions for B2C, B2B and B2G customers.\nSolution all course related resources such as systems, multi-media, trainers and data.\nFacilitate the development and implementation of the sales solutions for the sales strategy.\nCoordinate the implementation of the educational programs.\nNegotiate with vendors and certification partners regarding implementation.\nDevelop and maintain communications and partnerships with external clients and partners.\nIdentify and determine the technological changes by staying current on technology developments and latest certifications to achieve constant innovation, growth and improvements in the educational services provided by the company, contributing to enhance the network of experts and trainers.\nEngage with relevant stakeholders in the regions to ensure strategic and scalable solutions.\nEnsure compliance with relevant industry standards and certifications.\nProvide solutions within budget guidelines to meet forecasted revenue and profit goals.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor’s degree in computer science or other relevant discipline; a master’s degree is desired.\nA strong line of certification in any of these technologies (Cloud, Cybersecurity, Data Analytics)\nAt least 6-8 years of experience as consultant in any of the above technologies and in the education or training sector\nTechnology Certifications (i.e., Microsoft, Amazon (AWS), CompTIA, Google Cloud, EC-council, etc.)\nParticipation in major technology projects or migration\nExperience in the education or training sector, creating solutions and designing programs in technology-related training (technical training, digital transformation programs).\nKnowledge of innovative learning experiences and methodologies (e.g., action learning methodologies, virtual learning etc.).\nProfessional fluency in English is essential, both written and oral.",
        "Other requirements",
        "Knowledge of core and emergent technologies.\nStrong research skills.\nUnderstanding of data analytics in a training and learning environment.\nKnowledge of Learning management systems and training platforms.\nKnowledge of educational systems (University, institute, academy).\nUnderstanding of assessment systems and facilitation and coordination skills.\nStrong leadership, time management and organizational skills. Ability to communicate effectively both orally and in writing, and strong public speaking skills.\nAbility to develop effective working relationships with key stakeholders.\nProject and Program management skills § Innovation and critical thinking skills"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 6",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services; Cyber & Network Security",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}