{
    "Job ID": "4753674",
    "Description": "UI/UX and Graphic Designer in KuwaitKey Responsibilities: *  Collaborate with cross-functional teams to understand project requirements and objectives. *  Create visually appealing and user-friendly web designs and UI/UX solutions. *  Utilize HTML5 and CSS to bring web designs to life on various platforms. *  Design iOS app interfaces that are intuitive and visually appealing. *  Use Adobe Creative Suite tools (Photoshop, Illustrator, Lightroom, XD) to create graphics, logos, and assets. *  Design eye-catching banners for websites and promotional materials. *  Lead design projects from concept to completion, ensuring high-quality deliverables. *  Conduct user research and gather feedback to inform design decisions. *  Stay up-to-date with industry trends and emerging technologies to continuously improve design practices.Skills",
    "Skills": [
        " *  Bachelor's degree in Graphic Design, Web Design, or a related field (preferred).",
        " *  Minimum of 10 years of professional experience in web design, UI/UX, logo design, and banner design, with a strong portfolio showcasing your work.",
        " *  Proficiency in HTML5 and CSS.",
        " *  Experience designing iOS apps.",
        " *  Strong command of design software, including Photoshop, Illustrator, Lightroom, and XD.",
        " *  Exceptional creativity and attention to detail.",
        " *  Strong problem-solving skills and the ability to think critically.",
        " *  Excellent communication and collaboration skills.",
        " *  Ability to work in a fast-paced, deadline-driven environment.",
        " *  A passion for staying current with industry trends and best practices in design."
    ],
    "Preferred": {
        "Nationality": "Jordan"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Corporate Management Office",
        "Company Type": "Recruitment Agency",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}