{
    "Job ID": "4753901",
    "Description": "Key AccountabilitiesReports to Quality Division Manager Off Plots (EPC2, EPC3 and EPC4)\nLeading and coordinating QMS audits with EPC Contractors, whilst maintaining reporting relationship with all Heads of Quality Off Plots with respect to their area of assignment.\nAdministration and updating of the Audit Universe database.\nProvides inputs in weekly and monthly project quality reports on EPC contractors audit findings and Vendor Non-Conformances from EPC contractors Weekly Quality Assurance and Quality Control Meetings.\nThe position is responsible for coordinating meetings and reporting Key Performance Indicators (KPI) including implementation of recommendations for improvement and corrective actions.\nMonitors key outcomes and close outs of EPC Contractors audits such as Corrective Action Reports, Observations and Recommendations / Opportunities for improvement.Skills",
    "Skills": [
        "Experience Required:",
        "Qualifications:",
        "8 years Registered Lead Assessor with IRCA/CQI or equivalent. (where equivalent is proposed, evidence of equivalence shall be provided).",
        "Knowledge and/or Experience:",
        "Minimum 8 years’ experience associated with Quality Assurance & coordination of quality activities within the Oil & Gas Construction Industry.",
        "Technical and Business Skills:",
        "Experience with Quality Management System programs and procedures for Vendors and EPC contractors. ",
        "A thorough knowledge of codes and standards in relation to site construction and working within a structured Quality Management System",
        "Must be capable of positive decision-making & demonstrating a high level of judgement & responsibility",
        "Behavioural Skills:Planning & Organising\nEthics and Integrity\nTeamwork and inter functional support\nCommunication and information sharing"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}