{
    "Job ID": "4753272",
    "Description": "We are seeking a highly skilled and motivated Learning and Development Client Program Manager to oversee and lead a comprehensive training program focused on developing various roles in the field of Cybersecurity. As the Client Program Manager, you will be responsible for enhancing and elevating professionals on their cybersecurity skills. The ideal candidate will have experience developing and managing large-scale customer training programs, as well as excellent project management, cross functional leadership & client relationship building skills.Equipping workforces with digital skills to succeed in the future.Elev8 is the leading partner for global skilling and transformative education initiatives for enterprises and governments. The most respected organizations rely on us to help them reach their digital transformation goals. Governments look to us to prepare their citizens for the jobs of the future. If you want to grow in your career and make an impact every day, come join our global team.Responsibilities:Program Strategic and Planning:Ensure the training program aligns with the organization's goals.\nCollaborate with key stakeholders to identify training needs.\nDefine specific program objectives for different groups.\nCreate a detailed program roadmap, incorporating each phase's timelines, milestones, and deliverables.\nBe flexible and adaptable as the program progresses.Curriculum Development and Implementation:Make sure the curriculum is aligned with the target group's needs.\nUse a variety of learning activities to keep participants engaged.\nProvide opportunities for participants to practice new skills.\nEvaluate the effectiveness of the curriculum and adjust as needed.Program Management and Coordination:Be proactive and anticipate problems.\nBe flexible and adaptable as the program progresses.\nCommunicate effectively with all stakeholders.\nEnsure compliance with regulatory requirements and industry standards in Cybersecurity training.Stakeholder Management:Own customer relationships and drive excellent customer satisfaction.\nDevelop and maintain strong relationships with senior management and stakeholders.\nRegularly communicate program updates, milestones, and outcomes to stakeholders.\nFoster a collaborative and inclusive learning environment.\nProvide input to Sales and Business Development for potential business opportunities.\nParticipate in Client RFPs (Request for Proposal).Evaluation and Continuous Improvement:Ensure that the assessment is aligned with the training program's goals.\nUse a variety of methods to collect data.\nAnalyze the data carefully and identify areas for improvement.\nMake changes to the program based on the feedback you receive.\nBe continuous in your efforts to improve the program.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor’s degree in information technology, business, or related field; advanced degree or certification in cybersecurity or training and development is preferred.\n10+ years of experience in the Information Technology sector, preferably in IT Training, Technology Companies, or Digital Transformation.\nStrong Cybersecurity domain knowledge\nProven client/account management experience in complex training programs.\nStrong project management skills with the ability to drive projects forward, manage timelines, and allocate resources effectively. Certification is preferred.\nProficient with various office productivity applications (Visio, Project, and PowerPoint), Learning and Talent management System applications.\nExperience in budgeting and financial planning.\nExperience in curriculum development and instructional design.\nStrong communication, negotiation, and relationship-building skills and excellent problem-solving and analytical skills.\nWritten and verbal fluency in English and Arabic is essential."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services; Cyber & Network Security",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}