{
    "Job ID": "4753569",
    "Description": "Join our team at a leading GCC investment holding company that values teamwork, honesty, respect, responsibility, innovation, excellence, and creativity.As a family-owned company with divisions in investments, real estate, manufacturing, and hospitality, we have a rich history of growth and profitability, underpinned by our commitment to responsible business practices that benefit society.We're now hiring a Commercial Manager for our Industrial business. If you're an ambitious professional seeking a dynamic organization, consider joining us!THE ROLEThe Commercial Manager (CM) will oversee sales and marketing in the industrial sector. Responsibilities include expanding the customer network, improving relationships with key customers, and implementing effective sales policies. The CM develops a sales strategy, builds a high-performing team, and optimizes sales performance.They represent the company at events to increase brand visibility, engage with government and major clients, and oversee sales operations in key markets.The CM executes a comprehensive go-to-market strategy, including direct sales, partnerships, and pricing strategies, and is skilled in negotiation and securing contracts.If you're an ambitious and results-oriented leader with commercial expertise, consider applying for the role of Commercial Manager in the industrial sector, contributing to the organization's growth and success.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Commercial Manager should have:",
        "Minimum 7-10 years of experience in the building materials industry, with a proven track record in sales and marketing management, of which at least 4 to 5 years managing GCC market for similar companies.\nListing the company as preferred supplier with key customers in GCC.\nStrong knowledge of the GCC market and the industrial sector, with experience selling and marketing to businesses (B2B).\nProficiency in marketing and commercial negotiation skills, with the ability to develop and implement effective sales policies based on international best practices.\nExperience in building a sales organization to cover the GCC footprint. As well as managing and leading sales teams, fostering a positive work environment, and achieving sales targets.\nExisting relationships with wholesale distributors, construction companies, and contractors and Government owned industrial companies. and distributors,\nExcellent communication and presentation skills, both written and verbal, capable of preparing persuasive proposals and engaging with clients effectively.\nProven ability to work independently and collaborate effectively with cross-functional teams.\nStrong marketing background and ability to develop a go to market."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Manufacturing; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}