{
    "Job ID": "4753571",
    "Description": "Ensure the work environment is always clean and professional.\nEnsure that the facility is fully operational with all utilities functioning properly.\nPerform daily inspections and identify and address issues to ensure a clean and safe work environment for staff members.\nEnsure proper maintenance of firms’ assets (equipment, properties, office appliances, equipment etc)\nCoordinate and schedule equipment and building repairs, installations, and maintenance work with vendors and appropriate in-house staff.\nManage unplanned maintenance, repair, and recovery for the facility as required within the shortest possible time.\nFollow-up on timelines to ensure periodic services for equipment.\nEnergy management: ensure adherence to managing energy sources – turning off lights, putting off equipment, etc.\nAssist with special projects related to facilities, including building construction, movements and refurbishments, and vendor bidding processes.\nMaintain and update fire safety policy as well as HSE policies which are to be communicated to staff and new employees, interns at all times.\nManage and ensure routine checking of safety and security measures in all facilities.\nEnsure that basic facilities, such as water, sewer, and waste are well maintained\nPrepare daily and weekly reports of facility activities.Skills",
    "Skills": [
        "Minimum of 2 years of experience in the same field\nAttention to details\nAnalytical and problem-solving skills.\nNegotiation skills\nGood communication skills\nSupervision skills\nInnovative, proactive, and ability to troubleshoot."
    ],
    "Preferred": {
        "Residence Location": "Jeddah , Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Home & Office Furniture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}