{
    "Job ID": "4753548",
    "Description": "KEY RESPONSIBILTIESFollow the priorities set by the site engineer, define the number of required crews/workers and their specialties to do the job, assign tasks and set timeframes for each activity in order to meet scheduled deadlines.\nAssess the need for materials, tools and equipment and inform the site engineer to ensure their availability on time.\nMake sure that tools and equipment are in a good condition at all time, take the necessary measures to prevent damage, deterioration or loss, thus decreasing indirect construction cost.\nReview with each foreman the work of gang leaders/workers/subcontractors, evaluate operational outcomes, intervene whenever deemed necessary and give the necessary instructions in order to meet the job specific requirements, quality and timeframe.\nAssess work efficiency and provide foremen with technical assistance and recommendations regarding the methodology that should be applied in order to perform work efficiently while cutting down time and effort.\nMonitor the performance of trade workers and conduct the performance appraisal of subordinates and intervene in case of fluctuations in order to keep a high efficiency level.\nAssist the site engineer in evaluating the productivity rate, provide him with the necessary recommendations that aim to optimize the rate.\nSolve regular problems and escalate critical ones while providing the necessary support to solve them and prevent work interruptions.\nPromote safety policies and procedures and check on their proper implementation; take appropriate measures to ensure on-site compliance to safety regulations.\nCoordinate with timekeeper regarding the working hours and overtimes of gang leaders/workers under his supervision in order to ensure accuracy of time attendance data.\nMaintain a healthy work climate and coordinate with the concerned persons to prevent functional conflicts between different construction crews.\nMaintain and update on-site documentation in a way to keep track of relevant daily activities.\nCoach subordinates in order to integrate them in the work and train them to ensure their continuous skills level improvement.Skills",
    "Skills": [
        "QUALIFICATIONS, EXPERIENCE AND SKILLS:",
        "Technical Diploma with a minimum of 5 years of experience.\nStrong communication, analytical and supervisory skills.\nBasic apprehension and comprehension in Arabic and English reading, writing and speaking.\nProficiency in manipulating AutoCAD and MS Office.\nStrong communication, critical thinking and problem-solving skills.\nHigh level of team building skills.\nEnglish and Arabic languages skills – written and spoken, French is a plus."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2",
        "Residence Location": "Lebanon",
        "Gender": "Male",
        "Nationality": "Lebanon"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Civil Engineering",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}