{
    "Job ID": "4753889",
    "Description": "Memories Events Management is an award-winning creative event agency based in Dubai, Riyadh, and Beirut. Memories specializes in creating experiential and unique events through bespoke design and meticulous details.We are powered by a passion-driven and dedicated team of event specialists, architects, designers and strategists who are fully determined to turn every cherished story into carefully crafted details that are both mesmerizing and unforgettable. At Memories Events Management office in Riyadh, KSA we are looking for our Administrative Assistant to support of the team in daily administrative operations. TO FILL THE SHOES IN THIS ROLE YOU WILL:Manage office supplies stock and place orders;\nPrepare regular reports on expenses and office budgets;\nMaintain and update company databases;\nOrganize a filing system for important and confidential company documents;\nAnswer queries by employees and clients;\nUpdate office policies as needed;\nMaintain a company calendar and schedule appointments;\nBook meeting rooms as required;\nDistribute and store correspondence (e.g. letters, emails and packages);\nPrepare reports and presentations with statistical data, as assigned;\nArrange travel and accommodations;\nGreeting and directing visitors, answering phone inquiries and handling complaints in a courteous, professional manner;\nEnsuring office supplies are maintained, including checking inventory and working with vendors to ensure adequate levels of necessary supplies at all times;\nOccasionally traveling off-site to deliver reports or files to other departments;\nOn need basis, visit the site of the event to assist the team;\nEnsuring the confidentiality and security of files and filing systems;\nCoordinating schedules, arranging meetings, distributing memos and reports and ensuring that everyone is kept current of necessary company news and information;\nOperating copy equipment, fax machines, printers or other equipment necessary. YOU WILL BE A GREAT FIT IF YOU:have an administrative background in a similar role;\nare able to organize files and guest/employee quires in a timely and professional manner;\nare organized and can manage your time well;\nwork with a positive attitude;\nhave great communication skills;\nare able to manage multiple tasks well.Checked-off the list above with flying colors? Great! WHAT’S IN IT FOR YOU?Professional growth in a dynamic and challenging working environment;\nOpportunity to grow with the company;\nSupportive and fun work environment;\nA competitive salary, and medical insurance. Interested in the new venture with us?Send in your quick application here and we will get in touch with you! Please DO NOT apply if you have no previous experience as administrative / office assistant, thank you!Skills",
    "Skills": [
        "Organizing and maintaining records, files, and databases.\nScheduling appointments and maintaining calendars.\nWriting memos and transcribing recorded dictation.\nCreating email templates.\nMaking travel arrangements.\nOrganizing office equipment and inventory.\nCreating itineraries for managers."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Administration Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}