{
    "Job ID": "4753734",
    "Description": "GRADUATE ACOUSTICS CONSULTANTResponsible for basic CAD, BIM and Sketchup design tasks as directed by the Acoustic Engineers.\nGenerate 3D Sketchup models from general arrangement drawings for export to room acoustic software packages.\nUndertake building acoustic calculations and assessments for sound insulation, room acoustic and building services calculation\nUtilize acoustic modelling software to aid the calculation\nAttend to team and project needs as required, and respond within agreed timeframes.\nEnsure that Health & Safety is embedded into all work practices in line with company policies\nDevelop expertise and stay abreast of developments in a relevant technical field\nIdentify improvements (where possible) to enhance WSP in India ME service to clients\nExcellent oral communication skills in English.\nExcellent English report writing skills\nWillingness to learn\nAbility to work both independently and in a team atmosphere.\nAbility to meet deadlines under pressure.\nAbility to work in a very dynamic and demanding work environment.\nAbility to work independently with minimal oversight.\nAbility to meet deadlines.\nAbility to work on projects with minimal supervision. \nA basic understanding or interest in acoustics\nHealth & SafetySkills",
    "Skills": [
        "1-2 years of experience working in the acoustic field is preferred\nKnowledge of basic acoustic principles is essential.\nExcellent quantitative and analytical skills, and proven ability to communicate results orally and in writing.\nBachelor’s degree in acoustic or engineering discipline required other advanced degrees preferred.\nMembership of the IOA is preferred.\nKnowledge of Odeon/CATT/EASE, Insul, and CadnaA would be an advantage\nAbility to work as a valued team member with architects, MEP and Structural Engineers.\nAble to determine a client’s requirements.\nAble to support other team members.\nBe eager and willing to learn new skills and subjects.\nBe able to efficiently plan, prioritise, act, and integrate activities into client and WSP systems, programs, and processes.\nCommunicate and work cross-functionally with all levels of management and technical functions.\nWork effectively within a global client organization, and be flexible, diplomatic, and entrepreneurial.\n (KSA NATIONAL)"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}