{
    "Job ID": "4753872",
    "Description": "Key Job Accountabilities•   Supports various EPC PMTs by reviewing critical documents and reports generated by the main contractor. Attend workshops/review meetings when requested.•   Analyse technical proposals and proposed deviations, assess exceptions and new technologies to ensure compliance with client policies and procedures.•   Maintain close liaison with NFPS CP 6\\7S Head of Commissioning and gains alignment on ICSS system engineering needs, objectives, and requirements.•   Apply lessons learned from previous projects and share new ones with other EPCs.•   Support the qualification of new suppliers proposed for the project, suppliers that are not on the approved vendor’s list.•   Assesses Contractor’s manpower loading and provide timely recommendations to project team and be available to backfill needs as required.•   Support the ICSS engineering team to stay on schedule to meet all critical milestones (LLI procurement, engineered equipment procurement; ROS dates, etc); develops and stewards recovery plans to address any schedule delays.•   Witnesses Contractors scope of work and signs off Test and Check sheets as per project requirements.•   Verify that the EPC Contractor’s reports are accurate with regards to progress reporting.•   Corporate with review teams and take parts in quality audit activities throughout the project. Report findings accurately and provide plan to address issues.Skills",
    "Skills": [
        "Minimum Requirements--",
        "Qualifications",
        "•   Minimum of 10 years industry experience at a senior level as determined by the interviewer or Bachelors’ Degree in discipline",
        "Knowledge and Key Skills",
        "•   A minimum of 10 years relevant experience, 5 years as a Lead Engineer with overall responsibility for engineering execution of large onshore and offshore projects. Broad and extensive knowledge of design standards, specifications, codes, appropriate safety criteria, offshore facilities and electrical design, construction, operations, and engineering administration.",
        "•   Manager or a Leadership role for major projects."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}