{
    "Job ID": "4753637",
    "Description": "Join a leading GCC investment holding company rooted in family values. We value integrity, excellence, innovation, sustainability, and commitment. As a family-owned firm with core divisions in investments, real estate, manufacturing, and hospitality, we have a strong legacy of growth.Our Real Estate Division focuses on property development, including commercial buildings, towers, and hotels. We're hiring a Property Leasing Manager. If you're ambitious and looking for a dynamic role, consider joining us!THE ROLEThe Property Leasing Manager (PLM) plays a pivotal role in optimizing property occupancy and maximizing revenue. Reporting to the CEO – Real Estate, the PLM leads a country-wide leasing team, collaborating with various departments to achieve leasing goals. Their primary focus is on attracting and retaining tenants, ensuring a seamless leasing experience, and aligning leasing strategies with property objectives.To achieve high occupancy rates, the PLM develops and implements strategic leasing plans by analyzing market trends, competitor activities, and economic factors. They engage prospective tenants through effective marketing efforts, property tours, and open houses. Reviewing and processing rental applications meticulously, the PLM ensures compliance with required criteria and standards. By fostering positive tenant relationships and addressing concerns promptly, they enhance tenant satisfaction and retention.The PLM's responsibilities encompass lease negotiations, documentation compliance, and market analysis. They also supervise and mentor the leasing team, set performance targets, and monitor leasing trends. Collaborating with property management, the PLM maintains the property's visual appeal, safety standards, and leasing attractiveness. Lease renewal procedures and rent collection processes are overseen to retain tenants and ensure timely payments, contributing to the overall success and profitability of the real estate portfolio.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Property Leasing Manager should have:",
        "Bachelor’s degree in business, Real Estate, or a related field.\nAt least 15 years in property leasing, with a focus on commercial properties, within the GCC market.\nProven negotiation skills and a good understanding of rental prices and property values in the target areas.\nStrong network of private company and semi-government organization clients.\nExcellent leadership and team management skills, with the ability to inspire and guide a team of leasing agents.\nPractical knowledge of country's real estate laws, regulations, and market dynamics.\nExcellent communication and interpersonal skills, with fluency in English and Arabic.\nResults-oriented and able to handle multiple projects simultaneously.\nFamiliarity with commercial property management software and tools."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Hospitality & Accomodation; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}