{
    "Job ID": "4753077",
    "Description": "Male/FemaleAvailable to join immediatelyMin 3-4 Years experienceFood Industry Experience RequiredJob descriptionSocial Media Responsibilities:Running company social media advertising campaigns.Formulating high-quality novel written and visual content for each social media campaign.Building a social media presence by maintaining a solid online presence.Monitoring the company's brand on social media.Building brand awareness by engaging relevant influencers.Responding to comments on each of our accounts.Overseeing customer service provided via social media.Analyzing data to determine whether social media campaigns have achieved their objectives.Coaching employees company-wide on content creation best practices.Come up with out-of-the-box ideas.Knowledge of photo editing and video editing software to create social content.Marketing Responsibilities:Proficient in Email Marketing, WhatsApp Marketing & Social Media Management.Create compelling content, design templates, segment target audiences, and schedule message distributions.Manage the development and implementation of the company’s brand strategy.Ensure all marketing efforts serve to achieve immediate and long-term business goals, identifying and executing improvements for processes, content, and lead generation.Prepare marketing activity reports and metrics for measuring program successProvide market research, forecasts, competitive analyses, campaign results, and consumer trendsSupport the maintenance and development of internal tools, including a credentials database, tracking capability, marketing automation system and CRMDrive marketing activities throughout each of the growth marketsSupport the management in evaluating and establishing the marketing plan and strategy by assembling and analyzing sales forecasts, setting objectives, planning and organizing promotional presentations, and updating calendars.Communicate campaign objectives, timelines, and deliverables and provide instructions and run of campaign information to key stakeholders within the business.Oversee the planning of meetings, events, conferences, and trade shows by identifying, assembling, and coordinating requirements, establishing contacts, developing schedules and assignments, and coordinating mailing lists.Skills",
    "Skills": [
        "Qualifications and Skills:",
        "Bachelor’s degree in graphic design, Marketing, Communications, or related field (or equivalent experience).",
        "Proven experience in graphic design, copywriting, and content creation, preferably in a technology-oriented or innovative industry.",
        "Proficiency in design tools (Adobe Creative Suite, Canva, etc.) and excellent understanding of design principles.",
        "Knowledge of ad serving & Web Analytic Tools (Google Analytics, Web Trends)",
        "Proficiency in MS Office.",
        "Strong writing skills and ability to craft compelling and relevant content for various platforms.",
        "Effective project management and coordination skills to work collaboratively in a fast-paced environment.",
        "Attention to detail, creativity, and a strong understanding of branding and visual identity.",
        "Job Type: Full-time",
        "Salary: AED2500.00 - AED3000.00 per month",
        "Ability to commute/relocate:",
        "Dubai: Reliably commute or planning to relocate before starting work (Required)",
        "Experience:"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Purchasing & Procurement",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}