{
    "Job ID": "4753900",
    "Description": "Primary Duties and Responsibilities:Responsible for leading and coordinating Project Teams formed to provide complete project management services to execute assigned projects in onshore/offshore areas from inception to completion and handover.\nPrepare and implement Project Execution and QHSE Plans for all assigned projects.\nParticipate and monitor Planning, Cost Control, Budgeting, Contract Administration, Progress Reporting, Change Management and Gate Approval activities.\nManage and coordinate a Team of multidiscipline Engineers to achieve a cost effective design through timely resolution of technical and engineering issues.\nParticipate in the preparation of tender packages, tendering process, evaluation of tenders and submissions with appropriate recommendations to relevant Tender Committees.\nGenerate and maintain risk registers by updating these in order to ensure that risks are managed and mitigated.\nInterface closely with End User and other stakeholders including government and statutory authorities, other third party entities such as JVs.\nParticipate in the processing and resolution of Variations and Contractor’s claims.\nParticipate in the review and development of QP procedures and guidelines as and when assigned.\nMentor Qatari Developees by ensuring that they receive proper job training in order to realize their full potential.Skills",
    "Skills": [
        "Qualification:",
        "B.Sc. in an Engineering discipline from a recognized University; higher degree would be advantageous. Membership in a recognized professional engineering/project management association/institution will be an added advantage.",
        "Experience:",
        "A minimum of twelve (12) years’ experience in engineering, project management and execution of oil & gas projects.\nExperienced in engineering coordination with various discipline Engineers during Feasibility and Concept Optimization Studies, FEED and EPIC.\nEffective communication and team building skills including presentation, report writing and management of meetings."
    ],
    "Preferred": {
        "Years of Experience": "Min: 12"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}