{
    "Job ID": "4753797",
    "Description": "Vend is an e-commerce platform that connects businesses and customers in Kuwait.VEND aims to digitize business in Kuwait by providing a full-service support platform, smart search features, and tailored plans to cater to each business's unique needs.We are seeking a highly motivated and customer-oriented Arabic-Speaking Account Manager to join our dynamic team. As an Account Manager, you will be responsible for managing relationships with our sellers on VEND e-commerce platform in Kuwait. Your primary goal will be to ensure the success and growth of our sellers by providing exceptional support, guidance, and strategic insights. Fluency in Arabic, along with strong communication and interpersonal skills, is essential for this role.Responsibilities:Serve as the primary point of contact and build strong relationships with sellers in Kuwait and MENA region.\nProvide onboarding support to new sellers, guiding them through the account setup process, and addressing any questions or concerns.\nIdentify opportunities for upselling and cross-selling additional products/services to existing clients.\nAchieve and exceed upsell revenue targets on a regular basis.\nConduct regular check-ins with sellers to understand their needs, assess their performance, and identify opportunities for growth.\nActively engage with sellers to offer strategic advice and best practices for optimizing their product listings, pricing, and promotions.\nMonitor seller performance metrics, such as sales, customer feedback, and product ratings, and provide data-driven insights and recommendations.\nResolve seller inquiries, disputes, or escalations in a timely and professional manner, ensuring high levels of customer satisfaction.\nCollaborate cross-functionally with internal teams, such as marketing, operations, and product, to advocate for seller's needs and drive platform enhancements.\nStay up to date with industry trends, competitor activities, and market changes affecting the e-commerce landscape in Kuwait.\nConduct training sessions, webinars, and workshops to educate sellers on platform features, policies, and best practices.\nPrepare and present periodic reports to management, highlighting seller performance, key achievements, challenges, and actionable recommendations.Requirements:Fluency in both spoken and written Arabic and English is essential.\nPrevious experience in account management, business development, or sales, preferably within the e-commerce industry.\nStrong interpersonal and communication skills, with the ability to build and maintain relationships with diverse stakeholders.\nExcellent problem-solving and negotiation abilities, with a customer-centric mindset.\nAnalytical mindset with the ability to interpret data, derive insights, and make data-driven recommendations.\nProactive and results-oriented, with a demonstrated ability to meet and exceed targets.\nKnowledge of the e-commerce landscape in Kuwait, including familiarity with local market trends and customer preferences, is a plus.\nAbility to work independently and as part of a team in a fast-paced, dynamic environment.\nProficiency in using CRM tools like Hubspot, ClickUp and Google Workspace.Education and Experience:Minimum of 3-5 years of experience in account management, business development, or sales roles.\nExperience in the e-commerce industry, particularly in managing seller relationships, is preferred.\nExperience using the HubSpot platform is preferred.\nIf you are passionate about driving the success of sellers, thrive in a collaborative environment, and have a deep understanding of the e-commerce landscape in Kuwait, we would love to hear from you. Join our team and play a pivotal role in empowering sellers and shaping the future of e-commerce in MENA region.Skills",
    "Skills": [
        "Account management, Sales, Post-sales, Relationship building"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}