{
    "Job ID": "4753620",
    "Description": "Join a leading GCC investment holding company rooted in family values. We value integrity, excellence, innovation, sustainability, and commitment. As a family-owned firm with core divisions in investments, real estate, manufacturing, and hospitality, we have a strong legacy of growth.Our Hospitality division oversees various ventures, including a luxury hotel project in the GCC.We're hiring a Project Manager for this exciting opportunity. If you're ambitious and looking for a dynamic role, consider joining us!THE ROLEThe Project Manager (PM) reports to the COO - Hospitality and represents the client's interests, ensuring projects align with budgets and standards. They oversee contractor and consulting firm selection, project execution, and quality control.Responsibilities span the project lifecycle, from planning to completion, focusing on seamless execution and timely delivery. The PM coordinates resources, manages timelines, and mitigates risks for exceptional results.They collaborate with design teams, manage contractors, identify and mitigate risks, and oversee construction quality.Regular progress reports to the COO include achievements, challenges, and adjustments to the project plan. Budget development and cost management are crucial.The PM fosters open communication and gathers feedback to improve future projects.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Project Manager should have:",
        "10+ years of experience in building services working on hospitality projects within the GCC market.\nBachelor’s degree in civil engineering or a related field (Architectural background with extensive construction experience will also be considered).\nProven experience in managing real estate development projects, with an emphasis on hospitality projects.\nDemonstrated expertise in risk management, cost control, and schedule adherence.\nExcellent communication skills with fluency in Arabic (spoken and written) to effectively interact with stakeholders.\nFamiliarity with local construction regulations and permitting processes in the country is highly desirable.\nAbility to contribute effectively to a team environment.\nAbility to establish positive working relationships demonstrating integrity and a high degree of ethics.\nPatience, meticulous with strong communication skills."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}