{
    "Job ID": "4753638",
    "Description": "Join our leading GCC investment holding company, grounded in values like teamwork, honesty, respect, responsibility, innovation, excellence, and creativity. As a family-owned firm with core divisions in investments, real estate, manufacturing, and hospitality, we have a rich legacy of decades of growth and profitability. Our commitment to responsible business processes drives positive contributions to society.We're hiring a Treasury Manager to join our finance team. If you're an ambitious professional looking for a dynamic role, consider joining us!THE ROLEThe Treasury Manager (TM), reporting to the CFO, plays a key role in short-term liquidity management and banking relationships. They monitor daily cash balances, execute efficient liquidity strategies, and prepare cash forecasts for operational needs.The TM collaborates with cross-functional teams to optimize working capital, minimize the cash conversion cycle, and align financial activities with debt commitments.Building strong banking relationships is crucial, involving effective communication, compliance with loan agreements, and negotiation for favorable terms. They also identify and mitigate financial risks and evaluate creditworthiness through comprehensive analysis of financial data.Skills",
    "Skills": [
        "Key Strengths and Abilities",
        "Candidates for the role of Treasury Manager should have:",
        "A Bachelor's degree in Finance, Accounting, Economics, or a related field, with an MBA or CA, CPA, CFA as a plus.\nA minimum of 10 years of experience in treasury management, banking, or finance roles.\nDemonstrated expertise in short-term liquidity management, working capital optimization, and financial risk management.\n Strong analytical skills, enabling interpretation of complex financial data and informed decision-making.\nExcellent negotiation skills and effective communication with banking professionals.\nSound understanding of banking products, financial markets, and credit assessment methodologies.\nProficiency in financial modeling, forecasting, and cash flow analysis.\nExceptional interpersonal skills, with the ability to establish and maintain strong banking relationships."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate; Manufacturing; Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}