{
    "Job ID": "4753255",
    "Description": "We at Elev8 are looking for a competent and experienced Microsoft Power BI Developer to join our IT team. Your primary responsibility will be to create and implement business intelligence solutions using the Microsoft Power BI platform. You will work closely with stakeholders to gather requirements, design and develop data models, create visualizations and reports, and provide insights to help make informed data-driven decisions. The ideal candidate should have a strong background in data analysis, visualization, and Power BI development, as well as excellent problem-solving and communication skills. If you are a skilled Power BI Developer passionate about data analysis, visualization, and delivering impactful business intelligence solutions, we encourage you to join our team and help us achieve our goal of using the power of data to drive organizational success.Equipping workforces with digital skills to succeed in the future.Elev8 is the leading partner for global skilling and transformative education initiatives for enterprises and governments. The most respected organizations rely on us to help them reach their digital transformation goals. Governments look to us to prepare their citizens for the jobs of the future. If you want to grow in your career and make an impact every day, come join our global team.Responsibilities:Collaborate with business stakeholders to understand their data and reporting needs, translating requirements into effective Power BI solutions.\nDesign and develop data models, transformations, and connections to ensure accurate and efficient data retrieval and analysis.\nCreate visually appealing and interactive dashboards, reports, and visualizations that effectively communicate insights and key metrics to stakeholders.\nDevelop & maintain data pipelines & ETL processes to ensure the timely & accurate ingestion into Power BI.\nConduct data analysis, perform data profiling to identify trends, patterns, and anomalies, and provide actionable recommendations based on findings.\nOptimize performance of Power BI solutions, including data refresh schedules, query optimization, and report rendering.\nCollaborate with the IT team to ensure data integrity, security, & compliance with organizational policies & standards.\nStay up to date with the latest Power BI features, updates, and best practices, and provide recommendations for enhancements and improvements.\nConduct user training sessions and create documentation to effectively empower users to leverage Power BI.\nTroubleshoot and resolve Power BI reports data connections, and performance issues.Skills",
    "Skills": [
        "Experience:",
        "Proven experience as a Microsoft Power BI Developer with a strong understanding of data analysis, visualization, and reporting.\nPower BI certification is preferred.",
        "Skills:",
        "Proficiency in developing and maintaining Power BI dashboards, reports, and visualizations. In-depth knowledge of Power BI features, including DAX expressions, data modeling, and custom visuals.\nExperience with data integration and ETL processes, including data extraction, transformation, and loading. Strong SQL skills and the ability to write complex queries to retrieve and manipulate data.\nFamiliarity with data warehousing concepts and best practices. Solid understanding of data visualization principles and best practices.",
        "Abilities:",
        "Strong analytical thinking and problem-solving skills, with the ability to translate complex data into actionable insights.\nExcellent communication and collaboration skills, with the ability to work effectively with stakeholders across different teams. Proactive attitude with a focus on delivering high-quality solutions and meeting project deadlines.\nFluency in English and Arabic is essential in both written and spoken form."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}