{
    "Job ID": "4753712",
    "Description": "About 3W Networks an Elsewedy Electric Company:We are the largest telecommunications, safety and security systems integrator operating in the Middle East, Africa and Asia Pacific regions providing turnkey solutions for energy, transport and telecom industries. All our telecommunications, safety and security solutions are engineered and supported locally, giving our customers the advantage of getting support for their businesses when and where they need it. We are fully integrated turnkey solutions provider in Telecommunications, Safety & security, Fiber cabling & connectivity and Automation. Job Title: Systems EngineerLocation: Podium West Tower , 26th Floor 12 ADB Ortigas Center Pasig City, Manila, PhilippinesDuration: Full Time Job Responsibilities:Assure the accuracy of Engineering milestones that are integral to the project schedule.\nInter-discipline coordination and overall quality control of the technical work.\nEvaluate design changes and modifications by providing project impact assessments.\nPrepare the engineering deliverables “base design and detailed design.\nSupport in managing suppliers to ensure all technical deliverables are delivered within the technical scope of the project.\nPrepare internal Purchase requests in coordination with Engineering, Procurement and Project manager.\nProviding Technical presentations for internal and external requirements.\nEnsuring that project filing systems are maintained accurately in line with company requirements.\nInterface with warehouse staff to ensure that received materials are technically compliant with the specification.\nProactively works with the integration function to maintain project design compliance.Skills",
    "Skills": [
        "Skills / Qualifications",
        "Should have 8-10 years of experience as System Engineer in Oil and Gas field.\nSolid Experience in Implementation, design, installation, testing, integration, commissioning and proposal of Communication systems\nShould have 5 years and above experience as system engineer in Commercial/Oil and Gas field.\nPreparation of engineering documents and drawings during detailed engineering stage of various projects in Oil and Gas Industry.\nPre-commissioning, Commissioning, Configuring and Integration of various telecom systems on onshore plants and offshore platforms. Good technical knowledge and skills.\nSolid Experience in installation, testing, integration, commissioning and implementation of Communication systems\nExtensive experience in various systems such as CCTV, PAGA, Access Control and Structure Cabling, ELV etc.\nIn depth experience with skill set like (SDH/DWDM/OTN) Transmission, Network Operations, and networking.",
        " ",
        "Should have deep knowledge in systems like:",
        "PA/GA – Industronic, Intron D, Gai-Tronics, Bosch, Praesideo, Speaker Loop, Ziztel\nCCTV – Bosch, Synectics, HERNIS, PELCO, Honeywell, VMS, FLARE, Oxalis, Tecnovideo, Camera\nAccess control – ACS, Lenel, Bosch, RBH\nPreparing and delivering of all Telecom design documents required during Proposal stage such as Block Diagram, Datasheets, Technical Write-up, Bill of Material, Deviation list and System Compliance Document.\nPreparation of engineering documents and drawings during detailed engineering stage of various projects in Oil and Gas Industry.\nPre-commissioning, Commissioning, Configuring and Integration of various telecom systems on onshore plants and offshore platforms. Good technical knowledge and skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Nationality": "Philippines"
    },
    "Data": {
        "Job Location": "Manila, Philippines",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}