{
    "Job ID": "4753891",
    "Description": "Primary Duties and Responsibilities:· Provide technical design and engineering services in Process Engineering for all assigned engineering projects. Achieving the technical quality of work in accordance with Client’s procedures, whilst considering quality, schedule, cost and HSE.· Conduct Process Engineering activities and in-house site surveys for projects, from initial concept definition phase through to; engineering studies, FEED, detailed design and commissioning. · Ensure the required client’s technical assurance practices, engineering standards, environmental and safety policies are incorporated and followed, in work-scopes and whilst conducting Process Engineering activities. Review technical deviations and variations to approved guidelines, codes, standards, and practices.· Support Engineering Department to review, update and apply the client’s standards and Client’s amendments to external standards.· Plan and co-ordinate activities of a team of multidiscipline engineers for providing timely delivery of technical services to meet the project requirements.· Co-ordinate engineering designs, develop and review multi-disciplinary work scopes for projects and other engineering activities. Ensure that the work-scope is comprehensive and clear. · Review and approve method statements developed by contracted organisations for scope compliance. Liaise with contracted organisations to resolve technical issues.· Develop, update and monitor schedules for in-house engineering activities, contribute to external FEED/EPIC scheduling activities and effective project delivery.· Conduct evaluation of technical bid packages for scope compliance. · Review and evaluate the Contract Changes / Variation to approved guidelines and practices.· Support the development of personal technical competency and skills and those of Coworkers. Participate in structured training for Associate Qatari EngineersSkills",
    "Skills": [
        "Qualification:",
        "· bachelor's degree in chemical engineering.",
        "· Chartered Engineer / Professional Engineer status or equivalent is preferable. Experience:",
        "· 10 years relevant post graduate experience related to the Oil & Gas industry."
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Chemical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}