{
    "Job ID": "4753682",
    "Description": "We are looking for an HR assistant to handle a variety of personnel related administrative duties. Your role is to act as the liaison between HR managers and employees, ensuring smooth communication and prompt resolution of all queries. You will also support our daily HRactivities and assist in coordinating HR policies, processes and relevant documents.An ideal candidate for the human resources assistant position holds an academic HR background. Familiarity with our industry is also an advantage. For this role, you should be able to work autonomously and assist in more complex HR duties, like posting job ads, coordinating interviews and contacting candidates. Following our training sessions, you will also be able to assist HR managers in the life cycle recruitment (e.g. onboarding process for new hires and candidate sourcing.)Ultimately, you should be able to ensure our HR department is organized and operates to attract, hire and maintain our employees.Responsibilities:· Assist with day to day operations of the HR functions and duties· Provide clerical and administrative support to Human Resources executives· Compile and update employee records (hard and soft copies)· Process documentation and prepare reports relating to personnel activities (staffing, recruitment, training, grievances, performance evaluations etc)· Coordinate HR projects (meetings, training, surveys etc) and take minutes· Deal with employee requests regarding human resources issues, rules, and regulations· Assist in payroll preparation by providing relevant data (absences, bonus, leaves, etc)· Communicate with public services when necessary· Properly handle complaints and grievance procedures· Coordinate communication with candidates and schedule interviews· Conduct initial orientation to newly hired employees· Assist our recruiters to source candidates and update our databaseJob Type: Full-timeSalary: AED2,500.00 - AED3,000.00 per monthSkills",
    "Skills": [
        "Requirements:",
        "· Proven experience as an HR assistant, staff assistant or relevant human resources/administrative position",
        "· PC literacy (MS Office, in particular)",
        "· Basic knowledge of labor laws",
        "· Excellent organizational skills",
        "· Strong communications skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}