{
    "Job ID": "4753577",
    "Description": "Ronak International – Professionally Managed Multinational Business Group, Having an International Marketing Network in over 57 countries across the globe. Golden Job opportunity: We are currently hiring for Sales and business Development Manager well versed in Marble & Granite Industry with hands-on experience in global exports. The ideal candidate will be responsible for Sales and business development driving revenue growth for our Building Material Products. You will play a vital role in developing & implementing sales strategies, managing key accounts & expanding our customer base independently. Desired Roles & Responsibilities:  Collaborate with the senior management team to develop sales strategies and action plans that align with the company's objectives and market trends in the Marble and granite Industry. \n Exports experience is an added advantage as we are looking for someone who can operate at an international level with good product & domain knowledge of Natural Stones like Marble, Granite etc. \nSales & Business Development Manager with Independent Entrepreneurial leadership ability.\nAn Individual with Tremendous Performance track records, who can take up our group in “J Curve” grid in the shortest time period.\n This is an opportunity where you can exhibit your skills & showcase your talent as we are looking for Subject Matter Expert who has the ability to enhance sales & business development activities in the building materials industry\n Represent the company at industry trade shows, events, and exhibitions, networking with potential clients and partners to expand business opportunity.Skills",
    "Skills": [
        "Relationship Building: Skilled at cultivating and nurturing strong, lasting relationships with key clients, partners, and stakeholders, facilitating collaboration and identifying new business opportunities.\nProficient in excelling across the complete sales cycle, from prospecting and generating leads to negotiating and finalizing deals, consistently surpassing sales quotas and contributing to company growth.\nSkilled in communication, adept at delivering compelling presentations and interacting proficiently, capable of translating complex ideas and value propositions to varied audiences, both within and outside the organization, engendering agreement and support for business development undertakings.\nDemonstrated expertise in executing in-depth market research and analysis to identify emerging market sectors, customer requirements, and competitive distinguishing factors, offering actionable recommendations to guide business judgments.\nExperienced in managing the entirety of the sales journey, from lead origination and lead qualification to deal bargaining and completion, consistently outshining sales goals and fostering company development."
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}