{
    "Job ID": "4753527",
    "Description": "The candidate will be responsible for planning and scheduling the materials while minimizing inventory and shipping costs.\nThe candidate will be required to coordinate with purchase and suppliers to ensure material availability for production usage.\nTo perform various material management analyses including forecast/consumption and to make analysis on slow-moving items to keep its stock at the lowest level possible.\nTo make sure P.R’s are converted to P.O’, follow up with purchase/suppliers to expedite the materials delivery.\nTo prioritize delivery dates as and when required by production.\nMonitoring the stock levels to ensure materials availability at all times.\nWorking on shortage reports and ensuring a smooth flow of activities in the shop floor.\nCoordination with other departments i.e., production/warehouse/design/Sales and purchase.Skills",
    "Skills": [
        "Should be good in MS office especially with excel and must be proficient in both spoken and written English particularly drafting emails, must be aware of Importance and use of ERP in organizations, preferably having worked on SAP/any other ERP program.\nMin. 5 Years in manufacturing industry preferably in Electrical Transformer/Generator/Motors/other electrical devices i.e Breakers/batteries/Switch Gears Or any Steel products fabrication industry.",
        "Qualification : Min. Diploma in Engineering with Electrical/Mechanical background",
        "Qualification : Min. Diploma in Engineering with Electrical/Mechanical background\nKnowledge of Supply and Demand, Supply chain, Inventory, warehouse & material management.\nknowledge of materials used in transformers and to define the level of safety stock depending on the category of material.\naware of Purchase requisitions/purchase orders and logistics.\nStrong communication and organizing skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}