{
    "Job ID": "4753898",
    "Description": "Job Accountabilities:Champions both EPC and client Health, Safety, Environmental and Quality cultures. Leads by example in ‘raising the shield,’ demonstrating the ‘courage to intervene.’ Ensures that procedures are followed and that a high standard of safety and quality is achieved in all associated work.\nExecute Projects in accordance with corporate practices and Project procedures.\nAct as focal point for construction engineering services\nInterface closely with client construction representatives to ensure client interests are being accommodated.\nClearly define and communicate the project objectives and organization to the Project team.\nTo document lessons learned and to review/implement lessons learned from other Projects\nChampion the development of effective Construction Procedures, Strategies and HES plans which support the overall project goals.\nSupport the Project Execution and Business goals through planning, recruitment and management of construction scope during engineering and design phase.\nSupporting the proposal team with cost and schedule estimates, and working effectively with internal engineering and support groups, customers, suppliers and subcontractors.\nLeading constructability reviews through pre-FEED and execution phase of the project\nProviding construction input to the project throughout the engineering phase.\nDeveloping the project construction strategy, execution planning and contracting strategy.\nDeveloping installation sequencing, schedule timings and resource requirements.\nPreparing project specific site procedures and work practices as required.\nAssisting with construction feasibility and method studies.\nSupporting development of the project logistic strategy relevant to heavy and out of gaugeSkills",
    "Skills": [
        "Required qualifications and experience:",
        "Bachelor’s degree in an engineering discipline or equivalent\nMinimum of 15 years of relevant experience and 5 years of decommissioning experience\nDemonstrable experience in oil and gas construction and decommissioning engineering throughout project lifecycle in particular Pre-FEED and FEED stage\nOffshore experience is essential.\nThe ability to communicate effectively at all levels both within and outside of the organisation and across different cultures.\nEPC presentation and report writing skills.\nProven abilities in leadership, engaging, developing, and motivating teams in a challenging environment.\nAble to make decisions and drive decision processes.\nWorking knowledge of relevant legislation, codes and standards with the ability to manage contractors."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}