{
    "Job ID": "4753869",
    "Description": "Job Purpose•   The scope of activities will concern green field (new development), brownfield activities (on existing platforms) and integration works. •   Major Projects involve the development of new offshore platforms, integration to the existing facilities, installation of subsea pipelines, debottlenecking of existing functions, all these activities will be executed across several international sites. Projects involves complex interfaces with other entities of client. •   The Job holder is based in Doha client Premises with possibility of multiple worldwide missions.Key Job Accountabilities•   Define, develop, implement, maintenance and control of all necessary means and documents related to the internal MP Engineering organization.•   Engineering progress monitoring &reporting, engineering audit and readiness assessment•   Interface management within MP EMT, with MP projects (Gallaf and Ruya B1), client entities, and external parties to provide support to Projects/Packages.•   Support MP projects for planning, organizing, execution and control of full life cycle of engineering management activities from initiation to close out.Skills",
    "Skills": [
        "Minimum Requirements--",
        "Qualifications",
        "•   Qualification: bachelor’s degree in a technical discipline, ",
        "•   Graduate engineer with a good level of technical understanding of all engineering disciplines, with at least 10 years’ experience of onshore/offshore oil & gas project,",
        "Knowledge and Key Skills",
        "•   Good knowledge of industry codes, standards and legislations on SHE aspect,",
        "•   Familiar with Oil & Gas project organizations ",
        "•   Familiar with project procedures, Management System standards and guidelines.",
        "•   Language: fluent English,",
        "•   Computer literate,",
        "•   Strong leadership skills and good communication skills,",
        "•   Ability to work on projects in a complex and multicultural environment,"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}