{
    "Job ID": "4753771",
    "Description": "The Copywriter is responsible for creating engaging content for various collateral, including direct email, blogs, use cases, whitepapers and advertising. You will also be responsible for ensuring copy is aligned with brand strategy and guidelines.Responsibilities● Write creative, effective copy for a variety of email projects.● Deliver complete, error-free copy formatted in standardized copy template.● Effectively present and clearly communicate creative concepts internally.● Follow relevant brand guidelines for copy style, tone of voice, and target audience.● Research and prepare written copy content that’s in line with the company’s strategic objectives for a variety of marketing applications and programs such as use cases, blog articles, whitepapers, digital ads, marketing collateral, and other assigned projects.● Generate compelling SEO copy for content pieces.● Participate and contribute in creative brainstorms and collaborative work with the Creative Team.● Remain current on emerging trends, implement design best practices, and provide strategic recommendations to enhance campaign metrics and performance.● Collaborate with cross-functional team members to develop creative concepts and continually develop innovative campaigns.● Ensure the brand voice comes through clearly and consistently across every part of the customer journey.● Work closely with copyeditors to maintain all copy standards throughout projects.● Understand business sales objectives and apply them to copy.Note: Friday is a work from home day.Skills",
    "Skills": [
        "Qualifications",
        "● 2+ years of copywriting email and digital copy experience",
        "● Must have perfect command of the English language.",
        "● Strategic thinker",
        "● Portfolio outlining blog, email and banner copy.",
        "● B2B facing, web and retail experience is considered a significant asset."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 6",
        "Nationality": "Lebanon",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 23"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Marketing; Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}