{
    "Job ID": "4754144",
    "Description": "Overview:On behalf of our client, who is in the Construction & Logistics Industry, we are seeking Immediate joiners for the position of Payroll Officers who will be responsible for processing employee payroll accurately and on time, ensuring that all payroll records are up-to-date and compliant with relevant laws and regulations. You will perform leave and overtime management, attendance monitoring, end of service calculation, leave provisions and maintaining accurate and Up-to-date employee data. This position shall work in accordance to company values, policy, SOPs, professional standards and work ethics.Roles & Responsibilities:Contribute to achieve organization/department/team goals and objectives.\nFunction as the first point of contact for all payroll and HR admin issues.\nEnsure all payroll transactions are processed efficiently and in a timely manner.\nResponsible for the proper entry, storage, update and security of employee data, updating personnel files and employee status changes. Ensures accuracy and up to date data on the HR system at all times.\nOrganize and prepare all payments with accuracy and upon verification/approvals. These may include but not limited to overtime payments, leave salaries, end of term settlements, social security calculations and all other applicable additions and deductions.\nPrepare report for leave and indemnity provision.\nMonitor employee attendance on systematic basis. Reviews time sheets prior to payments.\nResolve all discrepancies in payments.\nWork with HR system provider to ensure full efficiency of the HR system by identifying and closing all gaps.\nProvide high level of support to the HR team in redesigning and implementing new workflows for HR processes which includes achieving 100% paperless transactions.\nAssist in the preparation, organization and maintenance of employee files.\nActively contribute in other functional areas that includes talent acquisition, on-boarding, employee relations, trainings, performance management and off boarding.\nSuggest new ideas and recommendations to improve level of HR services.\nEstablish and maintain open and collaborative relationship with Management, Line Managers, colleagues and employees.\nActively contribute, participate and perform all new/additional tasks as assigned by top management or as per evolving business requirements.Skills",
    "Skills": [
        "Bachelor’s degree in Business Administration/Commerce or Diploma in HR Management or in any related field.\n3 to 5 years of experience in HR function with at least 3 years in payroll management.\nA customer-service approach and a high level of personal integrity.\nAttention to detail.\nProblem solving skills.\nPlanning and organization skills.\nAbility to work in a challenging environment with multiple priorities.\nExcellent communication & interpersonal skills.\nAvailable to start immediate or on very short notice.\nApplicant must be bilingual with fluency in both English & Arabic.\nPayroll Officer - Immediate Joiner"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Construction & Building; Distribution, Supply Chain & Logistics",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}