{
    "Job ID": "4754725",
    "Description": "You’re joining the Manufacturing Excellence Facilitator in healthy, safe, sustainable and intelligent building.Ticare AC Supply is TICA’S branch and after-sale service center in the middle east area.We create solutions that matter for people and our planet – and our employees are the heart of it all. As an employer of choice, we strive to provide a great place to work that attracts, develops and retains the best talent, promotes employee engagement, fosters teamwork and ultimately drives innovation for the benefit of our customers.In short, Our greatest assets are the expertise, creativity and passion of our employees – and we’re excited for you to join the team. Job Descriptionwe are looking for the HVAC Sales Representatives to create long-term relationships with our customers through the development of close relationships with HVAC contractors, consultants, M&E companies and end users. The primary role is to drive sales of our VRF, Chiller and Airside systems into the HVAC market through direct sales.This is a regional role in Egypt or the Middle East . The candidate should can speak fluent English.How you will do it:Serve as the lead point of contact for all customer account management matters\nBuild and maintain strong, long-lasting client relationships\nProvide design and application advice to customers promoting energy efficient solutions for their projects\nWork closely with customers to negotiate contracts / projects and close agreements to maximize profits\nDevelop new business opportunities with existing clients and / or identify areas of improvement to meet sales targets\nForecast and track key account metrics (e.g. quarterly sales results and annual forecasts)\nA proactive introduction of our product portfolio in order to assist in the decision-making process for clients\nPresent to customers covering the features and benefits of our product portfolio, CPD’s and other subjects such as legislation requirementsSkills",
    "Skills": [
        "Required:",
        "3 years+ sales experience with HVAC\nAssist to design and Project management in air conditioning, chillers, Airside and control systems , and the ability to support clients through design concepts\nKnowledge and understanding of current legislation\nExperience of presenting on PowerPoint and system training to customers\nIT literate – good background of utilising Excel, PowerPoint, CRM\nInnovative to assist in new product launches or promotions\nAn ability to multitask several client requests at the same time",
        "Preferred:",
        "Knowledge of General HVAC offering\nEPC&EMC Project experience is a plus",
        "Job Details",
        "Job Location: United Arab Emirates",
        "Company Industry：Airconditioning Plant",
        "Company Type：Manufacturer and Installation Engineering",
        "Job Role: HVAC Sales Representative",
        "Employment Type: Full Time Employee",
        "Monthly Salary Range: Unspecified",
        "Number of Vacancies: 4",
        "Preferred Candidate",
        "Years of Experience：Min: 3 years",
        "Join us and make a difference. ",
        "Address: High Bay building,Silicon Oasis Dubai"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Airconditioning Plant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "4"
    }
}