{
    "Job ID": "4754081",
    "Description": "Primary Duties & responsibilities include but not limited to:Implement purchasing best practices, policies & procedures\nContinuously evaluate products, services and vendors to determine improvement and also to source products that provide the best value.\nDirect procurement policies to ensure all items are purchased and delivered within budget and time constraints\nUpdate and maintain all necessary documents with confidentiality.\nMaintain effective and efficient MIS and generate reports desired by the management.\nTrains all store staff to bring them to their expected standards keeping in mind the company's culture and corporate identity.\nBe responsible for daily purchase and the handling of cash related to it.\nResponsible for all store activities like issuing, receiving and stock.\nMust visit outlets on call and handle any specific jobs as instructed by the management.\nAssist in resolving any import/export ministry issues;\nDevelop and maintain strategic relationships with key suppliers and vendors\nDevelop and maintain constructive and cooperative working relationships with colleagues and management.\nShould constantly be in touch with all the latest trends in the industry and acquire all necessary skills necessary as the company keeps growing.\nExecute any other related tasks assigned by the management or management representative.Skills",
    "Skills": [
        "Skills:",
        "Solid analytical skills, with the ability to create reports and conduct cost analysis\nNegotiation and Problem-solving skills\nMulti-tasking ability and an Analytical Thinker\nGood communication and ability to lead a team\nTime management and multitasking\nMinimum 2 years experience in the respective field"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}