{
    "Job ID": "4754988",
    "Description": "Responsibilities:Understanding customers' technical requirements, providing product demonstrations, and effectively communicating how our solutions meet their needs.1. Pre-sales Activities:Work closely with the sales team to understand customer needs and technical requirements.\nConduct product demonstrations and presentations to showcase the features and capabilities of our solutions.\nRespond to technical queries and address customer concerns during the pre-sales phase.\nPrepare and deliver technical proposals, documentation, and specifications to potential clients.2. Solution Design:Collaborate with the product development team and consultants to understand the technical aspects of our products and services.\nDevelop customized technical solutions based on customer requirements and project specifications.\nAssist in the design and implementation of proof-of-concept projects to demonstrate the feasibility and effectiveness of our solutions.3. Sales Support:Act as the liaison between the customer and internal teams, providing technical support throughout the sales cycle.\nCreate and maintain technical sales collateral, including data sheets, technical documents, and case studies.\nSupport the sales team in preparing proposals, quotations, and cost estimates.\nAddress technical concerns and objections raised by customers to secure successful sales closures.4. Market Intelligence:Stay up-to-date with industry trends, competitor offerings, and technological advancements.\nProvide insights and feedback to the product development team based on customer interactions and market analysis.Skills",
    "Skills": [
        "Qualification: Bachelor's degree in Electronic or Electrical engineering",
        "Job Type: Full-time, Permanent",
        "Job Location: NIP, Dubai",
        "Opening: 1",
        "A driving license from the UAE is necessary.",
        "Salary: Will discuss",
        "Languages Known: English and Arabic is additi",
        "Experience: 2-3 years of UAE experience in the audio-visual industry"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}