{
    "Job ID": "4754811",
    "Description": "As one of our Online English Tutors, you'll gain access to tens of thousands of students from all over the world to provide one-on-one English lessons using our intuitive language-learning platform.We provide high-quality lesson materials that are fun and easy to use, so there's no need to create a lesson plan or prepare in advance. Every tutor receives training and has access to a friendly, 24/7 support service that's always happy to help.Engoo tutors benefit from our consistently high booking rates and have total control over their own work schedules. You'll work from home, whenever suits you best — anytime of the day or night, with no minimum required hours. We always pay our tutors on time, with payments going out once a month via Payoneer.We're looking for anyone with excellent English skills and a basic understanding of computers. If that's you, we'd love to hear from you, no matter where in the world you live.Skills",
    "Skills": [
        "Personal requirements:",
        "18 years of age or older\nExcellent command of the English Language.\nComputer literate.\nQuiet working environment.\nWilling and able to work from home.",
        "Technical requirements:",
        "Reliable internet connection at home, with download and upload speeds of at least 1 Mbps.\nLaptop or Desktop computer.\nWebcam.\nHeadset/Earphones",
        "Benefits:",
        "Work from Home.\nSet your own hours.\n24/7 Tutor Support Team.\nBonuses.\nConsistently high booking rate.\nTraining and teaching materials provided.",
        "Salary:",
        "Because you set your own hours, you control your earning potential. Many of our tutors work part-time to supplement their income, while those who work full-time make an average of about gross $550 USD per month. Some go above and beyond and earn over gross $1,000 USD per month!"
    ],
    "Preferred": {
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Training & Education Center; Call Centers & Customer Care Outsourcing; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}