{
    "Job ID": "4754876",
    "Description": "Lazudi, give you the opportunity to be Secondary Market Area Specialist, and aloud you to handle, your area off plan leads on your own, in order to maximized your profits.Key Responsibilities:Provide exceptional customer service to clients looking to buy, sell, or rent properties.\nBuild and maintain relationships with clients and property owners.\nCreate and implement effective marketing strategies to attract new clients and listings.\nResearch and analyze the real estate market trends and conditions to provide clients with accurate information.\nNegotiate deals on behalf of clients and prepare and present offers to property owners.\nEnsure that all necessary paperwork and documentation is completed accurately and in a timely manner.Qualifications:At least 1-3 years of experience as a Real Estate Broker/not only in Dubai\nConsidering also non experience\nStrong negotiation and communication skills\nKnowledge of the local real estate market and trends\nAbility to work independently and as part of a team\nAbility to work under pressure and meet targets\nValid UAE Driving LicenseSkills",
    "Skills": [
        "Top 5 Skills:",
        "Negotiation Skills: The ability to negotiate deals effectively on behalf of clients is a crucial skill for a Real Estate Broker.\nCommunication Skills: Excellent communication skills are essential for building relationships with clients and property owners and for negotiating deals.\nMarket Analysis Skills: A Real Estate Broker should have a strong understanding of the local real estate market and trends to provide clients with accurate information.\nSales Skills: The ability to sell properties to potential clients is a key skill for a Real Estate Broker.\nCustomer Service Skills: Providing exceptional customer service is essential for building relationships with clients and for ensuring client satisfaction.",
        "Salary: Attractive Commission-based, with 50% of sales through company provided leads for the Off Plan Team and Listings for the Secondary Market Team"
    ],
    "Preferred": {
        "Gender": "Female",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}