{
    "Job ID": "4754990",
    "Description": "Head the CSR Unit for Salient FidelityFundraising· Drafting project briefs, reports and proposals.· Assisting with the monitoring of the project implementation.· Supporting the team with the administrative tasks needed to manage program and research grants.· Research prospective donors and fundraisers and get in contact with them and find potential collaboration opportunities; sponsorship, donations, etc.· Create a contact database of actual supporters, potential supporters.· Drafting thank you letters and spreadsheets for current donors.· Create online donation platforms for our prospective projects in giving pages, such pages like; My Fundraising, JustGiving and Virgin Money. (Banked donations, processed payments and donations including Gift Aid claims, direct debit, cheques, invoices, coded incomes)· Attend meetings, negotiating & convincing donors and sponsors to be on board and potential board to be involved and contribute, their time, energy and funds.Educational Institutes1. To research schools in Abu Dhabi interested in/or active in Social Responsibility, charity or activities related to enhancing the positive impact of their students & potential volunteering. (Brainstorming for potential collaborations with educational institutes).2. To create a database of the educational institutes in Abu Dhabi.3. To introduce our mission/vision to educational institutes and to explain all the possibilities and opportunities of collaboration. “Either through physical or virtual meetings”4. To promote the organization in a positive manner, as well as to be able to; get donations (tangible, intangible, or volunteering services) for our projects/functions5. To follow up with every school any concern, request or idea for potential collaborationPartnerships1. To research the newest, accurate and best technology, related tools and strategies to connect our mission, targets and objectives with fields, organizations, companies, individuals donors, Educational Institutes, NGOs, CSR, Social Responsibility Groups, etc. in order for an outcome of Support, whether it was donations, sponsorships, skills, volunteering or other.2. To research and create a database of potential influencers, activists, inventors, leaders and visionaries; altruistic and socially engaged with an interest to connect with SWF to join, support or/and promote our projects with emphasis in our Response Plan to the Covid19 crisis through their social media platforms, live Broadcasts, etc.3. To coordinate the communication with influencers, activists, inventors, leaders and visionaries for SCT ( Communication Team) to establish a relationship with them.Corporate Donors1. To research companies/ corporations in Abu Dhabi interested in/or active in Corporate Social Responsibility.2. To create a database of the companies/ corporations in Abu Dhabi and the ones that has positively replied to SWF.3. To introduce our mission/vision to companies/corporations and to explain all the possibilities and opportunities of collaboration. “Either through physical or virtual meetings”4. To promote our organization in a positive manner, as well as to be able to; get donations (tangible, intangible, or volunteering services) for our projects/functions.5. To follow up with every company/corporation any concern, request or idea for potential collaboration.Communication and Media1. To help create and maintain a social media plan,2. Use social media to promote the activities and achievements of our organization.3. Keeping our social media channels updated on a frequent basis.4. Encouraging others to comment on our posts and share them with others5. Ensure that communication reaches a wide range of stakeholders and diverse audience locally and globally6. Develop and manage content for our website and social media, such as Twitter, Instagram, Facebook, YouTube, etc. For at least 6 months.7. Select relevant channels to reach out to our diverse audienceDirect Work with the Founder- Travel, and Mrs. Salam family (Ticketing, Hotel Reservation, Visas, etc…).- Organize daily meeting agenda.- Managing meeting, conference, interviews, events and daily reports etc...- Brand positioning whether in social media and in the career area.Skills",
    "Skills": [
        "· Teamwork: employees should work well as part of a team. This includes being friendly, flexible and respecting and valuing other team members’ opinions and ideas.",
        "· Communication skills: employees should have good communication skills. This includes actively listening and adapting communication style to your audience.",
        "· Organizational skills: to manage different tasks, sometime simultaneously, employees need to be organized and manage time and resources effectively and efficiently.",
        "· Time Management: this is a crucial skill especially because employees might be involved in multiple projects.",
        "· Punctuality: be there on the date and time agreed upon.",
        "· Cooperation: display leadership skills and maintain proper relationships with peers and follow the chain of command. Properly handle criticism, conflicts and stress.",
        "· Act without prejudice: employees will be required to work with people from various cultural and ethnic backgrounds and all ages. It is always important to act without prejudice and show understanding and tolerance, without exception.",
        "· Respect: treat all volunteers, employees and community members with respect, courtesy and dignity.",
        "· Communication: avoid insensitive or offensive language. Be friendly, kind and courteous at all times."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}