{
    "Job ID": "4754994",
    "Description": "Arabic Lady - Only (Preferred to be an Engineer)The ideal candidate will have experience in all stages of the sales cycle. They should be confident with building new client relationship and maintaining existing ones. They should have evidence of strong skills and possess good negotiation skills.Job DescriptionSales & Business Development\nEnsure the achievement of company objectives through developing new business relations with Contractors, Consultants, Clients etc. and winning new Business.\ncoordinates with our Commercial & technical Dept bid proposals that are appropriate for the respective projects.\nActively follows-up on its bids in order to maximize the chances to convert bids into meeting with clients virtually or during sales visits\ndemonstrating and presenting products\nmaintaining accurate records\nreviewing sales performance\nworking towards monthly or annual targets.\nSuccessfully negotiate terms and conditions in accordance with our corporate guidelines\nRegistering company & products with various developers, clients, consultants, Govt. AuthoritiesSkills",
    "Skills": [
        "Requirement:",
        "Experience in identifying and building strong and sustainable relationships with existing and new clients.\nMust have experience in managing sales channels in UAE.\nMust Have UAE Driving License\nSelf-motivated and driven by targets\nResilience/Flexibility @ work timings\nStrong communication skills – including both verbal and written\nThe ability to influence and negotiate with others\nCommercial awareness\nExperience of 4-6 Years in Sales & Business Development.\nBachelor's degree 3+ years in sales industry\nExperience in full sales cycle including deal closing Demonstrated sales success\nStrong negotiation skills\nCRM experience is preferred"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}