{
    "Job ID": "4754006",
    "Description": "Position Title:             UBCTD Wellsite SupervisorEmployment Type:     Rotational / 1-year contractSalary:                        daily rate depending on experience and qualificationsJob Location:             UAE  About the Client:  A leading oil and gas company in UAE  Job Description:  Manages all operations in a manner that ensures UBCTD operations programmes are carried out in safe and cost-effective manner, ensuring the health and safety of all personnel, the protection of the environment and COMPANY’s business objectives are met.\nResponsible for the implementation of Contractor’s wellsite HSE and the conformity to all COMPANY safety policies and programmes.\nAssists in HSE field audits, investigations, or initiatives\nPrepares a 7 and 14 day ‘Lookahead’ for logistics and personnel planning based on the current operations and upcoming operation.\nEnsures that COMPANY Well Control and Pressure Control Standards are met in all respects including equipment configuration, testing and crew response.\nReviews and recommends optimization of well intervention and UBCTD programmes/procedures.Skills",
    "Skills": [
        "Qualifications: ",
        "Bachelor’s degree in Engineering Degree preferred, but not essential based on experience.\nMust have at least 15 years of experience in Drilling, Workover, Well Services, Intervention operations, of which 5 years shall have been in a Wellsite Supervisory role for UBCTD operations.\nKnowledgeable on wide range of UBCTD procedures, methods, operations and challenges (slickline, wireline, coiled tubing, UBD, well flowback and clean-up, well effluent waste management, etc.).\nMust have experience working in H2s environment, tight oil and gas reservoirs, depleted reservoir operations – UBD/HPHT operations.\nFamiliar with a UBCTD operations and working environment related to 12,000 to 16,000ft deep, HP (10,000 psi) and HT (320ºF) gas wells.\nExperienced in management of rigless well services requiring multiple intervention methods and POB attendance of up to 85 persons.\nExperience in slickline operations, procedures and well pressure control, UBCTD operations on low and high-pressure gas, gas-condensate, and carbonate wells in middle east, in drilling projects using Biosteering and/or biostratigraphy is beneficial.\nExperience in drilling projects using Biosteering and/or biostratigraphy, and must be excellent in grasp and understanding of UBD operations, surface separation equipment is required.",
        " "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Oil and Gas",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}