{
    "Job ID": "4754845",
    "Description": "Rides Operator Theme Park - must have experienceA Ride Operator is responsible for the safe and efficient operation of rides and attractions at a leisure park. They must ensure that all safety protocols are followed and that guests are kept safe and happy. They must also ensure that the rides are properly maintained and kept in good working order. Other duties include assisting guests with any queries they may have, providing customer service, and maintaining a clean and safe environment.The purpose of a ride operator is to ensure that all riders enjoy a safe and enjoyable experience on the rides they are operating. This involves carrying out a range of duties, such as setting up the rides, operating the rides according to safety protocols, monitoring riders and keeping the area safe and tidy. Ride operators are also responsible for providing customer service and dealing with any queries or complaints in a professional manner.A Ride Operator is responsible for the safe operation of amusement park rides and attractions. They ensure that safety standards are maintained, provide instructions to riders, and help them disembark safely. It is essential that Ride Operators possess excellent communication and customer service skills, as well as a strong commitment to safety.Ensure rides are operated safely and in accordance with relevant health and safety regulations\nMonitor guests and ride operations\nCarry out safety checks and maintenance of rides\nAssist guests with loading and unloading\nProvide customer service to guestsSkills",
    "Skills": [
        "Ride Operator Skills:",
        "Customer Service\nOrganizational Skills\nAttention to Detail",
        "Ride Operator Personal Traits:",
        "Enthusiastic\nPassionate\nCustomer-focused\nGood communication skills\nAbility to work as part of a team"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "United Kingdom",
        "Company Industry": "Amusement & Recreation Facility; Entertainment",
        "Company Type": "Recruitment Agency",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}