{
    "Job ID": "4754003",
    "Description": "Manage and supervise warehouse activities, including receiving, storing, organizing, and distributing automotive parts and components.\nArrange distribution of goods according to the delivery policy to meet or exceed specific KPIs\nManage and supervise warranty claims according to warranty policies.\nAssign daily delivery plans to driver’s and helpers.\nPrepare and send necessary reports weekly to line manager.\nReview, check return requests and prepare necessary documentations for submission to inventory controllers.\nEnsure following of FIFO for goods with shelf life.\nSupervise scrapping process and prepare necessary approvals documentations and reports.\nPrepare necessary MEMOs related to warehouse operations for approval.\nRecording overtime for Warehouse staff and submit necessary documentations and reports.\nTracking vehicles service inspections and requests for necessary repairs or service.\nPrepare and coordinate with 3PL for inbound and outbound requests.\nCoordinate with internal departments, and logistics partners to ensure timely delivery and receipt of goods.\nMaintain accurate inventory records using computerized systems and conduct regular stock checks, cycle counts, periodic counts and audits to ensure inventory accuracy.\nPlan and prioritize warehouse activities to meet customer demands and internal requirements, ensuring timely order fulfilment.\nProcess transfer requests through different locations and ensure timely delivery.\nImplement and enforce standard operating procedures (SOPs) for warehouse operations, ensuring compliance with safety, security, and quality standards.\nOptimize warehouse layout and storage systems to maximize space utilization and improve operational efficiency.\nTrain and supervise warehouse staff, providing guidance, coaching, and performance feedback to ensure a productive and motivated team.\nMonitor and control inventory levels to minimize stock discrepancies, damages, and obsolescence.\nCoordinate with procurement and purchasing teams to ensure timely availability of materials and manage stock replenishment.\nCollaborate with cross-functional teams, such as sales, production, and customer service, to address customer requirements and resolve any issues related to inventory or order fulfilment.\nRequests regular inspections and maintenance of warehouse equipment, ensuring their proper functioning and safety compliance.\nImplement and promote lean and continuous improvement initiatives within the warehouse to drive operational excellence.\nIdentify areas for process improvement, cost reduction, and productivity enhancement within the warehouse operations.\nGenerate and analyse reports on warehouse performance metrics, such as inventory accuracy, order fulfilment rates, and on-time delivery.\nAdhere to legal and regulatory requirements related to warehouse operations, including health and safety standards, environmental regulations, and labor laws.\nStay updated on industry trends, best practices, and emerging technologies in warehouse management to propose innovative solutions for process optimization.\nPerform other department duties related to his/her position as directed by the Head of the DepartmentSkills",
    "Skills": [
        "Bachelor's Degree holder\nMinimum 5 years relevant experience \nExperienced Warehouse operations, inventory control within Automotive industry\nProficient in MS Office (Word, Excel, Outlook) preferably with SAP experience"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}