{
    "Job ID": "4755909",
    "Description": "Evaluate financial statements to streamline your daily processes.\nAssist with monthly closings procedures. - Assist with tax computations & returns.\nAssist the independent auditor in conducting an annual evaluation of company records.\nHandle monthly, quarterly and annual closings.\nPublish financial statements in time.\nCoordinate with the management and uphold the standard laws and regulations for monitoring, updating, and maintaining fiscal activities.Proficiently process and record businesstransactions and invoices, while ensuringaccuracy and completeness of financial data foraccounts payable maintenance.· Diligently investigate and resolve anydiscrepancies by reconciling vendor accounts andexamining monthly vendor statements.· Preparing and scheduling checks and banktransfer to facilitate prompt payment to vendorsand other payees.· Manage petty cash, ensuring properdocumentation and accounting for alltransactions.· Monthly Bank account reconciliation.· Managing intercompany related transactions.· Accounts receivable management.· Prepare comprehensive cash flow reports toinform decision-making and support financialplanning efforts.· Proactively organize and participate in meetingswith clients' financial teams, demonstratingeffective communication and collaboration skills.· Ensure timely submission of VAT returns,adhering to regulatory requirements anddeadlines.Skills",
    "Skills": [
        "Pertinent educational qualification in the field of Commerce, Finance, and Economics.\nKnowledge of finance, accounting, budgeting, and cost control principles.\nAdroit soft skills to enable fluent in-house operations and maintain strong partner relationships.\nA keen eye for minute details coupled with an instant ability to make sound decisions.\nAbility to prepare detailed and accurate reports within the given timeframe as per requirements.\nQualified Microsoft Suite professional with a proven track record of implementing technology in financial tasks."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Age": "Min: 20 Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}