{
    "Job ID": "4755097",
    "Description": "HR Specialist (Saudi National Only)Job Overview:As the HR specialist in Riyadh you will work closely with the team to ensure comprehensive HR support on a day to day basis managing all onboarding, iqama processing, coordinating the GOSI process, monitoring Saudization directives, delivering presentations to new staff and liaising with other regional offices to ensure employment contracts are received and all relevant documents are actioned. As you will see the Riyadh employees through their whole journey you will also conduct and monitor exit interviews and manage the process, including final settlements and cancellation of all documentsAdministration will also play a key part of the role of HR Specialist and you will be expected to monitor iqama and Saudi visa document expiry dates, update changes in processes to the wider team and manage visas for all of the Riyadh employees. Custody of corporate documents such as trade license, personnel files and database input is also part of this role and it is expected that the HR specialist will proactively work to improve the HR service and strive to implement best practices.Job Responsibilities:1.     Recruitment and Staffing: Managing the recruitment process, including job postings, candidate screening, interviews, and onboarding.2.     Employee Relations: Handling employee grievances, conflicts, and disciplinary actions while promoting a positive work environment.3.     Benefits and Compensation: Administering employee benefits programs and ensuring compliance with labor laws regarding compensation.4.     Training and Development: Identifying training needs, coordinating training programs, and overseeing employee development initiatives.5.     HR Policies and Compliance: Developing and enforcing HR policies in alignment with Saudi labor laws and regulations.6.     Performance Management: Implementing performance appraisal systems and providing guidance to managers on performance-related matters.7.     Data Management: Maintaining employee records, handling payroll, and generating HR reports.Skills",
    "Skills": [
        "Proven 5+ years of work experience as an HR Specialist or HR Generalist in Saudi Market\nHands-on experience with Human Resources Information Systems (HRIS), like Microsoft Dynamics 365.\nKnowledge of Applicant Tracking Systems\nGood understanding of labour legislation and payroll process\nFamiliarity with full cycle recruiting\nExcellent verbal and written communication skills (Bilingual – English & Arabic)\nGood problem-solving and people & dispute management skills\nTeam management skills\nMinimum Bachelors degree is mandate. Masters in Human Resource domain would be added advantage.\nValid Saudi Residency.\nShould hold valid Saudi Driving License"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}