{
    "Job ID": "4755976",
    "Description": "We are currently looking to have an independent, dynamic, and self-motivated Sales Agents to join our team on freelance basis. As a Sales Agent, you will be responsible for building and maintaining professional relationships with customers, customer persuasion, and seeking our targeted customers.Cyber TTP Services is a reliable and reputable company, specialized in information and operations technologies (IT/OT) and more precisely in cybersecurity. Through its highly qualified expert-consultants, it provides various services related to cyber audits, risk and vulnerability assessment, cyber compliance, security hardening, design and configuration review, advisory support and assistance, career design, training and certification programs. In addition, it organizes awareness campaigns, open events, activities and cyber competitions.We are currently expanding our business mainly within Qatar with large, medium and small businesses and even with individuals, and we also target the rest of the countries in the world, with a special focus on the Middle East, West Asia and Africa.Job Responsibilities:Maintain a solid understanding of company’s offering and forthcoming services.\nIdentify and target potential customers in various industries.\nMake as fresh outbound calls and visits as possible to generate new sales.\nCreate and deliver persuasive presentations, and proposals to customers.\nGenerate possible customer’s leads.\nRespond to queries with regards to products being promoted.\nFollow-up on initial contacts as required to close the sale.\nComplete call logs and reports about daily operations and customer information.\nNegotiate contracts and pricing agreements to secure new deals and contracts.\nOther duties as assigned.Skills",
    "Skills": [
        "Fluent written and spoken in English. Arabic language is a plus.\nProficiency in MS Office applications.\n2+ years of experience in sales role in the concerned country.\nAbility to demonstrate a detailed understanding of solution selling.\nIn-depth knowledge of sales operations, lead tracking and following sales targets.\nStrong organization skills, ability to prioritize different tasks quickly.\nAbility to build relationships quickly and effectively.\nGreat communication and negotiation skills.\nResults driven and self-motivated.\nValid Qatar Driving License and own a vehicle is a plus."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Cyber & Network Security; IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}