{
    "Job ID": "4755931",
    "Description": "Dear Canidates .We are limousine company and hiring drivers for our cars to passenger transport. *We would like to provide you with some important details about the position:*1. Car Provided: As per our policies, we provide cars from top brands such as Lexus,Highlander Tesla or Yukon and viano 2. Ride-Hailing Applications: You will operate through popular ride-hailing applications like Uber, Careem, Yango which maximizing your earning potential and flexibility._3. Company Visa: It is essential for all drivers to be under our company's visa _due to the requirement of obtaining the RTA card_.4. Training Program: To ensure exceptional service and safety standards, all drivers undergo a comprehensive two-week training program to enhance their skills.     5.Commission-Based Salary.With this model, our drivers have the potential to earn a minimum monthly income ranging from 3500to 7000 Aed Best regards, Luxury Limousine CompanySkills",
    "Skills": [
        "Excellent Navigation Skills: Proficiency in using navigation tools and applications to efficiently plan routes and navigate through various traffic conditions, optimizing delivery schedules.\nCurrent and valid driver's license is a must-have requirement.\nPossession of an up-to-date and valid driver's license is necessary.\nApplicants should hold a driver's license that is currently in good standing.\nWe're looking for individuals with a driving record free from significant infractions.\nEffective use of navigation applications to ensure efficient travel is a necessary skill."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 18",
        "Gender": "Male",
        "Degree": "Certification / diploma",
        "Age": "Min: 24 Max: 48"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "50"
    }
}