{
    "Job ID": "4755973",
    "Description": "•To check the work plan prepared by project planning department and start the activities according to plan to achieve project completion on target dates.•To ensure that HVAC site activities are conducted under controlled conditions as per approved shop drawings, method statements, speciﬁcation and work plan.•To maintain the site material order and to check time-to-time requirement of material according to site plan, to program and schedule as per project planning department for proper ﬂow of work.•To conduct site inspection with consultant for approval of work.•To attend all the technical meetings with consultant/client representative.•To monitor the activity of subcontractor to ensure completion of work on target dates.•Preparation of quotations, variations and running bills of concerned projects.•To assist in preparation of material approval request submittals & to obtain approvals at the same time before starting the project.•Quality assurance in installation and maintenance of HVAC system.•Preparation and submission of as built drawings.•Having the HVAC team to attend the safety meetings and toolbox talks on weekly basis and on any requirement to ensure the personal safety of workers and subordinates.•To monitor the production of HVAC accessories (DUCT and Diffuser).To follow up the installation works and allocation of workforce as per demand in the Course of the project.•Material ordering as per the approved material submittals and speciﬁcation.•Coordination with Fireﬁghting, Plumbing and Electrical works.•To ensure the work is performed in accordance with the speciﬁcations/procedures.•Responsible for the successful execution of the contractual and statutory requirements.•Liaised with planning manager and scheduler for looking ahead and target programs.•Coordinated and controlled the activities of work crews and sub-contractors.•To utilize, monitor & maintain project schedules, drawings, speciﬁcations, daily tasks.•Checked the progress of the work at sites as per program.•Installation, commissioning and Balancing of VAV, FCU, AHU, Chiller, Primary and secondary Pump.•Installation of Duct & Chilled Water Piping and Grill & Diffuser.•To prepare the measurement sheet of ducting and piping using excel sheet.•Installation and commissioning of DX Air Conditioning (VAV/VRF).Skills",
    "Skills": [
        "HVAC System Design: Proficiency in designing HVAC systems, including calculating heating and cooling loads, selecting equipment, ductwork design, and specifying ventilation requirements.\nAutoCAD and HVAC Design Software: Competence in using computer-aided design (CAD) software like AutoCAD and HVAC-specific software for system modeling and design.\nMechanical Engineering: Strong knowledge of mechanical engineering principles, thermodynamics, fluid mechanics, and heat transfer to design efficient HVAC systems.\nEnergy Efficiency: Understanding and implementation of energy-efficient HVAC technologies and practices to minimize environmental impact and reduce operating costs.\nCodes and Standards: Familiarity with local and international HVAC codes, standards, and regulations to ensure compliance with safety and environmental requirements.\nProject Management: Project management skills to effectively plan, organize, and execute HVAC projects, including budgeting, scheduling, and resource allocation."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "India",
        "Degree": "Certification / diploma",
        "Age": "Min: 23 Max: 33"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}