{
    "Job ID": "4755076",
    "Description": "Department: Design DepartmentReporting to: Executive Director, DesignAbout our Client:Our client is a leading integrated real estate master developer based in the UAE. Specializing in strategic mixed use community projects, they are responsible for the building & development of some of the major sustainable residential communities and tourism destinations in the country.Your Role:To ensure all properties within the clients’ portfolio offers visitors and tenants a seamless customer experience. This role is responsible for leading, managing, and coordinating the design and implementation of effective lighting solutions, for both internal and external spaces, across a range of development projects. They collaborate with architects, engineers, and project managers to ensure that lighting plans meet project specifications and timelines, manage and supervise lighting design teams, and provide technical support during installation and testing phases. Responsibilities:•           Act as a subject matter expert on lighting design, providing technical advice and guidance to internal and external stakeholders.•           Collaborate with architects, engineers, and project managers to ensure that lighting design plans meet project specifications and timelines.•           Collaborate with internal and external teams to develop proposals and pitch presentations for new projects.•           Conduct research to stay up-to-date with the latest lighting technologies and design trends and make recommendations for their integration into project designs.•           Conduct site visits to assess lighting requirements and provide on-site support during installation and testing phases.•           Develop and implement innovative and cost-effective lighting design solutions for both indoor and outdoor spaces in accordance with project requirements and company standards.•           Develop and maintain relationships with clients, ensuring that their needs and specifications are being met throughout the project lifecycle.•           Ensure that lighting designs comply with relevant safety, environmental, and building regulations.•           Lead the development of lighting design standards, including the development of design guidelines, specifications, and best practices.•           Liaise with suppliers and contractors to ensure that lighting equipment and materials are sourced, delivered and installed as required and approved.•           Manage and supervise the work of lighting design teams, ensuring that work is completed to a high standard, on time, and within budget.•           Mentor and train junior members of the design team regarding lighting design principles, providing guidance and support as required.•           Provide technical support to project teams during installation and testing phases, ensuring that lighting systems are functioning correctly and according to approved project plans.Skills",
    "Skills": [
        "Key Skills & Qualifications:",
        "•           Bachelor's or Master’s degree in Lighting Design, Architecture, Electrical Engineering or a related field.",
        "•           At least 5-10 years of experience in lighting design with a proven track record of delivering successful projects.",
        "•           Continuing education in design, technology, and project management is desirable.",
        "•           A minimum of 5 years’ experience in the UAE/ GCC region.",
        "•           Proficiency in the Arabic language is desirable but not mandatory.",
        " •           Exceptional knowledge of lighting design principles and techniques, including knowledge of lighting software such as Dialux, Relux, and AGi32.",
        "•           Knowledge of relevant codes, standards, and regulations related to lighting design.",
        "•           Strong working knowledge of various types of lighting systems, equipment and fixtures.",
        "•           Demonstrated proficiency with industry software such as Adobe Creative Suite, SketchUp, and AutoCAD.",
        "•           Solid experience and background developing internal and external lighting design strategies and systems for leisure, hospitality, retail, commercial, and residential development projects at all scales."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}