{
    "Job ID": "4756584",
    "Description": "تحقيق هدف المبيعات الشهري\n- الترحيب بكل العملاء مباشرة عند دخولهم المعرض\n- بناء علاقة إيجابية مع العملاء وتفهم إحتياجات العميل وتقديم المنتج المناسب لهم\n- التعامل مع الشكاوي العملاء بشكل إيجابي ومحاولة حل جميع مشاكلهم ورفع الموضوع للمدير المباشر إذا تعذر الحل\n- التعامل مع طلبات التبديل و الترجيع لجميع العملاء طبقاً للتعليمات المتبعة في حينها و إتباع التعليمات الخاصة بحجز البضائع\n- تقديم خدمة عملاء ذات مستوى عالي وذلك من خلال معاملة الزبون بطريقة مهنية وكذلك الإستماع للعميل وإعطائه الإهتمام الكافي وإتباع المباديء الخمسة لخدمة العملاء والتواصل المستمر مع العميل عن طريق الهاتف والرسائل القصيرة و البريدية و جميع الطرق المتاحة و إطلاع العميل عن كل ما هو جديد من بضائع وخدمات\n- المحافظة على نظافة مكان العمل\n- المحافظة على المظهر الائق و الالتزام بالزي الرسمي الكامل\n- إتباع تعليمات الإدارة بخصوص قوانين العمل التي تم التعميم عليها مسبقا مثل ( التعاميم الخاصة بأوقات الدوام , الراحات,أوقات و أماكن الطعام , الدخول والخروج, زيارات العمل,الاجازات وما الى ذلك)\n- المحافظة على ترتيب مخازن البضائع وكذلك المحافظة على نظافتها وترتيبها الأمر الذي يسهل عملية البيع\n- العمل مع باقي زملاء القسم في عملية الجرد الدوري\n- المشاركة الفعالة بحميع النشاطات التي تقوم بها الشركة\n- العمل بشكل مستمر على التثقيف الذاتي لزيادة المعرفة في البضائع و المنتجات\n- إتباع تعليمات الأمن و السلامة الخاصة بالشركة و التعاون الكامل مع قسم الأمن بذلك الخصوص\n- العمل على إستقطاب عملاء جدد و المحافظة على العملاء الحاليين و العمل على إرجاع عملاء قدامى (الذين توقفوا عن الشراء لأسباب مختلفة) و تحفيزهم على العودة للشراء\n- القيام بشكل مستمر بترتيب البضائع في المعرض وإعادتها الى وضعها الطبيعي بعد الإنتهاء من عملية البيع و إعادة عرض القطع التي تم بيعها من المعرض وذلك من مخزون المستودعات\n- أعداد التقارير اليومية المطلوبة الخاصة بالمبيعات المعرض وجرد النقدية اليومي\n- مراجعة مدير المعرض فى أى مشكلة تعوق سير العمل لحلها\n- إتباع كافة التعليمات الصادرة من الادارةSkills",
    "Skills": [
        "القدرة على تحمل ضغط العمل\nمستوى اللغة الإنجليزية جيد\nالقدرة على العمل في فترات مختلفة\nمهارة التواصل مع الآخرين"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}