{
    "Job ID": "4756586",
    "Description": "The role is initially project specific and based in KSA for 8- 12 months. The position will be required to support project delivery in Pace offices in Kuwait, Bahrain and KSA, and through all operational regions.Key skills include the following;Preparation of cost plans at various design stages in accordance with RICS professional practice.\nMeasurement of building work items, compiling unit rates and compiling the final cost estimate report in in accordance with RICS professional practice.\nManaging the complete tender process in accordance with best practice and the selected procurement strategy and giving advice on the most appropriate procurement route and associated documentation.\nOverseeing the quantification and costing of construction works including preparing estimates and cost plans, producing tender and contract documentation, elemental analyses, benchmarking data, schedules of works, bills of quantities, valuing works for interim payments, change management and final accounts.\nProviding advice on the most appropriate form of contract to be used for main, sub and package contracts from the standard suites of contract commonly used in the industry within the region.\nEstablishment of construction contracts and the mechanisms that are typically found within them.\nFinancial management of a project during the pre contract and post contract construction phase, cost control procedures and reporting.\nAdvising on managing risk, risk mitigation measures.\nParticipate in value engineering workshops.\nMaintaining, validating and updating the unit rates and construction cost information database.\nImplement and use QS departmental Quality Assurance Procedures.\nStay informed on various BIM and QS-related software and how they work with Revit and Navisworks and be able to extract quantities.Skills",
    "Skills": [
        "BSc Quantity Surveying or Commercial Management.\nMRICS qualified or enrolled APC candidate and demonstrably working towards APC within 6 months. APC candidates are required to provide their RICS membership number and Supervisor/Counsellor names.\nExcellent proficiency and written and spoken Arabic and English\nExperience in both pre and post contract QS Services.\n8-10 years Quantity Surveying experience in a consultancy environment or similar client facing experience.\n5+ years’ experience in BIM."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}