{
    "Job ID": "4756493",
    "Description": "Development and recommendation of the Trade Marketing Strategy to achieve defined business objectives (Target growth) across all product categories.\nManage relationships with external vendors to ensure high-quality and timely execution of marketing programs, and to ensure competitiveness.\nDevelopment and execution of strategic marketing plans for all brands.\nLead the execution of marketing programs from start to finish, leveraging internal & external support and driving collaboration.\nDevelopment of the company's Trade Marketing Strategy to achieve defined business objectives across all brands and categories.\nEstablish, execute and evaluate multichannel marketing strategies.\nAnalyze retail audit data to identify growth opportunities and develop the recommended action plan.\nLead the planning, execution, and evaluation of local, regional, and international marketing campaigns.\nLead the planning, execution, and evaluation of experiential marketing activities/programs.\nPresent ideas and final deliverables to internal and external teams, and communicate with senior leaders about marketing programs, strategies, and budgets.Skills",
    "Skills": [
        "Bachelor’s degree (or equivalent) in marketing, business, or related field.\nMinimum 5 years of experience in a similar role.\nAble to Explore opportunities to add value to job accomplishments.\nProven success in developing marketing plans and campaigns.\nStrong track record of overseeing a range of brands and projects.\nSolid project management, multitasking, and decision-making skills.\nExcellent verbal and written communication skills.\nCapability to look for new ways to improve job accomplishments.\nA strong desire to explore possibilities and improve the project."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Farawaniyah, Kuwait",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}