{
    "Job ID": "4756800",
    "Description": "Help colleagues, give them the training, follow up with them.\nWork with a variety of patients, advising on therapy.\nConducting thorough assessments of patients to identify their physical abilities, limitations, and specific conditions or injuries. This involves analyzing medical histories,\nPerforming physical examinations and using diagnostic tools to determine the root cause of the problem.\nDeveloping personalized treatment plans based on the assessment findings. This includes setting realistic goals and determining appropriate interventions and\nProviding patients with information and guidance on their condition, treatment options, and self-management strategies. Educating patients about proper body mechanics,\nErgonomics, and home exercises to facilitate their active participation in the recovery process and prevent future injuries.\nRegularly monitoring and assessing the patient's progress throughout the treatment process. Adjusting treatment plans as needed and modifying interventions based on the patient's response to therapy.\nCollaborating with other healthcare professionals, such as occupational therapists, to ensure comprehensive and coordinated patient care. Maintaining clear and timely communication with the interdisciplinary team to exchange information, provide updates, and make appropriate referrals when necessary.\nEngaging in continuous learning and professional development activities to stay updated with the latest research, evidence-based practices, and advancements in the field of physiotherapy.\nTechniques to address the patient's condition and help them regain mobility, function, and independence.Skills",
    "Skills": [
        "Excellent interpersonal communication skills.\nEquipped with the latest knowledge on medical treatments and general therapies.\nA warmhearted individual well-versed in understanding the patient's condition.\nAdept in communicating concepts, suggestions, and action plans to the concerned personnel.\nShould have strong interpersonal skills, good administration skills, strong knowledge of physiotherapy techniques."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical & Healthcare Equipment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}