{
    "Job ID": "4756416",
    "Description": "Work closely with product managers and developers to deliver polished designs\nOwn both the interaction and visual design of the products and portals, defining consistent UI components and guidelines following well-established patterns and standards.\nYou're comfortable with all stages of the design process, from discovery to delivery.\nYou will have to understand and visualize complex systems, from business concepts over data sets to design system components.\nDesigning and implementing intuitive user interfaces for web and mobile applications\nCreating wireframes and prototypes to aid in design and development\nCollaborating with development teams to ensure designs are functional and adaptable\nImplementing user feedback and testing to refine designs\nAssist in creating visually appealing digital and print materials, such as brochures, social media graphics, and presentations.\nTake conceptual ideas and translate them into visually appealing designs for both print and electronic media, ensuring they align with the overall event theme and brand guidelines.\nDevelop a deep understanding of the design requirements and objectives for each project.\nCreate visually engaging and persuasive proposal designs, sales decks, and client proposal presentations that effectively communicate our services and offerings to clients.Skills",
    "Skills": [
        "Minimum 4 years of experience in UX/UI Design and Graphic Design designing native apps, web and materials.\nProficiency in industry-standard design software (Figma, Photoshop, Adobe illustrator, Adobe XD)\nExceptional Skills in Visual Design, UX Design, Prototyping, User Research, UI Design and Design-Thinking\nPassionate in Graphic Designing and UX/UI design.\nUnderstanding of how user research should be integrated into a project and a good understanding of all the other relevant skill sets, including Business Design, IT, Brand and Marketing.\nStrong Knowledge of Microsoft Office Suite (Word, Powerpoint, Excel)\nAbility to understand business requirements and user needs and transform them into functional design proposals.\nObsessive attention to detail and good taste in layout, typography and visual hierarchy.\nYou have excellent knowledge of digital design and visual theory (i.e., composition, color theory, typography, etc.), a sharp eye for layout design, and a strong affinity for the latest design trends, along with a mastery of freehand illustrations and/or digital drawings.\nMust be fluent in Arabic & English",
        " ",
        "Duration of contract: 1 Year"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}