{
    "Job ID": "4756664",
    "Description": "Review and develop existing HR policies and procedures within the business.\n\nDevelop and monitor annual departmental budget, goals and objectives and annual operational work plan for the department.\nCollecting relevant data of team members for managerial and financial operations.\nOversee and manage all recruiting within the business.\nConduct brainstorming sessions with individuals or groups to decide the type of development sessions.\nEnsure key addressal of vital operational aspects to improve the company performance consistently.\nشركة اشراقات التقوى للتجارة العامة ، الشحن و التفريغ والتخليص الجمركي\nفرع مصر (مدينة السادس من أكتوبر)\nأدارة التوظيف و التدريب المهني/ قسم الموارد البشرية\nالموضوع: شاغر وظيفي\nالوظيفة: أخصائي موارد بشرية\n نظرة عامة على الوظيفة:\nأخصائي الموارد البشرية يلعب دورًا حاسمًا في إدارة جميع أنشطة الموارد البشرية لدعم نمو الشركة وضمان قوة عاملة منتجة وملتزمة للعمل بشكل وثيق مع الإدارة والموظفين لتقديم التوجيه بشأن سياسات الموارد البشرية وإجراءاتها وأفضل الممارسات.\nالمسؤوليات:\n1- التوظيف واكتساب المواهب:\n- تطوير وتنفيذ استراتيجيات التوظيف الفعالة لجذب وتوظيف أفضل المواهب.\n- مصدر المرشحين من خلال قنوات مختلفة، بما في ذلك لوحات الوظائف، ووسائل الإعلام الاجتماعية، والإحالات.\n- إجراء المقابلات، وفحص المتقدمين، وتسهيل عملية الاختيار.\n- التعاون مع رؤساء الأقسام لتحديد متطلبات الوظيفة وإنشاء التوصيف الوظيفي.\n2- الإعداد والتوجيه:\n- تنسيق برامج تأهيل الموظفين الجدد وتوجيههم.\n- التأكد من استكمال كافة الأوراق والوثائق اللازمة.\n- تزويد الموظفين الجدد بنظرة عامة على سياسات الشركة وإجراءاتها وتوقعاتها.\n3- علاقات الموظفين:\n- العمل كنقطة اتصال لاستفسارات الموظفين ومخاوفهم وتظلماتهم\n- تعزيز ثقافة مكان العمل الإيجابية والشاملة\n- التوسط وحل النزاعات بين الموظفين عند الضرورة\n4- سياسات الموارد البشرية والامتثال\n- الحفاظ على وتحديث سياسات وإجراءات الموارد البشرية بما يتوافق مع قوانين وأنظمة العمل\n- ضمان حفظ السجلات الدقيقة لبيانات الموظفين وملفات الموظفين\n- البقاء على اطلاع بالتغييرات القانونية واتجاهات الصناعة لضمان الامتثال\n5- إدارة الأداء\n- دعم عمليات تقييم الأداء وتقديم التوجيه للمديرين بشأن مراجعات الأداء\n- المساعدة في تحديد وتنفيذ برامج تطوير وتدريب الموظفين\n6- إدارة الفوائد\n- إدارة برامج مزايا الموظفين، بما في ذلك التأمين الصحي، وخطط التقاعد، والامتيازات الأخرى\n- مساعدة الموظفين مع الاستفسارات المتعلقة بالفوائد وعمليات التسجيل\n7- التدريب والتطوير\n- تحديد الاحتياجات التدريبية وتطوير البرامج التدريبية لتعزيز مهارات الموظفين ومعارفهم\n- تنسيق الدورات التدريبية وورش العمل كما هو مطلوب\n8- خروج الموظف من العمل\n- التعامل مع حالات فصل الموظفين، بما في ذلك مقابلات الخروج وعمليات الخروج من الخدمة\n9- تقارير الموارد البشرية\n- إنشاء تقارير وتحليلات الموارد البشرية لتقييم مقاييس واتجاهات الموارد البشري\n- استخدام البيانات لتقديم توصيات لتحسين العملية وتغييرات السياسة\n 10- الإمتثال والسلامة\n- ضمان الامتثال للوائح الصحة والسلامة في مكان العمل\n- تعزيز بيئة عمل آمنة ودعم التحقيقات في الحوادث/الأحداث\nالمؤهلات\n- درجة البكالوريوس في الموارد البشرية أو إدارة الأعمال أو أي مجال ذي صلة\n- خبرة مثبتة في أدوار الموارد البشرية، مع التركيز على الخدمات اللوجستية و الشحن (3-5 سنوات خبرة)\n- المعرفة بقوانين العمل واللوائح وأفضل ممارسات الموارد البشرية\n- اتصالات ممتازة ومهارات التعامل مع الآخرين\n- قدرات قوية في حل المشكلات وحل النزاعات\n- تفاصيل المهارات التنظيمية الاستثنائية\n- أتقان برامج الموارد البشرية\n- القدرة على الحفاظ على السرية والتعامل مع المعلومات الحساسة\n الى المتقدمين بطلب الشاغرالوظييفي:\nيعد دور أخصائي الموارد البشرية حيويًا في دعم نمو ونجاح شركة الخدمات اللوجستية والشحن و من لديه الرغبة و هو مختص في الموارد البشرية و الشغف لتعزيز بيئة عمل إيجابية وضمان الامتثال لسياسات وإجراءات الموارد البشرية، فنحن نشجع على التقديم ليكون عضوا فغالا ضمن فريق العمل بالشركة.Skills",
    "Skills": [
        "Well-versed in abiding by the organization's laws of safeguarding important employee data.\nExcellent ‘soft’ skills (people management and relationship building).\nSkilled in addressing emplo\nFluent collaborator with an ability to motivate team members.\nyee concerns with utmost sensitivity and professionalism.\nPassionate professional with an urge to impact employees and the company in a positive way."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "6th of October, Cairo , Egypt",
        "Company Industry": "Human Resources Outsourcing; Marine Transport Services; Shipping",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}