{
    "Job ID": "4756854",
    "Description": "Job descriptionWe are currently seeking a skilled and dedicated Secretary to join our dynamic team.Job Responsibilities:As our secretary, you will play a crucial role in ensuring the smooth and efficient operation of our office. Your responsibilities will include:Managing phone calls, emails, and correspondence with clients, suppliers, and other stakeholders.Coordinating appointments, meetings, and travel arrangements for team members.Maintaining accurate records, files, and databases, both electronically and in hard copy.Assisting with the preparation of reports, presentations, and other documentation as required.Conducting research, gathering information, and assisting with data analysis.Requirements:To excel in this role, we are seeking candidates who meet the following criteria:Proficient in using office software, including word processing, spreadsheets, and presentation tools.Strong attention to detail and accuracy in all aspects of work.Outstanding communication skills, both written and verbal.Fluency in English is required, and knowledge of additional languages is a plus.To apply, please submit your resume,Apply today and take the first step towards an exciting new chapter in your career!Job Type: Full-time  Monday to Friday 9am to 6pmSalary: From AED 4,000.00 per monthExperience:secretary: 2 years (Preferred) Skills",
    "Skills": [
        "Administrative Skills:",
        "Proficiency in office software such as Microsoft Office (Word, Excel, PowerPoint, Outlook).\nExcellent typing and data entry skills.\nStrong organization and time management abilities to handle multiple tasks and deadlines.",
        "Communication Skills:",
        "Fluency in English is essential, and knowledge of Arabic or other languages commonly spoken in Dubai can be a significant advantage.\nExcellent written and verbal communication skills for interacting with clients, colleagues, and external parties.\nPolite and professional telephone etiquette.",
        "Real Estate Knowledge:",
        "Familiarity with the local real estate market and Dubai's real estate regulations and laws.\nUnderstanding of property transactions, leasing agreements, and related documentation.\nKnowledge of commonly used real estate terminology.",
        "Customer Service Skills:",
        "Strong interpersonal skills to provide excellent customer service to clients.\nAbility to handle inquiries, schedule appointments, and assist clients with their real estate needs.",
        "Attention to Detail:",
        "High level of accuracy when preparing and proofreading documents, including contracts, listings, and correspondence.\nThoroughness in record-keeping and filing.",
        "Technical Skills:",
        "Proficiency in using real estate management software and databases for property listings and client information.\nKnowledge of digital marketing and social media platforms to promote property listings.",
        "Legal and Regulatory Compliance:",
        "Awareness of legal requirements and compliance related to real estate transactions in Dubai.\nKeeping up-to-date with any changes or updates in real estate laws and regulations.",
        "Problem-Solving Abilities:",
        "Capability to handle unexpected issues and find solutions when dealing with clients, property transactions, or administrative challenges.",
        "Confidentiality:",
        "Discretion and the ability to handle sensitive client information with confidentiality.",
        "Team Player:",
        "Collaboration and teamwork skills to work effectively with real estate agents, brokers, and other support staff.",
        "Flexibility and Adaptability:",
        "Real estate work can be dynamic, so being able to adapt to changing circumstances and priorities is important.",
        "Professional Appearance and Conduct:",
        "Maintaining a professional appearance and demeanor when dealing with clients and colleagues.",
        "Networking Skills:",
        "Building and maintaining relationships with other professionals in the real estate industry can be beneficial for referrals and business development."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 15",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}