{
    "Job ID": "4756496",
    "Description": "We are looking for a Public Relations (PR) Officer to organize and oversee PR activities and ensure effective communication with stakeholders, media, and the public.Your goal will be to cultivate a positive company image.Develop PR campaigns and media relations strategies\nCollaborate with internal teams (e.g. marketing) and maintain open communication with senior management\nEdit and update promotional material and publications (brochures, videos, social media posts etc.)\nPrepare and distribute press releases\nOrganize PR events (e.g. open days, press conferences) and serve as the company’s spokesperson\nSeek opportunities for partnerships, sponsorships and advertising\nAddress inquiries from the media and other parties\nTrack media coverage and follow industry trends\nPrepare and submit PR reports\nManage PR issues.Skills",
    "Skills": [
        "As a PR Officer, you should be an organized and cool-tempered professional who is able to handle a crisis. We expect you to have a creative mind and excellent communication skills. If you are also confident in your public speaking and project management abilities, we’d like to meet you.",
        "Proven experience as a Public Relations Officer or similar PR role\nExperience managing media relations (online, broadcast and print)\nBackground in researching, writing and editing publications\nProficient in MS Office and social media\nFamiliarity with project management software and video/photo editing is a plus\nStrong communication ability (oral and written)\nExcellent organizational skills\nAbility to work well under pressure\nCreativity and problem-solving aptitude\nBSc/BA in Public Relations, Journalism, Communications or a related field\nMust have a valid Kuwait Driving License",
        "Salary range between 300-350 KWD"
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "Egypt; Jordan; Lebanon; Palestine; Syria",
        "Age": "Min: 21 Max: 28"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}