{
    "Job ID": "4756546",
    "Description": "A newly established company based in Baghdad is seeking a highly motivated and proactive individual to oversee all financial aspects of the organization, ensuring financial health and success of the company. Experience working in logistics industry, within matrix structure and diverse team is desired. The ideal candidate should be a bilingual (Arabic & English) speaker.Duties and Responsibilities:       Oversee all financial operations, including budgeting and cost control, cash flow management, and financial reporting.\nEnsure accurate and timely preparation of financial statements, management reports, and financial performance analysis\nMonitor financial performance, identify trends, risks, and opportunities, and recommend appropriate actions to achieve financial objectives.\nEstablish strong internal controls, financial policies, and risk management frameworks.\nEnsure compliance with relevant financial regulations, laws, and reporting requirements.\nFoster effective communication and collaboration with other departments and senior management.\nEvaluate and recommend funding options, including debt and equity financing.\nDevelop relationships with financial institutions, negotiate financing terms, and manage banking relationships.\nEnsure accurate and timely bookkeeping, bank reconciliations, and invoicing.\nMaintain compliance with relevant tax laws and regulations.\nUtilize related software tools to efficiently manage financial data and communications between the team and external clients and suppliers.\nCollaborate with external advisors, auditors, and tax professionals as needed and with the utmost professionalism.\nWillingness to take on additional tasks and adapt to changing priorities as required.Skills",
    "Skills": [
        "Financial Management\nLogistics Industry Expertise\nLeadership and Team Management\nFinancial Analysis and Reporting\nRisk Management and Compliance\nCapital Management and Financing\nBusiness Acumen\nCommunication and Influence\nTechnology and Systems"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Baghdad, Iraq",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}