{
    "Job ID": "4756198",
    "Description": "Job TypeFull-Time / Remote (Within Dubai) / 1 Position Available\nHours To Be DeterminedJob DescriptionTravelyfe, a lavish travel and transportation company based in Dubai, is seeking a dedicated and responsible Travel & Event Manager. This is a full-time, permanent role where the selected candidate will specialise in designing both pre-packaged and bespoke travel experiences tailored to individual preferences and budgets. With a commitment to delivering unparalleled customer service, in-depth local knowledge, and sustainable tourism practices, the prospect will play a critical role in crafting extraordinary holiday experiences. These experiences will encompass a range of services including city tours, attraction bookings, airport transfers, event management, and much more, all underscored by our dedication to superior customer service.Job Duties:Primary Liaison: Serve as the primary point of contact for customers regarding holiday inquiries and bookings, ensuring consistent, high-quality service.\nClient Relationships: Establish and sustain robust relationships with both clients and key travel industry partners, including local tour operators, hotels, airlines, and event management companies. The objective is to secure lower prices or exclusive deals, which can then be passed on as value-added services to our customers.\nLasting Relationships: Cultivate and nurture lasting relationships with clients to ensure repeat business and referrals.\nTravel Facilitation: Coordinate and facilitate the entire travel process, from inception to execution.\nTravel Resources: Provide clients with essential travel resources such as guides, maps, and event schedules.\nBooking Essentials: Handle all booking necessities, including flight tickets, accommodations, and transportation rentals.\nPayment Handling: Oversee the collection of deposits and ensure timely payment balances from clients.\nCustom Packages: Design tailored holiday packages that align with clients' specifications, preferences, and budgetary constraints.\nVisa Acquisition: Oversee the process of travel visa acquisition for clients.\nRegulations And Advisories: Regularly update knowledge on travel regulations, visa necessities, and current travel advisories.\nIssue Resolution: Address and resolve client grievances in a timely and professional manner.\nKnowledge Base: Maintain up-to-date knowledge of travel trends, emerging destinations, and local attractions to provide accurate and current recommendations to clients.\nExclusive Offerings: Advocate for a range of travel services and actively promote our exclusive offerings.\nPromotional Campaigns: Contribute to the development and execution of promotional campaigns aimed at customer retention and acquisition.\nEducational Opportunities: Participate in relevant webinars, conferences, and other educational opportunities to enhance expertise.Company Perks & Benefits:Employee Discounts: Special discounts on Travelyfe services.\nWork-Life Balance: Consideration for personal needs and flexibility in scheduling.\nCompetitive Salary: Attractive salary package with potential performance bonuses.\nCareer Growth: Opportunities for ongoing professional development, career progression and training.Salary Range:Between AED 4,000.00 to AED 6,000.00 per month based on experience.Got What It Takes?If you're passionate about travel and tourism, love and enjoy UAE life, can handle a bit of pressure and have the relevant experience and knowledge to hit the ground running from day one, then answer the questions below and attach your resume to complete your application. We wish you a safe journey and look forward to the possibility of welcoming you to our team soon.Other Information:Travelyfe is committed to fostering an inclusive and diverse work environment. We believe in investing in our employees and ensuring a respectful, rewarding, and positive workplace culture.To apply, please submit your resume, and any relevant information, licenses or certifications. Only shortlisted candidates will be contacted for interviews.If you have a genuine passion and wish to be part of a team that takes pride in excellence, we encourage you to apply for this exciting opportunity with Travelyfe.Skills",
    "Skills": [
        "Job Requirements:",
        "Experience: Minimum of 2 years of experience in the travel and tourism sector.\nLocation: Candidates must either be currently residing in Dubai or willing to relocate at their own expense. Travelyfe does not provide accommodation or a relocation package but will assist with the work visa and its related benefits.\nCommunication Skills: Excellent communication skills in English; knowledge of Arabic is advantageous.\nCustomer Service: Exceptional customer service and communication abilities.\nMultitasking: Capability to manage several tasks and projects concurrently.\nProblem-Solving: Robust problem-solving skills and resilience under pressure.\nTravel Tools: Comprehensive knowledge of travel planning and reservation tools.\nTechnical Skills: Proficiency in Microsoft Office and familiarity with CRM systems.\nKnowledge Of Local Areas: Strong familiarity with UAE and its Emirates major landmarks, hotels, airports, and cultural attractions.\nEducational Qualifications: A degree in Tourism, Hospitality, or a related discipline is a plus."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Marketing; Travel Agency; Tourism, Museum, & Cultural",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}