{
    "Job ID": "4756779",
    "Description": "SummaryWe are looking for a Production Process Controller responsible to monitor physically (in-person) the production process and ensure that all materials are used properly, quantities are as per the formulation and standard procedures are followed to manufacture quality products. Ensure that the daily operational plan is followed and achieve the production targets. Follow up the maintenance schedule for all machines and ensure they are in good working condition, be able to control the machines on the production line. DescriptionWork with Production Manager to plan and manage daily production schedule and tasks to improve runtime.\nManage the production machines operators and train them if required up to the latest operational procedures and safety standards.\nMaintain proper labeling and operations instructions for each machine.\nSupervise the movement of forklifts and employees\nPlan and monitor material movement in production cycles to ensure continuous operations.\nEstablish his own routine to monitor regularly all machines in operation, and ensure that all the batches are conformed to the quality standards and all procedures are followed.\nChecking all machines and ensure they function properly, and operators are following the standard operation procedures.\nEnsure that the maintenance schedule for the machines is followed and keep machinery maintenance records.\nTake immediate action in case that any issue may arise through the production process, report to the production manager and escalate it if needed.\nCoordinate with the foreman for coaching, supervising and directing the staff.\nCollaborate with QC to ensure the production quality is maintained.\nEnforce the safety and health standards in the production area. \nReport on the production performance and progress to the production manager, develop and improve the production process.\nTracking production schedules and making sure that they are met by communicating changes to the production team.\nCoordinating work hours with management to ensure that production needs are met efficiently and effectively.\nPreparing reports on the status of production, including any delays or problems that may occur.\nEnsure that all materials needed for the daily production process are available and prepared on time.\nMonitoring the inventory of raw materials and finished products using computer programs such as MIS, Excel spreadsheets etc. Follow up with Raw Material Dpt for the delivery plan and take necessary action if there is any delay.\nDevelop in collaboration with Production Manager inventory control techniques to avoid shortages and excesses.\nAssist in processing customer orders according to the established schedule from the Customer Service Dpt.\nMonitor execution of work orders and adjust schedules for timely delivery.\nMaintain up-to-date knowledge on company objectives, production strategies and support activities.\nCoordinate with Manager in resolving production planning and control issues.\nWork with Manager to prepare work order documents and give timely batch approvals through MIS.\nEvaluate monthly the production team and individual performance. Skills",
    "Skills": [
        "Requirements",
        "is demanding job that requires the person to spend most of the time in the production area, continuously monitoring the process and to get involved with all the procedures and aspects of the production.\ncorrect person for the job should have:\nminimum 3 years of experience in the production floor of a medium to big scale production,\nbe educated to a diploma or degree level (preferably related to production or engineering),\nFluent in Arabic & English,\nExcellent knowledge of MIS and MS office or Google Apps,\nBe able to work overtime and/or weekends,\nWilling to learn and develop her/his self,\nBe punctual on her/his obligations towards the job,\nUndertake the responsibility of the job.",
        "job is mainly for Omani, Male and Female can apply, of age up to 40 years old. However, all applications that fulfill the above standards will be considered. ",
        "Benefits",
        " ",
        "Good salary as per the market standards with good chances to grow within the company, private medical and other extra benefits. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Certification / diploma"
    },
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Chemicals Manufacture",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}