{
    "Job ID": "4756804",
    "Description": "We are looking for a talented full stack web developer to join our team and help us build and maintain our e-commerce websites and operating system. The ideal candidate will have experience with Python, Django, React, MySQL, and AWS.Responsibilities:Develop and maintain our e-commerce website using Python, Django, Rest Api , React, and MySQLDevelop and maintain our operating system using Python and AWSTroubleshoot and resolve technical issuesWork with other developers and engineers to build and improve our systemsQualifications:3+ years of experience in full stack web development with PythonExperience with Django and MySQLExperience with AWSStrong problem-solving and debugging skillsExcellent communication and teamwork skillsApplication Question(s):Have you worked on E-Commerce Websites (Back-End & Front-End)Have you managed E-Commerce WebsitesHow many E-Commerce Websites have you worked onWhat are the biggest challenges you faced while developing e-commerce websitesWhat's the amount of e-commerce websites you have worked at the same timeList down some of e-commerce websites you have worked on.Are you currently employed? or free to joinknowledge of AI and Machine Learning ( required )Skills",
    "Skills": [
        "We are looking for a talented full stack web developer to join our team and help us build and maintain our e-commerce websites and operating system. The ideal candidate will have experience with Python, Django, React, MySQL, and AWS.",
        "Responsibilities:",
        "Develop and maintain our e-commerce website using Python, Django, Rest Api , React, and MySQL",
        "Develop and maintain our operating system using Python and AWS",
        "Troubleshoot and resolve technical issues",
        "Work with other developers and engineers to build and improve our systems",
        "Qualifications:",
        "3+ years of experience in full stack web development with Python",
        "Experience with Django and MySQL",
        "Experience with AWS",
        "Strong problem-solving and debugging skills",
        "Excellent communication and teamwork skills",
        "Application Question(s):",
        "Have you worked on E-Commerce Websites (Back-End & Front-End)",
        "Have you managed E-Commerce Websites",
        "How many E-Commerce Websites have you worked on",
        "What are the biggest challenges you faced while developing e-commerce websites",
        "What's the amount of e-commerce websites you have worked at the same time",
        "List down some of e-commerce websites you have worked on.",
        "Are you currently employed? or free to join",
        "knowledge of AI and Machine Learning ( required )"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Ajman, United Arab Emirates",
        "Company Industry": "Fashion & Apparel",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}