{
    "Job ID": "4756802",
    "Description": "مدير إدارة العقود هو مسؤول عن إدارة وتنفيذ جميع عمليات العقود في الشركة. يقوم بتطوير وتنفيذ استراتيجيات العقود وضمان الامتثال للمعايير والقوانين القانونية. يعمل مع الفرق الداخلية والشركاء الخارجيين لضمان تنفيذ العقود بشكل صحيح وفقًا للجدول الزمني والميزانية المحددة. يجب أن يكون لدى مدير إدارة العقود مهارات قوية في التفاوض والتواصل وإدارة العقود. يجب أن يكون قادرًا على التعامل مع الضغوط وتحقيق الأهداف المحددة في الوقت المحدد.\n\nResponsibilities:\nتطوير وتنفيذ استراتيجيات العقود في الشركة.\nإدارة وتنفيذ عمليات التفاوض والتواصل مع الشركاء الخارجيين.\nمراجعة وتحليل جميع العقود وضمان الامتثال للمعايير والقوانين القانونية.\nتحقيق الأهداف المحددة في الوقت المحدد وفقًا للجدول الزمني والميزانية المحددة.\nتقديم المشورة والدعم الفني للفرق الداخلية في جميع الأمور المتعلقة بالعقود.\nتوفير تقارير منتظمة حول أداء العقود وتحليل البيانات المالية.\nتوفير التوجيه والتدريب لفريق العمل وتعزيز التعاون والتنسيق بين الأعضاء.\nتحديد وتقييم المخاطر المحتملة وتطوير استراتيجيات للحد من تلك المخاطر.\nمراجعة وتحديث سياسات وإجراءات العقود في الشركة وضمان الامتثال لها.\nالبقاء على اطلاع دائم بالمستجدات والتطورات في مجال إدارة العقود وتطبيقها في الشركة.Skills",
    "Skills": [
        "Preferred Candidate:\nخبرة لا تقل عن 9 سنوات في إدارة العقود أو مجال ذي صلة.\nشهادة جامعية في إدارة الأعمال أو مجال ذي صلة.\nمعرفة قوية بالقوانين واللوائح المتعلقة بإدارة العقود.\nمهارات تفاوض قوية وقدرة على التعامل مع الضغوط والتحقيق في المواعيد النهائية.\nمهارات اتصال ممتازة وقدرة على التفاعل بشكل فعال"
    ],
    "Preferred": {
        "Years of Experience": "Min: 9 Max: 16",
        "Residence Location": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 50"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}