{
    "Job ID": "4756784",
    "Description": "Manage and fulfill requests for equipment and services from company-owned projects and departments.\nEnsure the drivers and operator are operating the equipment’s and Vehicles in accordance with safe working procedures.\nEnsure the drivers and operator are conducts daily inspection as per the vehicle inspection checklist.\nPrioritizes and schedule the repair/requirement and maintenance activity for company owned equipments and vehicles based on project work and schedule.\nEnsure that experienced and qualified operator and driver are operating the company equipments.\nPlan and develop necessary training program for the drivers and operators.\nReview and recommends updating the asset register based on the working /physical condition of the equipment and vehicles.\nPlanning/schedule required manpower and resources to accomplish the required task / job in a manner providing maximum/timely availability of equipment for the operations.\nAssist in preparing department annual budget and controlling the department expenditures within the budget.\nProvides over sight and responsible for organization of equipment storage / parking area inside and outside of the equipment yard and facilities.\nEnsure completion of paper work associated with issue and return of the equipments, time cards/payroll, fuel and rental invoice, accident and damage report, pre and post operation inspection of the equipments sale of surplus and scrap materials, external hire and rental request etc.\nDevelop plans and schedules for the optimum utilization of available manpower and resources.\nConduct site visit/survey to evaluate the requirement and site working conditions to increase productivity and advice safety issues.\nMaintaining fleet maintenance computer management system.\nCommunicate regularly with department manager and maintenance section head for work /equipment requirements, job assignments and other equipment maintenance shop issues.\nMonitor/participate/involved for day-to-day status/developments of ongoing company project and functions to ensure the maintenance of equipment of operations schedules are met and work are performed proficiency and in a safe manner \nParticipating in department, project and company management meetings.\nExecute the other jobs as requested by the management.Skills",
    "Skills": [
        "Bachelor's Degree in mechanical, project management, or other related field\n10 to 15 years of work experience in the transport field.\nCommunication Skills & Leadership Skills\nRecruitment practices & Traffic law and country rules and regulations"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Residence Location": "Kuwait",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}