{
    "Job ID": "4756702",
    "Description": "DUTIES AND RESPONSIBILITIESFocal point for Control System and Instrument commissioning activites starting from preparation stage to the complete execution stage, for promoting and implementing of system completion and system completion database at site, Implement system completion including reporting, monitoring and control.\nLead execution for Control System and Instrument commissioning at site (onshore/ offshore) and keep commissioning execution targets defined by the project management. Review and approval of commissioning deliverables provided by EPC Contractor\nChampion initiatives with the Contractor to deliver on the project objectives i.e. safety, quality, cost and schedule and review for contractor’s commissioning execution effort and provide recommendations as necessary.\nProvide guidance and timely review on contractor’s commissioning execution plan and processes verifying fitness for purpose and compliance with contract requirements including codes and standards.\nEnsure coordination and communication for site activities with other discipline such as contruction, Hook up and Completion Team and HSES representative and provide technical support with contractor , quality, safety, planning, engineering and start up/ performance testing.\nReview, approve and implement Commissioning system completion and commissioning technical documents prepared by EPC Contractor.\nEnsure Contractor Commissioning submitted all documents as per schedule and timely reviewed and approved in accordance with the EPC contract requirements.\nReview and propose mitigation for Commissioning aspects of the Risk Management Plan and Monitor the mitigation when defined\nReview all Commissioning changes, including justification for cost and schedule impacts, in accordance with the PMOC procedure. Maintain a register of lessons learned.Skills",
    "Skills": [
        "EXPERIENCE:",
        "Minimum of 8 years of total experience with at least 6 years demonstrated as commissioning experience in major capital projects\nExperiences for preparation and set up of system completion data base and technical commissioning deliverable for Control System and Instrument commissioning.\nExperiences for commissioning execution of all field instruments, package equipments (HIPPS, WHCP, HPU, etc), ICSS (DCS, FGS, IPS/ ESD) at SAT/ FAT, fabrication yard, onshore and offshore commissioning included interface work with other contractor.\nExperience managed EPC contractors, sub-contractors and vendors involved in the oil and gas project at many locations.\nHand on experiences with system completion database ICAPS and OPERCOM Methodology.\nApplication and in depth knowledge of stakeholder specifications, International standard and a working knowledge of Industry standards.\nConversant with ATEX/IEC regulations and be CompEx certified for Ex installation and inspection is beneficial.",
        "QUALIFICATIONS",
        "Degree in appropriate engineering subject."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}