{
    "Job ID": "4756818",
    "Description": "Plan, organize and strategize Marketing objectives to support sales activities of the department.\nFacilitate to conduct SWOT analysis for competitors, competitors’ products, and customer to overcome competition.\nGather routine market intelligence, oversees and evaluates market research and adjusts marketing strategy to meet changing market and competitive conditions.\nRefocus or re prioritize, set strategy during budget deficiency or any other similar situation to meet revenue goal to cover expenses.\nDevelop and recommend product positioning and pricing strategy.\nDevelop pricing strategies, balancing firm objectives and customer satisfaction.\nFormulate, direct and coordinate marketing activities and policies to promote products and services.\nIdentify, develop, and evaluate marketing strategy, based on knowledge of establishment objectives, market characteristics, and cost and markup factors.\nConduct market survey studies and analyze their findings to introduce new products.\nIdentify avenues for commercialization.\nRepresent company at trade association meeting to promote products.\nCreate opportunities and increase market share.\nPlan and overseas advertising and promotional activities including print, online, social, electronic media and direct mail.\nEstablish and maintains a consistent corporate image throughout all product lines, promotional materials and events.\nBuild company image by collaborating with employees, customers, principals, vendors and Government agencies.\nDevelop pricing strategies, balancing firm objectives and customer satisfaction.\nFormulate, direct and coordinate marketing activities and policies to promote products and services.\nIdentify, develop, and evaluate marketing strategy, based on knowledge of establishment objectives, market characteristics, and cost and markup factors.\nConduct market survey studies and analyze their findings to introduce new products.\nIdentify avenues for commercialization.\nRepresent company at trade association meeting to promote products.\nCreate opportunities and increase market share.\nPlan and overseas advertising and promotional activities including print, online, social, electronic media and direct mail.\nEstablish and maintains a consistent corporate image throughout all product lines, promotional materials and events.\nBuild company image by collaborating with employees, customers, principals, vendors and Government agencies.\nCoordinate with all key department such as Sales, operations and Engineering for marketing activities, continue ensure a vigorous habitat in the company.\nSupport sales team for preparing value proposition, proposals and forecasting.\nOversight to create new tenders with guided specification.\nEnsure minimum penalty, bad depts. & write offs.\nEstablish and maintain relationship with industry influencers, key strategic partners, key clients and project team lead.\nIdentify new areas of business and create new accounts.\nManage to conduct survey for introduction of new products.Skills",
    "Skills": [
        "Bachelor’s Degree in Marketing\n7-8 years of experience in Marketing\nKnowledge of marketing principles, brand, product and service management, competitor analysis, pricing strategy, sales and business development; along with a demonstrated track record of success and performance\nLeadership Skills\nPresentation Skill\nProject Management Skills\nInfluencing Skills\nInterpersonal Skill"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Other Healthcare Services",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}