{
    "Job ID": "4756458",
    "Description": "Marketing and promoting the leasing and sale of vehicles to new and existing customers.\nWelcoming customers and guiding them in selecting the right vehicle for their needs.\nConducting test drives for potential customers and explaining vehicle features.\nPreparing and presenting price quotes and leasing/sales agreements.\nTracking and monitoring vehicle purchase and leasing orders and processing financial transactions.\nWorking to achieve monthly and annual sales goals.\nMaintaining accurate knowledge of available vehicle specifications and features.\nProviding exceptional customer service and efficiently handling complaints and inquiries.تسويق وترويج تأجير وبيع السيارات للعملاء الجدد والحاليين.\nاستقبال العملاء وتوجيههم لاختيار السيارة المناسبة لاحتياجاتهم.\nإجراء اختبارات القيادة للعملاء المحتملين وشرح ميزات السيارة.\nإعداد وتقديم عروض سعر واتفاقيات تأجير ومبيعات.\nمتابعة ومراقبة أوامر الشراء وتأجير السيارات وإجراء الدفعات المالية.\nالعمل على تحقيق أهداف المبيعات الشهرية والسنوية.\nالاحتفاظ بمعرفة دقيقة بمواصفات ومميزات السيارات المتاحة.\nتوفير خدمة عملاء استثنائية ومعالجة الشكاوى والاستفسارات بفعالية.Skills",
    "Skills": [
        "Previous experience in car sales or leasing.\nExcellent communication skills and the ability to persuade customers.\nDeep knowledge of vehicles and the automotive industry.\nNegotiation and deal-closing skills.\nAbility to work effectively in a high-pressure environment.\nStrong numerical skills and the ability to manage financial transactions.\nCommitment to high ethical and professional standards.\nProficiency in English",
        "خبرة سابقة في مبيعات السيارات أو تأجيرها.\nمهارات تواصل ممتازة وقدرة على إقناع العملاء.\nمعرفة عميقة بالسيارات وصناعة السيارات.\nمهارات التفاوض وإغلاق الصفقات.\nالقدرة على العمل بفعالية في بيئة عالية الضغط.\nمهارات حسابية قوية وقدرة على إدارة المعاملات المالية.\nالالتزام بأخلاقيات العمل والمهنية العالية.\nإجادة اللغة الإنجليزية ."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Ahmadi, Kuwait",
        "Company Industry": "Automotive Dealership & Distributor",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}