{
    "Job ID": "4756819",
    "Description": "Job KnowledgeThe incumbent is required to have a thorough, technical understanding of major building plumbing/mechanical systems and equipment, with a specialty in plumbing systems. Familiarization with general mechanical systems, including domestic hot and cold water piping systems, wastewater piping systems and vent stacks, storm water management systems, chilled water systems, water treatment facilities, swimming pool equipment, fire suppression systems, compressed air systems, and irrigation systems is required. Familiarization with the many different types of pipe and fittings (PVC and CPVC, copper, galvanized, concrete, black, etc.) is required. Must know how to diagnose the root cause of a problem and what materials and equipment will be needed to facilitate repairs. Must know how to work safely on equipment, systems and associated components including the use of lock-out / tag-out safety measure.  Knowledge of IBC standards, and fire and life safety codes is required.Skills and AbilitiesThe incumbent must be skilled at reading and interpreting technical documents including layout drawings, as-built drawings, riser diagrams, equipment schedules, operations and maintenance manuals, and other manufacturer’s literature. The incumbent shall have the skills and abilities in the following areas: diagnosing and repairing filtration systems, water pumps, hot and cold water systems; testing potable water system components, monitoring of chemical and salt injection systems, and taking equipment readings with various meters; use of hand tools, power tools, and specialty tools to determine appropriate repairs. Additional skills include installation and repair to the various types of plumbing pipe such as PVC and CPVC, copper, galvanized, concrete, and black pipe; distinguishing frequencies and sounds, color codes and odors in the operation of equipment in order to troubleshoot for repairs. Additional abilities include responding to emergency situations in an efficient and timely manner to effect immediate repairs; work in various adverse conditions such as tight or enclosed spaces, on ladders at various heights, and in temperature extremes, indoors or outdoors to complete work assignments; communicate orally and in writing with co-workers, contractors and vendors to obtain and provide pertinent information. Must be computer literate, able to navigate through the Microsoft Office Suite software including MS Word, Excel, Outlook, and Power Point; able to draft reports and create spreadsheets, and able to write e-mails and research information on the Internet. A valid driver’s license is required. Must have excellent interpersonal skills and be able to handle a large workload and multiple tasks. Must be organized.Required Documents:Please provide the required documentation listed below with your application:Residency Permit ( Saudi Iqama or National ID) ( Valid Iqama and attach a copy of your Absher showing the validity of the iqama)\n\nSecondary School certificate\n\nVocational Training Certificate\n\nValid driver's licenseJob Details",
    "Skills": [],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Public Administration; Facilities & Property Management",
        "Company Type": "Employer (Public Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}