{
    "Job ID": "4756934",
    "Description": "Greetings From Sofomation,We have opportunity for one of the leading oil & Gas industry in Middle East Positions: Scheduling Engineer\"Request you to spread this message in your network (friends or colleagues) who are suitable for similar job\"performing the development of baseline critical path schedules (Using ORACLE Primavera software version 15.2 or later) and progress measurement systems in order to plan, update, track, analyze and report WORK performance for all phases of the project. Complete resource loaded schedules in order to ensure standards of productivity are utilized in the schedule.Collect all timing data in order to plan and schedule the full scope of WORK.Work with Design Consultants and Engineering, Procurement and Construction Contractors in developing baseline critical path schedules and progress measurement systemsSkills",
    "Skills": [
        "least ten years’ Experience specifically performing the development of baseline critical path schedules (Using ORACLE Primavera software version 15.2 or later) and progress measurement systems in order to plan, update, track, analyze and report WORK performance for all phases of the project.",
        " Complete resource loaded schedules in order to ensure standards of productivity are utilized in the schedule.",
        "Collect all timing data in order to plan and schedule the full scope of WORK.",
        "Work with Design Consultants and Engineering, Procurement and Construction Contractors in developing baseline critical path schedules and progress measurement systems",
        "Qualification: Bachelor’s Degree in Engineering from a recognized and approved program.",
        "Experience : Minimum 12 Years of experience"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Khawr, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "1"
    }
}