{
    "Job ID": "4756993",
    "Description": "PRIMARY PURPOSE:To call on both existing and prospective buyers within a prescribed geographical area, and maximize sales of the Company's products within trading guidelines established by Sales Management.\nTo forecast business potential within his territory for short term and to report on market conditions and competitive activity within his territory.PRINCIPAL ACCOUNTABILITIES:Provide a forecast for his assigned key customer list / territory.\nAchieve target sales volume and turnover.\nAchieve cost-effective sales coverage of his territory.\nQuotation/Tender presentation and follow-up.\nMake professional client presentations that promote price-value advantage.\nSubmit accurate sales forecasts for his territory.\nResponsible for CRM reporting – opportunities, rental, used and projects’ updates.\nReport on all relevant competitive/market activities.\nMaintain a high level of product knowledge.\nAny other project/task assigned by the Franchise Sales ManagerSkills",
    "Skills": [
        "Educational Qualifications & Certifications:",
        "Degree in Engineering (Electrical/Mechanical) or Equivalent",
        "Knowledge:",
        "Customer requirements, territories, projects, competitors’ strengths and weaknesses.",
        "Technical Skills:",
        "Excellent Heavy Machinery product knowledge. Ability to understand the features and operation of technical products and effectively communicate.\nSoftware skills: PowerPoint, Excel for preparing and making professional presentations to customers.",
        "Language Skills:",
        "Fluency in both English and Arabic.\nGood communication skills, both written and verbal.",
        "Experience:",
        "Minimum 5 year's experience in Sales with Heavy Machinery Dealer."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}