{
    "Job ID": "4756487",
    "Description": "Position Overview: Hapido is looking for an enthusiastic and results-driven Business Development Manager to join our team. As a Business Development Executive, you will play a pivotal role in forging strategic partnerships, expanding our partner network, and driving growth for both Hapido and our partner businesses.Key Responsibilities:Identify and Cultivate Partnerships: Research, identify, and build relationships with potential partners that align with Hapido's mission and business objectives. Develop a deep understanding of partner needs and objectives.Negotiation and Deal Structuring: Lead negotiations to secure mutually beneficial partnerships, including showcasing partner deals on our platform, co-marketing initiatives, and revenue-sharing agreements. Ensure favorable terms for all parties involved.Data-Driven Insights: Utilize data and analytics to identify trends, market opportunities, and areas for optimization. Provide data-driven recommendations to enhance our business development strategies.Financial Management: Manage the business development budget effectively, allocating resources to maximize return on investment.Contract Management: Oversee the preparation and execution of partnership agreements and contracts, ensuring compliance with agreed-upon terms and obligations.Reporting and Analysis: Provide regular reports to senior management on the status of business development initiatives, including key performance indicators, revenue projections, and progress toward strategic goals.Competitor Analysis: Stay abreast of industry trends, market competition, and emerging technologies. Leverage this knowledge to identify opportunities and maintain a competitive edge in the discount and savings landscape.Team Collaboration: Collaborate closely with marketing, sales, and product development teams to ensure the seamless implementation of partnership initiatives.Skills",
    "Skills": [
        "Qualifications:",
        "Proven track record of at least 2+ years of successful business development or partnership management experience, preferably in the e-commerce or discount marketplace industry.\nStrong negotiation and communication skills.\nProficiency in data analysis tools and a data-driven mindset.\nExcellent organizational and project management skills.\nAbility to excel in a fast-paced, dynamic environment.\nExceptional networking and relationship-building skills.\nKnowledge of the discount and savings landscape is a plus.\nProficiency in relevant software and tools.\nDriving License is a must."
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}