{
    "Job ID": "4756544",
    "Description": "Key Responsibilities:Record and maintain financial transactions accurately using accounting software and Excel spreadsheets.\nPrepare and review financial statements, including income statements, balance sheets, and cash flow statements.\nReconcile bank statements and ensure that all financial transactions are properly documented.\nAnalyze financial data to identify trends, discrepancies, and opportunities for cost savings or revenue growth.\nAssist in the budgeting and forecasting process, providing valuable insights to support decision-making.\nProcess accounts payable and accounts receivable transactions, ensuring timely payments and collections.\nPerform month-end and year-end close procedures, including adjusting journal entries and account reconciliations.\nPrepare and file tax returns in compliance with local and national regulations.\nCollaborate with auditors during internal and external audits, providing necessary documentation and explanations.\nAssist in the development and implementation of financial policies and procedures to enhance efficiency and compliance..Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Bachelor's degree in Accounting, Finance, or a related field. A Certified Public Accountant (CPA) certification is a plus.\nStrong proficiency in Microsoft Excel, including advanced functions such as VLOOKUP, PivotTables, and formula creation.\nSolid understanding of accounting principles and financial reporting standards (GAAP/IFRS).\nExperience with accounting software (e.g., QuickBooks, Xero, SAP) and financial modeling tools.\nAttention to detail and a high level of accuracy in data entry and financial analysis.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal skills for collaborating with team members and presenting financial information to non-finance personnel.\nAbility to meet deadlines and work well under pressure.\nKnowledge of tax regulations and compliance requirements.\nEthical behavior and a commitment to confidentiality in handling financial data."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Nationality": "India",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}