{
    "Job ID": "4756604",
    "Description": "1. Overall management and supervision of all waste treatment and disposal activities.2. Ensure compliance of all treatment and disposal operations with regulatory requirements, permit conditions, operating procedures, site rules health and safety procedures, etc.3. Lead process optimization, improvement, and modifications.4. Prepare and develop department annual budget and track expenses to ensure full compliance within the approved plan.5. Assist S&M in waste management expertise technical support to clients and third parties.6. Lead and develop waste reuse, recycling, treatment, and disposal technologies for hazardous and non-hazardous industrial wastes.7. Develop and implement operating standards and procedures.8. Prepare technical proposals for waste management services and assist Sales and Marketing in the preparation of commercial proposals as appropriate.9. Provide periodical technical reports (on quarterly basis) or as required by top management.10. Provide guidance in achieving high systems performance, reliabilities, and units’ availabilities through proper operational practices.11. Overall management, evaluation and completion of all projects related to waste treatment and disposal activities within approved budget.12. Other tasks as directed by the Top Management.Skills",
    "Skills": [
        "·        Bachelor’s degree in chemical engineering, chemistry or science or equivalent.",
        "·        8-10 years of industrial experience with a minimum of 3-5 years supervisory experience in hazardous waste management, particularly in process operations management.",
        "·        Experienced in operational occupational health and safety management in the hazardous waste, petroleum, Petro-chemical or chemical industries.",
        "·        Excellent written and verbal communication skills.",
        "·        Troubleshooting Ability",
        "·        Familiar with SAP.",
        "·        Excellent in Microsoft"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}