{
    "Job ID": "4757400",
    "Description": "EVAGRO -Desert Reclamation & Animal Wealth Balanced Life Cycle One of EVA-Group Limitedis looking to hire a “Farm Manager” to join our team in sustainable agriculture and natural ecosystem that drives to produce high-quality goods to grow.We are Global G.A.P. accredited and export to many countries including Germany Switzerland, and Malaysia.Job Purpose:As our Farm Manager, you will play a pivotal role in overseeing all aspects of our farm operations.Responsibilities:✅ Managing day-to-day farm activities, including planting, irrigation, pest control, and harvesting.✅ Supervising a team of skilled farmers and guiding them to ensure productivity and efficiency.✅ Implementing sustainable farming techniques and promoting ecosystem farming practices.✅ Monitoring crop health, identifying diseases or pests, and implementing appropriate measures for prevention or control.✅ Selection, planning, and managing animal breeding programs.✅ Collaborating with sales and marketing teams to meet customer demands and ensure timely delivery of goods.✅ Managing farm budgets, expenses, and inventory to ensure optimal financial performance.✅Managing profitability and having a healthy Cash Conversion Cycle CCC.Skills",
    "Skills": [
        "Job Requirements:",
        "Bachelor's degree in agriculture or a related field.\n8 years of experience in the agricultural industry.\nProven experience as a Farm Manager or similar role within the agricultural industry.\nFamiliarity with ecosystem farming methods and sustainable agriculture.",
        "Both Egyptian and international calibers with solid experience in the Egyptian market are welcomed."
    ],
    "Preferred": {
        "Nationality": "Central Asia; Egypt; Jordan; South Africa"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}