{
    "Job ID": "4757401",
    "Description": "Responsibilities Overall, provide prompt updates to the Operations Manager to discuss the Coffee House & Boutique priorities and opportunities\nEnsure and be accountable for profitability of the Coffee House & Boutique by growing sales and controlling costs of goods, inventory levels, labor, supplies and expenses\nBrand knowledge and maintaining image of Bacha Coffee\nEnforce Coffee House & Boutique operating procedures\nEnsure proper staff coverage, scheduling according to the needs of the Company while maintaining target labor costs\nPromote safe work practices habits, identifying and resolving potential safety hazards, operational inconsistencies and in any staff or customer incidents. Documents accidents, conducts initial investigation and determination of root cause in the interest of maintaining a safe work environment \nResponsible for reporting to the management and authorities in case of store theft\nResponsible of ordering of stocks, inventory control, and ensure latest products and updated product catalogue are in the Coffee House & Boutique\nMaintain high cleanliness standards consistently throughout the store in the areas of store appearance, merchandise and equipment \nMaintain a clean well-merchandised Coffee House & Boutique, following visual presentation plans and standards\nProvide appropriate counseling and disciplinary action to staff who fail to meet the Company performance standards\nPrompt submissions of HR documentations; weekly and monthly roster, attendance sheet, punch cards, and medical certificates\nManage staff Annual Leave and Public Holiday and including related staffing issues\nProvide feedback of staff work performance, conduct staff probation evaluation and performance appraisals when appropriate\nEnsure all staff are meeting the Company grooming standards and monitor all standard of procedures are adhered on daily basis \nOversees all cash and media management functions. Able to perform all POS duties, front and back of house functions including opening and closing procedures, coordinating with the Corporate Office as necessary\nMaintains proper loss prevention standards, reviewing cash handling procedures, deposits and safe procedures\nOversee the ordering of stocks, inventory control, and ensure latest products are kept up to date within the Coffee House & BoutiqueSkills",
    "Skills": [
        "Strong leadership and customer management abilities.\nProficient in handling customer queries and leading teams.\nFirst preference to a Bachelor's holder in Business Administration from a reputed institute.\nDecent educational qualification with a knack for efficient management. (Minimum diploma holder preferred)"
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant; Retail & Wholesale; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}