{
    "Job ID": "4757301",
    "Description": "To provide technical support to the Case Managers and ensure that they work according to project guidelines and best practice principlesCore Responsibilities:Leads the preparation of comprehensive case studies, needs assessments of received cases, and provides recommendations; follows up on active issues and conducts periodic site- -re-investigations;\nSupervises case assignments, draft service plans, review cases progress and determine case closure;\nEnsures the fulfillment of the work plan in accordance with the general objectives of the programme and provides technical, administrative, and logistical support necessary for the implementation of the different activities of the programme;\nDevelops plans for quick crisis intervention, whenever needed;\nSupervises the Case Managers and fosters the development of team spirit; Strengthens ties with the main actors (not directly involved in the programme) in the psychosocial field in the region they are responsible for;\nWorks closely with the Project manager on implementing the Case Management approach in line with best practices, including providing feedback on the case management system and supporting programmatic development;\nDevelops case plans that respond to the needs addressed in initial and comprehensive assessments and seek the support of supervisor when necessary;\nRegularly follows up to ensure all services and action points listed in the case plan are carried out within agreed time frames, ensures that progress is regularly reviewed;\nProvides technical support and guidance, coaching and mentoring, and debriefing the Case Managers using a strengths-based approach;\nFormulates and implements skills development plans for the staff related to the Case Management approach and developed referral system;\nCultivates cohesive case management teams that have a focus on self-care both on an individual and a group level, that value cooperation, skill sharing, reflective practice, and mutual support;\nProvides periodic reporting on cases, and reports to the Project Manager concerning the project achievements, successes, challenges, and indicators as well as their progress;Managerial Responsibilities:Manages the team by evaluating the team members' performance, provides feedback on an on-going basis, identifies development needs, and coaches them to ensure on-going capability development.\nIdentifies training needs and organizes trainings for the department on various aspects on which the role holder has responsibilities.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's Degree in Psychology or any related field.\nStrong English and Arabic language skills (written and spoken).\n5 – 7  years of experience.\n Experience in case management.\nExperience in a supervisory role."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}