{
    "Job ID": "4757550",
    "Description": "We are looking to recruit an experienced and self-driven Sales Manager for a financial brokerage firm, offering FX and CFDs. The successful candidate should have a thorough understanding of the brokerage business along with a successful track record of building and managing the Sales team. The candidate is expected to source leads and introduce new clients to the company. They will manage their own portfolio of clients and develop business. If you believe you match our criteria for this role, we look forward to hearing from you for this Dubai based position. MAIN DUTIES AND RESPONSIBILITIESKeeping abreast of the industry, competition, its people and products with a solid understanding of the FX & CFD industry.\nMaximize existing revenue streams and build on existing relationships.\nLead generation and conversion by utilizing your extensive network of clients from partnerships, introducing brokers or affiliate channels to identify and engage prospective clients.\nClient acquisitions and retention by cultivating strong, lasting relationships with clients to ensure their ongoing success and satisfaction.\nFocus on business development and collaborate with internal teams to ensure seamless onboarding and exceptional client experiences.\nDrive new business growth by presenting our innovative solutions to potential clients and tailoring offerings to their needs.\nBuild out scope for expanding the sales team and acting as the hiring manager.\nMeet assigned annual sales quotas, both individual and team management.\nPerform other related duties as assigned by the Management. Skills",
    "Skills": [
        "4 - 5 years of experience in Sales position within a reputed brokerage firm in UAE.\nExcellent sales skills and strong knowledge of FX and CFDs market as well as MT4, MT5 or equivalent trading platform.\nThe ideal candidate would have an existing book of Introducing Brokers, Money Managers and customers/clients, preferably HNIs.\nA proven track record of achieving and surpassing sales targets and objectives.\nLeadership skills to manage and motivate a team to set the right example and culture.",
        "·      Sales driven, outgoing and ambitious professional with an ability to thrive in a challenging and collaborative sales environment that is fast paced.",
        "Highly customer focused with excellent negotiation and problem-solving skills.\nSelf-disciplined, self-motivated - requires minimum supervision, well organized with good follow-up skills.",
        "·      Fluency in English is a must."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 4 Max: 5"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}