{
    "Job ID": "4757545",
    "Description": "On behalf of the fastest-growing retail company across the Middle East, we are looking for an ambitious and results-oriented  Digital Visual Merchandising Manager. Option to be based in Riyadh or Kuwait.As a Digital Visual Merchandising Manager, you will play a crucial role in shaping our client's online presence and maximizing the visual appeal of our products and services. Your primary responsibility will be to create visually engaging digital displays, optimize user experiences, and enhance our online branding efforts. You will work closely with cross-functional teams, including marketing, design, and e-commerce, to drive sales, improve customer engagement, and promote brand consistency across digital platforms.Key ResponsibilitiesDigital Merchandising Strategy:Develop and execute a digital visual merchandising strategy to enhance the online shopping experience.\nCollaborate with the marketing team to align visual merchandising with promotional campaigns and product launches.\nAnalyze market trends and competitors to stay updated on best practices.Content Creation and Curation:Create visually appealing digital displays, including product images, banners, and videos, ensuring they align with brand guidelines.\nCurate and organize product collections, categories, and landing pages to maximize user engagement.\nOptimize visual content for various digital platforms and devices.User Experience Enhancement:Continuously monitor and improve the website's navigation and layout to enhance user experience.\nImplement A/B testing and user feedback to make data-driven improvements.\nEnsure all digital content is responsive and accessible.Collaboration and Cross-functional Support:Collaborate with design, marketing, and e-commerce teams to ensure consistent branding and messaging across all digital channels.\nWork closely with web developers to implement and test new features and functionalities.\nProvide training and guidance to team members and stakeholders on visual merchandising best practices. Performance Analysis:Track KPIs related to visual merchandising, such as conversion rates, bounce rates, and click-through rates.\nGenerate regular reports and insights to inform decision-making.\nRecommend and implement improvements based on data analysis.Skills",
    "Skills": [
        "Bachelor's degree in marketing, digital media, design, or a related field (Master's degree is a plus).\nAn ideal candidate will have experience managing the website of a Big Ecom Player\nProven experience in digital visual merchandising, e-commerce, or related roles.\nProficiency in graphic design software (e.g., Adobe Creative Suite).\nStrong understanding of user experience (UX) principles.\nKnowledge of web development and content management systems (CMS).\nAnalytical mindset with the ability to interpret data and make data-driven decisions.\nExcellent communication and project management skills.\nCreativity and a keen eye for visual design.\nAbility to adapt to a fast-paced and dynamic work environment.\nKnowledge of SEO and online advertising is a plus."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 15",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 43"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}