{
    "Job ID": "4757025",
    "Description": "Store General Manager - RiyadhOn behalf of the fastest-growing retail company across the Middle East, we are looking for an ambitious and results-oriented Store General Manager for their expanding Riyadh operations.Reporting to the Head of Sales you will ensure the store’s success by managing its operations, driving sales, and fostering a positive work environment in order to deliver excellent customer service and lead and develop a high-performing team.Responsible for the day-to-day operations of the store.\nEnsure smooth functioning by overseeing activities such as opening and closing procedures, cash management, inventory control, and compliance with company policies and procedures.\nFocus on driving sales and achieving revenue targets.\nMonitor sales performance, analyze trends, and implement strategies to improve sales and customer satisfaction...\nRecruit, hire, train, and manage the store staff.\nEstablish work schedules, assign tasks, and ensure adequate staffing levels.\nProvide ongoing coaching, mentorship, and performance feedback to develop a high-performing and motivated team.\nSets performance expectations and holds employees accountable for meeting sales goals, productivity targets, and customer service standards.\nConduct regular performance evaluations, address performance issues, and recognize and reward exceptional performance.\nEnsures a safe and secure store environment for employees and customers.\nEnforce safety protocols, monitor compliance with security procedures, and take appropriate action in case of emergencies or incidents.\nInvolved in identifying opportunities for store growth and expansion.\nProvide input on new store locations, assist in market research, and contribute to the development of expansion strategies.Skills",
    "Skills": [
        "Bachelor's or Master's Degree in Business Administration, Marketing, or a related discipline.\nRetail Management Certification is a plus.\n8-10 years of experience with retail management expertise.\nEffective and strong communication and managerial skills.\nIdeal candidate would have experience Managing a big store averaging from 15,000 to 20,000 SQM"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 7 Max: 15",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 29 Max: 42"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}