{
    "Job ID": "4757627",
    "Description": "Core Responsibilities:Conducts market assessment in the designated areas to identify the employment needs and criteria, and to gain a holistic understanding of the employment landscape, enabling us to better tailor our services and support to both job seekers and employers.\nEngages with employers in diverse sectors to establish, develop and maintain partnerships with a wide range of employers, including large corporations, medium and small businesses. This involves assessing the evolving job market trends, understanding employers' hiring needs, and negotiating agreements that benefit both job seekers and employers.\nImplements job-candidate assessments to ensure the most suitable matches between candidates and job opportunities. This requires a deep understanding of both candidate profiles and the specific requirements of various industries.\nOversees customized capacity-building programs tailored to each candidate's unique needs and the demands of the job market. These programs include technical and on-the-job skills training, off-the-job skills development, and industry-specific certifications, necessitating a deep knowledge of educational resources and training providers to ensure that candidates are equipped with the necessary skills and qualifications to succeed in the job market.\nActively seeks out employers committed to the terms of Jordanian Labor Law, decent work, diversity and promoting inclusive hiring practices to create employment opportunities that align with legal and ethical standards, foster diversity, and promote fair and inclusive employment practices, thereby enhancing job prospects for candidates.\nUtilizes data analytics and assessment tools to enhance the precision of candidate-employer matching, ensuring skills fit and long-term career potential are considered in placements.\nOversees the Implementation of mentorship programs and career counseling services to support beneficiaries in their professional growth.\nRegularly conducts follow-up with employers and beneficiaries to ensure their successful placement within a suitable work environment, while also assessing the beneficiaries' ongoing commitment to their employment.\nProduces statistical, analytical, and narrative reports, including reports on reporting requirements, project expiry dates as well as any other reports to update project manager.\nEvaluates the project activities, establishes, and implements mechanism to systematically assess the achievement of results.\nReviews and updates work plan throughout the program with the guidance and management support from the Project Manager to deliver best project implementation and outcomes.\nEnsures that the project staff are implementing the project activities in accordance with the terms and conditions prescribed and approved in the project document to meet to the project purpose.Skills",
    "Skills": [
        "5-7 years of experience \nBachelor degree in International Development, Business Administration, Education, or any related field\nStrong English and Arabic language skills (written and spoken)\nExperience working with community business partners and building partnerships with employers"
    ],
    "Preferred": {
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}