{
    "Job ID": "4757576",
    "Description": "Manage warehouse in compliance with company’s policies and procedures.\nOversee receiving, warehousing, and distribution operations.\nOversee daily operations, while controlling and managing inventory and logistics.\nEnsure efficient space utilization.\nMaintain documentation, activity log, and keep accurate records of warehouse activities.\nManage stock control, keep stock control systems up to date and make sure inventories are accurate.\nMaintain warehouse’s material stock levels and availability and report any deficiencies to operation manager.\nOversees warehouse physical / cycle count inventory (regularly, monthly and random) and resolve any deficiencies as per the records available.\nEnsure all orders are loaded within the scheduled shifts; Report all delays or variances in inbound/outbound shipments to the appropriate parties to take appropriate corrective actions.\nInspect all warehouse equipment and order repairs and replacements when required.\nOversee all warehouse employees, including creating schedules, providing coaching and mentoring, and issuing corrective action when required.\nComply and adhere to supervisor instructions.\nComply and respect of shift schedules.\nAdhere to Health and Safety policies and procedures always, ensuring the protection and safety of self, co-workers, and environment.\nFollow and enforce strict safety measures such as wearing heat-resistant gloves, protective masks, safety shoes, helmet, goggles, and earplugs.\nComply with company policies and procedures.Skills",
    "Skills": [
        "Proficient in MS Office and SAP software",
        "English professional"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Yanbu, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}