{
    "Job ID": "4757039",
    "Description": "On behalf of the fastest-growing retail company across the Middle East, we are looking for an ambitious and results-oriented Product Performance Manager. Option to be based in Saudi Arabia or Kuwait.To provide the business unit head with insightful, and thorough analysis on anchor performance on the category level, subcategory level, product lines level, and article-level on sales and gross profit and margin metrics.Develop, review, socialize and implement all performance and reward related policies, guidelines, and programs.\nUnderstand current and emerging market trends, identify potential opportunities / gaps, and leverage external best practices, yet provide flexibility and local customization to account for cultural and market differences.\nMonitor and evaluate the effectiveness of the reward initiatives and their related communications efforts by analyzing data and feedback and developing continuous improvement actions.\nManage the regular performance and reward management activities and processes.\nParticipate in vendor selection and management ensuring compliance with service level agreements and efficient administration and delivery of reward programs.\nLeverage marketing analytics along with customer insights to come up with unique ways of reaching new and existing customers.Skills",
    "Skills": [
        "Bachelor degree in finance, marketing, management, industrial engineering, MBA/Master degree is a plus\n8+ year’s experience in business management, with at least 3 years in a leadership role.\nEffective and strong communication and managerial skills.\nStrong analytical skills."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 6 Max: 15",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 27 Max: 42"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}