{
    "Job ID": "4757437",
    "Description": "EVAGRO -Desert Reclamation & Animal Wealth Balanced Life Cycle One of EVA-Group Limited is looking to hire a “Quality Assurance and Control Manager” to join our team in sustainable agriculture and natural ecosystem that drives to produce high-quality goods to grow.We are Global G.A.P. accredited and export to many countries including Germany Switzerland, and Malaysia.Job Purpose:Develop and implement quality control procedures and policies that ensure all EVAGRO farm products meet the required food safety, legality, quality standards, and customer satisfaction. Responsibilities:Ensures that Food safety and quality are implemented and maintained through conducting regular internal audits about the above-mentioned standards.\nDevelops, implements, and maintains Quality and food safety and social standards required for customers such as GLOBAL GAP, GRASP, BRCGS, and SEMETA/SEDEX.\nTrains employees on quality control procedures and policies, including proper handling and storage of products but not limited to Global GAP and GRASP, GMP, GHP, Allergen management, FSMS policies, internal audits, HACCP, and CCP monitoring.\nManages and oversees the quality control and assurance processes and implements quality control policies and procedures for the farm and Packhouse to ensure compliance with regulatory requirements.Skills",
    "Skills": [
        "Job Requirements:",
        "-Bachelor’s degree in Agriculture or related field.\n-Not less than 10 years’ Experience.\n-Proven experience as a Quality Manager or similar role within the agricultural industry\n-Strong knowledge of Fresh vegetable and fruit farming practices\n-Familiarity with quality control procedures and standards in the agricultural industry",
        " ",
        "Location: Cairo Alexandria Desert Road, Egypt"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}