{
    "Job ID": "4757595",
    "Description": "Our esteemed client is actively seeking a highly qualified and motivated General Manager to lead their flourishing Coffee BusinessJob Purpose:The main purpose for General Manager role is to provide overall leadership and strategic direction to the organization, ensuring its success, growth, and profitability. The General Manager is responsible for overseeing all aspects of the business, including operations, finance, sales, marketing, and human resources. By effectively managing resources, fostering a positive work culture, and making sound business decisions, the General Manager drives the achievement of organizational goals and objectives. The role encompasses building strong relationships with stakeholders, identifying new business opportunities, and ensuring compliance with legal and ethical standards. The General Manager plays a crucial role in setting the organization's direction, inspiring and motivating employees, and driving continuous improvement to ensure long-term success in a competitive marketplace.Primary Duties and Responsibilities:Includes but not limited to the following:Developing and implementing the company's strategic goals and objectives. This involves setting the direction for the organization, identifying opportunities for growth, and making decisions that align with the overall vision.\nProviding strong leadership and guidance to all employees, ensuring that they understand their roles and responsibilities, and fostering a positive and productive work environment. This includes hiring, training, and evaluating employees, as well as promoting teamwork and collaboration.\nOverseeing the financial aspects of the organization, including budgeting, financial planning, and performance monitoring. This involves analyzing financial data, identifying areas for improvement, and making sound financial decisions to drive profitability and sustainability.\nManaging the day-to-day operations of the business, ensuring that processes and procedures are efficient and effective. This includes optimizing workflow, managing resources, and implementing systems to improve productivity and quality.\nIdentifying new business opportunities, forging strategic partnerships, and expanding the company's customer base within local market in Kuwait and GCC region. This involves conducting market research, analyzing industry trends, in-house food production, retail market presents, and developing marketing and sales strategies to drive growth.\nAssessing and mitigating risks that could impact the organization's success. This includes identifying potential risks, developing contingency plans, and implementing policies and procedures to minimize exposure to risks such as legal, operational, and financial risks.\nBuilding and maintaining strong relationships with key stakeholders, including customers, suppliers, investors, and regulatory agencies. This involves effective communication, negotiation, and problem-solving to ensure positive interactions and mutually beneficial outcomes.\nMonitoring key performance indicators (KPIs) and tracking progress towards goals. This includes generating reports, analyzing data, and providing regular updates to senior management and other stakeholders.\nEnsuring that the organization operates in compliance with relevant laws, regulations, and ethical standards. This includes establishing and enforcing policies and procedures, promoting a culture of integrity, and addressing any compliance issues that may arise.\nIdentifying opportunities for process improvement and implementing strategies to enhance operational efficiency and effectiveness. This involves staying abreast of industry trends and best practices, seeking feedback from employees and customers, and fostering a culture of innovation.Skills",
    "Skills": [
        "Bachelor's degree in business administration, management, or a related field (MBA preferred).\nProven experience as a General Manager or in a similar leadership role.\nStrong business acumen with a demonstrated ability to develop and execute strategic plans.\nExcellent leadership and interpersonal skills, with the ability to motivate and inspire a diverse workforce.\nExceptional decision-making and problem-solving abilities.\nStrong financial management skills, including budgeting, forecasting, and financial analysis.\nExcellent communication skills, both verbal and written, with the ability to engage and influence stakeholders at all levels.\nStrong understanding of industry trends, market dynamics, and competitive landscape.\nAbility to prioritize and manage multiple projects simultaneously.\nHigh level of integrity and ethical conduct."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}