{
    "Job ID": "4757423",
    "Description": "e need a proffesional , well experienced Project Manager with information Technolgy experience for travel industry projects.Your Major ResponsibilitiesAllocates and manages project team and ensures the team has required resources to achieve project plan, is satisfied, and is motivated to work.\nManage Travel booking projects like Eomrah.com, Travelinksa.com.\nMake plan to uplift the company all over the world\nManage marketing team , development team , sales team\nMake plans for company growth\nPlans and manages project's budget, resources, risk, and schedule according to agreed-upon scope\nBuilds communication plan and regularly communicates with the customer and internal project team to achieve project plan, facilitate agility, ensure alignment, and achieve project plan\nEnsures proper and regular reporting of project status to internal and external stakeholders\nReviews and approves the financial proposal, technical proposal, and project sizing before sale to clarify ambiguities\nEnsures that project teams comply/align with established QA standards and processes and overall deliverables’ quality\nParticipates actively in knowledge sharing activities like communities of practice, forums, conferences and/or other knowledge exchanges\nKeeping up to date with all our approved systems and technology – from LAN to POS\nMaintaining hardware and software performance, digital and physical security standards and evaluating vendor proposals\nPassing on your expertise to the hotel team by running knowledge sharing and training sessions\nSafeguarding our IT infrastructure against cyberthreatsYour QualificationsMinimum of 6-8 years of experience in IT project management, with a proven track record of successfully managing IT projects of various sizes and complexities.\nExperience in travel industry is plus point.\nTechnician, understanding of tourism, hotel and aviation\nProven experience working on Software Development Projects\nStrong knowledge of project management methodologies, tools, and techniques.\nExcellent communication, leadership, and team management skills.\nExperience in managing project budgets and financial reporting.\nStrong problem-solving skills and ability to think creatively.\nAbility to work independently and manage multiple projects simultaneously.\nBachelor's or Master's degree/Diploma in Computer Science, Information Technology or a related field.\nKnowledge of the IT project lifecycle and software development lifecycle (SDLC).\nWorking knowledge of networks, operating systems, and databases\nStrong analytical and problem-solving skills\nKnowledge in PCI DSS (Payment Card Industry Data Security Standards)Skills",
    "Skills": [
        "Minimum of 6-8 years of experience in IT project management, with a proven track record of successfully managing IT projects of various sizes and complexities.",
        "Experience in travel industry is plus point.",
        "Technician, understanding of tourism, hotel and aviation"
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 5"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Tourism, Museum, & Cultural; Hospitality & Accomodation; Travel Agency",
        "Company Type": "Unspecified",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}