{
    "Job ID": "4757767",
    "Description": "Job Summary:The Senior Demand Planning Officer is part of Demand Planning team whose responsibilities are to ensure right stock is available for every item throughout the year. This role reports into the Demand Planning Manager and the department reports to Head of the Business.The key processes that this role would need to drive are finalizing forecast, calculation of order quantities to be placed with suppliers, purchase order creation & processing, local promotion order processing, supplier debit note preparation, municipality health clearance process, KPI reporting, periodic reports etc.*This role will coordinate between Supplier, Sales Divisions, Warehouse, Freight Forwarding, Accounts & Finance teams.Job Responsibilities:Play a critical role in finalizing sales forecast considering all critical inputs from sales, promotions, seasonality, special causes etc.\nCalculate the order quantity for periodic purchase orders to be placed with suppliers\nProcess order in SAP by creating inbounds & shipment costs\nEnsure that items ordered are delivered on-time by coordinating with Suppliers, Freight forwarding team, Warehouse team\nMake sure that Article Master data is accurate & complete\nCreate & process Local promotion order in SAP accurately & on-time\nPrepare supplier debit notes & recovery of spend from suppliers on time & accurately with all relevant information\nCoordinate with Freight forwarding company & Baladiya in case of health clearance of items\nKPI Monitoring & Analysis for key supply chain indicators\nPrepare monthly reports to be shared with suppliers, sales team etc.\nWork closely with Accounts team to ensure month end closing activities are completed accurately & on-time\nAd-hoc analysisSkills",
    "Skills": [
        "Skills:",
        "Strong in mathematics and comfortable with numbers\nHigh level of proficiency in Excel – Pivot tables & formulae, excels template creation, formula evaluation, debugging excel formulas etc.\nPreferred prior experience of 2-3 years in Supply Chain & related areas\nPrior experience in SAP / ERP tools and Reporting tools like Business Objects / Business Intelligence is a must\nStrong personality with skills to challenge and logically reason out with facts\nProactive & Good follow up skills\nTakes responsibility for completion within deadlines & ready to work hard\nGood team working & interaction skills\nAttention for detail\nFast learner\nGood at Multi-tasking\nAbility to handle tough internal customers\nAbility to handle pressure"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 2 Max: 4",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}