{
    "Job ID": "4757675",
    "Description": "Responsible for assisting the Sales & marketing manager in providing professional & outstanding customer service and branding to Jordan River Designs including Handicrafts and Karma Kitchen.Implement the set marketing strategies to improve JRF’s market position and achieve financial growth, build key customer relationships.Core Responsibilities:SalesAssists in the implementation of a sales and marketing plan according to the detailed action plan.\n Coordinate all sales activities to increase sales achieve the needed targets and increase the promotion of JRF products.\n Assists customers by selling products and meeting customer needs to achieve the needed targets\n Supply management with reports on customer needs, problems, interests & competitive activities for new products and services to be updated.\n Provides Scheduled sales reports, such as daily call reports, weekly work plans, and monthly and annual sales analyses to ensure work is going according to the plan\n Reach out to customer & corporate leads to ensure future sales.\n Maintain positive business relationships to ensure future sales\n Prepare reports to ensure that there is enough stock of the products at the warehouses.\nAttends national trade and exhibitions to showcase JRF’s products and services when requested.\nAssist in events and annual launches to ensure proper event coordination.\nAchieve agreed-upon sales targets and outcomes to ensure work is going according to the plan.\n Coordinate sales efforts with team members and other departments to ensure proper communication.\nContinuously improve through management & customer feedback to ensure providing the best service.Showroom: Increase sales performance in order to achieve high sales to JRF designs.\n Maintain a clean display of products to increase sales and achieve the needed targets.\n Continuously updating inventory and maintaining enough stock.Client ManagementUnderstand customer needs and provide support and solutions to increase sales and achieve the needed targets.\n Develops and maintains strong relationships with clients, and contacts new or existing customers to discuss how specific products can meet their needs.Skills",
    "Skills": [
        "Qualification:",
        "Bachelor’s degree in Marketing, Business Administration or any other related field (Preferred).\nExcellent English and Arabic language skills (written and spoken).\n3-5 years of experience in a similar role preferably in retail or FMCG industry.\nHands-on sales, and CRM experience. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "FMCG; Marketing; Personal Care Centers",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}