{
    "Job ID": "4757696",
    "Description": "1. Collaborate with product managers, developers, and other stakeholders to create user-centric designs for web and mobile applications.2. Conduct user research, including user interviews, surveys, and usability testing, to gather insights and inform design decisions.3. Create wireframes, prototypes, and interactive mockups to visualize design concepts and validate usability.4. Define and maintain the information architecture of digital products to ensure logical and efficient navigation.5. Develop visually appealing and consistent design elements, including icons, color schemes, typography, and graphics.6. Ensure that designs are responsive and accessible across various devices and platforms.7. Conduct usability tests and gather feedback to iterate and improve designs based on user insights.8. Prepare design specifications, style guides, and design documentation for development teams.9. Collaborate effectively with cross-functional teams, including developers, product managers, and marketers, to ensure design alignment with business goals.10. Stay up-to-date with industry trends, design tools, and emerging technologies to continuously improve design processes and skills.Skills",
    "Skills": [
        "- Minimum of 2 years of professional experience in UI/UX design.",
        "- Proficiency in industry-standard design tools such as Adobe Creative Suite, Sketch, Figma, or similar.",
        "- Strong understanding of user-centered design principles and best practices.",
        "- Experience with user research methods and usability testing.",
        "- Knowledge of responsive and mobile-first design principles.",
        "- Ability to create wireframes, prototypes, and interactive mockups.",
        "- Strong communication and collaboration skills.",
        "- Attention to detail and a passion for creating exceptional user experiences."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}