{
    "Job ID": "4757578",
    "Description": "‘The World’s Most Luxurious Hotel’ in Dubai is seeking an Arabic speaking Concierge Team Leader to assist with the opening of the new property in January.  What you will be doing: Directly supervising and assisting in ensuring the smooth and efficient operation and co-ordination of the Concierge Department covering the Concierge desk \nProviding a highly personalised service ensuring maximum guest satisfaction and adhering to the hotels standards\nDeveloping and maintaining positive working relationships with others and supporting the team to reach common goals \n48 hour week – 6 days Your experience and skills include: A professional appearance, focused on client satisfaction \nDelivering excellent results as a team player with attention to detail \nProviding excellent customer service \nReliable, honest, and sincere showing high levels of energy \nWritten and spoken English (fluent), Arabic a desired additionBenefits: On-site, state of the art accommodation featuring amazing facilities: swimming pool, gym, football pitch etc \nAll meals provided 24/7 \nMonthly pay & service charge \nFlights \nWork visa \nCost of one return flight to your home country annually \nMedical insurance/cover\nNo income tax, you keep 100% of your salary \nIncredible lifestyle in a beautiful growing city, away from the cost of the living crisis, hot weather and no transport issues (London)\nRight to Work in the UK not needed, visas for most countries are easily accessedWhy work with us? As one of the world’s leading hotel brands, you can be assured that excellence is at the centre of all that we do. We aim to bring diversity and enjoyment back to the workplace, with unlimited training and progression opportunities – this could be the start of an exciting new journey. Imagine having no monthly overheads: no electricity, heating, grocery or gym membership fees – this is an all-inclusive employment scheme which allows its employees to live to a very high standard. If this sounds like you, please apply today with your CV!Skills",
    "Skills": [
        "Arabic speaking\nEnglish speaking\nPrevious experience in a concierge role"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}