{
    "Job ID": "4757483",
    "Description": "As a waiter, you will be responsible for providing exceptional customer service by warmly welcoming guests, taking accurate orders, and ensuring a smooth dining experience from start to finish.\nSkillfully coordinating with kitchen staff, you'll ensure timely dish preparation and present these selections to tables while maintaining high standards of visual appeal.\nEmbracing the position of waiter, your tasks will encompass greeting and assisting patrons, taking precise meal requests, and orchestrating a seamless dining journey.\nResponding to patron questions and distinct preferences, you'll showcase your comprehensive menu expertise by offering knowledgeable suggestions as part of your service.\nOperating with unwavering dedication to hygiene and safety norms, you'll exhibit meticulous care in managing food and beverage items, accurately handling payments, and securing the overall happiness of all guests.\nEngaging wholeheartedly in team efforts, you'll readily offer support to your fellow staff members as situations arise, fostering a united and harmonious work culture.Skills",
    "Skills": [
        "Adaptability: Able to thrive in fast-paced and high-pressure environments, quickly adjusting to changing circumstances, and effectively multitasking to fulfill the needs of multiple tables simultaneously.\nWell-informed about the restaurant's menu offerings, capable of providing comprehensive dish descriptions, suggesting ideal pairings, and catering to specific dietary needs.\nDemonstrates exceptional order management skills, ensuring precise communication of guest preferences to the kitchen and overseeing the timely delivery of meals.\nExhibits a deep understanding of the menu, skillfully describing dishes, proposing suitable combinations, and readily adapting to meet guests' unique dietary preferences.\nWell-practiced in delivering outstanding customer service by connecting with guests, understanding their preferences, and ensuring their time at the restaurant is enjoyable."
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Nationality": "Philippines",
        "Age": "Min: 20 Max: 28"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "2"
    }
}