{
    "Job ID": "4757693",
    "Description": "Responsible for helping individuals, families, and groups of people to cope with problems they’re facing to improve their lives. One aspect of this is teaching skills and developing mechanisms for beneficiaries to rely on to improve their lives and experiences.Core Responsibilities: Contributes to the development of the policies, procedures, and processes of the Center and the functioning of the Center in accordance with the policies and procedures adopted by the Foundation and the Center and also assists to prepare the necessary evidence to ensure the quality of work performance in line with the best practice standards\n Implements awareness programs and trainings for the target groups to provide them with guidance to improve their lives.\n Conducts needs assessment in the target communities to identify their needs.\nDevelops mechanisms and plans for communication with communities, especially men to ensure proper communication and outreach\nFormats supporting committees and motivation to provide beneficiaries with all the support they need to solve their problems and improve tier lives.\n Contributes to the expansion plan in the formation of community centers and twinning with associations to Emotionally empowering, supporting, and improving the wellbeing of the communities\nWorks closely with partners, the community and local stakeholders to mobilize resources, coordinate activities to ensure effective participation of beneficiaries, local authorities and stakeholders\nCoordinates with local communities on a daily basis to ensure effective participation of partners in a timely manner\nHolds meetings with the community, develop action plans, work with elected civic groups, and work in each community to ensure broad participation and transparency of operations\nWorks closely with local partner NGOs to ensure necessary technical assistance and guidance to the beneficiaries.\nSupervises the implementation of volunteer activities in the safe areas allocated to children to ensure it fulfills the center’s objectives.\n Participates in the training of volunteers and trainees on the training programs that will be implemented with children, youth or parents to Emotionally empowering, supporting, and improving the well-being of marginalized Jordanian women and children and refugees in host communities.\nContributes to the implementation of monitoring and evaluation of programs implemented with the target groups.to assess the programs and solve any issues that might occur.\n Maintains the confidentiality of the accessed information to protect the beneficiaries from any privacy violation. \nPrepares monthly and annual reports and submits them to the direct manager to update and document the implementation of the prevention activities.\nKeeps all documents, records, files, and reports updated continuously to easily retrieve any date of them.Skills",
    "Skills": [
        "Qualification:",
        "Bachelor's degree in Social Work or any related field.\nStrong English and Arabic language skills (written and spoken).\n0-2 years of experience.\nExperience in Community motivation and training."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Administration Support Services; Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}