{
    "Job ID": "4757457",
    "Description": "1. Lead and manage a team of electrical technicians, providing guidance, training, and support to ensure the efficient and safe operation of refrigeration and electrical systems.\n2. Oversee the installation, maintenance, and repair of all refrigeration and electrical equipment within the manufacturing plant, ensuring compliance with industry standards and regulations.\n3. Develop and implement preventive maintenance programs to minimize downtime and maximize equipment lifespan, optimizing overall plant efficiency.\n4. Collaborate with cross-functional teams to identify and address potential issues related to refrigeration and electrical systems that may impact production and product quality.\n5. Utilize data and analytics to monitor system performance, identify trends, and implement continuous improvement initiatives to enhance energy efficiency and reduce operational costs.\n6. Stay updated with emerging technologies and industry best practices in refrigeration and electrical engineering, recommending and implementing innovative solutions to improve processes and systems.\n7. Manage the budget for the refrigeration and electrical engineering department, ensuring cost-effective procurement of materials, tools, and services.\n8. Prepare regular reports on equipment performance, maintenance activities, and departmental KPIs for presentation to senior managementSkills",
    "Skills": [
        "1. Bachelor's degree in Mechanical Engineering, Electrical Engineering, or a related field. Master's degree is a plus. 2. Professional engineering certification (PE) is preferred.",
        "3. Proven experience (10-15+ years) in a managerial role overseeing refrigeration and electrical systems, ideally within the food manufacturing industry.",
        "4. Strong knowledge of refrigeration systems, electrical systems, control systems, and automation.",
        "5. Familiarity with relevant industry codes, standards, and regulations.",
        "6. Excellent leadership and team management skills.",
        "7. Problem-solving and analytical abilities, with a focus on continuous improvement.",
        "8. Effective communication skills to interact with cross-functional teams and present technical information to non-technical stakeholders.",
        "9. Proficiency in computer-aided design (CAD) software and maintenance management systems.",
        "10. Demonstrated commitment to safety protocols and practices.",
        "11. Willingness to take on full ownership of all repairs and maintenance jobs and team, and ability to be able to work as needed including off peak hours and night shifts.",
        "12. \"Proficiency and expertise in Freon gas technology is a must, whilst familiarity with ammonia refrigeration will be an added advantage. "
    ],
    "Preferred": {
        "Years of Experience": "Min: 10 Max: 15",
        "Gender": "Male",
        "Age": "Min: 30 Max: 45"
    },
    "Data": {
        "Job Location": "Nairobi, Kenya",
        "Company Industry": "Industrial Production",
        "Company Type": "Recruitment Agency",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}