{
    "Job ID": "4757306",
    "Description": "To provide ongoing case management requirements, including receiving clients at the office, documentation, and data entry/modification, and serve as the first point of contact for cases and possibly refer cases to Psychosocial Counselors, depending on individual needs.Core Responsibilities:Prepares comprehensive case studies, needs assessments of received cases and makes appropriate recommendations; follows up on active issues and conducts periodic site- re-investigations; to ensure providing ongoing case management requirements.\nProvides ongoing case management requirements, including receiving clients at the office, documentation, and data entry/modification; to ensure providing the service according to the programme plan.\nParticipates, as requested, in workshops, intended to improve professional knowledge and skills relevant to his/her field of work and transmits such acquired knowledge to other social workers;\nConducts individual/family interviews to recommend interventions based on a designed specific intervention plan and to address the needs of families; Identifies shortcomings and assists with necessary remedies;\nMonitors and supports prevention, treatment and reintegration, according to programme plan and schedule;\nSupports the Psychosocial Counsellors in technical and administrative matters relating to the different activities of the programme; to facilitate the services provided.\nFacilitates the work of the counsellors by carrying out awareness activities on the psychosocial needs of children and their families; to increase awareness\nMaintains a professional and approachable attitude towards patients, respecting their confidentiality; to ensure the application of the Code of Ethics.\nServes as the first point of contact for patients and possibly refers patients to Psychosocial Counsellors, depending on individual need; to ensure providing the patients the right service.\nMaintains a database of counselled patients, and manages reporting as requested by the Supervisor; to ensure that there is a reference for cases.\nParticipates in the development and distribution of awareness-raising materials related to mental health, psychosocial well-being, and optimum development of children and adolescents; to ensure receiving sufficient and correct information about the services provided.\nWorks with supervisor to arrange case meetings for complex cases and ensure cases receive multidisciplinary support.\nManages cases in line with existing procedures, adheres to standard documentation processes and follows best practice guidance.\nEnsure that data collection and storage respect data protection protocols and confidentiality principles.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's Degree in Psychology or any related field.\nGood English and Arabic language skills (written and spoken).\n3-5 years.\nExperience in case management."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}