{
    "Job ID": "4757750",
    "Description": "Executive Secretary\" is Needed at Import and Export Company Located in Maadi, Cairo. Responsibilities: Handle the daily work that is related to the function:\nHandling phone calls, receptions and meetings arrangements.\nHandling incoming & outgoing mail.\nArchiving documents and records in order to be easy to be recalled.\nProvide comprehensive support to facilitate the execution of the function meetings through:\nPreparation of meeting’s agenda.\nCoordination with attendees through sending meeting invitations & answer all inquiries (if any).\nFollow-up on the execution of the meetings.\nPreparation of meeting minutes and acquiring the attendees’ approval.\nSecretarial support for meetings as and when required by the direct manager including communicating meetings reminders, distributing minutes and action plans to all member’s post meeting.\nProvide administrative support to ensure that operations are maintained in an effective, up to date and accurate manner.\nGreet visitors and provide the needed support regarding their requests.\nConduct or help with new employees’ orientation and set-up.\nLiaise with colleagues and external contacts to book travel and accommodation inside and outside the country in terms of booking hotels, transportation as well as any financial and administrative arrangements in coordination with General Admin function.\nConduct regular reports to direct manager on interval basis.\nMonitor all the supplies, stationery and supervising the work of the office boys and the drivers.\nSupport in organizing and maintaining office filing system.\nHandle the translation process from and into the local language in some of the materials produced by the company bodies, either directly or in cooperation with the external translation-service providers.\nResearch information, compile data, and prepare reports as needed.\nAnd any other assigned Tasks. Requirements:· BSc / BA degree is preferred.· Maadi resident is preferred.· 3-5 Years of Professional Work Experience.· Good English.· Very good Computer skills.· Time management.· Good communication skills. We are offered:· Attractive Salary.· Shift 9 hours includes break. Skills",
    "Skills": [
        "Prior work exposure in the capacity of a Tax Accountant working on relevant projects.\nAdept Tax Accountant having a thorough knowledge of accounting activities and related duties.\nA disciplined individual with a keen eye for solving practical challenges within the constraints of prescribed time limits.\nFundamental understanding of the functions and utility of software like Tally and other ERP solutions.\nA talented individual with a graduate degree in Finance or any other relevant domain."
    ],
    "Preferred": {
        "Gender": "Female",
        "Age": "Min: 20 Max: 35"
    },
    "Data": {
        "Job Location": "Maadi, Cairo , Egypt",
        "Company Industry": "Construction & Building; Manufacturing; Distribution, Supply Chain & Logistics",
        "Company Type": "Unspecified",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}