{
    "Job ID": "4757604",
    "Description": "Key AccountabilitiesMonitor alerts for various sub-systems and react by raising incidents in the ticketing system.\nPerform priority incident impact assessments, assess active or potential business impacts, set appropriate priority and escalate when needed\nAssist with assembling incident resolution teams, drive incidents to closure, take charge of resolution activities.\nPerform priority incident impact assessments, assess active or potential business impacts, set appropriate priority and escalate when needed.\nDrive root cause analysis.\nProvide timely, clear incident status communications to IT and business leadership, resolution team members and other stakeholders.\nParticipate in the ongoing Incident Management process improvements.\nCollect and record all required incident details for input into Problem Management's root cause analysis process, management reporting metrics and follow-up major incident reviews.\nUtilize ITIL knowledge to review incidents during audits to ensure Incident Management process is being adhered to.\nDrive problem analysis to conclusion to determine root cause for any Severity 1 or High Impact incidents as well as for any recurring incidents.\nProvide timely, clear incident status communications to IT and business leadership, resolution team members and other stakeholders.\nPerform Regular NOC System Testing to ensure that systematic issues are identified and escalated for quick resolution.\nCoordinate with G4S and NCR for CBQ’s ATM related activities.\nParticipate in the ongoing Event Management process improvements.Skills",
    "Skills": [
        "Experience and Competencies",
        "3+ years’ experience providing direct support to IT business application and related infrastructure teams in a complex multi-platform operating environment preferred\n1+ years Incident Management experience required\n1+ years’ experience with ITIL Service Management concepts required\nExperience in crafting clear and concise incident status updates suitable for an executive level IT and business leadership audience required\nExperience in Service Management ITSM – Event & Incident required",
        "Competencies",
        "Adaptability/Flexibility\nCreativity/Innovation\nDecision Making/Judgment\nDependability\nInitiative\nIntegrity/Ethics\nProblem Solving/Analysis",
        "Education",
        "Bachelor degree or equivalent"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3"
    },
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Banking",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}