{
    "Job ID": "4757054",
    "Description": "On behalf of the fastest-growing retail company across the Middle East, we are looking for an ambitious and results-oriented Software Development Manager. Option to be based in Saudi Arabia or Kuwait.To lead and manage a team of software developers to ensure the successful delivery of software projects on time, within budget, and to the required quality standard within the organization's adopted policies and procedures.Creating and Implementing project plans, allocating tasks to team members, and managing project resources as needed.\nManaging software development projects from conception to deployment ensuring that the product meets the required quality standards.\nLeading and managing a team of software developers, providing technical guidance and support as needed.\nHire, train, and mentor software developers, helping team member develop their technical skills and providing the resources they need to be successful.\nWork closely with product managers, designers, and quality assurance personnel to ensure that software products are delivered successfully.\nDeveloping and maintaining software development processes and procedures, ensuring that they are followed by the team, and identifying opportunities for process development.\nIdentify and mitigate risk associated with software development projects.Skills",
    "Skills": [
        "7 to 8 years of experience in Software Development function, with at least 4 years of experience in a Managerial position.\nA Bachelor’s Degree in Computer Science/ Computer Engineering or equivalent is required.\nIdeal Candidate would be Tech Savy.\nExposure to developing a successful Software or an App.\nMust have top tech firm experience."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 8 Max: 18",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 32 Max: 43"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}