{
    "Job ID": "4757373",
    "Description": "Provides confidential administrative support to includes screening and handling telephone communications, greeting and directing visitors, and dealing with administrative problems and inquiries as appropriate.\nServes as a primary point of direct administrative contact and liaison with other offices, individuals, and external entities and agencies on a range of specified issues; organizes and facilitates meetings, conferences, and other special events, as required.\nGathers, enters, and/or updates data to maintain departmental records and databases, as appropriate; establishes and maintains files and records for the office.\nMonitors and coordinates accounting activities as appropriate and prepares internal reports for management.\nAssists with project development and planning to ensure more efficient service and organization of the office.\nComposes and prepares written documentation and correspondence for the office; screens and evaluates incoming and outgoing correspondence and prepares responses as appropriate.\nAssists in the coordination, supervision, and completion of special projects as appropriate.\nCoordinates and oversees the day-to-day management of supplies, equipment, and facilities for the organization, as appropriate, to include maintenance, inventory management, logistics, security, and related activities.\nMay supervise personnel which may include recommendations for hiring, performance evaluation, training, work allocation, and problem resolution.\nEnhances professional growth and development through participation in programs, current literature, in-service meetings, and workshops.\nPerforms miscellaneous job-related duties as assigned.\nWork with accounting departments to process invoices, make payments, and track receipts.Skills",
    "Skills": [
        "-knowledge of accounting software Zoho",
        "-knowledge of Microsoft office",
        "-fluent in written and spoken English",
        "-Communication",
        "-Customer Service",
        "-Organization",
        "-Problem solving",
        "-Interpersonal communication",
        "-Attention to detail",
        "-Multitasking",
        "-Time management",
        "-Typing",
        "-Customer service skills",
        "-Active listening",
        "-Time management",
        "-Patience",
        "-Decision-making skills",
        "-Prioritizing",
        "-Empathy",
        "-Emotional intelligence",
        "-Listening",
        "-Reliability",
        "-Working under pressure",
        "-Social skills"
    ],
    "Preferred": {
        "Residence Location": "Dubai, United Arab Emirates",
        "Gender": "Female",
        "Age": "Min: 25 Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}