{
    "Job ID": "4757645",
    "Description": "BD Origination Manager - KSAGroup is a global reference in low-carbon energy and services.Purpose of the Job•  Identify and develop the company business within KSA.Reporting•  The BD Origination Manager will report to the Head of BD AMEA with a matrix to the Country Manager – KSA.Key Accountabilities:Identify, qualify, and secure prospects as per company strategy.\nDeveloping and maintaining relationships with potential clients and stakeholders.\nAnalyzing and adjusting strategies in response to competitive activity.\nIdentifying market needs and recommending appropriate business solutions.\nGenerating leads and identifying potential business opportunities.\nCarry out proactive prospection on potential opportunities.\nProvide added value by establishing and organizing contacts with appropriate decision-makers and influencers and securing follow-up meetings if required.\nInstruct and coordinate all development activities performed by internal and external resources.\nProvide detailed background information on key decision makers and influencers and relationships among them.\nMonitor and report on important political events that affect or might affect our current and/or future businesses.\nMonitor and report on important personnel moves and change of decision making or decision influencing power inside governmental and public entities. Skills",
    "Skills": [
        "Business Understanding            ",
        "Good understanding of Power Generation, Natural Gas Distribution, electricity, and natural gas commercialization.\nEnergy regulatory framework\nGroup’s strategy vision\nGroup’s governance and ethical rules."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}