{
    "Job ID": "4757634",
    "Description": "Engineering & Operations Manager - Saudi Arabia reporting to Plant General ManagerOur Client a Combined Heat and Power Plant is in eastern region of the KSA (Kingdom of Saudi Arabia)JOB PURPOSE:Responsible for ensuring that the Combined Heat and Power Plant is compliant with all, maintenance & engineering policies and all relevant statutory obligations.\nSupport the development of appropriate operations, maintenance and engineering policies and support the integration, implementation, and delivery of these within the operations & maintenance (O&M) teams. Lead the development of strategies that ensure legislative compliance and the levels of plant integrity meet the expected availability, flexibility, and technical performance. Co-ordinate the implementation of these strategies on a cost effective and timely basis in conjunction with all other operations, maintenance, and overhaul activities.\nDelegated authority for the development and implementation of effective processes to ensure all changes are appropriately managed and are consistent with ongoing integrity, compliance and operational requirements.\nManage all IT activities, development of the short and long-term IT strategy for the company and development of staff to support that strategy. Efficient management of IT activities, according to good utility practice, company rules, procedures, legal, contractual and other requirementsSkills",
    "Skills": [
        "KNOWLEDGE, SKILLS AND EXPERIENCE:",
        "Honours Degree in a relevant engineering discipline\nProfessional Accreditation\nPrior experience within the power generation industry in a range of engineering roles including design, manufacture, operation and maintenance\nFormal project management qualification\nPrior experience in specifying, procuring, managing plant component supply and/or overhaul contracts"
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Manufacturing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}