{
    "Job ID": "4757729",
    "Description": "About Equevu: Equevu offers an all-in-one workplace savings solution using advanced technology, streamlining interactions among stakeholders. This solution allows employees to invest a portion of their income in tailored investments, matching their risk tolerance and lifestyle preferences, all facilitated through their employer. Additionally, Equevu provides software tools to assist companies in meeting IFRS (International Financial Reporting Standards) requirements. These tools perform actuarial valuations of employee benefits and generate reports in accordance with IAS19R standards. Our vision is to enhance employee financial well-being in the Middle East while establishing a top-tier company in the process.  Job Overview: As a Junior Software Engineer at Equevu, you will work alongside experienced professionals to design, develop, test, and maintain software solutions that meet our FinTech products. This is an excellent opportunity for individuals with up to three years of experience to make a significant impact in a dynamic and innovative environment. Responsibilities: Collaborate closely with our tight-knit team to gather and understand software requirements for our Finance technology products. \nContribute to the design, coding, testing, and debugging of software applications that power our financial solutions. \nEngage in constructive discussions and code reviews within our close team. \nAssist in keeping our documentation on software design and implementation up to date. \nTake the lead in troubleshooting and resolving software defects and issues. Why join Equevu? Competitive salary \nFully remote position \nCollaborative and supportive team environment \nProfessional development opportunities \nA chance to be part of disrupting the pension and financial wellbeing field in the Middle East Skills",
    "Skills": [
        "Basic Qualifications: ",
        "0 to 3 years of relevant experience in software development. \nProficiency in one or more programming languages (e.g., Java, Python, C++, etc.). \nStrong problem-solving skills and a passion for learning and applying new technologies. \nExcellent communication and teamwork abilities. \nFamiliarity with software development methodologies and practices is a plus. \nSelf-motivated with a strong desire to contribute to the success of the team and the company. ",
        " ",
        "Additional Qualifications ",
        "Bachelor's degree in computer science, computer engineering or related technical discipline. \nAbility to effectively articulate and drive solutions to technical and business challenges. "
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 0 Max: 3"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Software Development",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}