{
    "Job ID": "4757723",
    "Description": "We are new cosmetic company in Dubai, and we are recruiting for Digital marketing position (preferred Ladies). The candidate will develop, implement, and manage marketing campaigns promoting the organization's products. The candidate will enhance brand awareness, drive web traffic, and acquire customers.Key Responsibilities:Develop marketing strategies that align with our cosmetic company’s goals\nManage and execute campaigns across various digital channels, including email, social media, search engines, and display advertising\nDevelopment of the performance of digital marketing campaigns (ROI and KPIs)\nConduct market research and analyse trends to identify new opportunities and improve campaign performance\nCollaborate with management teams to produce engaging content and optimize user experience through including web and content developments.\nStay up-to-date with emerging digital marketing trends and technologiesQualifications:Master's degree in marketing, communications, or related field\n2 to 3 years of experience in digital marketing or related field\nStrong understanding of digital marketing channels, including SEO, PPC, social media, email marketing, and display advertising\nProficient in marketing automation tools\nExcellent analytical skills and experience with web analytics tools (e.g., Google Analytics)\nStrong project management skills  Fluent in English and Arabic.Skills",
    "Skills": [
        "Qualifications:",
        "Master's degree in marketing, communications, or related field\n2 to 3 years of experience in digital marketing or related field\nStrong understanding of digital marketing channels, including SEO, PPC, social media, email marketing, and display advertising\nProficient in marketing automation tools\nExcellent analytical skills and experience with web analytics tools (e.g., Google Analytics)\nStrong project management skills",
        " Fluent in English and Arabic.",
        "Interested candidates can send their updated resume"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 3",
        "Residence Location": "Dubai, United Arab Emirates",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Advertising",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}