{
    "Job ID": "4757626",
    "Description": "Provides vital assistance to the project manager and is responsible for monitoring project schedule, and budget, preparing project progress reports, and liaising with key stakeholders in line with JRF’s guidelines and standardCore Responsibilities:Produces statistical, analytical, and narrative reports, including reports on reporting requirements, project expiry dates as well as any other reports; to ensure project output is achieved.\nEnsures timely distribution of all memos related to the project to all concerned staff and follows up on actions required.  \nResponsible for action plan and project’s budget follow-up; to ensure that budget expenditure falls within project financial resources; developed and managed appropriate accounting system for the project in coordination with relevant finance staff.\n Develops and maintains productive working relationships with project stakeholders and team members to ensure the smooth implementation, cooperation, and support of the project; carries out regular visits to monitor the project staff and project activities; \n Evaluates the project activities, and establish and implement mechanisms to systematically assess the achievement of results, to ensure projects are deliverable.\nEnsures that the project staff are implementing the project activities in accordance with the terms and conditions prescribed and approved in the project documents.\n Reviews and updates work plan throughout the program with guidance and management support from Program Manager; to ensure projects activities are matching with projects donors’ documents.\n Coordinates field officers’ day-to-day implementation of project activities; to ensure resources are utilized.\n Coordinates and manages relationships with the stakeholders of the project, including beneficiaries, contractors, partners, local government, and other organizations to ensure coherence among partners ensures that the project staff are implementing the project activities in accordance with the terms and conditions prescribed and approved in the project documents.\nReviews and updates work plan throughout the program with the guidance and management support from the Program Manager\nProvides business mentorship and technical expertise to the youth ventures based on the projects working plansSkills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in management, economics, international development, social science, or any other relevant field.\nStrong English and Arabic language skills (written and spoken).\n5-7 years of experience.\nExperience in international development or humanitarian assistance projects.\nExperience in project implementation and support."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}