{
    "Job ID": "4757051",
    "Description": "Our client, a high-end multi-brand Hospitality developer is hiring a Tax Controller.Based in their Riyadh Head office you will be responsible for analysing and interpreting tax regulations and preparing required tax reports so that the organization meets its tax obligations and objectives. Successful implementation of VAT with coordination with all concerned parties.\nMaintain controls by adhering to the accounting department’s policies and procedures and ensure Tax practices are in compliance with Kingdom of Saudi Arabia financial reporting statutes, standards, and financial reporting best practices.\nReview and monitor custom duties and excise duties in line with the law and regulations.\nReconcile accounts, post journal entries, and maintain a complete and accurate general ledger in accordance with accounting principles and reporting schedules so that the organization has a full and accurate statement of its financial position related to the Tax.\nProcess Tax related payments to ensure they are processed accurately and on time (e.g. WHT monthly payment, filing of WHT returns, VAT returns, etc.)\nReview invoices entries in the system, ensure all payments have the necessary approvals and signatures, prepare reconciliation checks, and process payments as per the company policies & procedures and the third party contract agreement.\nMonitor and resolve issues relating to approvals, record discrepancies (if any), billing discrepancies and incorrect information on the accounts related to taxation\nConduct day-to-day transactional processing and reporting on taxation. This includes the accurate posting of all tax-related entries.\nResearching, analyzing, and interpreting changing tax legislation inside the kingdom.\nMonitor the tax liability related to WHT, VAT and Zakat on a monthly basis.\nWorking with tax laws in the Kingdom and updating the changes.\nCompile, verify, and analyze financial information, and prepare financial reports and accounting statements so that senior management has accurate and timely information for making financial decisions.\nThese reports may include monthly VAT liabilities, WHT returns, VAT returns, regulatory reports and filings\nCommunicate and report the status of pending critical payments to ensure management's awareness of delays affecting the company’s operations and incurred financial liabilities.\nPrepare period-end closing transactions (monthly/quarterly/annually).\nKeep up to date  on any changes in taxation regulation or principles inside the kingdom and internationally.Skills",
    "Skills": [
        "Bachelor degree Accounting\n4 to 7 years of experience in a similar role\nGood knowledge of taxation programs, tax filing, and tax returns/ claims.\nProblem Solving Skills\nCommunication Skills\nExcellent Presentation Skills\nComputer Literacy (Word, Excel, PowerPoint, Outlook)\nDetail Orientation",
        " "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4 Max: 10",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 26 Max: 32"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}