{
    "Job ID": "4757805",
    "Description": "إدارة جميع العمليات المحاسبية العامة\nإعداد تقارير الوضع المالي الحالي بالمؤسسة\nتحليل البيانات المالية وتقديم رؤى محاسبية من دراستها\nإدارة وتتبع جميع الحركات المالية وتحديث سجلات المشتريات والمبيعات\nتقديم تقارير مالية دورية عن وضع الشركة لمجلس الإدارة والإدارات المعنية\nالاحتفاظ بالنسخ الاحتياطية للسجلات المالية\nاقتراح حلول واجراءت مالية لإصلاح المشاكل المالية بالمؤسسة\nوإعداد الميزانيات وقوائم الدخل وتقارير الأرباح والخسائر والإيرادات والمصاريف، والتقارير الأخرى كافة\nالحفاظ على سرية البيانات المالية\nادخال البيانات المحاسبية والملفات المالية الى انظمة الكمبيوتر\nأرشفة وتنظيم العمليات المالية وتنظيمها بطريقة سهلة\nيوثق المعاملات المالية عن طريق إدخال معلومات الحساب\nيحافظ على الضوابط المحاسبية من خلال التوصية بالسياسات والإجراءات\nتأمين المعلومات المالية من خلال استكمال النسخ الاحتياطي لقاعدة البيانات.\nتحليل وتقديم تقرير عن الوضع المالي بما في ذلك الفروق في بيان الدخل، وإبلاغ النتائج المالية للإدارة، وإعداد الميزانية وتحليلها\nالإشراف على الضرائب والالتزام باللوائح الاتحادية\nوضع وتنفيذ وتعديل وتوثيق نظم حفظ السجلات والمحاسبة، والاستفادة من تكنولوجيا الكمبيوتر الحالية.\nالتفاوض على شروط الصفقات التجارية والتحركات مع العملاء والمنظمات المرتبطة بها\nإسداء المشورة للإدارة بشأن قضايا مثل استخدام الموارد، والاستراتيجيات الضريبية، والافتراضات الكامنة وراء توقعات الميزانية.Skills",
    "Skills": [
        "المهارات الرياضية: القدرة على إجراء العمليات الحسابية بدقة وفهم الرياضيات المالية والإحصاءات.\nاستخدام البرمجيات المحاسبية: القدرة على استخدام برامج محاسبية مثل Excel و QuickBooks لإدخال البيانات وإعداد التقارير المالية.\nالتفكير التحليلي: القدرة على تحليل البيانات المالية وفهم الاتجاهات المالية وتقديم التوصيات.\nالتفتيش والمراقبة: القدرة على مراقبة الأنشطة المالية والتحقق من الامتثال للسياسات والإجراءات المحاسبية.\nالاتصال الفعّال: القدرة على التواصل بشكل فعّال مع الزملاء والعملاء وشركاء الأعمال.\nالتخطيط وإدارة الوقت: القدرة على تنظيم وإدارة الأعمال المحاسبية واحترام الجداول الزمنية.\nالمعرفة بالقوانين واللوائح: فهم جيد للقوانين واللوائح المحاسبية والضريبية المحلية والوطنية.\nالتحكم في الضغوط: القدرة على العمل تحت ضغوط الوقت والمواعيد النهائية."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Trading & Commodity Trading",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}