{
    "Job ID": "4757008",
    "Description": "PRIMARY PURPOSE:To effectively maximize Parts & Service deals within the assigned territory.PRINCIPAL ACCOUNTABILITIES:Achieve targeted requirements for the sales of Parts and Service to allocated customers. Handle them successfully and independently.\nDevelop and maintain excellent long-term relationships with assigned customers, based on   trust.\nPerform various equipment inspections to the required standard, such as CTS, SOS, TA,   etc., and provide customers with the most cost-effective solutions to their day-to-day  maintenance problems.\nManage the assigned territory efficiently and effectively by continually updating information regarding customer, equipment population, market activity, competition, lost sales and identifying potential for incremental sales.\nIdentify and promptly report sales opportunities for all Company Divisions.\nMaintain, at all times, a professional image and the highest level of integrity in all business dealings.\nPromote Zahid Tractor company’s value added services such as CSA, SOS, and Product Link etc.\nPerform any other duties as assigned by management from time to time.Skills",
    "Skills": [
        "Educational Qualifications & Certifications:",
        "Degree in Engineering (Electrical/Mechanical) or Equivalent",
        "Knowledge:",
        "Customer requirements, territories, projects, competitors’ strengths and weaknesses.",
        "Technical Skills:",
        "Excellent Heavy Machinery product knowledge. Ability to understand the features and operation of technical products and effectively communicate.\nSoftware skills: PowerPoint, Excel for preparing and making professional presentations to customers.",
        "Language Skills:",
        "Fluency in both English and Arabic.\nGood communication skills, both written and verbal.",
        "Experience:",
        "Min 5 Years experience in Parts & Service Sales with Heavy Machinery Dealer."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}