{
    "Job ID": "4757640",
    "Description": "Showroom Coordinator - Hurghada and Sharm El Sheikh BranchesThe showroom coordinator is responsible for answering phones, e-mails, scheduling appointments, and preparing event materials.\nYou will be tracking the showroom products with log in/out register and following up with concerned colleagues on the return of items. All this movement need to recorded. With signature.\nYou will be sending out the products tracking to the showroom manager regularly and any missing/ unreturned items reported immediately.\nYou will be responsible for ensuring proper event execution, coordinating with outside customers, managing any additional onsite help, connecting with customers, set up, and clean up before and after daily operations.\nAs Showroom coordinator you are expected to have excellent interpersonal skills, organization and time management skills, attention to details, and the ability to react in high pressure or crisis situations.\nEnsure high levels of clients’ satisfaction through excellent service.\nComplete all administration duties and ensure compliance with company policies and procedures.\nMaintain confidentiality of company and all customer information.\nResponsible of the display groundwork from arrangement to overall presentations.\nReports on purchase trends, customer needs, profits etc.\nMaintain a par stock of the display items. Tracks products sales.\nCommunicates activities, problems, recommendations or pertinent developments to the manager.Skills",
    "Skills": [
        " Customer management skills.",
        " Strong organizational skills.",
        " Good communication and interpersonal skills.",
        " Knowledge of retail operations and sales techniques.",
        " Skill in scheduling and coordinating activities of people and operations.",
        " Skill in basic math.",
        " You should have the passion for organizational skills, and the enthusiasm to remain updated with the happening in other departments. Also they should have thorough communication skills (written and verbal)."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 0 Max: 2",
        "Gender": "Female",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 22 Max: 33"
    },
    "Data": {
        "Job Location": "Hurghada, Egypt",
        "Company Industry": "Retail & Wholesale; Trading & Commodity Trading",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "2"
    }
}