{
    "Job ID": "4757396",
    "Description": "1. *Develop Marketing Strategies:* Create and execute marketing strategies to promote LED lighting products, including both B2B and B2C markets.2. *Product Promotion:* Develop and implement campaigns to showcase the benefits and features of LED lighting, such as energy efficiency, longevity, and environmental sustainability.3. *Market Research:* Conduct market research to identify target audiences, market trends, and competitors, and use this information to refine marketing strategies.4. *Content Creation:* Produce marketing materials, including product brochures, catalogs, online content, and videos, that effectively communicate the advantages of LED lighting to various customer segments.5. *Digital Marketing:* Utilize digital marketing channels such as social media, email marketing, online advertising, and SEO to reach potential customers and generate leads.6. *Sales Support:* Collaborate with the sales team to provide them with marketing collateral and support their efforts to close deals. Assist in lead generation and nurturing activities.Skills",
    "Skills": [
        "A marketing executive specializing in LED lighting should possess a combination of marketing and technical skills to effectively promote and sell LED lighting products.",
        "1. Bachelor's degree in Marketing, Business, or a related field. A degree in Electrical Engineering or a technical background is a plus.",
        "2. Proven experience in marketing, preferably in the lighting or electrical industry.",
        "3. Strong understanding of LED lighting technology and its benefits.",
        "4. Digital marketing proficiency and experience with marketing tools and platforms.",
        "5. Excellent written and verbal communication skills.",
        "6. Analytical mindset with the ability to use data for decision-making.",
        "7. Creativity and innovation in developing marketing campaigns.",
        "8. Project management skills and the ability to meet deadlines.",
        "9. Knowledge of relevant regulations and certifications in the LED lighting industry.",
        "10. Customer-focused mindset and strong interpersonal skills."
    ],
    "Preferred": {
        "Career Level": "Senior Executive",
        "Years of Experience": "Min: 2 Max: 5",
        "Residence Location": "Dubai, United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Arab Countries; India",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building; Electrical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}