{
    "Job ID": "4757718",
    "Description": "Roles and Responsibilities: To carry out all planned preventative maintenance inspections including manufacturerrecommended schedules on the predetermined cycles. To carry out predictive and corrective maintenance instructions that manufacturer recommended. To follow up all the details about buses via using maintenance system software. To monitor all issues of spare parts and demands via using maintenance system software, To train all maintenance employees, To perform to the highest technical standards on maintenance activities, To be prepared to seasonal preparation service for all vehicles to ensure reliability of the airconditioning system and vehicle cooling system during summer periods, To review the policies, processes and standards related to vehicle maintenance issues to ensurethat all remain constant and valid to legislation, regulation, and best practice. Prepare written reports Maintain accurate records.Skills",
    "Skills": [
        "Education / Qualifications and Requirements:",
        " Bachelor’s degree in mechanical engineering",
        " 5-7 years of experience in a managerial capacity",
        " 3-4 years relevant experience in fleet operations, Repairs and maintenance of vehicles valid",
        " driving license",
        " Speaking English proficiency",
        " Knowledge of an automated Fleet Management Information system",
        " Work experience as a successful Fleet Manager",
        " Strong leadership and management ability excellent supervision of all workflow procedures",
        " Very good administration and should have proper and referenced knowledge about Vehicle Fleet",
        "operations.",
        " Ability to establish and maintain effective working relationships with all internal and external clients.",
        " Ability to plan, organize and direct the work of skilled, semi-skilled and unskilled employees",
        "engaged within the organizational vehicle fleet operation.",
        " Ability to communicate both orally and in writing Microsoft Word, Excel, PowerPoint, Excel Oracle",
        "(Equipment &amp; Logistics Module)"
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Metro & Rail Passenger Transport; Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}