{
    "Job ID": "4757763",
    "Description": "We are looking for professional Tele Sales Executives to hire on the basis of immediate availability.Contribute to increasing company profits through fruitful customer relationships.\nPresent reports of potential prospects to the management for aiding critical business decisions.\nFocus on customer retention by lowering churn rate, amplifying sales through trending techniques, thereby adhering to the company's sales targets.\nManage typical conversion rate, sales call, revenue, and other reports in a precise manner for accurate evaluation.\nTake charge of promotional and sales activities by brainstorming new product or service launches with appropriate team members.\nBoosting sales prospects through effective utilization of consumer sales, dealer, PR, and business promotion techniques.Skills",
    "Skills": [
        "Proficiency in Arabic/ French/ Turkish Language is required along with English.\nAbility to analyze the goal, target customer, and challenges to overcome before planning sales-oriented activities.\nAdept at communicating with the in-house team, clients, and management through formal documentation and discussions.\nKnowledge of customer service principles and processes.\nPerformance-driven and capable of achieving targets under pressure.\nProven command on improving conversion rate through modern communication channels and impressive presentations.\nDemonstrated ability to forge long-lasting work relationships by leveraging information, tactics, and excellent communication."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Telemarketing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "16"
    }
}