{
    "Job ID": "4757355",
    "Description": "• Executive reporting and financial control on office financial resources.• Coordinating accounts receivable, accounts payable and general ledger entries.• Liaison with external supplier, hotels and flights company, if needed.• Developing and summarizing the business financial position in areas of income, expenses, capital usage and cash flows, and coordinate the preparation of plans, yearly budgets and financial forecast for the family office.• Coordination of all accounting functions for family and their investment entities.• Manages all personal tax issues of the family members.• Maintained and Allocated petty cash and keep it controlled and supported by documents and detail statement.• Arranged Filling vouchers – Sales, Purchases, Bank Receipts, Bank Payment and Petty Cash.• Coordinate with the bank's private relationship managers, and maintain account information update of credit cards and personal accounts, with sufficient balance, and keep the owners aware of credit cards updated advantages.• Perform daily accounting transactions such as creating & posting vouchers, and keep records hard & soft copy.• Managing the operational, financial, and monthly reporting aspects in the office.• Overseeing payroll for outside owner`s staff.• Developing, enforcing, and evaluating firm accounting policies and procedures in conjunction with the family needs. • Adhere to a high level of confidence.• Perform Any other tasks that could be requestSkills",
    "Skills": [
        "• 2-3 years’ experience for the same position.",
        "• Diploma in finance or accounting, Bachelors degree is advantage",
        "• Well known in English and Arabic.",
        "• Planning management experience.",
        "• Strong leadership and people management skills.",
        "• Extensive experience and relationships with banks is advantage."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Eastern Province, Saudi Arabia",
        "Company Industry": "Business Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}