{
    "Job ID": "4757649",
    "Description": "The incumbent is responsible for ensuring that project objectives/ implementation are on track/, ensuring implementation and documentation according to donor requirements.Core Responsibilities: Coordinates and follows up on project implementation with concerned support departments; reports any delays or problems hindering the implementation of the project to facilitate daily operations.\nConducts regular field visits to the targeted areas to monitor and ensure the implementation of project activities and fill the required tools with potential partners.\nContacts outreach sessions to meet candidates to determine their qualifications, experience, skills, and personality traits, for jobs based on the labor market needs.\nPrepares financial expenditure of WFD projects, follows up and report on the balance of remaining funds according to the expenditure plan.\n Collects data and information on the progress of project implementation for use in the weekly, and monthly reports; to ensure working within the action plan.\nCreates and maintains project database and project master plan, follows up and updates relevant data to produce accurate information and maintains and reports up-to-date information on projects as required;\nMaintains close communication and proactive coordination  with partners from private sector to ensure conformity with the  WFD Program’s plans and priorities;\nMonitors tracks closely the project plan implementation according to time and achieved objectives; to ensure that all project activities and relevant documents are documented/archived according to donor requirements;\nSupports the field team with all documents and information needed; for proper project implementation.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Business Administration, Social Work or any other relevant field; \nStrong English and Arabic language skills (written and spoken).\n3-5 years of experience.\n Experience working in Child Protection projects;\nKnowledge of Project Management principles and project cycle."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}