{
    "Job ID": "4757722",
    "Description": "Freelance Trade Finance Professional (copy)Euro Exim Bank, an award-winning and high-performing global financial institution is seeking freelance-based professionals to sell trade finance services to exporters and importers worldwide.If you are truly passionate about sales and have outstanding selling skills, this role could be for you.Main features of the job,·        Freelance basis only (this is NOT a permanent position)·        Commission-based pay only (this is NOT a fixed salaried position)·        Working from home in your country of residence (this is NOT an office-based position)·        There is NO investment or fee required from you.Your main task is to attract new clients (sales) involved in international trade such as exporters and importers by offering them our trade finance services such as LC (Letter of Credit, SBLC (Stand-by Letter of Credit), BG (Bank Guarantee) necessary for them to trade successfully in the global market.About The Job· Identify opportunities (lead generation) and generate sales from your country of residence.· Build and maintain strong customer relationships and assist with all relevant client checks.· Review Trade Finance client information in respect of Anti-Money Laundering (AML), Know Your Customer (KYC), and Counter-Terrorism Finance (CTF) requirements.The RemunerationAll members of our global sales team are given a commission scheme ranging from 2.5% to 15% on successful transaction volumes (terms & conditions apply). Your commission earnings will increase with your performance growth. There is no investment or fee required from you to come on board with us.Additional BenefitsFlexible working conditions such as working from home and selected hours· Ongoing delivery of high-quality training and trade finance product knowledge· Opportunity to learn and develop new skills· Live support from our senior management team· Expand your professional network by connecting with our professional LinkedIn followers· Sales lead help for high-performing individualsAbout Euro Exim BankHeadquartered in St. Lucia, West Indies, Euro Exim Bank is an award-winning international trade finance institution providing trade solutions for importers, contractors, and exporters. We have a Class ‘A’ international banking license from the Financial Services Regulatory Authority of St. Lucia (FSRA), a proud member of the Caribbean Association of Banks (CAB) and the International Chamber of Commerce (ICC). Working with a global network of partnerships, we currently have a representative office in London and are planning new offices in major financial centres in 2021/2022.Skills",
    "Skills": [
        " The successful candidate will take initiative and be a self-starter and enjoy being part of a dynamic team. This role would ideally suit a diligent and reliable individual who is a team player with well-developed interpersonal skills.",
        "You Must Have",
        "· 5+ years of experience in financial consultation, corporate advisory, corporate and institutional banking, business banking, or any related/similar sector",
        "· Highly accomplished in sales and lead generation",
        "· Excellent communication and negotiation skills",
        "· An understanding of KYC, AML, PEPs is advantageous",
        "· Outstanding academic performance",
        "· Accuracy, diligence and a high level of attention to detail",
        "· A mobile phone, a PC with internal or external webcam capability and reliable internet"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 8",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Jerusalem, Palestine",
        "Company Industry": "Banking; Financial Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "10"
    }
}