{
    "Job ID": "4758700",
    "Description": "Position Title:                ReceptionistEmployment Type:       Full TimeSalary:                              up to 4K AED all-inclusive depending on experience and qualificationsJob Location:                 Dubai, UAE About the Hiring Company:One of the leading groups in Hospitality & Leisure based in Dubai, known for its finest amenities and world class service. Job Description:Greet guests and clients professionally, inform hosts of their arrival, and offer drinks if needed, and clear the boardroom after meetings or coordinate with other teams for cleanup and sanitization.\nTake and record boardroom bookings, including catering and equipment requirements. Set up and prepare the boardroom for meetings, coordinating with F&B and IT as necessary.\nClear the boardroom after meetings or coordinate with other teams for cleanup and sanitization.\nAnswer calls courteously, direct them to the appropriate colleague, take accurate messages, and ensure timely relay of queries, and log international calls and manage mail. Keep the reception area and pantry clean and organized.\nMaintain stationery and pantry supplies, office equipment, and coordinate with various departments for maintenance and stock replenishment. Filing, binding, scanning, photocopying, and ensuring that requested assignments are completed with precision and punctuality. Assisting with document collection and distribution, liaise with drivers.Skills",
    "Skills": [
        "Qualifications:",
        "Open to Asian nationals\nFemale, 40 years old and below\nMinimum 2 years of prior experience in a front-of-the-house and secretarial capacity within the UAE\nMust be proficient in the English Language and has strong communication skills",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "East Asia; South Asia; Southeast Asia",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Toys & Leisure; Entertainment",
        "Company Type": "Recruitment Agency",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}