{
    "Job ID": "4758847",
    "Description": "Highest commission, up to 75%, paid to the experienced real estate agents.You’ll get all the most innovative tools you need to become successful. We specialize in freehold off-plan and ready properties in prime locations across Dubai. Our dedication to exclusive property care reaches clientele based locally and across the globe. We take pride in dealing with only the top developers highlighting the grand landscape of Emirates.Must be a fluent in English or Chinese or Russian.Please know that the position is strictly Commission based and we pay the highest commission rates in the industry based on the experience.What we offer:Attractive commission structure, uncapped earning potential\nGuaranteed Leads\nAssistance with RERA Training Course\nMarketing support across all property portals and social media campaigns for your listings\nMobile Calling plan\nOther Benefits: As per UAE Law.Skills",
    "Skills": [
        "We are looking for ambitious & result driven people who want to join the world of Real Estate.",
        "We are seeking a motivated and highly skilled Real Estate Sales Agent to join our growing team. As a Real Estate Sales Agent, you will be responsible for attracting, prospecting, and servicing clients by building relationships and providing expert guidance through the buying, selling, or renting process. You will be a key player in our mission to provide exceptional real estate services to clients and help them achieve their real estate goals.",
        "Key Responsibilities:",
        "Build a network of potential clients through prospecting, cold-calling, and marketing efforts.\nProvide clients with expert advice and guidance on buying, selling, and renting real estate.\nNegotiate contracts, write offers, and manage transactions from start to finish.\nProvide ongoing communication and follow-up with clients to ensure their needs and satisfaction are met.\nAttend networking events and other real estate industry events to continue to build relationships and expand your network.\nContinuously educate yourself on industry trends, best practices, and new technologies to stay ahead of the competition.",
        "Qualifications:",
        "At least 1 year proven track record as a real estate agent\nStrong interpersonal, communication, and negotiation skills.\nAbility to build relationships quickly and effectively.\nSelf-motivated and results-driven with a strong work ethic.\nValid UAE driving license"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}