{
    "Job ID": "4758605",
    "Description": "Implementing training, workshops, mentoring, and follow-up visits in the field.Core Responsibilities:Implements specialized trainings e.g. (Agriculture, Modern Agriculture Training Techniques, life skills, Microbusiness, Job placement, finance, and others) to achieve the objectives of training programs.\n Conducts the trainings in the English language to deliver trainings for NGOs members and stockholders.\n Having training accreditations from training federals to be able to implement accreditation programs.\n Assists and provides high technical knowledge to the instructional designing team in specialized fields of knowledge when requested to ensure providing high-quality material.\nResponsible for writing and editing training reports implemented to ensure all trainings implemented is according to the plan.\n Builds outlines for specialized training content to develop specialized draft training content for specialized trainings.\nAssists in developing training and mentoring plans when requested to ensure proper implementation.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's Degree in Human Sciences, Agriculture, Educational Sciences, Social Sciences, or any related field.\nMaster’s degree preferred.\nNative Speaker in Arabic & English.\n5 - 7 years of experience.\n Previous experience in Training & Development\nPractical experience in modern agricultural training\nExperience in entrepreneurship training and small projects.\nExperience in Possess life coaching skills training\nExperience in Plant production and protection."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization; Agriculture & Crop Production; Training & Education Center",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}