{
    "Job ID": "4758300",
    "Description": "The Cook is responsible for preparing ingredients and assembling dishes according to the Kitchen’s recipes and specifications.Core Responsibilities:Labels and stocks all ingredients on shelves to ensure they are organized and accessible.\nSet up workstations with all needed ingredients and cooking equipment to assist staff in achieving a smooth cooking experience.\n Prepares ingredients to use in cooking (chopping and peeling vegetables, cutting meat, etc.) to achieve a smooth cooking experience.\n Prepares foods and dishes according to demand within high taste and ensures well presentation of foods and dishes to ensure customer satisfaction.\nEnsures cooking stations are stocked, especially before and during prime operation hours to ensure the accessibility of the main chef to all and any needed tools.\nKeeps the kitchen clean and free of any potential safety hazards to ensure its compliance with the kitchen safety and hygiene standards.\n Follows standard kitchen-specific recipes ensuring the plated food is correctly prepared and looks appealing to achieve customer satisfaction.\nKeeps a close eye on the quality of kitchen equipment and reports to management if any repairs or replacements are needed to prevent possible injuries.\nAdheres to the Kitchen’s culinary standards and regulations. Skills",
    "Skills": [
        "Qualification:",
        "Diploma degree in culinary science or a related certificate would be a plus.\n English and Arabic language skills (written and spoken).\n0-2 years of experience.\nKnowledge of food preparation and presentation.\nWorking knowledge of kitchen equipment such as grills, ovens, and fryers."
    ],
    "Preferred": {
        "Nationality": "Jordan"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production; Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}