{
    "Job ID": "4758186",
    "Description": "As a Marketing Specialist, you will be responsible for formulating and executing comprehensive marketing strategies and event planning, focusing on media cooperation in overseas and online markets. At the same time, you will also be responsible for the management of online media advertising, editing of platform copywriting, and event packaging. Specific responsibilities include but are not limited to the following:Conduct in-depth research and analysis of market trends and competitors, and formulate market strategies and promotion plans based on understanding the target audience.\nPlan and organize online activities, including brand promotion, product launches, promotional activities, etc., to ensure the smooth progress of the activities and achieve the expected results.\nFind and establish cooperative relationships with overseas media partners, conduct docking and negotiations, and ensure the smooth progress of the entire cooperation process.\nResponsible for the planning and management of online media advertising, including the selection of advertising channels, advertising creativity copywriting design, etc.\nEdit copy for online platforms, including websites, social media, emails, etc., to ensure content is accurate, engaging, and consistent with the brand image.\nParticipate in the design of product packaging and promotional materials to ensure that promotional materials are attractive and can effectively convey product information.\nContinuously track market feedback and competition dynamics, and adjust and optimize market strategies based on data analysis and market feedback.Skills",
    "Skills": [
        "Bachelor degree or above, marketing, advertising media, or related majors is preferred.\nHave at least 1 year of experience in market planning, event planning, or related work. Applicants with experience in overseas markets will be given priority.\nFamiliar with the process and strategies of online media cooperation, familiar with the promotion channels of different platforms, and has rich docking experience.\nHave good creative and copywriting skills, and be able to write attractive advertising copy and platform copy.\nHave work experience related to the Metaverse and blockchain and a certain understanding of the industry and products.\nExcellent communication and coordination skills, with the ability to work effectively with internal teams and external partners.\nGood data analysis skills include the ability to make reasonable decisions and optimization measures based on market data.\nProficient in office software, such as the Microsoft Office suite (Word, Excel, PowerPoint, etc.).\nThere are no restrictions on nationality or gender."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "United Arab Emirates",
        "Nationality": "China",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}