{
    "Job ID": "4758217",
    "Description": "The MEL Assistant will fulfill MEL responsibilities including, but not limited to: assessment monitoring (Shadow visits), participatory monitoring activities, general satisfaction monitoring (exit interviews), and change monitoring (pre/post testing and assessments) to ensure high-quality. of assistance/services and continual learning.Monitoring and Evaluation:Oversees the monitoring activities and tracking of indicators for up to 3 projects to ensure high quality of assistance/services and continual learning.\nSupports the development of data collection methodology and tools to ensure detailed and accurate data.\n Conducts participatory monitoring activities using a varied suite of tools (assessment monitoring (Shadow visits), participatory monitoring activities, general satisfaction monitoring (exit interviews), and change monitoring (pre/post testing and assessments) in order to ensure high quality of assistance/services and continual learning) with JRF beneficiaries to get information and feedback on the quality and relevance of assistance in all areas of intervention.\n Conducts qualitative data collection activities (FGDs, KII), supports data processing (transcribing/ translating), and supports preparing qualitative summaries as well as ensuring the documentation of all necessary data and templates.\nEnsures timely reporting on monitoring activities in line with work plans and project timeline for internal and external purposes.\nTranslates important reports into Arabic, as agreed with MEL Supervisor, to ensure having bilingual reports if needed.\nProvides regular verbal and written feedback on field observations and monitoring findings to the MEL Supervisor and relevant program staff, to follow up on action plan.\n Builds and maintains good working relations and collaboration with staff/ departments, to ensure proper communication of the projects’ results, and concerns, in addition to be updated on the projects’ activities and plan.\nAssists in capturing and feeding into institutional learning by contributing best practices and lessons learned from ongoing MEL activities and/or projects’ activities to ensure the good quality of the outcomes, and preparing a lessons learned report per project under his/her responsibility to be communicated with the project’s stakeholders.\nTo follow up on the regular data collection through implementing partners (CBOs) and ensure quality of the data by random verifications and validations in coordination with the program staff.Data Management:Performs data quality checks on the data entered by the program staff into the JRF Information Management System; to ensure accurate and proper documentation.\n Cross-checking the projects fact sheets prepared by the IM team, and highlighting any concerns in the quality of data, reporting, or percentage achievement against the project’s outputs to ensure working according to the plan.\n Ensures up-to-date work plans, and proper tracking of MEL activities, beneficiaries and follow-ups; to ensure high quality of assistance/services and continual learning.\nEnsures documentation of all project documents including but not limited to log-frames, MEP’s, trackers, data analysis sheets, quality logs, and draft and final reports, by uploading them into the Shared Folder as agreed with the MEL Manager to ensure data preservation.Skills",
    "Skills": [
        "Qualification:",
        "Bachelor’s Degree in Business Administration, Industrial Engineering, MIS or any related field.\nCertificate in M&E, data management, and data analysis software will be an added advantage.\nStrong English and Arabic language skills (written and spoken).\n0-2  years of experience.\nKnowledge/experience with M&E specifically, information management or accountability. Skilled in all MS Office applications (particularly Excel). Basic knowledge at least of data analysis practices and tools."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}