{
    "Job ID": "4758277",
    "Description": "Collaborate closely with cross-functional teams, including project managers, architects, and procurement specialists, to gather essential data and information required for comprehensive cost assessments, taking into account factors such as materials, labor, equipment, and subcontractor services.\nAnalyzing project specifications and blueprints to precisely assess costs for construction and engineering projects, ensuring strict adherence to financial objectives and budget limitations.\nEngaging in evaluations of project bids, client engagements, and post-project reviews, leveraging your expertise to offer counsel on matters pertaining to costs, analyze deviations from projected expenditures, and contribute to the organization's initiatives aimed at enhancing overall practices of cost estimation and project profitability.\nEngaging in close partnership with cross-departmental teams, including project managers, architects, and procurement professionals, to gather vital information essential for holistic cost analyses, encompassing aspects like materials, labor, equipment, and subcontractor offerings.\nRegularly updating and surveilling cost databases to mirror the freshest developments in market trends, price changes, and regulatory revisions, ensuring the precision and credibility of cost assessments during all phases of projects.\nApplying established software and tools in the industry to fabricate detailed cost breakdowns and proposals, elucidating findings to stakeholders in a transparent and understandable fashion, and proposing potential avenues for cost reduction or value enrichment.Skills",
    "Skills": [
        "Excellent communication skills to collaborate with cross-functional teams, project managers, and clients, ensuring alignment on cost projections and maintaining transparency throughout the project lifecycle.\nIn-depth familiarity with industry-tailored cost influencers, materials, labor pricing, and market tendencies, enabling the creation of meticulous cost frameworks that underpin well-informed choices throughout project conception and implementation.\nExceptional communication aptitude to engage seamlessly with multifunctional teams, project supervisors, and clients, assuring accord on cost predictions and upholding transparency throughout the entirety of the project lifecycle.\nAdept in leveraging advanced cost estimation methods and software platforms to precisely determine project costs and deliver thorough cost itemizations for engineering assignments.\nCapable of expertly employing state-of-the-art cost estimation methodologies and software utilities to meticulously evaluate project costs and offer all-encompassing cost delineations for engineering schemes.\nDeep expertise in industry-specific cost elements, materials, labor charges, and market trends, leading to the development of accurate cost structures that provide the foundation for well-judged choices during project planning and execution."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 15",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Facilities & Property Management",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}