{
    "Job ID": "4758819",
    "Description": "FMCG EXPERIENCE IS A MUST.Our client is a dynamic and rapidly growing eCommerce company dedicated to delivering exceptional B2B solutions and are developing a new cutting-edge Global Marketplace. They pride ourselves on innovation, customer-centric design, and a passion for staying at the forefront of eCommerce trends. We are seeking a highly skilled and creative Graphic Designer with expertise in UI/UX to join their team in Dubai and help shape the future of eCommerce.We are looking for a talented Graphic Designer with a strong background in UI/UX design to play a pivotal role in elevating their B2B eCommerce platform. As a Graphic Designer you will have the opportunity to work on cutting-edge projects, collaborate with a diverse team, and contribute to the development of user-centric designs that drive business growth.**Key Responsibilities:**1. **UI/UX Design:** Create visually appealing and intuitive user interfaces for the B2B eCommerce platform, ensuring a seamless and engaging user experience.2. **Graphic Design:** Produce high-quality graphics, including banners, marketing materials, and product visuals that align with our brand identity and resonate with our target audience.3. **Collaboration:** Work closely with cross-functional teams, including developers, product managers, and marketers, to gather requirements and iterate on design concepts.4. **Research:** Stay up-to-date with industry trends and best practices in eCommerce, graphic design, and UI/UX to continuously improve our designs and user experience.5. **Brand Consistency:** Maintain brand consistency across all design assets and ensure they align with our B2B image and messaging.Skills",
    "Skills": [
        "**Qualifications:**",
        "- Proven experience in graphic design with a strong portfolio showcasing UI/UX design expertise.",
        "- Proficiency in design tools such as Adobe (CS) Creative Suite, Sketch, Figma, or similar.",
        "- Solid understanding of B2B eCommerce trends and user behaviour. And FMCG experience is mandatory.",
        "- Strong communication skills and ability to collaborate effectively with cross-functional teams.",
        "- Creative thinking and problem-solving skills.",
        "- Ability to work in a fast-paced environment and meet deadlines.",
        "**Preferred Qualifications:**",
        "- Bachelor's degree in Graphic Design, UI/UX Design, or a related field.",
        "- Experience with responsive design and mobile app design.",
        "- Knowledge of HTML, CSS, and web development principles.",
        "- Experience in eCommerce or FMCG industry."
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG; Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}