{
    "Job ID": "4758475",
    "Description": "Responsible for the overall management and oversight of broiler farms to ensure achievement of the broiler production targets in accordance with the set specifications in terms of welfare, weight, and quality.Develop the department’s objectives & KPIs in line with overall approved strategy to achieve primary goals, in addition to setting objectives for the department’s different functions/ individuals where applicable.\nReview departmental strategic results and ensure that corrective actions of insufficient results are well taken and properly implemented.\nDevelop the department annual budget and ensure all employees within the department are working within the assigned budget by setting the required targets and responsibilities.\nMonitor and control the department's expenditures against the approved budget and reconcile budget variances to ensure on-target performance against budgets.\nDevelop the department's policies & procedures in line with standards, laws, and regulations and ensure proper implementation of the same.\nManage and monitor the ventilation, heating, feed, water, litter, and lighting are as per the agreed standards, and ensure the highest quality conditions are provided for the birds.\nEnsure poultry houses/ farms are well prepared to receive day-old chicks from Hatchery and poultry breeder supplier company.\nManage day-to-day scheduling operations for processing live birds and monitor Broiler farm team to adequately adhere to the assigned schedule.\nManage broiler growing practices across the broiler farm, supervise checking the progress of broiler grow-out on each flock and make timely corrections as required.\nEnsure proper setup, cleanliness and maintenance of the broiler houses through implementing proper waste disposal, water disposal, and pest control practices.\nEnsure the availability of the different types of broiler feed in coordination with the Feed Mill department.\nOversee broiler farm’s team activities in terms of proper feeding of birds and implementing water and ventilation programs.\nTrack and analyze bird mortality rates and ensure all government regulations are followed when handling poultry flocks.\nMaintain a bio-secure farm by ensuring that all individuals entering the farm adhere to the bio-security control programs and cleaning activities are conducted to cover the facility both inside and out.\nPerform any other duties related to the job as assigned by the Direct Manager.\nPrepare department's manpower requirements and coordinate with the HR & Administration department regarding the recruitment activities to ensure hiring a highly professional and knowledgeable workforce.\nConduct annual performance appraisal for subordinates and recommend salary increments and promotions accordingly.\nIdentify the training needs of employees, ensure training & development initiatives are successfully delivered and provide feedback to the Direct Manager.\nDelegate responsibilities and assign tasks to subordinates to facilitate performing different tasks and work-related activities.\nManage subordinates' attendance and leaves to ensure complying with attendance policy, as well as the availability of proper replacement during subordinates' leaves.\nPrepare and submit reports with regards to the department’s activities on regular basis to the Direct Manager.\nReview reports prepared by subordinates related to the activities performed by different functions and provide feedback/ recommendations accordingly.Skills",
    "Skills": [
        "Bachelor's Degree in Poultry Science or related field.\nMaster’s Degree in Poultry Science would be an advantage.\nMinimum of 10 – 12 years of experience in the same or related field, with at least 2 years in a broiler management/ supervisory position.\nRefer to Competency Dictionary.\nProficient in English and Arabic."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Unspecified",
        "Job Role": "Farming and Agriculture",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}