{
    "Job ID": "4758447",
    "Description": "We’re a global distribution company focused on consumer electronics products of the well-known brands: Nokia, Infinix, Huawei, Inoi and many others.Our goal is to provide to you the products, solutions and services that are demanded by the market as fast as possible and at sellable price offers. This is achieved through the combination of up-to-date knowledge and broad experience.We are seeking an experienced Traders in the Mobile Phones & Accessories Market and IT Equipment.Responsibilities:Analysing and forecasting the trader market for mobile phones or IT Equipment.\nProcuring mobile phones or IT Equipment from manufacturers and suppliers, negotiating prices and delivery terms.\nSelling mobile phones or IT Equipment to traders and distributors.\nDeveloping and implementing sales strategies to maximize profits.\nMonitoring competitors' pricing policies and responding to market changes.\nAnalytical tasks: sales analysis, identifying the most popular products, and forecasting demand.For Mobile phones market also:Available contacts in DAFZA, Nasser Square and Naif Mobile Market.\nAvailable contacts with Distributors and Operators across GCC.\nAmple knowledge of using online portals such as Handelot as well as contacts with their consultants. For IT Equipment market also:Available contacts across IT market in Dubai such as Khaled Bin Waleed Street, Al Ain Centre etc.\nContacts with key buyers of the local traders and distributors.\nContacts in sales and purchase staff of KDR’s.\nUsing online portals such as Handelot to contact regional and international customers. Skills",
    "Skills": [
        "8-10 years of experience in the Mobile Phone or IT equipment market.\nPractical experience in both procurement and sales.\nKnowledge of the main manufacturers and suppliers in this field.\nNegotiation skills and the ability to close advantageous deals.\nAnalytical abilities and experience working with large volumes of information.\nCommunication skills and teamwork.\nBachelor’s or higher degree in Economics or Technical fields would be an add on.\nKnowledge of Mobile Phones or IT sales logistics and commercial procedures.\nKey contacts with traders and logistics partners in DAFZA or Jebel Ali."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Consumer Electronics",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}