{
    "Job ID": "4758281",
    "Description": "We are seeking a highly skilled and motivated Research and Development Manager to lead our research and laboratory operations. Reporting to the executive team, you will play a crucial role in advancing our PCE technology and maintaining our position as the leader in the market in Saudi Arabia.Key Responsibilities:Market Knowledge: Possess a comprehensive understanding of superplasticizers available in the market, along with the latest industry trends and technologies.\nQuality Control: Apply expertise in quality control within chemical manufacturing to maintain high product standards.\nResearch and Development Leadership: Lead the R&D team in the development and design of experiments, ensuring that research projects are effectively implemented.\nTest Protocol Adherence: Ensure that all tests and experiments adhere to test protocols and company procedures.\nData Management: Oversee the accurate recording, verification, and reporting of experiment data and observations.\nLaboratory Operations: Lead laboratory operations, including chemical analysis, chemical synthesis, raw material quality assurance, product quality control, concrete trials, and R&D activities.\nInnovation: Drive innovation and creative thinking within the R&D team to continually improve our PCE product.Skills",
    "Skills": [
        "Bachelor's degree in Chemistry or a related field (Master's or Ph.D. preferred).\nSubstantial experience in chemical research and development, with a focus on concrete admixtures (superplasticizers).\nIn-depth knowledge of industry norms, the latest technologies, and quality control practices.\nStrong leadership skills and a proven track record in leading R&D teams.\nExceptional problem-solving and creative thinking abilities.\nDetail-oriented with excellent data management skills.\nFluency in English is a preferable requirement.",
        "About Us:",
        "TriStar Technical Co. is the pioneering and exclusive producer of PolyCarboxylate Ether (PCE), an advanced superplasticizer in concrete technology, in Saudi Arabia. As industry leaders, we are committed to innovation, quality, and sustainable business practices."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture; Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Chemical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}