{
    "Job ID": "4758500",
    "Description": "Company Overview INVEST19 Technologies, a cutting-edge fintech firm nestled in the heart of DIFC Dubai. We specialize in the realm of financial technology, championing the utilization of emerging technologies such as Artificial Intelligence (AI), machine learning, and data science to streamline, automate, and elevate the user experience. Our mission is clear: we're constructing an innovative platform designed to offer next-generation, scalable, and high-speed tools and technological solutions. These are tailored for individuals and businesses, equipping them to thrive more efficiently and intelligently in a rapidly evolving landscape. Within our multilingual stock investment ecosystem, we place the user at the center, bridging global markets to empower both individuals and businesses, fostering a healthier and more resilient economy.Role OverviewAre you ready to embark on an exhilarating journey as a Sales and Marketing Specialist? This part-time, on-site position is based in the vibrant city of Dubai. As a Sales and Marketing Specialist, you will take charge of daily sales and support activities, engage in product training, and oversee sales management. Your primary objective will be to approach CFD/Forex Brokers, enticing them to join our World Trading League platform. Your role doesn't end there – you will also be entrusted with nurturing and steering leads through the entire sales life cycle.Skills",
    "Skills": [
        "We are on the lookout for candidates who possess the following attributes:",
        "Excellent Communication and Customer Service Skills.\nPrior Experience in Corporate Sales and Sales Management.\nFamiliarity with the Forex Market.\nAdeptness in Conducting Product Training.\nProficiency in Engaging with Customers and Effectively Managing Leads and Sales Life Cycle.\nA background in the finance industry is highly advantageous.\nA Bachelor's Degree in a Relevant Field is a plus.",
        "If you're a dynamic fresher with an unquenchable thirst for success and a passion for finance and technology, we invite you to explore this commission-based opportunity with us. Join us in reshaping the financial technology landscape and be a part of our innovative journey at INVEST19 Technologies!"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}