{
    "Job ID": "4758295",
    "Description": "Yachts Sales Manager in DubaiJob Responsibilities• To grow sales within the Middle East, Africa, and parts of Southeast Asia as defined.• Frequently engage with potential and existing customers• To obtain a thorough knowledge of the market we operate in.• To build and promote strong, long-lasting customer relationships by partnering with them and understanding their needs.• To utilize the experience within the business to find relevant solutions, and then present the potential Solutions to the customer.• To follow up on all inquiries provided by cold calling, telephone, website, or exhibitions.• To establish and develop ‘Resellers’ within the sales region.• To investigate and if required to assist in gaining approval from the ports, free zones & membership.• groups within the region to maximize our presence.• Achieve monthly sales targets and collaborate with the sales team.• Weekly reporting on sales activities to the Management.Skills",
    "Skills": [
        "Qualifications and Experience",
        "• Min 2 years experience as a Sales manager in: Yachts and Powerboats",
        "• Strong communication (verbal and written) and presentation skills.",
        "• Proven ability to drive the sales process from plan to close – sales focused and drive to succeed.",
        "• Preferable Technical knowledge of working systems aboard vessels such as yachts, powerboats",
        "• Experience with Microsoft Office Package and CRM Systems.",
        "• Excellent in English (spoken and written).",
        "Other Expectations:",
        "• Must have a thorough understanding of the sales process from finding new leads, negotiations to closing the sale.",
        "• Must be organised and structured with a clear methodology on winning sales.",
        "• Must have a hunter mentality but also understand key account management.",
        "• Ability to travel if needed."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Marine Transport Services; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}