{
    "Job ID": "4758479",
    "Description": "HSE Manager - Poultry FarmResponsible for developing and implementing the organizational health and safety programs in terms of implementation and awareness, in addition to reviewing and updating the set HSE policies, conducting the risk assessments required to detect potential hazards and plan precautionary measures.Develop the department’s objectives & KPIs in line with the overall approved strategy to achieve primary goals, in addition to setting objectives for the department’s different functions/ individuals where applicable.\nReview departmental strategic results and ensure that corrective actions of insufficient results are well taken and properly implemented.\nDevelop the department's annual budget and ensure all employees within the department are working within the assigned budget by setting the required targets and responsibilities.\nMonitor and control the department's expenditures against the approved budget and reconcile budget variances to ensure on-target performance against budgets.\nDevelop the department's policies & procedures in line with standards, laws, and regulations and ensure proper implementation of the same.\nPromote a strong awareness and personal responsibility for HSE with all management and supervisory personnel.\nEnsure proper implementation, update, review and audit of HSE systems, and oversee the knowledge transfer of the HSE techniques and proactive measures.\nControl HSE programs and plans and ensure that all HSE standards and guidelines are properly implemented throughout.\nEnsure that all employees adhere to the health, safety and environmental standards across all facilities.\nMonitor the effective implementation of appropriate Safety and Environmental Systems and ensure all occupational health and safety programs are well adhered to bystaff.\nEnsure that all hazards and risks associated with work activities have been identified, assessed and actions implemented in order to eliminate or reduce such risks.\nApply OHS policies, procedures and applicable laws, rules, and regulations across different divisions and departments, and ensure compliance by all of personnel to such systems.\nCollaborate with cross-functional teams to identify HSE training needs, develop appropriate resources, and execute training sessions for employees and management staff.\nTrain, monitor and coach employees in order to improve their skill level, and ensure adherence to principles, policies and standards of HSE processes in a reliable and cost-effective manner.\nMonitor the sanitation, safety and hygiene for all operations departments within farm and conduct and complete various site HSE inspections and audits to ensure compliance to occupational health and safety regulation.\nReview and analyze monthly HSE statistics and trends to determine a non-conformity to occupational health and safety regulations and implement corrective actions when required.\nManage conducting investigations pertaining to accidents and environmental incidents, conduct root cause analysis and recommend policies, procedures, and/ or other actions to correct problems or prevent future occurrence.\nPerform any other duties related to the job as assigned by the Direct Manager.\nPrepare department's manpower requirements and coordinate with the HR department regarding the recruitment activities to ensure hiring a highly professional and knowledgeable workforce.\nConduct annual performance appraisal for subordinates and recommend salary increments and promotions accordingly.\nIdentify the training needs of employees, ensure training & development initiatives are successfully delivered and provide feedback to the Direct Manager.\nDelegate responsibilities and assign tasks to subordinates to facilitate performing different tasks and work-related activities.\nManage subordinates' attendance and leaves to ensure complying with attendance policy, as well as the availability of proper replacement during subordinates' leaves.\nPrepare and submit reports with regards to the department activities on regular basis to the Direct Manager.\nReview reports prepared by subordinates related to the activities performed by different departments and provide feedback/recommendations accordingly.Skills",
    "Skills": [
        "Bachelor's Degree in Veterinary Science, Industrial Engineering or any related field.\nMaster’s Degree in OHS would be an advantage.\nFurther studies and certifications in IOSH, NEBOSH or OSHA would be an advantage.\nMinimum of 10 - 12 years of experience in the same or related field, , with at least 2 years in a HSE management/ supervisory position."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Agriculture & Crop Production",
        "Company Type": "Unspecified",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}