{
    "Job ID": "4758541",
    "Description": "Minimum Requirements and QualificationsGeneral Experience: Sound knowledge, proven skills, and competencies in application of change management, project cost control principles, methodologies, and tools, supporting all phases of project execution, especially around Change Management, Project Cost Control, Forecasting and Reporting, within a large project-oriented EPC or Owner Organization. Must be able to deliver accurate cost information, reporting and guidance to management.\nProject Controls Experience: Proven skills and experience of change management, cost control for projects on global basis. Understanding of a variety of project types, structures, and contract terms. This includes EPC, third party Sale of Equipment (SOE), joint ventures, capital, and cost sharing type arrangements.\nFlexibility: Travel internationally to other regional engineering and project sites.\nCore competencies: Commercial and technical acumen, working knowledge of change management, project cost, planning tools and systems. Working knowledge of project management, business development and finance. Must have a proficiency in MS Excel and Power PointAs a Project Reporting Coordinator, you will have:Education – Bachelor’s degree in Engineering, Numerate or related field preferred\nMinimum of 4+ years of work experience in Project Execution / Project Controls\nAbility to work within an established team to achieve targets and goals.\nStrong organizational and time management skills.\nExcellent knowledge and proficiency with the Microsoft office suite (Excel, Word, PowerPoint, One Note)\nWorking knowledge of SAP, Primavera P6, Deltek Acumen is desirable\nExcellent oral and written English proficiency is a must. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dhahran Al Janoub, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}