{
    "Job ID": "4758267",
    "Description": "Monitoring / analyzing key performance indicators (KPIs), related to drilling operations, with appropriate software and analysis of the Lessons Learned System.\nHighlighting opportunities for cost efficiency and performance improvement, identifying challenges and proposing innovative technology solutions.\nEnsuring the Offshore/Onshore Teams are challenged to have meaningful conversations prior to a task.\nTraining Drilling Engineers, Geologists and TLs in using the performance dashboard and viewing the various KPIs.\nActively contributing to the Section performance review (SPR), Monthly Performance Review (MPR) and end of well report (EOWR) by providing performance KPIs for each operation.\nEstablishing operations / reporting guidelines that will be converted into corporate procedures.\nTracking NPT& identifying, calculating & reporting ILT (Invisible Loss Time)\nPerforming QA/QC of daily reports (DDR) from rigs, confirming the usage of proper codes & subcodes (as per the Code of Practice) concerning the operations performed.\nContribute & involve in setting up & updating Standard Operating Procedure.\nAdheres to Customer standards and policies.\nResponsible to Identify, Capture and Communicate in due time, any discrepancy or inconsistency in Low Frequency (EDM) and High Frequency data. Any event is communicated to the relevant Customer’s roles through the “Discrepancy Notification”.\nIs fully proficient in the use of performance tracking application / software.\nResponsible for generating all the performance related deliverables like “Daily Performance Report” (DPR), “Section Performance Report” (SPR), “Record Tracker”, “ILT/POT Recognition” etc. by adhering to the agreed frequency and time of delivery.\nResponsible to identify and escalate any performance related issues with either the process or application with RTOC Supervisor and Company representative accordingly.Skills",
    "Skills": [
        "Minimum 5 years’ experience in mudlogging or M/LWD or directional drilling.",
        "Understands Well Operations in all its different aspects, with especial emphasis in those operations that play a role on the KPI and GPI Definitions."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "12"
    }
}