{
    "Job ID": "4758422",
    "Description": "岗位职责:1. 负责起草中沙产能合作项目报告，报国家发改委、省市区相关机构以及高新区集团；2. 协助中沙产能合作平台的运营，包括辅助股东会、董事会以及各委员会的运作；3. 辅助筹备中沙产能合作各类活动，包括但不限于论坛、沙龙等；4. 对接、协调和沟通中沙两国的各相关部门，帮助项目落地以及中沙产能合作平台的顺畅运营；5. 其它相关工作，如招标，政府相关会议准备、政府和企业出差相关材料准备以及其它领导安排的事项。任职要求:1. 熟悉沙特阿拉伯国家文化、习俗，具备国际视野；2. 本科及以上学历，具有7年以上工作条历，其中2年以上项目管理经验，有海外运营管理经验者或海外留学背景者优先；3. 英语6级或同等水平以上，具备优秀的英文沟通和表达能力。精通阿拉伯语者优先；4. 具备良好的沟通表达能力和意识，和上级及时汇报，按照要求准确传达信息和安排任务；5. 具备较强的自我管理和时间管理能力；6. 具备良好的协调组织能力和团队精神，能协调和整合各部门资源，共同解决问题；7. 具备良好的适应能力和抗压能力，能及时分析和解决突发问题。工作地点: 广州、沙特阿拉伯Skills",
    "Skills": [
        "Responsibilities of the post:",
        "1. Responsible for drafting the report of Sino-sandy energy cooperation project, reporting to the National Development and Reform Commission, provincial and municipal relevant institutions and high-tech zone groups",
        "2. Assist in the operation of the Sino-Saudi Arabia Energy Cooperation platform, including the operation of the shareholders' meeting, the board of directors and the committees",
        "3. Assist in the preparation of various activities of sand energy cooperation, including, but not limited to, forums, salons, etc.",
        "4. Docking, coordinating and communicating with the relevant departments of China and Saudi Arabia to help the project land and the smooth operation of the Sino-Saudi Arabia energy production cooperation platform",
        "5. Other related work, such as bidding, government related meeting preparation, government and enterprise travel related materials preparation and other leadership arrangements.",
        "Requirements for appointment:",
        "1. Familiar with Saudi Arabia's national culture and customs, with an international perspective",
        "2. Bachelor degree or above, at least 7 years working experience, including 2 years project management experience, overseas operation management experience or overseas study background is preferred",
        "3. CET-6 or above, excellent communication and expression skills in English. Proficient in Arabic is preferred",
        "4. Good communication skills and awareness, timely reporting with superiors, accurate communication of information and scheduling of tasks as required",
        "5. Strong ability of self-management and time management",
        "6. Have good coordination organization ability and team spirit, be able to coordinate and integrate the resources of various departments, solve problems together",
        "7. Have good adaptability and compression ability, can analyze and solve sudden problems in time.",
        "Place of work: Guangzhou, Saudi Arabia"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jubail, Saudi Arabia",
        "Company Industry": "Investment, Securities & Funds",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "2"
    }
}