{
    "Job ID": "4758696",
    "Description": "Preservation of Brand Identity Across Subsidiaries:Overhaul the user interface and user experience of B2B platforms and websites across all affiliated companies.\nCollaborate closely with internal teams to guide design concepts from inception to project completion.Creation, Production, and Delivery of Marketing and Sales Materials:Develop and deliver a wide range of marketing and sales materials, encompassing presentations, branding elements, and logos.\nOversee the production of print materials such as brochures, business cards, and trade show collateral/booth graphics.Management of Social Media and Ecommerce Marketing:Serve as the primary point of contact for all social media and ecommerce platforms, overseeing content creation, banner design, and communication.\nUtilize these platforms strategically to meet business goals and objectives.Product Development for Specific SKUs:If necessary, lead the rebranding efforts for specific stock keeping units (SKUs), including the redesign and management of packaging and labels for private label items.Revamp Company Documents via Crystal Reports:Undertake the task of redesigning company documents through the utilization of Crystal Reports.Finalize Demos for Various Company Initiatives:Ensure the completion and presentation of demos for various initiatives undertaken by the company.Process Improvement and Gap Identification:Evaluate existing processes within the defined scope and pinpoint areas that require enhancement.\nDevelop innovative solutions and detailed process plans to rectify identified gaps.Maintenance of Internal Database:Continuously update and manage an internal database housing designs, photos, videos, and campaign materials.This role encompasses a diverse set of responsibilities focused on maintaining brand consistency, producing marketing collateral, managing digital marketing efforts, and actively participating in the improvement of company processes.Skills",
    "Skills": [
        "5+ years of experience in graphic design, art, or related field\nPrior FMCG experience in designing Consumer Packaged Goods is a must\nBachelor’s degree in graphic design, art, design, or related field\nPortfolio of extensive designs used in successful marketing campaigns\nExpert in working with Adobe CS graphics software including photoshop, InDesign and Illustrator"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}