{
    "Job ID": "4758384",
    "Description": "Our company is currently seeking an experienced HR Recruitment Officer to join our team in Doha, Qatar. The ideal candidate will have a minimum of 5 years of experience in recruitment, preferably in the Qatar market. The HR Recruitment Officer will be responsible for sourcing, screening, and selecting qualified candidates for open positions within the company. This role requires a strong understanding of recruitment best practices, excellent communication skills, and the ability to work effectively in a fast-paced environment.Responsibilities:Collaborate with hiring managers to identify staffing needs and develop recruitment strategies\nSource potential candidates through various channels, including online job portals, social media, and networking\nScreen resumes and conduct initial phone interviews to assess candidate qualifications and fit\nCoordinate and schedule interviews with hiring managers\nConduct reference checks and background screenings\nManage the recruitment process from start to finish, including offer negotiation and onboarding\nMaintain accurate and up-to-date recruitment data and candidate profiles in the ATS\nStay current on industry trends and recruitment best practices\nBuild and maintain relationships with external recruitment agencies and job boardsSkills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in Human Resources or related field\nMinimum of 5 years of experience in recruitment, preferably in the Qatar market\nStrong knowledge of Qatar labor laws and regulations\nExcellent communication and interpersonal skills\nAbility to work independently and in a team\nHigh level of attention to detail and organizational skills\nAbility to multitask and prioritize workload\nProficiency in Microsoft Office Suite and SAP.\nExperience with social media recruitment strategies\nRecruitment and selection\nSourcing and screening\nInterviewing and assessment\nHR policies and procedures\nATS and HRIS systems\nCommunication"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 10",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}