{
    "Job ID": "4758325",
    "Description": "Join the ZOOBA Team and Be Part of Something Extraordinary!About ZOOBA:ZOOBA is not just a restaurant; it's a global culinary sensation that's redefining Egyptian street food on the world stage. We've earned our place as the #1 restaurant in Egypt and ranked #9 in the MENA region on the World's 50 Best Restaurants list. At ZOOBA, we've transformed traditional Egyptian street food into a celebration of flavors, quality, and culture. Our journey began in Zamalek, Cairo, in March 2012, with a vision to showcase the authentic, wholesome nature of Egyptian street food while prioritizing cleanliness, safety, and the freshest all-natural local ingredients.Our brand is a vibrant tribute to Egyptian street food culture. We firmly believe that Egyptian street food stands among the world's best, and through ZOOBA, we are on a mission to proudly share Egypt's unique street dishes with the world. Our menu offers traditional favorites and innovative creations that capture the essence of Egypt's lively streets – a fusion of color, sound, and originality.Join Our Team:At ZOOBA, our people are the heart and soul of our brand. We understand that our success depends on the dedication and passion of every member of our team. From the moment guests step into ZOOBA, our employees create the entire experience – from the ambiance to the food, ensuring every detail aligns with our core values. Our commitment to our employees' growth and development means that when you join us, you become part of a team that cares about your success.As a Waiter at ZOOBA, you'll be the face of our restaurant, responsible for ensuring our guests have a memorable dining experience. Your primary responsibilities will include:Collaborating with your fellow team members, you will contribute to a positive and efficient work environment by assisting colleagues when necessary and maintaining a sense of teamwork.\nSwiftly clearing and setting tables for incoming guests, you'll maintain a tidy and organized dining area throughout the entirety of your shift.\nPlaying an integral role in cultivating a cooperative workplace atmosphere, you'll readily support your peers when required, nurturing a robust spirit of collaboration.\nYour commitment to adhering rigorously to hygiene and safety regulations will be reflected in your meticulous handling of food and drinks, precise payment processing, and unwavering dedication to guest delight.\nAssuming the responsibilities of a waiter, you'll play a crucial part in greeting guests warmly, noting down orders accurately, and ensuring an enjoyable dining encounter for all.\nIn the capacity of a waiter, you'll be tasked with providing a hospitable welcome, taking down orders with precision, and managing the entire dining episode proficiently.Skills",
    "Skills": [
        "Proficient in the art of upselling, adeptly recommending daily specials, beverages, and desserts to enhance the dining experience and contribute to increased revenue.\nDemonstrates exceptional order management skills, ensuring precise communication of guest preferences to the kitchen and overseeing the timely delivery of meals.\nDemonstrates expertise in upselling techniques, effectively highlighting featured items, beverages, and desserts to provide a more enjoyable dining experience for guests.\nSuccessfully navigates dynamic restaurant settings, effortlessly adapting to evolving situations, and skillfully managing the demands of a bustling dining floor."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Degree": "High school or equivalent",
        "Age": "Max: 38"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "30"
    }
}