{
    "Job ID": "4758449",
    "Description": "·           Perform “Hold”, “Witness” and “Surveillance” inspections and tests at manufacturing facilities or construction sites to ensure compliance with SAUDI ARAMCO requirements and project specifications.·           Inspect material and equipment as applicable to ensure compliance with SAUDI ARAMCO requirements for proper handling, storage and protection at SAUDI ARAMCO facilities and/or construction sites.·           Monitor Contractor’s Quality Systems, records and Quality Personnel for compliance with requirements.·           Review and evaluate Contractor’s Quality document submittals.·           Witness on-site and off-site material and installations tests for compliance with SAUDI ARAMCO standards.·           Record legibly and accurately all controversial and non-complying construction practices, materials and equipment and report to supervisor detailed potential problems for early resolution.Write inspection reports and initiate Non-Conformance Reports (NCRs), Worksheets (WSs) and Equipment Deficiency Report (EDRs) as neededSkills",
    "Skills": [
        "·           B.S degree in Engineering in a respective inspection discipline with at least six (6) years of experience in relevant inspection discipline. OR two (2) years industrial/technical College Diploma plus a minimum of ten (10) years of relevant inspection experience.",
        "·           Demonstrated thorough knowledge of applicable international standards.",
        "·           Demonstrated full working knowledge of quality system standards and methods",
        "·           Inspectors are expected to hold internationally recognized certifications in the disciplines for which they are qualified. For example; welding inspector AWS or CSWIP, coating BGAS/CSWIP or NACE, mechanical inspector API 563 for Tanks, API 570, API 510 or ASME certified for Pressure Vessels, Boilers and Heat Exchangers, and ASNT Level II in MT, PT, UT & VT, RTFI, Electrical inspector NCPCCI, NFPA 70, ICBO, SMACNA, Uniform Mechanical Code, NFPA 90A, ASHRAE, communication inspector BICSI, API 936 for Civil inspector if required, etc.",
        " "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Gender": "Male",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Training & Education Center",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}