{
    "Job ID": "4758364",
    "Description": "If you pay close attention to financial details, enjoys working with numbers, and can maintain financial balance, we would like to invite you to consider a career with us at voestalpine Turnout Technology Egypt as an Accountant. As a valued member of our team, you'll play a vital role in safeguarding the financial health of our company while ensuring that we follow the important accounting rules and regulations set by Egyptian law. Your strong record-keeping skills and financial expertise will be crucial in making sure our financial reports are accurate and that we meet the requirements of Egyptian accounting standards.Starting Date: November 2023Skills",
    "Skills": [
        "Responsibilities:",
        "Maintain accurate financial records and ensure compliance with accounting standards and regulations.\nPrepare financial statements, including balance sheets, income statements, and cash flow statements.\nPerform regular financial analysis to identify trends and provide insights to management.\nAssist in budgeting and forecasting processes to support financial planning.\nReconcile accounts and resolve discrepancies in a timely manner.\nCollaborate with cross-functional teams to gather financial data and provide financial support.\nAssist with audits and tax filings to ensure compliance with legal requirements.\nSupport financial decision-making by providing data and analysis as needed.\nKeep up-to-date with accounting best practices and industry regulations."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abbassia, Cairo , Egypt",
        "Company Industry": "Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}