{
    "Job ID": "4758156",
    "Description": "Promoting the company's existing brands and introducing new products to the market through direct visit to businesses and social media channels.\nManage social media channels\nReply to clients queries in social media.\nGathering, investigating, and summarizing market data and trends to draft reports.\nImplementing new sales plans and advertising.\nMaintaining relationships with important clients by making regular visits, understanding their needs, and anticipating new marketing opportunities.\nDevelop revenue strategies and marketing campaigns\nMaintain client database\nDevelop and execute marketing and sales plans and strategies, including creating and updating marketing and sales plans, setting marketing budgets, monitoring performance, and developing and designing marketing materials for web and print\nDevelop sales action plans for new and existing clients based on market needs and business objectives\nRecommend for better sales of company’s products and services.Skills",
    "Skills": [
        "A bachelor's degree in marketing, business administration, or related field.\n2-4 years experience in marketing or sales in UAE.\nExperience in management may be advantageous.\nUnderstanding and knowledge of sales and marketing.\nStrong analytical, organizational, and creative thinking skills.\nExcellent communication, interpersonal, and customer service skills.\nKnowledge of data analysis and report writing.\nThe ability to understand and follow company policies and procedures.\nThe ability to work under pressure."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}