{
    "Job ID": "4758221",
    "Description": "As an HR Recruiter at our company in Al Olaya, Riyadh, you will be responsible for managing the full recruitment cycle, from sourcing and screening candidates to conducting interviews and making job offers. Your goal will be to attract top talent, ensure a smooth hiring process, and support the company's growth objectives.Responsibilities:Collaborate with hiring managers to understand their recruitment needs and develop effective job descriptions.\nSource potential candidates through various channels, including online job boards, social media platforms, and professional networks.\nScreen resumes and applications to identify qualified candidates.\nConduct phone, video, and in-person interviews to assess candidates' qualifications and cultural fit.\nCoordinate and schedule interviews with hiring managers and candidates.\nConduct reference checks and background screenings for selected candidates.\nPresent job offers to successful candidates and negotiate employment terms.\nMaintain accurate and up-to-date candidate records in the recruitment database.\nCollaborate with HR team members to improve recruitment processes and strategies.\nStay updated on industry trends and best practices to enhance recruitment efforts.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Proven work experience as an HR Recruiter or similar role.\nHands-on experience with various recruitment tools and platforms.\nStrong knowledge of sourcing techniques and strategies.\nExcellent communication and interpersonal skills.\nAbility to assess candidates' qualifications and cultural fit.\nGood understanding of employment laws and regulations.\nAttention to detail and ability to prioritize tasks.\nAbility to handle confidential information with professionalism and integrity.\nStrong organizational and time management skills.\nRecruitment and talent acquisition\nInterviewing and assessment\nSourcing and screening candidates\nKnowledge of employment laws and regulations\nExcellent communication skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 7",
        "Age": "Min: 22 Max: 35"
    },
    "Data": {
        "Job Location": "Al Olaya, Riyadh , Saudi Arabia",
        "Company Industry": "Industrial Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}