{
    "Job ID": "4758263",
    "Description": "We seek a dynamic and experienced General Manager to join our leadership team. Reporting directly to the Chairman, you will play a pivotal role in guiding the strategic direction of our company. As the only producer of PCE in Saudi Arabia, we require a visionary leader who understands the construction chemicals industry, especially concrete additives in Saudi Arabia and the greater Middle East Regions, and navigates overall operations management while fostering a positive work environment and driving innovation.Reporting To: ChairmanKey Responsibilities:Strategic Leadership: Lead the management team and provide strategic direction for all business units, aligning the company with its long-term vision.\nTeam Empowerment: Recognize and utilize team members' strengths to execute their contributions to the overall strategy.\nCultural Intelligence: Show cultural intelligence for effective management of diversity and cross-cultural business interactions.\nOperational Excellence: Oversee day-to-day operations to ensure efficiency, compliance, and quality standards are met or exceeded.\nVision Commitment: Lead by example, showcasing a deep commitment to the company's vision and actively contributing to the strategic implementation.\nTrack Record: Bring a proven track record of success in operations management, strategic planning, and team leadership in the Construction Chemicals industry.Skills",
    "Skills": [
        "Bachelor's degree in a relevant field (MBA or equivalent preferred).\nExtensive experience in operations management, preferably within the Chemical manufacturing industry.\nDeep knowledge of the Construction Chemicals industry in the Saudi and greater Middle east regions.\nExceptional leadership and team-building skills, with a commitment to employee development.\nStrategic thinker with a creative approach to problem-solving.\nExcellent communication and interpersonal abilities.\nCultural intelligence and adaptability.\nFluency in English is a mandatory requirement and proficiency in Arabic is a strong preference.",
        "About Us:",
        "TriStar Technical Co. is the pioneering and exclusive producer of PolyCarboxylate Ether (PCE), an advanced superplasticizer in concrete technology, in Saudi Arabia. As industry leaders, we are committed to innovation, quality, and sustainable business practices."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture; Construction & Building; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}