{
    "Job ID": "4758942",
    "Description": "We recently launched in Lebanon and are growing our customer base. We're looking for a natural community leader to join us to acquire customers and grow Sinbad in Lebanon.What you’ll do:Grow. You'll help us plan and execute ways for us to scale our community in Lebanon, driving user adoption and brand awareness. This requires finding and talking to potential users - from setting up meetups, promoting the app on post-secondary campuses and managing digital communities.\nActivate. You'll collaborate with content creators in Lebanon to surface the best content on our platforms and build out our own hub for community creation and interaction.\nListen. You'll monitor and participate in conversations about Sinbad across the internet, and among our early adopters, surfacing sentiment, exceptional user-generated content, and feedback from users. You'll share insights and lessons directly with the team to influence product development, marketing campaigns, and more.\nTest. The faster we can figure out what works, the sooner we can provide more value to the community. You'll identify metrics that actually map to our goals, use them to figure out what programs we should invest in, and relentlessly iterate.Skills",
    "Skills": [
        "You know Beirut like a local. You live in Beirut and have spent a lot of time in the city. You might not have been born there but you’ve spent enough years there to have developed a deep understanding of the culture while having built a rich network of your own.\nYou aren’t afraid to meet new people every day. You enjoy making new connections and are comfortable with rejection. You're willing to put in the work to build relationships and help Sinbad gain more users.\nYou’re a great communicator. You're charismatic and people easily understand you. You are fluent in English and Lebanese Arabic, written and spoken.\nYou believe in providing stable currency for all. You have an understanding of the various applications of blockchain, decentralized finance and believe in the Web3 promise."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Beirut, Lebanon",
        "Degree": "High school or equivalent",
        "Age": "Min: 21 Max: 32"
    },
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Marketing; Software Development; Advertising",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}