{
    "Job ID": "4758348",
    "Description": "General Management:Manages the manufacturing activities in accordance with established policies, guidelines, and procedures. Manages sales activities in a way that will achieve both short and long-term goals of the Company.\nOversees bakery operations to ensure a continuous flow of high-quality bakery products to customers within established specifications, standards, and profit objectives.\nWorks in concert with functional departments to implement the Company’s strategy. Reviews market analyses to determine customer needs, volume potential, price schedules, and discount rates, developing sales programs to meet or exceed the goals of the company. Determines product offering and pricing consistent with company strategies and financial expectations. Supports the promotion and success of Al Jabri branded and exclusive branded products.\nKeeps informed of new training methods, techniques of competitors, and pending introduction of new company products to determine training needs for the Company. In conjunction with leadership develops and directs training plans, programs and procedures to ensure current and effective training programs for the sales team.\nParticipates in the development and execution of plans and policies for company.\nEnsures that approved operation policies and objectives are clearly understood and effectively applied within the company.\nParticipates in the research and evaluation of new equipment and production techniques to ensure that the company is on the leading edge of bakery technology.\nDevelop and manage an effective organization with appropriate infrastructure, systems, programs and methods to achieve growth objectives. Financial\nPrepares sales plans and sales budgets based on broad company goals and growth objectives.\nReviews sales results of the Company, compares them to established objectives, and takes steps to ensure that appropriate measures are taken to meet or exceed expectations.\nImplements methods to minimize costs and improve efficiency of operations and quality of products.\nMonitors all budget and capital expenditure projects to ensure completion on schedule and within budgetary guidelines.\nCreate and submit operating budgets to Al Jabri for approval.\nInitiates corrective action related to profit and loss factors affecting financial results.\nDevelops sales plan within company guidelines and established best practices to optimize sales to the achievement of budgetary expectations.Ø Sets goals to drive improvements with clear goals and accountabilities. Sets clear priorities and measures and monitors KPI’s.Interfaces with internal personnel to preserve and enhance the image of the company as a competent supplier of quality bakery products.\nManage relationships with partners/vendors.\nResponsible for the overall direction, coordination, and evaluation of the staff in a manner that creates harmony within the workforce and promoting an attitude that will ensure successful results.\nCarries out supervisory responsibilities in accordance with organizational policies and applicable laws. Responsibilities include interviewing and hiring; planning, assigning and directing work; appraising performance; rewarding and correcting performance; addressing complaints and resolving problems.\nEnsures that personnel maintain knowledge and skills level necessary to accomplish Company’s objectives. Develop departmental leaders for succession to higher levels or responsibility. Work closely with Director of Human Resources to design, develop, and implement departmental training and education programs.\nReviews progress with team members on a regular basis.\nWorks closely with the Production Manager and the Sweet Shop General Manager to assess present and future needs, trends, problems and opportunities for bakery operations within the company.Ø Develops, monitors, and reports on operating costs within functional areas. Alerts management of cost and labor over run. Makes recommendations and implements solutions to problems related to same.Provide leadership and guidance to management team, working collaboratively with team members to establish performance expectations necessary to achieve success.\nMaintain and high level of motivation and moral; attract and retain executive talent and evaluate performance\nDesign and implement business strategies, plans and procedures •\nSet comprehensive goals for performance and growth\nLead employees to encourage maximum performance and dedication\nEvaluate performance by analyzing and interpreting data and metricsSupports new product development and implementation strategies for the Company and its Skills",
    "Skills": [
        "SKILLS, EXPERIENCE & QUALIFICATIONS",
        "Bachelor's degree; 10+ years of related experience and/or training; combination of education, experience and training. MBA degree is preferred.\nKnowledge of bakery products and distribution experience is necessary.\nLeading a team of no less than six (6) direct reports, P/L responsibility experience desired.\nThe leadership style and mental agility to move effectively between strategic roles and hands-on execution roles.\nProven success developing effective, technical teams, attracting and developing top talent, and grooming next-generation leaders\nHave at least 10 years of progressively responsible experience in a food manufacturing company and have led a plant or the production department.\nKnowledge of GMP, HACCP, SQF, is preferred.\nAdditionally, the ideal candidate will be ethical, collaborative, have good business acumen, be someone who is comfortable rolling up his sleeves and “do” in addition to “manage”, have a strong customer orientation, be a stickler for quality and have the drive to make money (both for you and the company).\nUnderstanding of business functions such as HR, Finance, marketing etc.\nDemonstrable competency in strategic planning and business development\nWorking knowledge of data analysis and performance/operation metrics\nWorking knowledge of IT and MS Office\nOutstanding organizational and leadership abilities\nExcellent interpersonal skills\nAptitude in decision-making and problem-solving"
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 9",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Management Consulting; Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}