{
    "Job ID": "4758311",
    "Description": "General accountant - Fresh graduatesFinancial Record Keeping: Maintain accurate and up-to-date financial records, including accounts payable, accounts receivable, and general ledger entries.\nFinancial Reporting: Prepare timely and accurate financial statements, including balance sheets, income statements, and cash flow statements.\nJournal Entries: Record and classify financial transactions by preparing journal entries, ensuring proper coding and documentation.\nMonth-End and Year-End Close: Assist in month-end and year-end closing procedures, including accruals, adjustments, and reporting.\nCommunication: Work collaboratively with cross-functional teams to provide accurate financial information and support decision-making.Skills",
    "Skills": [
        "Skills and Qualifications:",
        "Education: Bachelor's degree in Accounting.\nEnglish language: Must be Proficient in the English language.\nAccounting Knowledge: Strong understanding of generally accepted accounting principles (GAAP) and financial reporting standards.\nDetail-Oriented: Meticulous attention to detail and accuracy in financial data entry, analysis, and reporting.\nCommunication: Effective verbal and written communication skills to interact with colleagues and stakeholders.\nTime Management: Excellent organizational skills to manage multiple tasks and meet deadlines.\nProblem-Solving: Strong problem-solving skills to identify and resolve discrepancies and issues.\nTeam Player: Ability to work collaboratively in a team environment and contribute to overall team goals.\nEthical Integrity: Maintain confidentiality and adhere to ethical accounting practices.\nAdaptability: Ability to adapt to changes in regulations, technology, and processes.\nMicrosoft Excel: Proficiency in Excel for data analysis, pivot tables, and financial modeling.\nMust be a fresh graduate or with less than a year of experience.\nIf you are a dedicated accounting professional with a passion for accuracy and financial integrity, we encourage you to apply and become a vital part of our finance team."
    ],
    "Preferred": {
        "Career Level": "Fresh Graduate",
        "Years of Experience": "Min: 0 Max: 2",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Certification / diploma",
        "Age": "Min: 18 Max: 25"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}