{
    "Job ID": "4758458",
    "Description": "Lead the classroom development and on-going maintenance of all training programs, course materials (theoretical and practical), procedures and assessments to satisfy the client and Awarding Body requirements.\nAssist the senior instructor in selecting and recruiting a suitable team of associates / assistants.\nEnsure that the equipment in the workshops and laboratories and areas suitable and adequate in number to complement the training and assessment. \nAssist in identifying and sourcing suitable redundant equipment from Operating Companies for training purposes. \nAssist in developing written and performance tests for assessing specialized training programs.\nPresent power point presentation to company staff in non-teaching days. \nDeliver Training \nAssess trainee portfolio’s to the agreed External Verifier and Awarding Body standards \nAssist in the training, development and certification of trainees as NVQ Assessors \nEnsure standards of all programs he is responsible for at the center and in the workplace (OJT) is maintained. \nIn coordination with the Senior Instructor, implement a suitable Internal Verification an assessment and Quality Assurance system to meet Awarding Body requirements and ensure that the quality of the programs is maintained \nImplement policies and procedures to ensure Quality Control is managed professionally and effectively \nDevelop and manage teaching and assessment schedules\nDiscipline the trainees he is responsible for when required\nCoach and train technicians where required\nCompile daily, weekly and monthly reports as required \nBe active in suggesting ways of continually improving the training programs.Skills",
    "Skills": [
        "·        Min. qualification – Technical / Engineering Diploma within the relevant subject",
        "3 years training experience\n5 years industrial experience within the oil & gas industry\nExcellent English language ability \nDesirable: Competence based assessment experience (e.g. NVQ) \nDesirable: A1 or V1 / D32 or D33 \nDesirable: Middle East experience \nDesirable: High level of IT (Windows based applications) and presentation skills in communications and instructional technique \nDesirable: Have completed either formal ‘Train the Trainer’ or Certified Trainer course\nMin. qualification – Technical / Engineering Diploma within the relevant subject\n3 years training experience\n5 years industrial experience within the oil & gas industry\nExcellent English language ability \nDesirable: Competence based assessment experience (e.g. NVQ) \nDesirable: A1 or V1 / D32 or D33 \nDesirable: Middle East experience \nDesirable: High level of IT (Windows based applications) and presentation skills in communications and instructional technique \nDesirable: Have completed either formal ‘Train the Trainer’ or Certified Trainer course\nTo work within the Company’s Quality Assurance procedures. \nMake self-aware of Health and Safety Regulations and uphold your responsibility to Health & Safety as an employee, pass on knowledge to Students and peers. \nTo be aware of actions necessary in cases of accident or fire. \nTo keep your work area clean, safe and Hazard Free. \nTo always act as an ambassador for the Company."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Gender": "Male",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Training & Education Center",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}