{
    "Job ID": "4758445",
    "Description": "·        Performs general cost accounting and other related duties.·        Prepares periodic (monthly) balance sheets, income statements, and profit and loss statements.·        Maintains the general ledger.·        Codes invoices, sets up new accounts, reconciles accounts, and closes the monthly books.·        Reconciles bank accounts at least monthly, verifies deposits, and addresses inquiries from banks.·        Reconciles customer accounts and manages accounts receivable collections.·        Verifies payment of invoices associated with accounts payable and ensures payments are charged to the appropriate accounts.·        Provides outside auditors with assistance; gathers necessary account information and documents to perform annual audit.·        Files required Zakat, VAT, & tax forms with government agencies.. Perform other related duties as assigned.e authenticity of the changes in vendor name and addresses and execute them.Skills",
    "Skills": [
        "Extensive knowledge of general financial accounting and cost accounting.\nUnderstanding of and ability to adhere to generally accepted accounting principles.\nHighly proficient with accounting software.\nExcellent organizational skills and attention to detail.\nExcellent written and verbal communication skills.\nProficient in Microsoft Office Suite.",
        "Education and Experience",
        "Bachelor’s Degree in Accounting, Finance, or related discipline required from a recognized university.\nOverall professional experience from 1-2 years in relevant industry experience/exposure.\nMust be registered as a member in SOCPA."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Rawdha, Ar, Jeddah , Saudi Arabia",
        "Company Industry": "Technical Maintenance & Repair",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}