{
    "Job ID": "4758508",
    "Description": "The incumbent will be responsible for the day-to-day management and implementation of the project, ensuring the practical application of best practices in project management.Core Responsibilities: Developing comprehensive/detailed project work plans that include all project activities and roles and responsibilities of the stakeholders and setting out corresponding milestones to ensure proper oversight and follow-up on project activities implementation. Coordinates the timely submission of project reports and financial documents to donors; provides guidelines, instructions, suggestions, and recommendations to Project Expeditor regarding operational and financial situations to ensure their alignment with agreement stipulations and reporting requirements; monitors project implementation in accordance with approved proposals, advises corrective actions to concerned parties; checks, inspects and ensures high quality and accuracy of final documents shared with donors; \n Coordinates the timely completion of the tasks along the project management cycle including assignment of a project code and preparation of a grant summary sheet upon signing of the agreement, allocation of funds under the project, extending recommendations to Finance colleagues to take financial actions related to treatment of remaining balances, interests, exchange rate, financial discrepancies related to issued financial statements, and closing completed projects once all donors’ requirements are met;\nLeads the process of revising, editing, consolidation and finalization of progress/final reporting packages to ensure compliance with donor and JRF policies and guidelines, consistency and coherence prior to the final submission to donors; \n Provides guidance for the regular update of information on grant agreements, reporting requirements, project chronology and contractual amendments for those projects included in the assigned portfolio of responsibilities; to keep all internal and external stakeholders informed of project progress and changes.\n Provides operational and technical guidance and recommendations to Project team, on projects related issues to ensure project fulfills its intended objectives and impact. This includes formulation of project proposals and progress/final reports in line with JRF guidelines and policies.\nResponsible for the day-to-day management of the project to ensure successful implementation of the work plans/ activities by the project team/activities.\nEstablishes and administers the project’s overall budget; monitors expenditures against the project financial resources in coordination with the Finance Department; to ensure overall project progress is on track.\nPrepares reports with updates on the progress of project implementation for key stakeholders; prepares presentations, drafts correspondence, and provides intermediate and final narrative reports in accordance with the agreement signed with the donor.\nEnsures the highest standard of monitoring and evaluation of the project by conducting periodic reviews to identify delays and gaps and recommend potential resolutions.\nProvides particular emphasis on Project Cycle Management techniques, development of logic frameworks in project management and “lessons learned”; to ensure develop the organizational capacity of the project;Managerial Responsibilities:Manages the team by taking part in recruiting team members, and evaluating their performance, providing feedback on an on-going basis, identifying development of needs in addition to coaching team members to ensure on-going capability development.\nIdentifies training needs and organizes trainings for the project team on various aspects on which the role holder has responsibilities to ensure the successful implementation of project activities.Skills",
    "Skills": [
        "Qualification:",
        "Bachelor’s Degree in Engineering, Business Administration, or any other relevant field.\nExcellent English and Arabic language skills (written and spoken).\n8-10 years of experience.\nProven experience in livelihood programming in a post-emergency context, private sector engagement or economic development;\nExperience working in Jordan with a range of local partners in the field of economic empowerment and/ or livelihoods\nExperience with team management and technical support;\nExperience with project cycle management and project management tools such as logical frameworks, work plans, and monitoring plans."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}