{
    "Job ID": "4758803",
    "Description": "Company: YPerformanceLocation: AjmanAre you a creative powerhouse with a passion for automotive excellence? Do you have a knack for capturing the beauty and excitement of automobiles through stunning photos and engaging videos? If so, we want YOU to join our dynamic team as a Digital Creator!About Us:YPerformance is a leading name in the automotive industry, known for our commitment to innovation, cutting-edge technology, and a passion for automobiles that's second to none. We take pride in delivering top-notch vehicles that redefine the driving experience. As we continue to grow, we're seeking a talented Digital Creator to help us showcase our automotive masterpieces to the world.Position Overview:As a Digital Creator at YPerformance, you'll be at the forefront of our digital marketing efforts. You will play a key role in capturing the essence of our vehicles through compelling photos and videos, and bringing them to life across various digital platforms. Your creativity will be instrumental in elevating our brand and driving engagement with our target audience.Key Responsibilities:Conceptualize and create visually stunning photos and videos of our vehicles.\nCollaborate with the marketing team to develop content ideas and strategies.\nShoot and edit high-quality video content for promotional purposes.\nCreate stunning marketing contents for products and automotive things.\nManage and maintain digital media assets, including photo and video libraries.\nStay up-to-date with industry trends and incorporate innovative techniques into your work.\nEnsure brand consistency and adherence to visual guidelines.Qualifications:Proven experience in digital content creation, with a strong portfolio showcasing your photo and videography skills.\nProficiency in photography and videography equipment and software.\nA deep passion for automobiles and an understanding of automotive culture.\nStrong creative and storytelling skills.\nAbility to work independently and as part of a team.\nExcellent attention to detail and the ability to meet deadlines.Benefits:Competitive salary and benefits package.\nOpportunity to work with cutting-edge automotive technology and products.\nCollaborative and innovative work environment.\nCareer growth and development opportunities.Skills",
    "Skills": [
        "Photography Skills: A strong understanding of photography fundamentals, including composition, lighting, framing, and camera settings, is crucial for capturing high-quality images of automobiles.\nVideography Skills: Proficiency in shooting and editing videos, including knowledge of video equipment, camera angles, and video editing software, is essential for creating engaging promotional content.\nCreativity: The ability to think creatively and come up with unique and visually appealing content ideas that align with the brand's image and message.\nTechnical Proficiency: Familiarity with photography and videography equipment, such as cameras, lenses, tripods, and lighting equipment, as well as expertise in editing software like Adobe Creative Suite (e.g., Photoshop, Premiere Pro) is important.\nAutomotive Knowledge: A passion for and understanding of automobiles, including their features, design, and industry trends, to effectively communicate the essence of the vehicles in your content.\nAttention to Detail: The ability to pay close attention to detail when capturing and editing photos and videos to ensure high-quality output.\nStoryboarding and Planning: The skill to plan and storyboard video content to ensure a clear and compelling narrative.\nCollaboration: Effective communication and teamwork skills to collaborate with marketing teams and other stakeholders in content planning and execution.\nAdaptability: The ability to adapt to different shooting conditions, such as outdoor and studio settings, and adjust your creative approach as needed.\nTime Management: Strong time management skills to meet deadlines and manage multiple projects simultaneously.\nUnderstanding of Branding: A grasp of the company's brand guidelines and the ability to maintain brand consistency in all visual content.\nContinuous Learning: Willingness to stay updated on the latest trends and techniques in photography and videography, especially as they pertain to automotive marketing.\nDigital Marketing Knowledge: Basic knowledge of digital marketing principles and how visual content contributes to marketing strategies.\nProblem-Solving: The ability to troubleshoot technical issues that may arise during photo and video shoots.\nOrganization: Efficient organization of digital media assets, including photos and videos, for easy retrieval and use in various marketing campaigns."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5"
    },
    "Data": {
        "Job Location": "Ajman, United Arab Emirates",
        "Company Industry": "Automotive Repair, Spare Parts, & Support Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}