{
    "Job ID": "4758538",
    "Description": "V. MINIMUM REQUIREMENTS AND QUALIFICATIONS\nBachelor of Engineering degree in Electrical Engineering\nMinimum of 10 years of experience in electrical construction management, with a focus on high voltage 380kv Substations, Overhead Transmission lines and underground cable systems\nExperience working in Saudi Arabia with the Saudi Electric Supply Company is a plus.\nExperience working on projects involving overhead transmission lines in hilly terrain is a plus.\nExperience in project management, including managing budgets and schedules.\nStrong leadership and Excellent communication and interpersonal skills, with the ability to collaborate effectively with team members, contractors, and clients.\nAbility to work effectively in a team environment.\nProficiency in Microsoft Office and project management software\nBachelor’s degree in electrical engineering\nStrong understanding of electrical engineering principles and high voltage electrical systems\nExperience managing projects from concept to completion, including project planning, budgeting, and resource management.\nAbility to identify and mitigate project risks and issues.\nStrong leadership and mentorship skills, with a focus on developing and motivating team members to achieve project objectives.\nRisk Management, change management and Interface Management:\nExperience in identifying, mitigating, and managing project risks to minimize project delays, costs, and safety hazards.\nProblem Solving: Strong problem-solving skills, with the ability to troubleshoot issues and make effective decisions to ensure successful project delivery.\nExperience in working with other disciplines such as Civil/ Structural and Environmental Engineers to design electrical installation.\nExperience of managing stakeholders of the project (Contractor/Client/Govt. Entities)\nKnowledge on HS&E & Quality procedures, Knowledge of health, safety, and environmental regulations and requirements\n VI. ORGANIZATION CHART\nDirect Reporting to Project Manager Transmission SystemsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}