{
    "Job ID": "4758456",
    "Description": "The post holder will be assisting the team of Education Advisers in promoting courses offered by partner Universities, Colleges and Schools to students of all ages and counsel them to choose the right course/institution for them• Promotion: Responsible for promoting English language placement at schools in the English-speaking countries and all related activities; like preparing price lists, running promotional events, visiting potential clients.• Targeting corporate clients for groups and corporate business in the field of English language placement and testing. This includes developing packages that suits clients and running events.• Sales: Generate sales leads through communication with travel agents, schools and corporate clients. The products to be promoted are English language placement for individuals, groups of students and local delivery of training. The sales of English language assessment for corporate clients.• Relationship Building: Identify, develop & grow new and existing relationships with target institutions/companies that could result in sales/marketing for our products.• Market Analysis & Benchmarking: Collect market information that would lead to developments of products and services, and sometimes, report to our partner institutions in the UK.• Coordination: Coordinating with the office manager and Director to achieve timely execution of business plans and evaluating risks. Actively and successfully manage the sales process.Skills",
    "Skills": [
        "Good communication skills\nExcellent written and spoken English language\nPresentation skills\nTeam working"
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 5",
        "Residence Location": "Eastern Province, Saudi Arabia ; Jeddah , Saudi Arabia ; Riyadh, Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 20 Max: 30"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "3"
    }
}