{
    "Job ID": "4758645",
    "Description": "Responsibilities:• Collaborate with the marketing team and clients to understand project requirements and objectives.• Create visually appealing designs for various mediums, including print, digital, and multimedia platforms.• Develop unique concepts, selecting colors, typography, imagery, and layout techniques to deliver impactful designs.• Ensure all designs align with the brand identity and effectively convey the desired message.• Utilize Adobe Creative Suite (Photoshop, Illustrator) and other relevant software to produce high-quality designs.• Stay updated on design trends, industry best practices, and emerging technologies.• Manage multiple projects simultaneously while meeting deadlines and maintaining attention to detail.• Communicating with clients about layout and design.Skills",
    "Skills": [
        "Requirements:",
        "• A bachelor's degree in Graphic Design or a related field.",
        "• Proven experience as a Graphic Designer or in a similar role",
        "• Proficient in Adobe Creative Suite (Photoshop, Illustrator).",
        "• A strong portfolio demonstrating a diverse range of design projects.",
        "• A solid understanding of design principles, composition, and typography.",
        "• Excellent communication and collaboration skills.",
        "• Ability to work independently and as part of a team.",
        "• Detail-oriented with strong time management skills."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 2",
        "Gender": "Female",
        "Nationality": "India; Philippines",
        "Age": "Min: 18 Max: 30"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Graphic Design",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}