{
    "Job ID": "4758513",
    "Description": "Job Purpose:Responsible for ensuring the insurance operations pertaining to all Call Centre Pharmacies within Al-Hajery, in addition to monitoring productivity and standards, planning and monitoring work flow and project assignments, in line with Mohamad Al Hajery & Sons set Policies & Procedures.Policies and ProceduresImplement the Department’s policies and follow the set procedures in order to achieve the Division objectives.ActivitiesProcess claims from receipt, entering details on appropriate computer and manual records systems, corresponding with claimants, their representatives, loss adjusters, contractors and managers as necessary, taking the lead in resolving problems and ensuring efficient execution in MNH best interests.\nEnsure all high value and/or complex claims are passed referred to the Direct Report for involvement, advice, and/or authorization as required.\nMaintain records of claims history for relevant policies and identify any significant trends (good or bad) for the attention of line management.\nClaim creation for all Pharmacies branches from the call centre with the support of all call centre pharmacists.\nClaim insurance auditing for all the pharmacies before submitting to insurance companies and preparing statement.\nReceive the rejection sheets for correction and resubmit it again to the insurance companies.\nReceive the reconciliation sheets to know the final rejections and sort it according to responsibilities for these rejections.\nTrain all the pharmacists, call centre and new joiners with different insurance online platforms.\nMaintain a working knowledge of all relevant insurance policies, both externally and internally.\nEnsure information for renewals and declarations of externally insured policies collected and reported within timescales.\nLiaise with both internal departments and external professionals and keep relevant records of cover complete and up to date for new terms.\nEnsure that any changes in external interests are dealt with promptly and reported to the Direct Report.\nCollect information on all relevant loss and potential loss incidents and input the data to the claims handling computer system.\nPerform other duties related to the job as assigned by the Direct Manager.Skills",
    "Skills": [
        "Educational Qualification",
        "Bachelor Degree in Pharmacy, or related field.",
        "Work Experience",
        "Minimum of 2 - 4 years of experience in the same or related field.",
        "Behavioural Competencies",
        "Communication Skills\nAccountability\nDetail Oriented\nInitiative\nOrganizing and Planning Skills",
        "Language Skills",
        "Proficiency in English and Arabic languages."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Other Healthcare Services; Insurance & TPA; Medical Hospital",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}