{
    "Job ID": "4758509",
    "Description": "Title: Luxury Real Estate AgentLocation: DubaiCompany: ABH Real EstateCompany Description:A leading Real Estate agency based in Dubai & Qatar, focused on Luxury properties, awarded best luxury Real estate brokerage for 2022 & 2023 and most lead generated winner on Property Finder for 2021.Job Description:We are seeking experienced and motivated real estate agents to join our team. As a real estate agent, you will be responsible for assisting clients in buying, selling, and renting properties, as well as negotiating contracts and managing client relationships. You will work closely with other members of the team to provide excellent customer service and help clients find what they seek.RESPONSIBILITIES:Assist clients in buying, selling, and renting properties\nConduct property showings\nNegotiate contracts and agreements\nPrepare and deliver client presentations\nProvide excellent customer service and maintain strong client relationships\nWork closely with other team members to ensure smooth transactions and positive outcomes for clients\nAttend team meetings and training sessions as requiredUNIQUE BENEFITS YOU WILL GET:Qualified leads\nCompetent Administrative And Marketing Support\nAn Attractive Remuneration\nTraining and supportive work environSkills",
    "Skills": [
        "Proven track record of excellent sales skills\nKnowledge in GCC market and sales\nStrong communication, closing and negotiation skills\nFluent in English\nPreferably Valid driving license and car\nGood customer service skills\nSelf-motivated and driven to succeed\nAbility to work independently and as part of a team\nStrong organizational and time management skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}