{
    "Job ID": "4758718",
    "Description": "Job Title: Secretary and AdministratorLocation: Al Ain, UAEPosition Type: Full-timeAbout Us:Al Sahab Trading is a plastic and irrigation accessories products trading company. We are seeking a highly organized and detail-oriented Secretary and Administrator to join our team. This individual will play a crucial role in ensuring smooth day-to-day operations by efficiently handling phone calls, date-entry of invoices, quotations, and email correspondence.Key Responsibilities:Phone Management:Answer and direct incoming phone calls in a professional and friendly manner.\nTake detailed messages and ensure they reach the appropriate person promptly.Invoice Processing:Accurately enter and process invoices into the company's system.\nVerify invoice information for accuracy, including pricing, quantities, and product details.Quotation and Proforma Invoice Preparation:Generate quotations and proforma invoices for potential clients, ensuring accuracy and timeliness.\nCollaborate with relevant departments to gather necessary information for quotations.Email Correspondence:Respond to emails in a timely and professional manner.\nSort and prioritize incoming emails, forwarding them to the relevant departments as needed.General Administrative Support:Assist with various administrative tasks such as filing, data entry, and office organization.\nCoordinate meetings and appointments, ensuring everyone's schedule aligns.Maintain Documentation:Organize and maintain physical and electronic records for easy access and retrieval.Collaboration and Communication:Work closely with team members and communicate effectively to ensure seamless operations.\nLiaise with clients, vendors, and internal departments as necessary.Skills",
    "Skills": [
        "Qualifications:",
        "Should be located in Al Ain City or willing to shift.\nProven experience in a similar administrative or secretarial role.\nProficient in using office software and systems, including MS Office Suite, email clients, and invoicing software.\nStrong organizational and multitasking skills with keen attention to detail.\nExcellent verbal and written communication skills.\nAbility to prioritize tasks and meet deadlines.\nProfessional and courteous demeanor, especially when handling phone calls and client interactions.",
        "Education:",
        "High school diploma or equivalent. Additional relevant certifications or courses in office administration are a plus."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 1",
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Arab Countries; Philippines",
        "Degree": "High school or equivalent",
        "Age": "Min: 18 Max: 35"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Manufacturing; Trading & Commodity Trading",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}