{
    "Job ID": "4758421",
    "Description": "Lead the Key Account sales team and manage day to day operations within budgeted guidelines and to the highest standards.\nSet monthly sales targets, KPI’s, sales objectives for Key Account team.\nReview and make sales analysis on daily, monthly basis (salesman - Customer - Item - Category) and take actions based on it.\nFollow up daily customer’s LPO’s, deliveries and returns.\nSet weekly meetings with supervisors and salesmen, Communicate new plans, monthly targets, sales reports.\nSet the annual forecast for Key Account (SKU, category, customer).\nPrepare the route plan for salesmen and sales supervisors to ensure the best product coverage for Key Accounts branches.\nPrepare the monthly plan for promotions and special offers along with Buying/Purchasing Managers.\nParticipate in the creation of POS material and ensure that it is applied in stores.\nMake Control on FOC, Returns, debit notes and credit notes.\nPlan and execute marketing plans, promotions, taste sampling to increase brand awareness.\nNegotiate annual contracts, monthly rental contracts, special events participation with\nBuying/Category Managers.\nSet Annual budget, Target, Forecast for Key Accounts.\nPrepare ROI report for each account quarterly.\nParticipate in business development, product development plans, new products launching, P&L monthly analysis.\nSet sales objectives and project expected sales volume for existing and new products.\nSupport the creation of a business plan for each individual sales area / person, ensuring a focus on core customers, prospects, and vertical markets.\nSupervising staff to ensure that they perform the correct tasks to prescribed standards.\nMonitoring random negotiations to discern whether employees are adopting effective sales techniques.\nEnsuring that staff members are reimbursed for work-related purchases.\nMaintaining contact with clients to better understand and fulfill their needs.\nUsing insights derived from performance reviews and market research to tweak systems, as needed.Skills",
    "Skills": [
        "Communication Skills\nLeadership\nRelationship Building\nAnalytical & Problem Solving\nNegotiation\nMarket Knowledge"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 7",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}