{
    "Job ID": "4758343",
    "Description": "We are a reputable Qatari company with diverse interests, including conference and exhibition organization. We are looking for dedicated and dynamic female/male marketing and sales professionals (Indoor/Outdoor) who will be managing customer accounts to join our team immediately. Responsibilities:• Deliver outstanding results by executing effective marketing and sales strategies daily, weekly, and monthly.• Identify potential customers through phone calls, appointments, and in-person meetings, and adeptly present project details within two minutes if needed.• Develop a clear and practical marketing plan outlining your approach.• Organize daily schedules and prospects for potential customers to carry out effective customer visits.• Cultivate strong client relationships through trust, punctuality, and effective communication, offering exceptional service and guidance to achieve desired outcomes.• Address inquiries, suggestions, and client requirements, adeptly handling objections and finding solutions.• Provide daily and weekly reports detailing progress and results from your contacts and meetings.• Collaborate with fellow sales representatives to prevent workflow duplication and resolve issues.• Maintain professionalism in written communication, including email correspondence.Skills",
    "Skills": [
        "Required Skills and Experience:",
        "• 3-5 years of sales experience (outdoor) within the Qatari market, preferably in exhibitions and advertising.",
        "• Proficiency in persuasion, marketing, and sales, with excellent communication, interpersonal, problem-solving, presentation, organizational, and managerial skills.",
        "• Educational background: University degree or equivalent.",
        "• Proficiency in English, and preferably Arabic.",
        "• Competency in using computer programs and generating reports.",
        "• Access to a private vehicle or car rental.",
        "• Valid Qatari identity card. Salary and commission details will be determined after a successful personal interview."
    ],
    "Preferred": {
        "Residence Location": "Qatar",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Advertising; Marketing; Events Management",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}