{
    "Job ID": "4758257",
    "Description": "We are looking for dynamic and experienced Sales Executives to join our team. As the exclusive producer of PolyCarboxylate Ether (PCE), a cutting-edge superplasticizer in concrete technology in Saudi Arabia, we are at the forefront of innovation in the construction chemical industry. If you have a deep understanding of construction chemicals, the construction industry lifecycle, cement and concrete manufacturing, and a proven track record in sales and marketing, we want to hear from you.The sales positions are open for the Central Region (Riyadh), Western Region (Jeddah), Northern Region (Tabuk), and Southern Region.Key Responsibilities:Market Expansion: Identify and explore sales opportunities for PCE across designated regions in Saudi Arabia.\nProduct Expertise: Develop a comprehensive understanding of PCE and its applications in the construction industry to effectively communicate its value to clients.\nClient Relationship: Build and maintain strong relationships with clients, contractors, architects, and other key stakeholders in the construction sector.\nSales Growth: Achieve and exceed sales targets through effective sales strategies, lead generation, and pipeline management.\nMarket Research: Stay informed about industry trends, competitors, and market conditions to make data-driven decisions.\nTechnical Support: Provide technical support and solutions to clients, offering insights into the benefits of PCE in concrete technology.\nReporting: Generate and submit regular sales reports, forecasts, and market analyses to the management team.Skills",
    "Skills": [
        "Bachelor's degree in a relevant field (Material/Civil/Chemical/Industrial Engineering or Business Administration preferred).\nMinimum of 5 years of experience in sales and marketing within the construction chemicals industry, with a strong understanding of cement and concrete manufacturing processes.\nFamiliarity with the construction industry lifecycle and key players in Saudi Arabia and the region.\nProven success in achieving and exceeding sales targets.\nExceptional communication and negotiation skills.\nStrong problem-solving abilities and a solutions-oriented approach.\nWillingness to travel within Saudi Arabia as needed.\nValid Saudi driver's license.\nFluency in English is a mandatory requirement and proficiency in Arabic is a strong preference.",
        "About Us:",
        "TriStar Technical Co. is the pioneering and exclusive producer of PolyCarboxylate Ether (PCE), an advanced superplasticizer in concrete technology, in Saudi Arabia. As industry leaders, we are committed to innovation, quality, and sustainable business practices."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture; Construction & Building; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}