{
    "Job ID": "4758243",
    "Description": "We seek a dynamic and experienced Human Resources Manager to join our team. The ideal candidate will be a strategic thinker, well-versed in HR best practices, and knowledgeable about Saudi labor laws and regulations. In addition to HR expertise, the candidate should excel in administrative and government relations management.Key Responsibilities:HR Strategy: Develop and implement HR strategies aligned with company objectives. Ensure HR policies and practices comply with Saudi labor laws.\nTalent Acquisition: Oversee recruitment efforts, including sourcing, interviewing, and onboarding. Collaborate with department heads to identify staffing needs.\nEmployee Relations: Foster a positive workplace culture. Handle employee grievances, disputes, and disciplinary matters professionally and impartially.\nPerformance Management: Implement performance appraisal systems and strategies to enhance employee productivity and growth.\nTraining and Development: Identify training needs, plan and execute training programs to enhance employee skills and competencies.\nCompensation and Benefits: Manage compensation and benefits programs. Ensure competitiveness and compliance with industry standards.\nGovernment Relations: Develop and maintain strong relationships with government agencies and authorities. Stay updated on industry norms, regulations, and labor laws.\nAdministrative Management: Oversee administrative functions, including facilities, office management, and vendor relationships.\nCreative Problem-Solving: Approach HR and administrative challenges with a creative and solutions-oriented mindset.Skills",
    "Skills": [
        "Bachelor's degree in Human Resources Management, Business Administration, or related field (Master's degree preferred).\nProven experience as an HR Manager with a minimum of 5 years in Saudi Arabia.\nStrong knowledge of Saudi labor laws, regulations, and industry norms.\nExcellent communication and interpersonal skills.\nA positive and proactive approach to HR and administrative challenges.\nCreative thinking and problem-solving abilities.\nExceptional organizational and multitasking skills.\nStrong leadership and team management capabilities.\nAbility to maintain confidentiality and act with integrity.\nFluency in English is a mandatory requirement and proficiency in Arabic is a strong preference.",
        "About Us:",
        "TriStar Technical Co. is the pioneering and exclusive producer of PolyCarboxylate Ether (PCE), an advanced superplasticizer in concrete technology, in Saudi Arabia. As industry leaders, we are committed to innovation, quality, and sustainable business practices."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Chemicals Manufacture; Construction & Building; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}