{
    "Job ID": "4758331",
    "Description": "Join the ZOOBA Team and Be Part of Something Extraordinary!About ZOOBA:ZOOBA is not just a restaurant; it's a global culinary sensation that's redefining Egyptian street food on the world stage. We've earned our place as the #1 restaurant in Egypt and ranked #9 in the MENA region on the World's 50 Best Restaurants list. At ZOOBA, we've transformed traditional Egyptian street food into a celebration of flavors, quality, and culture. Our journey began in Zamalek, Cairo, in March 2012, with a vision to showcase the authentic, wholesome nature of Egyptian street food while prioritizing cleanliness, safety, and the freshest all-natural local ingredients.Our brand is a vibrant tribute to Egyptian street food culture. We firmly believe that Egyptian street food stands among the world's best, and through ZOOBA, we are on a mission to proudly share Egypt's unique street dishes with the world. Our menu offers traditional favorites and innovative creations that capture the essence of Egypt's lively streets – a fusion of color, sound, and originality.Join Our Team:At ZOOBA, our people are the heart and soul of our brand. We understand that our success depends on the dedication and passion of every member of our team. From the moment guests step into ZOOBA, our employees create the entire experience – from the ambiance to the food, ensuring every detail aligns with our core values. Our commitment to our employees' growth and development means that when you join us, you become part of a team that cares about your success.As a Line Cook at ZOOBA, you'll play a crucial role in our kitchen, responsible for preparing and cooking our delicious Egyptian-inspired dishes. Your primary responsibilities will include:Preparing and cooking food items according to our recipes and quality standards.\nOperating various kitchen equipment and utensils effectively.\nEnsuring the freshness and quality of ingredients used.\nMaintaining a clean and organized kitchen work area.\nCollaborating with the kitchen team to meet customer orders efficiently.\nAdhering to food safety and sanitation guidelines.\nAssisting in inventory management and restocking supplies.Skills",
    "Skills": [
        "Prior experience in a kitchen or culinary environment is preferred.\nKnowledge of cooking techniques and food preparation methods.\nAbility to work in a high-pressure, fast-paced kitchen.\nAttention to detail and a commitment to food quality.\nKnowledge of food safety and sanitation standards.\nFlexibility to work evenings, weekends, and holidays as needed."
    ],
    "Preferred": {
        "Residence Location": "Kuwait",
        "Degree": "High school or equivalent"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Catering, Food Service, & Restaurant; Food & Beverage Production",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "30"
    }
}