{
    "Job ID": "4758561",
    "Description": "Reporting to Commissioning Process & Piping Lead is responsible for managing process and HVAC and Mechanical Commissioning during preparation and execution stage of Offshore Project to ensure objectives are safely met within the approved scope and schedule.\nCommissioning Mechanical HVAC Specialist shall ensure that all his scope of work is completed in accordance with safety and quality standards applicable.\nFocal point for Mechanical and HVAC activities starting from preparation stage to final acceptance, for promoting and implementing of system completion and system completion database at site, Implement system completion including reporting, monitoring and control.\nLead execution for Mechanical and HVAC at site (onshore/ offshore) and keep commissioning execution committed to targets defined by the project management. Review and approval of commissioning deliverable provided by EPC Contractor\nChampion initiatives with the Contractor to deliver on the project objectives i.e. safety, quality, cost and schedule and review for contractor’s commissioning execution effort and provide recommendations as necessary.\nProvide guidance and timely review on contractor’s commissioning execution plan and processes verifying fitness for purpose and compliance with contract requirements including codes and standards.\nEnsure coordination and communication for site activities with other discipline such as construction, Hook up and Completion Team and SHE representative and provide technical support with contractor, quality, safety, planning, engineering and start up/ performance testing.\nReview, approve and implement Commissioning system completion and commissioning technical documents prepared by EPC Contractor.\nEnsure Contractor Commissioning submitted all documents as per schedule and timely reviewed and approved in accordance with the EPC contract requirements.\nReview and propose mitigation for Commissioning aspects of the Risk Management Plan and Monitor the mitigation when defined. Review all Commissioning changes, including justification for cost and schedule impacts, in accordance with the PMOC procedure. Maintain a register of lessons learned.Skills",
    "Skills": [
        "commissioning mechanical HVAC specialist"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}