{
    "Job ID": "4758241",
    "Description": "The Senior Cost Accountant is responsible for minimising costs, managing the day-to-day operation and calculating costs of food and beverage & Handicrafts items. Record information and produce control reports periodically to help maintain a suitable inventory of items. Core Responsibilities:Prepares and analyzes food and beverage and Handicrafts costs on a monthly basis and recommends alternatives to improve costs\nAssists in changing price menus or changing the prices of certain items based on the information collected To make sure we are inline with the budgeted COGS\nAssists in the monthly inventories count and extension this needs to be removed\n Establishes and maintains a database for inventory stock including up-to-date pricing to ensures proper storage and issuance of all items.\n Establishes and maintains a cost allocation transfer system for the supplies to the various departments. Summarizes these transactions for each financial period close to ensure it is inline with budgets\nCosts all food and beverage & Handicrafts remove handicrafts items and where practical, input these costs into the point of sales system and generates monthly potential cost of sales\nMaintains a daily record of inventory purchased for every chart of account and ensures it is balanced with account payable this should be removed\n Organizes and do stock take and monthly closing procedures and to prepare all journals. And Prepares cost board and the related journal vouchers this should be removed\nChecks invoices against receiving records and compares them with purchase orders and purchase requests, to ensure that all invoices are stamped and signed by the authorized person. This should be removed\nChecks and ensure that all inventories purchased are in balance with accounts payable on a bi-monthly basis. This should be removed\nEnsures that the purchaser obtains up–to–date and accurate prices by comparing prices against suppliers’ quotations.\nAudits monthly stock and prepares reconciliation on all stockrooms this should be removed\n Posts actual stock results in the system and prints inventory valuation report this should be removed\nOrganizes the bi-yearly stock –takes on all operating equipment of the kitchen and prepares detailed loss and breakage quantities and amount. this should be removed\nMatches the release forms and transfer forms from the main warehouse issued by Oracle with receiving forms issued by Aloha for both Al-Nasir Kitchen (including its sections: Hot/Frozen/Ma’moul/Pastries) and the Restaurant. this should be removed\n Matches release forms and transfer forms from Al-Nasir Kitchen (including its sections: hot/frozen/ Ma’moul/Pastries) issued by Aloha with receiving forms issued by Aloha for the Restaurant and the Showroom this should be removed.\n Reviews all the daily reports (sales/inventory/costs) and provides the direct manager with differences if any that should be removed.\nAttends the monthly inventory counts and submits the inventory count for the kitchen, restaurant and cafeteria on both Aloha and Oracle, in addition to checking the damaged materials on a monthly basis with its permissible percentage and inspecting the damaged materials. This should be removed.\n Prepares and reviews all the recipes which required to calculate their costs and prices to make sure they are in line with the COGS budget\n Attends the process of preparing all the new recipes which required to be added to the menu and calculates their costs to ensure the accuracy of the actual quantities spent in each recipe to calculate the price and the cost of it.\n Prepares cost/profit remove profit reports for the Kitchen, Handicrafts, IKEA & remove handicraft and IKEA Restaurant and analyzes the cost ratios on a monthly basis to ensure they are in line with the budget\n Helps to prepare the annual budget for the F&B sector\n Responsible for the short and long-term planning of the F&B controlling and pricing aspects to ensure it is in line with SE strategy.\n Prepare variance analysis for food & beverage and communicate with relevant parties.\nCheck the menu pricing on the POS systems and ensure the correct prices are loaded\n Continuously study weaknesses in F&B controls implemented and provide suggestions for improvements.\nCheck the daily Food & Beverage revenues report submitted by the income audit for the accuracy of covers and average check.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's Degree in Accounting, Banking & Finance or another related field.\nCMA/CPA certificate is preferred.\nStrong English and Arabic language skills (written and spoken).\n5 – 8  years of experience.\nSolid experience in the F&B industry in a similar position.\nExperience with general ledger functions and the end-of-month/year closing process."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Accounting; Non-profit Organization; Financial Services",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}