{
    "Job ID": "4758417",
    "Description": "Important Requirement: Two years minimum experience in successfully registering & prequalifying companies with major UAE National Oil Companies such as ADNOC, & main EPC contractors in the UAEPrimary Responsibilities:1. Business Development:One of the very important duties is to increase the organization's visibility with diverse clients by proactively & successfully registering & prequalifying with major & key National Oil Companies, International Oil Companies, & main EPC contractors in the UAE. Maintained an extensive network of contacts to ensure inclusion in their Approved Vendor’s / Contractor’s List for required work categories resulting in increased eligibility in participating in Tenders/ Bid exercises. Increase the number of RFIs / RFQs participated as well through extensive scanning of the market for new and upcoming tenders (via clients e-sourcing / e-procurement portals monitoring, websites, research databases, and news).\ncarrying out specific projects and research\ntaking responsibility of accounts and budgets\nworking more closely with management if taking on some of the CEO's responsibilities\ndeputizing for the CEO, making decisions, and delegating work to others in the CEO's absence\nbeing involved in decision-making processes.2. Administrative Support:As a PA, you're often a CEO's first point of contact with people from both inside and outside the organization. Tasks will include:devising/maintaining office systems, including data management and filing\narranging travel, visas, and accommodation, and occasionally travelling inside the UAE with the CEO to take notes or dictation at meetings or to provide general assistance during presentations\nscreening phone calls, enquiries, and requests, and handling them when appropriate meeting and greeting visitors at all levels of seniority.\norganizing and maintaining diaries and making appointments\ndealing with incoming email, faxes, and post, often corresponding on behalf of the CEO\ncarrying out background research and presenting findings\nproducing documents, briefing papers, reports, and presentations\norganizing and attending meetings and ensuring the CEO is well prepared for meetings\nliaising with clients, suppliers, and other staff.Working hoursYou'll generally work from 9am to 6pm, Mondays to Saturdays.What to expectThere is frequent contact with people, either by phone, email or in person.\nThe job may be very stressful at times, as it can sometimes involve dealing with difficult or demanding people, often at very senior levels, and the work is always focused on the needs of the manager. Being a PA means working very closely with one person and any problems they are having with their work may impact on you.Skills",
    "Skills": [
        "Skills",
        "In addition to relevant experience and secretarial and administrative knowledge, you'll need to show evidence of the following:",
        "exceptional written and oral communication skills\nexceptional company registration and prequalification with major UAE National Oil Companies such as ADNOC, main EPC contractors\nexcellent word processing and IT skills, including knowledge of a range of software packages the ability to work under pressure and to tight deadlines\ngood organizational and time management skills\nthe ability to research, digest, analyses, and present material clearly and concisely excellent interpersonal skills\nthe ability to work on your own initiative honesty and reliability\nattention to detail\nflexibility and adaptability to juggle a range of different tasks and to work extra hours to meet deadlines discretion and an understanding of confidentiality issues."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}