{
    "Job ID": "4759566",
    "Description": "Required Skills to be successful:Job-Specific Technical Skills:Should possess hands-on experience in the installation, configuration, and commissioning of AV Systems, including Speakers, Amplifiers, Projection systems, Direct LED Displays, Video walls, Control Systems, and Automation Systems.\nHave a mechanical aptitude and demonstrate a clear understanding of AUDIO & VIDEO systems installation methods and best practices.\nKnowledge of various components and sub-components of AUDIO & VIDEO System, especially Extron Crestron, AMX, BIAMP etc. \nDetailed working knowledge and experience in Operations and Maintenance of AUDIO & VIDEO systems\nFault Finding & troubleshooting skills in AUDIO & VIDEO Systems.\nGeneral knowledge and experience of Electrical Safety Rules and procedures.\nThe ability to accurately read and interpret drawings & schematics.\nExperience with other technology systems, such as Structure cabling & AV, is a plus.\nTechnical training & certifications from manufacturers on AUDIO & VIDEO System is a plus.\nCrestron, Extron, AMX, BOSE, BIAMP programming skills is a plus. Behavioural Competencies :Detail-oriented and strong analytical skills.\nExcellent problem-solving skills\nExcellent interpersonal skills\nExcellent time management.\nAbility to work extended hours (overtime/weekends) as needed.\nAbility to be scheduled for on-call status if or as needed.\nThe position may require daily travel to worksites, and employees must be able to get to worksites independently.\nProvide professional and courteous interaction with customers.\nTeam Player.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}