{
    "Job ID": "4759504",
    "Description": "Required skills to be successfulExperience in end to end implementations of SAP Treasury Solution and integrate the same with SAP Finance ERP\nThe candidate should have expert functional and configuration knowledge in SAP S4 HANA solutions related to SAP Treasury and Risk Management (TRM), In-House Cash (IHC), Bank Communication Management (BCM) and Cash Management (CM)\nIn-depth working knowledge in Green field implementation, Roll-outs, Upgrades, Data Migration related to SAP Treasury Solutions mentioned above\nUnderstand the business requirements and translate it into functional and technical specifications\nExperience in designing and deploying Transaction Manager (incl. Money Market, Facilities and Loans, FX, Derivatives, Trade Finance -Letters of Credit, Bank Guarantees), Risk Analyser (Credit Risk Analyser and Market Risk Analyser), Exposure Management and Hedge Management\nExperience in designing and deploying Cash Pooling and Netting Solution and Central Payment Factory\nExperience in designing and deploying solutions for various payments channels such as SWIFT and Host to Host Payments\nExperience in designing and deploying reporting solution in Treasury function for limit utilisation reporting, facility utilisation reporting and exposure reporting\nUnderstand dependency between SAP Treasury Solution and Integration with other SAP modules i.e. SAP Finance and Controlling and external applications such as SWIFT Service Bureau / SWIFT Network and Trade Finance solution\nStrong business process knowledge in Treasury function where the functional organisation is divided into Front-Office, Middle-Office and Back Office\nProficient in design, deliver and manage the customized ABAP solutions (incl. custom reports) and interfaces with 3rd party systems.\nExperience in conducting Super User and End User Trainings\nExperience in creating and publishing end user training manuals\nGood understanding in authorisation controls related to SAP Treasury solution What equips you for the roleCollege or University degree in Finance/Accounting/IT or a related discipline\nMinimum of (5) years of experience in the design, configuration, testing, debugging, delivery and support of SAP Treasury and Risk management processes, and full SAP project life cycles of significant size, scope and complexity\nIntermediate to in-depth knowledge of SAP Finance is essential\nSAP Finance certification will be a plus Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}