{
    "Job ID": "4759092",
    "Description": "We're looking for a FIT OUT Site Supervisor with at least a minimum of 4-6YEARS of experience in the same field in an interior company.Responsibilities:*Supervising experience in Fit-Out interior works (Factory and site).*Knowledge of drawings and implementing to site.*Inspecting construction sites regularly to identify and eliminate potential safety hazards.*Supervising and instructing the construction team as well as subcontractors.*Educating site workers on construction safety regulations and accident protocol.*Enforcing site safety rules to minimize work-related accidents and injuries.*Handling site accidents in accordance with established accident protocol.*Maintaining an accurate record of construction employee attendance.*Evaluating the performance of construction employees and instituting disciplinary measures as needed.*Analyzing blueprints to ensure that construction projects meet design, safety, and budget specifications.*Must have a working knowledge of MEP, Civil, Architectural and Interior.*Recommending changes to construction operations or procedures to increase efficiency.Skills",
    "Skills": [
        "Requirements:\nBachelor's degree ''Civil Eng.\" or related field is preferred.\nProven experience working as a site supervisor.\nSound knowledge of building codes and construction safety regulations including\nWorking knowledge of construction tools and equipment.\nKnowledge in solid in Interior Designing/Joinery/ Fit Out Industry\nSelf-reliance & ability in #AutoCADand #Microsoftoffice.\nOutstanding #leadershipskills.\nStrong analytical and problem-solving skills.\nExcellent in #English written and communication skills\nAttention to detail and strong problem-solving abilities.\nAbility to work under pressure and manage multiple projects simultaneously.\nKnowledge of health, safety, and environmental regulations in construction.\nWith UAE valid Driving License"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}