{
    "Job ID": "4759597",
    "Description": "EXPERIENCE & SKILLS 15+ years of EH&S experience in petrochemical/oil & gas industry with at least 5 years in a managerial role\nBrownfield experience is a must\nExperience with Saudi Aramco EH&S management system is essential\nConstruction and commissioning experience in the brownfield environment is essential\n10+ years of experience in EPC environment\nDemonstratable subcontractor management skills\nStrong experience in Permit to Work, Confined Space Entry, LOTO, Work at Height, Lifting & Rigging, Excavation, etc. processes\nStrong experience in SIMOPS operations including the planning, communications, coordination and control\nStrong technical competence in Construction & Commissioning Safety, supported by a thorough knowledge of international standards for management of EH&S and Risk\nHigh level of knowledge and experience in incident and crisis management in remote locations\nAble to demonstrate the knowledge of the impact of decisions/changes on project EH&S risks and overall project success\nInvestigating incidents in leading or facilitating role. Overseeing the assessment and expedient reporting of incidents to determine immediate actions and implementation of learnings\nAble to develop an EH&S culture that empowers the workforce to deliver EH&S performance\nDemonstrate leadership, integrity, and interpersonal skills\nPossess a strong passion and commitment to employee involvement, team building, diversity, and inclusion\nStrong planning, coordination, and risk management skills\nEnergy, drive and determination to build up high performance safety management and to assist leading the Site Team to deliver the required results\nSupporting and collaborating with the onsite contractors, subcontractors, inspectors, and others in a respectful and professional manner to focus on driving the Project Safety Culture\nA good understanding and experience with worker’s health & welfare programs and ability to ensure its implementation by subcontractors.QUALIFICATIONS:Bachelor’s degree in EH&S Management, Environmental or Chemical Engineering, or related discipline.\nIncident investigation qualification (Tap Root, Sologic RCA, or similar)\nKnowledge & experience of ISO 14001 & ISO 45001\nEmergency response management qualification is plusJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}