{
    "Job ID": "4759917",
    "Description": "About the Company:StarMaker is the world's premier audio social platform, renowned for its online karaoke and voice chat rooms, advanced audio technology, robust social interaction features, finely tuned localized operational strategies, and extensive music library coverage. StarMaker has swiftly completed its global expansion and currently boasts a user base that spans over 100 countries worldwide, including Southeast Asia, the Middle East, Europe, the Americas, and Latin America. It has emerged as the dominant audio application in numerous markets.Job Responsibilities:Strategic Oversight: Take charge of the operational aspects concerning Families and VIP Users, with a primary focus on associated events.\nComprehensive App Knowledge: Cultivate an in-depth understanding of the app's functionality and policies, ensuring timely and effective communication with users and family leaders.\nStrategic Planning: Formulate and execute a meticulous strategic blueprint for VIP operations, continuously monitoring user feedback and swiftly adapting operational activities as needed.\nCreative Event Planning: Ideate and orchestrate captivating events specifically tailored to VIP users and families, designed to augment their engagement within the app.Requirements:Social and Entertainment App Proficiency: Profound expertise in navigating Social and Entertainment Apps, such as Facebook, Instagram, YouTube, etc.\nInfluential Network: Possess a substantial network of connections within the domains of talented broadcasters, agencies, and related industries.\nData Acumen: Demonstrate a finely honed sensitivity to data, with the capacity to adeptly analyze and interpret data for actionable insights.\nPreferred Experience: Prior experience in Live Streaming, Broadcasting, or Short Video platforms is highly advantageous.\nEducational Qualifications: Hold a Bachelor's degree and showcase exceptional English communication skills.Skills",
    "Skills": [
        "Communication\nTeam player\nCustomer Centric\nCustomer Support"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "5"
    }
}