{
    "Job ID": "4759415",
    "Description": "The Data Entry Officer is responsible for collecting and entering data in databases and maintaining accurate records of valuable information.Core Responsibilities:Transfers data from paper formats into computer files or database systems using keyboards, data recorders or optical scanners to keep all data recorded and reserved.\nTypes in data provided directly from customers to have a documented version of them when needed.\nCreates spreadsheets with large numbers of figures without mistakes and verifies data by comparing it to source documents to avoid any misleading information.\n Updates existing data to provide an up-to-date database when needed.\n Retrieves data from the database or electronic files when requested by any JRF employees to provide them with all needed information to perform their role.\n Performs regular backups to ensure data preservation.\nSort and organize paperwork after entering data to archive them. Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor’s Degree in Business Administration, or any related field.\n Good English and Arabic language skills (written and spoken).\n0-2 years of experience.\n Fast typing skills; Knowledge of touch typing system is strongly preferred\nExcellent knowledge of word processing tools and spreadsheets (MS Office Word, Excel etc.)\nWorking knowledge of office equipment and computer hardware and peripheral devices\nBasic understanding of databases.\nGreat attention to detail."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}