{
    "Job ID": "4759509",
    "Description": "Company DescriptionLuxury art and collectibles leader8BA Auction House, a leader in the luxury art and collectibles industry, is seeking a versatile Business Development Specialist who will also be a Product Hunter. This is an exciting opportunity for an individual with a strong business development background and a passion for identifying and sourcing exceptional products to enhance our offerings.Role DescriptionThis is a full-time on-site role for a Business Development Specialist in Dubai. The Business Development Specialist will build and maintain relationships with new and existing clients, identify new sales leads, and develop innovative sales strategies to increase revenue. The Business Development Specialist will also work closely with cross-functional teams to optimize internal processes and ensure high customer satisfaction.Key Responsibilities:Business Development:Identify and cultivate new business opportunities, including potential clients and partners.\nBuild and maintain strong client relationships through effective communication and negotiations.\nDevelop and execute strategies to expand the company's market presence and revenue.\nCollaborate with the sales and marketing teams to achieve business development goals.Product Hunting:Proactively search for unique and valuable products to add to 8BA Auction House's collection.\nEvaluate potential acquisitions, considering authenticity, provenance, and market demand.\nNegotiate and secure deals with sellers and collectors to acquire outstanding pieces.\nCollaborate with the curatorial team to ensure seamless integration of new acquisitions.Skills",
    "Skills": [
        "Qualifications",
        "Bachelor's degree or higher in Business Administration, Marketing, or a related field\nAt least Three years of experience in business development or sales role\nExcellent communication and interpersonal skills, with the ability to build strong relationships with customers and internal teams\nProven ability to develop and execute sales strategies that increase revenue and drive growth\nStrong problem-solving and analytical skills, with the ability to work independently and as part of a team\nGoal-oriented mindset with a focus on achieving measurable results\nExperience in the auction industry is a plus\nFluent in English language, verbal and written; Professional proficiency in Russian or Arabic is a strong asset\nAbility and willingness to travel as needed"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Gender": "Female",
        "Nationality": "All Arab Countries; All Eastern European Countries"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Retail & Wholesale; Events Management; Automotive Dealership & Distributor",
        "Company Type": "Unspecified",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "1"
    }
}