{
    "Job ID": "4759378",
    "Description": "About the jobAUS Global is the world’s fastest-growing broker, bringing over 20+ years. of market expertise. We are a fully regulated broker with whom you can trade. CFDs in hundreds of instruments across six asset classes such as forex, crypto, metal, indices, commodities, and shares.Join our developing and sustaining high-performance team that has a culture of enthusiastic, great personalities, proactive, and with strong regard for success.Job PurposeThe purpose of this role is to oversee the process of Senior business. development manager or senior account manager within AUS Global to promote. longevity. Job includes working closely with sales manager, meeting with potential Introducing Brokers (IBs), contacting potential clients via emails, phone and/or video calls and maintaining existing client relationships.Requirements:Experience in the FX sales position within a brokerage firm.\nDeep understanding of the financial markets, especially FX/CFDs products.\nResponsible for daily sales performance to ensure results could be delivered and achieved.\nSelf-motivated, outgoing, result-driven, and confident.\nExcellent problem-solving skills.\nAny second language is an advantage.\nExcellent communication and networking skills.\nStrong negotiation skills and ability to close deals.\nPrevious experience in business development or sales within the financial sector.\nMinimum 3 to 5 years’ experience in FX sales position within a brokerage company.\nHave an existing portfolio of clients.Qualifications:Solid experience in the FOREX market.\nUnderstanding of the Financial markets, especially FOREX.\nExcellent English communication skills.\nExcellent computer skills.Skills",
    "Skills": [
        "Qualifications:",
        "Solid experience in the FOREX market.\nUnderstanding of the Financial markets, especially FOREX.\nExcellent English communication skills.\nExcellent computer skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "Dubai, United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Financial Services",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "5"
    }
}