{
    "Job ID": "4759755",
    "Description": "We are looking for a family assistant (ideally a female) to help us with our home day-to-day duties. We are a couple running a business with a baby on the way and we are planning to move to Hurghada in a couple of weeks (October/November 2023). Due to demands in our business and challenges of pregnancy and later challenges that come with looking after the newborn, we need a family assistant to support us with the most basic day-to-day duties such as cleaning the house, food shopping, and cooking. Help with the baby sometimes will be appreciated, too, for someone interested, responsible, and caring. And company for even some basic chat will be also appreciated; we are friendly, open-minded, and respectful people who enjoy getting to know new people and new cultures. If this would be helpful for our family assistant, we can consider an option of moving-in to one of our bedrooms in our apartment , even if this would be not a permanent preference. We are flexible and open to discuss different possibilities that will work for both sides.So if you are someone that would find this kind of job interesting and suitable, or you know someone that could be interested, please let us know. The starting salary would be 3,300 EGP per month for full-time position (hours can be discussed , can be flexible) , rising up to 5,060 EGP per month for a successful candidate, or more, depending on the value that the person will bring to our family.Start of the job would be of course once we arrive to Hurghada. Our living location is yet to be confirmed, we will most likely decide on the area once we arrive, but currently we consider areas around El Gounna.I guess I should mention that we also have a small dog in our family, a friendly female Jack Russel Terrier that is now 10 months old. Surely she will become a friend with our family assistant, she is very friendly. I guess that we may occasionally need help also with dog walking which is mainly my pleasure and duty, but I may struggle with this in the near future due to the demands of the pregnancy and caring for the newborn and with my husband working for many hours a day.Please feel welcome to reach out to us if you know anyone who could be interested in this job offer.Skills",
    "Skills": [
        "house cleaning",
        "food cooking",
        "occasional babysitting and dog walking"
    ],
    "Preferred": {
        "Residence Location": "El Gouna, Egypt ; Hurghada, Egypt"
    },
    "Data": {
        "Job Location": "Hurghada, Egypt",
        "Company Industry": "Personal Services",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "1"
    }
}