{
    "Job ID": "4759359",
    "Description": "مهام وظيفة مدير صالة ترفيهالقدرة على التخطيط والتنظيم والإدارة الفعالة للوقت والمواردالقدرة على التواصل الفعال مع العملاء والموظفين والشركاء التجاريينخبرة في إدارة وتشغيل الأنشطة الترفيهية والرياضية والثقافيةمعرفة جيدة بإدارة الميزانية والمالية والمشترياتمهارات القيادة والإدارة وتطوير فريق العملمهارات حل المشكلات واتخاذ القرارات الصعبةالمعرفة باللوائح والقوانين الصادرة عن الحكومة والهيئات الرسمية ذات الصلةالقدرة على العمل تحت الضغط وفي بيئة سريعة الحركة القدرة على إدارة عمليات الصالة بنجاح، بما في ذلك التخطيط والتنظيم والتنفيذ والرصد والتقييمالقدرة على إدارة وتدريب فريق العمل لضمان تقديم خدمة العملاء بشكل فعال وفي بيئة عمل آمنةالمعرفة بالسلامة والصحة المهنية والتشريعات المتعلقة بالصالات الترفيهيةالقدرة على إدارة الميزانية والتخطيط الماليمهارات التواصل الجيدة والقدرة على التفاعل مع العملاء والموردينالقدرة على التعامل مع الصعوبات واتخاذ القرارات الصائبة في وقت قصيرالمرونة والتكيف مع التغييرات السريعة والأوضاع القابلة للتغييرالقدرة على العمل بشكل فردي وفريق، وتحمل ضغوط العملمعرفة عامة بتقنيات التسويق والإعلان والترويج للصالة الترفيهية والفعاليات التي تقام فيهاالمعرفة بالبرامج والأنشطة الترفيهية المتاحة في الصالة الترفيهيةالالتزام بمعايير الجودة والخدمة العالية المتطلبة في هذا المجالتوزيع المهام على الموظفين ومتابعتهم للتأكد من قيامهم بالدور المطلوب منهم اعداد الخطط والبرامج اللازمه للقيام بالأنشطه داخل المركز تحديد احتياجات المركز والتأكد من جاهزية جميع متطلباتهالمتابعة مع الشركات والموردين للتأكد من توفير جميع مستلزمات المركز وحل جميع المشكلاتSkills",
    "Skills": [
        "مهارات وظيفة مدير صالة ترفيهالقيادة والإدارة: يجب أن يكون لدى مدير صالة الترفيه قدرة على الإدارة الفعالة للموظفين والقدرة على تحفيزهم وتطويرهم وتنظيم عملهم بطريقة فعالةالاتصال: يجب أن يكون لدى مدير صالة الترفيه مهارات اتصال جيدة والقدرة على التواصل مع العملاء والموظفين والشركاء التجاريين وتوجيههم وتحفيزهم والتعامل معهم بطريقة احترافيةالتخطيط والتنظيم: يجب أن يكون لدى مدير صالة الترفيه القدرة على التخطيط والتنظيم والترتيب الجيد للبرامج والأنشطة والفعاليات المقدمة في الصالةالمعرفة الفنية: يجب أن يكون لدى مدير صالة الترفيه معرفة جيدة بإدارة الأنشطة الترفيهية والرياضية والثقافية والفنية، ويجب أن يكون قادرًا على الاستجابة لمختلف الاحتياجات والاهتمامات الفردية للعملاءالإدارة المالية: يجب أن يكون لدى مدير صالة الترفيه معرفة جيدة بإدارة الميزانية والمالية والمشتريات ويجب أن يكون قادرًا على التعامل بطريقة حذرة وعقلانية مع ميزانية الصالة والحفاظ عليهاحل المشكلات: يجب أن يكون لدى مدير صالة الترفيه القدرة على التعامل مع المشكلات التي قد تنشأ وتجنبها بشكل فعال"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Amusement & Recreation Facility",
        "Company Type": "Unspecified",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$4,000 - $5,000",
        "Number of Vacancies": "1"
    }
}