{
    "Job ID": "4759655",
    "Description": "We are currently looking to hire UAE National for the below position. Job title : G/L Fixed Assets Accountant\nSalary package AED 20 – 25 K (All inclusive)Maintains the fixed asset system by supervising the recording of all items in the system, keeps pertinent records and ensures adequate treatment of fixed asset acquisitions and retirements.\nReviews the provisional Handing Over Certificate (in case of Buildings) for completeness, accuracy and authorization. Also, matches the Purchase Order with the Delivery Note and Vendor’s Invoice, where applicable.\nConducts physical verification of fixed asset and accordingly reconciles assets physically verified with the books of accounts.\nPrepares requests for creation of new general ledger account code and new vendor or customer account; and makes amendments /deletions of accounts when required.\nRecords assets in fixed assets system and general ledger a/c and posts all depreciation to general ledger a/c on a monthly basis. Records capital works in progress in the fixed asset module.\nPrepares monthly Depreciation Schedule and Fixed Assets Movement ,accurately and within timelines.\nPerforms cost analysis and tracking of projects and works with field offices on placing assets in-service.\nReview handling over certificates for new assets and prepare cost calculation for recording investment property at cost as per accounting policy.\nFacilitates monthly reconciliation between fixed assets, sub-ledger and general ledger Reviews purchases of all equipment and records capital equipment, building and renovation projects in the company fixed asset system.\nDeletes traded-in, lost, destroyed, sold, etc., fixed assets from the fixed asset system after obtaining the necessary approval as per the DOA.\nWorks with Purchasing department to ensure capital equipment is tagged as property upon receipt.\nPrepares work in progress accounts for correct allocation and capitalization of completed project.\nCoordinates the receipt of information on new assets with the Accounts Payable Section and ensures that all information received is correct and complete.\nReview bank book and bank statement and prepare bank reconciliation statement.\nEvaluates and recommends changes in fixed assets system and policy and procedures and identifies areas that could result in operational cost savings.\nPrepares accounting entries / supporting documents for Investment Property based on instructions received from Finance Manager.\nPrepares and completes list of task on monthly, quarterly and annually as per the GL Task List.\nPrepares separate and consolidated financial statements for the organization and its subsidiaries along with the related notes to the financial statement that ensure accuracy, completeness, and compliance with relevant accounting standards (e.g., IFRSs).\nSpearheaded the annual audit process, coordinating with external auditors to provide necessary documentation and support. Ensuring that the audit findings are addressed promptly, and financial statements are audited without significant issues.\nManage the entire process of accounting for investment in equity instruments (FVTOCI) from recognition, derecognition and remeasurement in accordance with IFRS 9.\nProvide insightful financial analysis to the senior management (e.g., FM, CFO and Audit Committee) of the actual current year’s performance as compared to previous year.\nPerforms any other relevant task as directed by CFO , Finance ManagerSkills",
    "Skills": [
        "UAE National only\nGender – Male"
    ],
    "Preferred": {
        "Gender": "Male",
        "Nationality": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Recruitment Agency",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}