{
    "Job ID": "4759331",
    "Description": "Operational Excellence: Manage the day-to-day warehouse operations efficiently to ensure that the standards of quality, and safety are achieved. Job holders will create sops for the optimization of resources and space utilization.\nAdherence to QMS: Develop and implement processes to see that the operations are carried out as per agreed standards.\nSafety: Manage and train warehouse staff in safety norms and carry out checks to ensure that all operations are carried out safely without any incidents or accidents. \nFleet Management: Ensure that the vehicles, and equipment are maintained regularly to prevent service failures, and breakdowns and keep maintenance costs low.\nLeadership: Motivate, develop, and train the warehouse staff for better performance, and company profitability\nProblem-solving: Identify problem areas and areas of improvement and design solutions promptly to resolve the issues.\nBudgeting: Prepare a budget forecast for the warehouse in consultation with the manager and Finance for better financial planning, cost savings and to achieve the targets set by the management.Skills",
    "Skills": [
        "Candidate profile",
        "Bachelor’s degree preferred in business administration and/or marketing.\nExperience: 8 to 10 years in sales, business, and/or category/channel management.\nExcellent leadership and team management skills, with the ability to motivate and enable results through others.\nStrong business acumen and understanding of market dynamics and customer needs.\nTransferable visa\nValid Kuwait Driving License"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}