{
    "Job ID": "4759512",
    "Description": "The Executive Secretary will organize and coordinate office administration and procedures, to ensure organizational effectiveness, efficiency, and safety. The Executive Secretary is responsible for developing intra-office communication protocols, control, office staff supervision, and task delegation.Duties & Responsibilities:Coordinate with all departments on all office equipment such as ( HR, Operation, and Marketing..)\nAssign and monitor administrative responsibilities and tasks among office staff.\nEnsure that results are measured against standards while making necessary changes along the way\nCoach, mentor, and discipline office staff.\nOversee the administrative work in the office and ensure a smooth flow of work·      Provide administrative support to managers and other staff and coordinate all daily office activities·      Verify compliance with health and safety laws and regulations·      Hire, train, and supervise administrative staff, and provide guidance to them·     Manage executives’ schedules, calendars, and appointmentsSkills",
    "Skills": [
        "Major Skills Required:                                                     ",
        "·     Experience in office or administrative management",
        "·     Strong organizational skills and ability to manage priorities",
        "·     Ability to work independently and as part of a team",
        "·     Strong communication skills, both written and verbal",
        "·     Ability to multitask and handle pressure",
        "·     The ability to solve problems and the ability to make decisions",
        "Minimum Qualifications:",
        "Bachelor's degree in business, management, or related field, or equivalent experience"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Jeddah , Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 24 Max: 38"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Secretarial",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}