{
    "Job ID": "4759572",
    "Description": "Assessing the capacities and needs of community-based organizations (CBOs), overseeing the execution of microbusiness support interventions, and ensuring the successful implementation of small grant-funded businesses.Core Responsibilities:Analyses and utilizes economic data to identify promising investment sectors in different geographic areas. \nEstablishes and maintains a working relationship with the working governmental bodies, civic society organizations and major entities within the targeted governorates to facilitate collaboration and information exchange, fostering a supportive network for program implementation.\nAssesses the targeted community-based organizations’ (CBOs) capacities and needs and advising on the needed capacity-building efforts in accordance with those needs to strengthen the capabilities of CBOs, enabling them to effectively contribute to the program's goals.    \nExamines and reviews market assessment reports and their findings for presentation to both internal and external stakeholders, and utilizing this information in the program's execution to make data-driven decisions and align program activities with market conditions and opportunities.\nContributes to the reviewing process of business plans and maintaining ongoing communication with the beneficiaries/ CBOs to assist in refining and enhancing their plans to make them more comprehensive and complete. This involves providing guidance and support to ensure that the beneficiaries' business plans are well-developed and meet their needs effectively.\nConfirms the viability of project concepts and assess whether the grant amounts align appropriately with the proposed business concepts. This involves a careful evaluation to ensure that the proposed project ideas are practical and that the grant funding allocated corresponds adequately to the nature and scope of these business ideas.\nSupervises the progress of business plans for the small and micro businesses selected from our pool of beneficiaries/ CBOs. This involves closely observing and tracking the development and execution of these initial business ideas to ensure they are on the right track and meeting their objectives as intended.\nActs as a liaison for the approval cycle of the full proposal package with the internal and external committee to ensure a smooth and transparent approval process, securing necessary support and resources for program implementation.    \nCoordinates for the technical and financial training of the CBO teams to equip them with the knowledge and skills required for successful technical and financial management.\nOversees the execution and tracking the advancement of our microbusiness-related support interventions within CBOs. This role entails ensuring that these interventions are carried out effectively and keeping a close eye on their progress to measure their impact and effectiveness to guarantee the success and sustainability of microbusiness support initiatives within the CBOs.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Business Administration, or any related field.\nStrong English and Arabic language skills (written and spoken).\n5-7 years of experience.\nExperience working on Livelihood projects."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Aqaba, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}