{
    "Job ID": "4759240",
    "Description": "We are looking for a qualified Sales administrator to join our sales team and help us achieve our goals. You will serve as a point of contact for customers with queries about products, and services and provide support for sales representatives.Our ideal candidate is goal-oriented and has a deep knowledge of customer service best practices. If you have exceptional organizational skills and draw energy from being part of a team, we would like to meet you.Ultimately, you should be able to contribute to high-quality customer service and support the sales teamResponsibilitiesCold calling to suspects\nEngage with existing customers for cross sell\nContact clients to obtain missing information or answer queries\nLiaise with the delivery team to coordinate pre-sales requirements\nMaintain and update sales and customer records\nDevelop weekly/monthly sales reports\nCommunicate important feedback from customers internally\nStay up-to-date with new products and featuresSkills",
    "Skills": [
        "Requirements and skills",
        "Proven work experience as a Sales administrator or Sales support agent\nHands-on experience with MS Office (MS Excel in particular)\nUnderstanding of sales performance metrics\nExcellent organizational and multitasking skills\nA team player with a high level of dedication\nAbility to work under strict deadlines\nCertification in Marketing, Sales or a relevant field is a plus"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Residence Location": "Bahrain",
        "Gender": "Female",
        "Nationality": "Bahrain",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 21 Max: 35"
    },
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Software Development",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}