{
    "Job ID": "4759587",
    "Description": "Personalized Internet Assessor - Russian Speaker In KazakhstanElevate your career without leaving home - embrace remote work with us. TELUS International AI Data Solutions is hiring a Personalized Internet Assessor In KazakhstanIn this role you will be reviewing online search results in order to improve their content and quality. You will be required to provide feedback and analysis on content found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this role will involve reviewing the language used in the search results by examining grammar, tone and cultural relevance.Why Join the TELUS International AI Community?•Earn extra income•Access to our community wellbeing initiative•Remote work & Location Independence•Be your own boss•Flexible Hours to fit in with your lifestyle•Be a part of an online communitySkills",
    "Skills": [
        "What are the main requirements for the role?",
        "•You must be fluent in both written and verbal English & Russian.",
        "•You must be currently living in Kazakhstan.",
        "•You must own and use a Smartphone (Android V4.2 or higher or iPhone running iOS version 14.0 or higher) to complete tasks.",
        "•The majority of the task types will require both a desktop/laptop and a smartphone.",
        "•Gmail must be your primary email.",
        "•Active daily user of Gmail and other forms of social media.",
        "•You must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in Russia.",
        "•Access to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expense.",
        "•Experience in use of web browsers to navigate and interact with a variety of content."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Residence Location": "Kazakhstan"
    },
    "Data": {
        "Job Location": "Almaty, Kazakhstan",
        "Company Industry": "Internet & E-commerce; Telecommunications",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "99"
    }
}