{
    "Job ID": "4759463",
    "Description": "We are seeking a Software Developer with more than 2 years of practical experience in C++, Python, and JavaScript. In this role, you will collaborate with fellow Developers and Product Managers throughout the entire software development process. We are looking for a team player with a sharp eye for detail and problem-solving abilities. If you also have expertise in agile methodologies and widely-used programming languages (such as C++/Python and JavaScript), we'd like to connect with you. Your primary objective will be crafting efficient programs and systems that fulfill user requirements.Responsibilities:Collaborate with developers to create algorithms and flowcharts.\nGenerate clean, efficient code according to specifications.\nIntegrate software components and third-party applications.\nVerify and deploy programs and systems.\nDiagnose, debug, and enhance existing software.\nCollect and assess user feedback.\nPropose and execute enhancements.\nProduce technical documentation for reference and reporting.Skills",
    "Skills": [
        "Requirements and Skills:",
        "Proven track record with at least 2 years of experience as a Software Developer.\nFamiliarity with Agile development methodologies.\nExperience in software design and development within a test-driven environment.\nProficiency in Object-Oriented programming languages.\nKnowledge of coding languages (e.g., C++, Python, JavaScript) and frameworks/systems (e.g., AngularJS, Git).\nExperience with databases and Object-Relational Mapping (ORM) frameworks (e.g., hibernate).\nKnowledge of image processing and Open CV is a plus, though not mandatory.\nWillingness to learn new languages and technologies.\nExceptional communication skills.\nResourcefulness and adeptness at troubleshooting.\nKeen attention to detail.\nBachelor's degree in Computer Science, Software Engineering, or a related field."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Software Development; IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}