{
    "Job ID": "4759703",
    "Description": "Marketing Executive - Safat HomeThe marketing executive will be involved in developing marketing campaigns to promote Safat Home products and services. It will be a varied role that includes planning, advertising, public relations, event organization, product development, distribution, sponsorship, and research.Essential Job Roles:Coordinating in the execution of marketing communications across all HD brands under the supervision of Asst. Marketing Manager\nFollowing up on daily tasks with the appointed PR agency.\nDeveloping and maintaining marketing collateral, rate cards, newsletters, brochures, and many other materials related to marketing.\nExecuting a wide variety of details that involve direct mail, social media, marketing trade shows and events, public relations, customer communications, media advertisements, promotions, and other marketing plans.\nMonitoring competition in all daily newspapers\nMaintaining communication open lines with all organizations and providing prompt answers to requests in order to determine how to convey concise, clear, and timely selective information.\nManage product image library on Marketing Network\nManage marketing communication archive; compile all campaign communication and save on Marketing\nDeveloping standardized presentations, sales scripts, and proposals.\nWriting and editing press releases.\nImplementing project management system for documenting and tracking activities.\nAttending tradeshows, company-sponsored promotions, and events.\nMonitoring competitors for tracking communications related to the brand of a company.\nExecuting and analyzing results of advertisement and marketing campaigns.\nPreparing monthly marketing calendars and updating them.\nAnalyze marketing campaigns to determine their success and effectiveness (Evaluate different KPIs)\nAnalyze market and customer data to gain insight into the business (analysis on market share, competition, database, etc) \nGenerate weekly marketing report in relation to the week’s activities across the different comms channels based on the provided reporting template(s) covering all regions\nLiaise internally and externally with the HF team, agency, Group Control, showroom, and suppliers to conduct and finalize marketing activities.\nDevelop and update quarterly promotions calendar in coordination with B&MSkills",
    "Skills": [
        "Business education;\n+3 Years’ experience in a similar function ideally retail or fashion environment;\nExcellent communication skills;\nCreativity and ability to think outside the box;\nTeam player-can build an efficient team around him;\nCan demonstrate ability to research the market and analyze data;\nAble to produce project plans and work to deadlines;\nPC proficient in all main MS applications especially PowerPoint."
    ],
    "Preferred": {
        "Nationality": "Kuwait"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}