{
    "Job ID": "4759386",
    "Description": "JOB PURPOSE:Making sure the instruments and testing devices are calibrated correctly and give accurate readings in line with standards. By adjust machines, instruments and components using measuring and diagnostic software to ensure precision settings are in line with standards.Responsibility :To calibrate, maintain & adjust the measurement instruments and electronics equipment\nConduct preventive and corrective actions in-order to avoid equipment failures and inaccuracy.\nTo support equipment validation activities as new instrument identification and calibration as required by validation protocols.\nEnsuring that all equipment used for calibrations is functioning properly and is calibrated regularly\nPerforming tests to verify that equipment meets specifications or standards\nReading quality control manual and testing specifications to obtain data to test or calibrate specific devices.\nSelecting and installing accessories, such as adapters, indicating gauges, or holding devices on test or calibration fixture, and connecting instrument or device to fixture, according to specifications, using hand tools.\nSetting controls to regulate factors, such as current flow, timing cycle, pressure, temperature, or vacuum, according to specifications, and activating test or calibration equipment.\nUsing hand tools and precision measuring and calibrating instruments and equipment including but not limited to mechanical gages-calipers, micrometers and height standards.\nRejecting malfunctioning devices and routing devices to specified department for rework or salvaging of parts.Skills",
    "Skills": [
        "Qualifications:",
        "Diploma in electrical or electronics & instrumentation",
        "Experience and Skills :",
        "Minimum 3 years of experience as a calibration & instruments technician in FMCG "
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "FMCG",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}