{
    "Job ID": "4759184",
    "Description": "Take the lead role in developing new business proposals and presentations that create and nurture opportunities and partnerships.\nManage both our existing sales pipeline and the development of new business opportunities.\nIdentify trends and customer needs, building a sales pipeline for short/medium/long term in accordance with target's.\nDevelop strategies and positions by analyzing new-venture integration.\nAssist in the coordination and implementation of marketing strategies, and delegate tasks to achieve strategic goals.\nDemonstrate strong interpersonal skills with the ability to engage effectively with various levels of management, staff, and clients.\nMotivate the team, track performance, and report metrics.\nManage proposal response process, including detailed RFP requirements, online bids and inputs from various sources.\nCurate effective enterprise mobility solutions, and solutions that help employees and B2B customers commute in a clean, reliable and safe manner.\nGenerate New leads, identify and contact decision-makers, screen potential business opportunities.\nDevelop and implement overarching sales and business development strategy, sales processes, structure, and best practices across the company.\nSupport deal structure and pricing with business-value analysis, negotiate for proactive bids and proposals.Skills",
    "Skills": [
        "Graduate or postgraduate in business management, marketing, or related field preferred.\n4-7 years’ relevant experience in B2B Sales, acquisitions of brands, consultative sales.\nSuccessful track record in B2B sales and negotiation.\nExcellent written and verbal communication skills.\nAbility to handle multiple projects simultaneously and work under pressure.\nProficiency in Data analysis, forecasting and budgeting.\nProven ability to plan and manage resources.\nAgile to adapt with the dynamic business environment.\nProficient in Microsoft Office and relevant software."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 8",
        "Residence Location": "Dubai, United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 18 Max: 39"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Sales Outsourcing; Motor Vehicle Passenger Transport",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "3"
    }
}