{
    "Job ID": "4759187",
    "Description": "The Freight Forwarding executive should be having complete handling knowledge of air/sea/land import & export products, as well as clearing & forwarding effectively and professionally.He/She should be able to deal with Shipping lines, Air lines and the Transporters in booking and executing the shipments .\n Logistics Coordinator is responsible to ensure that all documentation is complete and correct, cargo moves at the scheduled time, and all key stakeholders are kept updated.\nResponsible for providing excellent customer service, including addressing customer inquiries and resolving issues related to shipments.\nDeliver exceptional customer service by addressing inquiries and resolving shipment-related issues promptly.\nFoster and oversee relationships with carriers, vendors, and customers to ensure smooth and efficient operations.\nProvide top-notch customer service by promptly responding to inquiries and effectively resolving issues associated with shipments.Skills",
    "Skills": [
        "Should possess excellent customer service skills to provide high-quality service to customers and to build strong customer relationships.\nExcellent customer service skills are required to deliver exceptional service to customers and foster robust customer relationships.\nThe ability to solve problems effectively is crucial for managing issues during transit and finding creative solutions to logistical hurdles.\nPossessing strong problem-solving skills is essential for proficiently handling transit-related issues and coming up with inventive solutions to logistical challenges."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Distribution, Supply Chain & Logistics",
        "Company Type": "Recruitment Agency",
        "Job Role": "Logistics and Transportation",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}