{
    "Job ID": "4759652",
    "Description": "Contributes to the establishment of the long- and short-term strategies and objectives of the company.\nPrepares the annual budget of his assigned territory and takes full responsibility for achieving the approved targets.\nProposes the annual business plan for his assigned territory that is aligned with the overall company strategy and objectives and take responsibility for its execution.\nPrepares and submits periodical market analysis report for his assigned region.\nContributes to the development / expansion projects and feasibility studies.\nContinuous exploration of potential markets and customers within his territory.\nPrepare and timely submits the monthly sales forecast and production requirements of his territory including that of his supervised team.\nResponsibility for the achievement of the approved monthly sales targets within his territory.\nFull responsibility for the timely collection of the company outstanding.\nResponsibility for evaluating his territory customer’s financial credibility. Proposes and periodically review the payment terms of each and ensures proper implementation.\nResponsibility for the achievement of the approved selling prices within his territory and hence company targeted profitability.\nReports all customer complaints providing proper documentation and follow up with concerned inside staff to ensure proper, timely and fair settlement / resolution is made.\nSubmits monthly sales reports evaluating actual achievements versus set targets, identifying deviations and setting initiatives for recovering deficiencies when applicable.\nProviding initiatives for the improvement of the company product range, packaging, services, etc… that leads to improving competitive edge and enhanced customer loyalty.\nDaily coordination with customer service department to ensure timely loading of orders to satisfy customer’s delivery requirements.\nMaintains the highest levels of ethics, integrity and professionalism in his business communications and relationships with all company stakeholders and ensures same implemented and followed by subordinates.\nMaintains the highest levels of customer’s satisfaction and proposing possible actions of improvement.\nProposes and participates in all marketing activities of the company including the development of company literature, website, exhibitions, etc… whenever required.\nInvolvement in the selection process for the sales team of his territory.\nPerform other tasks as directed by immediate superior or management.Skills",
    "Skills": [
        "Analytical ability CSM receive all kinds of information -- from verifiable facts to rumors. It is important to be able to see the relevance of these bits of information, to draw conclusions that fit the facts, and to analyze a problem to understand root causes.\nJudgment\nReport writing\nOrganizational awareness/knowledge\nStrategic Thinking\nBusiness sense/operation\nCreativity A CSM generates ideas frequently and is always working out ways and means of “doing it better.”\nTechnical Knowledge A CSM should have an exceptional understanding of their area. They should continuously strive to improve that knowledge and keep up-to-date.\nManagement Knowledge Check for a sound understanding of modern management techniques applicable to their field. Someone who continually develops management skills is a must."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4 Max: 6",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}