{
    "Job ID": "4759256",
    "Description": "Job Summary:The HCM Specialist will be responsible for managing and optimizing the company's Human Capital Management (HCM) system.They will play a key in ensuring the smooth functioning of various HR processes and implementing best practices H.Job Responsibilities:- Administer and maintain the HCM system, ensuring data accuracy and ensuring all employee information is up to date- Collaborate closely with HR teams to analyze and understand their needs and requirements related to the HCM system- Develop and implement processes, workflows, and procedures to ensure efficient use of the HCM system- Provide training and support to HR staff and end-users on how to effectively use the HCM system- Troubleshoot and resolve any issues or problems related to the HCM system- Generate and prepare reports on HR data and analytics using the HCM system- Stay updated with the latest trends and developments in HCM technology and suggest improvements and enhancements to the systemSkills",
    "Skills": [
        "Skills:",
        "1. Strong knowledge of Human Capital Management (HCM) principles and practices.",
        "2. Proficiency in using HCM software and tools, such as Oracle HCM Cloud, SAP SuccessFactors, or Workday.",
        "3. Experience in HR data management, including data analysis, reporting, and database management.",
        "4. Excellent understanding of HR policies, procedures, and best practices.",
        "5. Strong knowledge of labor laws, regulations, and compliance requirements.",
        "6. Ability to handle sensitive and confidential information with discretion.",
        "7. Excellent communication and interpersonal skills for effective collaboration and relationship management.",
        "8. Strong problem-solving and analytical for-making and process improvement.",
        "9. Ability to develop and deliver training programs on HCM processes and tools.",
        "10. Strong attention to detail and organizational skills for accurate and timely HR data management.",
        "11. Ability to adapt to changing priorities and work well pressure Proactive and self-motivated attitude with the ability to work independently and as part of a team.",
        "13. Strong time management skills to effectively prioritize and manage tasks and deadlines.",
        "14. Knowledge of payroll processes and systems is a plus.15. Professional certifications in HCM, such as PHR or SHRM-CP, are highly desirable.",
        "Candidate Requirements:",
        "- Bachelor's degree in HR, IT, or a related field",
        "- Proven experience working with HCM systems, such as SAP SuccessFactors, Oracle HCM Cloud, or Workday",
        "- In-depth understanding of HR processes and best practices",
        "- Strong analytical skills and attention to detail Excellent communication and interpersonal skills",
        "- work independently and manage multiple tasks simultaneously",
        "Strong problem-solving troubleshooting skills",
        "- Proactive and self-motivated with a desire to continually improve the HCM system and processes"
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 2 Max: 4",
        "Gender": "Female",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 0 Max: 0"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}