{
    "Job ID": "4759196",
    "Description": "Performs general or cost accounting activities requiring some insight and depth of understanding.\nApplies accounting techniques and standard practices to the classification and recording of financial transactions.\nManaging ATC’s accounts payable and receivable\nHandling the cash expenditures/transactions and initiating relevant daily/monthly reports.\nMaintaining company accounting journals while ensuring all updates are implemented for receipt voucher.\nHandling payments to all vendors/providers while ensuring full adherence to indicated ‘Terms & Conditions’ in all contracts.\nCross-checking invoices with payments and expenses to ensure accuracy.\nHandle Ops. requirements (Services/purchases/vendors).\nConducting detailed checks on Ops. mission reports to ensure mirroring with monthly vehicle invoices.\nEnsures that accounting activities are performed according to legislation & governmental laws.\nAssist in the consolidation of balance sheets, profit and loss, etc\nDevelops non-standard reports and statements as required.\nConstant improving and/or modifying standard/ procedures.\nDrafts segments of statements and reports.\nAssist in some assignments involving analysis of data.\nWork is generally reviewed at completion for accuracy and soundness.\nAssures adequate documentation/support of transactions and reports.\nMay prepare or significantly contribute to preparation of a variety of reasonably standard, periodic \"intermediate\" or \"end products,\" such as cost reports, trial balances, balance sheets, profit-and-loss statements or statements of sourcing and application of funds.\nAs requested, prepares appropriate commentary or explanations relating to report items of particular interest or significance.\nMay contact staff personnel for the purpose of supplying or explaining data, securing information, or describing additional data which could be made available; may furnish limited advice on accounting matters, especially were based on well-established principles and practices.\nResponsible for the cash custody handled to drivers and proceeding with the daily registration. \nupdating the company online system ZOHOSkills",
    "Skills": [
        "Bachelor's degree holder with a proven track record of academic or work experience in the Finance sector.\nKnowledge of finance, accounting, budgeting, and cost control principles.\nProven command of negotiation skills to build long-lasting partnerships with clients.\nAdept in data analysis, interpretation, and use of modern accounting techniques.\nReporting Skills\nProficient use of Microsoft Office and its applications."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 5",
        "Nationality": "Egypt",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 30 Max: 40"
    },
    "Data": {
        "Job Location": "Maadi, Cairo , Egypt",
        "Company Industry": "Call Centers & Customer Care Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}