{
    "Job ID": "4759560",
    "Description": "Coordinate with CBO’s, beneficiaries, and stakeholders to conduct microbusiness component activities.Core Responsibilities:Conducts Community outreach through all approved channels for the relevant beneficiaries from the microbusiness component to polarize beneficiaries\nConducts interviews with target beneficiaries and community members at various levels to meet the donor’s requirements\n Arranges and follow up, in and off the field, with beneficiaries, prospect beneficiaries, mentors, community members, CBO’s, partners and any relevant stakeholder to ensure working within procedures assigned by the project.\nFollow-up on training and capacity building activities for beneficiaries and prospect beneficiaries to ensure working per the relevant project’s plan.\nConducts feasibility studies in the field with applicants and recommend the prospect businesses for financing to ensure proper selection.\nMaintains a comprehensive list of beneficiaries, progress and follow-up activities for reporting to component leader and project manager to ensure the process is according to the project’s plan.\nArchives and file all relevant paperwork as per approved process and procedures to meets donor’s requirements.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Business Administration, or any related field.\nStrong English and Arabic language skills (written and spoken).\n3-5 years of experience.\nExperience working on Livelihood projects."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Community Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}