{
    "Job ID": "4759439",
    "Description": "The team works collaboratively regardless of job titles or duties to deliver world class entertainment. The Manager of Sports and Entertainment works closely with the senior manager of entertainment and is responsible for collaborating with internal and external stakeholders to create exciting sporting events within the theme park. They will oversee the programming of entertainment sporting activities and plan day-to-day activities. The primary goal is to enhance the guest experience by offering engaging sports-related events and ensuring smooth operation.Responsibilities: Develop and manage a diverse range of sports activities, competitions, and tournaments that cater to guests of all ages and skill levels.\nOversee the programming of entertainment sporting activities, including live performances, exhibitions, and interactive experiences.\nPlan and coordinate day-to-day activities related to sports and events, including scheduling, staffing, and venue readiness.\nEnsure the safety of participants and spectators by implementing appropriate risk management and emergency response procedures.\nMaintain relationships with sports-related sponsors, vendors, and partners to secure necessary resources and support for events.\nCollaborate with other departments within the theme park, such as marketing and operations, to integrate sports and events into the overall guest experience.\nOversee the daily performances of the park's performers, ensuring they deliver engaging activities and entertainment to guests.\nManage inventory documents, including tracking stock levels, conducting, and updating inventory records as necessary.\nMust be able to adapt to an ever-changing work environment.\nAny other duties as may reasonably be requested by the management team.Skills",
    "Skills": [
        "Benefits:",
        "Visa\nMedical Insurance\nAir tickets"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}