{
    "Job ID": "4759121",
    "Description": "خدمة عملاء ف الرياض شركه العقارية\nتعلن عن توفر وظايف\nمسوقات عقاريات\nالراتب من 7000الى 7500\nمسوقات مبيعات للانضمام إلى فريق العمل في شركتنا في الرياض، المملكة العربية السعودية. يجب أن يكون لديك خبرة لا تقل عن سنة في التسويق والمبيعات، ويفضل\nأن تكون لديك خلفية في القطاع الخاص. ستكون مسؤولاً عن تنفيذ استراتيجيات التسويق وتحقيق أهداف المبيعات المحددة. يجب أن تكون لديك قدرة جيدة على التواصل والتفاوض مع العملاء وبناء علاقات جيدة معهم. إذا كنت تتمتع بشغف في مجال المبيعات والتسويق وتتمتع بمهارات تفاوض قوية، فإن هذه الوظيفة قد تكون مناسبة لك.\n\nالمسؤوليات:\nتطوير وتنفيذ استراتيجيات التسويق والمبيعات لتحقيق أهداف المبيعات المحددة.\nالتعامل مع العملاء وتقديم المشورة والدعم لهم بشأن منتجات أو خدمات الشركة.\nتحليل سوق المنافسين وتقديم تقارير مناسبة للإدارة.\nاكتشاف الفرص الجديدة للتسويق وتوسيع قاعدة العملاء.\nالمشاركة في فعاليات التسويق والمبيعات وتمثيل الشركة بشكل احترافي.\nتحقيق وتجاوز أهداف المبيعات الشهرية والربع السنوية.Skills",
    "Skills": [
        "المرشح المفضل:\nخبرة لا تقل عن سنة في مجال التسويق والمبيعات.\nخلفية في القطاع الخاص وفهم جيد لعمليات الأعمال.\nمهارات تواصل قوية وقدرة على بناء علاقات جيدة مع العملاء.\nقدرة على العمل تحت ضغط وتحقيق الأهداف المحددة.\nمعرفة جيدة بأساليب التسويق والمبيعات الحديثة واستخدام التكنولوجيا في عمليات التسويق.\n======المهارات======\nمهارات تواصل قوية وقدرة على التفاوض.\nمعرفة جيدة بأساليب التسويق والمبيعات.\nقدرة على التعامل مع العملاء بشكل احترافي وتقديم الدعم الفني.\nمهارات تحليل وتقديم تقارير سوق المنافسين.\nمعرفة بأحدث التقنيات والأدوات المستخدم"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 1",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Female",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}