{
    "Job ID": "4759134",
    "Description": "We are looking for a passionate and enthusiastic candidate to join our team as a Photographer/Videographer. You should be able to take pictures and videos that convey a proper message to the audience. You will be responsible for taking photographs of the products and models and editing them as per the specifications. Besides this, you should be able to design posts, stories, reels and videos on social media.Prior work experience as a Product Photographer will be an added advantage for this job position. If you think you are fit for this job role and want to join our dream team, then apply now. We will be happy to hear from you.Responsibilities:* Taking pictures/videos for models and products.* Setting up the lighting and camera equipments.* Selecting location of the shoot, indoors as well as outdoors.* Editing pictures/videos to make them attractive.* Maintaining a proper database of the photographs.* Improvising on the pictures/videos as per the feedback.* Ready to move to a client's site for photography session.* Adhering to all the rules and regulations of the company.* Staying up dated with the latest trends in media and photography industry.Salary is 2500+commission include allowanceSkills",
    "Skills": [
        "Requirements:",
        "* 1 years of experience working as a Product Photographer.",
        "* Knowledge of how to setup and run a studio (cameras, lights etc).",
        "* An attractive portfolio of past work will be an advantage.",
        "* Good time management and decision-making skills.",
        "* Excellent oral and written communication skills.",
        "* Ability to work any time as well as on weekends.",
        "* Willingness to travel as per the shoot requirements.",
        "* Ability to manage multiple projects simultaneously.",
        "* A detailed oriented individual.",
        "* Ability to come up with innovative ideas.",
        "* Experience working with different cameras and lighting equipment.",
        "* Good knowledge of photo editing."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 0",
        "Gender": "Male",
        "Nationality": "India"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Photography",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}