{
    "Job ID": "4759523",
    "Description": "Required Skills to be successful:-The ideal candidate will have a proven track record of developing data-driven campaigns that drive exceptional ROI both on a direct basis, as well as longer term brand metrics. \nEstablish, implement and measure the effectiveness of digital paid advertising initiatives to drive customers to locally relevant websites  \nDrive digital branding initiatives, specially on YouTube Video Ads, social media channels for relevant markets and have a full understanding of the digital branding metrics. \nHave solid knowledge of all performance marketing tactics across multiple advertising channels. (Display / SEM / Paid Social / App). \nDevelop, execute and optimise every aspect of paid channels/campaigns (keyword development, ad copywriting, audience segmentation, bid management, budget monitoring, etc.) \nAnalyse paid marketing KPIs by channel/campaign and dynamically reallocate the budget to maximize the KPIs. \nContribute to setting the marketing plan for each country and forecasting targets and KPIs for paid marketing channels. \nBe in constant coordination with all marketing, design & branding teams. \nProvide periodic campaign performance, forecasts and trend data analysis. \nPPC and Paid social Bid Management tools (FB Manager, Adwords, Marin, GA36, ROI Hunter, Smartly) \nWeb analytics experience (Google Analytics, SiteCatalyst). \nExperience in Retargetting platforms (Criteo, RTB)  \nExperience in App platforms & app installs (Adjust, Taptica, Apple search ads, Moblin, Inmobi) \nComfortable using BI tools (Tableau, Power BI) \nAdvanced skills in MS Excel \nExperience using a CDP is a plus  What equips you for the role:Bachelor Degree\n5+ years in performance marketing (PPC, programmatic and Paid Social) and 10 years in the field.\nPositive, and can-do attitude \nAnalytical skills, from knowledge of tracking tools such as Google Analytics, to understanding the digital marketing and branding KPIs \nUnderstanding of digital marketing from a technical point of view \nVery organized, structured \nVery good communication skills \nVery curious and outgoing Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Accounting",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}