{
    "Job ID": "4759681",
    "Description": "Role: Account ManagerAbout Us: TAD Network is a reputed agency with over 16 years of experience in the industry. From ideation to execution, we are passionate and driven by a desire to deliver successful marketing campaigns and events to all our clients, achieving desired results.Focused on shopper activations, brand engagement, roadshows, production, events, manpower, digital and more we provide integrated solutions and a seamless experience that helps brands stand out with its consumer. What are we looking for: We are seeking an account manager to join our growing team, who will be based in Oman. The candidate will work with exciting FMCG multi-national brands on their local and regional marketing campaigns.The ideal candidate should have a bachelor's degree and 3 years of experience working in any form of marketing. Job Scope:Actively manage the client relationship/s on a day to day ensuring that we are addressing and exceeding client requirements and expectations\nEstablish strong client relationships, seeking and converting new opportunities to grow business\nUnites existing team within the agency and facilitates team work to deliver the different tasks of a client project\nPrepares proposals, as needed, in line with client brief\nAssists and guides the team in execution of projects won\nEnsures the desired profitability levels of all projects are met and invoices are raised on timeSkills",
    "Skills": [
        "Superb communication, interpersonal and follow-up skills.\nTime optimization and identification of priorities.\nFlawless exchange of ideas during peer-to-peer communication and the ability to follow-up effectively.\nWeeding out essential tasks while understanding effective time division."
    ],
    "Preferred": {
        "Career Level": "Management",
        "Years of Experience": "Min: 0 Max: 5",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Events Management; Advertising",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}