{
    "Job ID": "4759838",
    "Description": "We are looking for a skilled and personable Receptionist to join our team in Doha, Qatar. The ideal candidate will have at least 3 years of experience in a similar role and possess excellent communication and organizational skills. As a Receptionist, you will be the first point of contact for our company, providing a warm and professional welcome to all visitors and guests. You will also be responsible for managing phone calls, scheduling appointments, and performing various administrative tasks. The successful candidate will have a friendly and approachable demeanor, with the ability to multitask and prioritize effectively.Responsibilities:Welcome and greet visitors and guests in a professional and friendly manner\nAnswer and manage incoming phone calls, redirecting calls as necessary\nSchedule appointments and maintain calendars for multiple staff members\nReceive and distribute mail and packages\nEnsure the reception area is tidy and presentable at all times\nCoordinate with other departments to ensure smooth operations\nPerform general administrative tasks, such as filing, photocopying, and data entry\nMaintain office supplies and place orders as needed\nHandle sensitive information with confidentiality and discretion\nAssist with event planning and coordinationSkills",
    "Skills": [
        "Preferred Candidate:",
        "Excellent communication and interpersonal skills\nProfessional and friendly demeanor\nAbility to multitask and prioritize tasks effectively\nStrong organizational and time management skills\nAttention to detail and accuracy\nProficient in Microsoft Office Suite\nAbility to work independently and as part of a team\nFlexibility and adaptability to changing priorities\nPrior experience in a similar role is preferred\nFluency in English is required, knowledge of Arabic is a plus\nExcellent communication and interpersonal skills\nOrganizational and time management skills\nAttention to detail and accuracy\nProficiency in Microsoft Office Suite\nAbility to work independently and as part of a team"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 10",
        "Gender": "Female",
        "Nationality": "Philippines",
        "Age": "Max: 40"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}