{
    "Job ID": "4759190",
    "Description": "FUNCTION DESCRIPTIONThe Language Specialist translates, edits, and proofreads texts from and/or into English and Arabic languages, as follows:Translate written content, including documents, reports, marketing materials, and more, from the source language to the target language and vice versa.\nEnsure translations are accurate, clear, and culturally appropriate, while maintaining the original tone and intent.\nProofread and edit translated materials to eliminate errors and improve readability.\nMaintain high standards of quality in your work, check for errors or inconsistencies, and take steps to correct them.\nCollaborate with internal teams to provide linguistic expertise and support on language-related matters.\nStay up-to-date with industry-specific terminology and trends in both source and target languages.\nConduct research when necessary to understand and convey specialized topics or unfamiliar terms.\nHandle multiple translation projects simultaneously while meeting deadlines.GENERAL DUTIESEmbrace and embody the core concept of Al Hakem being a Value-centered company.\nAdhere to the company’s values; namely, Reliability, Transparency, Collaboration, Confidentiality, Teamwork, and Respect.\nSafeguard sensitive company information and respect the confidentiality of colleagues and clients.\nBe open to change and willing to adapt to new technologies, procedures, or roles as the organization evolves.\nTake the initiative to propose new ideas, projects, or improvements that can benefit the company.\nMaintain clear and open communication with colleagues, supervisors, and other team members.Skills",
    "Skills": [
        "Bachelor's degree in Translation, Linguistics, or a related field.\nProven experience as a translator, editor, etc.\nProficiency in Arabic and English languages (written and spoken).\nExcellent knowledge of grammar, punctuation, and language structure in both languages. Strong cultural awareness and ability to adapt translations to suit local cultural norms.\nFamiliarity with translation software and tools (e.g., CAT tools).\nAttention to detail and the ability to produce high-quality work under tight deadlines.\nEffective communication skills and the ability to collaborate with cross-functional teams.\nTime management skills to handle multiple projects simultaneously."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Residence Location": "All Arab Countries",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Irbid, Jordan",
        "Company Industry": "Translation & Document Processing; Translation & Document Processing",
        "Company Type": "Unspecified",
        "Job Role": "Translation",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}