{
    "Job ID": "4759671",
    "Description": "Personalized Ads Evaluator English (US)We help companies test and improve machine learning models via our global AI Community of 1 million+ annotators and linguists. Our proprietary AI training platform handles all data types (text, images, audio, video, and geo) across 500+ languages and dialects. Our AI Data Solutions vastly enhance AI systems across a range of applications from advanced smart products, to better search results, to expanded speech recognition, to more human-like bot interactions and so much more.What does the work involve?In this opportunity you will be reviewing online advertisements in order to improve their content, quality and layout. You will be required to provide feedback and analysis on advertisements found in search engine results and provide ratings on their relevance to the search terms used. Skills",
    "Skills": [
        "Who is suitable for this work?",
        "We are looking for dynamic people who have strong communication skills and use the Internet daily. You should also be flexible, and reliable and have the ability to interpret and follow established guidelines. Payment will be based on the completion of the agreed-upon tasks or engagements within the specified time period.",
        "You will have the flexibility and freedom to work from your own home, working your own hours.",
        "What are the main requirements for the opportunity?",
        "You must be currently residing in the United States\nYou must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in the United States\nFull professional proficiency in English\nExperience in use of web browsers to navigate and interact with a variety of content\nAccess to and use of an Android or IOS Smartphone to complete tasks\nA Barcode Scanner application must be installed on your smartphone to complete certain tasks\nActive daily user of Gmail and other forms of Social Media",
        "Working on this project will require you to go through a standard recruitment process (including passing an open book assessment). This is a long-term project and your work will be subject to quality assurance checks.  "
    ],
    "Preferred": {
        "Residence Location": "United States",
        "Age": "Min: 18"
    },
    "Data": {
        "Job Location": "Texas, United States",
        "Company Industry": "IT Services",
        "Company Type": "Unspecified",
        "Job Role": "Writing and Journalism",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}