{
    "Job ID": "4759647",
    "Description": "We are currently seeking a highly motivated and skilled Junior Mechanical Engineer to join our team in Riyadh, Saudi Arabia. As a Junior Mechanical Engineer, you will be responsible for assisting in the design, development, and implementation of mechanical systems, equipment, and processes. You will work closely with senior engineers and project managers to ensure the successful completion of projects within budget and on schedule. The ideal candidate will have a strong technical background in mechanical engineering, excellent problem-solving skills, and the ability to work effectively in a team environment.Responsibilities:Assist in the design and development of mechanical systems and equipment.\nConduct research to determine the feasibility, design, and cost of new mechanical systems.\nPrepare and present technical reports, proposals, and project plans.\nPerform calculations and analysis to ensure the proper functioning and safety of mechanical systems.\nCollaborate with cross-functional teams to ensure the successful implementation of mechanical systems.\nConduct tests and experiments to evaluate the performance of mechanical systems.\nTroubleshoot and resolve issues with mechanical systems, equipment, and processes.\nEnsure compliance with industry standards and regulations.\nMaintain accurate documentation of design specifications, processes, and test results.\nStay current with advancements in mechanical engineering technology and techniques.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Bachelor's degree in Mechanical Engineering or a related field.\n1-4 years of experience in mechanical engineering.\nStrong knowledge of mechanical engineering principles, concepts, and practices.\nProficiency in computer-aided design (CAD) software.\nExperience with 3D modeling and simulation software.\nExcellent problem-solving and analytical skills.\nAbility to work effectively in a team environment.\nStrong communication and interpersonal skills.\nDetail-oriented with the ability to multitask and prioritize tasks.\nKnowledge of industry standards and regulations.\nProficiency in computer-aided design (CAD) software\nExperience with 3D modeling and simulation software\nStrong knowledge of mechanical engineering principles, concepts, and practices\nExcellent problem-solving and analytical skills\nKnowledge of industry standards and regulations\nFirefighting/Plumbing /HVAC\nNFPA /, International and British Standards"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 4",
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Human Resources Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}