{
    "Job ID": "4759330",
    "Description": "AC & Refrigeration TechnicianAn AC & Refrigeration Technician is responsible for inspecting, diagnosing, maintaining and repairing electrical equipment to deliver an excellent Guest and Member experience.What will I be doing?As an AC & Refrigeration Technician, you are responsible for inspecting, diagnosing, maintaining and repairing electrical equipment to deliver an excellent Guest and Member experience. An AC & Refrigeration Technician will also be required to ensure work is done to code and provide assistance during emergencies. Specifically, you will be responsible for performing the following tasks to the highest standards:Attains all refrigeration and A/C trouble reports on daily basis. Guest room trouble is given priority;\nFollows all safety rules and regulations in job, departmental procedures and instructions;\nWorks closely with A/C and Refrigeration Technician/Foreman and peers to carry out preventive maintenance and annual maintenance program\nPerform electrical and gas system troubleshooting\nPerform system checks, system troubleshooting, and refrigerant recovery\nEnsure quality inspections are carried out in line with company standards\nEnsure good relationships are built with internal and external customers\nPerform special projects and other responsibilities as assignedSkills",
    "Skills": [
        "Current working knowledge of general maintenance and engineering work\nExperience in the Maintenance Department of a large hotel, hospital, ship, and/or restaurant complex or similar\nStrong work ethic\nA passion for delivering great customer service\nAbility to work without close supervision and within established timeframes"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "United Arab Emirates",
        "Age": "Min: 19 Max: 28"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Installation & Technical Services; Technical Maintenance & Repair",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}