{
    "Job ID": "4759710",
    "Description": "Drive customer satisfaction and revenue growth through strategic relationships as a Field Specialist at the and at our Operations Base at Dammam 2nd Industrial City, Eastern, Saudi Arabia Facility.We are a small independently owned company with over 60 years of oilfield experience combined. We have worked hard to bring a safer, more cost-efficient way of drifting pipe while running in the hole. Our number one goal for creating this product is Safety, Rig Cost and Efficiency. Partnered with Saja Energy Co. and through a commitment to excellence, a dedicated workforce, and an adaptation of leading technologies, D2 Oil Tools and Saja Energy Co. will deliver quality, innovative, cost-effective products and services.You will help distinguish our company with professionalism, best practices and deliverables that build customer loyalty. Among the responsibilities of the role are:Manage Customer AccountLoad Outs from Facility to Rig Location both onshore and offshore\nCommunicate with Rig and Operator\nTrack Daily Cost\nComplete Brief and Debrief\nSupervise Rig Crews on Running ToolCapture Monthly RevenueEngagement on Rig Up/DownsMinimize HSE Risks\nEnsure Procedural Adherence\nOnsite PresenceEnsure All Procedures Are FollowedWeekly Site AuditsVerify Onsite Personnel Per Customer RequirementsBe Visible and Engaged in Office Communications when not in the FieldManage Service Quality-Related Issues to Client Within 24 HoursSkills",
    "Skills": [
        "All Resumes/CV's Must Be Presented in English and Arabic\nMust Be Available For Immediate Employment.\nSaudi National Preferred. Will Consider In-Country Patriates",
        "The ideal candidate will have the following skills and experience:",
        "High School Diploma or College Degree\nExperience in supervising field operations\nWorking on Drilling Rig with Completion and Drilling Operations\nStrong Leadership, organizational and admin skills\nComputer proficient including MS office products\nCandidates must be able to legally work and reside in KSA\n3 – 5 years oil/gas field experience in completions or drilling\nExperience in creating solutions for customers\nUnderstanding of the industry and the business challenges customers face\nExcellent written and verbal communication skills\nConversational English and Arabic\nTraining and Certifications to Include H2S, HUET, PST and Iqama",
        "If you are ready to become part of our family, apply online here by attaching your C.V./Resume",
        "Industry",
        "Oil & Energy",
        "Employment Type",
        "Full-time"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Saudi Arabia",
        "Nationality": "Saudi Arabia",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Oil & Gas",
        "Company Type": "Unspecified",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}