{
    "Job ID": "4759478",
    "Description": "An established private medical center in Riyadh, Saudi Arabia is seeking a skilled and experienced Internal Medicine Doctor to join their team. The ideal candidate should have a minimum of 2 years of experience in Internal Medicine in KSA and be licensed as an internal medicine doctor to practice in Saudi Arabia. The candidate should be well-versed in diagnosing and treating various medical conditions. The Internal Medicine Doctor will be responsible for providing comprehensive medical care to patients, including diagnosing illnesses, prescribing medications, and providing ongoing treatment and management.Responsibilities:Conduct thorough medical assessments and evaluations of patients.\nDiagnose and treat various medical conditions, including chronic illnesses.\nPrescribe medications and provide ongoing treatment and management.\nOrder and interpret diagnostic tests, such as blood tests and imaging studies.\nCollaborate with other healthcare professionals to develop and implement treatment plans.\nProvide education and counseling to patients and their families regarding their medical conditions and treatment options.\nMaintain accurate and up-to-date medical records and documentation.\nStay informed about the latest advancements in Internal Medicine and participate in continuing medical education.\nAdhere to all ethical and professional standards set forth by the medical center.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Minimum of 2 years of experience in Internal Medicine inside KSA\nValid license to practice Internal Medicine in Saudi Arabia.\nExcellent diagnostic and problem-solving skills.\nStrong communication and interpersonal skills.\nAbility to work well in a multidisciplinary team.\nDetail-oriented and able to maintain accurate medical records.\nCommitment to providing high-quality patient care.\nAbility to stay updated on the latest advancements in Internal Medicine.\nFluency in English and Arabic.\nProficiency in electronic medical records systems.\nKnowledge of medical laws and regulations in Saudi Arabia.\nAbility to effectively communicate complex medical information to patients.\nStrong problem-solving and critical-thinking skills.\nEmpathy and compassion towards patients."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Medical Clinic",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Medical, Healthcare, and Nursing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}