{
    "Job ID": "4759622",
    "Description": "The Purchasing Specialist is responsible for sourcing, negotiating, and procuring materials, equipment, and services for the engineering and trading group. The ideal candidate will have a strong understanding of the engineering and trading industry, as well as experience in purchasing and supply chain management.identifying potential suppliers and conducting research to determine the best options for the companyEssential Duties and Responsibilities:Negotiating prices and contract terms with suppliers,\nissuing purchase orders, RFQ’s, and maintaining accurate records of all purchases,\nTracking deliveries and following up on any missing or delayed items.\nProcessing and issuing payments to vendors in a timely manner, including electronic and check payments.\nReconciling vendor accounts and resolving any outstanding issues.\nEnsuring proper coding of invoices, matching to purchase orders, and obtaining approvals as necessary\nMaintain accurate inventory recordsSkills",
    "Skills": [
        "Bachelor's degree in supply chain management, logistics, or a related field.\n3+ years of experience in purchasing or supply chain management.\nUnderstanding of the engineering and trading industry.\nProficient in Microsoft Office Suite (Excel, Word, PowerPoint).\nExcellent communication and negotiation skills.\nAbility to work independently and as part of a team.\nFamiliar with local and international tax and customs law and regulations\nStrong command of English language , written and spoken."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Administration Support Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}