{
    "Job ID": "4759130",
    "Description": "We are hiring a Finance Manager (Real estate) for one of our clients in Doha.Candidates who have the required qualifications and good experience may apply.Skills",
    "Skills": [
        "Minimum 7+ years of experience as a Manager in Real Estate/Infrastructure Advisory, preferably in globally recognized consulting firms/IPCs.\nPostgraduate degree in Finance Management or MBA Finance, or a relevant Bachelor's degree with additional certifications such as CFA/CAIA, etc.\nProficient in MS Office, especially PowerPoint and Word.\nStrong grasp of Advanced Financial Modeling, including macros and familiarity with Power BI is a bonus.\nSkilled in report writing and presenting to small to mid-sized groups\nAbility to understand area programs and real estate terminologies and knowledge of IFRS is advantageous.\nIn-depth understanding of demand model development for real estate core assets.\nProficiency in evaluating demand-supply gaps and conducting comprehensive market assessments (stock, supply, vacancy, pricing, etc.).\nExpertise in location and site assessment, strategic positioning, Value-for-Money (VFM) analysis, and project risk assessment.\nComprehensive knowledge of Corporate Finance, including financial analysis and Real Estate Asset Valuation using the Discounted Cash Flow (DCF) approach.\nProfound expertise in either Bid Advisory or Procurement Advisory, or both.\nNationality Preferred: East European, Malaysian, and Sri Lankan"
    ],
    "Preferred": {
        "Years of Experience": "Min: 7",
        "Nationality": "All Eastern European Countries; Malaysia; Sri Lanka",
        "Degree": "Master's degree"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Real Estate; Facilities & Property Management; Financial Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$8,000 - $9,000",
        "Number of Vacancies": "1"
    }
}