{
    "Job ID": "4759881",
    "Description": "We are seeking a passionate and dynamic Fashion Sales Consultant to join our team in Doha, Qatar. The ideal candidate should have a strong background in fashion retail sales and be able to provide exceptional customer service. As a Fashion Sales Consultant, you will be responsible for assisting customers in finding the perfect clothing and accessories to suit their style and preferences. You will also be responsible for maintaining the store's visual merchandising standards and ensuring a positive shopping experience for all customers.Responsibilities:Greet and assist customers in a friendly and professional manner\nProvide personalized shopping recommendations based on customers' preferences and style\nAssist customers with trying on and fitting clothing and accessories\nMaintain knowledge of current fashion trends and product offerings\nProcess customer transactions accurately and efficiently\nEnsure the store is clean, organized, and well-maintained\nParticipate in regular inventory counts and restock merchandise as needed\nBuild and maintain relationships with customers to foster repeat business\nStay up-to-date on sales targets and actively work towards achieving them\nAdhere to company policies and procedures at all timesSkills",
    "Skills": [
        "Preferred Candidate:",
        "1-5 years of experience in fashion retail sales\nPassionate about fashion and staying up-to-date with the latest trends\nExcellent interpersonal and communication skills\nStrong customer service orientation\nAbility to work in a fast-paced and dynamic environment\nDetail-oriented with strong organizational skills\nFlexible and adaptable to changing priorities\nAbility to work well independently as well as in a team\nProficient in using point-of-sale systems and other retail software\nFluency in English; knowledge of Arabic is a plus\nStrong sales and negotiation skills\nExcellent product knowledge\nAbility to multitask and prioritize\nAttention to detail\nAbility to work under pressure\nKnowledge of customer service principles\nAbility to work flexible hours, including evenings and weekends\nAbility to lift and carry heavy objects\nKnowledge of fashion styling techniques\nUnderstanding of customer buying behavior"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 5"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}