{
    "Job ID": "4759276",
    "Description": "Procurement Engineer (Civil Engineer- Finishes) – MakkahJob location: Makkah, KSAProject: High rise hotel projectSalary budget: SAR 10k - 14k gross full package·      This position reports to the Procurement Manager.·      Hands on role with no direct reports.·      The candidate should be well versed with Civil, Capital Goods, FF&E, OS&E and other bought out items. Conduct spend analysis and opportunity assessments reports. Should have minimum of 10 years of experience in FF&E and Hospitality procurement. Candidates who have worked on hotel projects with focus on global sourcing would be preferred.·      Will be responsible for adherence to scope of works and specifications and is responsible for all ordering, administration, and delivery of Capital goods like Capital Goods, Fitouts, FF&E and ID related items·      Responsibility to ensure that the supply is made on time, within budget and in the most efficient manner with a focus on total cost of ownership.·      Develop sourcing strategies to achieve cost savings and improve quality and service levels by identifying opportunity areas such as product standardisation and supplier consolidation.·      Identify, empanel, pre-qualify Contractors/Consultant services after assessing experience and fit-for the brand, culture and business goals·      Create bid documents and manage competitive sourcing events, analyse responses, undertake costings, and cost comparativesRecommend alternative options based on budget or supply locations and lead times·      Support management in final commercial negotiations and supplier selection·      Incorporate Total value of ownership into sourcing events and decisions·      Coordinate with legal team on the review of proposed contracts with respect to financial terms, intellectual property rights, service terms with a focus on Risk management, purchase obligations and rights and conformance to company policies and applicable legal guidelines. Seek expert opinions and internally consult as necessary.·      Support cross-functional stakeholders with supplier implementation and facilitate change management with colleagues and key contacts throughout the organisation.·      Deliver information about completed agreements to partners; publicise agreements in order to achieve greater participation and savings·      Employ a data-driven approach to develop long-term plans including forecasted costs, savings targets and planned projects·      Should have good contacts in low-cost sourcing countries like Indonesia, Thailand, China, Vietnam etc for procurement of various products. Strong focus on Value Engineering and alternatives to ensure that total value of Procurement is maximised.·      In line with SRM program, evaluate suppliers to continually enhance working practices, more open collaboration and lead continuous improvement initiatives·      Implement and achieve KPI/SLA targets + metrics to formalize assessment and reporting of Contractor, Consultant, Supplier performance as well as establish goals and metrics to track the success of implemented process solutions and continually evaluate and adjust as necessary·      Implement automated procurement and invoicing solutions with Strategic Suppliers·      Apply approved best practices and procurement policies to ensure adherence and compliance by all employeesSkills",
    "Skills": [
        "Civil Engineer\nEffective verbal and written communication skills.\nExperienced in identifying avenues to reduce expenses associated with the project and the corresponding purchases.\nProven professional experience in procurement engineering and handling multiple aspects of the project for its successful execution.\nRemarkable verbal and written skills to handle organizational interactions with suppliers, clients, and employees."
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Age": "Min: 30"
    },
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "2"
    }
}