{
    "Job ID": "4759422",
    "Description": "Our client is into Entertainment industry. They are now looking for Officer – Health, Safety & Environment.      Roles & Responsibilities: Conducts, assist and / or facilitate regular assessment and hazard identification activities at different areas of the Park, including but not limited to rides and other attractions, food and beverage outlets, retail outlets, entertainment venues, common areas, office and BOH areas, infrastructure, and other support facilities.\nIdentify and propose effective measures to control the hazards and associated risks based on findings of risks assessment activities.\nFormulate and implement regular monitoring system to check implementation of the measures in place at different areas through regular checks and inspections.\nConduct independent investigation and submit official reports to Sr. Supervisor or QHSE Manager and / or QHSE Department Head for occurring incidences which will include identification of root causes, corrective action plans and suggestion to prevent recurrences and other requirement of the incident reports process.\nEvaluate other reports pertaining to any HSE related incident in the Park.Skills",
    "Skills": [
        "Qualifications:",
        "Graduate of an Engineering Degree\nPossessing Degree or NEBOSH Certificate or Diploma related to HSE\nAdept with local and Federal Laws and applicable international laws related to HSE",
        "  Preference:",
        "Minimum three (3) years’ experience in a similar role\nWorked in similar position with wide exposure in theme parks, attractions, hotels, and resorts, or in any leisure and entertainment industry\nExperience in integrated management system (ISO 9001, OHSAS 18001 / ISO 45001, ISO 14001)\nCapable in writing policies, procedures, plans, manuals, and other similar documents\nHighly skilled in various computer applications\nProven business writing, reporting and presentation skills\nHigh level of policy and procedure writing\nStrong administrative skills"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}