{
    "Job ID": "4759592",
    "Description": "Job Placement Senior CoordinatorCoordinate with CBO’s, beneficiaries and stakeholders to conduct Workforce Development component activitiesCore Responsibilities:Plans, schedules and coordinates special network events and job fairs, with employer’s partners to match job seekers with open vacancies  contribute to the business networks and enhance sales\n Reports on the efficiency and impact of linkages and marketing efforts developed for micro and small business beneficiaries.\nConducts mapping based on the market assessment in the designated areas to identify the employment needs and criteria.\nConduct market assessment in the designated areas to identify the employment needs and criteria. \nEstablishes partnerships with employers, training providers in the designated areas to place JRF beneficiaries in entry-level jobs or professions jobs.\n Sources beneficiaries based on employers' needs and criteria.\nPlaces beneficiaries in decent jobs that adhere to the Jordanian labor law and follow up with employers and beneficiaries periodically.\nFollows up with employers and beneficiaries periodically. \n Produces statistical, analytical, and narrative reports, including reports on reporting requirements, project expiry dates as well as any other reports.\nEvaluate the project activities, establish and implements mechanisms to systematically assess the achievement of results.\nReviews and updates the WFD work plan throughout the program with guidance and management support from the Project Manager.\n Review and update work plan throughout the program with the guidance and management support from the Project Manager. \nEnsures that the WFD coordinator staff is implementing the project activities in accordance with the terms.Skills",
    "Skills": [
        "Qualifications:",
        "Bachelor's degree in Business Administration, or any related field.\nStrong English and Arabic language skills (written and spoken).\n5-7 years of experience.\nExperience working on Livelihood projects."
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Nationality": "Jordan",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Aqaba, Jordan",
        "Company Industry": "Non-profit Organization",
        "Company Type": "Non-Profit Organization",
        "Job Role": "Training and Development",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}