{
    "Job ID": "4759335",
    "Description": "We are looking for a focused data entry clerk to continuously update our company's databases. The data entry clerk will liaise with and follow up with employees within the company as well as with customers to collect information. The data entry clerk will capture the data into relevant databases in a timely and accurate manner. You will identify and correct errors, and swiftly bring them to the attention of relevant parties where necessary.Data Entry Clerk Responsibilities:Gathering invoices, statements, reports, personal details, documents and information from employees, other departments and clients.\nScanning through information to identify pertinent information.\nCorrecting errors and organizing the information in a manner that will optimize swift and accurate capturing.\nCreating accurate spreadsheets.\nEntering and updating information into relevant databases.\nEnsuring data is backed up.\nInforming relevant parties regarding errors encountered.\nStoring hard copies of data in an organized manner to optimize retrieval.\nHandling additional duties from time to time.Skills",
    "Skills": [
        "Data Entry Clerk Requirements:",
        "High school diploma.\n1+ years experience in a relevant field.\nGood command of English.\nExcellent knowledge of MS Office Word and Excel.\nStrong interpersonal and communication skills.\nAbility to concentrate for lengthy periods and perform accurately with adequate speed.\nProficient touch typing skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Nationality": "All African Countries; Bangladesh; India; Nepal; Pakistan"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Administration",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "12"
    }
}