{
    "Job ID": "4760528",
    "Description": "Providing excellent customer service to players by assisting them with game instructions, addressing inquiries, resolving complaints, and creating a welcoming and enjoyable gaming environment.\nSetting up and maintaining skill games establishments, including operating system updates, performing game booth routine checks and address report for any technical issues.\nEnsure compliance with skill games policies and procedure.\nCollect payment for skill games sessions and distribute prizes or payouts.\nPlan and execute game offerings to attract new customers and retain existing ones.\nMaintaining accurate records of redemption and pay out transactions earned by the customers.\nEnsure a safe and secure gaming environment by enforcing safety measure, monitoring player behaviors and addressing any incidents, customer complaints and potential security concerns.\nCollaborate with Inventory Control Specialist and Site Manager for any requirements and issues in the gaming establishments and redemption goods.\nKeeping the gaming area clean, organized, and well-maintained.Skills",
    "Skills": [
        "Physical Demand: Ability to stand for extended periods of time.\nAbility to work independently and as part of a team.\nAbility to work flexible hours, including weekends and evenings.\nOrganized and able to work with minimum supervision.\nWritten and verbal communication skills. Able to convey information effectively.\nAbility to work under pressure."
    ],
    "Preferred": {
        "Career Level": "Entry Level",
        "Years of Experience": "Min: 1 Max: 3",
        "Residence Location": "Kuwait",
        "Degree": "Certification / diploma",
        "Age": "Min: 20 Max: 40"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Entertainment; Amusement & Recreation Facility; Retail & Wholesale",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "50"
    }
}