{
    "Job ID": "4760518",
    "Description": "Develop and implement procurement strategies to meet the company's needs\nIdentify and evaluate potential suppliers, negotiate contracts, and establish relationships\nMonitor inventory levels and ensure that materials are ordered in a timely manner\nCoordinate with internal departments to determine their procurement needs and specifications\nManage the procurement process from start to finish, including issuing purchase orders, tracking deliveries, and resolving any issues that may arise\nEnsure that all purchases are made in compliance with company policies and procedures\nMaintain accurate records of all procurement activities, including contracts, invoices, and delivery documents\nMonitor market trends and changes in supplier pricing to ensure the company is getting the best value for its money\nIdentify opportunities for cost savings and process improvements within the procurement function\nStay up to date on industry best practices and new developments in procurementSkills",
    "Skills": [
        "5+ years of experience in a Procurement role.\nJoin immediately.\nTransferable iqama.\nFluent in English.\nExperience in Pipeline, Infrastructure, GRP, GRE, Valves, Tanks, Water Sectors, Construction & Marine projects, Pipework, and Wastewater Treatment plants.\nMaintaining standards in the quality of material supply, time schedule as per project needs.\nMS Office works required.",
        "Preferred Candidate:",
        "Bachelor's degree in business administration or a related field\nProven experience in procurement or supply chain management\nStrong negotiation and communication skills\nExcellent analytical and problem-solving abilities\nAbility to work well under pressure and meet tight deadlines\nAttention to detail and a high level of accuracy\nProficiency in Microsoft Office and other relevant software\nKnowledge of procurement regulations and best practices\nAbility to work independently and as part of a team\nStrong organizational and time management skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5 Max: 5",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "",
        "Company Type": "Unspecified",
        "Job Role": "Purchasing and Procurement",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}