{
    "Job ID": "4760924",
    "Description": "A sales representative is responsible for promoting and selling products and supplies in all school branches. The ideal candidate will have excellent communication and negotiation skills, as well as a strong ability to build and maintain relationships with clients. The sales representative will be responsible for achieving sales targets and ensuring customer satisfaction. This role requires a proactive and self-motivated individual who is able to work independently and as part of a team.Responsibilities:Identify potential customers and generate leads through various channels.\nUnderstand the needs and requirements of customers and present appropriate solutions to meet their needs.\nDemonstrate and explain product features and benefits to customers.\nNegotiate and close sales deals with customers.\nProvide after-sales support and resolve customer complaints or issues.\nStay updated on industry trends, market conditions, and competitors' products.\nPrepare sales reports and maintain accurate documentation of sales activities.Skills",
    "Skills": [
        "Preferred Candidate:",
        "Excellent communication and interpersonal skills.\nStrong negotiation and persuasion skills.\nAbility to work independently and as part of a team.\nGoal-oriented and results-driven.\nCustomer-focused with a strong ability to build and maintain relationships.\nProactive and self-motivated.\nAbility to adapt to changing market conditions and customer needs.\nStrong problem-solving and decision-making skills."
    ],
    "Preferred": {
        "Years of Experience": "Min: 0 Max: 4",
        "Residence Location": "Kuwait",
        "Nationality": "All Arab Countries"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}