{
    "Job ID": "4760325",
    "Description": "JIGPC is Jazan Integrated Gasification & Power Company; a $12B joint venture between Air Products, Air Products Qudra, ACWA Power, and Saudi Aramco established to acquire, commission, start up, and operate the IGCC gasification and power facility at Jazan Economic City.The candidate will be working in the Project Delivery group, reporting to Project Director, at the IGCC facility located in the Jazan Economic City (JEC) in the southwest portion of Kingdom of Saudi Arabia. Project Delivery coordinates with and supports all functions to achieve a common goal of safe, reliable, and efficient commissioning, start up, and operations of the IGCC facility. Experience in the execution of projects in a Brown Field, Oil & Gas and/or Power Plant working environment with multiple SIMOPS during commissioning and start up is highly desirable. The successful candidate will:Ensure the Projects entrusted with are executed in a safe and timely manner within the stipulated quality requirements / standards.\nEnsure adequate and effective communication within and across the project team, internal and external stakeholders\nEnsure technical and construction execution risks are identified and managed.\nEstablish and maintain relationships with the senior management, operations, maintenance and engineering to achieve success.\nEnsure progress status is transparent and accurately reported out on a periodic basis.\nManage Construction Department in support of over 100 projects in the brownfield environment.Nature and Scope:Leadership of diverse construction teams in a brownfield environment to achieve the goals and objectives set by the project team and the business.\nConstruction / Project Management skills to manage a diverse group of multidiscipline Construction Managers, Construction Leads and Construction Engineers\nKnowledge of and familiarity with Saudi Aramco Engineering Standards, Procedures, Best Practices and Inspection Procedures (SAES, SAEP, SABP and SAIP), MOC and permit to work systems in the operating plantThis position is accountable for the following end results:Works with Project Managers to develop a scope and schedule of Projects during the construction phase.\nReports to the Project Director as a General Construction Manager on assigned projects during Engineering, Procurement, Construction and Commissioning phases of the project. Coordinate with Company Engineers and Construction Contractor during the project execution.\nExecutes assigned work in accordance with the Project Execution Plan and applicable Project Procedures and Standards. Ensures that the work follows applicable HSE, Quality standards and procedures always.\nLeads the construction team of direct and indirect reports to deliver projects safely according to the agreed scope, quality and schedule.  \nDelivers value through the key review stages including HAZOP and Constructability.\nManages Procurement activities by the Engineering Contractor and internal departments in accordance with the agreed scope of work of the project.\nUnderstands the technical content of Process, Mechanical and other Engineering documents. Coordinates reviews of the documents and ensures compliance with the overall objectives of the project and needs of the business.\nWith the team of construction team manages the interfaces between the various parties on the project including Engineering, Contractors, Vendors, Operations, Maintenance, HSE and Quality.\nAssigns and plan execution of the field work to direct reports in conjunction with the Construction Management, Quality Management and HSE teams as well as Contractors and Vendors.\nEnsures that the contractors are progressing within the agreed manhour and in accordance with project schedule. Reports any deviations and applies agreed corrective actions where required.\nProvides input to the project controls team for schedule reporting.\nEnsures that records are managed in the electronic filing system as required by the company procedures.\nEnsure that all scope changes are properly raised and recorded to cover manhours and schedule impacts and coordinate on review of change order documents.Skills",
    "Skills": [
        "Bachelor's or Master’s degree in Construction Management, Engineering or Project Management.\nMinimum 20+ years of experience in Construction / Project Management in Oil & Gas, Power plant and/or process industry. Commissioning, plant Start-Up and Brownfield experience is a must.\nProficient with Construction Management and Business processes including planning, contract management and procurement, Management of Change, Control of Work, Quality Management Systems and EHS management systems.\nUnderstanding of Saudi Aramco MOC and permit to work systems in the brownfield environment is a must.\nMust have strong leadership and multi-discipline coordination skills and be able to plan and execute work with the construction team assigned to support execution of multiple projects.\nHardworking, proactive and possesses teamwork attitude with leadership and problem-solving skills.\nExcellent English communication (written and verbal) skills.\nCompetent in using MS word, Excel and PowerPoint applications."
    ],
    "Preferred": {
        "Years of Experience": "Min: 18",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 58"
    },
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Oil & Gas; Chemicals Manufacture; Petrochemicals & Refined Petroleum Products Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Construction and Building",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}