{
    "Job ID": "4760912",
    "Description": "1. Vendor Relationship Management: - Maintaining coordinal relationship with the vendor, ensuring that the vendor objectives and strategies are planned, being a source of Business Intelligence to the vendor, negotiating a win-win deal with the vendor, formulating and implementing returns process such that partners and company’s’ interest is safeguarded.2.Customer Relations management: -Engaging with customer on periodic basis, Understanding needs and giving Solutions, dealing with the issues and addressing them through engagement with relevant stake holders3.Inventory management: - Inventory and sell out planning, holding optimum inventory without blocking huge cash flow, making decisions and moving the slowing moving inventory at right time, Optimizing Inventory and AR in the market.4. Maintaining a right product mix to balance margins and demand.5. Stakeholder management: - Managing the stake holders, complying with the requirements of different bodies, co-operating with stake holders while safeguarding the organizations and customer interest, etc.6. Compliance : - Ensuring that we stay compliant to statutory/ vendor requirements7. Increasing Channel Breadth and activating the existing customers whom we have not billed8. Data Management and analysis: - Maintaining sales records, doing analysis, presenting the finds to the senior management and auctioning on the same.9. To obtain information about competition which will lead to proper planning.10.To engage OEMs on appropriate pricing supports, marketing activities and ensure that appropriate claims are made on OEMs as at when due.11.To follow up on product sales receivable and ensure that there are no overdue invoices.12. To plan and execute marketing activities that facilitate sales13. To keep proper record of sales, inventory, sales receivables, credit limit etc.Skills",
    "Skills": [
        "Learning Agility.      \nSensitivity to Diversity.\nBusiness Acumen.    \nNegotiation Skills.      \nDecision Making.     \nAnalytic thinking.     \nFinancial acumen     \nLeadership Skills "
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Residence Location": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}