{
    "Job ID": "4760355",
    "Description": "As a waiter, you will be responsible for providing exceptional customer service by warmly welcoming guests, taking accurate orders, and ensuring a smooth dining experience from start to finish.\nSwiftly clearing and setting tables for incoming guests, you'll maintain a tidy and organized dining area throughout the entirety of your shift.\nMeticulously upholding hygiene and safety protocols, you'll handle food and drinks with the highest degree of attentiveness, accurately manage transactions, and guarantee the total contentment of each patron.\nYour commitment to adhering rigorously to hygiene and safety regulations will be reflected in your meticulous handling of food and drinks, precise payment processing, and unwavering dedication to guest delight.\nTaking charge of promptly cleaning and resetting tables for new customers, you'll guarantee a clean and well-organized dining space throughout the duration of your work shift.\nEffortlessly clearing and reconfiguring tables for arriving diners, you'll ensure a clean and well-structured dining area remains consistent throughout your working shift.Skills",
    "Skills": [
        "Adaptability: Able to thrive in fast-paced and high-pressure environments, quickly adjusting to changing circumstances, and effectively multitasking to fulfill the needs of multiple tables simultaneously.\nProficient in the art of upselling, adeptly recommending daily specials, beverages, and desserts to enhance the dining experience and contribute to increased revenue.\nPossesses extensive knowledge of the menu, able to offer detailed explanations of dishes, recommend complementary choices, and accommodate diverse dietary requirements.\nExhibits a deep understanding of the menu, skillfully describing dishes, proposing suitable combinations, and readily adapting to meet guests' unique dietary preferences.\nRecognized for strategic upselling abilities, employing persuasive communication to introduce appetizing specials, beverages, and desserts that enhance the overall meal."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 2",
        "Age": "Min: 18 Max: 35"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Hospitality and Tourism",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}