{
    "Job ID": "4760559",
    "Description": "Objectives: To create commercially, strategically and technically viable conferences and workshops for the company based on market research and space and industry requirements.Key Responsibility Areas (KRAs):Research and Analysis\nConduct in-depth market research to identify industry trends, emerging topics and market demands.\nAnalyze competitor events and industry benchmarks to gain insights and identify unique selling points for conferences and workshops.\nStay up to date with industry news, regulations and technological advancements relevant to the events industry.Event Conceptualization and StrategyDevelop conference and workshop concepts that align with market trends and meet the company's strategic objectives.\nIdentify target audience segments and their specific needs and preferences.\nCreate a compelling value proposition for each event, highlighting its unique selling points and benefits for attendees.Program Development and Content CurationCollaborate with subject matter experts, industry leaders and speakers to develop relevant and impactful event programs.\nCurate engaging and informative content that addresses the needs and interests of the target audience.\nEnsure a balance of keynote presentations, panel discussions, workshops and networking opportunities to create a comprehensive event experience.Speaker and Delegate Relationship ManagementIdentify potential speakers and delegates who are industry experts or influential figures.\nEstablish and maintain cordial relationships with speakers and delegates, ensuring their active participation and engagement.\nCommunicate and coordinate with speakers and delegates to secure their availability and ensure their appearance at the event.Technical Planning and ExecutionWork closely with technical teams and vendors to ensure the technical feasibility and seamless execution of conferences and workshops.\nIdentify and recommend suitable event venues, taking into consideration technical requirements, space availability and logistical considerations.\nCoordinate with audiovisual, lighting and other technical suppliers to ensure the smooth operation of event equipment and technology.\nEvaluation and Improvement\nConduct post-event evaluations to assess the success and effectiveness of conferences and workshops.\nAnalyze attendee feedback, performance metrics and financial results to identify areas for improvement.\nImplement lessons learned and make recommendations for future events to enhance the overall event experience.AccountabilitySole accountability and responsibility of all assigned task, proper reporting and communication.Skills",
    "Skills": [
        "Key Performance Indicators (KPIs):",
        "Successful Launch of Commercially Viable Events (Based on revenue targets and profitability)\nNumber of Attendees and Market Penetration\nAttendee Satisfaction Ratings and Feedback\nSpeaker and Delegate Attendance (Percentage of confirmed speakers and delegates who attend)\nSponsorship and Partnership Acquisition\nTechnical Execution and Quality of Event Production\nBudget Adherence and Cost Management\nStakeholder Satisfaction and Feedback"
    ],
    "Preferred": {
        "Years of Experience": "Min: 1 Max: 3",
        "Gender": "Female",
        "Nationality": "Oman"
    },
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Events Management",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,000 - $1,500",
        "Number of Vacancies": "1"
    }
}