{
    "Job ID": "4760646",
    "Description": "About Us: Urooj Middle East FZE is a leading Paper and Pulp Trading Company with a strong presence in the industry. We are dedicated to excellence in our operations and are currently seeking a skilled and detail-oriented Accountant to join our dynamic team. This role is essential to maintaining the financial health of our organization and ensuring accurate financial records.Position: AccountantResponsibilities:Financial Recordkeeping: Maintain accurate and up-to-date financial records for the company, including accounts payable, accounts receivable, and general ledger entries.\nFinancial Statements: Prepare monthly, quarterly, and annual financial statements, including income statements, balance sheets, and cash flow statements.\nBudgeting and Forecasting: Assist in budget preparation and forecasting to support financial planning and decision-making.\nAccounts Payable: Manage the accounts payable process, including verifying invoices, preparing payments, and reconciling statements.\nAccounts Receivable: Oversee accounts receivable, ensuring timely collection of outstanding invoices.\nBank Reconciliation: Reconcile bank statements and maintain a clear understanding of cash flows.\nFinancial Compliance: Ensure compliance with financial regulations and company policies, and assist with audits as needed.\nTaxation: Prepare and file tax returns and liaise with external tax advisors to ensure accurate and timely compliance.\nFinancial Analysis: Conduct financial analysis to identify trends, variances, and opportunities for cost control and revenue enhancement.\nProcess Improvement: Continuously evaluate and enhance financial processes for increased efficiency and accuracy.Skills",
    "Skills": [
        "Requirements:",
        "Bachelor's degree in Accounting, Finance, or a related field.\nProven experience (minimum 3 years) as an Accountant, preferably in a trading or manufacturing company.\nStrong knowledge of accounting principles, financial regulations, and taxation.\nProficiency in accounting software and MS Excel.\nAttention to detail and accuracy in financial recordkeeping.\nExcellent analytical and problem-solving skills.\nEffective communication skills and the ability to work as part of a team.\nKnowledge of international trade and experience in multi-currency accounting is a plus."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Forestry & Logging; Trading & Commodity Trading",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}