{
    "Job ID": "4760758",
    "Description": "Faham Doors is currently looking to recruit an energetic Sales Engineer with experience in a similar role for at least 3 - 5 years.The candidate for this position will excel at creating and closing new opportunities. By using a consultative approach to selling, the suitable candidate will use their expertise to identify and qualify leads, leading to sales opportunities with both new and existing customers.As well the candidate should be a sales closer-hunter; to close sales and hunt for new sales opportunities. Must be an excellent team player to help in increasing total sales and achieving the desired team target.Responsibilities:Explaining and guiding the customers about the Faham Doors products and services and presenting them the showroom display products.\nMeet and exceed sales targets.\nInbound sales inquiries closing.\nHandle the follow-up, customer visit, negotiations, and the deal closing.\nPreparing the quotations and negotiations.\nReminding the customer with the contract terms and the site readiness conditions.\nEstablishing new, and maintaining existing, relationships with customers.\nManaging and interpreting customer requirements.\nNegotiating and closing sales by agreeing terms and conditions.\nAdministering client accounts.\nPreparing and presenting sales report to the management.\nCollaborate with team to understand customer requirements and provide sales support.Qualifications:Preferably with prior experience in construction background.\n3-5 years of experience in sales with engineering background.\nTechnical sales experience is required.\nStrong written and verbal communication skills.\nHands-on experience with CRM software is a plus.Skills",
    "Skills": [
        "Sales Skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 3",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}