{
    "Job ID": "4760686",
    "Description": "Work with Architects, Designers, Planners and Pune/Regional Leads to produce industry leading 3D modeling, image creation (CGI) and animations.Utilizes the latest technology in real-time simulation/ rendering software and techniques to produce digital illustrations to graphically show the underlying design intent and vernacular in a way that is easily understood.Creation / preparation of 3D models, renderings, photomontages illustrating before-after scenarios for planning applications, walkthroughs and fly throughs at various stages of project.Understand inputs received in CAD, Revit, Infraworks, Civil 3D softwares for proposed facilities and infrastructure.Undertake 3D modelling design of AEDesigns  projects in the buildings, community development and other sectors as needed.To create the Design outputs as per the client requirements.Work on project from concept designs to detailed design stages using the latest skills and software.Contribute to the discipline development.Skills",
    "Skills": [
        "Years of Experience: overall 10-12 years of work experience out of which more than 8 years of experience managing 3D-technology based projects.",
        "Degree qualified (or equivalent) in Architecture, Industrial Design/ Product Design/ Interior Design, Engineering or equivalent OR Bachelor of Arts with diploma in computer graphics, 2D/3D animation or equivalent.",
        "Proficient in 3D visualization softwares such as 3DS Max; Adobe Suite softwares (Photoshop, Premiere Pro, After Effects, Illustrator, InDesign, etc.), Twin motion; Vray; Unreal Engine; Unity, Lumion; Enscape; Sketchup; AutoCAD; Google Earth; Global Mapper; etc. ArcGIS & CityEngine (optional)",
        "Experience in computer gaming industry is desirable. Sound knowledge of VR/ augmented reality environments, interactive modelling would be preferred.",
        "Experience in using Revit software and producing detailed plans/sections will be an added advantage.",
        "Should be able to work alone or as part of a team, taking ownership for assigned deliverables & outputs.",
        "Strong in communication skills (written/verbal) and able to contribute effectively to discipline specific discussions.",
        "Practical, ‘hands-on’ and up-to-date experience and eagerness for self-exploration in 3D visualization industry.",
        "Enthusiastic, self-motivated team player, keen to develop with our growing organization.",
        "Dynamic with good organizational skills and able to multi-task."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Interior design",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$500 - $1,000",
        "Number of Vacancies": "1"
    }
}