{
    "Job ID": "4760412",
    "Description": "The Sales Assistant is a developmental role designed to provide comprehensive training, experience, and knowledge in all the aspects of sales within Fresh Express and to prepare them to become future Sales Executives.SalesParticipate in a structured training program to develop sales skills, product knowledge, and industry understanding. (A training program to be shared).\nShadow the Key Accounts Manager to gain hands-on experience and insights into the sales process.\nAssist with administrative tasks such as data entry, sample requests, credit notes, and appointment scheduling.CustomerCustomer Focus: Learning from the Key Accounts Manager through shadowing them on how to become customer-focused and develop the ability to anticipate the needs and the ordering trends of your future customers and exceed their expectations by offering an all rounded service and attention to them.\nCustomer Sales presentations and negotiations: this involves assisting the Key Accounts Manager in the set-up of the Sales Presentations from preparing slides, printing of sales material and ensuring the samples are all ready and well packed.PeopleProduct Knowledge: this includes being very proficient and knowledgeable about the products sold by Fresh Express and having an understanding and ability to clearly communicate the value and benefits of our products and services offered to the customer and be able to share and pass unto his knowledge to his team.\nSales person Check-in: this includes checking in on daily basis through the Unit’s WhatsApp group to inform the unit manager of your whereabouts.\nTime management: This includes the management of your time to effectively and efficiently make the best out of your day, from timely attendance to the time in the office and the time spent per sales call. Absence should be communicated to the Unit Manager/Channel Manager/HR.FinanceCollections: monitor and follow up on the collections and pending invoices and make sure that all your customers are paying as per the Credit Period set and agreed upon.\nPending old unsettled invoices: this includes the follow-up on the payments of all old unsettled invoices and making sure that all documents and proof of delivery is given to the client and getting written confirmation from their accounts that the pending invoices will be paid.Skills",
    "Skills": [
        "This role requires a driven and confident individual who is comfortable in our fast-paced environment and has the ability and willingness to develop their Food and Sales Knowledge.",
        "Strong communication skills verbal / written\nNegotiation Skills Team Work Sales Oriented\nPresentation Skills\nCustomer Service Oriented"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Western European Countries; Greece; Italy"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "5"
    }
}