{
    "Job ID": "4760560",
    "Description": "We are looking for a highly motivated and experienced Learning Coach to join our team. The ideal candidate will have a passion for helping students succeed and be able to create a supportive and engaging learning environment.Responsibilities:Work with students individually and in small groups to provide academic support and enrichment.\nDevelop and implement individualized learning plans (IEPs) for students with special needs.\nCollaborate with teachers and parents to develop and implement effective teaching strategies.\nMonitor student progress and provide feedback to students, teachers, and parents.\nHelp students develop and achieve their academic goals.Skills",
    "Skills": [
        "Requirements: Education & Experience",
        "✓ Must be a Native English Speaker",
        "✓ Level 3 supporting teaching and learning qualification (or) equivalent (or) at least 5 years of experience in the related field",
        "✓ Working in colleges (with ages 16+) supporting/coaching the development of learning and/or performance",
        "✓ Experience in supporting the learning of students; to learn how to learn and apply this learning to their study and skills development.",
        "✓ Experience in working within 3rd Millennium learning environments, and with digital devices and peripherals.",
        "✓ Proven experience in effectively working in the context of both traditional and experiential learning practice.",
        "✓ Proven experience in supporting formative assessment and guiding learners to use this to inform their own progress and attainment.",
        "✓ Proven experience of working in partnership with other colleagues to support the design and delivery of an integrated curriculum."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4"
    },
    "Data": {
        "Job Location": "Dammam, Saudi Arabia",
        "Company Industry": "Higher Education",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}