{
    "Job ID": "4760599",
    "Description": "will change as the business plans develop\nAssess and recommend commercialization road maps for graduated projects\nGenerate new business ideas and assess their feasibility\nScreens independent business proposals using a variety of strategic and technical criteria, with the aim toprioritize the opportunities that will contribute the most towards the LTC strategyProvides functional expertise to determine the capabilities and risks associated with proposed new ventures\nLeads and/or supports negotiation of agreements with external parties\nMentor, train, and develop young professionalsSkills",
    "Skills": [
        " As the successful candidate you will hold a Bachelor’s degree in Engineering, Economics, Business",
        "Administration, Accounting, Finance or a closely related specialty, MBA or a relevant advanced degree is",
        "strongly preferred.",
        "15 years of professional experience in business development, with a strong track record of economic and",
        "commercial evaluations for major chemicals and refining projects, and a deep understanding of associated",
        "operations and integration of assets.",
        "Industry expertise or knowledge of conducting techno-economic feasibility studies. Knowledge of venturing",
        "activities like commercialization, spin-offs or joint venturing, project development.",
        "Having a strong commercial acumen, and the ability to deal with white space is a must as the scope of the role"
    ],
    "Preferred": {
        "Years of Experience": "Min: 15",
        "Nationality": "All Western European Countries; Canada; United States"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Oil & Gas",
        "Company Type": "Recruitment Agency",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}