{
    "Job ID": "4760918",
    "Description": "We are looking for an experienced Accountant to join our team in Kuwait. As an Accountant, you will be responsible for managing financial transactions, analyzing financial data, and preparing financial reports. The ideal candidate should have a strong background in accounting principles and practices, excellent analytical skills, and the ability to work independently. If you are detail-oriented, organized, and have a passion for numbers, we would love to hear from you.Responsibilities:Manage all accounting operations including accounts payable, accounts receivable, general ledger, and bank reconciliations\nPrepare and analyze financial statements, budgets, and forecasts\nEnsure compliance with accounting standards and regulations\nAssist in the preparation of financial reports for management and external stakeholders\nMonitor and maintain accurate records of financial transactions\nReview and reconcile financial discrepancies\nProvide financial analysis and support to management\nAssist in the implementation and improvement of accounting systems and controls\nCollaborate with other departments to ensure effective financial management\nStay up-to-date with industry trends and changes in accounting regulationsSkills",
    "Skills": [
        "Bachelor's degree in Accounting or Finance\nMasters degree is preferred.\nProven working experience as an Accountant\nAdvanced knowledge of accounting software and MS Excel\nFamiliarity with financial regulations and reporting requirements\nStrong attention to detail and accuracy\nExcellent analytical and problem-solving skills\nAbility to work independently and meet deadlines\nGood communication and interpersonal skills\n. Ability to maintain confidentiality of sensitive information"
    ],
    "Preferred": {
        "Years of Experience": "Min: 5",
        "Residence Location": "Kuwait",
        "Nationality": "India",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}