{
    "Job ID": "4760595",
    "Description": "Position Base: Hunza District with frequent travels to Gilgit city and Islamabad.NPAK Energy Limited (NEL), a subsidiary of the Aga Khan Fund for Economic Development (AKFED) and Industrial Promotion Services (IPS), Pakistan, was established as a public-private partnership (PPP) between the Government of Gilgit Baltistan (GB) and, NEL is an integrated energy utility company operating initially in the district of Hunza with the aim of expanding out to other districts of Gilgit Baltistan and other provinces of Pakistan.The CEO must have a strong capability to lead, organize, operate, and set priorities for the entire organization. The NEL CEO will contribute to the development of various Energy projects of IPS across Asia.The NEL CEO's primary responsibilities include:Creates an environment and culture that focuses on fulfilling the company’s mission, vision, and values.\nLeads the operational management of all business departments.\nEnsures the timely submission of month-end financial and operational reviews, and contributes to the development of and participation in corporate-wide strategic planning efforts.\nMonitors company performance by measuring and analyzing results, initiating corrective actions, and minimizing the impact of variances.\nIncreases revenues and income before inter-company allocations and implements operating cost controls in the areas of staffing, supplies, purchased services, etc.\nCommunicates circumstances and events of operations to officers, managers, and other appropriate people to keep all apprised.\nReports regularly to the Board and IPS Regional Energy Team on the overall progress and results against operating and financial objectives and initiates courses of action for improvement.\nDrives the process for mobilizing financial resources from external sources for meeting the Company’s strategic needs and programs, supporting the Regional Resource Mobilization Unit (RMU) and ensuring the highest level of confidence among funding partners in the Company’s operations and impact to position NEL as the implementing partner of choice for energy initiatives.\nDrives the implementation of infrastructure projects in close cooperation with the Regional Project Implementation Unit\nDevelops and maintains a sound, effective organizational structure, and ensures capable management succession, progressive employee training, and development programs.\nAnnually establishes and maintains a board-approved succession plan for current and future potential senior management development.\nAuthorizes and ensures the development of disclosure controls and procedures and ensures that material information relating to the Company is known and communicated.\nAuthorizes and ensures that effective control and co-ordination mechanisms for all operations and activities are in place including the establishment and development of effective internal controls over financial reporting. Ensure the ongoing integrity of the Company’s management information systems.\nEnsures the Company's assets are adequately safeguarded and optimized in the best interests of the shareholders.\nEnsures effective communications and appropriate relationships are maintained with the shareholders of the Company and other stakeholders such as customers, industry, employees, the financial community, regulators, government and donor representatives, AKDN institutions, suppliers, and media.\nManages and oversees the required interfaces between the Company and the public and acts as the principal spokesperson for the Company.\nCarries ultimate responsibility for overseeing the implementation of the Company’s Safeguarding PoliciesSkills",
    "Skills": [
        "A strategic, entrepreneurial, diplomatic, and resilient leader who can articulate a vision and set goals\nAt least ten (10) years of experience as a senior executive at a reputable company, in public administration, or other executive leadership experience is required, of which the last five (5) years must be at executive or leadership levels.\nA university degree in engineering, business administration, finance, or development field\nHigh degree of energy, integrity, and courage as well as the intellectual, organizational, and personal qualities to quickly give and earn respect and cooperation from a diverse constituency.\nProven ability to cultivate, build, and manage a team and healthy organizational culture.\nExcellent communication and listening skills.\nDemonstrated financial acumen.\n Experience working closely with the government on various levels."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Gilgit, Pakistan",
        "Company Industry": "Utilities; Energy & Renewables",
        "Company Type": "Unspecified",
        "Job Role": "Management",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}