{
    "Job ID": "4760773",
    "Description": "Mystery shopper needed in KUWAITانضم الآن إلى برنامج المتسوق الخفينحن نبحث باستمرار عن أشخاص ليكونوا جزءًا من فريق المتسوق الخفي ؛ الأشخاص الذين يمكنهم إخبارنا بتجربة التسوق الخاص بهم لتحسين خدمة العملاء من خلال زيارة المتاجر وتسجيل تجاربهم  وجود خلفية تعليمية محددة أو خبرة سابقة: نحن نقدم توجيهًا تفصيليًا وتوجيهًا لجميع المتسوقين الخفيين لدينا. لذلك إذا كان لديك شغف بالمطاعم والبيع بالتجزئة وترغب في المشاركة في تجربة تسوق مثيرة ، نوع الوظيفة: وظيفة مستقلة وليست وظيفة بدوام كامليعتمد الدفع على رسوم المتسوق وفاتورة الشراء ؛ زيارات التسوق الخفي بدون شراء: تتراوح الرسوم لكل تقرير ما بين 50 و 150 درهم لكل زيارة حسب نوع الزيارة (مكالمات هاتفية ، زيارة بدون حجز ، إلخ.) التسوق الخفى مع زيارات الشراء: نحن نغطي رسوم المنتج / تكلفة الطعام حتى مبلغ متفق عليه مسبقًا( حسب كل زياره ).Job Duties: - Evaluating Customer Service when visiting different stores and other establishments as a Secret Shopper. - Documenting the shopping experience that will be later used for writing a report through an online survey. - Visits can be done after working hours or on the weekends. (on candidate's free time). - Evaluating Customer service in Car Showrooms, Restaurants, Retail Stores and others.Mystery Shopping visits with No purchase: fees per report vary between 50 and 150 AED per visit depending on the visit type (phone calls, walk-in visit, etc.)Mystery shopping with purchase visits:we cover the product fee/ food cost up to a pre-agreed amount that varies between different assignments.Skills",
    "Skills": [
        "Attention to Detail: The ability to observe and remember specific details about a shopping or service experience, such as store layout, employee behavior, and product presentation.\nExcellent Communication: Strong written and verbal communication skills are crucial for providing clear and detailed feedback reports.\nObjectivity: The capacity to remain unbiased and objective while evaluating and reporting on the customer experience, without letting personal opinions or biases influence the assessment.\nReliability: Being punctual and dependable in completing assigned mystery shopping tasks within the specified timeframe.\nObservational Skills: The ability to discreetly observe and evaluate various aspects of the shopping or service process, including customer service, cleanliness, and product quality.\nAnalytical Thinking: The capability to analyze the gathered data and provide constructive feedback and suggestions for improvement."
    ],
    "Preferred": {
        "Residence Location": "Al Fahahil, Kuwait ; Al Khiran, Kuwait"
    },
    "Data": {
        "Job Location": "Al Khiran, Kuwait",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Quality Control",
        "Employment Type": "Part Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}