{
    "Job ID": "4760384",
    "Description": "·        Achieve daily and monthly targets and understand expectations.Maintain buildings, facilities, equipment, and supplies to minimize damage, reduce waste, and control costs.To be part of the Park Operation IT team to deliver first-class IT support and service delivery for Motiongate Dubai.To deploy IT equipment and software, on-site across the park.Provide prompt response and timely updates to all customers for support and services.\nCommunicates effectively and works collaboratively within and with various business units through emails and meetings\nCorporate IT department and IT Service Help desk and IT department within each of the Parks\nAll Employees of Dubai Parks and Resorts includingExternalPartners and external service providers\nCommunicates effectively and work collaboratively with various external vendors and clients through emails and meetings·        Delivering IT support services to all various business operations such as park operation, retail and F&B business and end users.·        Able to trouble shoot systems, network problems and diagnosing and solving hardware or software faults.·        Manage daily support issues on site, and escalating to proper channels when necessary.·        To deploy, maintain IT equipment and software, on site across the park.·        Support the park in various operation roles during busy days.·        Provide prompt response, and timely updates to all customers for support and services·        Ensure that appropriate SLAs are met and set standards are followed in all IT services·        Ensure that all incidents and requests are accurately recorded with Service Desk and actioned upon as per SLA.·        Deliver positive and proactive customer service in-line with the IT Service culture and mission·        Champion and promote Service Improvement on an on-going basis to continually improve quality and user satisfaction with IT Services·        Work and communicate well with other members of the IT Support Team and IT Supervisor, along with the IT Service Desk, Infrastructure and Application support teams·        Manage major events and/or P1 issues on site, escalating to proper channels when necessary·        Keep skills up to date, and contribute with documentations and publications to assist our customers·        Any other duties as may be reasonably requested by the Management TeamSkills",
    "Skills": [
        "Essential",
        "·        Minimum a Diploma in Information Technology /Computer Science and/or relevant field",
        "·        Microsoft Certified Professional (MCP), Microsoft Certified Desktop Support Technician (MCSDT),",
        "·        CompTIA A+ or equivalent certifications.  ",
        "Desirable",
        "·        Excellent skills in excels and power points",
        "·        Strong understanding of hospitality IT support and services.",
        "Essential.",
        "·        Min 2-3 years of IT support role experiences in in hospitality industries such as parks, F&B, Retail operations or hotels.",
        "·        Previous experience in handling Point of Sales (“POS”), other retail or F&B systems.",
        "·        Able to communicate with business users at all levels.",
        "Desirable",
        "·        Have involved in pre-opening of attractions/parks, F&B, retail operations or hotels",
        "·        Have some support experience in supporting ticketing system & turnstiles.",
        "Essential",
        "·        Strong troubleshooting skills in software problem or technical issues.",
        "·        Have supported & implemented POS, other retail or F&B systems.",
        "·        Comprehensive knowledge of computer hardware & software concepts.",
        "Desirable",
        "·        Able and quick learner to learn about the retail, ticketing and F&B business processes."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}