{
    "Job ID": "4760382",
    "Description": "The Specialist System Integration is responsible for providing administrative support for the systems of the department and coordinate with Finance of paymentsProviding these services to ensure that municipal operations are maintained in an effective and efficient manner.Internal.Rides Engineering, Attractions Engineering and Building Management, under the Technical Services team of Motiongate\nAll departmental meetings, various across the board\nManagers within Technical Services\nOperations ManagersAll meetings as per required.Provide administrative support to ensure that daily operations of the systems are maintained in an effective, up to date and accurate manner\nType correspondence, reports and other documents\nMaintain all office files and documentations\nScheduling meetings for the department\nTake minutes of meetings and distribute as appropriately\nCoordinate repairs to all office equipment\nMaintain confidential records and files\nMaintain records of decisions\nArrange for all financials, submissions and procurement activities\nMaintain the Preventive Maintenance records up to date in the tracker and data server\nUpdate the team schedule in the attendance system (Kronos/Oracle or others)\nManage the team request(s) in coordination with the department’s Director and HR\nProviding a receptionist services\nGreet and assist all visitors and suppliers\nAnswer telephone calls\nDirect calls and respond to inquiries\nPerform other related duties as requiredSkills",
    "Skills": [
        "Essential",
        "·        A registered Diploma or Degree in engineering/accounting/ management from a reliable school or university.",
        "·        Certifications of further studies or educational upgrades.",
        " ",
        "Desirable",
        "·        WHSE certifications",
        "·        Heavy / Light, vehicle and equipment licences.",
        "Essential",
        "·        Worked in a theme-park environment, minimum 2 years",
        "·        Worked in a building facilities environment, minimum 2 years",
        "·        Worked with ERP system, e.g. Oracle, SAP, etc.",
        "·        Procurement & financial knowledge",
        " ",
        "Desirable",
        "·        Worked as an installer or service provider or maintaining of rides and attractions",
        "·        Worked as an installer or service provider or maintaining of parts and consumables.",
        "Essential",
        "·        Excellent interpersonal and team building skills",
        "·        Analytical and problem solving skills",
        "·        Effective verbal and listening communications skills",
        "·        Attention to detail and high level of accuracy",
        "·        Very effective organisational skills",
        "·        Effective written communications skills",
        "·        Computer skills including the ability to operate spreadsheet and word processing programs",
        "·        Must be able to trouble-shoot clearly, calmly and safely in the presence of guest and fellow team members.",
        "·        Must possess strong safety sensitivity and ability to work with many different types of mechanical devices.",
        " ",
        "Desirable",
        "·        Understanding/Managing heavy / light equipment",
        "·        Reporting, management skills and communications"
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Entertainment",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Maintenance, Repair, and Technician",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}