{
    "Job ID": "4760424",
    "Description": "Safety supervisors are responsible for the safety performance of their team at all times. \nThey are to enforce all safe systems of work. They ensure the workers follow them to the letter in their work.  \nSafety supervisors conduct safety meetings at least once every month and report that to the management.  \nThe safety supervisor conducts unsafe act audits and reports the outcome to the management head.  \nMake reports on any job yet to be in the safe systems of work. The supervisor updates them immediately into the Safe system of work.  \nHealth and safety supervisors conduct safety Training and other necessary training as fit by the management. \nConducts accident investigation and reporting with other team members. \nMake reports on all health problems of an employee to the management. \nConducts daily, weekly, and monthly safety inspections and documents them for reference.  \nMakes provision for on-the-job training for the workers relating to job instructions and work procedures \nEnsures that they conduct emergency drills at the workplace at specific times \nSets up safety signs and signages at the designated place and ensures they are visible enough for all workers to see. \nEnsures that all injured personnel receive immediate treatment and attention and documents the report to the management. \nThe safety supervisor instructs all employees to inspect their tools daily and report the damaged ones to the appropriate channels for repairs. Skills",
    "Skills": [
        "Must have a minimum of 5 years relevant experience in different project \nCan communicate in English & Arabic  "
    ],
    "Preferred": {
        "Residence Location": "Saudi Arabia",
        "Age": "Min: 25 Max: 48"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Heavy Industry & Metallurgy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Safety",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}