{
    "Job ID": "4760348",
    "Description": "To lead strategic and tactical planning, development, evaluation, and coordination of the Finance division .To secure and manage the organization financial resources to optimize stakeholders’ value and ensure compliance with best practices on regulatory, financial control and reporting requirements.Strategic Responsibilities:Provides active support in developing and implementing organizational strategies by contributing financial & accounting information, analysis, recommendations and provide financial advice on business strategies to Ensures financial sustainability and achieve financial targets and to match donor's requirements.\nLeads the budget planning activity for the organization and sets the framework for annual business planning and budgeting, timelines, and frequency from Department / Function Heads to ensure financial stability.\nFormulates risk management strategies for the organization in consultation with other divisions heads to avoid risks.\nProvides business support on financial analysis and management. Adoption of best practices and unified standards of control, business ethics and implementation of corporate strategies to the senior management.Finance and Planning:Addresses upper tier financial issues such as cash management practice\nLiaises with the internal team to provide assistance with the due diligence or financial appraisal of any project, program or business models\nProvides guidance and advice related to analyses of cash flow, cost controls, and expenses for different functions to identify potential financial opportunities and weaknesses and recommends corrective actions.Financial Control and Governance:Recommends benchmarks for measuring the financial and operating performance of the organization and reviews the guidelines / procedures for foundation financial control ensuring maximization of transparency .\nEnsures efficient and effective management of Foundation's finances through all necessary financial controls, systems and processes and ensures accuracy and integrity of the Foundation's financial records.\nEstablishes and ensures a robust control and governance environment in line with regulatory requirements that are consistent with the organization internal policies and ensures statutory compliances of all systems, processes & accounting practices.\nLiaises with regulators and Government Agencies to ensure compliance and to influence policy matters.\nAnalysis complex financial data, extracting and defining relevant information, interpreting data for the purpose of determining past financial performance and / or to project a financial probability.\nEnsures financial support to the other departments in the development of financial strategies and mechanisms.\nAssists the management in forecasting and preparing the annual budget, while tracking revenues and expenses to ensure adherence with approved budget.\nMonitors and reviews all capital and operational expenditure with the approved budget.\nMonitors, interprets, and prepare cash flows and predicting future trends to ensure liquidity levels within the facility.\nReviews and prepares all financial statements on a monthly, quarterly, and annual basis, summarizing the performance results for the management and respective stakeholders of the organization.\nFollow up on all financial records of the subsidiaries, ensuring that are accurately updates an appropriately secured.Financial Reporting:Evaluates financial reporting systems, accounting and collection procedures, and investment, activities, and suggests recommendations of changes to procedures, operating systems, budgets, and other financial control functions.\nOversees and reviews the preparation and development of comprehensive financial reporting and performance standards in line with international best practices with an aim to provide Executive Management and Board of Directors with meaningful trend analysis.\nEnsures, accuracy and timeliness of all financial reporting including the coordination and completeness of annual audit reviews and ensuring compliance requirements.Treasury Management:Evaluates and recommends to shareholders the optimal sources of intermediate and long term financial requirements and executes the funding plan to enhance the financial plan.\nMaintains financial agreements and develops relationships with the financial institutions in the public and private sector to match the organization regulations.\nArranges for funding Institutions including (but not limited to) banks, insurance companies, brokers and credit agencies to avoid any financial issues.Finance Standards and Procedures:Plays a role in ensuring a smooth and successful audit process. Audits are conducted to verify the accuracy and reliability of an organization's financial statements and internal controls.\nCollaborates with senior management and the board of directors to select a reputable external audit firm. Ensure the audit firm has the required expertise in the organization's industry and financial reporting standards.\nReviews financial processes and internal controls to ensure they comply with accounting standards and regulatory requirements.\nReviews with external auditor for final approval on the financial statements and reporting .Financial ManagementEnsures timely payment of debtors and invoicing of creditors and deals with third party evaluations on a yearly basis, and pay the payments within the time frame.\nResponds to verbal and written financial inquiries in a timely manner and provides technical expertise in identifying potential financial/accounting issues to achieve the credibility of work.\nMaintains collaborative and effective relationships with other key management personnel and keeps abreast of significant economic, social and technical trends, and regulatory guidelines, which may influence assigned functions/services and/or the facility to achieve the organization objectives.Managerial Responsibilities:Finalizes the workforce needs of the department and obtains requisite approvals.\nManages the team by evaluating the performance of team members, provides feedback on an on-going basis, identifies development needs and coaches them to ensure on-going capability development.\nReviews assignment of staff to cross functional teams and, if necessary, revises accordingly.Skills",
    "Skills": [
        "Qualifications:",
        "BA in finance-/Accounting\nMBA/Masters Degree in Finance will be an added advantage.\nProfessional certifications such as CFA, CA, CMA, etc.\n15+ years of post-qualification experience.\nMinimum 5 years of experience in leading the Finance & Accounts of Non -profit organization with experience with different donors."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Accounting",
        "Company Type": "Unspecified",
        "Job Role": "Finance and Investment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}