{
    "Job ID": "4760422",
    "Description": "The Sales Executive is responsible for maintaining the relationship and developing new business with a portfolio of existing and prospective clients.SalesMonthly Sales Target: this includes achieving the monthly sales target set by the Unit Manager through maintaining and growing relationships with existing clients, upselling and cross-selling as appropriate as well as prospecting and identifying new business opportunities through a variety of methods including cold calling, email, networking, and other outreach efforts.\nImplementing Sales Strategies: this includes implementing the sales strategy set by the Unit Manager in order to over achieve their targets and exceed the customer’s expectations.\nAnalyzing sales data: this involves analyzing the sales data through Navision and BI and being proficient in using our ERP and BI systems to extract the relevant reports.\nWeekly customer meetings: this includes setting up a weekly plan and pre-booking meetings with their existing customers as per the Customer Image as well as planning meetings with new and prospected customers. Plan needs to be shared with the Unit Manager every Friday for the week after.\nInteractions reports: this includes entering on daily basis the interactions through the system and making sure that the information shared is accurate as per the weekly customer meetings plan and as per the customer image, also making sure to keep the customer contacts all up to date.\nTracker sheet for Developing New Products: this includes filling up the tracker sheet that is available on the shared folder with all the relevant information as per the project/s at hand.\nDaily Sales Reports: this includes the reports that the sales team will be sending their Unit Manager on daily basis including the sales till date, sales percentage and time elapsed as well as their weekly stock reservations, stock movement, and market intelligence and competition information.\nWeekly team meeting: this is to include a presentation to the Unit Manager by the sales person on the achievements, challenges and the target as of the previous week and to set the route plan of the coming week.\nStock Management and weekly reservations: this includes having accurate forecasts for long shelf life products and the weekly reservations for the Fresh products for your customers in order to decrease the destruction and wastages.\nMonitoring the FOCs and samples: this includes making sure the FOC and samples doesn’t exceed the budget set as per the Unit Manger and the updating the status of the business return from the samples given to the customers through the interactions. FOC request to be given to CS 1 day prior to go through the proper approval channels.\nMonthly Quotations: this includes making sure all quotations are up to date and the clients are updated on the price on time and their systems are updated with the new prices. To be shared with the CS by the 25th of the month so it can be updated in the system accordingly.\nTender Calendar: this includes keeping an up to date calendar of all tenders launch dates to make sure we are invited to quote and ready with our offers.\nCollaborate with the CS and Operations teams to ensure seamless and timely delivery.CustomerCustomer Relations; this includes building and maintaining relationships with customers; this involves identifying and targeting potential customers, as well as developing and maintaining existing ones.\nCustomer Focus: making sure that you are customer focused and have the ability to anticipate the needs and the ordering trends of your customers and exceed their expectations by offering an all rounded service and attention to them.\nCustomer Sales presentations and negotiations: this involves representing Fresh Express at the Sales presentations and demonstrations and working to close deals with potential customers.PeopleProduct Knowledge: this includes being very proficient and knowledgeable about the products sold by Fresh Express and having an understanding and ability to clearly communicate the value and benefits of our products and services offered to the customer and be able to share and pass unto his knowledge to his team.\nSales person Check-in: this includes checking in on daily basis through the Unit’s WhatsApp group to inform the unit manager of your whereabouts.\nTime management: This includes the management of your time to effectively and efficiently make the best out of your day, from timely attendance to the time in the office and the time spent per sales call. Absence should be communicated to the Unit Manager/Channel Manager/HR.FinanceCollections: monitor and follow up on the collections and pending invoices and making sure that all your customers are paying as per the Credit Period set and agreed upon.\nMonthly closing: this includes the cutoff date set by Finance to have all pending invoices within the previous month closed so that it doesn’t affect our monthly closing.\nPending old unsettled invoices: this includes the follow up on the payments of all old unsettled invoices and making sure that all documents and proof of delivery is given to the client and getting the written confirmation from their accounts that the pending invoices will be paid.\nThe Unit Manager needs to be notified whenever there is a client that is not paying or delaying payments.Skills",
    "Skills": [
        "This role requires a driven and confident individual who is comfortable in our fast-paced environment and can effectively communicate the value, quality of our products to our current and prospective customers.",
        "Strong communication skills verbal / written\nNegotiation Skills\nTeam Work\nSales Oriented\nPresentation Skills\nCustomer Service Oriented"
    ],
    "Preferred": {
        "Residence Location": "United Arab Emirates",
        "Nationality": "All Western European Countries; Greece; Italy"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Catering, Food Service, & Restaurant",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "2"
    }
}