{
    "Job ID": "4760460",
    "Description": "About Mumzworld:Founded in 2011, with the vision of making a mother’s life easier, Mumzworld has pioneered a revolutionary and gold standard e-commerce shopping experience for all things mother, baby and child in the Middle East region. Today, Mumzworld prides itself with being the premier, trusted and definitive source of mother baby and child products in the region, with the largest unique range of products.  Mothers are at the heart of our brand. We not only strive to ensure that they make the most informed purchase decisions and receive a delightful, seamless and unique online experience, but also that they are empowered and engaged by the most supportive bilingual community. From the region, and for the region, we have impacted a community of over 2,000,000 Mumz and growing. Mumzworld has received numerous international and regional awards, anchoring it as the leader in its space.  We are always on the lookout for the smartest, most ambitious talent who share our vision to build a best in class vertical ecommerce business, who are interested in contributing to the larger community and who believe that the only way to build great businesses is by being smarter, faster and more innovative than anyone else. We look for team players who are modest, understated, yet create a loud impact with their results. If that is you, we’d love to chat.Here’s a snapshot of what your responsibilities would include: Working closely with the creative team and managing their workflow by briefing on design requests. \nBriefing the technology team on changes to the site and quality check their work once done on a daily basis.\nBeing the liaison between the Marketing team and BD, Tech and Design.\nUploading homepage banners via Magento.\nBeing present/on-call at all times as we have ad hoc requests during peak season that will require immediate attention.\nWorking closely with the commercial team to execute commercial campaigns across the site, social and CRM.\nGetting asset performance for our homepage and landing pages.\nTrain on strappi to start implementing changes on our platform.Skills",
    "Skills": [
        "Excellent verbal and written communication skills.\nBe a team player.\nProficient in MS Office – Word, Excel, and PowerPoint.\nAbility to work under pressure and meet all deadlines.\nProven project and time management skills.\nEffective people and team-building proficiencies.\nAbility to stay calm and organized.\nFamiliarity with Magento.\nCustomer orientation and ability to adapt/respond to different types of characters.\nAbility to multitask, prioritize, and manage time effectively.",
        "Your Education / Qualification:",
        "Graduate Degree.\nMinimum 2-3 years experience in a high paced environment."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Internet & E-commerce",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Marketing and PR",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}