{
    "Job ID": "4760351",
    "Description": "·      Jazan Integrated Gasification and Power Company (JIGPC) is a $12 billion joint venture between Air Products, ACWA Power and Saudi Aramco. JIGPC utilizes known and proven technologies to process vacuum residue from the Jazan Refinery into hydrogen, steam, and power.·      Reports to the Project Manager as Lead Project Engineer on assigned projects during detail design and construction. Coordinate with company Engineers and Contractor Engineers & designers.·      Works as company representative in the Engineering Contractor’s office during design and procurement phase.·      Works as field engineer in company’s office at site during execution phase.·      Executes assigned work in accordance with the Project Execution Plan and applicable Project Procedures and Standards. Ensures that the work follows applicable HSE and Quality standards and procedures at all times.·      Manages engineering and procurement activities by the Engineering Contractor and main equipment vendors in accordance with the agreed scope of work of the project.·      Leads reviews of all mechanical related detail design documents including GAs, Isometrics, Structural Details, Datasheets, Material Requisitions. Understands the technical content of Process, Instrumentation and Electrical Engineering documents. Coordinates reviews of the documents and returns comments to the Vendors and Engineering Contractors.·      Directs the construction contractors and vendors to plan and execute the field work in conjunction with the construction, quality management and HSE teams.·      Verifies that the contractors are progressing within the agreed manhour and cost budgets and in accordance with project schedule. Reports any deviations and applies agreed corrective actions where required.·      Provides input to the project controls team for cost and schedule reporting.·      Ensures that records are managed in the electronic filing system as required by the company procedures.·      Ensure that all Project Engineering scope changes are properly raised and recorded to cover manhours, costs and schedule impacts and coordinate on review of change order documents.Skills",
    "Skills": [
        "·      Bachelor's or Master's Degree in Engineering. Min 10 years of experience in oil and gas or process industry in a similar position.",
        "·      Experience in Mechanical design, construction, pre-commissioning and testing.",
        "·      Must have strong multi-discipline coordination skills and be able to plan work logically. Experience of project planning in Primavera would be an advantage.",
        "·      Brownfield experience is a must",
        "·      Saudi Aramco experience is essential",
        "·      Construction and commissioning experience in the brownfield environment is essential",
        "·      Competent in using MS word, Excel and PowerPoint applications.",
        "·      Hardworking, proactive and possesses team work attitude with leadership and problem solving skills.",
        "·      Good English communication skills"
    ],
    "Preferred": {
        "Years of Experience": "Min: 10",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 58"
    },
    "Data": {
        "Job Location": "Jizan, Saudi Arabia",
        "Company Industry": "Oil & Gas; Chemicals Manufacture; Petrochemicals & Refined Petroleum Products Manufacture",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Mechanical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}