{
    "Job ID": "4760945",
    "Description": "Manage a portfolio of System Integrator accounts and corporates to ensure customer retention and maximize output from key account portfolio.\nTo develop resellers , AV integrator network for IFD ( Interactive Flat Displays) sales in UAE and Middle East markets.\nEvaluate product distribution strategy and positioning against competition.\nSupport the Sales Head in sales strategies, targets and sales performance so that profitability, growth and revenue targets are met or exceeded.\nMaintain relationships with customers by providing support, information, and guidance; researching and recommending new opportunities; recommending profit and service improvements\nWin new customers from building own prospect base through proactive prospecting techniques including cold calling\nIdentify project opportunities engage with Consultants, MEP Contractors , System Integrators and Sell products by establishing contact and develop relationships with prospects; recommending solutions.\nPrepare report on a daily / weekly / monthly basis to assist in planning strategies for acquiring potential business and understanding future trends.\nIdentifies product improvements or new products by remaining current on industry trends, market activities, and competitors.\nMaintain all data within CRM system. - Meet and exceed the agreed specific performance objectives.\nAchieve team and individual sales targets as set by the management Team within the agreed time scale.\nCreate frequent reviews and reports with sales and financial data\nParticipate on behalf of the company in exhibitions or conferences\nNegotiate/close deals and handle complaints or objectionsSkills",
    "Skills": [
        ".",
        "Reporting into the Sales Lead , you will be able to provide demonstrable experience of the following:",
        "Out door sales engagements as per sales plan set\nTravel to Middle East countries as part of sales profile defined\nDeliver against all sales revenue and profit targets for products assigned\nConfident to establish new business relations.\nDesign, Estimation, Technical Proposals, Presales, Commissioning experience in ELV & related Product Lines.\nGenerate new enquiries with Major System Integrators, and achieve the desired targets within the specified time frame.\nGood communication & Presentation skills with an ability to compile tender documents with full commercial & contractual understanding.\nProduct Knowledge for all Major Vendors\nStrong Network of System Integrators/MEP Contractors within UAE /GCC/\nValid UAE Driving License\nShould be available in UAE for face to face interview\nStrong Technical Knowledge in Access Control and CCTV\nShould have knowledge of network of MEP Contractors, Integrators , Estimation teams.",
        "Key Requirements",
        "Growth Mindset\nGo getter\nHighly Motivated\nEthical\nBachelors Degree\nExcellent English Language communication and keyboard skills\nSales Experience in UAE/GCC markets\nAbility to steer sales process meeting targets\nExperience using CRM "
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 4",
        "Residence Location": "United Arab Emirates",
        "Gender": "Male",
        "Nationality": "All Eastern European Countries; India; Philippines; Southeast Asia",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Min: 28"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Computer Hardware & High-Tech Manufacture; IT Services; Security & Fire Systems",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "3"
    }
}