{
    "Job ID": "4760950",
    "Description": "Are you passionate about capturing immersive experiences? Do you have an eye for detail and a knack for post-production magic? If so, we're looking for a dedicated Matterport (Insta360 X3) Camera Operator to join our team in Dubai!As a Camera Operator with our company, you will play a crucial role in creating stunning virtual tours of hotels. Your responsibilities include:Daily Schedule: Adhering to the provided schedule, which typically includes visiting 3-5 hotels per day.\nHotel Arrival: Arriving on time at each hotel and introducing yourself as a representative of our company. Collecting keys for 2-5 different types of rooms from the hotel manager.\nRoom Preparation: Before scanning, ensure that each room is ready:\nAll lights are on and functioning.\nRoom doors are open.\nFans are turned off.\nBins are hidden from view.\nCables are neatly concealed.\nCurtains are open.\nToilet covers are closed.\nRoom Scanning: Performing scans of the rooms using the Insta360 X3 camera.\nNaming Conventions: Properly naming each scan with the format \"Hotel Name - Type of the Room\" (e.g., Rove - King Bed).\nData Upload: Uploading all scans to the cloud at the end of each workday.\nBasic Post-Production: Conducting basic post-production tasks, including editing descriptions based on a template, labeling floorplans, and creating highlight reels.\nEditing Start Location: Adjusting the start location for virtual tours.\nReporting: Compiling and sending a daily list of completed rooms in each hotel.Skills",
    "Skills": [
        "To excel in this role, you should meet the following criteria:",
        "Minimum Experience: A minimum of 1 year of experience in a similar role is required.\nTime Management: Strong time management skills to ensure timely completion of tasks.\nCommunication: Effective communication skills for interacting with hotel staff and reporting progress.\nDriver's License: Possession of a valid driver's license.\nPersonal Vehicle: Access to a personal car for transportation.",
        "Equipment:",
        "Insta360 X3 camera\nMonopod or tripod\nMobile phone or tablet that supports the Matterport Application (iOS or Android)",
        "Work Schedule:",
        "5 days a week",
        "Salary and Benefits:",
        "Guaranteed monthly salary of 6000 AED\nPetrol reimbursement",
        "Location:",
        "This position is based in Dubai, and only candidates located in Dubai will be considered."
    ],
    "Preferred": {
        "Years of Experience": "Min: 1",
        "Residence Location": "Dubai, United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Broadcast Media Production; Media Production; Photography",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Temporary",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}