{
    "Job ID": "4760300",
    "Description": "التوظيف (ليشمل وضع توصيفات وظيفية مع المدير المباشر وتحديد مكان الإعلان عن الدور وما إذا ومتى تعمل مع وكالة)\nالإعداد (وهو تعريف في الشركة ، وتعيين مرشد يساعد الموظف الجديد في العثور على أقدامهم وفهمهم وتدريبهم على الوظيفة التي سيقومون بها)\nالتدريب والتطوير (توفير مسار وظيفي) المعروف أيضًا باسم خطة التطوير الشخصي للموظف لأولئك الذين يتطلعون إلى التقدم\nالتعويضات والمزايا (استكشاف السوق لقياس أي حزمة)\nإعداد الميزانيات والأهداف لعملية الموارد البشرية\nإدارة الأداء (يتم إجراؤها مع الموظفين – شهريًا أو ربع سنويًا أو سنويًا)\nتعزيز العلامة التجارية لأصحاب العمل لتعزيز الموقف الإيجابي تجاه أهداف الشركة.\nاحتفظ بسجلات خطط المزايا والمشاركة فيها مثل خطة التأمين والمعاشات التقاعدية والتعيينات الجديدة والترقيات والتحويلات ومراجعات الأداء والإنهاءات وإحصاءات الموظفين لتقارير الحكومة.\nينسق التدريب الإداري في المقابلات والتوظيف والإنهاءات والترقيات ومراجعة الأداء والسلامة والتحرش الجنسي.\nوضع قيم الشركة ورسالتها والالتزام بها\nمشاركة الموظف (وجود سياسة الباب المفتوح حيث لا تتردد في حضور الموظفين للدردشة وحيث يمكنهم عدم التردد في مناقشة أي مشكلات قد تكون لديهم)\nإسداء المشورة لفريق الإدارة بشأن قضايا الموارد البشرية والتغييرات في قانون العمل\nحدد أهداف وغايات توظيف الشركة\nالتخطيط و / أو استضافة مراجعات وتقييمات أداء القوى العاملة\nتقديم المشورة والتوجيه لقيادة الفريق والمديرين بشأن قضايا الموارد البشرية والأداء للموظفين\nمواكبة لوائح قانون العمل وأي تغييرات\nضمان الامتثال للقواعد واللوائح\nإدارة الإجراءات التأديبية للشركة\nتصميم وتنفيذ سياسات وإجراءات الشركة\nتطوير وتحديث دليل الموظف للشركةSkills",
    "Skills": [
        "شهادة في الموارد البشرية أو مجال ذي صلة\nخبرة لا تقل عن 5 سنوات بعد التخرج في دور مماثل\nالقدرة على بناء وإدارة العلاقات على جميع مستويات العمل\nخبرة في مقاييس الموارد البشرية\nمعرفة متعمقة بقانون العمل\nمعرفة أنظمة الموارد البشرية\nمهارات اتصال وقيادة ممتازة\nمهارات قوية في التأثير والتفاوض\nالناس المنحى والنتائج مدفوعة"
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 7",
        "Residence Location": "Saudi Arabia",
        "Gender": "Male",
        "Nationality": "Saudi Arabia",
        "Degree": "Master's degree",
        "Age": "Min: 38 Max: 50"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}