{
    "Job ID": "4760627",
    "Description": "تولي مهمة اختيار العاملين الذين يتمتعون بالمهارة والكفاءة، ويؤدي المدير بقسم الموارد البشرية هذه المهمة بشكل دائم ومستمر.\nالعمل على تطوير سياسات الشركة بالإضافة لتطوير الإجراءات القياسية للوحدة.\nاعداد الخطة السنوية الخاصة بالتوظيف والتنسيق أيضاً مع الإدارات الأخرى، وذلك للعمل على تحديد الاحتياجات الخاصة بالشركة.\nفتح الملفات المخصصة لموظفي المؤسسة أو الشركة الجدد، والإشراف على الإجراءات الخاصة بالتعيين وخطوات إكمالها.\nتولي مهمة توقيع العقود الخاصة بالموظفين الجدد وتوثيقها، إلى جانب تحققه من توافر المعايير القانونية للامتثال والتي تتعلق بموظفي المؤسسة.\nحفظ كافة ما يتعلق بالموظفين من وثائق وبيانات، وتحديثها بشكل دائم ومنظم والتأكد من عملية الحفظ لهذه الوثائق والبيانات.\nينسق المدير الخاص بقسم الموارد البشرية مع الإدارات الأخرى، للعمل على إعداد خطط مخصصة لتدريب الموظفين وتنمية القدرات الخاصة بالكوادر.\nيشرف على خطوات تطبيق الخطة السنوية لتدريب موظفي الشركة وتطويرهم، إلى جانب الإشراف على البرنامج الخاص بالإجازات الدورية المخصصة للموظفين وإعداد البرنامج أيضاً.\nتجهيز الملفات التي تحتاج إليها عمليات التقييم الخاصة بالمؤسسة، بالإضافة للملفات التي تتطلبها عمليات التدقيق سواء التدقيق الداخلي أو التدقيق الخارجي، سواء كانت هذه العمليات للشركة أو المشاريع.\nاعداد البرامج التي من شأنها تحفيز أعضاء فريق عمل الشركة، وتحديد نقاط القوة لكل عضو منهم واستثمارها وتطويرها.\nتطبيق البنود التي تتضمنها اللائحة الخاصة بالموارد البشرية، من حيث التجاوزات التي تحدث في الشركة من قبل الموظفين ومخالفاتهم.Skills",
    "Skills": [
        "شهادة جامعية في نفس التخصص\nخبرة لا تقل عن 5 سنوات\nاجادة استخدام الحاسب الالي وتطبيقات الافيس\nسعودي الجنسية\nيفضل من له المام بالنواحي القانونية"
    ],
    "Preferred": {
        "Nationality": "Saudi Arabia"
    },
    "Data": {
        "Job Location": "Jeddah , Saudi Arabia",
        "Company Industry": "Catering, Food Service, & Restaurant; Tourism, Museum, & Cultural",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}