{
    "Job ID": "4760603",
    "Description": "Job Role: Accountant Financial management, reporting, and compliance within UAE business.Job Summary:As an Accountant in our industrial unit based in Dubai, you will play a crucial role in ensuring the financial health and compliance of our organization. You will be responsible for managing financial records, preparing reports, and ensuring compliance with local and international accounting standards and regulations. Key Responsibilities: Financial Reporting: Prepare and maintain accurate financial statements, including balance sheets, income statements, and cash flow statements.\nGenerate monthly, quarterly, and annual financial reports for management review. General Accounting: Oversee day-to-day accounting activities, including accounts payable, accounts receivable, and general ledger.\nEnsure proper recording of all financial transactions and maintain supporting documentation. Budgeting and Forecasting: Assist in the preparation of annual budgets and financial forecasts.\nMonitor budgetary performance and provide variance analysis. Financial Analysis: Conduct financial analysis to identify trends, opportunities, and areas for improvement.\nMake recommendations to management based on financial analysis. Tax Compliance: Ensure compliance with UAE tax laws and regulations.\nPrepare and submit tax returns accurately and on time. Audit Preparation: Prepare audit schedules and liaise with external auditors during the annual audit process.\nAddress audit findings and implement corrective actions as needed. Cost Control: Monitor production costs, analyse cost variances, and identify cost-saving opportunities.\nCollaborate with operations and procurement teams to optimize cost efficiency. Inventory Management: Maintain accurate records of inventory levels and valuation.\nPerform regular inventory reconciliations. Compliance and Regulations: Stay up to date with changes in accounting regulations and ensure the organization's compliance.\nEnsure adherence to internal control policies and procedures. Team Leadership: Supervise and mentor junior accounting staff.\nProvide guidance and training to enhance the team's skills and performance. Skills",
    "Skills": [
        "Qualifications:",
        " ",
        "Bachelor’s degree in accounting, Finance, or a related field. CPA or ACCA certification is preferred.\nProven experience as a Accountant in an industrial or manufacturing setting, with knowledge of industry-specific accounting practices.\nProficiency in accounting software and Microsoft Excel.\nFamiliarity with UAE accounting and tax regulations.\nStrong analytical and problem-solving skills.\nAttention to detail and accuracy in financial reporting.\nExcellent communication and interpersonal skills."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 3 Max: 5",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Manufacturing; Oil & Gas; Mechanical Engineering",
        "Company Type": "Unspecified",
        "Job Role": "Accounting and Auditing",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$2,000 - $3,000",
        "Number of Vacancies": "1"
    }
}