{
    "Job ID": "4761793",
    "Description": "Supervise execution of all electrical work according to contract documents including, but not limited to (checking work, reviewing and approving all material and shop drawings, deciding on change order …etc). It is to be noted that the supervising engineer is solely responsible for the quality of MEP the electrical work being executed and shall request technical support from Senior Engineers if necessary in coordination with the Project\nCheck contractors’ work to ensure adherence to local and national electrical codes, safe operation of all devices, and accurate power\nResolve issues related to electric systems or devices that arise during the course of\nSuggest revision of plans if required in coordination with the Project Manager and the Head of MEP and resolve issues to prevent\nFull coordination with other trades for all works under the management and directives of the Project\nPrepare necessary technical and financial reports and submitting them to the Project Manager and the Head of MEP including periodic reports to Senior Engineers and the Head of MEP on work progress and lessons\nManage construction schedules related to electrical elements of job sites and determine when project milestones need to be completed to avoid delays and maintain\nCoordinate with Head of MEP Section to give advice to other sections regarding size and type of design work and projects’ technical\nCoordinate with the Testing and Commissioning Engineer regarding material approval and commissioning\nFull understand the project requirements concerning time and cost and quality, coordinating with Head of MEPSkills",
    "Skills": [
        "Bachelor’s degree in Electrical Engineering or similar background.\nMin. 15 total years of experience.\nMin. 7 years experience with a consultancy office in UAE, with experience in supervision.\nWell knowledge of ADDC regulations\nCandidates must be currently based in the UAE, preferably in Abu Dhabi."
    ],
    "Preferred": {
        "Career Level": "Mid Career",
        "Years of Experience": "Min: 15",
        "Residence Location": "United Arab Emirates",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}