{
    "Job ID": "4761735",
    "Description": "Enables the success of student academic achievement through implementation of the school curriculum and philosophy and through the consistent use of the school Point System™ of instruction.Has an oversight role for all students within the school setting, to ensure a safe academic environment conducive to learning and maintain the professional image.Ensures proper planning and follow-up for the academic progress of all students and works cooperatively with the Student Life and Student Management teams.Ensures accurate and timely reporting to the Academic Quality Controller, as required by the school and governmental bodies.Reports regularly to the Academic Quality Controller regarding students’ performance and challenges, with recommendations for action and a summary of actions taken.Fulfills a requirement of 30 student contact hours per week. Primary assignment may be a specific grade level (including homeroom duties) or subject teaching to multiple classes in regular or intensive classes.May also be assigned additional non-instructional duties such as proctoring exams or supervising recess or lunch. Must attend required school functions as identified by administration.Skills",
    "Skills": [
        "Minimum:",
        "Bachelor's degree in a related subject matter and/or equivalent.",
        "Master’s Degree preferred, may be required if necessary to comply with local regulations.",
        "Leadership and team management skills.",
        "Interpersonal and communication skills.",
        "Organizational and self-management skills;",
        "Ability to handle multiple responsibilities effectively.",
        "Goal orientation; Planning and execution skills.",
        "Problem-solving abilities.",
        "Dependability; Readiness to go above and beyond when necessary to reach goals.",
        "Employment Requirements:",
        "Must meet all employment requirements including, but not limited to, country and local education and certification requirements, reference checks, and criminal background checks."
    ],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}