{
    "Job ID": "4761097",
    "Description": "At Ru’ya Bilingual School, we are dedicated to providing high-quality education in both Arabic and English. The school’s slogan is ‘Entertain to Educate’, therefore, we are looking for teachers who are fun, creative, and passionate about teaching to join our team. We are looking for PreKG teachers and primary English teachers to teach grades from 1 to 5. You will be part of a team-oriented environment that provides support and ongoing professional development.As a PreKG, your responsibilities will be to:provide a variety of learning experiences and materials.\ncreate a creative environment that helps pre-k students learn and contribute to their development.\nmeet students' needs and develop their verbal and communication skills.\ncreate sensory learning experiences that allow students to explore and learn.As an English teacher, your responsibilities will be to:create a safe and flexible classroom environment conducive to optimal student learning.\nplan and prepare lesson plans that meet core objectives and principles and are in line with the curriculum goals.\ndeliver lessons using a variety of differentiated instructional techniques that are appropriate to the academic level and meet the diverse needs of students.\nencourage the development of critical thinking skills.\nhelp students to work independently and collaboratively in groups.\nencourage student responsibility, cooperation, tolerance, and mutual respect in a manner consistent with the School’s policies and procedures.When working with us, you will receive the following benefits: Paid summer holidays \nMedical insurance \nTransportation allowance \nEnd of service package \nMonthly, quarterly and yearly rewards \nOn-site nursery for newborns. \nFirst and second children get a 50% discount on tuition fees. Skills",
    "Skills": [
        "BSc/BA in English Language or English Literature; or a related subject\nPrevious experience as an English teacher or PreKG teacher\nKnowledge of various teaching methods\nDeep understanding of the American curriculum and English language requirements\nExceptional organizational and communication skills\nDedication to students and education\nThe ability to compile lesson plans efficiently.\nThe ability to execute lessons with meaning, in a fun, and engaging manner.\nproficient in the use of technology and computer applications\nup-to-date with the latest teaching techniques and topics in English instruction"
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "Khobar, Saudi Arabia",
        "Gender": "Female"
    },
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Preschool, Nursery, & Daycare; Primary, Prep, & Secondary School",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Teaching and Academics",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$1,500 - $2,000",
        "Number of Vacancies": "4"
    }
}