{
    "Job ID": "4762053",
    "Description": "We are looking for a recruiting specialist to advertise job vacancies and to screen, shortlist,and interview candidates. In this role, you will develop and post job descriptions usingsocial media and other platforms in order to identify suitable applicants. You will analyzethe recruitment process and make recommendations for improvements or changes.To ensure success as a recruiting specialist, you will be conversant with a wide range ofsocial media for job postings and you will keep track of the hiring process of candidates.Using hiring metrics software, you will compile reports on aspects of the hiring process. Atop-notch recruiting specialist will have in-depth knowledge of labor laws as well as currenthiring trends.Recruiting Specialist Responsibilities: Discussing and establishing qualification requirements and terms and conditions ofemployment with managers. Formulating detailed job descriptions and posting them. Conducting phone calls or meetings to create a shortlist of qualified candidates. Interviewing candidates on the shortlist and maintaining a database on employeesfor future vacancies. Mediating between candidates and hiring managers. Using web-based technology and social media to analyze hiring trends, post jobvacancies, and following up with candidates during the hiring process. Producing reports on hiring plans and strategies. Measuring the results of candidate interviews and job placements using hiringmetrics software. Revising HR policies and ensuring that fair employment practices are implemented. Analyzing recruitment software and the performance of recruitment agencies andrecommending improvements or changes.Recruiting Specialist Requirements: Bachelor’s degree in HR, business, psychology, or another related field. 3-5 years of experience as a recruiting specialist with a track record of employeeplacement. The ability to work within a team and to coordinate team activities. Excellent analytical skills to examine resumes and find the best-suited candidates. Clear verbal skills to communicate well with candidates and managers. Proficient writing skills to produce reports on hiring analyses. Leadership abilities to delegate tasks and train new employees. Strong negotiation skills when discussing terms and conditions of employment. In-depth knowledge of hiring strategies, labor laws, and employment equity. The ability to evaluate recruiting software packages and to recommend those whichare best suited to the company.Skills",
    "Skills": [
        "Discussing and establishing qualification requirements and terms and conditions of",
        "employment with managers.",
        " Formulating detailed job descriptions and posting them.",
        " Conducting phone calls or meetings to create a shortlist of qualified candidates.",
        " Interviewing candidates on the shortlist and maintaining a database on employees",
        "for future vacancies.",
        " Mediating between candidates and hiring managers.",
        " Using web-based technology and social media to analyze hiring trends, post job",
        "vacancies, and following up with candidates during the hiring process.",
        " Producing reports on hiring plans and strategies.",
        " Measuring the results of candidate interviews and job placements using hiring",
        "metrics software.",
        " Revising HR policies and ensuring that fair employment practices are implemented.",
        " Analyzing recruitment software and the performance of recruitment agencies and",
        "recommending improvements or changes.",
        "Recruiting Specialist Requirements:",
        " Bachelor’s degree in HR, business, psychology, or another related field.",
        " 3-5 years of experience as a recruiting specialist with a track record of employee",
        "placement.",
        " The ability to work within a team and to coordinate team activities.",
        " Excellent analytical skills to examine resumes and find the best-suited candidates.",
        " Clear verbal skills to communicate well with candidates and managers.",
        " Proficient writing skills to produce reports on hiring analyses.",
        " Leadership abilities to delegate tasks and train new employees.",
        " Strong negotiation skills when discussing terms and conditions of employment.",
        " In-depth knowledge of hiring strategies, labor laws, and employment equity.",
        " The ability to evaluate recruiting software packages and to recommend those which",
        "are best suited to the company."
    ],
    "Preferred": {
        "Years of Experience": "Min: 3 Max: 5",
        "Gender": "Female",
        "Degree": "Master's degree",
        "Age": "Min: 21 Max: 35"
    },
    "Data": {
        "Job Location": "Noida, India",
        "Company Industry": "Recruitment & Employee Placement Agency",
        "Company Type": "Recruitment Agency",
        "Job Role": "Human Resources and Recruitment",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$15,000 - $30,000",
        "Number of Vacancies": "2"
    }
}