{
    "Job ID": "4762084",
    "Description": "Job Title: Power BI LeadLocation: Pune , KothrudWork from Office Experience: 8 – 12 years  Budget: upto 25 LPA (depends on experience and skills)  Must-Have: Power BI, Power Query, DAX, Data Transformation, Data Modelling Note : Immediate joiners preferred and good in communication Job Summary: We are seeking a highly motivated and experienced Power BI Team Lead with excellent analytical and leadership skills to join our team. The ideal candidate should have hands-on experience with Power Query, DAX, data transformation, data modelling, and an understanding of SQL connections in Power BI. The candidate should also have a strong understanding of Power BI performance pitfalls, query folding, and other related concepts. Responsibilities: • Lead a team of Power BI developers and analysts to design, develop and maintain Power BI solutions • Collaborate with business stakeholders to understand their reporting needs and translate them into technical requirements • Develop and maintain a deep understanding of our business processes, data models, and data sources • Build and maintain Power BI reports, dashboards, and other data visualization solutions • Provide technical guidance and support to the team and ensure that best practices are followed • Participate in code reviews and ensure that solutions are optimized for performance • Troubleshoot and resolve issues related to Power BI performance and functionality • Keep up-to-date with the latest Power BI features and technologies and evaluate their potential impact on our solutions • Establish and maintain effective communication with cross-functional teams Requirements: • Expertise leading a team of Power BI developers and analysts • Strong analytical and problem-solving skills • Experience with Power Query, DAX, data transformation, data modelling, and SQL connections in Power BI • Experience with Power BI performance tuning and optimization • Excellent leadership and communication skills • Ability to work collaboratively in a team environment • Ability to manage multiple priorities and projects simultaneously  • Good to have experience with other data visualization tools such as Tableau or QlikView Qualifications: • Overall experience of 8-12 years.  • At least 5 years of experience in developing and maintaining Power BI solutions • Bachelor's degree in Computer Science, Information Technology, or a related fieldSkills",
    "Skills": [
        "Qualifications: ",
        "• Overall experience of 8-12 years.  ",
        "• At least 5 years of experience in developing and maintaining Power BI solutions",
        " • Bachelor's degree in Computer Science, Information Technology, or a related field"
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 12",
        "Age": "Min: 25 Max: 45"
    },
    "Data": {
        "Job Location": "Noida, India",
        "Company Industry": "IT Services",
        "Company Type": "Recruitment Agency",
        "Job Role": "Information Technology",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}