{
    "Job ID": "4762300",
    "Description": "Mystery shopping is a tool used by marketing research companies and organizations to assess the service provided, job performance, and compliance, or to gather specific information about a market/competitor, including products and services.Mystery shoppers are assigned to specific audits based on specific budgets and timelines.He is then requested to fill out a survey on his experience and conclusions.We are currently searching for shoppers across the KSA region specifically Al Dawadmi to join the team as mystery shoppers.التسوق السري هو أداة تستخدمها شركات ومؤسسات الأبحاث التسويقية لتقييم الخدمة المقدمة ، والأداء الوظيفي ، والامتثال ، أو لجمع معلومات محددة حول السوق المنافسة ، بما في ذلك المنتجات والخدمات.يتم تعيين المتسوقين السريين لإجراء عمليات تدقيق محددة بناءً على ميزانية محددة وجدول زمني.ثم يُطلب منهم ملء استبيان حول تجربته واستنتاجاته.نحن نبحث حاليًا عن متسوقين في جميع أنحاء منطقة المملكة العربية السعودية وتحديدًا الدوادمي للانضمام إلى الفريق كمتسوق سري.Skills",
    "Skills": [
        "A mystery shoppers should be detailed oriented, with high communication skills, objectivity, and flexibility in meeting the terms of assigned projects.",
        "A mystery shopper is also expected to have good time management and computer skills.",
        "                    يجب أن يتمتع المتسوق السري بالدقة ، مع مهارات تواصل عالية ، وموضوعية ، ومرونة في تلبية شروط المشاريع المخصصة.",
        "                                                من المتوقع أيضًا أن يتمتع بمهارات جيدة في إدارة الوقت واستخدام الكمبيوتر."
    ],
    "Preferred": {
        "Residence Location": "Aldawadmi, Saudi Arabia"
    },
    "Data": {
        "Job Location": "Aldawadmi, Saudi Arabia",
        "Company Industry": "Market Research",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Quality Control",
        "Employment Type": "Contractor",
        "Monthly Salary Range": "$0 - $500",
        "Number of Vacancies": "5"
    }
}