{
    "Job ID": "4762375",
    "Description": "Photographer/Videographer Profound Realtors is open to welcome experienced Photographer/Videographer who are looking for a full-time opportunity to join the Team.Profound Realtors is the name of excellence in Dubai’s Realty Market. For over a decade in Dubai Realty we have evolved into successful real estate professionals who offer the best real estate investment opportunities in the UAE.We have a highly motivated and determined team, who have been providing for the diverse needs of its clients with effective, strategic, and innovative solutions. Being a Real Estate Photographer/Videographer, you will be a part of marketing team to show off the properties or projects and will collaborate closely with the sales team to enhance any offline and online marketing materials. Job Responsibilities:Shoot and capture photos and videos professionally aligned with the campaign or advertisement objectives.\nEditing videos and images to meet the desired company standards.\nUtilize and skilfully arrange all related technical equipment such as lenses, camera, and audio recorder.\nTo guide participants or subject during video/photoshoots to achieve the desired result.\nKnowledgeable with editing media, applications, and software.\nStay updated with trends, techniques and practices related to photo/video shoots.\nStrive to meet and exceed client’s expectation by delivering the best quality of video and images.\nResponsive with feedback and suggestions and willingness to make necessary adjustment to achieve the industry standard.\nTraveling to different locations to deliver accurate and required videos and images.Skills",
    "Skills": [
        "Requirements:",
        "Minimum of 2 Years experience in field of Photography & Videography.\nBasic knowledge with Real Estate Industry.\nGreat communication skill is a must.\nDetailed oriented.\nSelf-motivated and ability to work independently.\nKnowledgeable with any application or software related to video and photo editing.\nAbility to work under pressure and flexible with time management to reach deadline.\nProven work Portfolio",
        " ",
        "Company offers:",
        " ",
        "Monthly salary\nCompany Visa.\nLabour card & contract.\nMedical Insurance.\nAnnual Leave."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2",
        "Residence Location": "United Arab Emirates"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Real Estate",
        "Company Type": "Unspecified",
        "Job Role": "Design, Creative, and Arts",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}