{
    "Job ID": "4763711",
    "Description": "Business development planning, development of business plans;\nDevelopment and control of sales strategy implementation;\nDevelopment and control of the implementation of programs for promoting products and services;\nManagement of the company's pricing policy;\nControl of accounts receivable;\nAssessment of market risks, and development of measures to minimize them;\nPlanning, execution, and control of the company's budget;\nGenerating reports on performance results and budget execution;\nOptimization of business processes;\nDevelopment and implementation of KPIs for your team.\nNumber of people under supervision Up to 5 peopleSkills",
    "Skills": [
        "Excellent management skills,\nHigh level of responsibility and self-organization, dedication, perseverance,\nWillingness to work at a high pace and quickly solve assigned tasks, competent oral and written speech,\nExcellent communication skills.\nKnowledge of a foreign language English/Arabic Russian (desirable)\nSpecial requests and additions Knowledge of the UAE sales market\nSuccessful experience in managing sales of a large food enterprise\nExperience in sales development, building an effective sales structure, distribution, working with federal and",
        "local networks, HoReCa direction",
        "Special knowledge and skills\nIntroduction of new products to the market;\nExperience in analytical work;\nExperience in managing commercial service / sales department personnel;\nExperience in personal sales, excellent knowledge of sales technology, experience in building and developing",
        "a sales system in different sales channels;",
        "Experience in the MEAT PROCESSING segment will be an advantage;\nSuccessful experience in building and monitoring business processes of the commercial unit;\nExperience in implementing CRM, process automation (desirable);\nSales planning, participation in production planning;\nOrganizing effective interaction between the commercial department and other structural divisions of the",
        "company;",
        "Participation in negotiations with key clients;\nPersonal sales - playing coach;\nProject management;\nEnsuring proper utilization of production, participation in projects to increase production and storage capacity\nExperience as a Sales Manager in large trading and manufacturing companies for at least 3 years\nSuccessful experience in managing sales of a large food enterprise",
        "."
    ],
    "Preferred": {
        "Career Level": "Director/Head",
        "Years of Experience": "Min: 3",
        "Residence Location": "All GCC Countries",
        "Degree": "Bachelor's degree / higher diploma",
        "Age": "Max: 45"
    },
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "FMCG; Manufacturing",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "$3,000 - $4,000",
        "Number of Vacancies": "1"
    }
}