{
    "Job ID": "4763972",
    "Description": "We are on the lookout for a Florist to help us run our flower shop. As a Florist, you should demonstrate creativity, exhibit dexterity, and display strong interpersonal skills. You will be responsible for managing the timely completion of customer orders and delivery. You should also advise customers on floral gifting and help choose appropriate gift baskets. In addition, you should be able to consult with customers on their budget and preferences and accordingly provide a quote. You should also make note of any special requests such as including a personalized happy birthday message or any other wishes. Apart from these, your other responsibilities include regularly changing the in-store and window displays and maintaining cleanliness. Apply right away if you have a knack for quality flower arrangements and an innovative mind for beautiful flower decor.Assisting customers in ordering flowers via phone or in-person\nOffering customers suggestions on color schemes, flower arrangements, and design\nDelivering flowers on time or arranging for alternatives\nCleaning, cutting, and watering flowers and foliage to maintain longevity\nMaking traditional birthday flowers, wedding decorations and wreaths to be presented in funeral homes\nMaintaining an inventory of flowers, plants, and gifts\nMaintaining the proper condition of decorative tools like wires, shapers, pins, and foam\nFulfilling last-minute gift requests for wedding proposals or sending sympathy flowers for a grieving family\nEnsuring proper packing of bouquets and other items\nProviding sound expertise to customers about flower handling and maintenance\nSupervising the decoration of event venues and vehicles\nMaintaining cleanliness of the display station\nArranging and placing orders for seasonal flowers online\nMaintaining a daily record of sales\nKeeping good relations with Wedding Planner, Event Manager and generating leadsSkills",
    "Skills": [
        "Flower Knowledge: A deep understanding of various types of flowers, their characteristics, and how to care for them to ensure their freshness and longevity.\nCreativity: The ability to create unique and visually appealing floral arrangements that cater to different occasions and preferences.\nColor Coordination: Skill in choosing and combining flowers and foliage to create harmonious color schemes and visually appealing arrangements.\nDesign Sense: A keen eye for design principles such as balance, proportion, and focal points to create aesthetically pleasing arrangements.\nCustomer Service: Excellent interpersonal and communication skills to understand customers' needs, offer suggestions, and provide exceptional service.\nAttention to Detail: Meticulous attention to detail when arranging flowers to ensure the final product is of high quality.\nTime Management: The ability to work efficiently, especially during busy periods, to meet customer demands and fulfill orders on time.\nStamina: Physical endurance is important as the job can involve long hours of standing and handling flowers and materials."
    ],
    "Preferred": {
        "Years of Experience": "Min: 2 Max: 5",
        "Gender": "Male"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Interior design",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Support Services",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "10"
    }
}