{
    "Job ID": "4763604",
    "Description": "Manage, design, develop, create, and maintain small-scale through to large-scale construction projects in a safe, timely and sustainable manner\nConduct on site investigations and analyze data (maps, reports, tests, drawings, and other)\nCarry out technical and feasibility studies and draw up blueprints that satisfy technical specifications\nAssess potential risks, materials and costs\nProvide advice and resolve creatively any emerging problems/deficiencies\nOversee and mentor staff and liaise with a variety of stakeholders\nHandle over the resulting structures and services for use\nMonitor progress and compile reports in project status\nManage budget and purchase equipment/materials\nComply with guidelines and regulations including permits, safety etc and deliver technical files and other technical documentation as requiredSkills",
    "Skills": [
        "Proven working experience in civil engineering",
        "proficient in surveying for exterior facades and interior spaces.",
        "experience in site management and quantity estimation",
        "A valid driver's license is required for this position.",
        "Excellent knowledge of design and visualizations software such as AutoCAD, Civil 3D or similar",
        "Proficiency in site layout, grading, utility design, erosion control, regulatory approvals, etc",
        "Project management and supervision skills",
        "Strong communication and interpersonal skills",
        "The license of professional engineer",
        "Bachelor's degree in Civil Engineering"
    ],
    "Preferred": {
        "Residence Location": "Kuwait"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Civil Engineering; Construction & Building; Construction & Building",
        "Company Type": "Unspecified",
        "Job Role": "Civil Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}