{
    "Job ID": "4763747",
    "Description": "   Prepare a review for IFC drawing   Prepare RFI’s for any technical clarifications   Coordinate with draftsmen for shop drawing preparation, Review shop drawing prior to submit to consultant   Make quantity take off for all material required.   Review material submittal prior to submit to consultant   Coordinate with main contractor/ consultant.    Participate where required in all aspects of the project management for the electrical works.   Manage and supervises the on all site electrical works.   Undertake the detailed short term planning and co-ordination at site in accordance with the master program.   Ensure that all information is available to undertake the works.   Ensure materials are available at site to undertake the works.   Control of the quality and technical correctness of the installation in accordance with the project quality assurance plan.   Ensure that the works are carried out in a safe manner in accordance with the project safety plan   Co-ordinate with the main contractor and other sub-contractors at site.   Set targets and monitors the productivity of the workforce at site.   Arrange skills development and training for the foremen and site workforce.   Monitors the production and quality of sub contractors works at site.   Implements the inspection and test plan and obtains the supervising engineers approval at each stage of the works.   Manages the system testing and commissioning   Adhere to the company QHSE policy at all times.   Report All QHSE incidents immediately and take necessary precautions.Skills",
    "Skills": [
        "Bachelor's degree in electrical engineering degree\nFluent in Arabic and English\nMinimum experience is 8 years\nHaving SCE is a plus\nValid iqama\nExperience in using or a desire to learn the required software.\nKnowledge of applicable codes related to electronic engineering."
    ],
    "Preferred": {
        "Years of Experience": "Min: 8 Max: 10",
        "Residence Location": "Riyadh, Saudi Arabia",
        "Gender": "Male",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Construction & Building",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Electrical Engineering",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}