{
    "Job ID": "4763674",
    "Description": "The hotel’s Sales Manager networks with potential clients, manages large accounts, works to maintain a loyal customer base, provides sales leadership to the market to generate revenue, gain market shares and motivates sales team to maintain a loyal customer base, and oversees hotel sales and marketing strategies.Essential Duties and Responsibilities of a Costa Del Sol Hotel’s Sales Manager:Analyze the current client base or target market for the hotel.\nDevises new ways to expand that client base.\nDevelop promotional and advertising materials for the hotel.\nReaches out to organizations and businesses that might require a hotel for conferences and events.\nMeets with representatives from these companies to explain the hotel’s merits and amenities.\nNetworks with wedding planners and special event planners to encourage hotel bookings.\nDesign and advertises special group rates and packages to increase larger bookings.\nManages accounts of high-profile clients.\nAddresses and resolves any issues or complaints regarding sales and marketing.\nEnsures that guests are enjoying their stay at the hotel and that large group needs are met.\nMaintains positive relationships with clients to encourage repeat and recurring business.\nTo be responsible for ensuring the sales team achieves targeted sales(budget) every month.\nProduce reports and recommendations on sales strategies for senior management.Skills",
    "Skills": [
        "Demonstrates strong organizational skills\nExhibits excellent interpersonal and customer service skills\nDemonstrates ability to think creatively and analytically\nIs capable of creating and maintaining a large client network\nDemonstrates familiarity with budget software and financial management.\nCommunicates clearly and effectively.\nPossesses strong leadership skills\nIs familiar with the workings of the hotel and hospitality industry\nDemonstrates strong persuasive and negotiation skills.\nWorks well with a variety of different individuals.\nExcellent knowledge of MS Office and PowerPoint."
    ],
    "Preferred": {
        "Years of Experience": "Min: 4",
        "Residence Location": "Kuwait",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Al Kuwait, Kuwait",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Unspecified",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}