{
    "Job ID": "4763779",
    "Description": "We are seeking a highly motivated Senior ICT Presales Engineer (Technology Architect - ICT Infrastructure Solutions):Accountable for advising and coordinating with the Sales team & ICT Project Delivery Team on all technical enquiries, issues and services related but not limited to account penetration strategies, pre-sales implementations, solution design and training.\nS/He is a technical expert building strong relationships with the vendors, partners and distributors and driving the business through multiple technical initiatives.Main Duties and Responsibilities:Act as a subject matter expert in technical/solutions design of the assigned products/services portfolio.\nS/He will be responsible for the operations of LAN/WAN, Secure and Highly available Microsoft Computing Platforms, VMware Virtualization, Data backup, Servers, Storages, and networks.\nYou will assist in the design and operation of secure services in collaboration with Architecture and Engineering principles. With a focus on operational stability, robustness, resilience, availability, and quality solutions, you will be managing support of the existing landscape.\nYou will take care of maintenance, timely identification issues and troubleshooting.\nYou plan, coordinate, and implement the various measures and contribute by actively brainstorming, looking critically, and producing suggestions for improvements to enhance the quality of our Modern IT workspace and hybrid operating environment.Responsibilities and Duties:Analyzing and developing key components using methodological prescribed techniques.\nCarrying out Extensive pre-sales consulting, systems design and developing technical/financial justification.\nResearching and evaluating new technologies and providing technical documentation to support recommendations.\nCarrying out discussions with the clients and service providers to identify and analyze when they have faced any issues with their network infrastructure.\nContinually looking for new clients, to full fill their upcoming requirements (LAN/WAN, Virtualization, Data Backup, Storage, Wireless and VOIP Solutions) and doing ground level support to the end customers to make technical specifications to match with their objectives.\nAccountability to discover new technologies with the existing solutions and trace new product vendors separately from the current vendors (According to the customer request to provide cost effective and reliable solutions).\nEnterprise scale ICT solutions planning, designing and Implementation related to CISCO, Aruba, Huawei, VMware/ Hyper V, Veeam, Microsoft Azure Networking, HPE, Dell and ManageEngine products.Skills",
    "Skills": [
        "Skills & Qualifications:",
        "Minimum 6 Years of Experience in ICT solutions planning, designing and Implementation.\nCisco Certified Networking Professional (CCNP) and CCIE will be an added advantage.\nVMware Certified Professional VCP Certified Engineer.\nMicrosoft Azure Certified engineer.\nAbility to understand complex systems, possess good IT skills, and complete technical report documentation.\nAble to foster good relations with colleagues and be a good team player.\nStrong learning aptitude and ability to learn new technologies independently.\nAbility to manage multiple priorities, commitments, and a positive attitude.\nAbility to work under pressure at odd hours.\nFluent English Speaker.\nAt least 5 years of experience in Qatar in a similar position, paramount in the development of strategic relationships with ICT Distributors, Vendors & Partners"
    ],
    "Preferred": {
        "Years of Experience": "Min: 6",
        "Residence Location": "Qatar",
        "Degree": "Bachelor's degree / higher diploma"
    },
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "IT Services",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Sales",
        "Employment Type": "Full Time Employee",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "1"
    }
}