{
    "Job ID": "69858289",
    "Description": "OVERVIEWPositionHR Operations Manager  Job CodeReports toDirect ReportsDivision/SectionERI OpsDepartmentERI OpsSectorEducation, Research and InnovationJob FamilyRole PurposeThe NEOM culture is about learning by doing, combining knowledge, creativity, and critical thinking with the latest technology and a digital mindset; to solve the problems of tomorrow. At NEOM, we live and breath this culture by developing a bespoke learning ecosystem.At NEOM, education is an enabler for economic and social progress. All residents will have access to life-long education through schools, university colleges, applied research institutes, and vocational training colleges. Here at NEOM, we aim to attract and inspire the world’s best minds to join this vibrant and enriching community.The Education, Research and Innovation (ERI) Sector aims to transform education into a lifelong experience that utilizes cutting-edge, high-tech, and personalized learning capabilities, and inspires the world’s greatest minds.The HR Operations Manager will be embedded within the ERI team which the role supports and work closely with the leadership team. They will work closely with HR centres of excellence, to design and roll out corporate HR initiatives.The HR Operations Manager is responsible for the efficient and effective operation of the HR department, specifically focused on the areas of Recruitment and Onboarding. The responsibilities include overseeing the entire recruitment process and ensuring a seamless onboarding experience for new hires in the ERI Sector. This role involves managing recruitment efforts, supporting Hiring Managers, and creating effective onboarding programs to integrate new employees into the ERI Sector.KEY ACCOUNTABILITIES & ACTIVITIESRecruitment:Management of the whole employee lifecycle with business from job creation, induction, development through to exit/alumni\nCollaborate closely with the central NEOM Recruitment Team to attract top talent to the ERI Sector, ensuring compliance with NEOM Recruitment Standards and interview requirements.\nDevelop and implement recruitment strategies to improve the recruitment process, ensuring roles are filled within a timely manner.\nCollaborate with hiring managers to understand staffing needs and create job descriptions. Act as their support and liaison with the central NEOM Recruitment Team.\nSupport NEOM Recruitment team by attending and conducting interviews, assess candidate qualifications, and present recommendations to hiring managers.Recruitment Metrics and Reporting:Track and analyze recruitment metrics (e.g., time to fill, cost per hire) and provide regular reports to ERI Leadership Team. Be the point of contact for all areas of recruitment in the team.\nUse data-driven insights to optimize recruitment strategies.Onboarding:Design and implement comprehensive onboarding programs for new hires across the ERI Sector. Ensuring a smooth transition for new employees into the organization.\nCoordinate orientation sessions and training for new hires.\nCollect feedback from new employees to improve the onboarding process.\nWork in close collaboration with the central NEOM Onboarding Team to ensure a smooth onboarding experience for new hires.Compliance:Ensure compliance with all employment laws and regulations during all activities.\nMaintain accurate records and documentation related to recruitment and onboarding activities.\nEnsure that all work within a specific area is carried out in an efficient manner and in compliance with NEOM policies, processes and procedures.\nLeading with integrity, consideration and challenge – having the courage and confidence to challenge the business and its leaders.\nProvide expert HR, advice, guidance and support which aligns with central NEOM and local business solutions.Culture:\nConnecting with curiosity, purpose and impact – asking the right questions, crafting networks and understanding where HR can identify opportunities to create the most value.\nContribute to the formulation and implementation of the HR strategy and plans as benefiting the department and all sectors’ needs and objectives.\nProvide expertise and creativity to develop HR initiatives to support the business needs. Understanding the business model at depth – getting to know and understand how the business operates, how it creates value, its strategic drivers and its purposeBACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and ExperienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}