{
    "Job ID": "69857174",
    "Description": "Overview The OT Data Analytics & Reporting Analyst will be responsible for developing and implementing a global data analysis and reporting framework, project plan and roadmap for manufacturing plant operational technologies. Understand metrics collected from operational technology data sources. Develop reports providing data visualization that identifies trends and provides insight to performance goals. Define and establish work-intake process, data validation, and reporting frequency per customer requirements. Responsibilities Analyse OT cybersecurity metrics for manufacturing plants, sectors, and global levels. Prepare reports and dashboards on various aspects of performance, compliance, risks, goals, etc. Identify data synergies that reveal tends and information not obvious in individual metrics. Develop and implement processes that increase the effectiveness and integrity of data reporting. Ensure OT data is clean and accurate through data validation. Provide suggestions for data/reporting improvements. Qualifications 8+ years of total experience in IT. 3+ years data analysis and analytics. 3+ years report development using Power BI. 3+ years programming in SQL and Python. Expertise in Azure DevOps. Proficient in Microsoft suite of tools - Excel (pivot tables), Word, PowerPoint. Proficient in search engines and research. Strong skills in data visualization and interpretation. Experience partnering and collaborating with global teams. Strong process and procedure development skills. Strong project management skills (Waterfall and Agile). Very strong verbal and written communication skills, executive presentation skills. Strong understanding of third-party services, SLA’s, compliance, metrics. Strong people skills communicating across various organizational levels. Ability to seek feedback on deliverables and build consensus with stakeholders. Ability to evaluate situations, understand multiple perspectives, clarify ambiguous areas, apply critical thinking skills. Ability to work in a fast-paced environment and flexibility to work across global time zones.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}