{
    "Job ID": "69857717",
    "Description": "JOB TITLE: Regulatory Affairs Manager II, International Regulatory AffairsCAREER LEVEL: DLead the way for a new breed of solutions-oriented RegulatorsChampion a new approach to Regulatory that supports quick decision-making and balanced risk-taking. Curious enterprise-thinkers we proactively take a strategic approach earlier in the product lifecycle to get involved in shaping drug development.Be part of the team where you are empowered to follow the science.Be part of the solution, turning our drug development strategies into reality. Work at all stages of development to translate our life-changing science into medicines to get the best results for AstraZeneca, patients in need and healthcare professionals.About AstrazenecaAt AstraZeneca we’re dedicated to being a Great Place to Work. Where you are empowered to push the boundaries of science and unleash your entrepreneurial spirit. There’s no better place to make a difference to medicine, patients and society. An inclusive culture that champions diversity and collaboration. Always committed to lifelong learning, growth and development.About the teamWe are a diverse and open-minded team harnessing our different skills and experiences. As a Regulatory function we use our capabilities to accelerate discovery and development. Combining knowledge from across our Therapy Areas helps us to deliver rapid and global approvals that bring new medicines to patients.About the roleDescription:The Regulatory Affairs Manager II in International Regulatory Affairs is a regulatory specialist with project management capabilities responsible for leading the end-to-end planning, coordination, and execution of assigned results, including delivery as an individual contributor. The Regulatory Affairs Manager II in International Regulatory Affairs will be responsible for tactical delivery of Int’l Marketing Authorisation Applications (MAAs) and Clinical Line Extensions (CLEs within an assigned Global Regulatory Execution Team (GRET). The Regulatory Affairs Manager II is expected to be able to work flexibly to deliver these accountabilities as assigned to them by their line manager or by the Lead Regulatory Project Manager (RPM) for their allocated GRET(s).The Regulatory Affairs Manager II is fully proficient in applying established standards. Performs Regulatory Affairs Management for highly complex International market submissions under minimal supervision. May facilitate strategic input, capable of leading cross functional activities. Capable of leading cross functional activities. Participates continuous improvement of process and tools/systems.Regulatory Affairs ManagementGives to regulatory submission strategy, identifying submission risks and opportunities, while leading simple through more complex regulatory applications and managing procedures through approval. Provides regulatory expertise and guidance on procedural and documentation requirements for International markets to GRET, Global Regulatory Strategy Team (GRST) and cross-functional teams working flexibly within and across regions to ensure the delivery of business objectives.Accountabilities/Responsibilities:Regulatory Affairs ManagementUnderstands the regulatory framework, including regional trends, for various types of applications and procedures for small and large molecules across all regions.\n\nProvides regulatory input on procedural and documentation requirements as defined by Health Authorities for assigned deliverable(s) including:\n\nSubmission delivery strategy for MAA and CLE dossiers market and /or region.\n\nChip in to and review of response documents\n\nAnalysis of regulatory procedures and special designations used during development, authorizations and extension of the product.\n\nUses and shares standard methodologies, when handling various applications and procedures during interactions with health authorities and in day-to-day work, while operating in a highly dynamic environment.\n\nLiaises closely with cross-functional team members with aligned product responsibilities.\n\nDevelops, completes and maintains submission delivery plans, submission content plans, and proactively provide status updates to designated collaborators.\n\nCoordinates the input and revision of project plans for assigned projects and highlights unforeseen changes in resource demand in a timely manner to Lead RPM and line manager.\n\nIdentifies regulatory risks and propose mitigations to Lead RPM and cross functional teams.\n\nSupports operational and compliance activities for assigned deliverables, including generating work requests and submission content plans, submission tracking, applying the support and input of Global Regulatory Operations, Marketing Companies, CROs and/or alliance partners where relevant.\n\nProvides coaching, mentoring and knowledge sharing on International markets within the regulatory organisation.\n\nContributes to process improvement.Minimum Requirements –Education and ExperienceRelevant University Degree in Science or related discipline\n\nMinimum 8 years of relevant Regulatory experience within the biopharmaceutical industry,\n\nGeneral knowledge of drug development\n\nStrong project management skills\n\nKnowledge of the Regulatory new MAA roll-out process\n\nKnowledge of International markets in some or all Int’l regions\n\nLeadership skills, including experience leading multi-disciplinary project teams.Preferred ExperienceRegulatory affairs experience across a broad range of markets\n\nHaving experience in Regulatory Information Management system (RIM)\n\nManaged regulatory deliverables at the project level\n\nExperience of working with people from locations outside of India, especially in the International regions.Skills and CapabilitiesExcellent English written and verbal communication skills\n\nCultural awareness\n\nScientific knowledge sufficient to understand regulatory issues and facilitate scientific discussions\n\nProficiency with common project management (e.g., MS Project) and document management tools\n\nAbility to work independently and as part of a team\n\nInfluencing and stakeholder management skills\n\nAbility to analyze problems and recommend actions\n\nContinuous Improvement and knowledge sharing focused.WHY JOIN US?We believe there’s always a better way of doing things. Committed to finding improvements that will impact patients with serious diseases, we are always asking questions, trying new things and sharing new proposals.Our advanced approach to Regulatory means we are leading the field. We get to work closely with drug development to influence early on and continue to make valuable contributions throughout.SO, WHAT’S NEXT?Are you already envisioning yourself joining our team? Good, because we’d love to hear from you! Click the link to apply and we’ll be in touch as soon as we can.WHERE CAN I FIND OUT MORE?Our Social Media, Follow AstraZeneca on LinkedIn https://www.linkedin.com/company/1603/We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability statusDate PostedClosing DateAstraZeneca embraces diversity and equality of opportunity.  We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills.  We believe that the more inclusive we are, the better our work will be.  We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics.  We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}