{
    "Job ID": "69858794",
    "Description": "Are you passionate about making a difference and improving people’s lives? Do you see yourself as an inspiring and enthusiastic professional who will go to incredible lengths to sell Novo Nordisk’s vision to the world? If so, then you are the Medical Representative we are looking for!This position will be based in Dubai and potentially covering Sharjah as well under the Obesity Sales department. You will directly report to the Obesity Sales Manager.Apply today and join us for a life-changing career!The PositionAs a Medical Representative, you will be representing Novo Nordisk’s vision, values, and commitments in the daily conduct with internal and external stakeholders. Not only you will be promoting and selling products to healthcare professionals, but also you will be developing and managing long-term relationships.Your main accountabilities will be:Planning, organizing, and delivering territory educational events on products and disease topics, in addition to promoting products at medical events.\nIdentifying and utilizing high-potential sales opportunities along with preparing the territory plan of action to execute the sales and marketing business objectives\nProviding customers with medical information and services consistent with their needs\nBuilding sustainable relationships and customer loyalty\nExecuting the required number of visits to given target groups to implement sales and marketing objectives  QualificationsAs a Medical Representative, you need to comply with Novo Nordisk principles and internal legal laws and defend company interests. Nevertheless, you need to defend the confidentiality of the company as well as the patients’ secrets, business plans, ideas, and strategies against third parties.To be successful in this role:Bachelor's degree in Pharmacy, Medicine, or Medical Science\nMinimum 2 years of experience in Sales in UAE is a must\nProficiency in selling, presenting, and communication skills\nProficiency in establishing, developing, and maintaining long-term relationships\nProficiency in English is a must; Arabic is a plus\nExperience in the Obesity market, medical devices, and consumer health would be beneficialAbout the DepartmentThe obesity business unit is a trailblazer in establishing the obesity market in UAE, as well as launching world-class products for the treatment of obesity. As part of the team, you will be responsible for promoting Novo Nordisk products and having exposure to our portfolio vision, business strategies, and critical market insight that contributes to driving change towards obesity. You will be contributing to ensure the latest therapies and products reach the people who need them the most.Working at Novo NordiskAt Novo Nordisk, we don’t wait for change. We drive it. We’re a dynamic company in an even more dynamic industry, and we know that what got us to where we are today is not necessarily what will make us successful in the future. We embrace the spirit of experimentation, striving for excellence without fixating on perfection. We never shy away from opportunities to develop, we seize them. From research and development to manufacturing, marketing, and sales – we’re all working to move the needle on patient care.ContactPlease click on \"apply now\" to submit your resume in English.DeadlineApply before September 28th, 2023.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}