{
    "Job ID": "69856840",
    "Description": "Degree/HNC in engineering discipline preferred and/or trade certificate in occupational health and safety with relevant significate industry experience in lifting/scaffolding operations supervision of major EPC Contractors in fabrication yards. 8 years overall experience with minimum 3 years in a similar role. LEEA Level 3 certified or HNC / NVQ Level Rigging and lifting. BS5975 / CITB/ CISRS Advanced scaffolding Inspector. Knowledge of the different types of offshore and onshore cranes. Member of LEEA, experience in lifting engineering (load curves, bearing capacity effect of the ground, stability of barges). Knowledge of International standards such as LOLER,ILO, BS, PUWER and experience in regulatory compliance Experience of Fabrication yards with multilingual workers, International project experience with Tier-1 EPC Contractor or Client, involved in fabrication of Topsides and Subsea Structures (i.e. greenfield and brownfield work). Valid Bosiet is a plus. Very good knowledge of lifting standards. A good proficiency in written and spoken English. Ability to effectively communicate on a daily basis with the local personnel without translation. Computer literacy involving the regular use of professional office applications and some technical applications\nWith over 90 years' combined experience, NES Fircroft (NES) is proud to be the world's leading engineering staffing provider spanning the Oil & Gas, Power & Renewables, Chemicals, Construction & Infrastructure, Life Sciences, Mining and Manufacturing sectors worldwide. With more than 80 offices in 45 countries, we are able to provide our clients with the engineering and technical expertise they need, wherever and whenever it is needed. We offer contractors far more than a traditional recruitment service, supporting with everything from securing visas and work permits, to providing market-leading benefits packages and accommodation, ensuring they are safely and compliantly able to support our clients.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}