{"Job ID": "69858658", "Description": "Lead diverse team(s) of technical data & analytics professionals.\nWork with the local and global technical and business data practice to strategically advise departments & leadership with their overall Data Analytics strategy and implementations.\nIdentify the solutions and services based on organization needs, constraints and strategies.\nUse AI/ML and advanced technologies to identify patterns and trend to unlock insights for business.\nLeading a large delivery function in various sized complex programs.\nLead other tasks on R&D, data governance, system infrastructure, analytics tool evaluation, and other cross-team functions, on an as-needed basis.\nAbility to encourage the highest level of quality and thought leadership in reports & data analysis.\nMaintain a strong understanding of relevant technical solutions and architecture design trends and best practices.\nHelp drive technology best practices, architecture engagements and transformation through execution phases and work closely with internal, client and third-party vendor mixed teams.\nStay abreast of current and emerging trends and challenges of the space/markets and geographies in which the organization operates, and how it affects its business and initiatives.\nWork closely with project/program management to ensure successful delivery through an integrated delivery model.\nDeliver clear and consistent communications within projects with relevant stakeholders.\nEstablish and cultivate strong relationships with internal departments.\nMeasure effectiveness of utilization of data assets and for advising resources towards high potential data sources, knowledge, and technology assets.\nUse big data and innovative data mining techniques, provide guidance on analytic techniques and business applications to unlock the value of our data across the organization.\nLed development of assets supporting scalable analytic approaches capable of being used by data scientists.\nMake recommendations and build use cases on new sources of value by addressing the biggest gaps in our data sources in relation to revenue potentialJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}