{
    "Job ID": "69856774",
    "Description": "About AtkinsRéalis  Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn.  Responsibilities:We are currently looking for a Risk Manager to form part of our Project Management Consultant (PMC) project team, based in Al Ula, Saudi Arabia.The Risk Manager is responsible the following:Develop and monitor a risk issue and opportunity management process\n\nDevelop and maintain a risk matrix identifying dependencies and the impacts of not meeting scheduled dates.\n\nIdentify, monitor and managing dependencies, and for resolving related issues.\n\nIdentify opportunities to arrange and co-ordinate any necessary discussions and agreements to realize benefits.\n\nMonitor projects and ensure that an adequate and robust Risk Management process is under active management.\n\nImplement an internal Risk Management Plan, Risk Log and associated governance processes.\n\nTrack significant risks to ensure that they are being systematically identified, recorded, evaluated, actively managed and regularly re-evaluated, and communicated across the program.\n\nIdentify, communicate and manage inter-program or external risks.\n\nIdentify and manage internal MOI & MOI PMO program-related risks.\n\nReview and update Risk Log against Program Status Reports & MeetingsQualificationsGraduate in Engineering / Business or equivalent\n\nPostgraduate qualifications or equivalent\n\nRisk Management qualification or equivalent would be preferredEssential CriteriaUnderstanding and experience of complex projects\n\nStrong leadership, communication and management skills\n\nTrack record of risk management\n\nGenerally you will have 12+ years total experience in PMCRewards & Benefits:We offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\nAnnual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}