{
    "Job ID": "69857990",
    "Description": "Job title:\nTroubleshooter- Service and RepairsYour role:Technical/Functional Competencies:Sound knowledge from the Electronics industry preferably on trouble shooting.Preferred candidates if they have knowledge in RF coils.Behavioural Competencies:Trouble shooting knowledge to solve complex problems.Equipment Selection to get the coils repaired as per the process.Critical Thinking and Monitoring the things with right mindset.Active learning – understanding the current problem and anticipating the future problem.Judgement and Decision Making – Considering the cost and benefit of potential actions to take the most appropriate one.Time Management – Actively performs his task in time.Quality Control Analysis- Conducting the trouble tests to evaluate the performance of the process and quality.Product Knowledge – RF coils applications and working in MRI systems\nYou're the right fit if: (4 x bullets max)\n1. Experience- 5-7yrs of industry experience\n2. Skills- SMT, RF coils, IPC standard, soldering\n3. Education- Any Diploma\n4. Anything else- Product Knowledge – RF coils applications and working in MRI systems.\nAbout Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Manufacturing",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}