{"Job ID": "69856877", "Description": "Atkins is looking for a Senior ID Architect for Site Supervision team in Umluj, KSA for large Hospitality developments.Experience in Five star hotel or Water villas required.Minimum Requirements:Bachelor of Science degree in Engineering or equivalent.Minimum of 15 years of relevant experience Construction industry with comprehensive experience in Interior Architecture.Reviewing of  drawing and calculation  interior fit-out & joinery shop drawings submitted by Sub-consultants and shop drawings submitted by contractors and issue OCS (Observation and Comments) review report and recommendations.Responsible for all Joinery, final finishes& fit-out site inspectionReviewing of the technical material submittals and RFIs from the contractors and provide responses.Attending technical meeting with contractors and sub-consultants and do the necessary coordination as required.Provide technical assistance to project managers and make coordination and technical consultation with other disciplines as required. Project hand over inspection at site and prepare report accordingly.Excellent written and verbal communication skills. Excellent technical, team-working and interpersonal skills.SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.\nWe provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.\nAtkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.SNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}