{
    "Job ID": "69857511",
    "Description": "Role PurposeAs part of a highly motivated, multinational team, you will contribute directly to provide a technical solution to enable performance reviews, business partnering to understand the detailed requirements, identifying and managing risk and the provide enhanced support through financial systems.Support _VOIS Head of Anaplan CoE to enable setup financial systems across VOIS in all aspects of month end performance reporting, insightful financial planning and value oriented support to the business through detailed analysis.This role will also work closely with the Planning and Reporting Manager and undertake wider cross functional and cross centre projects on ad hoc basis.Act as a techno-functional Anaplan Solution Architect. Responsible for delivering and supporting Anaplan solutions for the enterprise.\nContinuing to develop & keep Anaplan current in connection with new release across the platform. Supporting the design and gathering of business requirements for enhancements in the Anaplan models.\nResponsible for working with Business Analysts, Solutions Architects, and other developers in delivering functionality through an Agile delivery methodology.\nProviding functional expertise in identifying, evaluating and developing solutions that meet user requirements by utilizing the Anaplan platform.\nAnalytics and Excel experience for testing developed solutions in a rapidly growing environment.\nAbility to translate from model- building in Excel to multi- dimensional technologies.\nMonitoring data flows to and from internal systems to ensure all data is up- to- date and accurate.\nPerform Anaplan system setup & configuration and maintain planning and financial templates.\nIndependently provide system solutions to Anaplan issues and enhancements\nIndependently identify areas of improvement and makes recommendations. Effective utilisation and ideas for Space management in Anaplan to drive cost savings and product effectiveness\nIn addition to Anaplan, good to have working knowledge of other functional tools like SAP EVO, Hyperion Planning and Essbase design.Strong Technical Knowledge to support solutions for enterprise.\nProject Manage the Systems Development and the dependencies there of.\nResilient, ‘can do’ attitude with courage and conviction to take initiative, propose ideas and constructively challenge key stakeholders.\nInnovative thinking and ability to develop analysis, and critically assess technical feasibility and to identify & highlight the business risk, if any.\nStakeholder management – ability to build strong and influential senior and cross functional relationships.\nResilient, ‘can do’ attitude with courage and conviction to take initiative, propose ideas and constructively challenge key stakeholders.\nVery good command of English language (verbal/written).Educated to degree level\nCA / MBA\nAnaplan Skillsets (2 - 8 years of experience working on Anaplan)Educated to degree level\nCA / MBA\nAnaplan Skillsets (2 - 8 years of experience working on Anaplan)Effective utilisation and ideas for Space management in Anaplan to drive cost savings and product effectiveness\nEnsure the use of Agile Delivery Methodology in the development of the functionality, as applicable.\nEnsure the System developed has appropriate documentation for delivered solution.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}