{"Job ID": "69856833", "Description": "Job Title: Project Engineer - SecondaryLocation: Chennai, IndiaJoin Us!We combine SNC-Lavalin’s project management expertise and Hitachi Energy’s deep technological knowledge to create a company dedicated to substations – we are Linxon!The Project Engineer – Secondary will work on project/Tender specific activities assigned to the OPC group along with skilled team on a wide range of international T&D substation projects. Individual contributor using prior theoretical learning or knowledge of methods and technologies to execute work assignments using established solutions. What will you do?Develop the tender engineering deliverables\nPrepare all technical documentation for the equipment specification as input to the purchase requisitions\nPreparation of Single Line Diagrams.\nPreparation of Protection SLD showing relays and meters.\nPreparation of Protection Logics & Interlock diagram.\nReview of Vendor drawings and documents (technical vetting of Control & Relay panels, Auxiliary System).\nBasic Knowledge in Substation protection system Distance Protection, Differential Protection (High Impedance and Low Impedance), REF Protection and O/C & E/F Protections etc\nCalculations CT & VT Sizing, Battery Sizing calculation, Cable Sizing, Etc.\nAuxiliary Power System design like Low Voltage AC Panel & DC Panel requirements\nPreparation of Cable block diagram.Experience and Education Required:6-7 years’ experience in secondary electrical engineering\nBachelor’s Degree / Master’s degree in Electrical / Power Engineering.\nSound knowledge on Secondary engineering of AIS & GIS transmission and distribution substation up to 400kV.\nExperience in Europe & Gulf utilities is preferred.What we offer:In return, we offer a wide range of rewards and benefits,20 days Privilege Leave, 13 days Emergency leave and 14 Public holidays per year\n\nMedical Insurance, Life Insurance\nGlobal Career Progression OpportunitiesED&I:When it comes to diversity and inclusion, we see things differently at Linxon - we encourage applications from people of all races, ages, genders, religions, sexual orientations and more - so whoever you are, we hope you’ll see things our way, tooAbout LinxonShaping energy solutions to empower sustainable connectivity.We combine SNC-Lavalin’s project management expertise and ABB’s deep technological knowledge to create a company dedicated to substations – we are Linxon.Linxon’s vision is to deliver the best market offering for turnkey substation projects through world-class power technologies and delivering the highest level of competence in managing infrastructure projects.As a leading engineering company, we help our customers with turnkey substation solutions in the field of power transmission, renewable energy, and transportation.In this role, you will have the opportunity to be part of a new company as it evolves and help shape it for the future. If you like new challenges, have an entrepreneurial spirit, and are interested in working with other motivated professionals with expertise in the Substations EPC business, then this is the new opportunity for you.To know more about the Linxon please click on the link below.Building the infrastructure to power the world - we are Linxon! - YouTubeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}