{"Job ID": "69858364", "Description": "The opportunityThis is an opportunity to grow your career with a market-leading multi-national project management consultancy.Our values are integrity, safety first, client focus, and creating opportunities for our people. These values underpin everything we do and are what provide our people with opportunities to grow, develop and progress within a world-class organisation.We are an employer of choice, seeking the best people in their field, who deserve the best employer to support their career.Project: More than 2 million square feet mass housing project in Mumbai.Your responsibilities will include:Managing the performance of the baseline schedule and the maintenance.\n\nCollecting and interpreting schedule data and providing output to the programme and project teams.\n\nMonitoring actual performance against the schedule to identify delays and suitable mitigation measures.\n\nInterfacing with the project technical staff to define changes to schedules and identification of variances from the original plan.\n\nIdentifying and evaluating associated schedule, and resource conflicts.\n\nWorking closely with the contractors, evaluating their schedules and actively managing the schedules with them to ensure a successful outcome.\n\nManaging the project master schedule in line with individual work package schedules prepared by contractors.\n\nDeveloping MIS reports.\n\nHaving advanced planning software capability, constructability, logistics, and third-party interface skills.\n\nDeveloping and managing all pre-construction activities.\n\nUnderstanding the need to use speed to create a competitive advantage. About youYou have a degree qualification in civil engineering with MSP Proficiency and are a member of a professional body. You have experience in planning and scheduling of any project of a similar nature from start to handover.You are digitally savvy and can build lasting client relationships and provide support to strong, motivated teams. You have previous working experience on construction projects and be hungry to grow your career and enjoy the opportunities Mace has to offer.#LI-OnsiteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}