{"Job ID": "69857302", "Description": "JOB DESCRIPTION:MAIN PURPOSE OF ROLEResponsible for coordinating and executing activities involving the analysis of business opportunities both in the domestic and foreign markets, aiming at achieving the financial and marketing goals established by the company.MAIN RESPONSIBILITIES•    Oversee and coordinate the work in a business development team.\n•    Coordinate a business development team which evaluates, analyzes, and formulates strategies for business growth.\n•    Responsible for the development of key projects and participates the successful closure of business deals.\n•    Executes the planning and preparation of business proposals, and supports the provision of recommendations to senior management.\n•    Typically without budget or hire/fire authority.\n•    Focuses on mentoring, coaching, and coordination.Achieve sales targets assigned to the area ,territory wise , Brand wise every month - Ensure implementation of company strategies in the market place - Launch and nurture international brands - Train and develop knowledge and skills of Territory executives to build competencies - Profile towns and customers to improve the productivity of territories - Maintain customer contact of the team to enhance prescription share - Organise outreach activities to capture patient population - Channelise distribution to ensure availability of products - Provide feedback to Marketing team in relation to brand promotion and competitors activity - Ensure timely submission of reports - Maintain high ethical values in the market place.The base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}