{"Job ID": "69859113", "Description": "Leading the future in luxury electric and mobilityLFT ProgramTraining Program Summary:You will go through 6 months of intensive on-the-job training to prepare you to handle the role and responsibilities of this position. The Role:As a Studio Associate in a Lucid studio, your primary responsibility will be to deliver exceptional, personalized, customer interactions.You are a motivated and engaging quick learner with a penchant for providing memorable and enjoyable customer experiences.To be successful in this role, you should be an incredible communicator with the ability to recognize subtle social cues. You will be eager to support the studio team with ad hoc tasks where required and consistently act as a brand promotor.Responsibilities:Be a critical Lucid Ambassador; the first point of engagement guests will have with Lucid.\nWelcome guests in an engaging, courteous, and sincere manner.\nDemonstrate excitement and create intrigue about Lucid products.\nEffectively communicate the benefits of Lucid products and being a member of the Lucid community\nGauge guests' requirements and interests to deliver a personalized and relevant interaction.\nBe responsible for lead capture and progression of guests through initial part of the Lucid journey.\nManage and overcome customer challenges in a cordial and calm manner.\nEnsure all studio assets are presentable and consistent with the Lucid brand image.\nKeep a keen eye on any pain points or bottlenecks observed during daily studio operations, think creatively, and offer improvement suggestions.\nRemain available for ad-hoc activities to improve studio operations and customer experiences.\nSupport local marketing initiatives and events to build brand awareness.\nMaintain a continuing desire to learn and develop to progress your career with Lucid Motors.Qualifications:Bachelor’s degree or diploma.\nEnglish fluency is a must.\nGreat people skills, including strong oral and written communication, empathy, and active listening ability.\nTech-savvy\nConscientious, responsible, and reliable.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}