{
    "Job ID": "69856838",
    "Description": "We are currently looking for an experienced Planning and Scheduling Engineer to form part of our Project Management Consultant (PMC) project team, based in Madinah, Saudi Arabia.Roles and ResponsibilitiesAbility to develop initial baseline schedules with little project information. This requires previous experience is hospitality / mix use development projects.\n\nAssist in the preparation and management of overview and strategic programmes, including design, procurement and construction schedules together with supporting information required schedules\n\nInclude all project stages from initiations to completion in the baseline and identify stage gates accordingly.\n\nCoordinate and manage the preparation and development of master planning, engineering, procurement, and construction schedules together with associated information required schedules\n\nEstablish and agree project reporting procedures, prepare and present monthly project progress. Develop project and programme dashboard templates to be used across the programme by designer and contractors.\n\nReview the schedules and related documents from the designers and contractors including monthly reports and analyse the content to ensure compliance with project objectivesReview schedule trends to identify problem areas and recommend corrective action to management.  Monitor actual progress against planned progress\n\nMonitor engineering design progress, material and equipment procurement and construction and commissioning status\n\nPrepare progress monitoring tools using earned value for the management and monitoring of the above mentioned schedules.  Monitor progress both on and off site.  Identify deviations (progress trends) in both construction and procurement progress and suggest possible courses of corrective action\n\nWorking closely with the Project Controls Manager and Project Team to ensure that the ‘programme’ is feasible, complies with the Project Master Plan and contractual documents\n\nInterface on a daily basis with the designers, PMCs, main contractor sub contractors and internal management.\n\nCarry out studies into scheduling, manpower, cash flow, and material flow as needed\n\nAttend offsite meetings as requested by the client\n\nReview schedules for slippage of key dates\n\nAssist in the defence / approval of any claim for time extension or major change to the schedule\n\nOther duties as requested from time to time\n\nEnsuring that each Planning Engineer runs his or her section to the highest professional standards, that all information is current, and that every member of the team is receiving the information he or she needs to fulfil their responsibilities.\n\nEstablish and maintain consistent and adequate administration procedures, in their field.  These procedures will be followed across the project by the respective planners working under the Construction Managers.\n\nParticipate with the project management team, as directed by the Project Director, to achieve project deliverables.\n\nInvolve key stakeholder requirements and approvals in the baseline\n\nIssue high-level schedule weekly updates\n\nIdentify and report main issues interfering with progress\n\nIdentify and report on measures for improving schedule performanceEstablish Scheduling, reporting procedures, tools, templates, instruction, etc. to standardise the work across the programme.\n\nMonitor the timing of submittals against schedule requirements\n\nDevelop and monitor programme KPIs  Requirements:Ideally you should possess a degree in construction management and / or civil engineering and hold a membership/chartership from a construction related professional body.\n\nGenerally you will have 10+ years total experience and have a track record of working on heritage/ hotels/master planning/ museum / cultural / pavilion projects for 10+ years, ideally with 5+ years’ experience of working in the region.\n\nArabic speaking and writing an advantageRewards & Benefits:We offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\nAnnual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants;SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide. \nOur aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Equal Opportunities StatementSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}