{"Job ID": "69856866", "Description": "We are on lookout for brightest and the most passionate minds in India!We are hiring for Interns – Water Resources and Environment currently pursuing M. Tech in Water Resources or Environment to join our team. This role will be based at our Atkins office in Bengaluru, Gurugram and Mumbai India.ENGINEER A PROGRESSIVE CAREER WITH ATKINS!Atkins, a member of the SNC-Lavalin Group, is a leading global engineering, design and project management organization with over 80 years' expertise. With us, you'll join a team of people who ask questions, who dare to see things differently and want to build a better world. We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects across the world. We are committed to having a diverse, flexible, and inclusive team that drives and shapes our business and we are proud to create opportunities for enthusiastic individuals looking to build their careers in India and globally.With over 50,000 professionals operating across 50 countries, the career opportunities at Atkins are endless.Read More: India | Careers at SNC-Lavalin, Atkins, Faithful + Gould (snclavalin.com)YOUR PROGESS is OUR PURPOSEWe’re not all the same, and that’s our greatest strength. Different views and opinions enhance our ability to provide value-added performance and better services for our clients. That’s why we believe different, makes a difference.Our internship programs have been designed to give you an insight into the variety of opportunity on offer across our business and the chance to explore where your own specific skills and interests lie. Through a combination of on-the-job learning and practical skills development within your chosen role, you’ll work on real projects from day one that offer scale and variety collaborating with others and creating meaningful impact on the world around us. You’ll work towards your fulfilling your passion; whichever path you take, your future starts here.Read more about how you can thrive with us.With us, you’ll be working to change the world.Qualifications & Experience:Tech in Water resource and Environmental Engineering.\nGood verbal and written communication skills.\nGood knowledge on BS IS Codes and Standards. Roles & Responsibilities:You will be part of the Water and Environment team carrying out the design of a range of elements associated with infrastructure drainage, treatment plants, Hydrology and Hydraulics projects.  You will be responsible for:Design of treatment plants, River, Dam and Maritime, Pipelines, Water retaining structures\nModelling related to water and water infrastructure (storm, wastewater, water)\nFlood risk assessment, Flood alleviation, water Quality modelling  \nmaintaining technical quality standards\ndelivering projects to time and budget\nliaising with UK based customers in a responsive and client focused mannerWhat we offer at Atkins?At Atkins, you will enjoy a robust rewards package which includes:Opportunity to work on various projects of various sizes.\nCompetitive stipend.\nLearning and development programs, training, career opportunities.\nNetworks and communities around Equality, Diversity & Inclusion, CSR, Cultural Activities, Sports and beyond.Share our opportunities with your friends looking for graduate roles and internship opportunities with Atkins!JOIN US TO MAKE A DIFFERENCE THAT MATTERS!\"Apply Now\" to register your details and start your application journey.Our programs are incredibly distinctive, and some roles may close early. So, avoid disappointment by getting your application in as soon as possible.Follow us on social media to stay updated on what’s happening #InsideatkinsTwitter- https://twitter.com/insideatkinsLinkedIn- https://www.linkedin.com/company/atkinsFacebook- https://www.facebook.com/InsideAtkins/YouTube- https://www.youtube.com/user/wsatkinsplcInstagram- https://www.instagram.com/insideatkinsWe weave Equality, Diversity & Inclusion into everything we do.“We are committed to promoting a diverse and inclusive community - a place where we can all be ourselves, thrive and develop. To help embed inclusion for all, from day one, we offer a range of family friendly, inclusive employment policies, flexible working arrangements and employee networks to support staff from different backgrounds. As an Equal Opportunities Employer, we value applications from all backgrounds, cultures and ability.”Together, we can engineer a better future for our planet and its people.Contact Recruitment.gtc@atkinsglobal.com for any queries or support.With Atkins, you'll be in great company.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Delhi, India", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}