{
    "Job ID": "69858204",
    "Description": "Job Description\n2023 will potentially see Sandoz become a standalone organization! Already a global market leader in Generics and Biosimilar medicine, this is an exciting, once-in-a-career opportunity to set our own path forward as an independent, purpose-driven organization, and as the founders of a new Sandoz, this is a time of immense opportunity for us all, both professionally and personally!\nTogether we will shape the future of Sandoz... are you ready to make a difference?\nMajor Accountabilities\nExpertise in leading Gastroplus, Phoenix WinNonlin and DDD Plus software in performing the in-silico simulations to support the generic formulation development\nExpertise in Pharmacokinetic modeling and establishment of PBPK and IVIVC models\nGuide and collaborate with associates for the in vitro experimentations such as solubility, IDR and development of bio relevant and discriminatory dissolution methods\nReview of data from various in vitro experiments and BE studies\nIndependently write protocols, reports or lab procedures based on templates.\nWork in collaboration with multifunctional project team\nIndependently perform and document in silico modeling and simulation for various biopharmaceutical activities. Thorough knowledge on the functionality of excipients used in OSDs.\nProvide documentation and draw relevant conclusions independently and design next experiments; supervise project related scientific/technical activities. Communicate, address and resolve problems (e.g., deviations and unexpected results from experiments) within own and broader area of responsibility; communicate efficiently across organizational interfaces.\nDiversity & Inclusion / EEO\nWe are committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\n10 + years of Experience\nWork in collaboration with multifunctional project team\nIndependently perform and document in silico modeling and simulation for various biopharmaceutical activities. Thorough knowledge on the functionality of excipients used in OSDs.\nProvide documentation and draw relevant conclusions independently and design next experiments; supervise project related scientific/technical activities. Communicate, address and resolve problems (e.g., deviations and unexpected results from experiments) within own and broader area of responsibility; communicate efficiently across organizational interfaces.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}