{"Job ID": "69857681", "Description": "As a recognized authority and leading contributor, this project management professional, provides consistent innovative and high quality solution leadership. Responsible for guiding the successful implementation of non-routine and complex business solutions ensuring high quality and timely delivery within budget to the customer’s satisfaction. Analyzes business needs to help ensure Oracle’s solution meets the customer’s objectives by combining industry best practices and product knowledge. Effectively applies Oracle’s methodologies and policies while adhering to contractual obligations, thereby minimizing Oracle’s risk and exposure. Exercises judgment and business acumen in selecting methods and techniques for effective project delivery on small to medium engagements. Provides direction and mentoring to project team. Effectively influences decisions at the management level of customer organizations. Ensures deliverables are acceptable and works closely with the customer to understand and manage project expectations. Supports business development efforts by pursuing new opportunities and extensions. Collaborates with the consulting sales team by providing domain credibility. Manages the scope of medium sized projects including the recovery of remedial projects. 8-10 years of experience relevant to this position. Prior project team leadership or management experience. Demonstrated ability to follow solid project management principles. Comfortable working in a matrix management environment. Strong communication skills to deal with internal stakeholders, customers, and vendors. Product, technology or industry expertise relevant to the portfolio focus. Selling skills preferred. Undergraduate degree or equivalent experience. Ability to travel as needed.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Non-Profit Organization", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}