{"Job ID": "69859096", "Description": "Job Title:Assistant/Associate Professor in Management/Human Resource ManagementJob Summary:We invite applications for the following faculty position for Spring 2024: Assistant/Associate Professor in Management/Human Resource ManagementThe faculty member appointed to this position will be credentialed to teach Management/Human Resource Management in both undergraduate and graduate programs. In addition to demonstrating the potential for teaching excellence, the faculty hired to this position must have a research record or agenda that supports being classified as a “scholarly academic” under the AACSB accreditation standards.  All AURAK faculty must also engage in service to the university, the discipline, and the community.Job Description:Faculty Opening:Assistant/Associate Professor in Management/Human Resource Managementin the School of Businessat the American University of Ras Al KhaimahThe American University of Ras Al Khaimah (AURAK) is an independent, public, state-owned, non-profit, coeducational institution in the United Arab Emirates that offers undergraduate and graduate degrees. AURAK provides comprehensive academic programs based on the North American model and the cultural characteristics of the Gulf region. AURAK has been officially licensed by the UAE’s Ministry of Education (MOE).  All of the University’s academic programs are accredited by the Commission for Academic Accreditation (CAA). In addition, AURAK has achieved accreditation with the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC). All instruction at the university is in English.The School of Business currently offers one undergraduate program (BS in Business Administration) with majors in Human Resource Management, Finance, Accounting, Business Analytics, Marketing and Hospitality and Tourism Management.  It also offers two graduate programs (MBA and Executive MBA). The school has been granted initial accreditation by the Association to Advance Collegiate Schools of Business (AACSB) in 2023.We invite applications for the following faculty position for Spring 2024: Assistant/Associate Professor in Management/Human Resource ManagementThe faculty member appointed to this position will be credentialed to teach Management/Human Resource Management in both undergraduate and graduate programs. In addition to demonstrating the potential for teaching excellence, the faculty hired to this position must have a research record or agenda that supports being classified as a “scholarly academic” under the AACSB accreditation standards.  All AURAK faculty must also engage in service to the university, the discipline, and the community.Qualifications and requirements:An earned doctorate in business with the appropriate specialization from an accredited university\nA record of established research for the associate/assistant professor rank\nA history of successful university teaching experience in the specialization\nA record of university or community serviceThe region:Located at the mouth of the Gulf, Ras Al Khaimah (RAK) was once the historical capital of the region. RAK boasts many outdoor attractions, with plenty of places for leisure, water sports, hiking and mountain climbing, and other athletic pursuits, all within a safe and family-oriented environment. Away from frenzied traffic and rush of the larger cities, but still well-developed, RAK is a quiet but vibrant Emirate. It is an ideal location, for both those who want to relax and those who are more active away from work. How to apply:Applications should be submitted electronically via the following link:https://employment.aurak.ac.ae/AccountExt/RegisterCandidateApplications must include:Cover letter describing qualifications for and interest in the position\nUpdated CV, including the names and contact information for at least three professional references (permission will be sought to solicit references off this list should the candidate be shortlisted for interview)\nSummaries of recent teaching evaluations\nTwo or three of the candidate’s recent research papers that have been either published in a peer-reviewed journal or presented at a peer-reviewed conference\nCopies of master and doctoral degrees or diplomas along with transcripts (official transcripts will be requested if an offer of employment is made)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}