{
    "Job ID": "69857638",
    "Description": "JOB TITLE: Senior Information ArchitectCAREER LEVEL: ELeverage technology to impact patients and ultimately save livesDo you have expertise in, and passion for, information technology? Would you like to apply your expertise to impact the IT strategy in a company that follows the science and turns ideas into life changing medicines? If so, AstraZeneca might be the one for you!ABOUT ASTRAZENECAAstraZeneca is a global, science-led, patient-focused biopharmaceutical company that focuses on the discovery, development and commercialisation of prescription medicines for some of the world’s most serious disease. But we’re more than one of the world’s leading pharmaceutical companies. At AstraZeneca we’re dedicated to being a Great Place to Work.ABOUT OUR IT TEAMIt’s a dynamic and results-oriented environment to work in – but that’s why we like it. There are countless opportunities to learn and grow, whether that’s exploring new technologies in hackathons, or redefining the roles and work of colleagues, forever. Shape your own path, with support all the way. Diverse minds that work cross- functionally and broadly together.About the roleAstraZeneca is a global, innovation-driven, patient-focused biopharmaceutical company that focuses on the discovery, development and commercialization of prescription medicines for some of the world's most serious diseases.AstraZeneca (AZ) is in a period of strong growth and our employees have a united purpose to make a difference to patients around the world who need both our medicines and the ongoing developments from our science. In this journey AZ must continue to work across borders and with partners and new colleagues in a fast and seamless way. The ambition, size and complexity of the organisation, coupled with the opportunities afforded by new technology, has led the Board to approve a large scale transformation of the IT landscape by the replacement of current ERP (Enterprise Resource Planning) systems with one global solution.Our current technology is used by more than 20,000 employees daily, is foundational to all AZ entities and is central to most core business processes. Yet this is not an IT or technology led programme, rather this provides the opportunity for real business transformation and to shape the way of working globally for many years to come. By the time of its completion this programme will impact every AZ product, every AZ supplier, every $ of cash collected from AZ customers and every external financial and internal KPI report.This programme requires the best. Whether it be the technical skills, business understanding or change leadership, we want to ensure we have the strongest team deployed throughout. The programme seeks to deliver a world class change programme that leaves all employees with a fuller understanding of their role in the end-to-end nature of our global company. This programme will provide AZ with a competitive edge, to the benefits of its employees and patients.We are looking for a passionate Information Architect, who will play a leading role in ensuring that AstraZeneca architects and builds solutions that deliver FAIR data products enabling both digital and data/AI. Focusing initially on our regulatory domain, which is the business group involved in managing all AstraZeneca regulatory submissions and interactions, you will lead activities to define the information architecture for the domain, including data models, master data strategies, metadata strategies and the connection with the enterprise data office to ensure that data is appropriately defined and governed. You will have a responsibility to deliver the efficient design of data and information architectures to support business objectives. A key component of delivery will be to ensure that AstraZeneca data is Findable, Accessible, Interoperable and Reusable (FAIR) across our systems, ready for either direct use by consumers or AI machines. You will also partner with other functions, such as engineering, business data governance and data analysis as well as Enterprise architecture functions to deliver business value.Job description & role requirements:Essential:Strong knowledge of and experience with SAP Data structures in functional areas such as Quality Management, Clinical Supply, Procurement, Supply Planning, Sales & Distribution, Warehouse Management, Production Planning, etc.\n\nGood Communication skills - should be able to interact effectively with the stakeholders.\n\nExperience in translating requirements into fit for purpose data models, data processing designs and data profile reports\n\nExperience in working relevant domains e.g. Pharma, R&D, Manufacturing, Commercial, Finance, HR, Legal, Facilities etc.\n\nPrior experience in SAP Information Architecture\n\nExcellent written and verbal communication, and consultancy skills\n\nThe role holder will possess a blend of information architecture and analysis skills, together with experience in overseeing implementation within engineered solutions.\n\nExperience of enterprise data modelling and usage of tools such as ER Studio and SAP Power Designer.\n\nExperience of designing master data solutions and strategies.\n\nExperience in the use of metadata standards.Desirable:Understanding of FAIR data management principles\n\nExperience of running a data architecture governance function\n\nExperience in coaching Junior Analysts and guiding team members to improve their skills for future Business (Data) Transformation.WHY JOIN US?We’re a network of high-reaching self-starters who contribute to something far bigger. We enable AstraZeneca to perform at its peak by delivering premier technology and data solutions.We’re not afraid to take ownership and run with it. Empowered with unrivalled freedom. Put simply, it’s because we make a significant impact. Everything we do matters.SO, WHAT’S NEXT?Are you already envisioning yourself joining our team? Good, because we’d love to hear from you! Click the link to apply and we’ll be in touch as soon as we can.WHERE CAN I FIND OUT MORE?Our Social Media, Follow AstraZeneca on LinkedIn https://www.linkedin.com/company/1603/We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.Date PostedClosing DateAstraZeneca embraces diversity and equality of opportunity.  We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills.  We believe that the more inclusive we are, the better our work will be.  We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics.  We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}