{
    "Job ID": "69857351",
    "Description": "Requisition ID: 271787 Relocation Authorized: None \nTelework Type: Full-Time Office/Project \nWork Location: New Delhi Company Overview:Since 1898, we have helped customers complete more than 25,000 projects in 160 countries on all seven continents that have created jobs, grown economies, improved the resiliency of the world's infrastructure, increased access to energy, resources, and vital services, and made the world a safer, cleaner place.\nDifferentiated by the quality of our people and our relentless drive to deliver the most successful outcomes, we align our capabilities to our customers’ objectives to create a lasting positive impact.\nWe serve the Infrastructure; Nuclear, Security & Environmental; Energy, and Mining & Metals markets. Our services span from initial planning and investment, through start-up and operations. Core to Bechtel are our values – ethics, safety, quality, people, culture, relationships, innovation and sustainability, and our covenants – integrity, respect, collaboration, trust, and delivery. They are what we believe, what customers can expect, and how we deliver.Summary:A recognized degree in electrical engineering discipline, from an accredited college or university. Minimum of 9 years of relevant experience.\nRelevant work experience in FEED, proposal & detailed engineering preferably in an EPC industry for Energy, Manufacturing units, M&M projects. Working on International Projects shall be added\nadvantage.\nWithin discipline develops Electrical Heat Tracing designs for complete and complex engineering systems and plant arrangements.Job Dimensions:Supervision ReceivedReceives operational supervision and technical guidance from Senior Engineer.Supervision ExercisedSupervises and provides technical direction to subordinate engineers, designers and drafters as assigned.ContactMaintains contacts with client representatives as directed, with suppliers, appropriate field personnel and other disciplines to ensure the coordination of the work within the project or assignment and compliance with Bechtel/client requirements.Job Knowledge:Perform Electrical Heating system design for piping, instruments and equipment using heat tracing design programs. Performs necessary electrical calculations for cable sizing, heat tracing cables, panels circuit design and system design per NEC or other specified job standards.\nUnderstand and implement the zoning EHT circuits with appropriate power and control methodology.\nEnsures EHT Isometric designs are in line with the piping, P&ID, area classification & LDT information and being consistent with the project code and IEEE 515 requirements.\nEnsure power connection, RTD location, cable type and length, trace ratio, sheath temperature, heat loss and appropriate safety factor is applied for the EHT designs.\nEnsuring that the EHT design and tracking are up to date in EHT Access Database.\nChecks EHT deliverables such as EHT Isometrics, power and RTD cable schedules, Heat Trace panel and termination schedules, EHT controller set point schedule, MTOs.\nAbility to develop innovative ideas to reduce project total installed costs (TIC).\nAbility to present technical design issues to the customer and supplier and the ability to recommend solutions based on knowledge and experience.\nSupports the creation of a work environment that fosters openness, trust, communication, teamwork, empowerment, innovation, and satisfaction.Shaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}