{"Job ID": "69856763", "Description": "Faithful+Gould is a hands-on project delivery organisation that has moulded its business to respond to the demands of the nations in which it operates.  In doing so, we actively seek to employ staff who possess strong pro-active management skills which enables them to understand the entire delivery process from site acquisition through to feasibility, design, construction, sales and occupancy phases.  Our end-to-end project delivery solution is focused on best maximising project outcomes while minimising project risk for our Clients.We are currently looking for Programme Director in Abu Dhabi, with a demonstrated experience in the management of large scale projects villa development programs.You will be required to provide the senior management input into all project delivery related matters and be fully responsible for the successful delivery of services for the engagement(s) assigned to you.  You will be required to act as the single focal point of contact between the Programme Director and the internal and external delivery team members, possibly across multiple projects, to ensure that the desired project objectives are delivered. This is a senior leadership position that requires professional ability and inherent motivation.  You have the skills required to direct meetings, introduce discussion to encourage thinking on the wider commercial context and be responsible for the tasks assigned to members of your project team.  You are willing and able to perform duties diligently to the quality standards set by the Company and conform to the Company’s policies and business systems and be committed to their implementation and continuous improvement at all times.Your experience, guidance and knowledge should place you as a Project Management subject matter expert in providing significant benefit to the project delivery team and Client.Generally you will have 20+ years total experience and have a track record of working on mega projects.Ideally you should possess a degree in construction management and / or civil engineering and hold a membership/chartership from a construction related professional body.Experience in managing large villa programs is mandatory.UAE experience is mandatory (ideally Abu Dhabi).You will be responsible for at least the following areas and duties in your role;Planning/Scheduling•Implement a high-level effective project management framework and project execution statement. Provide guidance and advice to other staff members in relation to the production of the project execution plan, review content and take ultimate responsibility for content prior to issue on the project.•Define and implement criteria for control and management of the project.•Monitor, review and ultimately take responsibility for the content of the project master programme.  Unsure the structure of the master programme is in line with the envisaged or agreed project WBS and provide strategic guidance to the schedule formulation.•Monitor and oversee progress status updates of the master programme and where necessary liaise with project stakeholders to lead delay mitigation strategies and improvement initiatives.•Monitor and ensure the contract programme under the construction contracts is in place, fully reviewed and approved by the necessary project stakeholders and that all revisions and or progress updates are thoroughly reviewed and accepted.•Take an active and leading role in the control of ‘time’ on the project, ensuring a protocol and full review of early warnings is in place, and generally ensure a project structure, and personal ownership of changes, is implemented.Risk Management•Ensure that a formal risk management process is in place on the project, utilising agreed BMS risk register and management process.•Hold, chair and lead risk meeting and actively participate in formulation of mitigation and control measures.  Regularly discuss risk management•You are likely to be responsible for the technical and commercial performance of the engagement on behalf of the company.  Upon commencement undertake a full handover from the bid manager /responsible director and ensure the engagement risks are fully identified and control measures in place.  Lead the formulation of an internal Project Management Plan (as dictated within the BMS) that sets out the internal arrangements around delivery, resource management, financial management and PSR establishment/ownership.Construction Phase Management •Manage the relationships between all project stakeholders to facilitate effective communications and outcomes•Manage the design team and site delivery team performance of delegated responsibilities•Establish an effective and universal strategy to address major issues that may arise with the site delivery team•Ensure the supervision team and site delivery team receives the necessary stakeholder decisions in a timely fashion•Establish a mechanism to ensure collaborative problem solving with the site delivery team, which will involve regular dialogue with contractors, team working and risk-sharing•Chair and lead progress meetings with the contractor and supervision consultant to pro-actively manage the project and mitigate any delivery issues prior to it impacting delivery•Monitor the delivery of Contract Administration services by other, and ensure such is protecting the Client as far as possible.  Pro-actively monitor this service to ensure active claims protection and management is in place through the issue of contractual correspondence and record maintenance. Note if Faithful+Gould is fulfilling the role of Contract Administrator further project specific roles and responsibilities will be required to be set out in the Project Management Plan section and specific sign-off from the assigned regional director will be necessary.People•Invest in sound people management principles to ensure that the team of staff, contractors and other partners works well and provides a supportive environment for the achievement of project and individual objectives•Uphold the values of the Company through your actions and assist to enforce Company standards at all times•Demonstrate clear leadership•Manage the welfare and motivation of all company direct reports, providing leadership, guidance and encouragement•Mentor and guide direct reporting staff to grow, improve, develop and together with Senior Management set clear career and role objectives.•Plan for and undertake annual performance reviews in line with company processes.Commercial Management•Take overall responsibility of the ‘cost’ element of the project, even if through the monitoring and management of a third party cost consultant.  If the engagement also includes cost consultancy services project specific responsibilities will need to be included in the Project Management Plan and discussed with your assigned regional director.•Ensure effective budget control is in place across the project, and that such is reviewed and updated on minimum monthly basis.•Where applicable lead and oversee the value management strategy.•Oversee the award of contracts and review on behalf of the Client.•Negotiate and convert contracts as required by the project(s)•Manage the commercial performance of the project for Faithful+Gould in line with corporate governance requirements.Client Management• As the lead team member for the company assigned to the project you will have overall responsibility to manage and facilitate a pro-active and positive relationship with the Client.• Identify and resolve disputes quickly and reasonably, taking the lead role in the resolution of any disputes that may arise.•Lead the process of Client engagement, through regular meetings, presentations and discussions during the project delivery.  Be comfortable leading such scenarios and exhibit exemplar communication skills, representing the company well and in a professional manner in all cases.•Develop and maintain excellent relationships with client representatives, consultants, contractors and other project stakeholdersReporting•Receive and review detailed reports on the project from the design and site delivery team•Establish formal reporting arrangements on project progress for the Client and Company•Maintain up-to-date project skite sheets and resumes for the project team for use by the CompanyBusiness Development•Identify and communicate potential business development opportunities to the Company•Actively promote the interests of the Company within the industry.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide.Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}