{
    "Job ID": "69859217",
    "Description": "DescriptionEstablished in the region for 40 years, PwC has around 8,000 people in 12 countries across the region: Bahrain, Egypt, Iraq, Jordan, Kuwait, Lebanon, Libya, Oman, the Palestinian territories, Qatar, Saudi Arabia and the United Arab Emirates.Our regional team operates across the Middle East bringing international experience delivered within the context of the region and its culture. We can bring the collective knowledge and experience of more than 328,000 people across the entire global PwC network in advisory, assurance and tax to help you find the value you are looking for.Job Description & SummaryTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.As a Senior Associate, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:Use feedback and reflection to develop self awareness, personal strengths and address development areas.\nDelegate to others to provide stretch opportunities, coaching them to deliver results.\nDemonstrate critical thinking and the ability to bring order to unstructured problems.\nUse a broad range of tools and techniques to extract insights from current industry or sector trends.\nReview your work and that of others for quality, accuracy and relevance.\nKnow how and when to use tools available for a given situation and can explain the reasons for this choice.\nSeek and embrace opportunities which give exposure to different situations, environments and perspectives.\nUse straightforward communication, in a structured way, when influencing and connecting with others.\nAble to read situations and modify behavior to build quality relationships.\nUphold the firm's code of ethics and business conduct.Preferred skills:Experience in implementing ERP applications (preferably ORACLE, SAP, Microsoft Dynamics, INFOR).\nBasic understanding of accounting, VAT and taxes.\nKnowledge and experiencein E-invoicing is a major advantage.\nProfessional certification such as PMP,PMI-ACP, PMI-BA or any ERP related will be a plus.\nGraduate of MIS/IT with a minimum of 4-9 years of related experience.\nFluent in English writing and speaking.Travel RequirementsAvailable for Work Visa Sponsorship?Government Clearance Required?Job Posting End DateJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}