{
    "Job ID": "69857632",
    "Description": "Experienced Flight Controls Verification Engineer - RBTCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest (Per Boeing LinkedIn page) aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, Model-Based Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.  With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.At Boeing, we are all innovators on a mission to connect, protect, explore and inspire. From the seabed to outer space, you’ll learn and grow, contributing to work that shapes the world. Find your future with us.At the highest level, diversity and inclusion are part of Boeing's values.  Having diverse employees, business partners and community relationships is vital to creating advanced aerospace and defense products and services for our diverse customers around the world. The company's commitment to diversity means providing a work environment for all employees that is welcoming, respectful and engaging, with opportunities for personal and professional development.Boeing India Engineering is currently looking for Experienced Software Engineer to join their team in Bangalore, India. These positions will focus on supporting the AvionX (Flight Controls) and Embedded Software organization. A successful candidate will understand the importance of collaboration as these positions will focus on working directly with the Architect or Product Owner to implement technical solution helping to enable the business unit to meet their organizational goals.Position Responsibilities:Leading Scrum and accountable on milestone delivery.\nDevelop automated/manual Test scenarios to test High Level and Low-Level Software requirements\nEstimate test software development effort.\nDefining test strategy\nDevelop test cases and test procedure for High Level and Low-Level Software requirements\nDevelop Software integration test Scripts to verify the correct implementation of High-Level requirements\nEstablish traceability from SW Requirement and Test.\nPerform peer review on test cases, test procedure.\nSupport SRR (Systems Requirements Review), PDR (Preliminary Design Reviews), CDR (Critical Design Reviews), TRR (Test Readiness Review) and Formal Qualification.\nSupport project management by providing periodic status and required metrics data.\nBe a good team player in the agile team. Candidate should possess excellent communications skills to participate in Requirement/Design/Code/Test reviews, have a thorough understanding of version control and software quality attributes, such as testability, portability and maintainability, and enjoy a self-driven and collaborative development approach.\nBe dynamic and support management and leads to ensure successful product deliveries.\nIdentify, communicate and mitigate the Risk, issues and Opportunities on a timely manner. Employer will not sponsor applicants for employment visa status.Desired Skills:Bachelor's degree or higher.Basic Qualifications (Required Skills/Experience):Required Bachelor's degree or higher.\nExperience in Python & Embedded C.\nExperience in automated and functional testing of Flight Control Embedded Software.\nGood hands-on of DO-178C Verification and Validation processes\nHands-on working in Agile development model\nExperience in Software integration testing in integration Lab Environment.\nSystems Thinking - Ability to understand the big picture and the inter-relationships between components of systems and plans and anticipate future events.\nAnalytical Skills - Skill and ability to: collect, organize, synthesize, and analyze data; summarize findings; develop conclusions and recommendations from appropriate data sources.\nEducation/experience typically acquired through advanced education (e.g. Bachelor) and typically 9 to 13 years' related work experience or an equivalent combination of education and experience.Typical Education & Experience:Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 9 to 13 years' related work experience or an equivalent combination of education and experience.Relocation:RELOCATION BENEFITS IF INDICATED ARE LIMITED TO IN-COUNTRY MOVES AND ARE NOT AVAILABLE FOR OVERSEAS RELOCATION. THERE IS NO EXPATRIATE PACKAGE ASSOCIATED WITH THIS POSITION.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}