{"Job ID": "69858835", "Description": "Responsibilities:Defining the product vision and strategy: You will be responsible for defining the overall vision and strategy for the product, including identifying key customer needs and market opportunities.\n\nConducting market research and analysis: You will be responsible for conducting market research and analysis to identify trends and opportunities in the marketplace, as well as to assess the competition and potential customer demand.\n\nDeveloping product requirements: You will be responsible for developing detailed product requirements, including technical specifications, user interface design (coordinating with the UX team), and functionality.\n\nCoordinating with cross-functional teams: You will work closely with cross-functional teams such as engineering (Technical Lead), UX design (Design lead) and software project management to ensure that the product is developed and delivered on time.\n\nEnsuring product quality: You will be responsible for ensuring that the product meets the highest standards of quality and is free of defects.\n\nPrioritization: You will work closely with the team and create/prioritize the backlog.\n\nYou will manage the entire product lifecycle, including product development, launch, and post-launch support.\n\nYou will define key performance indicators (KPIs) for your product and track performance against goals by using data analytics.Requirements:Bachelor's or Master's degree in Engineering, Computer Science, or a related field.\n\n5+ years of experience in product management, preferably in the automotive industries.\n\nExcellent communication and interpersonal skills, with the ability to work effectively with cross-functional teams.\n\nStrong analytical and problem-solving skills, with the ability to prioritize competing demands and make data-driven decisions.\n\nExperience with Agile development methodologies.\n\nStrong leadership skills, with the ability to motivate and inspire teams to achieve business goals.\n\nEmbedded or Linux based software development experience is preferable.\n\nExperience in C++/Java programming is preferableJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}