{
    "Job ID": "69859278",
    "Description": "DescriptionJob Description & SummaryWhat to consider before applyingThis role requires the candidate to be based out of our United Arab Emirates office (Dubai or Abu Dhabi).Role ResponsibilitiesAs a Manager, you’ll work as part of a team of problem solvers with extensive Advisory and industry experience, helping our clients solve their complex business issues from strategy to execution. Responsibilities include but are not limited to:Performing robust business enterprise and equity valuations using the Income Approach, Market Approach and Net Assets Approach methods incorporating sector, deal, and/or investment considerations.\nInterpreting the results from the various valuation methods applied and concluding on an appropriate valuation estimate.\nPerforming purchase price allocations and intangible asset valuations in accordance with IFRS 3 and IFRS 13.\nProviding expert opinions of value including fairness opinions and valuation reviews of third party reports.\nDelivering high quality work products and presenting valuation findings both internally and to C-Suite level clients (where required).\nLeading, managing and motivating a team in carrying out valuation engagements.\nManaging overall project economics, billings, and collections.\nProviding support to junior team members in guiding and reviewing their work outputs.\nBuilding a network around your peer group internally within PwC and externally.\nWorking with colleagues across all lines of services to deliver valuations involving other project teams.\nAssisting with the development of proposals to win new projects.\nComplying with all risk and quality and administrative requirements.\nKeeping up to date with valuation technical/market developments and contributing to technical forums and other practice development initiatives.RequirementsYears of Experience: 6+ years of professional experience with a focus on Valuations for Deals and Financial Reporting.\nMinimum Degree Required: Undergraduate degree (bachelor’s degree) or equivalent as a minimum educational requirement\nCFA, qualified ACA or ACCA equivalent designations are preferred.\nLanguage Skills: Fluent in written and spoken English. Arabic is a plus\nTravel Requirements: Flexibility to travel. This means we may require you to work away from your base office location where overnight stays may be required. Where possible, we will take your preferences into account and strike a balance between meeting your career development/personal needs and those of the business and our clients.\nPrior exposure to and knowledge of external research databases (e.g., S&P Capital IQ) in quantifying assumptions for the use in valuation models and for general market research.\nExcellent Microsoft Excel skills (prior exposure to or experience in financial modeling).\nIntermediate to advanced skills in analytical tools are preferred.\nExceptional analytical and technical aptitude, possess both financial and commercial acumen and enjoy problem solving to understand the drivers of a business, analyze their data and use this to provide insight and advice to our clients.\nPassion for innovation, technology, and new tools, and applying and developing yourself to new areas (e.g., quickly getting up to speed with tools, analytical approaches and business challenges).\nThe ability to build collaborative working relationships at all levels, establishing credibility both internally and externally.Travel RequirementsAvailable for Work Visa Sponsorship?Government Clearance Required?Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}