{
    "Job ID": "69859431",
    "Description": "The Commis 1 & 2 will carry out all required operational tasks and duties in the kitchen under the guidance of the respective Senior Chefs, with the overall objective to prepare food in a timely manner as per quality and food safety standard.\nResponsibilities:Washes and peels ingredients in order for them to be used in the production of dishes.\nEnsure that all mise en place is prepared to the highest quality as per standards set by the superiors.\nEnsure the set up and replenishment of buffets.\nAssist superiors in the pickup of requisition and in organizing it in the corresponding storage.\nInform superior of ingredient quantities when the stock levels are low and ensures there are always enough for the day to day usage.\nStore ingredients in dedicated containers, making sure that they are best preserved and labelled according to standard.\nCleans and sanitizes the working surfaces, tools, utensils and working area before and after usage as per food safety standard.\nReport cleanliness and maintenance issues of the kitchens and stewarding area to and support daily checks done by his superiors.\nAdhere to strict personal hygiene standards at all times.\nEnsure to follow through the food safety safe and sound standard set by Mandarin Oriental Hotel and in accordance’s to the UAE’s Municipality rules and regulation.\nEnsure customer satisfaction in accordance to the MOHG Legendary Quality Experiences (LQEs), the MOHG Pillars and the respective service standards of MOQA.\nWork as part of the team and assist other colleagues if required.\nSupport other outlets and banquet if requested by superiors.\nAttend and participate in all required meetings and training as scheduled.\nPerform any other reasonable duties as required by the superiors.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}