{
    "Job ID": "69856928",
    "Description": "We are looking for a Principal Transport Planner to be based in our Riyadh office -We have an immediate requirement for a Principal Transport Planner in KSA who will lead Transport Planning & Mobility projects from tender to close-out, and lead a team of transport planners, traffic engineers and transport modelers. The role also requires working closely with the Master Planning, Urban Design and Highways teams.The role will report to the Transport Planning & Advisory Lead and work closely with the Transport Planning team in our Global Design Centre (GDC), drawing upon this talent pool to deliver projects and work packages as appropriateResponsibilitiesThe successful candidate would be expected to lead and support a range of transport planning studies both on their own and for other staff working within a team, reporting to a team leader and project managers. You will also be expected to manage and perform the following duties:Prepare designs, calculations, drawings, programmes for specific jobs\n\nCheck drawings, calculations or output from analytical programs\n\nDevelopment Program Lead responsible for the development of graduates and junior staff members\n\nProvide information for reports and participate in particular investigations as required\n\nEvaluate transport planning issues and problems, consulting with team leader as necessary\n\nExecute transport analysis using appropriate design aids (for example transport assignment software, appraisal tools, Microsoft Office packages) with particular attention to accuracy and reliability to data input and analysis\n\nManage a team of Transport Planners and Traffic Modellers\n\nEnsure tasks are carried out within agreed timescales and budgets\n\nAssist the Project Managers in tracking the delivery progress and financials on projects.\n\nLiaise with other disciplines and clients as required on technical aspects\n\nKeep up-to-date with current methods and the latest research in transport planningRequirements12+ years post-graduate experience in transport planning\n\nDegree in transport related subject, numeric subject or equivalent professional qualification\n\nTechnical background in transport planning & policy, transport modelling & appraisal, demand modelling & analysis would be of benefit\n\nProven track record in the delivery of traffic planning analysis/studies to a high standard\n\nExperience of major Master Planning projects as well as a Traffic Impact Studies\n\nExcellent report writing and presentational skills\n\nProficient IT skills (Microsoft Office) and working knowledge of industry standard tools and modelling software such as VISUM, VISSIM, SIDRA, SYNCHRO, HCM\n\nArabic speaker desirable but not essential\n\nExperience in EMME software is desirable but not essential\n\nPrevious experience in the region, especially on any Saudi mega projects, is highly desirableThe Individual (Key Behaviours):Confident and articulate communicator with experience of building strong working relationships.\n\nA high expectation of performance and continuous improvement for themselves and team.\n\nAbility to position Atkins as a leading partner and supplier.\n\nCustomer focused with excellent interpersonal, organisational and communication skills.\n\nMentoring less experienced members of the team.\n\nConfident and professional manner and communication style, and the ability to communicate effectively with colleagues, clients and stakeholders\n\nExcellent interpersonal, organisational and communication skills both verbally and in writing\n\nAbility to build and motivate a team and demonstrate good leadership qualities.\n\nBe available to travel across the Middle East & Africa Region and work away from home, including periods overseas on assignments\n\nStrong collaborative behaviours to interface with clients, other members of the Transportation team, internal Atkins teams, GDC and other suppliers.\n\nExcellent team player, able to influence technical and delivery staff, and collaborate effectively with other divisional colleagues and with the Senior Leadership TeamRewards & BenefitsWe offer an excellent package which includes:\n\nA competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50-year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, and Riyadh.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}