{
    "Job ID": "69858094",
    "Description": "You will be part of a new team building a large scale tier-1 rendering platform that supports as the skeleton for all the payment pages to depend, host and render on, in Amazon Pay. You and a team of developers will work through all phases of the project life-cycle, including reviewing requirements, designing services that lay foundation for the new technology platform, building from the basic blocks of the new UX components and their interfaces, developing and testing code, and delivering seamless implementations for our customers. You will help define, design, prototype, and build these experiences. To achieve this, you will collaborate closely with product managers, UX designers, Software developers and multiple client teams.\nKey responsibilities:\nWork closely with senior engineers to architect and develop the best technical design. Development in multiple layers of the stack including the design system, UX components adhering to the design, reusable widgets that build on these components, page rendering toolkits and web server hosting solutions. Operational rigor for a rapidly growing tech stack. Assist in the continual hiring and development of technical talent.\nKey job responsibilities\nWork closely with senior engineers to architect and develop the best technical design. Development in multiple layers of the stack including the design system, UX components adhering to the design, reusable widgets that build on these components, page rendering toolkits and web server hosting solutions. Operational rigor for a rapidly growing tech stack. Assist in the continual hiring and development of technical talent.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}