{
    "Job ID": "69857061",
    "Description": "Charterhouse is currently managing a search for a Private Investment firm whom are in the process of looking to recruit a Financial Accountant into their holding operation.\nAbout the role\nThis role shall be heavily geared towards the oversight across the management of financial statements and transactional accounting whilst providing insight to management reporting, work-in-progress, revenue allocation and cash flow controls. In conjunction, this Statutory Accountant shall also be focused towards an annual audit exercise, whilst also being tasked with developing any processes and controls within the overall financial control function.\nThe Accountant shall also take ownership of all Tax accounting and compliance; to ensure both accurate filing returns whilst also providing in-house guidance and expertise across accounting standards and principles with the IFRS and GAAP frameworks.\nAbout you\nOur client will be looking to pinpoint a part-qualified accountant or MBA candidate who is able to deliver a strong level of technical proficiency, linking to statutory and any regulatory accounting, whilst also being well-versed across the development of controls and financial reports.\nApplicants shall come from service-line businesses, whereby the candidate is exposed to project-based and/or fee-based consultancy practices, linking also to areas of work-in-progress accounting along with revenue recognition policy. This role shall demand a candidate whom is able to manage international operations and as such, requires strong communication and delegation skills, across a regional-based finance team whilst also supporting senior reporting lines at a group level.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}