{"Job ID": "69857386", "Description": "Escalation ManagerThis role has been designated as ‘Office’, which means you will primarily work from an HPE office.Who We Are:Hewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Job Description:Who We Are:\nHewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Aruba is an HPE Company, and a leading provider of next-generation network access solutions for the mobile enterprise. Helping some the largest companies in the world modernize their networks to meet the demands of a digital future, Aruba is redefining the “Intelligent Edge” – and creating new customer experiences across intelligent spaces and digital workspaces.What you’ll do:Escalation Management deals with Incident/Problem management systems for Enterprise customers in IT infrastructure. It is managed by a set of people who carries out the entire documented process for Escalation Management. This requires one to associate their work with Technical Assistance Centre (TAC) which works together with Escalation Resources & Accounts/Sales Team.The escalation management team deals with structuring and bringing the management's attention to a major incident or a problem, which has escalated beyond its limits.They work in a team and their main responsibility is to provide assistance to the TAC Engineer by prioritizing and reassigning resources during Critical Business Impacting Incidents.They analyze the current scenario of a customer, locate, and highlight certain issues which require immediate response and allow the organization to track that critical problem, monitor it appropriately, and manage the escalating situation.The key responsibilitiesIdentifying, analyzing, and initiating the escalation process for TAC based on the escalation request.\nDefine and execute tactical and strategic plans toward de-escalating the situation involving appropriate stakeholders\nWork with Customer, TAC, Sales/Accounts Team, and Engineering / Product Management teams to understand reported escalation and jointly develop a solution that is agreeable to the customer.\nServe as leaders and point of contact for escalated contact resolution for complex problems\nCoordinating with the customers for developing an escalation management plan as per their requirements, adding additional resources for the escalation process if required, and developing a detailed technical plan accordingly.\nUpdating and maintaining escalation process records at each stage, updating the same in management data, and reviewing and adjusting the escalation process accordingly\nPeriodic updates to the Stakeholders about the escalation, reviewing the root cause of escalation, and maintaining compliance as per the defined SLA based on the Support Contract\nAssuring the team's availability 24x7 with proper handover before closing the escalation successfully, and ensuring customer satisfaction.\nOwnership of assigned Time zone to ensure Escalations are kept under check.\nTAC Case/Backlog Management to ensure timely case progress/resolution ensuring customer satisfaction.The main responsibility of a Duty/Escalation Manager is to bring order, structure, and focused management attention to the customer's problems in order to gain complete consumer satisfaction. The need for creating an escalation process is triggered by the organization when the customer complains about the urgency of resolution or when the organization perceives the loss of consumer base due to an emergency situation.What you need to bring:The educational qualification requirement is not the basic criteria for obtaining a post in escalation management, though one has to be a minimum graduate in any relevant field for applying for this post.Escalation management is based on task accomplishment in a critical business-impacting situation, hence one has to show competitive skills for carrying out the task effectively within the scheduled time. Consumer Satisfaction is the key element of an escalation management program, hence one has to carry out all the tasks assigned effectively.Analyse and Evaluate the IncidentProblem/Incident Solving Ability\nEffective Communication Skills\nEnd to End Customer Co-Ordination & Ownership\nMeeting service level agreements\nCollaboration across key Stakeholders/Product Groups/Teams.\nData Analytical Skills\nPresentation & Reporting Skills (MS Excel & PowerPoint Etc)\nTechnical Skills – Networking Concepts, Wired & Wireless (Added Advantage)Apart from this, one also has to demonstrate certain skills which are gained through experiences.Capable of handling Enterprise Customer Escalation/Account Management.\nHas a proven track record in escalation management with defined operational procedures for increasing the efficiency of task accomplishment.\nWillingness to work across Time zones/Shifts based on business requirements.What we can offer you:A competitive salary and extensive social benefits Diverse and dynamic work environment Work-life balance and support for career development  An amazing life inside the element!Want to know more about how you can make your mark with us? Then let’s stay connected!https://www.facebook.com/HPECareershttps://www.instagram.com/HPECareers/https://twitter.com/HPE_Careers#India #arubaHPE is an Equal Employment Opportunity/Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together.Additional Skills:What We Can Offer You:Health & WellbeingWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.Personal & Professional DevelopmentWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have — whether you want to become a knowledge expert in your field or apply your skills to another division.Diversity, Inclusion & BelongingWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good.Let's Stay Connected:Follow @HPECareers on Instagram to see the latest on people, culture and tech at HPE.Job:Job Level:HPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together. Please click here: Equal Employment Opportunity.Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.HPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories. .Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}