{"Job ID": "69856802", "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.\nAs one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.\nWe provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.\nAcquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Job Description\nAs a provider of multi-disciplined technical services to the built environment, Atkins is committed to design excellence in the delivery of first class solutions which combine, innovation imagination and best practice. \nWe require a Land Surveyor to work independently and as part of team to provide plan and elevation data in all forms of Land Survey Management. Requirements\n \n•    Surveying degree or HND with a minimum of 5 years relevant experience \n•    Basic surveying maths ability \n•    Can process topographic survey to CAD stage \n•    Able to use basic AutoCAD to edit surveys \n•    Knowledge of principles of GPS processing \n•    Knowledge of Road Maintenance Construction essential \n•    General knowledge of all aspects of land survey measurement \n•    Computer literate - competent in Microsoft package \n•    Able to prepare written reports for projects \n•    Valid KSA driving licence \n•    Should be committed to working towards membership of a professional body such as ICES or RICSResponsibilities\n•    Surveying work for topographic, utilities, toads, buildings, railways, tunnels, rivers & coastals \n•    Responsible for all survey work carried out on a day to day basis and ensuring that results are accurate and adhere to QA procedure \n•    Conducting proof surveys  \n•    Field completion/verification \n•    Tunnels/underground \n•    Computer processing of data to CAD stage \n•    Reporting \n•    Adherence to QA procedures Rewards & Benefits\n•    A competitive salary \n•    Accommodation allowance; \n•    Transportation allowance; \n•    22 calendar days annual leave (based on 5 day working week) \n•    Medical and life insurance cover; \n•    Company gratuity scheme; \n•    Discretionary bonus scheme; \n•    Annual flight allowance to point of origin \n•    Employee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultant\nTraining\nAtkins develops individuals through a portfolio of training and development courses designed to help you make the best of your abilities and talentsEqual Opportunities Statement\nSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.\nOur aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.\nWe pursue this commitment by:\nHaving clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;\nComplying with the relevant employment legislation and codes of practice;\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;\nEnsuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}