{"Job ID": "69857068", "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"Discussing sales contract details with the banquet sales director and the head chef.\nPlanning the venue layout according to the number of guests and the type of event.\nDetermining the number of table waiters and servers required.\nSupervising the placement of tables, chairs, cutlery, plates, glasses, table linens, centerpieces, heating lamps, serving utensils, and carving stations.\nConsulting with the Head Chef regarding the timing of meal courses to be served.\nOverseeing the seating of guests, the serving of meals and beverages, and the clearing of tables.\nManaging the availability of liquor and soft drinks, when required.\nPreparing work schedules and completing documentation in a timely manner.\nAnswering customers' questions and accommodating special requestsYour experience and skills include:\nAbility to work well under pressure in a fast paced environment\nAbility to work cohesively and collectively as part of a team\nAdd diplomas/certifications required if neededYour team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Oman", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}