{"Job ID": "69857764", "Description": "The Cyber Security 3rd partyRisk Analyst is a position, responsible to carry out cyber assessments and analysis of the information security risk environment of external suppliers.Working with key stakeholders such as Procurement, Security Architecture and Technology Change teams to ensure adequate controls are adhered to when onboarding new vendors.\nWorking with the 1LOD and 2LOD teams to develop and maintain risk profiles for key LSEG third partiesKey Responsibilities:Responsible for conducting timely security assessments of third-party suppliers, recording results accurately and initiating appropriate assurance responses\nSupport the production of high quality, informative and accurate reports in respect of third-party assurance assessments\nProvide advice and guidance to stakeholders on Information/Cyber Security Minimum Requirements.\nParticipate in and contribute to collection of KRI’s, MI reporting on 3rd party cyber risks and assessments  \nAssist in the improvement of risk management and Cyber Security controls\nEnsure all activity is compliant with NIST, GDPR and other Financial Services relevant legislation including CPMI IOSCO.\nSupport the Third-Party Senior Manager with all third-party vendor risk assessment activities and reporting tasksTechnical/job knowledge:Understanding and working knowledge of control frameworks based on industry best practices such as NIST, COBIT, and ISO27001.\nUnderstanding of key regulatory requirements for technology and cyber security in the main LSEG operating centres\nCyber security qualification e.g. CISSP / CISM (desirable)\nDegree or Masters qualification in Cyber, Information Security or IT management (desirable)\nIT and cybersecurity policies and standards\nOperational risk frameworks\nThird Party Risk Frameworks\nRegulatory compliance\nTechnology resiliency\nData protectionExperience:Experienced professional with 3-5 years or more experience in Cyber Security Third Party Risk Management or Governance and Control Assessment, Risk and/orAt LSEG, we believe that creating a diverse and inclusive organisation is fundamental to the way we deliver on our promise of creating essential partnerships and open opportunities. Our open culture is central to how we deliver our purpose – driving financial stability, empowering economies and enabling customers to create sustainable growth – in everything we do.Working with us means that you will be part of a dynamic organisation of 25,000 people across 70 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.LSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.We are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.Please take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.If you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}