{
    "Job ID": "69857455",
    "Description": "Role Purpose: control retail quality standards through different directions, (measure retail knowledge level., audit stores inventory ,cash control through stores visits & archiving control through stores visits also main reference to all stores through separate queue to support retail team during their working hours in any needed info, inquiry , problem solving & system errors).Job Responsibilities:    Ensure monitoring & observing retail process through retail stores feedback\n    Find a solutions for improve channel sales performance through enhance retail process \n    Minimize risk and maximize benefits  \n    Recommend actions based on competitive intelligence visits to overcome the gaps\n    Manage and develop team’s performance.\n    Provide support, guidance and solutions to the team.\n    Handle retail communication mailbox daily (mails received from stores or stakeholders).\n    Sending daily mail with all the updated processes & info to all retail team.\n    Deliver the communication mails in attractive way.\n    Ensure accurate information delivered to the staff.\n    Introducing new effective tools for communication\n    Own the interactive screen in terms of updating the info on it.\n    Handle Think For Retail mailbox  & check the new ideas from team channel \n    Check do ability with  stakeholders.\n    Work on the idea if applicable.\n    Recognize the idea owner.\n    Handle internal  transfers between stores either with pool cars or courier\n    Handle factsheets design & update\n    SPOC with marcom team to ensure applying the POS materials within all the channel\n    Creating Activities and Ideas to Engage Retailers \n Skills Required:    Excellent written and excellent verbal English & communication skills.\n    Organized , owning the case attitude ( follow up ).\n    Excellent computer skills.\n    Problem solving skills\n    Excellent leadership and Negotiation Skills\n    Time management.\n    Full awareness about retail structure and related functions.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}