{"Job ID": "69858556", "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of 50,000 pioneers around the globe. The teams in our corporate functions enable the best in our dynamic businesses and in our people to maximize our company’s potential. With our leading brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Maintains SAP maintenance for Cost Center Accounting, COPA accruals and budget data upload\nResponsilbe for product costing reporting, analysis and closing activities\nControlling monthly, quarterly & year end closing activities with the cooperation of CO teams in MEA countries\nPrepares standardized financial reports for different Henkel business units focusing on income statement & balance sheet items\nSupport in big project across the region and come up with continuous improvement initiativesBachelor's degree in Business Administration, Finance, or Accounting \n1 to 2 years of relevant work experience \nExcellent command of English both in speaking & writing\nProficient user of MS Office applications (Word, Excel, and PowerPoint) \nStrong analytical and communication skills\nSAP experience is a plus Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, and mindsets.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}