{
    "Job ID": "69856783",
    "Description": "Job Title: Principal Consultant - ICT & Audio VisualLocation: [Dubai, UAE]About Us:Engineering a better future for our planet and its people.We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects. With offices around the world, we connect people, technology and data to shape the future of our industry and the world around us and because we cover everything from blueprint to delivery, across the entire lifespan of a project, you can count on us for a client experience that is smoother, smarter and more efficient. At Atkins, we’re not just embracing change – we’re driving it.Atkins ME is currently looking for a Principal Consultant - ICT & Audio Visual to join and lead their design team in Dubai, UAE or Riyadh, KSA. This role will play a pivotal role in leading our technical team and providing strategic guidance to clients in achieving their technology infrastructure objectives. You will oversee the design, engineering, and implementation of ICT and Audio Visual solutions, ensuring they align with industry best practices and client requirements.Key Responsibilities:Leadership and Team Management:Lead a team of design and engineering professionals, providing mentorship and guidance.\nFoster a collaborative and innovative work environment, encouraging creative problem-solving.\nEnsure project teams meet deadlines and deliver high-quality results.Design and Engineering:Develop and review ICT and Audio Visual system designs, including network infrastructure, audio-visual systems, and data centers.\nStay updated with industry trends and emerging technologies to provide cutting-edge solutions.\nCollaborate with architects, engineers, and other stakeholders to integrate technology seamlessly into building designs.Client Engagement:Act as the primary point of contact for clients, understanding their technology needs and objectives.\nProvide expert advice and recommendations, presenting solutions in a clear and understandable manner.\nManage client relationships, ensuring satisfaction and project success.Project Management:Monitor project progress and address any issues that may arise during the design and implementation phases.\nConduct risk assessments and develop mitigation strategies.Quality Assurance:Implement quality control processes to ensure the highest standard of work.\nReview project documentation and ensure compliance with industry standards and regulations.Documentation and Reporting:Create comprehensive project reports, including design specifications, engineering plans, and progress updates.\nMaintain accurate project records and documentation for future reference.Qualifications:Bachelor's degree in Electrical Engineering, Information Technology, or a related field. Master's degree preferred.\nProfessional certifications in relevant areas, such as RCDD (Registered Communications Distribution Designer) or equivalent.\nCurrent member of the Building Industry Consulting Services International (BICSI)\nMinimum of 15 years of experience in ICT and Audio Visual design and engineering.\nProven track record of successfully leading teams and managing complex projects.\nStrong knowledge of industry standards and regulations.\nExcellent communication, presentation, and client relationship management skills.\nProficiency in design and engineering software and tools.Rewards & Benefits:We offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented\nComplying with the relevant employment legislation and codes of practice\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect\nEnsuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}