{"Job ID": "69856759", "Description": "Atkins are looking for Senior Consultant - Asset Management to support our Middle East team.Role:Assist in the delivery of asset management activities on projects\n\nAssist in enhancing the Asset Management service offerings to add value to client’s’ Operations & Maintenance organisation\n\nSupport in development of Asset Management Plans\n\nPlan and support asset surveys activates, supervise team of electrical, mechanical and civils technicians in asset condition surveys and data collection.\n\nUndertake PMO responsivities on projects, developing progress reports, risk and issues registers.\n\nSupport in the development of pipeline of Asset Management opportunities\n\nPerform qualitative and quantitative analyses and present data findings/outcomesTechnical CompetenciesShall be qualified with a degree (preferably Engineering)\n\nMinimum five (5) years of relevant experience (post qualification) in Asset Management (AM) Advisory/ Consultancy\n\nIAM certification highly preferred\n\nThe Candidate must possess excellent working knowledge of project management best practices. Computer literacy and excellent communication skills in English are essential. (Arabic highly preferred)\n\nAsset Lifecycle Delivery assessment\n\nFamiliarity with international Asset Management Standards (ISO55000/1)\n\nAM Data Collection & definition of AM Hierarchies & Classifications\n\nAM performance measures development\n\nFamiliarisation with various maintenance strategies, condition based, predictive, reactive\n\nExperience in facilitating training session (preferred)Behavioural CompetenciesDemonstrate drive, enthusiasm and commitment to projects\n\nExcellent planning and organisation skills\n\nAble to assess problems and rapidly develop solutions  \n\nExcellent communication skills – written and spoken English essential and an Arabic Speaker is an added advantaRewards & Benefits:We offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\nAnnual leave\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}