{
    "Job ID": "69856929",
    "Description": "Faithful+Gould is a hands-on project delivery organisation that has moulded its business to respond to the demands of the nations in which it operates.  In doing so, we actively seek to employ staff who possess strong pro-active management skills which enables them to understand the entire delivery process from site acquisition through to feasibility, design, construction, sales and occupancy phases.  Our end-to-end project delivery solution is focused on best maximising project outcomes while minimising project risk for our Clients.We are currently looking for Equestrian Design Manager in Al Ula KSA, with a demonstrated experience in the operational management of similar projects.An Equestrian Design Manager is a professional responsible for overseeing and managing the design and development of equestrian facilities, such as horse barns, arenas, training facilities, and other related structures. This role combines elements of project management, architecture, and equestrian expertise to create functional and aesthetically pleasing spaces for horses, riders, and trainers.Job Responsibilities:1. Project Management:   - Coordinate and manage all aspects of equestrian facility design projects, from concept to completion.   - Develop project plans, timelines, and budgets, and ensure projects are completed within specified parameters.   - Collaborate with architects, engineers, contractors, and other professionals to ensure the successful execution of design projects.2. Design Development:   - Work closely with clients to understand their requirements, preferences, and functional needs for equestrian facilities.   - Create design concepts and plans that align with the client's vision and objectives.   - Incorporate industry best practices, safety standards, and regulations into the design process.3. Site Analysis and Planning:   - Conduct site assessments to determine the feasibility of equestrian facility construction and identify potential challenges.   - Develop site plans that optimize layout, functionality, and accessibility for horses, riders, and staff.4. Horse Welfare and Well-being:   - Incorporate equine-friendly design elements that prioritize the safety, comfort, and well-being of horses.   - Consider factors such as ventilation, lighting, stall design, turnout areas, and other elements that contribute to horse health.5. Budgeting and Cost Control:   - Prepare cost estimates for design projects, considering materials, labor, and other associated expenses.   - Monitor project budgets and expenses to ensure adherence to financial constraints.6. Communication and Collaboration:   - Maintain regular communication with clients, contractors, and project stakeholders to provide updates on project progress.   - Collaborate with multidisciplinary teams to integrate various design components seamlessly.7. Regulatory Compliance:   - Stay updated on local building codes, zoning regulations, and other legal requirements that pertain to equestrian facility construction.   - Ensure that all designs and structures meet or exceed relevant safety and environmental standards.8. Sustainability and Environmental Considerations:   - Integrate sustainable design practices to minimize the environmental impact of equestrian facilities.   - Explore eco-friendly materials, energy-efficient systems, and water management strategies.9. Aesthetics and User Experience:   - Create visually appealing designs that enhance the overall aesthetics of the facility while also considering the user experience for riders, trainers, and visitors.10. Continuous Learning:   - Stay informed about advancements in equestrian facility design, construction techniques, and industry trends.Overall, an Equestrian Design Manager plays a pivotal role in bringing together the equestrian and architectural worlds to create functional, safe, and beautiful spaces that cater to the needs of both horses and humans.Job Requirements:1.  Education and Experience:   - A bachelor's degree in architecture, landscape architecture, civil engineering, or a related field is often required. A degree with a focus on equestrian design or equine studies could be advantageous.   - 10+ years of experience in architecture, design, or project management, preferably with a specialization in equestrian facilities.2.  Equestrian Knowledge:   - Strong understanding of equestrian needs, horse behavior, and facility requirements is essential to create functional and horse-friendly designs.   - Experience in the equestrian industry, such as horse care, riding, or training, can be a significant advantage.3.  Design Skills:   - Proficiency in architectural design software, such as AutoCAD, SketchUp, or similar tools, to create detailed plans and drawings.   - Ability to translate client requirements into creative and feasible design concepts.4.  Project Management:   - Proven project management skills, including the ability to develop project plans, manage budgets, and oversee timelines.   - Experience in coordinating multiple stakeholders, including architects, engineers, contractors, and clients.5.  Communication Skills:   - Excellent communication skills, both verbal and written, to interact with clients, project teams, and contractors effectively.   - The ability to convey complex design concepts in a clear and understandable manner.6.  Attention to Detail:   - Strong attention to detail to ensure that designs meet safety standards, regulatory requirements, and the specific needs of equestrian facilities.7.  Regulatory Knowledge:   - Familiarity with local building codes, zoning regulations, and other legal requirements related to construction and equestrian facilities.8.  Problem-Solving Skills:   - Capacity to identify potential design challenges and develop creative solutions to address them.9.  Team Collaboration:   - Ability to collaborate effectively with multidisciplinary teams, including architects, engineers, and contractors, to bring designs to fruition.10.  Technical Knowledge:    - Understanding of construction materials, structural systems, and building technologies relevant to equestrian facilities.11.  Leadership Skills:    - If managing a team, the ability to lead and motivate team members to achieve project goals.12.  Business Acumen:    - Understanding of budgeting, cost estimation, and financial aspects related to design projects.13.  Creativity:    - Capacity to think creatively and innovatively to design facilities that are not only functional but also aesthetically pleasing.14.  Flexibility:    - Willingness to adapt to changing project requirements and unexpected challenges.15.  Portfolio:    - A strong portfolio showcasing previous equestrian design projects and demonstrating a range of design skills and capabilities.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide.Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nTransportation at Al Ula\n\nMedical and life insurance cover\n\n22 working days annual leave\n\nAccommodation at Al Ula\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}