{
    "Job ID": "69856917",
    "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering, and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50-year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation, and other infrastructure programmes.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the regionRequirementsFull time degree qualified in Mechanical Engineering or similar from a reputed university.\n\nA minimum of 11 plus years’ in the capacity of for a Mechanical Engineer and 15 plus years’ in the capacity of for a Senior Mechanical Engineer site supervision experience of working in Mechanical Building Services Engineering involving HVAC, Controls, Plumbing, PHE, Fire.\n\nAwareness of variety of concept, scheme and construction design schemes in a number of different sectors.ResponsibilitiesResponsible for the review of mechanical design contents as assigned together with its follow-up for Authority and Client's approval.\n\nResponsibilities include mechanical drainage, water supply, gas, HVAC, fire protection and as well as other related mechanical utility systems.\n\nResponsible for the preparation and review of mechanical design calculations, drawings, specifications, and tender documents for the design projects.\n\nResponsible for the participation in the progress and coordination meetings of the design projects and the preparation of the meeting records.\n\nLiaison and coordination with all applicable Local Authority Departments to obtain approval on design projects.\n\nReview of works produced by the mechanical engineers and the necessary coordination with other Atkins discipline Engineers as applicable for the continuity of the design projects.The IndividualAbility to adapt to different cultures and working environments to build rapport with customers\n\nExperience of using written and spoken English within a business environmentRewards & BenefitsA competitive salary will be offered to the right candidate\n\nAccommodation allowance\n\nTransportation allowance\n\n26 working days annual leave.\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual return airfare to point of originEqual Opportunities StatementSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination. Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:- Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented.- Complying with the relevant employment legislation and codes of practice.- Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect.- Ensuring that the workplace is an environment free from discrimination, harassment, victimization and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement.- Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}