{"Job ID": "69857917", "Description": "Roles and Responsibilites:Demonstrating a strong acumen for risks & controls in areas like Finance, HR, Inventories, Vendor Management, Marketing, etc.\nDemonstrating a good understanding of Indian Accounting Standards, Labor laws & Companies Act requirements.\nPlanning & executing internal financial, operational and/or compliance audits in adherence to the Internal Audit Policies & Procedures.\nConducting internal controls testing and identifying issues/gaps with respect to control design or operations.\nTesting & reporting on the Internal Controls over Financial Reporting (ICoFR) in compliance with the Sarbanes-Oxley Act (SOX) as required.\nPerforming walkthroughs, testing & reporting of internal controls that are in scope for India Financial Compliance (IFC).\nIdentifying opportunities for use of Data Analytics & Automation to enhance Internal Audit’s ability to perform efficient testing/audit.\nDeveloping a strong understanding over Target’s risk management framework, internal policies & control procedures and ensure control objectives are met during the course of the engagement.\nManaging relationships with key internal & external stakeholders and ensure adherence to project timelines & deliverables.\nDemonstrating a high level of engagement at work by closely interacting with Internal Audit Team (external) , participating in meeting with higher management regarding Internal Audit engagements, IA quires etc.\nBeing independent, innovative & proactive in taking steps for your personal development by willingly taking on stretch assignments, cross-functional engagements & acquiring of new skills.\nIndependently conduct testing in a time bound manner with minimal rework.\nEvaluate internal control and make recommendations on how to improve.\nIT skills - Microsoft office, Knowledge of ERP Education- CAExperience- 1 to 5 YearsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}