{
    "Job ID": "69856762",
    "Description": "As an iconic Building Technology Director, your role would involve overseeing the integration of advanced technologies into the design, construction, and operation of landmark buildings. You'd be responsible for developing strategies to enhance sustainability, energy efficiency, and user experience through smart systems, innovative materials, and cutting-edge automation. Collaborating with architects, engineers, and technology experts, you'd lead the implementation of state-of-the-art solutions that define the building's identity and functionality, while ensuring seamless operation and maintenance. Your role would also encompass staying updated on emerging trends in architecture and technology to continually push the boundaries of iconic building design.Key ResponsibilitiesProject DeliveryAccountable for the end-to-end leadership, management and delivery of all aspects of this project. This includes project management, timeliness, quality, risk management, project financial performance and scope management of the projects, in line with the Atkins methodology.\n\nAccountable for successful close out of commercial fee and contractual negotiations with the Client and their representative.\n\nAccountable for the establishment of the project, including resourcing from Delivery Centres and Offices, project set up, work breakdown structure (WBS), program development, milestone establishment, scope changes and variations\n\nDemonstrate care about the well-being of themselves and others, through actively participating in and driving OHS activities.\n\nBuild and lead whole project delivery team, secure required resources.\n\nEnsure project delivery activity is in line with Company standards and client expectations\n\nEnsure effective closeout and debrief occurs with Client, Client Relationship Executive (CRE), People Manager and Project LeaderFinancial Management  Accountable for the P/L of the project\n\nHave an excellent understanding of Risk and the need to use their commercial acumen\n\nReview and submit monthly PSR\n\nReview Project budget at the start of the project.\n\nConduct Monthly Financial Review with the team and present to Senior Management         Client ManagementManage contract matters with Client\n\nEscalate issues in a timely manner to the PRB.Requirements:Master’s Degree in engineering or architecture from a reputed institution.\n\nProven experience in leading on large multi-disciplinary projects or running a programme of works, in design or construction environment.\n\nIconic or landmark project deliveries to be specifically highlighted in CV.\n\nExperience of leading a business and having responsibility for a P&L account.\n\nProven success in the delivery of large capital projects within scope, time and budget\n\nAbility to influence for results.\n\nExperience in the planning, managing and successfully delivering on projects involving numerous stakeholders.\n\nStrong leadership skills and proven ability to build, lead, organize, motivate and direct large multi-national organization.\n\nExcellent communication skills, both written and verbal, with the ability to interact with clients, team members, and senior management.\n\nStrong problem-solving and analytical skills.\n\nAbility to manage multiple projects and priorities simultaneously.\n\nProficiency in project management software and tools.\n\nThorough understand of local standards, Approving Authority processes.\n\nBe resilient with a “can do” attitude and able to work under pressure.\n\nBe collaborative and able to work across regional and business boundaries.\n\nBe an inspiration leader and set standards by example, to motivate the project team.\n\nBe focused on delivering to agree objectives and standards.\n\nAssert independent views and challenge when appropriate.\n\nWilling to challenge the status quo.Rewards & Benefits:We offer an excellent package which includes:\n\nA competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}