{"Job ID": "69859066", "Description": "Position PurposeThe purpose of this role is to coordinate patient applications in the Patient Access Program(s) in the region.The job holder is required to help represent Axios in daily meetings with patients, doctors and carry out administrative duties which will be both field and office-based.Duties and ResponsibilitiesLiaise with hospitals, distributors, pharmacies and patients. \nCo-payment reimburse solution administration. \nWork closely with the Program Manager to secure patient file approval.\nEnsure that patient file are complete and ready to be submitted in a timely manner and in accordance with the project processes, workflow and timeline.\nCarry out patient, Doctor, Pharmacy and private sector visits for project flow.\nEnsure that current patients receive their medications quickly and efficiently \nPrepare timely monitoring reports (monthly) with patient numbers and charities support as well as quality assurance. Reports (quarterly) for internal This includes monitoring and tracking patient files in collaboration with Axios staff in “real time” as patients proceed through the program.\nMaintain and update electronic Program files, including patient and quality assurance data.\nAttending and completing Adverse Event Reporting and product trainings provided by the client\nConduct administrative duties for the office.RelationshipsWork closely with Program Manager and Program Assistant in the region.\nReporting to the Program Manager in region\nWork with the related divisions of Axios\nMaintain ongoing and frequent communication with Axios staff including Axios global staff.CompetenciesApplication of job Knowledge\nConcern for Order and Quality  \nAdaptability and flexibility\nDependability\nTeamworkEducational Background and ExperienceA Degree or Diploma in Social Work or Public Health is ideal\n1 to 2 years of working experience in an administrative role is ideal\nGood command of both spoken and written English and Arabic\nExperience in data monitoring and management\nExperience in customer service managementJob CircumstancesThe position is based in our regional office, and it does entail frequent travel to Clients, partners and Pharmacies which may be outside your designated region.\nFlexibility inability to travel as well as working hours is essential.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kuwait", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}