{"Job ID": "69859457", "Description": "Get to know our clientOur client is a forward-looking maritime facility with a vision to become the ‘Shipyard of the Future’.The facility is set to be one of the largest maritime facilities in the world, with the capacity to build various types of vessels, including very large crude carriers, offshore drilling rigs, and commercial ships. It will help shape the Saudi maritime industry as one of the largest, most advanced and sustainable maritime facilities in the MENA region, with global ambitions and reach.Join to be part of an incredible growth opportunity and success story.Job DescriptionRead and interpret schematics, manuals, wiring diagrams, and other specifications, as required, to determine and correctly follow installation procedures.\nAs applicable, supervise performing preventive maintenance, troubleshooting, and repair all types of electrical equipment failures including but not limited to 13.8 KV breakers, 480 Volt breakers, transformers, substation breakers and controls, 480 Volt motor control centers, AC and DC motors, contactors, capacitors, transformers, process equipment and electronic control system devices.\nReview and approve all the plans to shut down electrical systems and/or equipment to allow for inspections, renovations, maintenance, repair, and troubleshooting.\nAs applicable, supervise and guide the diagnosis of faults, the maintenance, and repairs to all types of electrical assets in a safe, timely and professional manner and return assets to operational service.\nReview and approve the plans to switch and transfer electric loads.\nParticipate in electrical systems/equipment commissioning and provide observations.\nSupervise the ESOs and make sure that they perform their work safely, timely and cost-effectively.\nDevelop and/or review preventive maintenance checklists aiming to improve efficiency and quality.\nLiaise with projects’ stockholders, asset management team and other engineers to ensure full and timely support is provided.\nPrepare technical reports, project updates and status reports for team and senior management.\nUndertake special projects as required and contribute to continuous improvement activities.Job RequirementsBachelor’s degree in electrical (Power) Engineering or equivalent.\nMinimum of 9-15 years of hands-on experience of electrical networks and systems.\nKnowledge of electrical substations and their related assets such as transformers and switches.\nComprehensive Knowledge of maintenance programs and strategies and also, power system protection and schematic.\nUnderstanding of electrical engineering codes and safety standards.\nMust have a working knowledge of OSHA and/or NEBOSH standards and practices.\nExcellent Computer Skills in MS Office and IFS practical experience is a plus.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Ras Al Khaimah, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}