{
    "Job ID": "69856923",
    "Description": "We are looking for Principal Mechanical Design Engineer in Riyadh, KSA.As a provider of multi-disciplined technical services to the built environment, the Atkins office in Riyadh is committed to design excellence in the delivery of first-class solutions which combine, innovation, imagination and best practice.As one of the world’s leading consultancies operating in the built and natural environment, Atkins offers unparalleled opportunities for talented individuals in search of a rewarding career both in the Middle East and around the world.This is an ideal opportunity for individuals looking to develop their international experience by working with a multidiscipline team of Building Services Engineers providing a comprehensive design service.ResponsibilitiesLead a project teams with the capabilities, tools and processes to provide cost effective Building Services design\n\nTo undertake Mechanical design Services on projects from concept design through to construction issue\n\nRepresenting Atkins at meetings with Clients\n\nLiaise with Local Statutory Authorities\n\nTechnical Report writing\n\nEngage in Multi discipline coordination and workshops\n\nEnsure Quality Assurance/Quality control processes have been incorporated in the design\n\nTechnical responsibility for quality associated with design deliverables\n\nLead and support the continuous due diligence process and risk mitigation methodologies related to technical services to enable continuous improvement in overall technical operations.\n\nHave an excellent understanding of sustainability issues including passive design and low and zero carbon or other current technologies.\n\nHave a working knowledge and use of relevant design software packages, Microsoft Office suite of products. Also have a knowledge of BIM, Revit and associated design management tools.\n\nUndertake periodic project reviews to ensure technical and programme constraints are met\n\nManage own workload and workload of project team members\n\nPreparing and managing project budgetsRequirementsDegree qualified (as a minimum) in Mechanical discipline\n\nFully qualified professional and conversant with relevant market knowledge.\n\nRelevant and appropriate experience of more than 13 years as a Mechanical engineer\n\nMember of a Chartered institution (or equivalent) with associated relevant experience\n\nComplete familiarity with all steps of the design process from pre concept to tender/contract documentation\n\nMust demonstrate ability to act independently, while part of a team\n\nExperience in delivering projects in conjunction with remote design centres.\n\nProven experience working in a design consultancy in the capacity of designer and technical authority.\n\nExceptional skills and knowledge of working in a design consultancy with good knowledge of Local and International Codes and Regulations.\n\nWider knowledge of integrated design and collaboration with other disciplines highly desirable.\n\nFinancial awareness and the ability to control project finances.\n\nGood report writing skills, experience of making presentations to and attending meetings with clients is essential.\n\nExcellent team management and communication skills\n\nUnderstands the importance of accuracy and has high attention to detail\n\nCustomer focused, passionate about exceeding the requirements of internal and external stakeholders\n\nDemonstrate excellent planning and time management skills\n\nAdaptive influencing skills, demonstrating tact, diplomacy, persuasion and the courage to challenge.Rewards & BenefitsWe offer an excellent package which includesA competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}