{"Job ID": "69856892", "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the regionJob Title: Structural EngineerJob Description:As a Structural Engineer, you will be responsible for designing, analyzing, and ensuring the integrity and safety of various structures. You will work closely with architects, contractors, and other professionals to develop innovative structural designs and provide technical expertise throughout the project lifecycle. Your knowledge of structural engineering principles and your ability to apply them will be crucial in delivering high-quality and efficient solutions.Responsibilities:Design and Analysis: Develop structural designs for a wide range of projects, including buildings, bridges, industrial facilities, and infrastructure. Use computer-aided design (CAD) software and structural analysis tools to create models, perform calculations, and assess the structural integrity of the designs.Code Compliance: Ensure compliance with relevant building codes, regulations, and industry standards in all structural designs. Stay updated with the latest codes and incorporate them into design practices.Collaboration: Collaborate with architects, contractors, and other stakeholders to understand project requirements, constraints, and objectives. Work closely with interdisciplinary teams to integrate structural designs with architectural, mechanical, and electrical systems.Structural Analysis: Conduct structural analysis using software tools and manual calculations to determine the load capacities, stress distributions, and performance of structures under various conditions. Assess and mitigate potential risks and structural vulnerabilities.Technical Documentation: Prepare detailed technical reports, specifications, and drawings. Document design decisions, assumptions, and calculations. Review and approve drawings prepared by drafters and junior engineers.\nConstruction Support: Provide technical support during the construction phase of projects. Clarify design intent, respond to contractor queries, and review submittals to ensure compliance with design specifications.\nQuality Assurance: Perform quality checks on design deliverables to ensure accuracy, completeness, and adherence to project requirements. Participate in design reviews and constructability assessments.\nContinuous Learning: Stay updated with industry trends, emerging technologies, and advancements in structural engineering. Seek professional development opportunities to enhance skills and knowledge.Requirements:Bachelor's or Master's degree in Civil Engineering or a related field with a focus on structural engineering.\n\nProficiency in structural analysis software, such as SAP2000, ETABS, or similar tools.\n\nStrong understanding of structural engineering principles, codes, and standards.\n\nFamiliarity with CAD software for drafting and modeling (e.g., AutoCAD, Revit).\n\nEffective communication skills to collaborate with multidisciplinary teams and stakeholders.\n\nDetail-oriented with strong analytical and problem-solving abilities.\n\nAbility to work independently and as part of a team.\n\nExperience with structural design and analysis in projects of varying complexity (experience level may vary based on the specific position).\n\nKnowledge of construction processes and materials.\n\nProfessional Engineer (PE) licensure or the ability to obtain licensure is preferred.\n\n9+ years of experience.\n\nSupervision experience a must.\n\nGCC building supervision experience.Duties and ResponsibilitiesReviews and approves all contractor structural/civil technical submittals & sub-contractors\n\nLeads and guides inspection teams on site\n\nReplies to RFIs and coordination with other discipline and design teams\n\nFollow-up with site observations and non-compliances\n\nReviews and deals with design calculations, analysis models and BIM models\n\nWorks independently and as part of a team to complete specific supervision activities assigned.\n\nResponsible for providing approvals for the contractor’s structural technical submittals.\n\nCollaborates/communicates with other disciplines regarding coordination issues and day-to-day supervision activities\n\nSupports inspection team to resolve any site activity issues\n\nAdopts creative and innovative solutions to site problems/clashes and develops appropriate supportive technical documentation/research reports\n\nCoordinates with design team regarding specialist’s packages approvals by authorities\n\nInforming and discussing design change decisions with colleagues to ensure project requirements are met\n\nReviews contractor variation orders in regarding structural/civil activities\n\nEnsure that the structural design and construction adhere to safety regulations and guidelines.\n\nIdentify potential safety hazards and implement corrective measures to mitigate risks.Qualities and Skills requiredBuilding structural supervision experience\n\nExperience and knowledge with using international Codes and standards.\n\nExperience on structural supervision projects\n\nExcellent presentation and communication abilities\n\nExperience in using structure software such as AutoCAD,SAP ETABS, SAFE, STAAD, RAM .\n\nBasic knowledge of BIM and REVIT platform\n\nKnowledge of local authorities’ requirementsNote: The above job description provides a general overview of the typical duties and responsibilities of a Structural Engineer. Actual job duties may vary depending on the specific project requirements.Equal Opportunities StatementSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}