{"Job ID": "69857699", "Description": "Job Summary\nAnalyzes existing programs or formulates logic for new systems, devises logic procedures, prepares flowcharting, performs coding and tests/debugs programs. Develops conversion and system implementation plans. Prepares and obtains approval of system and programming documentation. Recommends changes in development, maintenance and system standards.\n\nJob Responsibilities 1\nPrincipal Accountabilities - Supports and improves the Backup operations, business continuity plans and disaster recovery tests. - Works closely with the broader, global IT team to deliver high quality, secure solutions and ensure internal customer happiness. - Evaluates issues for trends, identifies root-cause for system problems and plans and implements necessary corrective actions and changes. - Audits, Monitors and optimizes systems in order to achieve and maintain maximum performance and availability. - Manages and prioritizes competing project tasks simultaneously. - Actively supports security improvement initiatives. - Develops and provides recommendations to aid in hardware and system software selection, implementation planning and budgeting. - Translates highly complex technical information into concise business terms and optimally communicate across all levels of the business. - Executes and supports monthly and regular reporting and documentation procedures. - Researches and assesses new technology capabilities to support interpersonal growth, improve efficiency and increase maturity. - Upgrade, improve, tune systems, processes, and flows - Support escalations - Patching, maintenance, and troubleshooting of technology - Technology access administration - Research and continuous learning - Making recommendations and executing on technical vision for the organization\n\nJob Responsibilities 2\n\nAdditional Responsibilities 3\n\nJob Knowledge & Skills\n\nJob Experience\n\nCompetencies\nCollaboration\nAccountability\nResilience\nQuality\nLeadership\nApplication Server Platforms  L3\nApplication Sizing L3\nHardware Management L3\nAccount Access Management L3\nCreates Strategy - Developing\nDrives Performance - Developing\nDevelops Future Leaders - Developing\nSecurity and Monitoring L3\n\n\nEducationJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}