{"Job ID": "69856757", "Description": "We are currently looking for Saudi nationals Design Delivery Manager in Al Ula KSA.RoleIn this role, you are required to provide the interface and manage design information flow between all Consultants delivering the design for the project. Consultants will be both internal and external. You are required to act as the point of contact between all Consultants designing the project ensuring the desired project objectives are delivered.RequirementsMonitor the performance of all internal and external architectural and engineering work related to project, emphasizing on-time and on-budget performance and monitoring compliance with Design Guidelines and contract terms.\n\nMonitor the development of the overall design process from conceptual design through schematic and detailed/contract documents.\n\nPerform design reviews throughout the design process from conceptual design through schematic and detailed/contract documents.\n\nConduct ongoing constructability reviews to successfully meeting the schedules and program budgets.\n\nMonitor submittals by the design consultants to obtain approvals and permits necessary by all regulatory agencies and local authorities having jurisdiction.\n\nImplement Design to budget requirement in all appropriate RFP’s and contracts for design services. Monitor compliance with Design to Budget standards.\n\nPromptly inform in writing of any event or situation that the likely effect of which would be to vary the scope of the Program; and or change its quality, content or function.\n\nSchedule the submission of the design, in stages if appropriate, to Client and request his approval thereto. Advise Client in the event that the design indicates that compromises are necessary between particular objectives and requirements of Project. Schedule the Design activities in the Master Schedule to include reasonable periods Client approvals.\n\nMonitor the dissemination of design information among the Program Team in timely manner such that abortive work is avoided or minimized as much as practicable.\n\nMonitor the performance of the Design Consultant and other consultants in respect of the deliverables associated with the agreed Design Program and provide immediate advice to Client in the event their progress may affect the program overall completion date or milestone objectives together with recommended remedial action.\n\nMonitor statutory authority approval processes. Prepare a standard NOC (no objection certificates) register to be prepared and updated by all consultants and contractors.\n\nSchedule the Design to allow reasonable periods for Client approvals, any Municipality Permits, No objection Certificates, and other statutory approvals.CompetenceThis position requires professional ability and inherent motivation. You have the skills required to direct meetings, introduce discussion to encourage thinking on the wider commercial context and be responsible for the tasks assigned to members of your project team. You are willing and able to perform duties diligently to the quality standards set by the Company and conform to the Company’s policies and business systems and be committed to their implementation and continuous improvement at all times.AuthoritiesYou will operate within the constraints of the particular contract for which you have been appointed. You will have financial delegations for the Company in accordance with the financial authorities established by the Company, and as amended from time to time.Skills and AttributesYou are expected to:Manage the flow of design information between all parties in a design team in an efficient and controlled manner ensuring design coordination between the various elements\n\nCoordinate the deliveries of design packages from all parties to the Client\n\nApply quality management principles and processes\n\nApply risk assessment and management principles and processes\n\nNetwork effectively, negotiate well and influence people, broker relationships with stakeholders within and outside the project\n\nBe aware of the broader environmental, social and economic perspectives and how they may affect the project\n\nSupport and provide leadership to your project team.Minimum RequirementsThe minimum requirements for this position are:Bachelor's Degree in Architecture or Engineering\n\n12+ years full time paid professional experience managing the design coordination, the planning and scheduling activities of major projects - Sports / Hotels / Educational / Cultural etc.\n\nAbility to build consensus among multiple stakeholders\n\nActive leadership style\n\nExperience with LEED/Estidama\n\nMiddle East experience required.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide.Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings. Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards and Benefits:We offer an excellent package which includes:A competitive salary;\n\nAccommodation allowance;\n\nTransportation allowance;\n\nAnnual leave;\n\nMedical and life insurance cover;\n\nCompany gratuity scheme;\n\nDiscretionary bonus scheme;\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}