{"Job ID": "69857168", "Description": "Overview This role for Data Center Operations and Rationalization will contribute and support the data center rationalization program. The role will focus on pursing the overall reduction of on-premises data center footprint by partnering with key programs to eliminate workloads in the on-premises data centers and by dirving internal projects to consolidate and reduce data center footprint. Responsibilities Develop the right operational methodology, provisioning processes, and standards for data centre rationalization. Manage the identification and execution of device consolidation opportunities within the 5 global PepsiCo data centres. Work with Enterprise Architecture and application teams to identify candidates for optimization using the TIME model. Identify and onboard/mobilize DC Rationalization project teams by working with PepsiCo partners. When data centre exit is required, lead identification of alternate hosting solutions (cloud, app consolidation, SAAS, CoLo, DC Consolidation) for all workloads in that location. Lead identification of risks, actions, and issues through proactive communication and collaboration with stakeholders and various teams Define Success criteria and KPIs for DC Rationalization program. Qualifications 10 years of domain experience Proficiency contributing to multiple projects. Understanding of infrastructure and DC technologies, principles and methodologies is a must. Experience at scale with data centre rationalization. Proficiency with running programs and initiatives with remote teams in multiple locations Proficient in project scheduling and project lifecycle best practices Define program level resource plans and effectively on-boarding resources to the program. Cost modelling, program cost forecasting, & variance management Managing project interdependencies and assessing implications for program based on the consideration of other projects. Ability to develop new processes and approaches for DC rationalization. Support identification and requirements gathering for new tools and services to enable application discovery, capacity analysis, and migration. Excellent communication and strong interpersonal skills\" Ability to leverage partnership with Managed Service Providers to achieve business goals. Ability to navigate complex IT landscape and still deliver results. Ability to take ownership in orchestrating workshops with IT/Business teams and facilitate interactive sessions on dc rationalization.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}