{
    "Job ID": "69856819",
    "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering, and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50-year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation, and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Role SummaryThe project manager is responsible for the successful delivery of the overall project. They are responsible for leading and managing projects within the business. Their primary role is to ensure that projects are delivered on time, within budget, and meet client requirements.  The Project Manager works with the Atkins team and Client to establish project objectives, develop project plans, manage project budgets, and oversee project scheduling. They are responsible for managing the project team, ensuring that team members are completing tasks on time and communication is always maintained. Other roles also include managing project risk, developing contingency plans and ensuring that health and safety standards are followed in addition to adherence of Atkins’ project management methodology requirements. Role AccountabilitiesProject Delivery:Communicate scope, fee, deliverables, and programme with the team through Project Kick-Offs and regular updates. \n\nManagement of sub-consultants' agreements and payments (technical management through Design Management function) \n\nEnsure that the Project Execution Plan addresses design management requirements, including integration and interface management between Client requirements, sub-consultant design packages. \n\nSupport the PD in production of the Project Management suite of documents and standard forms. \n\nAssist in risk identification and management. \n\nAssist PD to identify and manage scope changes, scope extensions. \n\nIdentify resourcing issues and requirements and coordinate these with the Technical Team Leads. Escalate to PD when/if required. \n\nProvide timely external and internal monthly reporting by implementing a planned delivery schedule for routine reporting. \n\nEnsure Quality Systems processes are adhered to in the delivery of projects. \n\nUndertake debriefs with Client. \n\nAssisting in managing the work financially, technically, and contractually Financial ManagementMonitor Design Team progress and costs – Highlight where costs are not tracking as planned and coordinate with the Project Technical Leads to mitigate against potential over-runs / underspends. \n\nHave a good understanding of Risk and the need to use their commercial acumen. \n\nManage Risks proactively through use of the tools provided and regular team and Client engagement and update Contingency requirements regularly (min. once per design stage). \n\nPrepare Invoices for review and sign-off by the Project Director and keep financial registers up to date. \n\nDrive the change process and be responsible for compilation of variations. Client Management:Liaise and interact with the client for the technical delivery components of the project. Qualifications:UAE National\nBachelor’s degree in Engineering\nMinimum 5 years of experience\nCertified PMP is preferred.Rewards & BenefitsWe offer an excellent package which includes:Competitive salary\n\n22 days annual leave\n\n40 hours/week\n\nMedical insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nEmployee Assistance Program – 24-hour free advice on financial, legal, and family care specialists and also access to personal health, fitness and nutrition consultants.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}