{"Job ID": "69856782", "Description": "Job Title: Associate Director FLSLocation: Dubai, UAEAbout Us:Engineering a better future for our planet and its people.We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects. With offices around the world, we connect people, technology and data to shape the future of our industry and the world around us and because we cover everything from blueprint to delivery, across the entire lifespan of a project, you can count on us for a client experience that is smoother, smarter and more efficient. At Atkins, we’re not just embracing change – we’re driving it.Atkins ME is currently looking for an Associate Director for Fire & Life Safety. You will play a crucial role in leading and managing our team of experts, driving innovative design solutions, and ensuring the highest standards of safety and functionality in all our projects. You will work closely with clients, architects, and other stakeholders to deliver cutting-edge designs and provide technical leadership to the team.Key Responsibilities:Technical Leadership:Lead and mentor a team of engineers and designers in the Fire & Life Safety discipline within the Specialist Services team.Provide technical guidance, oversee project execution, and ensure adherence to industry standards and best practices.Project Management:Take ownership of multiple projects simultaneously, from conception to completion. Develop project scopes, budgets, and timelines, and ensure successful project delivery within these constraints.Client Engagement:Build and maintain strong client relationships, acting as a trusted advisor. Collaborate with clients to understand their needs, propose innovative solutions, and manage client expectations throughout the project lifecycle.Design Excellence:Drive design excellence and innovation within the FSL discipline. Ensure that designs meet regulatory requirements while integrating sustainability and energy efficiency principles.Risk Assessment:Conduct thorough risk assessments for projects, identifying potential hazards and developing mitigation strategies to ensure the safety of occupants and assets.Code Compliance:Stay updated on local, national, and international building codes and regulations related to FSL. Ensure that all projects adhere to these codes.Quality Control:Implement rigorous quality control processes to ensure the accuracy and completeness of design deliverables. Review and approve project documents to maintain consistency and quality.Collaboration:Collaborate effectively with cross-functional teams, including architects, structural engineers, and project managers, to ensure seamless project integration.Training and Development:Foster a culture of continuous learning and professional growth within the team. Identify training needs and provide opportunities for skill development.Qualifications:Bachelor’s degree in Fire Protection Engineering from a recognized University; Master's degree preferred.\n20+ years’ experience including mega projects\nThe ability to think laterally and possess a sound understanding of engineering principles. Ideal candidates will be able to demonstrate strong interpersonal skills and will be able to build and develop relationships, both internally and externally.\nExceptional leadership and project management skills. Previous experience of leading multi-disciplinary design teams and responsibilities for budgets and programming\nStrong knowledge of relevant building codes and regulations.\nExcellent communication and interpersonal skills.\nProficiency in industry-standard design software and tools.\nDemonstrated ability to innovate and drive design excellence.Rewards & Benefits:We offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n22 calendar days annual leave\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented\nComplying with the relevant employment legislation and codes of practice\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect\nEnsuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}