{"Job ID": "69856844", "Description": "Role ProfileWe are looking for a Principal Public Health Engineer with a minimum of 15 years experience of which min 10 should be within a Buildings MEP Design Team.The role will include:Taking a role within an MEP Design Team\n\ncoordination with other services and/or sub-consultants\n\nShowing communication skills within the design team.\n\nThe ability to learn quickly and interpret new ideas.\n\nAware of the commercial process required with the administration of Change Control system.\n\nPotentially assisting in representing Atkins to our Client and their representatives in technical meetings.Minimum RequirementsBuilding Services Engineering BSc. degree from an internationally recognized University.\n\nIn process of attaining Chartered Engineer with the relevant Institute\n\n7+ years’ experience as an Engineer in a multi-disciplinary Team\n\nA specific discipline strength and/or speciality would be advantageous.\n\nAn understanding of all MEP and building services design processes.\n\nThe ability to think laterally and possess a sound understanding of engineering principles with the ability to demonstrate strong interpersonal skills.\n\nThe ability to build and develop relationships, both internally and externally.\n\nExperience on design and build project would be advantageous.\n\nExperience of working with Contractors\n\nPrevious experience in a position within a multi-disciplinary design team\n\nCommercial awareness with an understanding of Change Control.\n\nComputer literate with all standard project design and development software including Microsoft, BIM etc.\n\nStrong communication skills will be required to interact with multiple internal and external Teams and project stakeholders.The IndividualDemonstrable track record of technical achievement within the MEP industry\n\nAbility to apply technical knowledge in analysing problems and creating solutions.\n\nAble to work and communicate effectively within multidisciplinary teams.\n\nFlexible approach to work\n\nAbility to work on your own initiative.\n\nStrong attention to detail and ability to make correct judgments.\n\nAbility to adapt to different cultures and working environments.\n\nAspiration to grow with responsibility.\n\nAbility to build rapport with customers and colleagues.\n\nWell-motivated and able to work as part of a team or on individual assignments when required.\n\nExcellent English spoken and written skills within a business environment.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}