{
    "Job ID": "69857734",
    "Description": "Careem is building the Everything App for the greater Middle East, making it easier than ever to move around, order food and groceries, manage payments, and more. Careem is led by a powerful purpose to simplify and improve the lives of people and build an awesome organisation that inspires. Since 2012, Careem has created earnings for over 2.5 million Captains, simplified the lives of over 50 million customers, and built a platform for the region’s best talent to thrive and for entrepreneurs to scale their businesses. Careem operates in over 70 cities across 10 countries, from Morocco to Pakistan.JOB PURPOSE\nAs a Lead Treasury Operations at Careem, your primary role is to ensure the efficient management of financial resources by assisting in monthly forecasting, fund allocation, and loan reconciliation at the console level. You will play a crucial role in maintaining accurate financial records, managing intercompany loans and interest, and coordinating repatriation efforts across local markets. Additionally, you will serve as a liaison between local markets and regulatory banks, ensuring compliance with local regulations. Your responsibilities extend to managing bank accounts, facilitating signatory updates, and aligning procurement and payroll teams on banking details. Your attention to detail and collaboration with cross-functional teams will contribute to the smooth operation of our treasury function, guarantee management, and financial reporting, ultimately supporting our financial stability and growth.KEY ACCOUNTABILITIES\n\nKey deliverables of this positions are:\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1. Forecast and Fund Management:Assist in preparing monthly forecasts (MDD) and arrange funds at Careem FZ LLC at the console level.\nProvide funds to the markets in alignment with approved budgets.\n2. Intercompany Loan Management:\nRecord and reconcile all Intercompany loans at Careem console level and with Uber.\nRecord and reconcile Intercompany Interest over the IC loan and Uber interest.\nPlan and execute IC Loan Repatriation from local markets.\nLiaison between local markets and respective regulatory banks for local regulation compliance on repatriation.\n3. Banking Operations:\nCompile and maintain all master bank account data at one platform, including registered signatories and commercial aspects.\nEnsure timely updating of signatories with all banks.\nOpen Citi bank accounts across all BU's and manage the closure of local bank accounts.\nImplement Uber signatory additions across the Careem accounts.\nImplement a Live balance view of 40+ bank accounts at Citibank portal.\n4. Cross-functional Collaboration:\nLiaison between local finance, treasury, and Uber teams to update signatories.\nCollaborate with Citi team on the required BU file format.\nAlign procurement and payroll teams on updating supplier and colleague banking details on Oracle.\nEnsure auto-generation of BU file in Oracle with the ERP team.\nEnsure the auto-generated BU File is transmitted to Citi bank without any manual intervention.\nLiaison between ERP, local finance, and Citi bank teams to ensure smooth H2H connectivity.\n5. Risk Management and Reporting:\nManage Bank Guarantees, including issuance, refunding, and overall management at the UAE level.\nProvide monthly Bank Guarantee schedule reporting to Uber.\nHandle console-level reporting for Post Dated Cheques.\nConduct Bank vs. GL comparison reporting to ensure accurate closing balances.\nClear GLs while considering audit points.\nGenerate User Access Reports of all users and authorizers for Uber across all bank accounts within Careem.\nOversee treasury-related Oracle transactions\nQUALIFICATIONS AND EXPERIENCE\nQualifications:\nMBA Finance/ ACCA or CA Qualified / CIMA Qualified\nExperience:\n4-5 Years of experience in finance&nbsp;&nbsp;What we’ll provide youWe offer colleagues the opportunity to drive impact in the region while they learn and grow. As a Careem colleague you will be able to:Work and learn from great minds by joining a community of inspiring colleagues.\nPut your passion to work in a purposeful organisation dedicated to creating impact in a region with a lot of untapped potential.\nExplore new opportunities to learn and grow every day.\nEnjoy the flexibility that comes with the trust of being an owner; work in a hybrid style with a mix of days at the office and at home, and remotely from any country in the world for 30 days a year with unlimited vacation days per year.\nAccess to healthcare benefits and fitness reimbursements for health activities including: gym, health club and training classes.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}