{
    "Job ID": "69858159",
    "Description": "To help us maintain our high standards of service, we are seeking an experienced and accomplished Logistics Supervisor, to drive both innovation and execution in our busy Transportation network.\nKey job responsibilities\nSupport the overall, daily management of operational duties. Will require deputizing for Operation Manager, and you’ll step in on their behalf where necessary.\nExpected to prioritize and continually improve the safety at the delivery station. You will be supervising logistics assistants, coordinators and delivery associates to ensure that every shipment is delivered meeting and exceeding the set operational KPIs.\nYou will be monitoring the coordinator and associate performance and coaching when needed, partnering with supporting departments to improve logistics processes and operations, communicating with delivery service providers to set expectations and raise the bar on quality on their deliverables.\nYou will be expected to interview candidates for associate roles.\nYou will be responsible for briefing and monitoring the workload of all drivers and associates. Therefore, you’ll maintain a keen eye for detail, ensuring that all administrative tasks are accurately and fully completed. Moreover, you will measure and monitor overall workflows and daily metrics. This will enable you to assist the Operations Manager with tracking, trending and reporting on site performance, on a regular basis.\nIn addition to your day-to-day responsibilities, you will also help with training and mentoring new Associates, ensuring that they are provided with the knowledge needed to successfully carry out their tasks. Further to this, you’ll follow-up on and resolve any process-related issues as and when required.\nYou are expected to be flexible to work in different shifts and to do overtime when needed.\nFinally, together with the Operations Manager, you will sufficiently resource your function from a personal standpoint. Resourcing, in this context, means multiple things: call-outs for training needs, absence and performance management, coaching and continuous monitoring of department productivity and many more.\nWe are open to hiring candidates to work out of one of the following locations:\nAbu Dhabi, ARE\n- Experience managing teams\n- Experience with planning, performance metrics, and process improvement\n- -Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Experience in logistics\n- Experience with data analysisJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}