{"Job ID": "69858221", "Description": "Job Number 23166759 Job Category Procurement, Purchasing, and Quality Assurance Location Marriott Marquis City Center Doha Hotel, Omar Al Mukhtar Street, Area 61, Al Dafna, Street #850, Doha, Qatar, Qatar VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Supports the General Manager and his team by completing administrative responsibilities. Duties include organizing, composing and distributing correspondence to both employees and guests, initial response and follow up to inquiries and collecting and tracking problem resolution information The position is also responsible for implementing quality assurance processes that meet the company’s mission and brand standards, target customer needs, ensure employee satisfaction, and focus on continuous improvement at the property level. This position champions the Quality function and builds support for change. CANDIDATE PROFILE Education and Experience • 2-year degree from an accredited university in Business Administration, Hotel and Restaurant Management, or related major 3 years experience in the guest services, front desk, housekeeping, sales and marketing, management operations, or related professional area. OR • 4-year bachelor's degree in Business Administration, Hotel and Restaurant Management, or related major; 1 year experience in the guest services, front desk, housekeeping, sales and marketing, management operations, or related professional area. CORE WORK ACTIVITIES Providing Documentation and Reporting Support · Assists managers in preparation of various reports and presentations. · Assists with the design and preparation of statistical reports as needed. · Attends, transcribes and distributes minutes, and participate in staff meetings, executive committee meeting and department meetings as needed. · Makes new files, maintains existing files. · Maintains giveaway/donation files and assists in making reservations. · Provides administrative support to manager/s and department. Managing Quality Assurance Goals • Coaches managers on adopting the Total Quality Management leadership style. • Conducts monthly audit to ensure compliance with company and brand standards • Makes and executes the necessary decisions to keep property moving forward toward achievement of goals. • Directs property quality efforts to address critical customer requirements. • Assists with regional and/or company-wide implementation of company best practices. • Facilitates process improvement teams, assuring use of the systematic processes, and improvement is achievable and measurable. Managing Quality Tools • Ensures that management practices at all levels are aligned with quality tools by providing training in quality sciences. • Uses data collection methods to compile, display, track, and analyze defect trends. • Demonstrates and communicates key drivers of guest satisfaction for the brand’s target customer. • Analyzes issues and identifies trends. Managing the Guest Experience • Reviews guest feedback with leadership team and ensures appropriate corrective action is taken. • Responds to and handles guest problems and complaints. • Stays visible and interfaces with customers on a regular basis to obtain feedback on quality of product, service levels and overall satisfaction. • Models service behaviors that meet or exceed guest expectations. Additional Responsibilities · Ensures VIP amenity requests from GM/DOPS are handled in timely manner. · Signs for managers and release, with specific permission. · Communicates the importance of safety procedures, detailing procedure codes, ensuring employee understanding of safety codes, monitoring processes and procedures related to safety. · Analyzes information and evaluating results to choose the best solution and solve problems. · Attends meetings to plan, organize, prioritize, coordinate and manage activities. · Works with other people to gather the information necessary to manage projects, achieve goals, and resolve problems. · Informs and/or updates the executives and peers on relevant information in a timely manner Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Doha, Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}