{"Job ID": "69858272", "Description": "Alexa Shopping Operations strives to become the most reliable source for dataset generation and annotations. We work in collaboration with Shopping feature teams to enhance customer experience (CX) quality across shopping features, devices, and locales. Our primary focus lies in handling annotations for training, measuring, and improving Artificial Intelligence (AI) and Large Language Models (LLMs), enabling Amazon to deliver a superior shopping experience to customers worldwide. Our mission is to empower Amazon's LLMs through Reinforcement Learning from Human Feedback (RLHF) across various categories at high speed. We aspire to provide an end-to-end data solution for the LLM lifecycle, leveraging cutting-edge technology alongside our operational excellence. By joining us, you will play a pivotal role in shaping the future of the shopping experience for customers worldwide.\nWe are seeking Data Associate for our annotation and data analysis operations team. This team plays a critical role in improving Alexa’s natural language understanding leading to improved CX quality metrics and positive business impact. The Data Associate must have a passion for data, efficiency, and accuracy and will work under the direction of Operations manager and Sr.Data Associates. Specifically, the Data Associate will:\n· Process annotation & data analysis tasks with high efficiency and quality in a fast paced environment\n· Deliver on assigned SLAs and KPIs like productivity, turnaround time, quality etc\n· The tasks will be primarily repetitive in nature and will require the individual to make judgment-based decisions keeping in mind the guidelines provided in the SOP.\n· Contribute in team initiatives to improve overall process efficiency and quality\n\nWe are open to hiring candidates to work out of one of the following locations:\nChennai, TN, IND\n- Bachelor's degree\n- Speak, write, and read fluently in English\n- Knowledge of Microsoft Office products and applicationsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}