{
    "Job ID": "69857560",
    "Description": "Job Description:As a Sales Officer at Mars, you would be responsible for ensuring the delivery of our organisational business plan within a specific geography. These business plans include required infrastructure, distributor networks, and distribution points, in-store execution and sales value delivery.  In this role, you will help translate Mars’ business strategy in trade, achieving a mutually beneficial strategy with our trade partners.  We’ve identified four key responsibilities for this role:Sales planning to ensure we deliver consistent achievement of targets through infrastructure, visibility and service levels.\n\nThoroughly analyse market opportunities by building a strong business case around them, with necessary investment and effort to realise them.\n\nCreate and nurture collaborative, long-term relationships with our accounts and distributors, in line with our mutuality principle.  Ensuring delivery of in-store visibility alongside this.\n\nLead, monitor and motivate field sales associates, coaching them on Mars processes as well as continuing to train new recruits. Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gurgaon, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}