{"Job ID": "69858374", "Description": "Responsible for verifying medication orders, dispensing medications, counseling patients, preparation/filling orders and prescriptions, compounding of sterile and non-sterile medications including anti-neoplastic agents, in accordance with accepted standards and established pharmacy policies and procedures.Assists in preparation, filling, compounding, and dispensing ofsterile and non sterile medications as applicable to the area of practice.\nReviews, evaluates, processes medication orders fordemographic data (e.g., gender, age, and weight), appropriateness of therapy,dose, frequency, route, dosage form, interactions, allergies, relatedlaboratory values, and possible drug interactions.\nAdvises/counsels patients and answers questions aboutmedications (including indication, possible side effects, interactions amongdifferent drugs as applicable to the area of practice.\nDocuments interventions and recommendations/ clarifications in the electronic Health Information System asapplicable.\nMaintains control and security of all medications includingcontrolled, narcotic substances and supplies. Maintains dispensing and recordkeeping as per approved policies and regulations.\nAssists andguides health care providers with issues related to the medication managementand use system and provides drug information including but not limited to drugselection, dosage, interactions, monitoring, and side effects,etc to all healthcare providers.\nPrecepts, checks, and monitors medication relatedactivities/performance of new pharmacists, residents, trainees/students withguidance and support from senior pharmacist as needed\nParticipates/assists in conducting performance/qualityimprovement projects.\nFollows all Hospital’s relatedPolicies and Procedures.\nParticipates in self andothers' education, training and development, as applicable.Pharm.D or Bachelor’s Degreein Pharmacy is required.Two (2) years of relatedexperience is required.      N/A.     Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}