{
    "Job ID": "69859085",
    "Description": "Sutherland is seeking a reliable and technical person to join us as SSRS Developer who will play a key role in driving our continued product growth and innovation. If you are looking to build a fulfilling career and are confident you have the skills and experience to help us succeed, we want to work with you!!Sutherland Global Services is seeking SSRS developer who will be responsible for designing databases and ensuring their stability, reliability, and performance with knowledge in MS SQL Server with SSIS / SSRS to join us as Developers.•    Must have: Hands on experience in reviewing, understanding and debugging of existing stored procedures of an application / product\n•    Must have: Develop SQL Server objects including complex stored procedures, functions and views\n•    Collaborate with the business analysts (BA) and stakeholders in gathering and refining requirements.\n•    Collaborate with the project manager (PM) to establish and meet project schedule and goals.\n•    Collaborate with the quality assurance (QA) analysts to develop use cases and test cases and to identify, track, and resolve defects.\n•    Develop high quality reports with good visualization, charts, tables using SSRS\n•    Optimizing and maintaining existing reports for better visualization and performance\n•    Good Knowledge of SQL, Stored Procedures, functions and View\n•    Communicate effectively with project stakeholder to report on progress against agreed deliverables and to highlight escalate any issues or barriers to delivery\n•    In Depth experience as SSRS Developer with required skills in design, development, Testing and maintenance\n•    Extensive experience with Microsoft Visual Studio and TFS\n•    Deploy application to QA environment for testing.Our most successful candidates will have:•    5+ years of SSRS reports development experience \n•    Experience working in SQL Server 2012 and above\n•    3+ years of experience developing queries, procedures, tables, and other database objects with Microsoft SQL Server 2012+\n•    Flexibility to work in shifts as per customer requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}