{
    "Job ID": "69857745",
    "Description": "Additional LocationsHere at Lenovo, we believe in smarter technology that builds a brighter, more sustainable and inclusive future for our customers, colleagues, communities, and the planet.\n\nAnd we go big. No, not big—huge.\n\nWe’re not just a US$70 billion revenue Fortune Global 500 company, we’re one of Fortune’s Most Admired. We’re transforming the world through intelligent transformation, offering the world’s most complete portfolio of smart devices, infrastructure, and solutions. With more than 71,500 employees doing business in 180 markets, we help millions—not just the select few—experience our version of a smarter future.\n\nThe one thing that’s missing? Well… you...• Self-motivated, detail-oriented and organized. Professional, confident and enthusiastic team player with a flexible can-do attitude.• Ability to remain calm under pressure.• Ability to form networks with staff at all levels and influence effectively.• Customer service focused, and able to liaise and influence staff at all levels.• Excellent work ethic and the ability to thrive in a time-sensitive environment.• Flexible and adaptable to fluctuating workflow levels.• Excellent interpersonal, organizational, and presentation skills.• Should exhibit Punctuality.• Should be able to follow instructions as well as take responsibility for the actions.• Acts as a mentor and share knowledge to the team members.• Excellent organizational skills with the ability to priorities workload.• Ensure Resource availability by proper Work force management and work plan creation.• Giving suggession to higher management for smooth running / automating operation.• Multiple Reports preperation & submission to the competent authority.• To maintain SLA as committed.• Work to improve CSAT.• Ability to cope up with new technologies.• Monitor / escalate day to day operations.• To create / manage / update the CMDB.Additional LocationsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}