{
    "Job ID": "69857613",
    "Description": "Date Posted:Country:Location:Position Role Type:At Raytheon, the foundation of everything we do is rooted in our values and a higher calling – to help our nation and allies defend freedoms and deter aggression. We bring the strength of more than 100 years of experience and renowned engineering expertise to meet the needs of today’s mission and stay ahead of tomorrow’s threat. Our team solves tough, meaningful problems that create a safer, more secure world.  Job Summary:We are seeking a smart and energized Information Technology Specialist, who is looking to take the next step in their career helping shape service delivery and deliver customer excellence at our Qatar office location.  To be successful in this role, you will need to be enthusiastic and an energetic person who loves going above and beyond to exceed support expectations daily. Proactive and responsible, your planning skills will ensure your success in meeting customer expectations and stay one step ahead of customer requirements.  The role will be responsible for providing support not only onsite at our Qatar office location, but to all our employees working at customer sites. Working closely with the Service Delivery Manager, you will help drive change in the Workplace Services Team. You will join a local team and be backed with global expertise as well as a tailored professional development program to ensure you and your work are successful. This position is a 2 year international assignment located in Doha, Qatar with additional compensation benefits.Responsibilities to Anticipate:Address the day-to-day IT support needs of end users by providing exceptional support for incident, service request, and problem management \nApplying advanced analytical skills and technical resources at the tactical levels and implementing technical solutions supporting command decision making and execution of mission requirements\nSupport the implementation of new technologies and equipment in a production environment\nAdvises and provides development of standard operating procedures (SOPs) and policies for technical guidelines\nProvide troubleshooting and triaging assistance for basic to intermediate technical challenges and user issues\nTroubleshoot and resolve complex technical issues across the enterprise by applying advanced configuration updates to support the end user.\nAttend to end user requests by phone, walk-ups, and online ticketing systems \nSupport senior executive leadership team and VIP’s with outstanding IT Customer Service and can do attitude. \nPerforming implementation of granular access control, and monitor systems for acceptable performance and user accessibility, establish back-ups, and monitor systems security\nLiaise with EA’s to coordinate successful roll outs, upgrades, meetings and new technology integrations. \nMaintain, support and provision desktop hardware including PCs, Laptops, Mobile devices, printers, and other peripherals \nWork with Program Managers to help resolve technical problems in tactical environments\nPropose solutions to management to ensure all IT requirements are met based on future needs and propose innovative and cost saving solutions where appropriate\nSupport audio visual incidents and staff requests \nAssist in asset management and disposal processes \nAssist in the management of user accounts and resetting credentials\n Maintain and update documentation as required, including, but not limited to End User Work Instructions, Self-Help guides and technical documentation for inclusion into the Knowledge Base. \nContribute to process improvement Basic Qualifications:Typically requires Bachelor’s degree and 5+ years of prior relevant experience OR In absence of a degree, combination of schooling/certifications and 9+ years of relevant experience is required.\nProject management and organization skills\nExperience with fundamental tools and technologies used within RMD DT End User Support Operations and Methodologies (Active Directory, SCCM, Asset Management Lifecycle, Whole Disk Encryption, PKI, Azure Information Protection)\nExperience in change management and regulatory compliance requirements\nPrior experience interacting with multiple levels of employees effectively – including customer, Raytheon, teammates, and suppliers --- from Executive to technician.\nExperience in change management and regulatory compliance requirements\nThe ability to obtain and maintain a U.S. government issued security clearance is required. U.S. citizenship is required, as only U.S. citizens are eligible for a security clearance.\"Preferred Qualifications:Possess knowledge to participate in Enterprise level architecture teams to provide recommendations, feedback and flow downExperience with troubleshooting and maintaining network issues relating to SCCM Patching & Deployment, Voice Over IP (VOIP) technologies and Call Managers, Vulnerability Assessment & RemediationEnd User Support Operations (Active Directory, SCCM, Lease Refresh, Office 365)\nHigh cross-cultural indicator and cultural awareness with Middle East, Asian and European society\nFamiliarity / Certification in Raytheon’s CORE principles & methodology\nMust have experience working independently to achieve results in key technicalWhat We Offer:Whether you’re just starting out on your career journey or are an experienced professional, we offer a total rewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life benefits; career development and recognition programs. Some of the benefits we offer include parental (including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup care.Additional Information:Clearance Information: This position requires the eligibility to obtain a security clearance. The Defense Industrial Security Clearance Office (DISCO), an agency of the Department of Defense, handles and adjudicates the security clearance process. More information about Security Clearances can be found on the US Department of State government website here: https://www.state.gov/m/ds/clearances/c10978.htmRTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Privacy Policy and Terms:Click on this link to read the Policy and TermsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}