{"Job ID": "69858043", "Description": "Homzmart is an end to end community that connects home professionals with homeowners who can browse home designs, furniture, accessories and products and also can find reviews, referring professionals, take advice from professionals and read articles about home improvement.We are currently looking for is someone knowledgeable of all coding modules specifically relevant to operations requirement as mentioned below:Case Management: Create and manage support cases, milestones, and auto assignment rules.\nCase Escalation and Routing: define rules and workflows for case escalation and routing based on predefined criteria.\nService Level Agreements (SLAs): Set up SLAs in Salesforce to define response and resolution timeframes for different types of support cases.\nCustomer profiling and account management: Store and manage customer and prospect information, including contact details, interactions, and preferences. It provides a centralized database for easy access and comprehensive view of customer data.\nReporting and Analytics: Unlock salesforce powerful reporting and analytics capabilities, to be able to provide customizable dashboards, real-time analytics, and data.\nOmni-Channel Support: Supports integration with multiple communication channels, such as telephony, email, chat, social media, and more.\nKnowledge Base: Feature that enables creating and maintaining a repository of articles, FAQs, and documentation. This knowledge base can be accessed by both customers and support agents, enabling self-service support and quick access to relevant information.-   Strong understanding of Salesforce configuration, customization, and administration best practices.\n-   Proficiency in creating custom objects, fields, workflows, approval processes, and reports.\n-   Knowledge of data management principles and experience in data cleansing and deduplication activities.\n-   Ability to analyze business requirements and translate them into technical solutions within Salesforce.\n-   Excellent communication and collaboration skills to work effectively with cross-functional teamsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}