{
    "Job ID": "69859413",
    "Description": "GroupOD ManagerEgypt.Get to know our client:Our client is a Saudi Arabian group of companies that has grown significantly. Power, electrical, civil, environmental, structural, commercial, industrial, high-end technology products, information technology security and solutions, communications, value-added services, geographic information systems (GIS), visualization, and real estate development are among the activities undertaken by the group.Job Location: Cairo (El Maadi)What you will do:Develop and execute a comprehensive Organizational Development (OD) strategy aligned with company goals and values.\nCollaborate with senior management to assess organizational needs and identify areas for improvement.\nOversee the performance appraisal process, setting performance goals and objectives with managers.\nImplement a performance feedback system and provide guidance on improvement plans.\nLead and manage the Talent Acquisition Team, ensuring recruitment of top talent.\nDevelop recruitment strategies, focusing on employer branding and candidate experience.\nCreate and implement talent development programs, including training and mentoring.\nIdentify high-potential employees and design succession plans for key positions.\nDesign competitive compensation and benefits packages in collaboration with HR and finance teams.\nDevelop, revise, and align HR policies with legal requirements and best practices, while streamlining and optimizing HR processes for improved efficiency and employee experience.What they expect from you:Bachelor's degree in Business Administration, or a related field and master'sdegree is a plus.\nA minimum of 10 years of experiencemanagerial role.\nCertification in MBA or SHRM is preferable.\nProven experience in organizational development, performance management, talent acquisition, talent management, compensation and benefits, and policy development.\nStrong knowledge of HR best practices, employment laws, and industry trends.\nAbility to manage multiple tasks, prioritizeresponsibilities.\nAbility to handle sensitive and confidential information with discretion.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}