{"Job ID": "69856842", "Description": "About AtkinsRéalis  Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn.  Digital BIM ManagerAtkinsRéalis is looking for a Digital BIM Manager to join our growing Structural Engineering team in the Middle East within our UAE offices. This is an exciting opportunity to join a developing department within a large multi-disciplinary organisation delivering high quality engineering developments. As a provider of multi-disciplined technical services to the built environment Atkins in the Middle East is committed to design excellence in the delivery of first-class solutions which combine innovation, imagination and best practice.We encourage vision, problem-solving, ambition, enthusiasm and drive. We recognise that people are the key to our success, and our Digital BIM Managers are responsible for playing a key role in helping to shape the future of our business. We ensure that we provide you with a varied workload and encourage you to extend yourself in order to reach your potential.ResponsibilitiesThis is a full-time role working Monday to Friday, 8am-6pm. You will join Atkins as a Digital BIM Manager within the Middle East business to support the team on our growing portfolio of projects within the region. We’re looking for innovative and forward-thinking individuals with a thorough understanding and experience in developing BIM projects to class leading standards. Key responsibilities include:Work within our Structural Engineering team and collaborate with our inhouse and external disciplines to ensure successful delivery of projects from concept to completion.\nCreate, maintain and ensure the BIM Execution plan and Project standards are adhered to by project team. Initiate project set-up, lead BIM kick-off meetings and prepare digital models for our design teams.\nBe comfortable in leading and liaising with external parties and partners on BIM and digital model related queries.\nImplement were needed 3rd party BIM applications including but not limited to Dynamo, 3DS Max, Rhino/Grasshopper, Tekla, Google Earth and Solibri as well as Microsoft Office.\nManage QA/QC review process to ensure that all models comply with Company/Project QA/QC requirements.\nEngages with the broader industry to be aware of ongoing and future developments to maintain our position as leaders in the Digital/BIM industry.\nTo participate in the process of developing BIM standards for projects across Atkins, implement BIM training modules for key staff and maintain training courseware and content libraries through creation of families, etc.\nManage and work within multi-functional design teams, ensure resources are appropriate to meet current and future commitments and to maximize opportunities. Establish project controls and reporting and ensure timely delivery of projects to time, cost and quality.\nManaging key stakeholder interfaces which will include all departments within Atkins and the clients organisation.\nFacilitate the exchange and coordination of models with other disciplines, consultants, and contractor/fabricators.\nAdapt to different cultures and working environments with the ability to work under pressure, in addition, being flexible to travel across the GCC to support project requirements.RequirementsWe are looking for enthusiastic, innovative and self-starting individuals with good written and verbal communication skills who have the desire to learn, grow and work as part of a team. The starting point to succeed in this role is as follows:  Min 10 years’ experience in digital delivery of complex, multidisciplinary projects with experience in managing a team to support the engineering design teams.\nDemonstrate expertise in the set-up, preparation, collaboration and management of 3D BIM & Revit models for projects ranging from small to large scale.\nDeveloped experience in 3rd party BIM applications including but not limited to Dynamo, 3DS Max, Rhino, Grasshopper, Tekla, Google Earth and Solibri as well as Microsoft Office including good working knowledge of word processing, spreadsheets, email, Web-enabled applications and database software.\nExpert knowledge of BIM federation and coordination platforms for performing tasks such as clash detection and resolution, model walkthrough and issue tracking and management.\nSound knowledge in engineering design and to assist design teams with coordination and quality compliance.\nA through understanding of the data, information management and BIM including compliance to ISO 19650 standards.\nRevit content creation: Parametric families using formulae, nesting and type catalogues.\nIntegration of Revit products with other applications (AutoCAD, Civil 3D, eSPEC, Quantity Takeoff, etc).\nBIM experience with 3D rendering and visualisation, BOQ & cost estimation, analysis and simulations, and specification linking etc.\nStrong communication skills, reporting, independent working, presenting to both internal and external parties.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}