{
    "Job ID": "69858659",
    "Description": "Senior Analyst - SCM COE Supplier Onboarding-(2300017207)Job:Audit, Accounting & FinancePrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 5:11:55 AMUnposting Date:OngoingRole Responsibilities To ensure the business meets procurement needs by ensuring prompt creation of Supplier on boarding, business support in SCBUY.Responsibilities*Strategy*Customer service measurablesBusiness*All Queries received should be responded promptly with an effort to resolve the query within the agreed SLAProcesses*Effective presentation and communication skillsPeople & Talent*Good understanding & experience of procurement processRisk Management*Problem solving abilityRegulatory & Business Conduct*Display exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the [country / business unit / function/[team] to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.] \nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Our Ideal Candidate UG/PG with 3 year experience in Vendor / Supplier OnboardingAbout Standard Chartered We're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we doNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so wellBe better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long termIn line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locationsTime-off including annual, parental/maternity (20 weeks), sabbatical (12 weeks maximum) and volunteering leave (3 days), along with with minimum global standards for annual and public holiday, which is combined to 30 days minimumFlexible working options based around home and office locations, with flexible working patternsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}