{"Job ID": "69858532", "Description": "The opportunityMace is an inclusive employer and welcomes interest from a diverse range of candidates. Even if you feel you do not fulfil all the criteria below, please apply as you may still be the best candidate for this role or another role within our organisation. Should you require any adjustments to assist during the application/hiring process please advise us.Provides an effective people-related support function to a project-based team and is a key point of contact for new, current, and exiting employees in relation to their employment matters, specifically for Saudi Arabia.They will also help to assist their HR colleagues in MENA region.This opportunity is for a Saudi national who is interested in joining an international consultant.Your responsibilities will include:Acting as the primary point of contact for all employees on HR queries, regarding policies, benefits and other HR-related matters and responds accordingly.\n\nCreating and issuing HR communications, letters and associated documentation in line with terms and conditions and company policy.\n\nWorking with the HS&W function on delivering the wellbeing strategy to the region.\n\nPreparing reports, presentations, communications, data summaries, and/or other documents/information.\n\nManaging sensitive information effectively and always maintains discretion and confidentiality.\n\nReviewing and updating employee handbooks and contracts, when required.\n\nEnsuring that all new and existing line managers are briefed on the HR procedures.\n\nTracking employee assignments and issue relevant agreements.\n\nManaging the on-boarding of new hires and ensuring the highest level of experience for new joiners. \n\nCoordinating with the HR administrator and PRO team to make sure all visa applications are accurate and made in a timely manner.\n\nCoordinating the benefits administration with the HR Services team (medical and life enrolments).\n\nWorking closely with managers to identify employee learning and development needs.\n\nAssisting and supporting the annual performance management cycle.\n\nManaging the off-boarding employees and extending the same level of services to leaver procedures.\n\nSending resignation acknowledgement, exit checklist and final settlements to employees leaving the company.About youWith a relevant degree qualification in human resources, chartered or pursuing a similar level of professional qualification will be viewed favourably.You are digitally savvy, having knowledge of Oracle systems would be beneficial. You can build lasting client relationships and provide support to dynamic, motivated teams. You must have experience of working in an HR support role and have knowledge of Saudi Arabia labour laws.Apply now for a confidential discussion.#LI-OnsiteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}