{
    "Job ID": "69859164",
    "Description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (COVID-19), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have.Some careers open more doors than others. If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.·Onboarding HSBC MF products and driving sales by engaging with the product/research teams of banks, NDs and wealth outfits.·Co-ordinating with internal teams for resolving operations related queries·Data extraction from Mfdex and other data management tools like AMIN Smart and help maintain multiple sales MIS & reports for management analysis·Independently manage the assigned distributor channel/network and also enhance the scope of distribution ·Organise promotional activities and ensure high share of mind of our products, increase the visibility of HSBC funds and improve awareness of our schemes for the distributors assigned.·Deliver sales targets assigned for the given geography/distributor portfolio·Procure new and maintain direct relationships with assigned distributor network / clientele·Productively work with the Operations/Customer Service to ensure efficiency is maintained.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}