{
    "Job ID": "69856894",
    "Description": "AtkinsRealis is a hands-on project delivery organisation that has moulded its business to respond to the demands of the nations in which it operates.  In doing so, we actively seek to employ staff who possess strong pro-active management skills which enables them to understand the entire delivery process from site acquisition through to feasibility, design, construction, sales and occupancy phases.  Our end-to-end project delivery solution is focused on best maximising project outcomes while minimising project risk for our Clients.Position: Testing & Commissioning ManagerTheir primary responsibility is to ensure that systems, equipment, and processes are thoroughly tested, inspected, and commissioned to meet quality standards and regulatory requirements before they are put into operation. Responsibilities: 1. Planning and Strategy:   - Develop and implement a comprehensive testing and commissioning plan for projects or systems.   - Define testing objectives, scope, and schedule.   - Collaborate with project managers, engineers, and other stakeholders to align commissioning activities with project goals. 2. Test Development:   - Create detailed test procedures and protocols.   - Specify testing equipment, tools, and resources required for the process.   - Ensure that testing methods comply with industry standards and regulations. 3. Testing and Inspection:   - Oversee and coordinate testing activities on-site.   - Monitor and evaluate the performance of systems, equipment, or processes during testing.   - Identify and resolve issues, defects, or deviations from standards. 4. Documentation:   - Maintain detailed records of testing and commissioning activities.   - Prepare test reports, commissioning documentation, and compliance certificates.   - Ensure that all documentation is accurate and complete. 5. Quality Assurance:   - Implement quality control procedures to ensure that systems meet specified standards.   - Identify opportunities for process improvement and optimization.   - Verify that safety protocols are followed during testing and commissioning activities. 6. Compliance and Regulation:   - Stay updated on industry regulations, codes, and standards relevant to the project.   - Ensure that all testing and commissioning activities adhere to legal and safety requirements. 7. Team Management:   - Supervise a team of technicians, engineers, and inspectors involved in testing and commissioning.   - Provide guidance, training, and support to team members.   - Manage resources and budgets for commissioning activities. Requirements: 1. Education:  A bachelor's degree in engineering, construction management, or a related field is typically required. A master's degree may be preferred in some cases. 2. Experience:     - 15+ years of relevant experience in testing, commissioning, or quality assurance.   - Proven experience in managing testing and commissioning projects. 3. Technical Knowledge:   - In-depth understanding of the systems, equipment, or processes being tested.   - Knowledge of relevant industry standards and regulations.   - Familiarity with testing equipment and tools. 4. Communication Skills:  Effective written and verbal communication skills are essential for coordinating with project teams, clients, and regulatory authorities. 5. Leadership and Management Skills:  Strong leadership abilities are required to lead a team of professionals and manage resources effectively. 6. Problem-Solving:  The ability to identify issues and develop solutions quickly is crucial in ensuring successful testing and commissioning. 7. Attention to Detail:  Meticulous attention to detail is necessary to document and report on testing and commissioning activities accurately. 8. Safety Awareness:  Understanding and prioritizing safety protocols and regulations is paramount to prevent accidents during testing and commissioning processes. 9. Project Management:  Proficiency in project management software and methodologies is beneficial for planning and scheduling commissioning activities. 10. Certification:  Depending on the industry and region, certification in relevant areas such as quality assurance, project management, or specific technical areas may be advantageous.Rewards & Benefits:We offer an excellent package which includes:A competitive salary;\n\nAccommodation allowance; \n\nTransportation allowance; \n\nAnnual leave;\n\nMedical and life insurance cover; \n\nCompany gratuity scheme; \n\nDiscretionary bonus scheme; \n\nAnnual flight allowance to point of origin;AtkinsRealis is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}