{
    "Job ID": "69856810",
    "Description": "Strategy and Planning\n• Assist the HSE Manager in planning and implementing HSE strategies to ensure operational compliance and excellence in DMC and Jadaf.\n• Provide assistance to the HSE Manager in developing HSE policies and processes to comply with regulatory bodies and group policies.\n• Identify and communicate certification requirements for DMC & Jadaf to meet international and national standards.\n• Conduct regular sessions with relevant teams to comply with HSE Standards\nOperations\n• To regularly monitor OHS&E standards and procedures in the DMC & Jadaf therefore ensuring smooth running of daily shifts in safety related matters.\n• To assist in the implementation of GHSE standards and OHS&E Management System within the port and ensure compliance thereto.\n• To conduct routine inspections related to OHS&E therefore ensuring operational area is compliant in all matters relating to OHS&E.\n• To ensure all OHS&E equipment including pollution equipment are tested and maintained to effectively meet emergencies situations.\n• Work with HSE manager and ensure that an adequate programme of training for health and safety is established and that the safety culture is encouraged amongst employees.\n• To record and maintain a database of all inspections conducted to follow up and identify corrective actions.\n• To coordinate with Port and Local Authority bodies for mutual assistance and liaise with Civil Defence during emergencies to mitigate loss of life and damage to property.\n• To undertake investigations with the view of establishing causes thereof and recommend / initiate steps to prevent a recurrence thereof – Follow-up on actions to prevent a recurrence until closed out.\n• To develop and ascertain toolbox talks are carried out with members of other departments.\n• To work with DMC and Jadaf Safety and Environment managers to design, develop and implement Management Systems, procedure, and policies.\n• To train, develop and oversee the Safety client implement the safety and environment system, policies and procedures within the DMC and Jadaf to meet established business objectives.\n• Conduct risk assessment and enforce preventative measures.\n• Prepare reports on occurrences and provide statistical information to HSE Manager.\n• Inspect equipment and machinery to observe possible unsafe conditions.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}