{
    "Job ID": "69856918",
    "Description": "Atkins, a member of the SNC-Lavalin Group, is one of the world’s most respected design, engineering, and project management consultancies. Atkins Strategic Advisory team combines management consulting, advisory and technical capabilities to help clients solve complex front-end problems in the built environment.There is an increasing demand for environmental and sustainability consultancy services within the Middle East, to support the growth of community development and infrastructure projects in real estate, government, utilities (energy, water and waste) and transport sectors. Our clients in these built environment sectors need Sustainability and Net Zero Carbon strategies not only at the project level, but also at the corporate portfolio and organisational levels.Our Strategic Advisory team requires an experienced Senior Carbon and Sustainability Consultant to join in Dubai or Riyadh. Successful candidates will have proven experiences in Sustainability Consulting on large-scale projects in KSA, UAE and the wider Middle East region. The role will require knowledge and skillsets to provide solutions to our clients’ challenges arising from growing investor interest in ESG and climate disclosures, planning and environmental regulatory enforcement and mandatory requirements for integrated sustainable design.This is an excellent career development opportunity for candidates looking to progress their career to the next level in a fast-paced and exciting field of work. You will join an international team of Carbon and Sustainability experts located locally and across the globe, supporting key clients and working on mega projects. You will work collaboratively with a range of technical specialists on a broad range of projects, lead and coordinate Sustainable Design and Strategy services and related deliverables, work closely with clients, develop new areas of business and mentor others in the team. The candidate will be based in Dubai or Riyadh but will be required to work across the broader Middle East. Whilst directly reporting to the Strategic Advisory Business Unit, the individual must be able to develop a successful working relationship with the discipline leads of other Business Units within the Middle East as well as the technical specialists in the UK.QualificationsPost-graduate degree qualified in an environmental, engineering, sustainability or other related subject. \n\nMinimum of 4 years of experience in a position focused on sustainability advisory, preferably from Big 4 or other strategy/management consulting firms.\n\nAt least 1 year Middle East experience.\n\nSpecialist in carbon and sustainability or relevant subject, especially with the following skills:\n\nSustainability strategy\n\nCarbon/GHG accounting based on, e.g. GHG Protocol, PAS 2080, SBTi, etc.\n\nESG/Sustainability reporting based on, e.g. GRI, SASB, TCFD, GRESB, ISSB, etc.\n\nGreen building certification advisory for, e.g. LEED, Estidama, Mostadam, etc.\n\nModelling such as energy/thermal, microclimate, BIM, GIS, carbon/GHG, etc. is a plus.\n\nRegional experience of multi-disciplinary work in large-scale master planning, design and infrastructure projects.\n\nRelevant technical experience and knowledge of whole-life carbon assessment, analytical tools for embodied and operational carbon, climate risk management, Net Zero Carbon roadmap for large-scale portfolios.\n\nExperience of development of complex technical reports in line with local/regional regulatory requirements and international best practices.\n\nStrong report writing, verbal and presentation skills and able to review the work of others to ensure quality.\n\nAble to prioritise and work effectively under pressure.\n\nGood interpersonal skills and an ability to communicate issues and ideas effectively.\n\nBe flexible, adaptable, and prepared to take on new challenges and work from other Atkins or client office locations.\n\nBe highly self-motivated, possessing strong enthusiasm and commitment to delivering sustainable outcomes. ResponsibilitiesCoordinate multi-disciplinary teams to develop integrated sustainability strategies and design solutions provide subject matter expert advice to key clients.\n\nDevelop sustainability key performance indicators, strategies and management plans for planning and design projects and implement them throughout the project duration.\n\nDevelop sustainability polices, standards, procedures and guidelines at organisational or portfolio levels for key clients.\n\nDevelop sustainability/ESG programmes and reporting through materiality assessment, benchmarking, gap analysis, KPI identification and stakeholder engagement.\n\nChampion high standards of sustainability performance within multi-disciplinary engineering projects, influencing project development and delivering optimal sustainability outcomes.\n\nManage technical and commercial aspects of bid development and project delivery while drawing in expertise from our global SNC-L and Atkins group.\n\nSupport business development with opportunity identification, proposal development and thought leadership.\n\nMeet with regulatory authorities and certification bodies and obtaining statutory and certification approvals for sustainability components of projects. \n\nGather data and research information from a range of sources to provide clear, well-written technical reports.\n\nCompetently undertake own work to an excellent standard and review the work of others, on time and to budget.\n\nBeing able to manage clients’ needs in a confident, professional manner.Salary and Benefits\nWe offer an excellent package which includes:A competitive salary.\n\nAccommodation allowance. \n\nTransportation allowance. \n\n22 working days annual leave.  \n\nMedical and life insurance cover. \n\nCompany gratuity scheme. \n\nDiscretionary bonus scheme. \n\nAnnual flight allowance to point of origin. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}