{
    "Job ID": "69858323",
    "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Adhesive Technologies help to transform entire industries and provide our customers with a competitive advantage through adhesives, sealants and functional coatings. With our trusted brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Executes sales strategy and develops action plans for area of responsibility in line with strategic priorities\nDelivers sales and distribution targets (KP OSG and PC % and / or GP% targets) in the assign area of responsibility.\nLeads, coaches and mentors sales team members and ensures their respective education and development.\nEnsures efficient geographical coverage and cross-selling opportunities to achieve full business potential.\nMonitors sales team’s daily activity to ensure KPIs are met, and standards followed.\nCoordinates the daily operations with the internal and external stakeholders.\n Builds excellent relationship with the distributor & key customers.\nActively controls and steers the order and payment cycle (collection) with the distributor, as well as retail customers.\nManages stock level at distributor and ensures FIFO principles are followed at each POS.\nControls Henkel product pricing on shelf and the service quality level for all assigned customersBachelor’s Degree, preferably in Business Administration.\nGood command of English and Arabic is a must.\nMinimum 8 years of sales experience, preferably FMCG, out of which minimum 2 years in a senior role.\nLeadership skills to steer the team on daily basis – people management experience is a must.\nDistributor management experience is a must.\nRetail and van sales operations experience required.\nMS Office Proficiency and solid business acumen required.\nGood communication and negotiation skills.\nProactive, positive, enabler & team player mindset.Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}