{"Job ID": "69858271", "Description": "Sia Partners is a next-generation consulting firm focused on delivering superior value and tangible results to clients as they navigate the digital revolution. Our global footprint and expertise in more than 40 sectors and services allow us to enhance our clients' businesses worldwide. We guide their projects and initiatives in strategy, business transformation, IT & digital strategy, and Data Science.  As the pioneer of Consulting 4.0, we integrate AI into our solutions.Sia Partners comprises of 2,600+ consultants with diverse expertise, and operates from 39 offices worldwide across Asia, North Africa, North America, and Australia, in addition to Europe and the United Kingdom.In the Middle East, Sia Partners provides expert advisory services on strategy & execution, innovation, operational performance & cost reduction, cyber & data security, efficient organisation, transformation & change management, HR performance, and IT performance. In addition to these services, Sia Institute, Sia Partners’ world-class international training arm, provides a wide range of learning programs and workshops with modules successfully delivered across various locations and sectors, particularly in the Middle East.Along with a multinational team, the Partners leading the Middle East offices have a long record of accomplishments and expertise; and play an active role in the realization of the region’ vision in both Public and Private sectors.Why join the Sia Village? Excellence | Entrepreneurship | Innovation | Teamwork | Care & Support | Employee WellbeingThese are the six core values that guide all our actions. As an expression of our values, our Sia Village concept describes our commitment to fostering a sense of community within and among our offices. We believe that knowledge sharing is the key, not only to innovation, but to the growth and development of our people.Sia Partners is looking for a bright and highly motivated Project Manager from the Waste Management Sector committed to building relationships and delivering results. We are interested in people with excellent track records during their education as well as successful and relevant job experiences.Presently, Sia Partners has been involved by our client, a leading government body of KSA, responsible for oversight of the master planning and strategy development of the waste sector for KSA as part of Vision 2030.Our client has sub-consultants and experts conducting, developing, documenting, implementing, delivering, administering and reporting the planning, design and delivery of an integrated solid waste management. the key role of Sia Partners is assisting our client in managing the sub-consultants.As Sia Partners Project Manager, you will be supporting the technical work stream, including managing the oversight team of experts currently assisting our client and will have to assume the following responsibilities (but not limited to):Review of technical master planning deliverables submitted by the client covering waste management programs for the collection, transport, recycling, treatment and disposal of solid waste across the Kingdom of Saudi Arabia (KSA); the aim is to meet waste reduction and recycling targets leading to potential landfill diversion.\nReview and provide a technical comments service regarding waste diversion, recovery and disposal standards and services covering different waste types like Municipal solid waste, Agricultural waste, Industrial Waste, Special waste like tyres, End of life vehicles, Electronic Waste, Healthcare waste, Sewage Sludge, CDW.\nUnderstanding of waste sampling and characterization reports submitted by the client, review and provide comments.\nOversee the project management office from time to time to prepare project progress reports, prepare risk matrix (RAID log), review weekly progress reports of sub-consultants.\nTrack the project plan and identify any delays, subsequently discuss with the client and meditate with the sub-consultant for an appropriate action plan for delays, together with physical, financial and administrative records supporting the action plan.\nReview of invoices submitted from sub-consultants, such as verifying scope delivered against claims in invoices and coordination of invoices with client.\nAd hoc attendance to meetings requested by client for stakeholder engagements to provide ongoing waste management master plan and strategy insights of KSA as part of Vision 2030+6 years of experince in Managment Consulting \nThorough understanding, development and implementation of solid waste management disposal practices.\nDemonstrated knowledge, expertise and implementation of best practice in the solid waste management industry in particular landfill operations.\nDemonstrated knowledge of working in the Kingdom of Saudi Arabia or the region in the waste sector specifically.\nDemonstrated knowledge of both ‘in house’ and contract service model for waste diversion, recovery and disposal operations.\nPreparation of executive-level reporting and related presentations.What we offer:  Competitive salary and benefits.\nEntrepreneurial journey.\nCareer advocacy program that supports achieving professional development goals through guidance, and real-time feedback.\nContinuous learning & development opportunities.Our Commitment to DiversityDiversity, equity, inclusion, and belonging (DEIB) are part of Sia Partners’ DNA. Thanks to our expertise in several sectors and our international growth, our teams include a variety of experiences and cultures. We’re confident that promoting DEIB creates an environment in which everyone can reach their full potential.Our global network, DEIB@Sia Partners, brings together our people worldwide to facilitate local and global progress, focused on the following areas:Gender equality (global Gender Equality Index score of 91/100 for FY19-20)\nRace & Ethnicity\nWorking Parents\nDisabilitiesSia Partners is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs.\n\nTo learn more about our mission, values, and business sectors, please visit our website.Sia Partners is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}