{"Job ID": "69859443", "Description": "At Hitachi Energy our purpose is advancing a sustainable energy future for all. We bring power to our homes, schools, hospitals and factories. Join us and work with fantastic people, while learning and developing yourself on projects that have a real impact to our communities and society. Bring your passion, bring your energy, and be part of a global team that appreciates a simple truth: Diversity + Collaboration = Great Innovation We are looking for our next “ Senior Primary Engineer ”, who will  be able to demonstrate knowledge at Grid Integration Business Unit at Hitachi Energy in Dudullu in İstanbul with below qualifications; Your responsibilities The successful candidate will apply a diversified knowledge of HV/MV Substation (AIS, GIS, Hybrid) Primary Engineering design& engineering principles and practices as applied to HV/MV substation engineering, design, and operation in the electric utility industry. On-site assessment and evaluation of existing equipment, steel& civil structures, foundations, in so called “brown field” substation projects Identifying and clarifying technical ambiguities and conflicts in the documents (Layouts -Sections-BOQ’s and etc..) Identifying potential or probable risk during construction and installation of HV/MV Substation Primary Equipment’s and Primary Engineering system solutions. Developing mitigation strategies for identified risks of HV/MV Substation primary engineering. Analyze sub-contractor bid responses for inconsistencies, oversights and mistakes Lead sub-contractor bid reviews to resolves bid response inconsistencies, oversights and mistakes Provide cost recommendations to the proposal team based on the bid review analysis Prepare, update and support the project execution engineering activities in the schedule with emphasis on Develop the Design Criteria and the Document Deliverables list for the project. Your background Bachelor’s degree or higher in Electrical Engineering. Having strong analytical and problem-solving skills paired with a highly business savvy and result-oriented mindset. Completed military service for male applicants.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}