{"Job ID": "69858182", "Description": "OVERVIEWPositionDirector of Golf DevelopmentJob CodeReports toDirector of Assets DevelopmentDirect Reports-DivisionSportSectorSportRole PurposeNEOM currently have 8 Golf Assets under various stages of project development form feasibility to pre operations. This list does not include any urban facilities that will be required to deliver the NEOM Golf Ecosystem.  Therefore, NEOM Sport have determined to create a position that will hold the responsibility of coordinating and assisting projects with the delivery of assets to be aligned with the NEOM Golf Ecosystem. KEY ACCOUNTABILITIES & ACTIVITIESThe vision for NEOM Sport is that: NEOM will be an innovative hub for sport. To achieve this vision, our mission statement is that Sport will build a lifestyle, a destination and a global brand for NEOM. The NEOM Sport Sector Team is responsible for delivering this vision and mission.The candidate will be responsible for overseeing delivery of all golf assets including but not limited to Green Grass, Golf Developments, Urban Golf Assets and Gamification Golf Assets. The position will support NEOM Sport with data and advice for position of golf assets to be managed under a future operational structure.Candidate should be self-motivated to create professional goals that set to deliver the Golf Ecosystem for NEOM.Candidate will have responsibility to chair meetings while providing briefings to senior management within NEOM.Candidate will assist NEOM Sport as they transition into a Governance and Operational structure for all assets under management.Specific ResponsibilitiesOversight of current golf assets being developed by various NEOM Projects. Management of all processes and external resources supporting the golf design throughout NEOM. This will include drafting RFPs, technical reviews as well as liaising with Procurement on activating appointments.\nTechnical Guidance for future projects that contain golf components – including briefing and management of external consultant support.\nManagement and project administration of all golf related assets to ensure compliance with NEOM Plan of Work\nDevelop Business case models for various Golf offerings.\nCollating golf data to be incorporated into the Sport Asset database.\nVerification of golf assets during construction period to ensure construction methodologies align with the national golf sustainability guidelines.\nMaintaining project schedule of all golf assets.\nValidation of space programs for all golf assets.\nLiaise with NEOM Projects to be aligned with the NEOM Sport directives.\nAlign NEOM Golf outputs to remain consistent with NEOM Asset development processes and outputs.\nManage growth of NEOM Sport Golf offering within the capabilities of the NEOM Sport Asset team recommending future organic growth when requiredBACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and Experience10 years in Golf Course Design Management\n15 years in Facility Design Management\n5 years Golf Course Construction Supervision\n15 years Middle East Project Experience ,preference for KSAQualificationsBachelor’s Degree in a Design / Engineering related field of Civile Engineering, Interiors Design, Architecture, Urban Planning, Golf Course Design, Landscape Design.MAIN CONTACTSExternalSector Head for Sport\nNEOM Sport SectorJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}