{
    "Job ID": "69858494",
    "Description": "Job DescriptionAre You Ready to Make It Happen at Mondelēz International?Join our Mission to Lead the Future of Snacking. Make It With Pride.You ensure that customer plans are developed and executed by supporting the delivery of strategies and tactics for growth. You understand the business metrics and financial drivers needed to unlock profitable growth for Mondelēz International and our customers and work with key account managers to implement plans to deliver our annual target.How you will contributeYou will:·Leads the development of the trade marketing part of the category annual plans (contract process).·Understands market dynamics / consumer insights by channel to participate on trade marketing strategic decisions.·Leads the business planning meeting where the sales quotas are built in order to accomplish the annual plans based on relevant building blocks.·Suggests and influences investment in category building blocks, according to category and channel need, and is accountable of execution excellence at point of sale.·Follows up the competition’s commercial activity in the category in order to detect business opportunities and potential threats for the brand.·Plays a leadership role within the multi categories teams by leading, providing accurate and relevant channel point of sale information that will lead to find business opportunities such as innovations, customer promotions, portfolio, pricing, etc. that will lead to achieve multi categories targetsWhat you will bringA desire to drive your future and accelerate your career and the following experience and knowledge:·Category planning and delivering growth through category leadership·Having a future-focused mindset, being curious about industry trends, digital solutions and innovation for consumers, and translating opportunities into business plans·Developing and delivering plans, measuring and monitoring results and making recommendations to achieve growth targets·Business planning and how to maximize revenue growth·Influencing stakeholders and interacting effectively with others with the courage and resilience to hold an alternative point of view·Analytical skills and business acumenMore about this role3 to 5 Year of Experience.\nExperience working with various Trade Marketing/ Shopper Marketing and Category Planning and Activation activities.\nExperience in developing business reporting, data analysis for full picture of channel, customer, and consumer performance.\nStrong Business acumen and analytical thinking.\nUnderstand retail environment, promotional tactics, execution and fulfilment processes.\nA preference for customer facing experience, accounts and operationBusiness Unit SummaryMondelēz International is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation or preference, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.Job TypeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}