{"Job ID": "69857996", "Description": "Job Description:Provide business domain solution, process, strategy, business case and change consulting to external client at functional and senior management level, on a chargeable basis. The business domain includes industry specific business process and function specific business process such as HR, accounting and IT. It also includes developing and managing IT governance mechanism and various policies such as security policy, business continuity policy. Help the client innovate and formulate business solutions and “technology enabled” business models and new ways of doing business to create breakthrough positions in the marketplace. Explains how and where technology can be used to address key business processes in a particular domain. Gets involved in the strategy and business issues identification and resolution; provides input to the company account plan to develop and manage the strategic relationship with the client’s senior management, and act as a trusted advisor in transforming the client’s business.Responsibilities:Researches the clients business and industry and able to offer an option or view.\nConstructs visual models/whiteboard during informal meetings.\nCreates roadmaps describing as is and to be customer environments.\nListens, asking open and closed questions and summarising.\nArticulates outcomes and key benefits focusing on value to both the client and the company.\nFacilitates the definition of processes and activities.\nOrganises workshop logistics.\ndocumenting workshop outputs.\nfacilitating part of the workshop or co-facilitate client events.\nContributes to building communication plans.\nShapes people orientated works streams and management of change activities.\nCoaches and supporting individual clients focusing on their personal success.\nIdentifies risks and assumptions and shapes programme governance.\nWorks on pre-sales opportunities to create valid business cases including ROI.\nDevelops proposed solutions, addressing client business issues and objectives using a combination of the company standardized and customized services.Education and Experience Required:\n5 years experience in commercial or public sector. Educational degree preferred.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}