{
    "Job ID": "69857641",
    "Description": "Who You’ll Work WithAs a Tax Analyst, you will be part of Cisco’s Global Tax & Customs team supporting the Indirect tax compliance for Cisco in India. Our team consists of experienced, highly skilled and diverse tax and customs professionals around the globe covering all areas within Global Tax and Customs. As a team we value true collaboration, actively share knowledge and ideas, we work together to achieve the best outcomes, and appreciate a sense of humour.What You’ll DoYou will play a key role in handling the day-to-day activities related to India Indirect tax compliance and learn about & implement all developments in this area to keep Cisco compliant and efficient. With that, you will have following roles & responsibilities:Provide vital support in Indirect tax compliance, specifically related to India including implementing and standardizing tax compliance processes.\nPrepare and file the India GST returns for multiple registrations of various Cisco entities.\nAnalyze & interpret data and prepare reconciliation reports.\nAssist in Indirect tax audits for Cisco India entities, including liaison with service providers.\nSupport IT improvement projects and automation/digitalization related initiatives.\nWork with internal tax/finance/accounting colleagues on end-to-end processes.Who You Are:This is role is an excellent opportunity for someone who wants to expand experience and hone skills in a global organization that offers a broad horizon for career advancement!The ideal candidate is a standout colleague who has the flexibility, cross-functional communication skills, and the ability to adapt and learn independently in Cisco’s team-oriented and innovation-focused culture. You are excited to work with huge databases & are proficient in Microsoft applications (Excel, Word, PowerPoint and Outlook) and you are adaptive to an ERP environment.Bachelor’s degree in Tax / Law, Finance or Accounting.\nExperience in Indirect tax laws and regulations in India.\nProven experience of at least 3 years in handling Indirect tax compliance in a multinational environment.\nAbility to handle the monthly compliance activities timely with adequate supervision and mentorship.\nPossess extensive knowledge of SAP/Oracle ERP systems and able to independently analyse & work on the reports generated from these systems.\nKeen desire to understand the various technical processes and to identify & drive improvement opportunities.Why You’ll Love CiscoEverything is converging on the Internet, making networked connections more relevant than ever before in our lives. Our employees' dynamic ideas impact everything imaginable - from entertainment, retail, healthcare, and education, to public and private sectors, smart cities, smart cars, and everyday devices in our homes. Here, that means you will take creative ideas from the drawing board to powerful solutions that have real world impact. You'll work with Cisco leaders, partner with expert mentors, and develop incredible relationships with colleagues who share your interest in connecting the unconnected You'll be part a team that cares about its customers, enjoys having fun, and you'll take part in changing the lives of those in our local communities. Come prepared to be encouraged and inspired.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}