{"Job ID": "69856913", "Description": "Engineering a better future for our planet and its people.We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects.With offices around the world, we connect people, technology and data to shape the future of our industry and the world around us and because we cover everything from blueprint to delivery, across the entire lifespan of a project, you can count on us for a client experience that is smoother, smarter and more efficient. At Atkins, we’re not just embracing change – we’re driving it.Saudi Arabia continues to be an exciting location, with ambitious growth and transformational plans to support Vision 2030 and involvement with many of the mega projects including NEOM, AlUla, AMAALA, and more. Atkins is positioned to grow its position as a leading provider of technical solutions to many of the opportunities with ambitions to grow further in 2023.Requirements:Degree of post graduate qualification in urban design, urban planning landscape architecture, or related field and preferably with a professional affiliation (or eligible for membership)\n\nCandidates will ideally have minimum 15 years relevant working experience in urban design, urban planning and master planning\n\nLead the production of high-quality urban planning, design and master planning project submissions in the UAE, KSA and the wider Middle East and Africa\n\nLead in the preparation of technical bids and fee proposals for master planning and urban design projects and other major infrastructure projects where appropriateStrong design and graphics capabilities and ability to communicate ideas via various visual and graphic media including hand and computer graphics\n\nFully conversant with Adobe Creative Suite with demonstrable graphics and visualisation skills\n\nCompetent in PowerPoint, MS Word, Excel and AutoCAD\n\nExperience in working with a multidisciplinary team desirable\n\nStrong design management, report production and coordination skillsAn understanding of sustainability issues within the public realm. (LEED or similar experience and advantage)\n\nExcellent communication skills in written and spoken English\n\nCapable of working on own initiative or as part of a larger multidisciplinary team\n\nHave a logical and organized approach to project delivery of project outputs\n\nWill be required to travel within the Middle East region to projects in a variety of geographical locations, including Saudi ArabiaDeveloping and maintaining relationships with clients, attending meetings, workshops and seminars\n\nOther duties associated with the main role and responsibilities will be requested from time to timeResponsibilities:Contribute to the design and delivery of a variety of projects often happening concurrently.\n\nTake ownership of medium to large scale design and production packages under the supervision of the Design/Project Director.\n\nOrganise and graphicly develop client presentations.\n\nWork to a programme for deliverables and advise senior staff of any issues which may affect delivery.\n\nWork within agreed design standards and parameters with senior staff.Ensure the quality of deliverables meet the expectations of senior staff.\n\nWork within a multidisciplinary, multicultural team.\n\nUndertake technical co-ordination with other disciplinesRewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nMedical and life insurance coverCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}