{"Job ID": "69858537", "Description": "To provide general administrative services and/or secretarial support. This role is typically focussed on the completion of tasks and work routines which are semi-related. Interaction with contacts within other departments is routine and usually uncomplicated. The use of a computer is at a basic level and somewhat frequent. Job Outline: - Organise appointments as required and prepare necessary documents, keeping designated employees advised of their daily schedule and ensure availability of facilities, meeting rooms etc. Where required, handle all aspects of internal customer service to ensure a professional, accurate and informative service. - Receive cash, prepare daily reports on the same and highlight discrepancies where the case. Support supervisory staff in billing and account reconciliation where required. Prepare and submit applications, government forms, permit requests etc. for employees. - Prepare documents, passes, licenses and forms for submission to HR, Staff Travel, and other internal departments for staff as required. - Complete timekeeping activities such as: input of sick, absence, leave, overtime to ensure accurate records are maintained. Assist in compiling routine management reports. Recommend improvements to process/procedure to seniors. - Maintain department records for timekeeping and highlight attendance trends or issues to management. - Compose and dispatch routine letters, memos and other correspondence for the department. Sort, consolidate and distribute incoming mail items and other documents in an organised and timely manner. - Prepare documents for distribution to internal and external departments as per department requirements. This includes photocopying, collating, scanning, faxing, laminating, binding etc. Wherever required by role, update information systems and prepare routine reports. - Maintain an efficient filing system for the department and ensure logs or standard reports are as per requirements. Ensure information is accurate and up to date. - Ensure hardware assets are in working order (photocopier, telephones, fax). - Order and maintain office stationary supplies, with logs of daily activity.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}