{
    "Job ID": "69857123",
    "Description": "Overview Main purpose: Ensuring the delivery of best quality as per PepsiCo standards thru online checks & inspection. Ensuring minimum customer complaints by implementing quality systems and food safety systems. Implementing right quality control systems for incoming check, process check, Lab management and Environment. Ensuring Water Usage Ratio & managing water treatment plant operation. Ensure compliance with SOX and perform all the roles and responsibilities as a control owner for I2C process. Responsibilities Accountability: Vertical startup/expansion of green field plant with right quality product & building a quality culture in the plant. Supporting the supply chain, sales function in delivering the right quality product in right time. Supporting Agro wrt to potato checking, testing & cold store audit to correctly predict potato quality. Conducting the process audit and fixing the issues. Conducting the Product Evaluation practices to ensure product quality consistency. Ensuring the packaging quality requirements as per FritoLay/ PepsiCo standards & minimize packaging defect generation. Coordinating for FSSAI license and ensuring the compliance. Implementing GMP, GHK systems across plant. Implementing food safety systems like HACCP, AIB with best in class AIB score. Implementing Quality pillar activities under TPM. Coordination with R&D for NPD trials and Corporate Purchase, Vendors. Managing water treatment plant , optimize water usage & hazardous waste management of WTP. Contributing towards effectiveness of own department : Providing training to associates on GMP, GHK and improving skill level of associates. Coaching and motivating the team. Participating actively in team meetings to analyze short falls, problems, concern areas with others and developing action plans. Implementing Corrective and Preventive action plan & debottleneck. Leading the team in developing the AOP & managing quality budget. Qualifications Skill/Experience: Graduation / Post graduation in Food / Dairy Technology with 8 /10 years’ experience in Quality function in FMCG manufacturing units. Having sound knowledge of ISO systems, AIB, HACCP, FSSAI.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}