{
    "Job ID": "69857165",
    "Description": "Overview In this role, you will be working closely with global capability leaders and service delivery teams to spearhead continuous improvement for the assigned portfolio. This will be achieved through various strategies such as standardization, simplification, optimization, and automation. Responsibilities Leading high-impact projects and initiatives to deliver business impact and productivity. Driving process improvement through simplification, standardization, optimization, and automation. Conducting workshops to perform diagnostics and process assessments. Communicating the captured value to stakeholders in line with the Value Realization Framework. Owning and deploying operational excellence metrics. Implementing a proactive issue tracking and resolution system and governance mechanism. Fostering a culture of continuous improvement through ideation and management of a robust Continuous Improvement (CI) pipeline. Mentoring and guiding improvement ideas and projects. Conducting training sessions on continuous improvement and problem-solving tools and techniques. Qualifications A minimum of 7-9 years of overall experience, with preferred domain experience in Commercial Sales or Consumer Packaged Goods (CPG) vertical. Certification as a LEAN Six Sigma Black Belt from a leading institute or organization, having completed 2-3 Black Belt projects using DMAIC, LEAN, BPMS, Re-engineering, or Design Thinking. Alternatively, someone who is trained and tested as a Six Sigma Black Belt and has completed 2-3 Black Belt projects using any of the methodologies mentioned above. Proficiency in problem-solving using data and process analysis. Experience in leading Value Stream Mapping workshops. Familiarity with Robotic Process Automation (RPA) and data analysis tools. Strong stakeholder management, program management, and facilitation skills. Exposure to Design Thinking. Willingness to take up new and complex projects and initiatives. Experience in conducting training sessions on LEAN, Six Sigma, problem-solving tools, and techniques. Experience in acting as a coach or mentor to delivery leaders and managers in driving process improvement projects and ideas.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}