{"Job ID": "69859157", "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Consultant Specialist.In this role you will:Provide three tier (L1, L2, L3) support to all applications and provide assistance to all end users.\nProactively identify any issues in production via automated monitoring, history of production issues and trends.Maintain schedule jobs and perform troubleshoot on processes.\nProvide training to various onshore and offshore associates and assist with expert knowledge on all production processes.                   \nDocument all production applications and resolve all application issues and answer all requests. \nMonitor all performance metrics for various production systems and identify root cause for all technical issues and recommend solutions.\nAnalyze all applications and recommend necessary upgrades and patches and perform troubleshoot on all issues.\nMaintain effective relationships with various system administrators and development teams.\nParticipate in periodic meetings and maintain all applications for productions and plan appropriate various strategies.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}