{
    "Job ID": "69856907",
    "Description": "AtkinsRéalishas an exciting full-time career opportunity for a highly skilled and dedicated HSE Engineer (Saudi National) to join our team based in Al Ula, Saudi Arabia. The HSE Engineer will be responsible for overseeing all Health, Safety, and Environmental aspects of the project to ensure compliance with relevant regulations, best practices, and company policies. This is a critical role that contributes to the successful and safe execution of the project.Key Responsibilities:Develop and implement the project's Health, Safety, and Environmental (HSE) management plans, policies, and procedures in alignment with local regulations and international standards.\nConduct thorough risk assessments and hazard identification for all project activities, facilities, and processes. Recommend appropriate control measures to minimize potential risks and improve safety performance.\nMonitor and evaluate HSE performance metrics and trends, identifying areas for improvement and implementing proactive measures to enhance safety outcomes.\nConduct regular inspections, audits, and site visits to ensure compliance with HSE standards, identifying non-conformances, and providing recommendations for corrective actions.\nCoordinate and facilitate HSE training programs for project personnel, contractors, and other stakeholders to promote a strong safety culture and awareness of HSE practices.\nReview and approve contractor HSE plans, ensuring their adherence to project requirements and standards.\nCollaborate with various project teams to integrate HSE considerations into the planning, design, and execution phases of the project.\nInvestigate incidents, accidents, and near-miss events promptly, identifying root causes and implementing measures to prevent reoccurrence.\nAdvise project management on HSE-related matters, providing recommendations to maintain high levels of safety and environmental sustainability throughout the project's lifecycle.\nCoordinate with relevant authorities and agencies to ensure compliance with local HSE regulations and obtain necessary permits and licenses.\nSupport emergency response planning and drills, ensuring all personnel are adequately trained and prepared to handle potential emergency situations effectively.\nPrepare regular HSE reports for project management, stakeholders, and client, highlighting key performance indicators and progress towards HSE objectives.\nParticipate in project meetings and provide input on HSE matters.\nEnsure that HSE documentation is maintained and up to date.\nMonitor and report on HSE performance, including leading and lagging indicators.\nProvide technical guidance and support to project teams on HSE matters.\nEnsure that all incidents and near-misses are reported, investigated, and documented in accordance with project procedures.Qualifications and Experience:Generally, you will have a minimum 8 years of experience and with proven knowledge as an HSE Engineer or similar role in large-scale construction projects\nBachelor's degree in engineering, Environmental Science, Occupational Health, or a related field.\nProfessional certifications in HSE management (e.g., NEBOSH IGC, IOSH, OSHA) are mandatory, and It is preferred that candidates have professional HSE certification (CHMM, CSP, ARM, etc.).\nIn-depth knowledge of local HSE regulations, international standards (ISO 45001, ISO 14001), and industry best practices.\nStrong analytical skills and the ability to conduct risk assessments and incident investigations effectively.\nExcellent communication and interpersonal skills to interact with diverse project teams, contractors, and stakeholders.\nAbility to implement and manage HSE management systems and drive continuous improvement initiatives.\nAbility to work in a fast-paced environment and manage multiple priorities.\nProficient in using HSE software tools and applications.\nWillingness to travel to project sites as needed.\nFluency in English is required; knowledge of Arabic is an advantage.About AtkinsRéalis Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data, and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}