{"Job ID": "69857026", "Description": "Charterhouse are presently overseeing a search for an International Trading client, within the dry bulk sector, whom are in the process of looking to recruit a Freight Analyst to join their regional team based in Dubai.\nAbout the role\nThis Analyst, joining an existing Freight & Shipping team, will take on the responsibility of overseeing all areas of market analysis, operational processes and any financial analysis, to support both their own shipping business and that provided within the open market.\nThe specifics of this role also involve the tracking of vessels, cargos and routing, to ensure effective and efficient operational freight execution and the delivery of commodity, aligned to customer obligations within the contractual framework.\nThis role is also heavily geared towards the research aspects of the market and sector and designed to allow for a robust and proactive business model, covering all freight operations and partners, to ensure strong external partnerships along with an internally robust commercial strategy and freight deployment plan.\nAbout you\nThe client is looking to recruit a formally qualified Analyst, with either a finance or logistics-based background, whom can demonstrate up to five years of experience within a commodity trading and dry bulk business.\nThe nuances and understandings of dry bulk products, along with an understanding of global supply routes, market dynamics and variables are key aspects within this role; whereby an advisory and commercial understanding can be leveraged-off to ensure accurate reporting, analysis and the documentation chain for reporting purposes.\nIn conjunction, this role requires a candidate whom is able to introduce new concepts, modelling or research criterion and in turn the facilitation of any policy review, operational processes or reporting procedures, to enhance the overall effectiveness of this freight entity.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}