{"Job ID": "69858263", "Description": "Secondary PE Teacher - Qatar, ASAP 2023Location: Ain Khaled (Just outside Doha), QatarCurriculum: UK\nAccommodation: Single\nExperience Required: Two years +\nContract: 2 yearsAn experienced PE Teacher is required to work at a British international co-educational school of an outstanding standard and reputation in Qatar. The school is truly international in nature and caters for an international mix of eager and academic children, with over 84 nationalities from all over the world. The school occupies an impressive and generous campus teeming with every available resource and state of the art technology.The school beckons an international mix of teachers to reflect its student profile and its student centred approach to teaching and learning. Newly qualified teachers are welcome to apply and induction can be supported.Teachers must have an excellent command of the English language, offer experience of ideally 2 consistent years, and ideally present a background of delivery within the UK curriculum. The school beckons an international mix of teachers to reflect its student profile and its student centred approach to teaching and learning. You should have a degree and/or PGCE qualification in order to secure a visa.Location Overview:Qatar is the new place in the region replicating Dubai's development but carefully preserving a unique heritage. Being smaller there is a closer expatriate community boasting a dazzling array of sporting activities and clubs, not to mention the cosmopolitan life style a modern emerging city can offer.Package:\nTax free monthly salary\nFurnished accommodation with paid utilities\nSchool fee discounts for dependents\nAnnual flight allowance\nMedical insurance\nEnd of service gratuityJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Primary, Prep, & Secondary School", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}