{
    "Job ID": "69859206",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Java Developer.In this role, you will:Expect to work with any global team on collaborative projects that advances aspects of their team’s software development lifecycle. \nThey will own and lead problem high value business opportunities that is enabled by a transformative technical solution, asking thoughtful questions to understand the problem space, and working together with the team to architect the solution, pair and review code and measure tangible benefits.\nWork with teams to improve their software development methodology to maximize the number of teams across Equities & Securities Financing that release code in “DevOps” way, hosting and reviewing the DevOps change accreditation process. \nWork with the rest of the team to build and advance tooling that helps to achieve the mandate of owning your own infrastructure and enabling more “full stack” engineering and in-house software capability. \n·      Identify and lead opportunities for improvement and communicate widely across all global teams on the latest developments that will help Equities & Securities Financing achieve its objectives of being a high-performing technology division to support competitive business performance.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}