{
    "Job ID": "69858601",
    "Description": "Position titleETL Developer /Senior Software EngineerYears of Experience5-8 yearsLocation - GurgaonDepartment - Business IntelligenceShift Timings - 2:00PM to 11:00PM ISTDepartment overviewJoin our Winning Team as a Data Integration SpecialistWhen was the last time you bragged about where you work? At CARFAX, we do it every day. Why? Because we’re proud to work for a company with a strong mission and trusted brand. We’re proud to work with people who care about what they do and work hard every day to deliver their best. We’ve created the type of company culture where the term, “work- hard play- hard” is taken to new heights. Even today, while working remotely, our culture is strong and our team is connected!Position summaryAs a Data Integration Specialist on the Business Intelligence (BI) team you will help provide trusted reporting, data, and analytics for CARFAX to demonstrate value across business channels, assess product performance to influence direction, support internal business operations, and external customer facing products. You’ll play a key role in BI DevSecOps team to ensure data processes meet expected quality standards and SLAs.What You'll DoCollaborate with product managers, BI Reporting Specialists, and other project stakeholders to understand data/ reporting requirements and goals.\nPerform data analysis to check requirements feasibility. Share data findings with project stakeholders to make appropriate project decisions.\nCollaborate with Architect and other BI team members to design optimal data pipelines. Translate business requirements into technical specification, including source to target mappings (STTM).\nFollow STTMs and design guidelines to develop and test efficient ETL solutions using Informatica or external programming/ scripting languages, if necessary.\nIdentify and reuse ETL components and services to avoid duplicative implementations\nIntegrate ETL routines into production job streams\nMonitor and support daily data load jobs to ensure timely completion.\nAddress all data load warnings or errors. Take appropriate actions to independently resolve data load issues. Proactively communicate external team dependencies to US based BI team and source data owners.What You Need to Get the Job DoneEducation level: Bachelors in Information technology, Computer Science or equivalent experience.\nYear of Experience: 5 to 8years\nSpecific skills:Strong SQL and PL/SQL skills\nExperience in developing complex ETL mappings, workflows, mapplets in Informatica Cloud (IICS/IDMC)\nExperience using Informatica Power Centre Designer, Workflow Manager, Workflow Monitor, and Repository\nExperience in unit testing and troubleshooting of ETL jobs\nSignificant experience optimizing ETL routines and environments\nExperience working on Redshift and other AWS tools/ tech.    \nAbility to work effectively in a rapidly changing, team-based environment\nExcellent Communication and collaboration skills with business and technical teamsPreferred skills:Experience in Agile methodology\nExperience with Data Lake highly preferred.\nExperience scheduling jobs using Control-MPersonal characteristics\nCarfax prefers collaboration over video conference. Candidate should be comfortable with the same.\nCertifications etc\nInformatica or other ETL tools\nSQL certifications-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}