{"Job ID": "69856798", "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Job Description:As a Business Change Manager in the field of engineering and digital, your role would involve managing and facilitating the process of implementing changes within an organization's corporate, engineering and digital systems. Responsibilities:1. Develop and implement change management strategies and plans to ensure successful adoption of engineering and digital initiatives.2. Collaborate with cross-functional teams, including engineers, project managers, and business stakeholders, to identify and understand the impact of proposed changes3. Conduct thorough assessments of organizational readiness and potential risks associated with the proposed changes.4. Design and deliver change management activities, such as training programs, workshops, and communication plans, to facilitate a smooth transition and user adoption.5. Provide guidance and support to teams throughout the change process, addressing concerns, resolving issues, and ensuring effective change execution.6. Monitor and evaluate the effectiveness of change initiatives, collecting feedback and implementing adjustments as necessary.7. Foster a culture of continuous improvement by promoting best practices, innovation, and knowledge sharing within the engineering and digital teams.Qualifications:1. Bachelor's degree in engineering, computer science, or a related field. A master's degree or certification in change management is a plus.2. Proven experience in change management, preferably in an engineering or digital environment.3. Strong understanding of engineering and digital systems, processes, and technologies.4. Excellent communication and interpersonal skills to effectively engage with stakeholders at all levels.5. Ability to analyze complex situations, identify potential challenges, and develop creative solutions.6. Proficiency in project management methodologies and tools to track progress and manage timelines.7. Familiarity with Agile or Lean methodologies is advantageous.8. Ability to adapt to a fast-paced and dynamic work environment, handling multiple projects simultaneously.Rewards & BenefitsWe offer an excellent package which includes:Competitive salary\n\nTransportation allowance\n\nAnnual leave\n\nMedical insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Assistance Program – 24-hour free advice on financial, legal, and family care specialists and access to personal health, fitness, and nutrition consultants.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}