{
    "Job ID": "69857592",
    "Description": "Search JobsJob DescriptionWhy will you enjoy this new opportunity?We are looking for an experienced Security Corporate Account Manager to join our Security Sales Team. You will bring passion, drive and a genuine customer first approach to help our commercial customers and company’s expansion in the region.This is a career changing opportunity due to the visibility of the role within VMware Carbon Black. Security is a top priority for companies and each customer will bring a variety of challenges and opportunities, demanding all of your skills and experience.You will participate in the growth of an exciting, fast-paced company. If you are up for the challenge, we are interested in connecting.Success in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?Making an impact early at VMware relies on 3 core elements.  Establishing relationships with colleagues, customers and partners; building solid knowledge and understanding of our Security technologies and navigating the sales processes and best practices within our teams.As the face of the business to our customers success will come from great communication skills, effective planning and delivery, and a relentless curiosity for learning and application.You will be managing customer opportunities from day one, in collaboration with your virtual team, and be expected to build and sustain a pipeline of business across customer accounts.  By the end of your first 12 months at VMware you should have established a significant presence and impact with both your customers and the colleagues with whom you workThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?You will work with the Enterprise Account Managers in Saudi Arabia and support them in selling Security solutions leveraging established account presence and relationships.\nYou will develop and execute a clear account strategy for major accounts and opportunities. It will be important to establish and manage relationships with key decision makers (typically at CIO and CSO level) and key channel partners such as Resellers, Incident Response firms and MSSPs.\nWorking cooperatively with Marketing to drive demand generation programs and drive engagement of target prospects.\nAs part of your tasks, you will be expected to deliver high standard of territory management practice including opportunity management, pipeline development and performance reporting using Salesforce.com.\nInternally, you will work closely with the Solution Engineering team to manage demonstration and evaluation activities.What is the leadership like for this role? What is the structure and culture of the team like?The hiring manager for this role is Jean-Charles Labbat, Regional Sales Director Security, SEMEA. He leads a team of security sales specialist across SEMEA supported by a team of Solutions Engineers.This team covers all South Europe, Middle East, Turkey and North Africa region and VMware enterprise and global customers. In this team we all learn from each other: best practice sharing is the way to improve and be successful.Required Skills:5+ years of sales experience selling security software and/or infrastructure products to corporate enterprises in Saudi Arabia\n\nDemonstrated history of exceeding booking and revenue targets; quota carrying\n\nProven experience developing relationships with senior executives\n\nBA/BS or equivalent combination of education and experienceA Nice To Have:An understanding of Endpoint security suites,\n\nAn appetite for prospection and new logos,\n\nProven persuasion & negotiation skills,\n\nAbility to network & prospect across large enterprise accounts,\n\nAbility to conduct in depth sales presentations including product demonstrations that highlight key benefits, return on investment and the value of our solution & services; deck building and delivery\n\nSales Force & LinkedIn expertiseWhat are the benefits and perks of working at VMware?You and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.Medical Coverage, Retirement, and Parental Leave Plans for All Family Types\n\nGenerous Time Off Programs\n\n40 hours of paid time to volunteer in your community\n\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\n\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\n\nWellness reimbursement and online fitness and wellbeing classesVMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Search JobsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}