{
    "Job ID": "69856795",
    "Description": "SNC-Lavalin’s Atkins Business is hiring an experienced Junior Information Manager UAE National based in Dubai for our Middle east delivery team. This person will be carrying out a mix of functions to support project delivery. The successful candidate should be a people, process, technology focused individual whose job will be to ensure our project delivery teams adhere to standards and the best industry methods.Education And ExperienceBachelor’s degree in architectural or civil engineering or equivalent technical discipline and 5+ years’ experience in AEC industry.\n\nExperience in digital delivery of complex, multidisciplinary project is essential for this role.Key Skill RequirementsA thorough understanding of the data, information management and BIM including compliance to ISO 19650 standards.\n\nSound knowledge in engineering design and to assist design team in Self/Inter disciplinary services coordination, quality compliance etc.\n\nExpert knowledge of BIM authoring tools such as Revit, Civil3D in delivery of multi-disciplinary projects.\n\nExpert knowledge of BIM federation and co-ordination platforms such as Navisworks, BIM Track for performing tasks like clash detection and resolution, model walkthrough and issue tracking and management.\n\nExpert knowledge of Common Data Environment (CDE) such as BIM360 and ProjectWise.\n\nEffective communication, coordination and collaboration skills.Job DutiesAs a Junior Information Manager, you will be responsible for ensuring that our digital content is produced, stored, shared and exploited using the latest technologies and practices.\n\nSupport the Information Manager in all required tasks to ensure timely and compliant project delivery e.g. BEP development, model federation, Level Of Information Need, responsibility matrix etc.\n\nAdminister Atkins’ MIDP Online Tool.\n\nCo-administer Atkins’ CDE (BIM 360) and support project team in utilization of CDE.\n\nPerform multidisciplinary clash detection, identification, grouping and support in assignment and resolution of clashes.\n\nUndertake the functions of effective information management as part of the team in accordance to ISO 19650 throughout our projects' lifecycles, where Atkins are either the Lead Appointed Party or an Appointed Party.\n\nEnsure that the following are properly implemented and applied by the delivery team:\n\nBIM execution plan\n\nInformation Exchange Processes\n\nSelf-disciplinary co-ordination workflows including clash matrixes\n\nCheck and review processes (both technical and quality) for deliverables utilizing digital tools\n\nFile naming convention for deliverables and process for updating status and revision codes in compliance with ISO 19650\n\nLOD / LOI to be generated in BIM Models across stages in the project lifecycle\n\nSupport auditing task teams in the delivery of their Task Information Delivery Plans, to meet the Appointing Parties Requirements.Desirable SkillsKnowledge of data visualization platforms such as PowerBI, Tableau\n\nExperience regarding information management/BIM uses such as construction sequencing, quantity take-offs, virtual reality, augmented reality etc.\n\nKnowledge of automation tools such as Dynamo.Rewards & Benefits We offer an excellent package which includes:Competitive salary\n\nTransportation allowance\n\nAnnual leave\n\nMedical insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Assistance Program – 24-hour free advice on financial, legal, and family care specialists and access to personal health, fitness and nutrition consultants.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}