{
    "Job ID": "69857129",
    "Description": "We are looking for a Patient Journey Partner (Diagnosis) to join our HCP Engagement Chapter from Ankara / İstanbul. Who is the Patient Journey Partner?●The Patient Journey Partner (Diagnosis) role focuses on a patient journey for a deeper understanding of the needs of the non-prescriber stakeholders in the oncology patient journey in order to ensure that the patients are: rapidly and accurately diagnosed at the earliest possible stage of disease with proper tools and solutions \nreferred to the medical oncologist/MDT for innovative treatment consideration prior to treatment/surgery initiation●The PJP (Diagnosis) is an empowered leader. She or he partners closely with the relevant stakeholders in a given therapeutic or disease area, gaining a deep understanding of their needs in order to connect Roche’s capabilities to co-create meaningful solutions.●The PJP (Diagnosis) works in close collaboration with other customer-facing roles, such as Patient Journey Partner (PJP), Health System Partner (HSP), and Transformative Partner (TP). It is a shared responsibility of this group to align priorities for each of the shared accounts and stakeholders, prioritize jointly, and support each other in delivering Triple Value - win-win activities that combine value for patients, value for the ecosystem, and value for Roche.●This role is locally embedded in the ecosystem, working as a function-agnostic role and without the responsibility to tell and sell promotions and commercial targets. It has no profitability, sales objectives, or incentives.Responsibilities:●The PJP (Diagnosis) is a senior-level role within the affiliate, who has decision-making authority to request resources from Roche based on the current DoA of Roche Turkey (both within the affiliate and broader network) in order to have an improved impact on the patient journey●The PJP (Diagnosis) focuses on the importance of bringing the outside in, working with partners to uncover all potential opportunities to transform outcomes for patients, faster. They also bring the inside out, to bring Roche expertise, science, and knowledge to the ecosystem.● Acts as a trusted partner and is the primary (but non-exclusive) point of contact between relevant stakeholders and Roche; the PJP shares the patient and stakeholder community needs internally, prioritizes and secures resources, and drives solutions that deliver outcomes faster.● Partners with patient journey stakeholders to remove roadblocks and unlock possibilities to deliver value for patients and the community.●By overseeing the patient journey in its entirety in collaboration with PJPs, the PJP (Diagnosis) acts as a system thinker with the ability to identify shared purpose among stakeholders and leverages this to co-create solutions with internal and external stakeholders in the ecosystem.● The role, along with other customer-facing team members, is empowered to pull in expertise and resources locally and from the network, as needed to co-create meaningful solutions solving customer needs.●Ensuring great experiences whenever stakeholders in the ecosystem engage with Roche employees, products, and services.●He/she reports directly to the Marketing and Customer Engagement Chapter Head.  Skills and Experience:● System thinker and deep listener● Excellent stakeholder engagement skills● Experience leading a cross-functional team is required. Experience in both formulating cross-functional strategies and orchestrating cross-functional teams is highly desired.● Strong business acumen with desired expertise in commercialization, medical, and customer experience excellence● Able to understand and leverage digital means and tools is desired.● Deep experience in agile ways of working is desired● Fluent in the local language● Proficient in English to collaborate internally across the broader Roche enterprise is highly desiredKnowledge:● Deep understanding of patient journey(s) and related treatments in defined disease area(s), enabling engagement at the specialist level.● Broad understanding of Roche’s present portfolio and future pipeline, such that they can work on future-based solutions● Robust understanding of medical affairs strategies and tactics including clinical researchPreferred Qualifications:● University degree (scientific, economic, or business degree). An advanced degree in Life science and/or MBA  is a plus.● Practical understanding of digital innovation methodologiesMindset & Behavior:A PJP demonstrates personal purpose around improving the patient journey, as well as a strong passion to create value and impact on the ecosystem. They think from an Enterprise level, beyond boundaries and borders, in order to bring the best possible outcomes to both the local health environment and more broadly, across Roche globally.At Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}