{
    "Job ID": "69858800",
    "Description": "BackgroundUnder the guidance and supervision of the Operations Manager and direct supervisor, the Driver provides reliable and safe driving services to UNDP RR/ UN RC and other high-ranking UN officials and visitors, ensuring the highest standards of discretion and integrity, a sense of responsibility, excellent knowledge of protocol and security issues. The Driver also demonstrates a client-oriented approach, courtesy, tact, and ability to work with people of different national and cultural backgrounds.\nUpon request of the supervisor, the Driver can also be required to provide driving services to the operations and programme staff in the CO, Consultants, and Experts, and UN staff on mission.\nUnder the guidance and supervision of the Operations Manager, Administrative Associate and/or other direct supervisor, the Driver provides reliable and safe driving services ensuring high accuracy of work. The Driver demonstrates a client-oriented approach, high sense of responsibility, courtesy, tact and the ability to work with people of different national and cultural backgrounds.\nThe Driver provides driving services to Country Office management, operations and programme staff, consultants and experts, and UN staff on mission.\nUNDP adopts a portfolio approach to accommodate changing business needs and leverage linkages across interventions to achieve its strategic goals. Therefore, UNDP personnel are expected to work across units, functions, teams, and projects in multidisciplinary teams in order to enhance and enable horizontal collaboration.Duties and ResponsibilitiesProvide reliable and secure driving services using office vehicle for Country Office to programmes and operations staff, experts and consultants, and UN officials and visitors.\nTransport authorized personnel. \nDeliver and collect mail and documents; and perform other messenger responsibilities. \nMeet official personnel and visitors at the airport and assist with visa and customs formalities arrangement when required.\nEnsure cost-saving through proper use and day-to-day maintenance of the assigned office vehicle. \nMaintain accurate daily vehicle logs.\nProvide inputs to preparation of the vehicle maintenance plans and reports. \nMake timely minor repairs and/or arrange for major repairs\nEnsure timely changes of oil, check of tires, brakes, car washing, etc. \nEnsure availability in the assigned vehicle of all the required documents, supplies and necessary spare parts.\nKeep current in vehicle documents such as vehicle insurance, vehicle logs, office directory, and map of the city/country. \nEnsure vehicle first aid kit is adequately stocked with standard medical supplies.\n. Take all immediate actions required by rules, regulations, and laws in case of involvement in accidents.\nPerform other duties within incumbent’s functional profile as assigned and deemed necessary for the efficient functioning of the office and Organization.\nAdditional duties may include assisting with pouch, procurement, workshops, and other administrative tasks.CompetenciesCoreAchieve Results\nLEVEL 1: Plans and monitors own work, pays attention to details, delivers quality work by deadline. \nThink Innovatively\nLEVEL 1: Open to creative ideas/known risks, is pragmatic problem solver, makes improvements. \nLearn Continuously\nLEVEL 1: Open minded and curious, shares knowledge, learns from mistakes, asks for feedback. \nAdapt with Agility \nLEVEL 1: Adapts to change, constructively handles ambiguity/uncertainty, is flexible. \nAct with Determination         LEVEL 1: Shows drive and motivation, able to deliver calmly in face of adversity, confident\nEngage and Partner\nLEVEL 1: Demonstrates compassion/understanding towards others, forms positive relationships. \nEnable Diversity and Inclusion\nLEVEL 1: Appreciates/respects differences, aware of unconscious bias, confronts discriminationCross-Functional & Technical competencies Administration & Operations             \nVehicle management     \nKnowledge of policy & procedures on fleet management\nAdministration & Operations             \nRegistry & correspondence management             \nAbility to collect, register, maintain and deliver mail and UNDP pouch; ability to manage archives\nBusiness Management          \nCommunication\nAbility to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and choose communication methods depending on the audience\nEthics           \nUN Policy Ethics\nKnowledge and understanding of the UN Staff Regulations and Rules and other policies relating to ethics and integrity.\nBusiness Management           \nCustomer Satisfaction/Client Management          \nAbility to respond timely and appropriately with a sense of urgency, provide consistent solutions, and deliver timely and quality results and/or solutions to fulfil and understand the real customers' needs. \nProvide inputs to the development of customer service strategy. \nLook for ways to add value beyond clients' immediate requests. \nAbility to anticipate client's upcoming needs and concerns.Required Skills and ExperienceEducationSecondary Education with a valid driver’s license is required. Experience, Knowledge, and Skills•            A minimum of 2 years (with a high school diploma) of relevant work experience as a driver with a safe driving record is required. •            Knowledge of driving regulations, rules, and laws, and skills in minor vehicle repair and maintenance.•            Experience in using computers and relevant office software packages (MS Word, Excel, etc.) and using web-based management and electronic log, file, and/or scheduling systems.Language Requirements•            Fluency in Arabic at the duty station is required.•            Fluency in English is desired.DisclaimerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}