{
    "Job ID": "69858121",
    "Description": "Amazon is seeking a Tax Analyst – US Outbound/International candidate to join the Tax Team in India. The candidate will focus on US international income tax reporting and compliance (including 5471s/8858s, elections, disclosure statements, foreign tax credit calculations etc.) and the international aspects of the US GAAP worldwide income tax provision based in Hyderabad, India. Additionally, this position will be responsible for researching and modeling potential tax legislation. This position will also be responsible for supporting the US and international tax controversy teams on audits and the international tax team on the compliance and reporting aspects of projects.\nPrimary job duties include:\n· Drive process improvements and coordinate with Tax Technology Team to facilitate streamlining and automation of recurring calculations\n· Primarily responsible for US International reporting and compliance obligations (CbC reporting, Forms 5471, 8858, 8865, disclosure statements, Form 1120F etc.)\n· Prepare Subpart F, E&P, tax pools and foreign tax credits calculations\n· Prepare time sensitive elections (Form 8832, 8023, etc.)\n· Create and develop complex excel spreadsheet models\n· Research and understand potential tax legislation and participate in modeling different scenarios\n· Prepare or review international aspects of Amazon’s worldwide provision\n· Researching effects of various international transactions\n· Support US and international tax controversy teams on tax audits\n· Coordinate with outside service providers\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- Bachelor's degree\n- Knowledge of Microsoft Office products and applications at an advanced level\n- Experience working in a large public accounting firm or multi-national corporate tax department\n- - CPA preferred\n- - JD, MST, LLM desirable\n- - Knowledge of Cbc Reporting, federal income taxation of international transactions\n- - Experience working in a large public accounting firm or multi-national corporate tax department\n- - project management skills\n- - tax operational background and ability to drive process improvements\n- - Hard working, quick learner with a positive ''can do'' attitude and solid professionalism\n- - Tax preparation software experience helpful to aid in review (Corptax international tax compliance software)\n- - Experience with Essbase and Oracle Financial Applications helpfulJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}