{"Job ID": "69857657", "Description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.We welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!Job DescriptionSummaryThis position is an IT SAP Engineer that will operate in an Agile environment in the Demand to Deliver - Manufacturing capability lane focused on developing solutions in the supply chain management and manufacturing space. This position collaborates with the business along with technical engineers in the design and delivery of business solutions.  This position requires knowledge of SAP MM, WM and PP and related functionality. This position is expected to provide supply chain solution thought leadership, primarily within SAP initially, and bridge the gap between functional and technical specifications. Preferred Qualifications:Experience in systems development lifecycleWorking knowledge and configuration experience in SAP PP, IM, and WMExperience with Agile development methodologiesExperience in SAP ECC, APO, WM, IMUnderstanding of manufacturing environment and conceptsDemonstrated experience integrating SAP and third-party applications.Intellectual curiosity and the ability to question thought partners across functional areas.Ability to adapt quickly to new technologies and changing business requirements.Solid problem-solving skills, attention to detail, and critical thinking abilitiesExcellent understanding of business complexity and project interdependenciesAbility to partner with multiple stakeholders and influence project decisions.Strong teamwork, customer service and organizational skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}