{
    "Job ID": "69856895",
    "Description": "We are looking for a Sustainability Consultant based in Dubai to work with our Building Design Group.Position Summary:We are seeking a highly motivated and skilled Sustainability Consultant to join our Building Design Group. As a Sustainability Consultant you will play a crucial role in driving sustainability within the design and construction process of our buildings and places projects. Your primary responsibility will be to coordinate with other disciplines and integrate sustainable practices and technologies into our projects. You will work closely with architects, engineers, and project managers to ensure that our buildings and places are designed and constructed in an environmentally responsible and energy-efficient manner.Responsibilities:Sustainable Design IntegrationCollaborate with architects and engineers to integrate sustainable design principles into building projects.\n\nConduct analyses and simulations to evaluate the environmental performance and energy efficiency of building designs.\n\nProvide guidance and recommendations on sustainable design strategies, technologies, and materials.Coordination with DisciplinesCoordinate with various disciplines, including architects, building services engineers, structural engineers and other specialists, to ensure seamless integration of sustainable design elements into projects.\n\nCollaborate with the project team to develop comprehensive sustainability strategies and goals for each project.\n\nFacilitate interdisciplinary meetings and discussions to address sustainability-related challenges and opportunities.Energy Efficiency and Renewable EnergyIdentify opportunities to optimize energy efficiency in building systems.\n\nConduct modeling and analysis to evaluate the performance of building systems and propose energy-saving measures.\n\nAssess the feasibility and potential benefits of incorporating renewable energy systems into building designs.Sustainable Material SelectionResearch and recommend sustainable materials and products that align with project goals and objectives.\n\nAssess the environmental impacts of construction materials and evaluate alternatives to minimize resource depletion and waste generation.\n\nCollaborate with suppliers and manufacturers to source eco-friendly materials and products.Environmental Performance EvaluationDevelop and implement monitoring and evaluation plans to measure the environmental performance and sustainability outcomes of completed projects.\n\nAnalyze and report on energy consumption, water usage, waste generation, and other relevant metrics.\n\nIdentify areas for improvement and propose strategies to enhance the sustainability performance of our buildings.QualificationsBachelor's or Master's degree in Engineering, Sustainability, Environmental Science, or a related field.\n\nPrevious experience working in sustainability, green building design, or a related role.\n\nStrong knowledge of sustainable design principles, green building standards (e.g., LEED, BREEAM), and energy codes/regulations.\n\nFamiliarity with renewable energy systems, energy-efficient building systems, and sustainable construction practices.\n\nExcellent analytical and problem-solving skills with the ability to conduct data analysis and interpret results.\n\nEffective communication and collaboration skills to work with cross-functional teams and stakeholders.\n\nStrong project management abilities to manage multiple tasks and meet deadlines.SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programme.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includesA competitive salary\n\nTransportation allowance\n\n22 calendar days annual leave (based on 5 days working a week)\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment byHaving clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented\n\nComplying with the relevant employment legislation and codes of practice\n\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect\n\nEnsuring that the workplace is an environment free from discrimination, harassment, victimization and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement\n\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}