{
    "Job ID": "69856814",
    "Description": "Job DescriptionSNC Lavalin's Program Advisory Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.To implement all aspects of the quality management systems and control site supervision activities provision related to ICT, Security and Audio Visual Works across the project, to deliver quality installations in accordance with the contract documents, relevant international standards and local authorities’ requirements.Responsibilities Lead ICTS EngineerResponsible for site implementation of IT, Telecom, Security system (Access control, CCTV, Intercom, Gate barrier), Audio Visual system (Digital signage, IPTV, Meeting room/Training room requirement, Public Address and Background Music) and Guest Room Management system services as per project requirement.\nImplement the site supervision quality procedures, and review submission requirements of the project, along with the MEP and ICT&S contractor.\nReview all construction documents and highlight any design and contractual discrepancies with the concerned RE / SHOE.\nEnsure that all statutory authority NOC’s / permits / design approvals are available on site for construction.\nEnsure that the main contractor and nominated ICT&S contractor coordinate with all concerned authorities departments and ensure that their requirements are adequately and satisfactorily incorporated.\nExtend the maximum possible effort to avoid contractor(s) claims for cost and/or delay.\nPrepare process control sheet for ICT, Security and AV works in conjunction with SHOE during the Enabling Works / Main Contract Works.\nReview and forward any comments on all submittals including contractor design drawings, shop drawings, materials and alternative proposals submitted by contractors.\nConduct regular (daily) site visits and supervise, certify the installation of ICT&S related services ensuring compliance with the contract documents.\nReview and forward any comments on the contractor’s method statement for installation, execution of the works.Rewards and BenefitsWe offer an excellent package which includes:A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ abilityJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}