{
    "Job ID": "69859122",
    "Description": "At Cepheid, we are passionate about improving health care through fast, accurate diagnostic testing. Our mission drives us, every moment of every day, as we develop scalable, groundbreaking solutions to solve the world’s most complex health challenges. Our associates are involved in every stage of molecular diagnostics, from ideation to development and delivery of testing advancements that improve patient outcomes across a range of settings. As a member of our team, you can make an immediate, measurable impact on a global scale, within an environment that fosters career growth and development.Cepheid is proud to work alongside a community of six fellow Diagnostics Companies at Danaher. Together, we’re working at the pace of change to improve patient lives with diagnostic tools that address the world’s biggest health challenges. ESSENTIAL JOB RESPONSIBILITIES:Investigate and resolve customer complaints within the region\nEngage customers to collect and compile detailed information about customer complaints\nConduct advanced data analysis and troubleshooting, understanding customer sample collection, processing and laboratory practices\nDocument complaints and resulting investigations in the complaint management system\nInterface with Service and Global Product Support to escalate and resolve more complex cases\nConduct Periodic Field visits to Customer sites to engage and resolve pending complaints and provide training if necessary\nAdhere to Quality Management System procedures\nMaintain product knowledge and support continuous improvement efforts\nContribute to quality compliance through accurate and concise case documentation\nRepresent Technical Support on projects and operational teams, communicating findings back to Technical Support\nComplete all assigned and required training satisfactorily and on time\nPerforms additional tasks as assigned by the Customer Care and Technical Support Manager or SupervisorTRAINING RESPONSIBILITIES: (REQUIRED)Complete all assigned and required training satisfactorily and on timeMINIMUM REQUIREMENTS:Education and Experience (in years):B.S diploma (or equivalent) in Clinical Laboratory Science or Biomedical Engineering with 2-3 years of relevant experience as Biomedical Engineer, Virology/Microbiological Laboratory Technician or Clinical Laboratory Scientist for Virology/Microbiology in a hospital or commercial clinical laboratory or in Technical SupportKnowledge and skills:Fluent in English & Urdu (written and oral) is required\nCustomer oriented – understands customer expectations and empathizes with customer & patient needsLaboratory or Technical Support Experience in one or more of the following preferred:\nPCR and Microbiology, Molecular Biology Oncology or Virology\nPatient sample collection practices and workflow\nSample preparation practices and methodologies\nLaboratory analytical diagnostic equipment, medical devices and software\nKnowledge and use of commercial computer application packages (MS Office)\nFamiliarity with SalesForce.com (or similar CRM System) a plus\nLaboratory or Technical Support Experience in one or more of the following preferred:\nPCR and Microbiology, Molecular Biology Oncology or Virology\nPatient sample collection practices and workflow\nSample preparation practices and methodologies\nLaboratory analytical diagnostic equipment, medical devices and software\nAble to follow complex procedures and processes\nExcellent written and verbal communication skills\nCurious & self-motivated with ability to learn a complex technology platform quickly\nProactively analyzes complex problems, draw conclusions and propose precise action plans\nWorks independently in a structured manner with the ability to prioritize critical tasks\nBuilds collaborative work relationships with different teams, including Field Service, Sales, Marketing and Quality.environmentOther:Available to work flexibly as and when necessary\nAbility to travel to France, UAE or other countries as needed for trainings or workshops\nRemote - with Hybrid or full office work possibility\nWorkstation adaptation possibility upon disabilityMay include extended computer and telephone work involving repetitive arm/wrist motions\nMay include occasional overnight travelWhen you join us, you’ll also be joining Danaher’s global organization, where 80,000 people wake up every day determined to help our customers win. As an associate, you’ll try new things, work hard, and advance your skills with guidance from dedicated leaders, all with the support of powerful Danaher Business System tools and the stability of a tested organization.\nAt Danaher, we value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve.Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.\nIf you’ve ever wondered what’s within you, there’s no better time to find out.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}