{
    "Job ID": "69856851",
    "Description": "Job Title: Office AdministratorLocation: BahrainBahrain Nationality onlyJoin LinxonWe combine SNC-Lavalin’s project management expertise and Hitachi Energy’s deep technological knowledge to create a company dedicated to substations – we are Linxon!What will you do?Provides general administrative and clerical services on local office level.\nPrepares documentation and assists in researching, compiling, proof- reading and editing reports, presentations, organization charts, correspondence.\nAnswers telephone enquiries and deals with both incoming and outgoing correspondence on behalf of the department.\nImplements Linxon processes and engages with other team members in continuous improvement of processes and procedures to maximize efficiency and effectiveness.\nMaintains records/databases/filing systems/archives, in electronic and/or hard copy format.\nPerforms general administrative activities and provides back-up support for others in case of sickness/absence/workload.Experience and Education Required:Fluent Arabic speaker and writer – Bahrain Nationality only\nMinimum 2+ years’ experience. Any Qualification\nWorking on system (Computer) knowledge\nKnowledge with Excel and PowerPointED&I:When it comes to diversity and inclusion, we see things differently at Linxon - we encourage applications from people of all races, ages, genders, religions, sexual orientations and more - so whoever you are, we hope you’ll see things our way, too.About LinxonWe combine SNC-Lavalin’s project management expertise and Hitachi Energy’s industry-leading technological knowledge to create a new company, leveraging the key strengths from both parent partners.Linxon’s vision is to deliver the best market offering for turnkey substation projects through world-class power technologies and delivering the highest level of competence in managing infrastructure projects.As a leading engineering company, we help our customers with turnkey substation solutions in the field of power transmission, renewable energy, and transportation.In this role, you will have the opportunity to be part of a new company as it evolves and help shape it for the future. If you like new challenges, have an entrepreneurial spirit, and are interested in working with other motivated professionals with expertise in the Substations EPC business, then this is the new opportunity for you.-Building the infrastructure to power the world - we are Linxon! - YouTubeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}