{
    "Job ID": "69856837",
    "Description": "SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering, and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50-year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman, and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Junior Architect – UAE NationalWe are currently looking for a highly organised and detail-oriented Senior Administrator to join our team to support in various administrative areas.Job Details:As a provider of multi-disciplined technical services to the built environment Atkins in the Middle East is committed to design excellence in the delivery of first-class solutions which combine innovation, imagination, and best practice.As a graduate Architect within our Middle East business, you could be involved in several mass infrastructure and master planning projects across the region.  Flagship projects in the region involving our Architecture teams include King Abdulaziz International Airport in Jeddah; Etihad Rail (Union Railway) in the UAE, and several mixed use & residential developments across the region.We encourage vision, problem-solving, ambition, enthusiasm, and drive. We recognise that people are the key to our success, and our graduates are the future of our business. We ensure that we provide you with a varied workload and encourage you to extend yourself to reach your potential.Primary ResponsibilitiesYou will join Atkins in the Middle East as an Architecture Graduate.  You will have one base location, but you will eventually be assigned to projects across the region therefore it is likely that an element of travelling will be required for your role. Specific responsibilities will depend on the project(s) you are assigned to, but may include:Concept Design, schematic design, detail design, tender documents, specifications, and site follow up.\n\nCoordinating with structural engineers, building services engineers, infrastructure and other sub consultants and specialists.\n\nLiaising with Senior Design Architect on a regular basis regarding progress, design, quality, resources, changes, site issues, planning issues etc.\n\nTo contribute to new initiatives, quality enhancements, technical memos etc.\n\nTo show commitment to raising Atkins design standards.\n\nLiaison with clients, stakeholders, other professional bodies and contractors\n\nCompliance with Atkins quality, safety, and environmental proceduresYou will be supported towards a relevant internationally recognized professional institution (i.e., RIBA) and provided with all the support infrastructure required to achieve professional status, both financially and through work experience & structured training.RequirementsMinimum degree classification of 2:1 (i.e., 60% or above) in Architecture.\n\nMust be RIBA Part 2 Architect level (or equivalent) – i.e., 5 years academic study to masters level.\n\nWorking knowledge of the following software: AutoCAD, Revit, Sketchup, 3D Studio, Photoshop, and MS Word, Excel, and PowerPoint\n\nNo more than two years relevant work experience\n\nDrive and self-motivation to achieve chartered status with the relevant institution.\n\nDrive to continuously develop your technical & behavioral skills.\n\nAbility to lead and work as part of a team.\n\nAbility to apply technical knowledge in analyzing problems and creating solutions.\n\nAbility to work and communicate effectively in English (verbal & written) within multidisciplinary teams.\n\nAbility to work on your own initiative.\n\nAbility to adapt to changing environments.\n\nAbility to multi-task and deliver to tight deadlines.\n\nAbility to influence others.\n\nStrong attention to detail and ability to make sound judgements.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nAccommodation allowance\n\nTransportation allowance\n\nAnnual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nEmployee Well-Being Programme – 24-hour free advice on financial, legal, and family care specialists and access to personal health, fitness, and nutrition consultants.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}