{
    "Job ID": "69856830",
    "Description": "SNC Lavalin's Program Advisory Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Atkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.ResponsibilitiesHealth, Safety and Environmental EngineerAdhere to and implement Atkins internal HSE management system requirements and procedures for Atkins site team.\nAdhere to project HSE requirements and implement this to Atkins team.\nMonitor the compliance of all WSA staff with the applicable safety standards and company’s procedures and bring to the attention of the Project Manager any safety violations by WSA site team for their further action.\nMonitor, assess and report on Contractor and Sub Contractors HSE compliance with the project HSE requirements as per the Contract and HSE legislation / best practice\nImmediately bring to the attention of the Atkins PM the critical and outstanding safety issues for their further actions.\nConduct and co-ordinate regular safety training for WSA staff.\nCarry out daily site HSE tours with Contractor HSE staff and highlight findings.\nIssue Safety Enforcement Notices (SEN) as per applicable Atkins SEN procedure.\nFollow up with the Contractor on outstanding HSE issues, including SEN’s and ensuring prompt closure with adequate evidence of compliance.\nReview and comment of the Contractors HSE Plans. Advise the Contractor to update the site safety plan when necessary.\nReview and comment on Contractors risk assessments and work method statements.\nDevelop and update Atkins HSE documents (the Safety File), e.g. HSE Plan, HSE specific site risk assessment, office risk assessment, office fire risk assessment, etc.\nConduct accident and incident investigations for Atkins staff.\nCompile accident report and incident statistics.\nChair weekly safety meetings where required with the Contractor and other parties as necessary. Issue MOM on time (within 48 hours). Report any outstanding and critical safety issues or lack of action by the Contractor in the weekly progress meetings.\nPrepare and maintain Atkins HSE registers, e.g. training, induction, SEN, inspection reports, accident/Incident, and others as required.\nReport any accident on site immediately to Atkins UAE Health and Safety Manager and Line Manager.\nCommunicate, coordinate and seek any advice from Atkins UAE Health and Safety Manager as required.\nOn major issues, prior to issuing Safety Enforcement Notices – Prohibition Notice – seek advice from Atkins UAE Health and Safety Manager.Qualification & Certification:Minimum HSE qualifications with NEBOSH Diploma/IGC.\nLead auditor course ( ISO45001 and ISO14001).\nProfessional membership from IIRSM/IOSH is preferred.Rewards and BenefitsWe offer an excellent package which includes:A competitive salary\n26 working days annual leave (6 day work week)\nMedical and life insurance cover.\nCompany gratuity scheme.\nDiscretionary bonus scheme.\nAnnual flight allowance to point of origin.\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}