{"Job ID": "69856811", "Description": "BIM CoordinatorWe are currently looking for a number of BIM Coordinator with a minimum of 08 years’ experienceQualifications and technical competenciesTo be familiar with BIM/Revit software.\n\nMust have a minimum of 8 years in BIM/Revit experience\n\nGood grasp of engineering principles and spatial co-ordination\n\nAdherence to Atkins BIM Standards\n\nExposure to infrastructure design processes.\n\nMust have appreciation of interfacing with architectural and structural disciplines.\n\nMust be able to interpret MEP/architectural/structural engineering requirements.\n\nMust be able to communicate in English effectively, both written and verbal.\n\nMust be able to learn and retain new skills quickly from a variety of sources and show potential to work with limited supervision.\n\nExperience in working under quality systems, specifically the check and review process\n\nIntimate knowledge of industry standard layouts and nomenclature\n\nProficiency in MS Office suite\n\nWorking in teams to deadlines\n\nExperience in working with both consultants/contractors.\n\nDirect the effectiveness of BIM adoption including the 4D/5d simulation for\ndifferent types of Projects.\n\nPrepare, update and maintain BIM 4D and simulations/reporting (actual vs Planned) in accordance with the baseline schedule and the updated schedule (timeline) using Navisworks software.\n\nCoordinate between Planning Team, BIM Team and Construction Team, to ensure the 4D model as accurate to site conditions as possible.\n\nCoordinate with the QS departments/cost for the effectiveness of the 5d simulationSNC Lavalin's Program Advisory Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\n26 calendar days annual leave\n\nMedical and life insurance cover\n\nAnnual flight allowance to point of originJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}