{
    "Job ID": "69857729",
    "Description": "Job SummaryThe Senior MEP Engineer is responsible for planning and design in the areas of mechanical, electrical, and plumbing (MEP) systems including developing polices, standards, inspection procedures, and evaluation tools for MEP matters involving judicial branch facilities. Coordinates for activities such as plumbing, Fire Protection and Electrical engineering as part of the project requirement and ensure compliance based on the standard and statutory requirements.Job Responsibilities 1Principal AccountabilitiesAssesses project requirements, breaks projects into tasks, and works with Project Managers to determine scope of work while overseeing budget and assigned staffing.\nSupervises the works as executed by the various resource teams, ensuring compliance with all HSE, QA and productivity related targets. \nPrepares productivity reports in junction with Project Engineers Reports Job Responsibilities 2Develops and writes scopes of work for mechanical designs (HVAC ) based on preliminary review and client requirements.\nPrepares engineering studies and schematic design for new HVAC systems and analyzes the operation of existing systems.\nMonitors day to day site activities and ensures project activities are carried out as per plan.\nHandles the assignments delegated by Project Engineer.\nMonitors that all the employees at the Project site adhere to company’ quality and safety policies and procedures.\nIdentifies, reviews, corrects non-conforming products.\nPrepares material procurement, submittal and shop drawing schedules.\nDetermines manpower requirement and histogram.\nPrepares material and labor cost estimates.\nPrepares detailed design, design calculations and schematic sketches.\nIdentifies material, equipment and manpower requirements to complete the project work on time.\nReviews daily reports and weekly reports and submit to the Project Engineer/ Manager.\nImplements quality management system at the Project site.\nResponsible to achieve quality objectives at the Project site.\nMaintains machinery and tools in good condition.\nKeeps the project site neat and tidy.\nMonitors to ensure all employees follow safety rules and regulations at project site.\nEnsures workers use the correct tools and equipment for the work being carried out.Understands fully all of the specifications/drawing documents and maintain up-to-date registers where appropriate.Additional Responsibilities 3Job Knowledge & Skills• Knowledge in MEP materials and site activities.• HVAC and/or Utilities design experience• Familiarity with Plumbing, Fire Protection and Electrical Systems.• Coordination and administration of MEP related materials, systems and shop drawings submittals.• Knowledge of local authority regulations, applicable standards and local market.• Knowledge of assist in the testing and commissioning of MEP equipment• Expert in operating basic MS Office 2010 (MS Word, MS Excel).•• ERP knowledge preferably SAP functional skills are a requirement to be successful in this role.Job ExperienceTotal    10 year(s) On Job      6 year(s) GCC     3 year(s)CompetenciesEducationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}