{
    "Job ID": "69856776",
    "Description": "Atkins are looking for a Structural Engineer for Site Supervision team in riyadh, KSA for large Mixed use developments.Minimum Requirements:Bachelor of Science degree in Engineering or equivalent.Minimum of 10 years of relevant experience Construction industry with comprehensive experience in Civil/Structural Engineering, associated technologies and facilities.Excellent written and verbal communication skills. Excellent technical, team-working and interpersonal skills.Experience and detailed knowledge of relevant international codes and standards. Candidates with previous experience on  projects will be given priority.Ability to make independent decisions in the planning, organizing and coordination of solutions to complex problems.Experience as a Lead Engineer for a team of discipline engineers.Independence of Operations and Decision-making Authority:Responsible for influencing, coordinating, and managing all Civil/Structural Engineering related activities.Participate in technical reviews and studies and ensure that technical reviews and studies receive the appropriate Civil/Structural related engineering input. Exercises judgment in making decisions; knows when to seek advice.SNC Lavalin's Atkins business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world and is part of the SNC Lavalin Group.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.\nWe provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.\nAtkins in the Middle East now employs around 2,000 staff serving Gulf clients across all market sectors from offices in Abu Dhabi, Al Ain, Doha, Dubai, Jeddah, Kuwait City, Manama, Muscat, Riyadh, and Sharjah.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\nTransportation allowance\nMedical and life insurance cover\n26 calendar days annual leave\nMedical and life insurance cover\nCompany gratuity scheme\nDiscretionary bonus scheme\nAnnual flight allowance to point of origin\nEmployee Assistance Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultantsSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination. Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:- Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented.- Complying with the relevant employment legislation and codes of practice.- Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect.- Ensuring that the workplace is an environment free from discrimination, harassment, victimization and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement.- Making all decisions relating to recruitment, selection or promotion according to the employees’ abilityJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}