{"Job ID": "69858288", "Description": "SummaryTo provide leadership, direction, and technical expertise in the field of mechanical engineering for ENOWA power generation projects encompassing solar, wind, geothermal, thermal (grid-connected), and off-grid power generation. The Senior Manager - Mechanical will play a pivotal role in the design, construction, and operation phases, ensuring that all mechanical systems and components align with the highest standards of safety, quality, and efficiency.Key Accountabilities and ResponsibilitiesEngineering management      Lead the development of the mechanical engineering design based on project requirements.\nCollaborate with interdisciplinary teams to integrate the mechanical systems within the broader project infrastructure.\nDevelop and review engineering standards, specifications, and best practices for the mechanical domain.\nOversee the procurement, installation, and commissioning of mechanical equipment and systems.\nLiaise with contractors and suppliers to ensure alignment with project specifications.\nTroubleshoot and address any mechanical issues that arise during construction.\nMonitor and supervise the operation of all mechanical systems within the power generation facility.\nImplement regular maintenance schedules and oversee repair activities to ensure continuous operation.\nImplement innovation and best practices to enhance efficiency and reliability.\nEnsure all mechanical systems and procedures comply with local, national, and international safety and environmental standards.\nRegularly conduct safety audits and promote a culture of safety within the mechanical team and the broader organization.\nManage a diverse team of mechanical engineers, technicians, and other professionals.\nProvide mentoring and professional development opportunities for team members.\nDrive performance standards and set clear objectives for the team.\nCommunicate with internal and external stakeholders including regulatory bodies, suppliers, and contractors.\nProvide periodic reports and updates to senior management and other stakeholders on the progress of mechanical engineering activities.Background, SkillsIn-depth understanding of thermal and renewable power generation technologies.\nProven experience in overseeing large-scale power generation projects from design to operation.\nStrong analytical and problem-solving skills.\nAbility to communicate complex technical information to a range of audiences.\nDemonstrated leadership capabilities in managing large interdisciplinary teams.\nSound understanding of local and international safety and environmental standards related to power generation.\nOutstanding problem-solving skills, with the ability to identify, analyze, and resolve technical and logistical challenges.\nHighly effective communication skills to liaise with internal teams, external partners, and regulatory authorities.\nStrong organizational skills and the ability to manage multiple projects simultaneously.\nStrong leadership skills and ability to work independently and in a team.\nTravels to project sites as needed.QualificationsBachelor’s degree in Mechanical Engineering; a Master’s degree would be an added advantage.\nMinimum of 10 years of experience in power generation projects/operations, with at least 5 years in a senior managerial role.\nProfessional certifications (e.g., PMP, PE, CEng) or equivalent.\nAdditional certifications or training related to renewable energy technologies would be beneficial.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}