{
    "Job ID": "69857617",
    "Description": "The Client Onboard Rep 5 performs relatively complex assignments. Has direct impact on the business by ensuring the quality of the tasks or services provided. Works under little to no direct supervision. May service an expansive and/or diverse array of products/services. Applies working knowledge of technical and professional principles and concepts and in depth knowledge of team objectives. Understands how assigned duties contribute to the work of the team/unit and how the units coordinate their efforts and resources to achieve the objectives of the function. Ensures the quality and service of self and others. May recommend new options to enhance productivity in accordance with guidelines. Requires tact and diplomacy when exchanging complex or sensitive information with others. Is sensitive to audience diversity. Basic knowledge of the organization, the business and its policies required. Typically responsible for resolving basic to moderately complex problems based on practice and precedence. Able to assess applicability of similar experiences and evaluate options under circumstances not covered by procedures.\nResponsibilities:Processes client’s requests related to system set up including signatories’ updates and documentation lodgment.\nCo-operates with internal partners to perform systems maintenance based on documentation related to account opening and maintenance processes.\nProvides response to client and internal inquiries.\nPrepares documentation for archiving.\nApplies appropriate bank’s regulations while processing the requests. Remains up to date with the current procedures, internal rules, external regulations, and follows the changes in the aforementioned documents.\nDocuments operation procedure updates.\nProcesses clients’ instructions ensuring the highest accuracy and effectiveness (ensuring deadlines are adhered to). Verification and authorization of data entered in the systems. Ensures all queries are dealt with in an efficient and timely manner. Escalates urgent / risk issues through the appropriate escalation channels.\nCo-operates with and supports other teams/employees upon supervisor’s instruction, including possibility of movement to another team and/or process.\nPerforms other crucial tasks instructed by supervisors, e.g. participation in trainings, projects, conference calls, systems’ testing.\nEnsures high levels of client satisfaction through strong product, process and client knowledge.\nIdentifies and suggests process improvements.\nAssists in the implementation of validated process improvements.\nUnderstands procedures and controls for operational processes.\nSupports Manager with quality assurance process.\nParticipates in user acceptance test of new systems.\nEffective execution of tasks detailed within this document as well as execution of any other work instructed by supervisor related to this function.\nDaily deliverable of routine and defined tasks, while developing knowledge of the broader context in which work is being performed.\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:Previous experience in financial services preferred.\nKnowledge of bank products in the scope of opening and maintaining of bank accounts Customer communication experience (internal/external). Knowledge on the field of finances and banking.\nFlexibility, team spirit, loyalty. High attention to detail Good PC skills (Excel, Word). Fluent in both written and spoken English. Be able to work under pressure and to meet deadlines. Goal-oriented and with desire for new challenges. Customer focus. Self-motivated individual with high competency to follow through when facing obstacles. Ability to organize own work and manage time. Flexible and adaptable approach to a constantly changing work environment. Customer focus. Assertiveness. Demonstrated initiative and creativity in problem solving. Proficient knowledge of English (written and spoken).Education:High School diploma or equivalent-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}