{"Job ID": "69856813", "Description": "Faithful+Gould are looking for a Sustainability Expert in Oman.Faithful+Gould is a hands-on project delivery organization that has moulded its business to respond to the demands of the nations in which it operates.  In doing so, we actively seek to employ staff who possess strong pro-active management skills which enables them to understand the entire delivery process from site acquisition through to feasibility, design, construction, sales and occupancy phases.  Our end-to-end project delivery solution is focused on best maximizing project outcomes while minimizing project risk for our Clients.Job Purpose:We are seeking a highly motivated and skilled Sustainability Expert to join our PMO in Oman. As a Sustainability expert you will play a crucial role in driving sustainability within PMO process. Your primary responsibility will be to coordinate with other disciplines and integrate sustainable practices and technologies into our projects.ResponsibilitiesSustainable Design IntegrationCollaborate with architects and engineers to integrate sustainable design principles into building projects.\n\nConduct analyses and simulations to evaluate the environmental performance and energy efficiency of building designs.\n\nProvide guidance and recommendations on sustainable design strategies, technologies, and materials.Coordination with DisciplinesCoordinate with various disciplines, including architects, building services engineers, structural engineers and other specialists, to ensure seamless integration of sustainable design elements into projects.\n\nCollaborate with the project team to develop comprehensive sustainability strategies and goals for each project.\n\nFacilitate interdisciplinary meetings and discussions to address sustainability-related challenges and opportunities.Energy Efficiency and Renewable EnergyIdentify opportunities to optimize energy efficiency in building systems.\n\nConduct modeling and analysis to evaluate the performance of building systems and propose energy-saving measures.\n\nAssess the feasibility and potential benefits of incorporating renewable energy systems into building designs.Sustainable Material SelectionResearch and recommend sustainable materials and products that align with project goals and objectives.\n\nAssess the environmental impacts of construction materials and evaluate alternatives to minimize resource depletion and waste generation.\n\nCollaborate with suppliers and manufacturers to source eco-friendly materials and products.Environmental Performance EvaluationDevelop and implement monitoring and evaluation plans to measure the environmental performance and sustainability outcomes of completed projects.\n\nAnalyze and report on energy consumption, water usage, waste generation, and other relevant metrics.\n\nIdentify areas for improvement and propose strategies to enhance the sustainability performance of our buildings.Qualifications & Experience:Bachelor's or Master's degree in Engineering, Sustainability, Environmental Science, or a related field.\n\nPrevious experience working in sustainability, green building design, or a related role.\n\nStrong knowledge of sustainable design principles, green building standards (e.g., LEED, BREEAM), and energy codes/regulations.\n\nFamiliarity with renewable energy systems, energy-efficient building systems, and sustainable construction practices.\n\nExcellent analytical and problem-solving skills with the ability to conduct data analysis and interpret results.\n\nEffective communication and collaboration skills to work with cross-functional teams and stakeholders.\n\nStrong project management abilities to manage multiple tasks and meet deadlines.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide. Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships. Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Muscat, Oman", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}