{"Job ID": "69858606", "Description": "Job Description:Pluralsight is the technology workforce development company that helps teams build better products by knowing more and working better together. Using our Skills and Flow products, teams can develop critical skills, improve processes and gain insights through data.We build this exciting product ecosystem by working with smart people and uniting behind a passion for what tech can create. We’re a group of good-natured, nimble go-getters dedicated to helping people and businesses build better with technology. That means when we see opportunities to create, we go for it. We don’t let the unknown stop us from solving challenges and winning together. And most importantly, we treat each other like adults. If you can see possibilities where others see problems, have candid conversations to ensure all voices are heard and thrive in a collaborative environment, you’ll do some of the best work of your career here.The Opportunity:As an Analyst at Pluralsight, your work will strengthen Pluralsight’s position as the leader in technology workforce development! You will drive analysis methodology creation, gathering of insights, data analysis for Pluralsight, assessing all aspects of market and buyer research efforts. The candidate should be a data specialist, but also know when to trust their gut. You will play a pivotal role ensuring that we are identifying all data aggregation points, and collecting relevant data to make informed business decisions.This is a cross-collaborative role that heavily relies on your ability to find, articulate and communicate trends from primary and secondary research. The successful candidate will have the opportunity to take on additional responsibilities and grow within the company.Who you’re committed to being:Life-long learner. You look for opportunities to learn from every task, situation, and interaction. You love problem solving and root cause analysis.\n\nHave a curiosity about scalable technical work regarding analytics (you enjoy SQL, Python, etc.).\n\nContributes. You address problems head-on, seek out help when needed, prioritize based on impact, and deliver tangible results.\n\nData-informed. You form perspectives and generate outcomes by seeking out data and context. You complete data visualization challenges for fun and would swim in spreadsheets if it were a sport.\n\nSystems-thinker. You see the big picture, understand how different pieces fit together, and can articulate how your work delivers business and technical outcomes.\n\nEffective communicator and keep others updated on progress, roadblocks, or even asking out for assistance.\n\nTeam-player. You empower others to succeed.What you’ll own:A proactive contributor in designing, developing, and evolving high quality, usable and extensive analytics solutions for the marketing team. Your focus will be to assist in development / maintenance of analytics operations: sql tables, analytics logic, quick querying, data import from multiple systems, etc.\n\nEnables analytical and reporting practices that provide a quality business partner experience in a simple, consistent, and efficient manner. Prior experiences in metrics, reporting, analytics, insights, as well business case analyses is preferred.\n\nAble to dig into data and raw information through SQL/Python analysis to discover trends and patterns that can be used to extract valuable business insights.\n\nReviewing and improving analytics processes, methods, and tools to increase efficiency, accuracy, and scalability.Experience you’ll need:2+ years post-undergrad data analyst experience solving business problems with data at a fast-paced growth company\n\nMust have strong/advanced experience in SQL; Ability to write complex join, union, pivot, common table expression query statements for complex data calculations in SQL and Python are required.\n\nAbility to work with large amounts of information and see the ‘bigger picture’. Strong conceptual thinking and problem-solving skills using data analysis and utilizing any combination of analytics tools. For example: prior experience is doing root cause analysis - “Why did the number go up or down? etc)\n\nComfortable juggling facts, figures, and number crunching.\n\nKnowledge of using advanced SQL (including Stored Procedure processes).\n\nExcellent at communicating complex data and its implications to technical and non-technical audiences.\n\nExperience in Tableau / Power BI / Sigma / BigQuery / MicroStrategy / Mode / Looker / Hadoop; some knowledge of connecting front end analytics tool to backend systems such as SSAS cubes, BigQuery, Snowflake, etc is preferred.\n\nModerate experience in building automated data import processes using connectors and advanced scripts to connect multiple data sources in an organization.\n\nAgility and speed are very crucial. Must have effective organizational, time-management, and high attention to detail; a strong balance of quality, process, and speed to any deliverable. The position will be working for an US-based team.\n\nTeam player, ability to prioritize team's greater vision and align with all members as one team.\n\nBachelor’s or advanced degree in relevant fields preferred.More than a jobWhere you work isn’t just a career decision — it’s a life decision. Everyone has family, friends and interests outside of their careers, so we offer perks and benefits to make work, work better for you.Generous remuneration package including competitive base salary, and an incredible bonus structure!\n\nUnlimited Annual Leave / Paid Time Off. Take the time out that you need, when you need it.\n\nMarket leading Health Insurance. Health comes first. We offer Comprehensive hospital insurance, and Top Extras for you and your family\n\nGroup Personal Accident (GPA) insurance for peace of mind.\n\nWellness reimbursements. Receive payment up to Rs. 3400 per month for fitness and wellness activities.\n\nTuition reimbursement. Learn something new and let us help you with the bill.Working at PluralsightAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do every day, we empower the people who power our world.And we don’t let fear, egos or drama distract us from our mission. We’re adults, and we treat each other that way. We have the autonomy to do our jobs, we value transparency and trust in each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission to democratize technology skills, we are one.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Bring yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}