{"Job ID": "69858608", "Description": "Senior Manager-(2300017311)Job:Audit, Accounting & FinancePrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:13/Sep/2023, 9:04:48 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleThere is a huge focus on the Cost Management and Cost efficiency in the current Financial Services industry environment.The role is to lead the growth and strategic development of Cost Analytics portfolio within the Cost Vertical in Finance Shared Services Centre (GFS) in respect of standard process capabilities, skill sets, talent pipeline, stakeholder engagement, high quality service delivery and controls.Overseeing and providing on-going management direction for all processes and activities undertaken for Cost Analytics. Introduce and maintain high quality standards of service delivery.\nDrive SCB cost and competitive analytics and benchmarking, extending efforts into market intelligence, developing forward looking projections to calibrate to SCB’s performance vs. peers. External benchmarking basis the underlying industry trends.\nPartner with Global Process Managers and leaders to design and implement Standard Global Processes across areas of Cost Management and to track implementation effectiveness and gaps on a continued basis.\nLead the team to develop a strategic roadmap for Cost CoE including capabilities of modelling, efficiency tracking, business partnering and end to end view of Cost.\nEngage senior stakeholders / business CFO’s to drive conversations in agreeing to deliver a shared agenda of improvements / enhancements within the cost management processes.\nUnderstand the pain areas and provide recommendations for a more efficient and effective end to end process for Cost Management including technology related aspects.\nAgreements are met / exceeded. Embed a culture of continuous process and efficiency improvement within all teams and ensure that a process exists to constantly identify and implement improvement opportunities. Deliver on annual productivity / cost saves targets.\nConstantly explore opportunities for migration in the hub. Build compelling cases for end to end migration from countries. Work closely with business and country CFOs to augment on this.\nContribute to the strategic development of the centre and drive GFS collective agenda.\nWork with HR to enhance the talent / skill sets to meet the growing complexity and needs of finance. Ensure that right talent is attracted and retained for all key roles; actively work on attrition management for the unit. Create sufficient bench to manage attrition efficiently.\nEvaluate options for continuously promoting forums for employee engagements. Encourage employees on their creativity, learning and development & improve work life balance.\nContribute to transformational agenda in terms of strategic, consensus building, driving and contributing to objectives. Participate and Support in all Global initiatives as applicable from time to time.\nEffectively lead change, manage and escalate risks arising out of transition of new processes.Specific to Biz Tech FP&AKey ResponsibilitiesResponsible for end-to-end financial reporting, forecasting, and budgeting process of the assigned business unit & / or corporate function.\nWork closely with the team to ensure quality and timeliness of monthly reporting and closing.\nPreparation of financial information in an accurate and timely manner to Management for decision making purposes.\nAnalyse current and past trends in key performance indicators including all areas of cost and headcount.\nMonitor performance indicators, highlighting trends and analysing causes of variance.\nActive involvement in forecasting and budgeting exercise.\nSupport preparation and presentation packages for Management teams.\nCost benefit analysis to support decision making in new business cases.\nContinuous improvements on financial processes to improve efficiency and internal controls.\nLead / participate in cross-functional projects (if any).\nAssist Senior Head of the business tech with ad-hoc analysis.\nWork closely with Business Tech CFO to formulate digitalisation strategy and initiatives.\nFocus on understanding and translating operational / business needs to solution-level architecture and process improvement.\nDefine digital initiatives, implement digital solution and deliver expected business outcome.\nWork closely with internal finance teams to understand operation processes, identify process deficiency and collaborate with them in all digitalisation initiatives.\nProvide technical direction, feedback and mentorship to local and offshore team through coaching, consultation, working with them to formulate solutions and remove roadblocks.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key StakeholdersTTO CFO and their teams\nR2R, Country Finance SPOCs, P2P Finance teams\nTTO CIO teamsOther ResponsibilitiesEmbed Here for good and Group’s brand and values in TTO Finance P2P team\nPerform other responsibilities assigned under Group, Country, Business or Functional policies and procedures; Multiple functions (double hats); [List all responsibilities associated with the role]Our Ideal CandidateDegree in Business, Accounting, or Finance. An advanced Degree (Masters) and / or Professional Accreditation (CPA, CMA) is a plus.\nA minimum of 8 years of experience related to financial planning and analysis.\nStrong presentation, written and verbal communication skills in English are a must.\nAdvanced Power Point and Excel skills / Knowledge of SAP / Apptio /Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}