{
    "Job ID": "69856775",
    "Description": "About the CompanyWe are one of the largest offshore hydrocarbon producers in the world, responsible for the development, production, and delivery of oil and gas resources. We have been producing oil for the UAE since 1962; our products include crude oil, raw gas, and condensate at nine established fields, which comprise eight super complexes and six artificial islands.  We are committed to creating business and investment opportunities in the UAE in line with ADNOC’s In-Country Value program, which are helping to strengthen and diversify the UAE economy. About the JobResponsible for day-to-day coordination of all internal and external interface issues and acts as a focal point to outside stakeholders. Defines precisely the interface requirements associated with each party involved in a particular interface; ensures all interfaces between the various parties are identified and controlled to ensure integrity between the different identified elements associated with the project/packages.•  Ensures all interfaces are identified, defined and settled in a structured manner among disciplines.\n•  Coordinates all interface engineering activities performed by the PMT/PMC Discipline Engineers and the EPC Contractor.\n•  Works closely with the PMT and PMC Project Engineers to identify interface requirements.\n•  Defines clearly the interface requirements associated with each party at particular interfaces.\n•  Participates closely with Discipline Lead Engineers for identification & integration of particular interfaces for checking the validity and for updating.\n•  Ensures alignment, consistency and synergy among all the project interfaces.\n•  Ensures interface deliverables are received in accordance with the interface schedule.\n•  Maintain close coordination and follow up with respective Government Organizations, Local Authorities, OPCOs and Suppliers to ensure effective delivery of projects related services, and No Objection Certificates (NOC).\n•  Works with interface technical subject matter experts and external interface counterparts to ensure information is delivered and issues are resolved within the time schedule.\n Minimum RequirementsBachelor Degree in Engineering or its equivalent\nAt least 6 years relevant experience in the same or similar role working in an oil and gas industryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}