{
    "Job ID": "69857684",
    "Description": "As an acknowledged authority within Oracle, this senior-level consulting professional has a breadth of knowledge and understanding of solutions, industry best practices, multiple business processes or technology designs across multiple product families. Collaborates with the consulting sales team to design innovative solutions that have industry-wide impact. Analyzes business needs to ensure Oracle solution meets customer objectives. Exercises creativity and independent judgment and business acumen in selecting methods and techniques to design non-routine and very complex business solutions utilizing Oracle products and technology to meet customer needs. As a position of technical and professional influence, this individual frequently operates at the leading edge of technology. Recommends and justifies enhancements to Oracle products to meet complex customer needs. As a thought leader and customer advisor, influences customer leadership in acceptance of Oracle solutions and services to facilitate the closing of consulting deals. Contributes to non-routine and very complex statements of work, work breakdown structure and/or level of effort and staff plans. Presents and demonstrates solutions to customers. Builds and maintains a network and up-to-date specific industry or product knowledge. Responsible for transitioning deal knowledge to implementation team. Coordinates a pursuit team of subject matter experts. Leads the domain specific solution design aspects of engagement(s) ensuring high quality and integrated business solutions. Knowledgeable of competition and external factors that may influence Oracle's competitive position. Resolves highly complex customer issues by recommending solutions. Ensures enterprise solution spans across the customer*s business processes. Designs innovative solutions that maximize the use of standard product capabilities to meet customer objectives. 10+ years of experience relevant to this position including 5 years of consulting experience. Prior team lead or manager experience. Undergraduate degree or equivalent experience. Broad product, technology or industry expertise. Ability to craft and articulate strategic solutions. In-depth knowledge of implementation methodologies and best practices. Knowledge of competitive & partner products, technology and solutions. Proficient in using selling and negotiation techniques and tools. Ability to travel as needed.As part of Oracle's employment process candidates will be required to successfully complete a pre-employment screening process. This will involve identity and employment verification, professional references, education verification and professional qualifications and memberships (if applicable).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Non-Profit Organization",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}