{"Job ID": "69857880", "Description": "About us.At the lowest point on earth, overlooking one of the world's most magical seas and one of the most spectacular natural and spiritual landscapes, at the shore of legendary Dead Sea sits the new Holiday Inn Resort Dead Sea Here you can relax and rejuvenate with the year-round sunshine, low humidity, ozone rich air and of course the healing mineral loaded waters of the Dead Sea itself.The hotel is just 70 km from Amman Queen Alia International Airport and 55km from the capital Amman. Guest staying at the Holiday Inn Resort Dead Sea will enjoy a fresh new family hotel with spacious rooms complete with a wide variety of leisure activities with free mini bar and free internet access.About the role responsibilities.Monitors the preparation and use of standards manuals in all outlets and departments.\nEnsures all new staff undergoes hotel orientation.\nOversees and controls the voluntary cross-training system.\nDevelops, conducts and evaluates training sessions and courses for internal and external trainees.\nMaintains a craft training system to meet the initial and developmental needs of operational staff.\nConducts departmental training reviews on a bi-monthly basis.\nDevelops and maintains contact with educational establishment to promote Hotel and the hospitality industry in general.\nPrepares a monthly training report, detailing training activities in the previous month.\nMonitors present and future trends, practices and systems in the field of training and makes recommendations for change where necessary.\nLiaises with the Vocational Training Authority, and ensures compliance with government rules and regulations concerning training.\nCarrying out administrative tasks to support the resort operations, perform tasks from the director reporting.What you can expect from us:We give our people everything they need to succeed. From a competitive salary that rewards all your hard work to a wide range of benefits designed to help you live your best work life – including a full uniform, impressive room discounts and some of the best training in the business. Our mission is to welcome everyone and create inclusive teams where we celebrate difference and encourage colleagues to bring their whole selves to work. IHG Hotels & Resorts provides equal employment opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. We promote a culture of trust, support, and acceptance. Always welcoming different backgrounds, experiences, and perspectives. IHG gives every member of the team the room they need to belong, grow and make a difference in a collaborative environment. We know that to work well, we need to feel well – both inside and outside of work – and through our my WellbeingFramework, we are committed to supporting wellbeing in your health, lifestyle, and workplace.  So, join us and you’ll become part of our ever-growing global family.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jordan", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}