{
    "Job ID": "69856900",
    "Description": "We are looking for a Senior Design Architect to be based in out Dubai office.We create sustainable solutions that connect people, data and technology to design, deliver and operate the most complex projects. With offices around the world, we connect people, technology and data to shape the future of our industry and the world around us and because we cover everything from blueprint to delivery, across the entire lifespan of a project, you can count on us for a client experience that is smoother, smarter and more efficient. At Atkins, we’re not just embracing change – we’re driving it.As part of our regional growth plans, we are currently looking for an Sr. Design Architect to join one of our exciting projects in the Middle East. You will play a crucial role in our design team, contributing to the development of extraordinary architectural solutions that push the boundaries of traditional design. You will work closely with our project team and collaborate with other architects, designers, and engineers to create iconic, sustainable, and technically advanced designs. Qualifications:Bachelor's or Master's degree in Architecture.\n\nExperience of working in a recognized global/design offices\n\nBe a registered member of an accredited Architectural Registration Board \n\nProven track record of min. 7  years of experience working on large-scale architectural projects.\n\nProficiency in Revit, Grasshopper3D, and Rhino, Adobe with a strong portfolio showcasing your expertise on large scale complex projects.\n\nSelf-motivated and able to take responsibility\n\nFlexible attitude and works well under pressure and meet deadlines efficiently\n\nExcellent organisational skills\n\nAble to build good relationships at all levels internally and externally\n\nResilient to cope with conflicting demands, able to prioritise duties and work effectively under pressure while remaining calm and professional at all times.\n\nAbility to understand and formulate design decisions and present for discussion\n\nAbility to use a variety of media in the development and documentation of a design project\n\nSound understanding of BIM processes and implementation for large projects.\n\nAbility to work independently and collaboratively in a team-based environment.\n\nStrong problem-solving and critical-thinking abilities\n\nThorough knowledge of building codes, regulations, and sustainable design principles.\n\nExceptional communication and interpersonal skills.\n\nPassion for creating impactful and innovative architectural designs and keen eye for detail.Responsibilities:Complex Geometry Design: Utilize your in-depth knowledge of complex geometry principles to develop innovative and striking architectural designs. Employ advanced computational design techniques through tools like Grasshopper3D to achieve unique forms and optimize performance.\n\nProject Planning: Engage in the conceptualization, planning, and development of projects with a focus on complex geometries. Participate in design charrettes and brainstorming sessions to provide valuable insights and contribute to the overall design strategy.\n\nSoftware Expertise: Demonstrate proficiency in Revit, Grasshopper3D, and Rhino to model, analyze, and refine complex architectural geometries. Develop workflows to enhance the efficiency and precision of the design process.\n\nCollaboration: Work closely and coordinate with multidisciplinary teams, including architects, engineers, and consultants, to ensure seamless coordination and integration of complex project elements within the overall design.\n\nResearch and Development: Stay abreast of industry trends, emerging technologies, and best practices related to large-scale project design. Implement innovative design solutions to address project challenges.\n\nQuality Control: Ensure that all architectural designs meet high standards of quality, aesthetics, functionality, and sustainability. Conduct thorough reviews and analyses to identify and resolve design issues.\n\nQuality Assurance: Ensure that all architectural designs meet the highest standards of quality, aesthetics, functionality, and compliance with local building codes and regulations.\n\nTeam Interaction: Engage with the team and consultants to understand the vision, objectives, and requirements, and effectively communicate complex design concepts in a clear and concise manner.\n\nBIM Implementation: Spearhead the implementation of Building Information Modeling (BIM) processes within the team for large-scale projects, driving efficiency and collaboration.Rewards & BenfitsA competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\n22 calendar days annual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented\n\nComplying with the relevant employment legislation and codes of practice\n\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect\n\nEnsuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;\n\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}