{
    "Job ID": "69856926",
    "Description": "SNC-Lavalin is a global fully integrated professional services and project management company and a major player in the ownership of infrastructure. From offices around the world, SNC-Lavalin's employees are proud to build what matters. Our teams provide comprehensive end-to-end project solutions – including PPP, capital investment, consulting, design, engineering, construction, sustaining capital and operations and maintenance to international clients. On July 3, 2017, SNC-Lavalin acquired Atkins, one of the world's most respected design, engineering and project management consultancies. Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.We are currently looking for a Junior Civil Engineer / Architect UAE National To implement all aspects of the quality management systems and control site supervision activities provision related to the Architectural Works across the project, to deliver quality installations in accordance with the contract documents, relevant international standards, and local authorities’ requirements, provide technical support; perform specialised inspections, submittal reviews and mentor the discipline staff.Primary ResponsibilitiesVisit project site frequently (as required) to supervise the ongoing construction activities. To ensure that the Works are carried out safely and in-line with quality standards, in accordance to contract documents.Responsibilities:Site ArchitectImplement the site supervision quality procedures, and review submission\n\nrequirements of the project, along with the contractor.\n\nReview all construction documents and highlight any design and contractual\n\ndiscrepancies with the concerned PM/RE/SHOA.\n\nEnsure that all statutory authority NOC’s / permits / design approvals are available on site for construction.\n\nEnsure that the main contractor and nominated contractor(s) coordinate with all concerned authorities’ departments and ensure that their requirements are adequately and satisfactorily incorporated.\n\nExtend the maximum possible effort to avoid contractor(s) claims for cost and/or delay.\n\nPrepare process control sheet for Architectural works in conjunction with SHOA during the Enabling Works / Main Contract Works.\n\nReview and forward any comments on all submittals including contractor design drawings, shop drawings, materials and alternative proposals submitted by contractors.\n\nConduct regular (daily) site visits and supervise, certify the installation of architectural works ensuring compliance with the contract documents.\n\nReview and forward any comments on the contractor’s method statement for installation, execution of the works.\n\nReview and forward any comments on the contractor’s testing and commissioning plan / procedures / method statements.\n\nReview and forward any comments on the contractor’s technical submittals.\n\nAttend site technical coordination meetings to discuss contractor (s) submissions, shop drawings, material submittals and construction related matters\n\nReview and forward any comments on the Technical Query’s raised by the contractor.\n\nRoutine Inspection of the works carried out by the contractor(s) to ascertain that work is executed in accordance with the Contract Documents and accepted practise.\n\nInspect the mock-up, permanent works, on-site and off-site materials to be used in the project and organise field and laboratory tests, conducted by others, on construction materials to ascertain their compliance with the specifications and determine the acceptability for use on the project.\n\nRaise non-conformance notices (NCNs)/reports; site inspections notices (SINs) identify quality deficiencies in conjunction with the PM/RE.\n\nReview the corrective actions proposed by the contractor, respond / follow ups and close out procedure\n\nAny potential safety concerns identified at site shall be reported to site SHSEE / PM/RE.\n\nReview the site progress and assist in the review of the contractor’s interim payment application.\n\nLiaise with the SHOA for the effective implementation of the quality management systems and site supervision provision activities.\n\nObtain samples and quotations as required for finalisation of any PS/PC Items.\n\nMonitor the progress of the work against the approved contractor programme of works.\n\nWitness the testing and commissioning and sign off the relevant documents for acceptance.\n\nVerify the accuracy of the contractor’s “As-Built” drawings reflecting in detail the asbuilt conditions and approve the As-Built drawings.\n\nReview and approve the contractor’s operations & maintenance manuals.\n\nLiaise with the Statutory Authorities and follow up all final inspection and approvals as required.\n\nCarry out the final inspection for certification of final completion and handing over of the works.Project Area InterfaceAssist PM/RE in the supervision of the works to ensure compliance with the contract\n\ndocuments.\n\nAssist/support the site team and the respective PM/RE with the implementation of\n\nQuality / HSE management systems.\n\nAssist in the site team in the external and internal audits to ensure the effective\n\nimplementation of quality management systems and work with the site team for\n\nresolution of non-conformance issues.\n\nLiaise with the project supervision team, coordinate, and resolve any issues of\n\nconcern.\n\nAnalyse current methods of site supervision and provide recommendations for\n\ncontinuous improvement\n\nImplementation of all quality audits, surveillance audits and work with site team for\n\nresolution of non-conformance issues.\n\nCompile Site Feedback and forward to the PM/RE / SHOA\n\nAssist the site team in the satisfactory close out of the project including snagging / desnagging of the works and related documentation.\n\nReview and assist the project team to compile all documents at handing-over for\n\nsubmission to the Client.\n\nAssist the RE in compilation of all documents for the issuance of the Taking-Over Certificate.Client InterfaceProvide necessary technical reports / recommendation as required by the Client for\nany project specific issues.\n\nAttend meetings with Client (as required).\n\nLiaise with the Client for the necessary approval of samplesDesign Office InterfaceRegularly attend site technical coordination meetings with ContractorSite Operations Office InterfaceLiaise with the SHOE any project site related issues requiring input and/or feedback.\n\nCoordinate leave request and discuss leave cover with the SHOE.\n\nLiaise with OMSOD for all HR / Finance / Administrative issues.Design Office InterfaceIdentify, raise and follow-up design office support requests in co-ordination with the\nSHOMFunctional Duties:Assume responsibility of electrical works in the project and certify on completion the\ninstallation.\n\nMonitor performance of the Contractor / Sub-contractor and identify, raise any quality\n/ workmanship concerns with the SQE / RE.\n\nReview quality procedures and effectively implement QA/QC plans across the project.\n\nIdentify any site safety issues and bring to the notice of the contractor / SHSEE / RE.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nAccommodation allowance\n\nTransportation allowance\n\nAnnual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nEmployee Well-Being Programme – 24-hour free advice on financial, legal, and family care specialists and also access to personal health, fitness and nutrition consultants.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}