{
    "Job ID": "69856904",
    "Description": "Faithful+Gould is a hands-on project delivery organisation that has moulded its business to respond to the demands of the nations in which it operates.  In doing so, we actively seek to employ staff who possess strong pro-active management skills which enables them to understand the entire delivery process from site acquisition through to feasibility, design, construction, sales and occupancy phases.  Our end-to-end project delivery solution is focused on best maximising project outcomes while minimising project risk for our Clients.We are currently looking for Guests Manager (Sports Events) in Al Ula KSA, with a demonstrated experience in working on similar projects.The Sports Guests Management Manager is responsible for coordinating and managing the logistics, accommodations, and overall experience of guests and VIPs attending sports events, tournaments, and related activities. This role involves meticulous planning, exceptional communication skills, and a keen attention to detail to ensure that all guests have a seamless and memorable experience. Key Responsibilities:1.  Guest Coordination:   - Act as the primary point of contact for guests and VIPs attending sports events.   - Collaborate with event organizers to gather guest information, preferences, and special requirements.   - Coordinate guest invitations, confirmations, and communication leading up to the event.   - Address guest inquiries, concerns, and requests promptly and professionally.2.  Logistics Management:   - Organize travel arrangements, including transportation and accommodation, for guests.   - Work with travel agencies, hotels, and other vendors to secure bookings and negotiate favorable rates.   - Develop detailed itineraries for guests, ensuring timely arrivals and departures.3.  Event Experience:   - Plan and oversee hospitality suites, VIP lounges, and other guest-centric areas during events.   - Coordinate with catering and hospitality teams to ensure high-quality services and catering options.   - Implement strategies to enhance the overall guest experience, such as welcome packages or exclusive access to athletes.4.  VIP Protocol:   - Develop and maintain a protocol for VIP interactions, ensuring that guests are treated with the utmost respect and professionalism.   - Coordinate with security teams to manage access and ensure the safety of guests.5.  Relationship Building:   - Establish and nurture strong relationships with key stakeholders, including athletes, team representatives, sponsors, and media personnel.   - Collaborate with marketing and PR teams to leverage guest attendance for promotional activities.6.  Budget Management:   - Create and manage budgets for guest management, including travel, accommodation, and hospitality expenses.   - Monitor expenses, negotiate contracts, and identify cost-saving opportunities. Requirements:-  Education:  A bachelor's degree in hospitality management, sports management, event management, or a related field. A master's degree can be a plus.-  Experience:  10+ years of experience in guest services, hospitality, event management, or a related role, preferably within the sports industry.-  Communication Skills:  Excellent written and verbal communication skills, with the ability to interact professionally with guests, athletes, and stakeholders.-  Organizational Skills:  Strong organizational and multitasking abilities to manage multiple guests and events simultaneously.-  Attention to Detail:  Meticulous attention to detail to ensure guest preferences, logistics, and event plans are executed flawlessly.-  Problem-Solving:  Ability to handle unexpected challenges and resolve issues quickly and effectively.-  Negotiation Skills:  Proficiency in negotiating with vendors, hotels, and travel agencies to secure favorable rates and terms.-  Team Player:  Collaborative mindset to work closely with cross-functional teams including marketing, PR, operations, and security.-  Flexibility:  Willingness to work irregular hours, including evenings, weekends, and holidays, to accommodate event schedules.-  Industry Knowledge:  A deep understanding of the sports industry, including major tournaments, events, and athletes.-  Computer Skills:  Proficiency in using event management software, communication tools, and Microsoft Office applications.The Sports Guests Management Manager plays a critical role in ensuring that the guests' experience aligns with the prestige and excitement of the sports events, contributing to the overall success and reputation of the organization or event.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide.Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings.Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region.Rewards & BenefitsWe offer an excellent package which includes:A competitive salary\n\nTransportation at Al Ula\n\nMedical and life insurance cover\n\n22 working days annual leave\n\nAccommodation at Al Ula\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of originSNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}