{
    "Job ID": "69857639",
    "Description": "Create technical documentation compatible with Aptiv standards and ISO 26262 requirements\nActive support and cooperate with system and hardware engineers in the area of reliability and functional safety.\nActive participate in reviews and project meetings.Perform reliability and safety analysis for EEA systems with respect to particular customers’ requirements and multiple engineering disciplines (SYS/HW/ME/VAL/SW)\nActive support Functional safety concept and technical safety concept creation to meet customer safety goals\nReliability and safety risks prediction and  analysis using mathematical modeling techniques\nFunctional safety process cope definition (DIA) and  management for each project assigned.\nActive support for various safety and reliability design analysis (qualitative and quantitative) preparation including  / DFMEA / FMEDA/ Pin Out DFMEA/ Hardware Metrics to meet customer safety goals \nUse your specialized knowledge to determine reliability and safety  improvement opportunities and reductions in cost of poor quality while working with engineers from various functional areas.\nCommunication and contact development with Aptiv suppliers and customers\nAssure that every Customer Requirements concerning reliability and functional safety are properly understood and implemented\nCare for good company image and its property by demonstrating excellent attitudes toward internal and external customers\nProtection of  Aptiv confidential information\nOn-time execution of assigned tasks in compliance with the quality system valid for Aptiv corporation and Technical Center in Kraków\nPermanently develop professional qualifications by active presence on trainings and self-developmentPrivacy Notice - Active Candidates: https://www.aptiv.com/privacy-notice-active-candidatesAptiv is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender identity, sexual orientation, disability status, protected veteran status or any other characteristic protected by law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}