{
    "Job ID": "69857875",
    "Description": "About ACEA ProjectFHI 360 is implementing the Department of State Collaborative Action for Handicraft Exports (ACEA) project in Tunisia. In partnership with the National Office of Handicrafts (ONAT), the goal of this project is to foster a more competitive handicraft value chain in Tunisia, leading to long-term sustainable economic growth, increased exports, and increased employment.This goal would be achieved through a technical support to four handicrafts value chains, including the initiatives of three clusters. A first step was initiated by a technical support to “Natural extract” value chain in the northwest of Tunisia, Olive Wood in Sidi Bouzid and Sfax, and traditional weaving in Toujen.   While keep providing support to these value chains, the project will focus on traditional pottery in Barrama .During this new phase of the ACEA project ,  the export and market development support  activities to the clusters  will be centralized and overseen by cluster business development Officer who will be responsible for coordinating and managing the various activities related to accessing markets , export and developing new revenue streams of the clusters  . This will ensure that all support activities are aligned with the project's objectives and that there is consistency in the approach taken across all sectors.The cluster business development Officer will work closely with the legally formed groups (GIEs) within each sector to identify their specific needs and develop customized support plans to improve the export. Duties and ResponsibilitiesThe cluster business Development Officer will  work under the overall guidance of the portfolio director . S/he will also work in close coordination with the implementing partners, other team members of the project, and the clusters’ members. He/she will be responsible of enhancing the the export of the clusters through market research  .  Supported by two technical assistance projects , the cluster development officer will oversee the implementation  and monitor the development of the 4 project clusters . S/he will work closely with other components, government officials, non-government and civil society organizations. She/he will have the following specific duties and responsibilities:Oversees the co-ordination and administration of all aspects of the  ongoing program related to export and business developement , including planning, organizing, leading and managing the project’s  program activities.\n\nProvide support to manage, lead, motivate and develop the technical assistance team ;\n\nProvide technical assistance to the clusters to develop, implement and maintain sound business practices ;\n\nResponsible for identifying, developing, and potentially closing new revenue and profit streams.\n\nProvide technical assistance to the clusters developing new products and identifying new markets\n\nBuild existing and develop new business relationships\n\nCreate, monitor, and report on key performance metrics to determine effectiveness of export efforts and anticipate customer needs\n\nIdentify and communicate business opportunities nationally and internationally\n\nWork to make business development efforts efficient and cost-effective\n\nWork closely with the clusters  existing customers to develop long-term relationships\n\n Manage the business development on a strategic level\n\n Communicate effectively with clustrers members , clients and relevant public stackholders to identify export barriers and develop effective solutions to reduce them .\n\nIdentify the needs, and evaluate alternative business solutions and strategies\n\nSupport Cluster developement  activities and propose new creative solutions for identified business opportunities\n\nProvide technical assistance for the clusters to develop  tender responses, solution proposals and quotations for existing or new clients when required\n\nDraft ToR, concept note , note sheet and organize and conduct workshops and  seminars with various stakeholder\n\nPut in place a cadre of Cluster business  Development and by providing  continuous guidance on  improving business performance and the overall efficiency of the clusters .\n\nAny other relevant tasksRequirmentBachelor’s degree or its international equivalent in Business Administration, Finance, Accounting, International Administration, International Development, International Business, Management, Public Administration or a related field\n\nA minimum of three years’ relevant professional experience on international development programs and/or work in the civil society sector of Tunisia and/or other countries\n\nAbility to work effectively with local partners and stakeholders\n\nAbility to work effectively in a highly collaborative team\n\nStrong analytical, communication, organizational, writing, and interpersonal skills\n\nExcellent oral and written communication skills in English.\n\nFluency in French and/or ArabicThis job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employerwhereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.Our values and commitments to safeguarding:FHI 360 is committed to preventing any type of abuse, exploitation and harassment in our work environments and programs, including sexual abuse, exploitation and harassment. FHI 360 takes steps to safeguard the welfare of everyone who engages with our organization and programs and requires that all personnel, including staff members and volunteers, share this commitment and sign our code of conduct. All offers of employment will be subject to appropriate screening checks, including reference, criminal record and terrorism finance checks. FHI 360 also participates in the Inter-Agency Misconduct Disclosure Scheme (MDS), facilitated by the Steering Committee for Humanitarian Response. In line with the MDS, we will request information from job applicants’ previous employers about any substantiated findings of sexual abuse, exploitation and/or harassment during the applicant’s tenure with previous employers. By applying, job applicants confirm their understanding of these recruitment procedures and consent to these screening checks.FHI 360 will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws.\nFHI 360 fosters the strength and health of its workforce through a competitive benefits package, professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Tunis, Tunisia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}