{"Job ID": "69857630", "Description": "In this role, you will have the opportunity to learn a wide range of core Ethernet Technologies with architectural exposure to design and develop Ethernet Switching as applied to both Public and Private cloud infrastructure. You will work on the intricacies of the mission-critical infrastructure that enables the world-class, multi-layered Nexus switches. In addition, you will have the opportunity to participate in cross-functional teamwork and be exposed to all facets of the software development cycle from innovation, marketing requirement to product delivery.Participate on a project team of engineers involved in the development of software for the Nexus Series switch product family, with emphasis in L2, L3, VXLAN and MPLS areasDefine, architect, design, and deliver new features for the Nexus Series platforms.Maintain existing features and champion innovative ways to constantly improve the software.Influence the design of interfaces between products to ensure inter-operability.Develop large portions of software independently and rapidly.Strong C programming skills.Knowledge of Linux OS InternalsFamiliarity with Ethernet Switching Silicon (Merchant or Custom Silicon)Strong problem solving and software development/trouble shooting skillsHands on experience on switch/router embedded system software development.Typically requires MSEE/CS combined with 8+ years of related experience, or BSEE/CS combined with 10+ yrs of related experienceWhy Cisco?#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!Nearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.We tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).We know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.So, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Telecommunications", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}