{
    "Job ID": "69858854",
    "Description": "Sr. Executive Office ManagerWe are currently seeking a motivated and hardworking person to join our team in the role of Sr. Office Manager. In this role, you will use your administrative and organizational skills to provide general administrative support to Honeywell executives.You will work closely with the business leaders and enjoy a lot of interaction with internal employees and external customers. Contribute to a team of highly committed professionals who’s organizational and communication skills ensure smooth travel planning, calendar coordination, complex meeting planning and other administrative business processes.HONEYWELLWe have been innovating for more than 100 years and now we’re creating what’s next. Our programs serve a global community and our hometowns too. We provide resources and financial support to causes around the world and encourage employee volunteerism. We are committed to the highest standard in everything we do!Key requirementsManage calendars.\nCoordinate meetings.\nPlan complex travel.\nInteract with internal and external customers.\nProcess expense reports and invoices\nManage supplies and other indirect purchases.\nShare information with admin assistants.Key skills and qualifications·Bachelor's Degree or equivalent·10+ years’ experience in a similar work environment.·Significant executive support experience, including supporting C-level executives. Nonprofit board experience is highly preferred.·High degree of professionalism in dealing with diverse groups of people, including Board members, senior executives, staff, community leaders, donors, and funded partners.·Ability to juggle many priorities and competing demands easily and effectively.·Individuals who are self-motivated and do things before being asked by others or forced to by events.·Ability to focus on important information and identify key details.·Professional & courteous communication and strong organizational skills·Excellent computer literacy in a variety of Microsoft and web-based programs·Highly dependable and trustworthy and able to manage conflicting priorities and deadlines.Our offer·A culture that fosters inclusion, diversity, and innovation in an international work environment·Market specific training and ongoing personal development.·Experienced leaders to support your professional development.·Annual salary and consolidated allowance·Group medical insurance plan·Life and long-term disability insurance·Paid annual leave and time off work.·Business travel insuranceEqual opportunity statementWe are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Join us now and be part of a global team of thinkers, innovators, dreamers, and doers who make the things that make the future!#TheFutureIsWhatWeMakeItJOB ID: HRD209297\nCategory: Business Management\nLocation: Emaar Buss.Park; Bld.2,Sheikh Zayed Road,Dubai,DUBAI,United Arab EmiratesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}