{
    "Job ID": "69859190",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of a Senior Java lead Engineer.In this role, you will:End to end ownership of delivery of a product (from requirement to production) in Quantitative Investment Strategy products in Equity Derivatives.\nCoding  in Java and Kotlin.\nMentoring team and set in place coding standards.\nBusiness interaction for product requirements. \nInnovation happens as natural side-effect of the work that is undertaken.\nBuild trusted relationships with the business and key stakeholders over the period of time.\nCommunication is NOT forced - leads by example. They might facilitate meetings, meetups, learning sessions and write blogs in order to disseminate information in a sustainable way in geographically spread multi-cultural environment.\nProvides \"value\" in issue resolution for wider teams even for things that they haven't necessarily been involved in coding.\n·       Always strives to continue to learn and persuade others to continue to learn as well as mentor as required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}