{"Job ID": "69858127", "Description": "We’re expanding our Learning team within Amazon Operations! If you’re interested in joining a business where you can achieve amazing results and put smiles on people’s faces, this could be the role for you.\nThe Last Mile Learning Associate works with Operations Managers, Area Managers and associates. Constantly improves the long-term capabilities of the area to which he/she is assigned.\nThe ideal candidate will have Excellent communication skills, comfortable talking in front of a group as well as one-on-one with an individual, able to give and receive feedback effectively. Ability to follow up and meets time commitments and deadlines, is goal oriented, gives insight to area managers. Works hard for the success of others, constantly remains “customer obsessed”. Demonstrates a positive “can do” demeanor and has fun and gains energy from working with others. Measure Associate performance around Safety, Quality, and Productivity applies learning tools to improve operation metrics . Improves associates' job-related skills; develops, maintains and applies learning tools (methods, checklists and skill building agreements) to encourage associate development, assists in driving success of peak and non-peak training plans.\nThe Learning Associate will achieve this objective by:\n· Executing all standard trainer tasks as outlined on Trainer Standard Work Checklist\n· Delivering network standard training\n· Partnering with Operations Leaders to Evaluate and improve training processes within work areas\n· Directly coaching associates to improve job performance\n· Managing training compliance to ensure accurate training records are housed correctly\nWe are open to hiring candidates to work out of one of the following locations:\nRiyadh, 01, SAU\nBachelor Degree graduate - BA/Bcom/BE/Btech or equivalent\nProficiency in computer usage, email, MS Office Suite\nOrganization skills -\nAble to handle multiple and changing projects/priorities\nAbility to prioritize, manage and complete projects with tight deadlines\nWillingness to work in different areas as required by training needs\nArabic speaker with professional English level Availability to work in different shifts.\nPrior training, teaching or presentation experience\nPrevious experience as a trainer\nWillingness to work different shifts\nShift hours for this position may be different from the standard production shifts\nWillingness to work in different areas as required by training needs\nExcellent attendance\nCandidates must be very organized and able to handle multiple and changing projects/priorities\nWillingness to participate in and support the Operational Excellence initiatives\nAbility to converse or translate English content into ArabicJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}