{
    "Job ID": "69856827",
    "Description": "About AtkinsRéalis  Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn.  Job Purpose:To design, implement, and manage an effective reporting system as well as lead the reporting strategy for the Development sector through active engagement with the Executive team.Responsibilities:Report the progress of the programs and projects to the Executive team and other concerned stakeholders through the development of quality progress reports, dashboards, and other related internal and external reporting deliverables.\nEnsure accurate, consistent, and timely reporting to inform the Executive team and other concerned stakeholders on the progress of programs and projects to aid business decisions and track performance.\nManage the development of progress reports, dashboards, and other deliverables that accurately capture the progress and performance of programs and projects.\nManage the development and maintenance of project reporting processes and standards.\nManage the collection, analysis, and reporting of project data including status, risks, issues, and performance metrics.\nCollaborate with the project and functional teams to gather accurate progress data, identify different reporting needs, and further refine the structure of the existing reports and dashboards.\nProcess and translate raw project data into usable information for reporting and analytics.\nManage the development and implementation of data reporting, analytic systems, and other approaches that optimize information flow and insights to enhance and facilitate the reporting system.\nDevelop and maintain database for each project and monitor data to identify trends in project health and performance.\nEnsure that all historical data and related documentation are maintained and available in a central repository to facilitate seamless report generating system.\nProvide regular project status updates to stakeholders including senior management.\nCollaborate with project teams to identify and track project risks and issues and develop mitigation and resolution plans.\nProvide guidance and support to project teams to ensure that project reporting requirements are understood and met.\nContinuously monitor and evaluate project reporting processes to identify areas for improvement.\nDevelop and maintain effective relationships with stakeholders including project teams, functional teams, and senior management.\nFollow all relevant functional policies, processes, standard operating procedures, and instructions to ensure that work is carried out in a controlled and consistent manner.\nPrepare accurate and timely functional deliverables and reports to meet corporate and functional requirements, policies, and standards.Qualifications:Bachelor’s degree in project management, data science, information systems, mathematics, statistics, engineering, or other related fields\nMinimum of 12 years’ experience in reporting and analytics, business intelligence, data management, project controls, project management, or other related discipline\nMinimum of 5 years’ experience in large programs or projects in the engineering and construction industry\nExperience in publishing large volume reports or documents\nExperience in report writing and technical writing\nExcellent data visualization and desktop publishing skills\nExperience in developing and delivering presentations to senior management\nProficiency in using project management tools and software\nProficient in various reporting software, data visualization tools, and other Business Intelligence tools such as Microsoft Excel, Microsoft Power BI, Tableau, and SharePoint.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}