{"Job ID": "69857048", "Description": "The RBS MPT unit is a sales channels under RBS (Cards & Personal Loans) catering to the Credit Card, Personal Finance and Bank Account requirements of existing and prospect Emirates NBD customers within UAE. The team’s core responsibility is to sell & increase banks market share of Credit Card, Personal Finance and Account base in line with the Banks overall business strategy. This team is also responsible for bringing new companies to the bank’s approved list of employers and build on these relationships to increase penetration bank’s retail banking products.The unit will also focus on cross selling of other retail banking products when required to increase sales of other bank’s products thus positively affecting the overall sales, revenue and profitability.Sales of Credit Card, Personal Finance and Bank Accounts in retail banking. \nCross selling of other bank products when required\nTo act professionally on behalf of the bank for providing details of bank products, services and related processes etc. to customers\nTo adhere to banks service standards so as to ensure best in class customer service and experience\nTo follow the laid down policies and procedures of the bankTo report/maintain customer feedback, market pulse and any other data point or process as required by the unit/bankTanfeethEstablished in 2011, Tanfeeth is the Gulf Cooperation Council’s (GCC) first large-scale Business Service Partner and fully owned subsidiary of Emirates NBD. Tanfeeth is dedicated to supporting the Emirates NBD Group by delivering regional expertise, cost productivity, and excellence in customer service delivery in terms of quality, consistency and efficiency, to the Group’s growing customer base.In Arabic, ‘Tanfeeth’ means ‘getting the job done’ and that’s exactly what we do! We function as an operations and service platform with international customer service standards. Our end goal is to continue to raise the benchmark for customer service across the region and deliver exceptional customer experience through partnership, passion & people.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}