{"Job ID": "69858349", "Description": "1. JOB PURPOSE To provide existing and potential customers with consistent quality service promoting and selling all products and services including a comprehensive sales / system support and information brokerage service to customers with regards to all products rates, details, bookings, connections and regulations. 2. JOB ACCOUNTABILITIES LINKED TO OBJECTIVE AREAS Execute - Complies with all relevant safety, quality and environmental management policies, procedures and controls to ensure a healthy and safe work environment. - Ensures safety of staff and that they have the skills, knowledge, and confidence to work safely by providing support, direction for the desired safety behaviours and leading with safety. - Implements departmental policies, processes, procedures and provides instructions to the team on the day of operations. - Implements day-to-day operations assigned and ensures compliance with the established standards and procedures - Contributes to the identification of opportunities for continuous improvement of systems, processes and practices, cost reduction and productivity improvement - Attends to queries from customers on export or import of freight to ensure that all information is provided in a timely and accurate manner. - Follows up on customer complaints by attending to them and recording them and initiating relevant action on functional and operational issues to ensure customer satisfaction and long term relationships using specific software programme - Ensures staff are aware about changes such as new destinations, tariff, fuel surcharge, embargo restrictions and specific guidelines given to customers for shipments like AVI/HUMPER/DGR/VUN in order to disseminate accurate and prompt information - Supports Cargo Customer Service Supervisor to compile statistics to generate the required reports on the sales/revenue which needs to be handed over to revenue accounts on a daily basis to ensure that correct rates are applied and payments ae claimed from respective agents as well as service levels. - Maintains Cargo Contact Centre database by obtaining correct and updated details of customers and same to be updated in the database application year. Updates all new information regarding embargos, restrictions and Agent/Airline contact details in Call Centre Rate System. - Manage the Calogi Helpdesk mailbox and ensure timely correspondence to customers on queries / issues. - Participate in commercial activities of dnata Cargo whenever required by the management.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}