{
    "Job ID": "69858812",
    "Description": "Au sein de la Direction Artistique Parfums Beauté & Horlogerie Joaillerie, vous rejoignez l’équipe Outils, Data et Solution de la direction des Opérations Créatives.Vous êtes en charge d’une partie de notre écosystème outils dédiés aux contenus de la Direction Artistique, à ce titre vous intervenez sur de la gestion de contenu ainsi que de la gestion d’outils documentaires et de projets. Pour ces missions, vous collaborez avec les différentes équipes créatives de la Direction Artistique, les équipes de la coordination des campagnes, le Service Informatique ainsi que nos prestataires externes.1/ Gestion du contenuSolutions de DAM et de gestion de projet :Gestion des livraisons d’assets\nAnalyse, traitement etIndexation des assets\nContrôle qualité des données\nMise à disposition sur les plateformes dédiées\nRévision et harmonisation de métadonnées\nSuivi et accompagnement des campagnes en cours2/ Gestion d’outils documentaires et de gestion de projetsSuivi run et fonctionnel de deux outils :Accompagnement des utilisateurs\nGestion et création des profils et accès\nCollaboration à l’analyse des process et de leur cartographie\nCollaboration à l’analyse documentaire et à l’évolution des outils selon les besoins des utilisateurs dans une démarche d’amélioration continue\nConstitution de fichiers de données pour lapréparation de la configuration des outils\n(workflows, assets, formats, nomenclatures…)\nrédaction de la documentationdes process, méthodes et indexation de nos outilsPROFILDe formation supérieure type Master en documentation multimédia, vous justifiez de 5 ans d'expérience.Vous êtes doté d’un excellent relationnel et sens de la collaboration. Vous êtes capable de travailler en équipe sur des projets à moyens et longs termes avec rigueur et organisation. Vous maîtrisez des logiciels et des applications documentaires tels que DAM et BPM.Votre appétence pour les métiers artistiques et audiovisuels vous aidera à réaliser vos missions avec succès.Vous parlez couramment anglais.«  De la singularité de chacun naît la richesse de nos équipes. CHANEL valorise la diversité sous toutes ses formes. »Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Sur, Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}