{"Job ID": "69859208", "Description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (COVID-19), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might haveSome careers open more doors than others.If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.Securities Services provides robust and reliable solutions that enhance performance and mitigate risk, today and in the future. Working with institutional investors, banks, insurance companies, governments and multinational corporations. Markets and Securities Services offers a range of fund administration, global custody, sub-custody and clearing services.We are currently seeking an experienced professional to join the Markets and Securities Services team.Principal Responsibilities:The role to be backfilled is within the Equity Settlements Team that manages the Client Trade Settlement, Regulatory & Client Reporting and various client queries\nThe Role requires strong understanding of the Securities markets along with regulatory knowledge of the Equity Market and the relevant risk principles associated with Equity Settlement Transactions\nCritical role activities involve knowledge on Client Trade Settlements within stringent deadlines on T date, continuous monitoring of Trades, Regulatory Reporting’s, queries & Operational risk, including its identification, assessment & mitigation controlMajor ChallengesManaging services and identifying risk areas within the area of control to meet and beat customer expectations\nEnsure that the activities are done accurately and before the cut offs\nEnsure Staff development and motivation\nAnticipating future client requirements and developing the capabilities to meet the same\nTo operate flexible systemsRole ContextThe Indian capital market is complex and hence it is extremely challenging to continuously offer superior service and flawless execution to our customer base, which are very demanding large institutional clients\nAdditionally, the Custody business is extremely competitive where a single client win / loss can result in revenue worth millions of USD getting impacted. The size of transaction intensifies the operational risks and small error can lead to financial and reputation impact. The custodian, including the operations section, is expected to be a partner to the client through the close liaison with CSVJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}