{
    "Job ID": "69857072",
    "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"Monitoring staff performance and training new employees as needed\nMaintaining inventory levels of food, beverages, and supplies\nEnsuring that all staff members are trained in food safety practices\nManaging catering orders, functions, and events\nTraining and supervising staff members in customer service skills such as greeting guests, providing menus and drink lists, answering questions about menu items and specials, and suggesting appropriate wines or other beverages based on customers’ preferences\nManaging the daily operations of a restaurant, lounge, bar, or nightclub, including hiring and firing staff members as necessary\nAssisting in the creation and implementation of marketing campaigns to increase sales and customer satisfaction\nManaging the financial aspects of a food and beverage operation, such as ordering supplies, paying bills, and managing inventories of food and beverages\nEnsuring that customer complaints are addressed in a timely manner and that all food safety regulations are followedYour experience and skills include:\nAbility to work well under pressure in a fast paced environment\nAbility to work cohesively and collectively as part of a team\nAdd diplomas/certifications required if neededYour team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}