{"Job ID": "69856760", "Description": "About the roleThe air freight industry landscape is entering an accelerated phase of change and transformation, from digitalising the end-to-end value chain to fortifying a true e-commerce experience to the launch of digital freight marketplaces and much more. We recently launched our VISION 2027 Roadmap at Qatar Airways Cargo as part of The Next Generation programme. The roadmap encapsulates the journey to bring about internal and external changes, aiming to simplify business engagements with Qatar Airways Cargo regardless of whether the task on hand is complex or simple.To support our VISION 2027 roadmap, we are looking for bold, imaginative, and change-maker talents. All of whom will support Qatar Airways Cargo’s position as a true leader in the air freight industry. If you want to make an impact, grow your experience and challenge your comfort zone, then join us at Qatar Airways Cargo and be part of The Next Generation of change-makers.Become the ambassador and the orchestrator of Qatar Airways Cargo VISION 2027.We are pleased to announce this incredibly exciting opportunity to be part of Qatar AirwaysCargo Operations teamas a Lead Cargo Quality Assurance Officer in our office in Doha.Join the #MovedByPeople family and leave a mark as part of the Cargo Operations.The role will be responsible for supporting the Business Continuity Plan activities to ensure it is properly implemented and maintained across all areas of the operation under QR Cargo accountability, as well as conduct, follow up and close audits.Some of the tasks include:Conduct audits, inspections and assessments of airports to identify hazards, non-compliances and areas requiring improvement to ensure that cargo operations quality and standards are maintained at all times to meet safety, security, and quality objectives.\nPrepare internal departments and external stakeholders for audits and inspections.\nSupport Cargo Quality Assurance Manager to manage follow up of non-compliances/ observations to ensure adequate closure, track deadlines, provide frequent updates to management, manage the audit database and dashboards, and ensure adequate record keeping.\nReport findings, develop and monitor the effectiveness of the corrective and preventive action.\nTrack Quality Assurance data and process improvement activities.\nSupport aligning cargo training courses with job functions and streamlining the training content and requirements.\nSupport in restructuring and simplifying cargo documentation procedures to ensure compliance and effective understanding by operations personnel.Be part of an extraordinary storyYour skills. Your imagination. Your ambition. Here, there are no boundaries to your potential and the impact you can make. You’ll find infinite opportunities to grow and work on the biggest, most rewarding challenges that will build your skills and experience. You have the chance to be a part of our future and build the life you want while being part of an international community.Our best is here and still to come. To us, the impossible is only a challenge. Join us as we dare to achieve what’s never been done before.Together, everything is possibleAbout youBachelor’s degree with minimum of 4 years of relevant quality assurance experience within the air cargo/ airfreight industry / ground handling agents (GHAs).\nGood experience in auditing cargo operations, aviation security and ground handling operations\nCandidate should have good experience in cargo documentation, development & training taskforce for warehouse and ramp handling of overall cargo\nKnowledge on developing and re alignment of cargo training contents is required.\nStrong knowledge in quality management system and safety management system\nStrong command of the English language\nAirline / Cargo experience is preferred\nAnalytical with high- level problem solving and decision- making skills\nStrong negotiation and interpersonal skills as well as stakeholder management skillsAbout Qatar Airways GroupOur story started with four aircraft. Today, we deliver excellence across 12 different businesses coming together as one. We’ve grown fast, broken records and set trends that others follow. We don’t slow down by the fear of failure. Instead, we dare to achieve what’s never been done before.So whether you’re creating a unique experience for our customers or innovating behind the scenes, every person contributes to our proud story. A story of spectacular growth and determination. Now is the time to bring your best ideas and passion to a place where your ambition will know no boundaries, and be part of a truly global community. How to apply If you’re ready to join a progressive team and have a challenging and rewarding career, then apply now by uploading your CV and completing our quick application form.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}