{"Job ID": "69857433", "Description": "TasksJob Description:Engineer, Model Based EngineeringMercedes-Benz Research and Development, India is seeking Model Based Development Engineers with a strong technical background in Model Based Engineering.Key Job Responsibilities:Responsible for the design and development of AUTOSAR based Simulink, TargetLink models as per the MAAB guidelines with good software engineering practices.\nResponsible for Requirement Analysis.\nResponsible for Test Specifications, Code Coverage, Model Quality and Model Validation (MIL, SIL) to ensure that developed model is bug-free and adheres to Model guidelines.Basic Qualification:Good understanding of AUTOSAR architecture and the AUTOSAR based model development.\nProficiency in C/C++ programming, Matlab scripting, Python scripting.\nMust be aware of MAAB guidelines and must have a good experience in tools like MXAM (Model Quality) and MXRAY(Model Metrics).\nGood exposure to configuration management tools like PVCS, SVN, GIT\nGood exposure to Requirements management tools like DOORS, PREEvision\nMust have good understanding of Model-in-loop, Software-in-loop simulation. In addition, Processor-in-loop will be preferred.\nAbility to scan static code analysis results and perform manual code review in order to identify software security vulnerabilities in the application source code\nGood experience with Vector CAN tools (CANoe, CANape) and compilers tools usage\nExperience with Confluence, Jira would be appreciatedDesired Skills and ExperiencePreferred Qualification:·       Good communication skills and ability to work in & contribute as a good team player·       Experience in the automotive field and exposure of multi-cultural environment is an added advantage.·       Basic knowledge on German language preferred.Qualifications - External·         Bachelors or Master’s Degree in Computer Science/Electrical & Electronics/ Masters in Computer Applications2 to 4 years of experience in automotive Model Based development activities including model development, debugging skills and auto-code generation using Matlab, Simulink, Stateflow and TargetLink.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}