{
    "Job ID": "69857761",
    "Description": "Date Posted:Country:Location:·      Interface to the other agencies (Client Office, System wide contractors) at the project on behalf of OTIS.·      To assist the supervisor in consolidating the targets and objectives set for the team. Assist the supervisor to prepare rolling plan for the year.·      Working as per monthly planning for completion of the assigned jobs.·      To meet the supervisor to discuss requirements, progress, and to solve or technical problems.·      To work in an area where construction work is carried out to achieve required standards of performance and quality.·      To actively Participate in EH&S training and TBT as per EH&S plan.·      To work according to EH&S rules and procedures which are adhered by all employees at all job sites.·      To maintain cordial relations with builders, owners, architects, government inspectors etc.·      Will be responsible for ensuring timely completion of installation/commissioning work at sites.·      To work along & getting work done thru sub cons and own installation teams.. Should have relevant experience of Metro rail work with total 8-10 year experience with Diploma- Electrical/Mechanical / 5-6 year experience with B.Tech- Electrical/Mechanical.Otis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. To request an accommodation in completing an employment application due to a special need or a disability, please contact us at careers@otis.com.Privacy Policy and Terms:Click on this link to read the Policy and TermsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}