{"Job ID": "69857278", "Description": "Roche Diagnostics Middle East is looking for an experienced, collaborative attorney to join our Legal & Compliance Department as Legal Counsel with focus on Privacy. In this role, you will report to the Head of Legal and Compliance / Compliance Officer Middle East, and will be responsible for advising on, training and promoting compliance with data protection and privacy laws and regulations affecting business activities primarily in the Middle East region, with some overlap with other global privacy laws, such as Europe (GDPR) and USA. You will develop and implement related policies, practices, and training programs, and help business stakeholders to understand and address data protection and privacy issues as they emerge in the development of new products and technologies. You will be expected to stay abreast of developments and trends in data protection and privacy laws and regulations and enforcement.Responsibilities:-Act as a key internal point-of-contact and subject matter expert on all matters relating to privacy law, including providing practical, timely, strategic, and high-quality legal advice on data privacy and security matters. \n-Advise members of the legal, compliance and business teams on best practices and compliance with Middle Eastern and global data protection laws, including legal and regulatory aspects of data collection and use, privacy disclosures and transparency, consent forms, and related issues.\n-Support and develop the company’s privacy program to enable consistent, effective data privacy practices and minimize privacy risk. \n-Provide legal support for the strategic reviewing, drafting, and negotiating of privacy and data security terms in contracts with business partners and vendors, including data processing agreements and data protection terms in various agreements.\n-Provide advice, education, training, and legal direction on data protection laws impacting business operations and contractual relationships. \n-Strategically advise on emerging products and technologies while anticipating and successfully navigating privacy considerations.\n-Provide legal counsel on investigations involving reports of inappropriate or unauthorized access, loss or disclosure of personal data, including advising on potential liability, identifying legal obligations, and supporting incident response efforts. \n-Identify and advise on key legal issues requiring attention from the privacy team, and anticipate potential privacy legal issues within the organization.\n-Coordinate with other privacy and security professionals in the organization’s global privacy and security community to align on guidance and create work product. -Work closely with key functions, including IT Security, Compliance, and Roche affiliates to advise on the company’s privacy strategy and manage complex privacy matters involving systems and data processing activities.\n-Advise on and provide support for various legal topics (not directly related to data privacy matters) and perform miscellaneous legal job-related duties as assigned. Requirements:-Bachelor’s degree in law graduate or equivalent and bar membership in good standing is required and post graduate degree is preferred. \n-At least 7-10 years of experience as a practicing attorney, in-house and/or at a law firm including at least 3 years of direct, hands-on experience providing legal counseling on data privacy and security matters in the life sciences industry. \n-The successful candidate will be a subject matter expert on requirements of data protection and privacy legal issues that affect the business activities of a healthcare company, including digital health information, intra- and inter-company business transactions, sales and marketing, and consumer protection; will also serve as a subject matter expert on privacy issues associated with employment.-Comprehensive understanding Middle Eastern data privacy laws, health laws and EU General Data Protection Regulation (GDPR). \n-Substantial experience assessing legal risks relating to data protection and privacy, and identifying and advising on practical, compliant ways to mitigate those risks.\n-Experience with data loss prevention and cybersecurity events, including forensic investigations, breach notifications, and cybersecurity preparedness.-Experience with privacy litigation and enforcement is a plus.\n-Excellent negotiation and communication skills (both oral and written) are a must.\n-Experience and interest in new and emerging technologies, including in the areas of digital health and personalized healthcare.\n-Strong organization and teamwork skills, a strong work ethic, and the ability to multitask and prioritize well, take initiative, lead projects, and work effectively both independently and in collaboration with others. \n-Detail-oriented, self-motivated, and able to motivate others.\n-A strong commitment to integrity and professionalism and demonstrated passion for excellence combined with strong leadership skills and sense of accountability, passion, resilience and teamwork.\n-Experience navigating and having effective impact in a large multinational and complex matrix organization is preferred. \n-Ability to deal with a variety of situations that require independent judgment and the ability to influence others.  At Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Law Firm", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}