{
    "Job ID": "69858522",
    "Description": "Amazon Global Store (AGS) is looking for a seasoned Business Intelligence Engineer. Global Store enables cross-border customers to purchase products on their local Amazon Stores that currently ship to over 77 countries with guaranteed shipping and import duty fees. We seek to provide a customized experience that allows customers anywhere in the world to buy products from all of Amazon marketplaces. Our mission is to provide a one-stop shopping experience to international customers.\nThe candidate should have broad technical skills to build analytical and reporting capabilities to deliver on strategic analytical/reporting projects, define/produce end-to-end metrics that inform product, business, and finance decisions and identify new growth opportunities through data-driven insights.\nThe ideal candidate relishes working with large volumes of data, enjoys the challenge of highly complex business contexts, and, above all else, is passionate about data and analytics. The role-holder will be working to increase visibility into data and enable data driven decision making. He/ She will also be responsible for conducting deep dive analyses to solve complex business problems. This position requires good knowledge of business intelligence solutions and data engineering practices, and the ability to collaborate with various teams across the organization. Candidate should be comfortable with ambiguity, capable of working in a fast-paced environment, possess strong attention to detail, and able to collaborate with users to understand and transform business problems into requirements and deliverables.\nKEY RESPONSIBILITIES\n- Own the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, and interface with business and finance customers to drive Process and product improvements to shape the future of our business\n- Design, architect, implement, and support key datasets that provide structured and timely access to actionable business information\n- Develop reports & dashboards using Excel, Tableau, QuickSight, and other visualization tools across product, business and finance teams, to increase visibility into business performance\n- Propose and prioritize changes to reporting, create additional metrics, and own the data presented. Periodically identify opportunities to optimize the query and automate the process. Convert data into an analysis-ready state.\nWe are open to hiring candidates to work out of one of the following locations:\nChennai, TN, IND\n- 1+ years of data engineering experience\n- Experience with data modeling, warehousing and building ETL pipelines\n- Experience with one or more query language (e.g., SQL, PL/SQL, DDL, MDX, HiveQL, SparkSQL, Scala)\n- Experience with one or more scripting language (e.g., Python, KornShell)\n- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\n- Experience with any ETL tool like, Informatica, ODI, SSIS, BODI, Datastage, etc.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}