{"Job ID": "69857738", "Description": "Experienced Complex Hosting Infrastructure ArchitectCompany:Job ID:Date Posted:Location:Job Description Qualifications:At Boeing, we are all innovators on a mission to connect, protect, explore and inspire. From the seabed to outer space, you’ll learn and grow, contributing to work that shapes the world. Find your future with us.The Boeing Company is seeking an Experienced Complex Hosting Infrastructure Architect to join their team in Bangalore, KA, India.  A successful candidate will focus on projects and functions supporting the Infrastructure Architecture Consulting team (Complex Hosting), including, but not limited to Global Infrastructure Architecture & Design, Cloud Architecture & Design and Maintaining relationships with IT Business Partners for requirements, design and implementation of infrastructure projects.  This position will place the candidate in a role where they would have the opportunity to make an impact on the results of the future. The team offers a collaborative mentoring environment where you the candidate will have the opportunity to learn from and lead others.Position Responsibilities•    Evaluate feasibility of architecture solutions and alternatives that fulfill infrastructure requirements\n•    Develop sound business cases in order to obtain sponsorship and secure funding\n•    Develop service requirements and designs encompassing Global, Strategic Data Center, Local Presence Server Rooms (LPSR), Classified, Optimal Enterprise Integration (OEI), etc. \n•    Acts as project/process interface and escalation point for coordinating design components and implementation with service providers and stakeholders \n•    Communicate Information Technology infrastructure, service and technology changes and provide guidance\n•    Design cost effective solutions that align to Information technology infrastructure and architectural standards, exploring cloud first solutions and leveraging design patterns for reuse.\n•    Collaborate with Information Security, Global Trade Controls, Global Privacy Office and Legal (domestically and International) \n•    Contribute to architecture and data/information management standards and strategies\n•    Establish design constraints and ensure architecture conforms to requirements\n•    Monitors and provides guidance during design and implementation efforts \n•    Documents infrastructure hosting requirements and translates them into infrastructure design solution options to satisfy the hosting requirements. \n•    Creates integrated design package documenting recommended design solution details\n•    Validates with the requestor and stakeholders that the infrastructure has been delivered per the design\n•    Engages service task performers to ensure tasks are performed in time to meet the requestor need date as detailed in the implementation plan. Basic Qualifications (Required Skills/Experience):•    5+ years of experience in information technology client/server, storage, network, cloud, information security development\n•    3+ years of practitioner skills in cloud providers such as Amazon Web Services, Microsoft Azure or Google Cloud PlatformPreferred Qualifications\n•    Bachelor’s Degree or higherTypical Education & Experience:\nEducation/experience typically acquired through advanced education (e.g. Bachelor) and typically 6 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+4 years' related work experience, 10 years' related work experience, etc.).Relocation\nPosition does not offer relocationBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}