{"Job ID": "69857365", "Description": "Requisition ID: 271814 Relocation Authorized: None \nTelework Type: Full-Time Office/Project \nWork Location: New Delhi Bechtel India is a global operation that supports execution of projects and services around the world. Working seamlessly with business line home offices, project sites, customer organizations and suppliers, our teams have delivered more than 125 projects since our inception in 1994.Our offices in Gurgaon, Vadodara and Chennai will grow significantly and sustainably with exciting career opportunities for both professionals and young graduates who are passionate about creating a cleaner, greener, and safer world; building transformational infrastructure; making decarbonization a reality; and protecting people and the environment.Position summary:The proposed position is for a Document Controller to support project in records management and administrative activities for one or more key result areas. Key activities include understanding GBU specific and project specific work process, plan, control, distribute and transmit records as per defined guidelines, using automated tools; and finally archive project records as directed by Project management.Maintaining quality, correctness and timely execution of activities are critical requirements of the position.Document handling will primarily be electronic in a collaborative Content Management System (ECMS), Aconex, to register, control, distribute, transmit, file and archive project records.Experience:Minimum of 10 years’ practical document/records/information management experience. Experience in EPC industry is desirable.\nExperience in using standard Electronic Document Management System (EDMS) to register, control, distribute, transmit and archive project records. Plans, controls, and carries out records management and administrative activities for the project for one or more key result areas, e.g., document control, communications control, file administration, and coordination with client’s document management team and support.\nProven capability of processing a high volume of supplier and/or project documentation.\nDevelop and support the implementation of the records retention and turnover plans.\nWork in team environment and provide training on Work process and tools.Location: GurgaonEducation:Postgraduate/ Graduate in any discipline and Computer Literacy. Certification in Information and Documentation Management is desirable.\nPre-requisites:\nProficiency in using Computers, and software such as MS-Excel, MS Access or any other Database Management Software is a pre-requisite. Work experience on Aconex or any other Document Management Solution is essential.Job description:Should have excellent hold on Excel features, and competency on Excel Macro writing etc. shall be considered as added qualification.\nProcessing Project Records in native drawings formats (mainly MicroStation and AutoCAD drawings), signed PDF format, converted PDF format from native file, Word, Excel, PowerPoint etc\nDistribution of Project Records from Aconex to desired work groups (Clients, Suppliers, Engineering & Procurement team, etc)\nQuick retrieval of Project Records from Aconex\nPublishing document metadata, turnover of Project Records (both electronic as well as hard copy) as determined by the Project Management Team\nAdministrative tasksOther Requirements:Excellent communication skills (oral and written)\nStrong aptitude for automation and eager to learn.\nStrong analytical skills to identify problems and work with Global Team / Vendor to determine, develop and implement solutions.\nGood interpersonal skills to provide daily user support.\nAbility to prioritize and flexibility to multi-task in a fluid environment.\nAbility to work independently with minimal supervision in challenging, dynamic work environment.\nWillingness to work on extra time, if required by the project.Additional responsibilities:Establishing the document management work process, to be followed on the project, and its implementation, including revision control and configuration control.\nParticipate in the configuration of the Electronic Content Management Systems (ECMS) tool and arrange for/provide training.\nPreparation and maintenance of the distribution matrix for the project\nSupervising and guiding project level document controllers in their delivery\nQuality assurance in the documentation processes.\nGenerate reports as required by the management team and customer.\nDevelop and maintain a project record retention plan and matrix.\nDevelop and maintain the project turnover plan.\nKnowledge of multiple ECMS systems\nProviding ECMS training to internal and external project participants, like Client’s team, and Supplier / Subcontractors.\nExperience with workflows, packaging, document configuration management\nKnowledge of Industry and regulatory standards for record keeping\nAbility to analyse and solve problems, in dynamic work environment.\nWork process mapping and procedures/guidelines/training material development\nMinimum of 5 years’ experience in managing a document management team\nTeam player with excellent communication and presentation skills\nDemonstrated experience with typical Microsoft office applications, such as Word, Power Point, Excel, and VisioPreferred Qualification:Advanced knowledge and practical experience using Aconex.\nA degree qualification in Information Management or related subject.Shaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}