{"Job ID": "69856797", "Description": "Faithful+Gould are looking for a Senior Project Manager - (Sewage Treatment/RO Plant) with PMC and Contractor background in Riyadh, KSA.As a senior member of the team, you will provide support to your direct reports, foster teamwork both within the Region and Faithful+Gould generally, provide technical inputs to project teams and ensure that the client’s objectives are delivered.Further, you are expected to conduct yourself in line with the core values of the business and lead by example in maintaining the Faithful+Gould culture:Integrity; we act with honesty and integrity in everything we do\n\nClient service; we are dedicated to creating value and delivering service excellence\n\nTeamwork; we work together to achieve common goals\n\nInnovation; we strive to deliver innovative solutions\n\nCommitment; our people are our strength and we value the Faithful family and community  MINIMUM REQUIREMENTS The minimum requirements for this role include: Bachelor’s Degree in Engineering discipline from a recognized University.\n\nProfessional qualifications like PMP, PRINCE2 etc.\n\n15+ years post qualification experience in Project Management & Delivery\n\nKSA expereince is mandatory\n\nDemonstrated track record of infrastructure projects delivery - (Sewage Treatment/RO Plant).\n\nExperince with PMC companies as well as large contractors\n\nSignificant experience in supervising the construction of complex projects similar in size and nature to our projectRESPONSIBILITIESThe role involves the execution of duties to the highest possible standards. It is expected that the role will include but not be limited to the following key functions:Ensure the successful delivery of the project in terms of progress, quality and cost budgetary constraints.\n\nReview & approval of Technical documents submitted by the Developer to the Client and\nascertain if they comply with Project Specifications\n\nMonitoring the project deliverables meet with the agreed standards and satisfy\nstakeholder requirements at each stage of the project.\n\nMonitoring overall project stakeholder relationships and adjusting strategies and plans for engaging stakeholders.\n\nDevelop and establish the policies, procedures, and documentation for planning, developing, managing, executing, and controlling the project schedule, including monitoring project tasks and workflows in order to complete the project on schedule.\n\nIdentify and document specific actions including establishing milestone to be performed to produce the project deliverables.\n\nDevelop and implement policies, procedures, and documentation for planning, managing, expending, and controlling project costs.\n\nIdentifying issues that impact the project and managing them through to resolution.\n\nDevelop a robust change control system by setting a project baseline and identifying, reviewing, approving and monitoring proposed changes to the project scope.\n\nDevelopment of a detailed specification based on the design guideline provided to developer.SKILLS AND ATTRIBUTESYou should be equipped to:Manage and coordinate the inputs of project stakeholders and appointed contractor to ensure the successful delivery of the project.\n\nAssess and resolve site planning and coordination issues.\n\nApply quality management principles and processes.\n\nApply risk assessment and management principles and processes.\n\nNetwork effectively, negotiate well and influence people, broker relationships with stakeholders within and outside the project.\n\nBe aware of the broader perspective and how it affects the project.SNC Lavalin’s Faithful+Gould business is one of the world’s leading integrated project and programme management consultancies, with over 2,400 professionals operating worldwide.Our aim is to protect and maximize our clients’ interests throughout the planning and delivery of projects, ensuring they are delivered on time, on budget. We pride ourselves on collaborating with client teams and developing long-term relationships.Key services include - Project management, programme management, project controls, commercial management, cost management and expert scheduling and construction planning.Our industry is going through a digital transformation and we have been investing in and pioneering digital methods to improve all aspects of our service. We have focused our digital transformation around platform modernization and product development and through standardization and automation, we are achieving efficiencies that are directly passed on our clients who benefit from a consistent quality of service as well as the savings. Active in the Middle East for over 20 years, we have offices in the UAE, Qatar, Oman and Saudi Arabia. We hire and retain only the best people in the industry. Our success is built on recruiting – and then developing – brilliant people from a broad range of professional and cultural backgrounds. It’s precisely this diversity of talent that sets us apart.Acquired by SNC Lavalin in 2017, we also have an extensive depth of geographic exposure across 50 countries and the breadth of 53,000 experts. As one of the largest engineering contractors, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the region. REWARDS & BENEFITSWe offer an excellent package which includes:A competitive salary.\n\nMedical and life insurance cover.\n\n22 business days annual leave.\n\nDiscretionary bonus scheme.\n\nAnnual flight allowance to point of origin.SNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}