{
    "Job ID": "69856848",
    "Description": "Senior/Principal Structural EngineerAtkins is looking for a number of Senior and Principal Structural Engineers to join our growing team in the Middle East within our UAE offices. This is an exciting opportunity to join a developing department within a large multi-disciplinary organisation delivering high quality engineering developments. As a provider of multi-disciplined technical services to the built environment Atkins in the Middle East is committed to design excellence in the delivery of first-class solutions which combine innovation, imagination and best practice.We encourage vision, problem-solving, ambition, enthusiasm and drive. We recognise that people are the key to our success, and our senior and principal engineers will form the future of our business. We ensure that we provide you with a varied workload and encourage you to extend yourself in order to reach your potential.Note - We are currently pending award on several significant projects. Should we be awarded, this position is a key role. Consequently, we are keen to speak to individuals in the market place with the experience listed below for such potential future programmes of work.ResponsibilitiesThis is a full-time role working Monday to Friday, 8am-6pm. You will join Atkins as a Senior/Principal Engineer within the Middle East business to support the team on our growing portfolio of projects within the region. Key responsibilities include:Has sole responsibility for significant and complex activities or projects\nResponsible for checking the quality and accuracy of own and others’ work\nResponsible for monitoring budgets and controlling expenditure to meet financial targets for own areas.\nResponsible for predicting and planning future resources which may include setting up new projects (technical or business) and project plans\nResponsible for meeting agreed deadlines\nRepresents the company at internal and external meetings\nAuthors official documents e.g. letters and reports (for internal or external use)\nExecutes responsibilities as outlined in the firm’s Management System\nDemonstrate excellent communication with all project stakeholders, sub-consultants and clients.\nConsiders and suggests practical and innovative approaches and ideas to create competitive advantage.\nEncourages the development of innovative ideas\nCollaborate effectively and efficiently with Atkins employees within other offices and sectors of the business.\nExhibit a collaborative One Company mind-set in the support of colleagues throughout Atkins.\nMay in addition be responsible for one or more of the following:\nResponsible for the performance, work and development of others, providing guidance, training, motivational and directional feedback\nResponsible for the achievement of financial targets in specified areas; contributes to the setting of budgetsSpecific ResponsibilitiesEnsure that the structural design is multidisciplinary coordinated, meets client brief, adequate, safe, efficient, durable, constructible, meets local codes/authorities’ requirements and designed to best engineering practice.\nUse computer-assisted engineering and design software and equipment for simulation purposes and to prepare engineering design documents\nResearch design options and document findings\nDirect and supervise other Designers/Drafters activities as required\nPerform structural design and analysis calculations using governing codes and standards, engineering formulas, skills and experience\nApply expert knowledge of the forces that act on various structures\nResearch design options and document findings\nProvide drawing for own designs and produce sketches to incorporate in drawings by Designers/Drafters\nReview shop drawings.\nLead the structural design of several mega projects, implement innovative solutions, check the design against project brief and the accuracy of the work by the Team.\nHandle contract administration\nDemonstrate capability and experience in managing and performing projects in a fast paced environment\nTo have strong project/design management capabilities for delivery and execution of high-end projects through multidisciplinary design teams, sub-consultants, vendors, contractors, PMCs, clients, and other project stakeholders to ensure the integrity of the overall design and full adherence to QAQC procedures.\nTo be familiar with procurement, tendering, developing client brief, change management, contracts variations, managing risks, cutting costs, controlling the work based on schedule and cost baselines & ensuring profits exceed expected margins.\nKeep abreast of industry developments globally, improve technical excellence, H&S regulations, digital design delivery and promoting this culture within the team, running projects and the wider community\nFocusing of high-quality standards and Client satisfaction, thereby increasing the chance of repeat business (Business development), by maintaining a high standard of reliability and trust.RequirementsWe are looking for enthusiastic individuals with good written and verbal communication skills who have the desire to learn, grow and work as part of a team. Typically, our senior engineer will have the minimum.A good engineering degree (honours or equivalent) in civil or structural (essential)\nChartered Engineer or in the position to imminently submit a chartership application to a recognised engineering institution\nMinimum 12 years experience\nHas a significant professional consulting experience of operating predominantly within challenging consulting environments and where a significant component of that experience should be from solution designs as well as from the management of projects and tenders.\nHas widespread experience of taking the lead on consulting projects and in acting as an engineering, managerial and functional resource.\nDemonstrates strong consulting and business acumen as well as strong engineering, technical and functional acumen, in relevant domains of knowledge.\nHas excellent English language skills (written and oral), coupled with strong communication (written and oral) and negotiating skills.\nGood presentation skills and the ability to interface with clients (e)\nProject control and management experience (e)\nGood reporting skills in the written form\nPreparation of designs throughout all RIBA stages.\nExcellent knowledge in the use of Etabs, Safe and other FE software\nAbility to complete hand calculations when required to ensure models are working as intended.\nAbility to review designs and provide comments, with validation.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}