{
    "Job ID": "69858167",
    "Description": "Executive Assistant - Prime and Customer Fulfillment Experience (CFX)\nAmazon India Prime and CFX is looking for an Executive Assistant to support the Prime and CFX Leadership team. The Prime/Customer fulfillment experience leader leads three divergent charters, currently for India – Prime, Delivery Experience & Sub-Same Day experience and Returns and Cost of Business Waste.\nWe are looking for an Executive Assistant (EA). Executive Assistants engage in activities to increase capacity and effectiveness of the leader and contribute to the overall department efficiency. These activities often include the following: creatively optimizes the Leader’s time through effective calendar management; acts as a resource to the department with a thorough knowledge of company operations, policies and procedures; implements accurate and detailed project plans that align to the business cycle and uses good judgment when in contact with sensitive and highly confidential information.\nKey job responsibilities\n1. Management of complex calendar and scheduling to support teams in multiple locations\n2. Work closely with the leadership team, recruiting and other Executive Assistants to provide support to the organization\n3. Manage domestic and international travel\n4. Manage expense report coordination and submission\n5. Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)\n6. Act as a liaison for direct reports\n7. Management of team space, including moves and reconfigurations\n8. Have fun at work and help others do the same\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- Experience with Microsoft Office products and applications\n- Experience leading process improvements\n- Experience in a fast-paced, high-tech company\n- Experience designing processes to maximize efficiencyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}