{"Job ID": "69857839", "Description": "In the words of Isadore Sharp, Founder and Chairman of Four Seasons Hotels and Resorts: “The reason for our success is no secret. It comes down to one single principle that transcends time and geography, religion and culture. It’s the Golden Rule – the simple idea that if you treat people well, the way you would like to be treated, they will do the same.” This philosophy is the cornerstone of the Four Seasons culture, truly making Four Seasons the best company to work for.  Four Seasons Hotels and Resorts has been recognized by FORTUNE Magazine’s 100 Best Companies to Work for, every year since the survey began in 1998. Join our Team Work on a team that is built on mutual respect, collaboration, and excellent service. \nFour Seasons provides employees with the same level of care that we expect to be shared with our guests. \nFour Seasons have been ranked in FORTUNE Magazine's 100 best companies to work for. Four Seasons Doha Serviced Apartments at The Pearl Qatar:The upcoming project will include 161 fully-furnished apartments, perfect for both short and long-term stays, as well as 84 Private Residences, set along a private beach surrounded by lush gardens. Guests and residents alike will enjoy a full range of state-of-the-art amenities, including a signature restaurant by Michelin-starred chef, Joël Robuchon. Our Team:Our team is our greatest asset and the key to our success. We demonstrate our beliefs in the way we treat each other and by the example we set for one another. In all our interactions with our guests, customers, business associates and colleagues, we seek to deal with others, as we would have them deal with us. Our team is built on mutual respect, collaboration, excellent service and passion.  Who We Look For: We look for employees who share the Golden Rule; people who, by nature, believe in treating others as we would have them treat us. We look for individuals who share a passion for excellence and who infuse that enthusiasm into everything they do. Job Description:The Four Seasons Doha Serviced Apartments is looking for IRD Order Taker to join our talented pre-opening team! Don't miss this unique opportunity to be part of the world's leading luxury hotel company! This individual takes ownership over their role and operation and can quickly connect to those around them. Confidence, adaptability, and the assurance of a quality experience make a successful candidate for this role.   Essential Functions:The Room Service Order Taker is an essential member of the Food & Beverage team dedicated to providing exceptional quality and service to our guests. Always just a telephone call away, around the clock, the In-Room Dining team provides a wide selection of food and beverage options delivered to the comfort of guests’ rooms. The friendly and courteous voice of the Room Service Order Taker receives all guest requests for an In-Room Dining experience.The Room Service Order Taker is an authority on all available food menus, including daily specials, alternative cuisine and all beverage lists.\nThis position makes recommendations to accommodate guests’ preferences and dietary restrictions.\nThe Room Service Order Taker oversees the entire sequence of service ensuring guest orders are correctly processed and carried out by the servers within the stated delivery time according to Four Seasons Standards.\nThis position involves a heavy volume of guest contact and fluency in reading, writing, and spoken English is required. The ability to assume responsibility of the department in absence of a manager is essential.\nThe Room Service Order Taker ensures all orders meet Four Seasons Standards and Sequence of Service and any guest complaints are promptly shared with the Room Service Manager for immediate follow up.\nThe ideal candidate will also have solid food and beverage knowledge, a pleasant voice and a positive attitude.\nReceive all guests requests for an In-Room Dining experience\nAcknowledge all available food menus, including daily specials, alternative cuisine and all beverage lists.\nMake recommendations to accommodate guests’ preferences and dietary restrictions.\nOversee the entire sequence of service ensuring guest orders are correctly processed and carried out by the servers within the stated delivery time according to Four Seasons Standards.\nMake sure guest complaints are promptly shared with the Room Service Manager for immediate follow up.    Preferred Qualifications and Skills2-4 years of experience in related field\nExcellent command in English, Arabic is an advantage\nService Passion for Luxury Hospitality and have an eye to details.Our Offering:-Opportunities to build a successful career with global potentialUnique strong culture - diversity of 50 different nationalitiesLiving accommodation in a high quality, well-resourced apartmentExcellent Training and Development opportunitiesEmployee Recognition ProgramsComplimentary nights at FS Hotels WorldwidePaid annual home leave ticketsComplimentary meals in employee restaurantsFree transportation to workMedical coverage Work Authorization:-Hotel will apply for the work authorization for a successful candidate. Learn more about employment with Four Seasons:-You could also learn more about employment with Four Seasons via the following channels:https://www.facebook.com/FourSeasonsJobshttps://www.linkedin.com/company/four-seasons-hotels-and-resortshttp://jobs.fourseasons.comhttps://twitter.com/FourSeasonsJobsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}