{
    "Job ID": "69858504",
    "Description": "About the role: The successful candidate will facilitate the development of online products, systems and ancillary services to support Emirates Online Sales Development objectives in line with the overall commercial strategy, across all online channels including mobile sites and apps. This includes assessing and understanding areas such as product research, system development, customer usability, regulatory changes, business impact assessment, business case development and user requirements for these products and services. Project manage the implementation of all new products which are made functional in the web and mobile sales channels. Co-ordinate activity between representatives within Online Sales and with all relevant departments such as CCMB, Commercial, Revenue Optimisation, Skywards, Airport Services etc. to ensure all products, services and ancillaries are utilised to their full potential in order to meet applicable online targets set for the department. What you will do: Generic - Lead the Online Sales Development product and systems strategy and vision in terms of creation, delivery and continuous improvement to support the differentiation of Emirates. - Align the Desktop and Mobile channel with other direct channels to deliver customer transaction efficiencies by servicing them online. - Conceive and implement short term and long term product programs for B2C, B2B, B2T and Mobile. Analyse the marketplace, competitors and customer behaviour to determine the most appropriate product feature sets. - Gather and transform business requirements into product specifications and documentation (a credible business case, functional specification and a project plan), in tandem with Online Sales Operations. - Facilitate implementation of an ancillary strategy and associated delivery capability for online and mobile, for both flight and non-flight related products, ensuring that all relevant departments inputs are included in the final delivery. Once delivered, continue to maintain, monitor and enhance the ancillary offering. Ancillary Services - Develop and refine the air and non-air ancillary offer strategy throughout the various customer journeys. Partner with internal online sales teams and other external departments to develop and implement the Ancillary Roadmap - Optimize air and non-ancillary pricing tactics and strategies using best practices in ancillary merchandising. Deliver innovative merchandising methods, product evolution, and improved operational efficiency - Develop and write detailed business requirements for new ancillary products and ancillary product enhancements. - Collaborate with the product team and coordinate with internal and external stakeholders to understand, prioritize, and define customer and business needs - Build and implement pricing optimization models for air and non-air ancillary products. - Oversee day-to-day needs of ancillary operations and overall management of ancillary products. Serve as the primary internal point-of-contact for questions regarding the assigned ancillary products - Develop and monitor the monthly, quarterly, and yearly performance for the various ancillary products against budgets. - Establish and foster trusting relationships with stakeholders at all levelsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}