{"Job ID": "69856880", "Description": "About AtkinsRéalis  Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn.  Associate/Associate Director Structural EngineerAtkinsRéalis is looking for a number of Associate Structural Engineers to join our growing team in the Middle East within our UAE offices. This is an exciting opportunity to join a developing department within a large multi-disciplinary organisation delivering high quality engineering developments. As a provider of multi-disciplined technical services to the built environment Atkins in the Middle East is committed to design excellence in the delivery of first-class solutions which combine innovation, imagination and best practice.We encourage vision, problem-solving, ambition, enthusiasm and drive. We recognise that people are the key to our success, and our Associates/Associate Directors are the future of our business. We ensure that we provide you with a varied workload and encourage you to extend yourself in order to reach your potential.Note - We are currently pending award on several significant projects. Should we be awarded, this position is a key role. Consequently, we are keen to speak to individuals in the market place with the experience listed below for such potential future programmes of work.ResponsibilitiesThis is a full-time role working Monday to Friday, 8am-6pm. You will join Atkins as a Associate Director within the Middle East business to support the team on our growing portfolio of projects within the region. Key responsibilities include:Company Management\nSupport Directors in management functions\nAttend the Company’s monthly BUL meetings.\nManage and lead a team\nLead, develop and manage the team to ensure a high level of technical quality and commercial performance\nBecome a Technical Champion for Atkins in the Middle East and drive our expertise out into the market both for clients in developing new business and additionally to peers within the industry.\nExperience in design leadership, presentations, collaboration, structural calculations, reports, specifications and overseeing the delivery of our REVIT/BIM teams.\nManage any HR issues of the team with Directors and HR.\nCarry out regular staff appraisals with Management\nKeep accurate project records for monthly recording and forecasting of earnings levels against agreed fees.\nForward planning in relation to work ahead and revenue/resource forecasting.\nAssist with and control the commercial management of the team to ensure costs in line with revenue.\nManage and guide team members within the team to assist with their development.\nOrganise and attend regular team meetings\nManage project delivery\nMaintain co-ordination of project work to ensure timely delivery and quality.\nAgree project deliverables directly with the Client and other Professionals.\nMonitor project progress against expected programmes and manage resource levels accordingly.\nAdapt to different cultures and working environments with the ability to work under pressure, in addition, being flexible travelling across the GCC and overseas.\nEnsure that designs are undertaken in accordance with the current Quality Management procedures and design Standards\nEstablish relationships with existing and prospective clients.\nOccasionally carry out site inspections.\nManage co-ordination of work undertaken by external sub-contractors and design checkers.\nUndertake direct engineering activities on an as needs basis and where appropriate act as Design Team Leader.\nActively Partake in Client Care\nRepresent and enhance the image of the company at external client meetings\nDevelop working relationships with existing Clients and assist with gaining further commissions.RequirementsWe are looking for enthusiastic individuals with good written and verbal communication skills who have the desire to learn, grow and work as part of a team. Typically, our senior engineer will have the minimum.A good engineering degree (honours or equivalent) in civil or structural (essential)\nA Chartered civil/structural engineer with the MICE or MIStructE.\nMinimum of 15years experience\nHas a significant professional consulting experience of operating predominantly within challenging consulting environments and where a significant component of that experience should be from the management and/or solution designs as well as from the management of projects and tenders.\nHas widespread experience of taking the lead on consulting projects and in acting as an engineering/technical/functional resource.\nDemonstrates strong consulting and business acumen as well as strong engineering, technical and functional acumen, in relevant domains of knowledge.\nExperience in the design of building structures.\nSound experience in conceptual design.\nLeadership/Management experience.\nStrong communication skills, independent working, presenting and influencing skills.\nSuccessful experience of project and team collaboration\nProven track record of successful delivery and client management.\nA broad understanding of industry BIM requirements.\nExperience in change management and quality assurance processes.\nCommercial awareness including the ability to scrutinise contracts to negotiate preferential terms.\nDemonstrates the ability to enhance client relationships and support the winning of business opportunities and development of proposals.\nGood organisational and interpersonal skills and the ability to work well under pressure.\nFlexibility and willingness to travel, if required.\nHas excellent English language skills (written and oral), coupled with strong communication (written and oral) and negotiating skills.\nGood presentation skills and the ability to interface with clients\nGood reporting skills in the written form\nPreparation of designs throughout all RIBA stages.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}