{
    "Job ID": "69857587",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Assistant manager - soft servicesProperty and Asset ManagementWhat this job involvesYou will oversee the housekeeping services and team at site. Your main role will be to ensure we provide excellent hygiene standards at the site as per client requirements. You will also be assisting management and Property Manager with any assigned projects and providing backup to the Property Manager when required. Following would be your site deliverables:Inspect work performed to ensure that it meets specifications and established standards.\nEnsure the upkeep of the assignment/task as per set SOP.\nTo make plans/ schedules and inspect/assigns work to subordinate supervisors and/or teams.\nConduct regular briefing for ground staff.\nEnsure discipline, proper attire and etiquette in subordinate staff.\nVendor management, regular meeting with respective vendors for resolution of site related issues.\nImplementation of all standard operating procedures at site to ensure smooth site operations.\nEnsure closure of complaints about services and equipment and take corrective action.\nMaintain required records of work hours, budgets, and other information.\nRegular/ frequent rounds to be taken to inspect and evaluate the physical condition of facilities to determine the type of work required.\nCheck and maintain equipment to ensure that it is in working order.\nBrief and de-brief all supervisory staff.\nMonitor all cleaning activity, ensure it is done as per set SOP, in order to maintain premises in best possible way and to enhance the lifespan of equipment.\nConduct training on regular basis for work policies and procedures.\nMaintain inventory of consumable stock to ensure that supplies and other equipment are available in adequate amount.\nSelect and order or purchase new equipment, supplies, or furnishings.\nPrepare reports Like DMR, MMR, QBR and other related reports at site\nRecommend changes that could improve services and increase operational efficiency.\nPerform financial tasks, such as estimating costs and preparing/managing budgets\nPlan & arrange for change in beautification of certain areas every quarterly and for festivals & events.Site details:You will be working on __One Qube__, which is a ___commercial____, located at ___Gurgaon___Site dynamics:Work Schedule: Site team:  e.g.: Property Manager +2 Other details if anyReporting:You will be reporting to property Manager.Sound like you? Here is what we’re looking for:Being Analytical and MeticulousYou must pay attention to detail and have excellent problem-solving skills. You will be maintaining, supporting and validating the performance of subordinate staff. You will demonstrate the ability to manage others and communicate information effectively with the internal and external customers.QualificationsYou will have a Degree / Diploma in hotel management / hospitality with minimum 5-7 years of work experience, Effective communication skills and knowledge of processes for providing customer service would be an added advantage.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}