{
    "Job ID": "69859467",
    "Description": "The Chef de Partie Bakery is responsible to assist the Junior Head Bakery in supervising and running the Bakery section and on demand in any other areas of the culinary operation.\nResponsibilities:The Chef de Partie’s mission is to take full responsibility for the food quality & presentation of the corresponding kitchen and on demand to assist other areas of the culinary operation.\nSupervise his kitchen section and cooperate with the other sections within the kitchen.\nResponsible to comply at all times with the standard quality requirements, stock management and techniques.\nThe Chef de Partie should monitor and control the food quality, setup/ presentation/buffet presentation and timely delivery of the dishes in corresponding kitchen.\nEnsure plating guides are up to date and distributed appropriately.\nEnsure that all plating guides are followed according to set dish description, cooking method and presentation image.\nEnsure that the dishes are prepared in the most authentic way as standards set and agreed by the Chef de Cuisine.\nShare the specific knowledge and recipes on Banquet dishes with all related colleagues.\nGive constructive feedback to the Chef de Cuisine/Jr. Chef de Cuisine during annual appraisals for Demi Chef de Partie and Cook I & II.\nAssist Chef de Cuisine to ensure the food safety related administration are compliance with the standard and being followed accordingly.\nFollow all procedures, policies and practices with regard to the Jardine audit related requirements for the culinary department.\nAssist the Chef de Cuisine in other administrative matters for the outlet.\nSupport other outlets for any events if required.\nAttend and participate in all required meetings as scheduled.\nPerform any other reasonable duties as required by the Chef de Cuisine.\nAbility to work long hours with a strong focus on operational excellence.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}