{"Job ID": "69858514", "Description": "Amazon Finance Operations / India payroll team is looking for individuals with Expertise in the Indian Payroll, Employee Tax and Benefits process experience.\nAlong with Payroll, the individual having auditing skills, problem solving skills, payroll system knowledge is plus.\nAmazon seeks a Payroll Analyst with at least 1.5 to 2 years relevant experience in a large customer-oriented corporate environment where Payroll is processed on a monthly basis.\nCore deliverables,\n-Pay Amazon employees accurately, on time , every time.\n-Manage Off-Cycle Payrun and payments.\n-Process payroll i.e. Salary, employee / employer tax’s and other statutory deductions using in house and 3rd party payroll platform.\n-Produce timely responses to queries received from employees, support team and HRBP’s.\n-View and manage human resource data on people portal.\n-Process manual check calculations, work with the vendor to process stop payments/reversals, enter paycheck card entries and assist with check distribution and backup other payroll analysts as needed.\n-Support scheduled and adhoc payroll task such as reporting, reconciliations, tax filings i.e. Start of year, end or year, annual employee earning records.\n-Minimum 3 days working from office in a week is mandatory (may be increased later).\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- 1.5 - 2 years of relevant work experience.\n- Good communication skills (verbal and written)\n- Good knowledge on MS Office is a must\n- Graduate in commerce, accounting or finance.\n- Understanding of Lean, Six Sigma and other process improvement methodology.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}