{
    "Job ID": "69858789",
    "Description": "Role Summary/OverviewThe Workforce SPV prepares and produces work volume and staffing forecasts, as well ascomparative data on results vs. forecasts, identifies opportunities for improvement, andrecommends solutions. This position provides workforce management scheduling andload balancing requirements for work peaks and valleys. The Workforce SPV makesadjustments and recommendations for optimizing scheduling to maximize service andquality. Also to have the ability to forecast and schedule for in-house, and outsource.Create a budget for in-house and outsourcing, and the ability to track it through the P&L.What Did We Order?• People management as he will lead WF staff.Ability to create and track the budget.Creates reports on historical data and forecasting results.•Analyzes data and recommends solutions for implementation.•Analyzes and develops weekly recommendations for scheduling and uses staffingrequirements, and operations schedules to determine required staffing levels toensure the organization's ability to meet operational commitments.•Creates integrated database tracking tools for staffing shrinkage patterns (vacation,sick, training, etc.) to optimize staffing forecasts.•Maintains holiday pattern forecasts to ensure effective coverage for holidays.•Performs other related duties as assigned.We’re hiringTechnical knowledge, Skills, and Experience:•English level B2•Proficiency in MS Applications.•At least 3-4 Years Exp as WF Supervisor.• ExcellentForecasting Knowledge.•Knowledge of service level Calculations.•Problem-solving, Communication and leadership skills•Analytical thinking•Good Business Writing Skills.•RTM Experience is preferredJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}