{
    "Job ID": "69857150",
    "Description": "As a Talent Acquisition Specialist, your responsibilities include sourcing candidates through various channels, planning interview and selection procedures and hosting or participating in career events. Ultimately, this role will create strong talent pipelines for the company’s current and future hiring needs. You will join a dynamic team that is responsible for sourcing and interviewing candidates across all Miral Experiences. What you will doVacancy assessmentMeet the hiring manager for intake meetings with the purpose of understanding requirements of new vacancies.\nCreates the hiring plan with agreed timelines for submissions, interviews, calibration and updates.SourcingPublish vacancies on the external career section, job boards and agency portals.\nSource for candidates in the ATS and job boards.\nApproach passive candidates for niche and difficult-to-source roles.\nMaintain a network of industry contacts to identify potential candidates for pipeline.\nSubmit approved internal applications by liaising with the Service Centre and hiring departments.ScreeningScreen applicant CVs received through different channels to shortlist for tele-screening.\nTele-screen external candidates to determine interest in company openings, qualifications (skill set and cultural fit), availability, etc.\nUpdate candidate status on ATS and send relevant correspondence.\nSubmit shortlisted candidates to the hiring manager for review.Interviews / AssessmentsAdminister skill assessments to candidates directly and/or through agencies.\nArrange for skill-based tests for specific roles with candidates directly and /or through agencies.\nSchedule internal and external interviews for Talent Acquisition and/or hiring manager’s rounds.\nInterview candidates for assigned roles to assess for functional and cultural fit.\nOrganize assessment centres for frontline roles.\nShare feedback on interviews and assessments with hiring managers. \nConduct calibration meetings with hiring managers.\nParticipate in internal assessment centres as required and provide feedback to hiring managers. \nEnsure continuous follow-ups with hiring managers, agencies and candidates through the hiring process. \nUpdate hiring managers on the status of their open vacancies through reports and meetings.Campaigns Lead recruitment trips overseas in different locations as assigned.\nPresent the company and job overview during recruitment trips and local open days.\nWork with different agencies on sourcing campaigns.\nGet involved in other projects as may be assigned from time to time. What you will need to bringTeam spirit: in this team, we lean on each other through the best and worst, making work fun!\nExcellent communication skills, both written and verbal\nExcellent customer service skills to manage our candidates and our hiring managers.\nA lot of patience\nWillingness to roll up your sleeves and get the job done.\nHands-on working knowledge of MS Excel, MS Outlook, MS Word, and MS Teams knowledge\nMinimum of 3 years work experience in recruitment either in agency or in-house\nBachelor’s degree in psychology, Business or Human Resources\nCIPD or PHR qualifications\nFluency in Mandarin will be an added advantage. What we would be excited aboutPrevious experience in HRIS; data crunchers are welcome!  \nKnowledge in running assessment centersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}