{"Job ID": "69857822", "Description": "IQ-EQ is a leading Investor Services group which combines global expertise with an unwavering focus on client service delivery. We support fund managers, global companies, family offices and private clients operating worldwide.Ready to grow more in your chosen career?Here at IQ-EQ, we will ensure your growth and development in the accounting field. We maintain the level of delivery that we provide to our cluster clients for funds and corporate clients. IQ-EQ believes that your exposure equipped you with the knowledge to do self and peer reviews on top of usual financial statement preparations and meet your deliverables promptly and accurately.You will be tasked to ensure complete information, data, supporting documents, etc. to prepare the needed requirements. However, we will also make sure that every day is an exciting day as we expose you to global clients and provide you with the opportunity to grow and learn as you assist in all reporting requirements such as financial statements, working papers/ management accounts, partner statements, and other client deliverables.QualificationsEssentialGraduate of accounting or any business-related course with 2+ years relevant accounting experience.\nActual work experience in the preparation of working paper files, financial statements with disclosures and other financial information.\nIntermediate Excel skills such as pivot tables, lookup, “if” and other similar functions\nExperience in e-mail, word processing and video conferencing applications such as Microsoft Office.\nEffective written and verbal intermediate communication skills.\nExperience in using accounting software (Investran software is desiredDesiredDesire to complete Certified Public Accountant qualification, if applicable.\nExperience working in Financial Services or Shared Services office environment. \nExperience working in a multinational office environment.\nOpen to travel and other secondment opportunities abroad.\nUniversity Degree in Accountancy and other accounting-related courses.At IQ-EQ we want you to reach your full potential. We offer an inclusive and diverse environment to support your career aspirations. With a strong emphasis on continuous learning and a holistic approach to your professional and personal development. We also offer opportunities across our service lines and our international network of offices.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}