{
    "Job ID": "69856834",
    "Description": "AtkinsRéalis currently looking for an experienced Document Control Manager (Saudi Nationa) to form part of our Project Management Consultant (PMC) project team, based in Al Ula, Saudi Arabia.Requirements:Min of 12 years Document Control experience on large construction/consultancy projects\n\nActing as a gatekeeper of project information and ensuring confidentiality of critical project information at all times\n\nLeading on document control activities and tasks and delegating to more junior team members where required\n\nDemonstrable track record in the delivery of large multi functional projects;\n\nCapable of reviewing existing operations within an organization through all the project phases (processes and procedures in both office and site), assessing both the strengths and weaknesses and assisting in compiling a bespoke set of process and procedures of all of the activities including but not limited to quality, progress, commercial matters, value, safety, design and construction.\n\nIn-depth knowledge of project controls procedures.\n\nThe successful candidate will also be able to mobilize people and teams and drive for a successful delivery ensuring rapid mobilization and development of tailored documentation and processes relevant for the services and embedding client requirements into key documentation including brand and quality of templates and processes.\n\nEffective in building good working relationships quickly\n\nOther Office Administration duties as requested from time to time\n\nExperience in managing information through at least one EDMS system and developing workflows and requirements for EDMS systemsQualifications:Must be able to communicate confidently in both written and spoken English.\n\nHigh level of computer literacy, especially in Windows, Word, Outlook and Excel.\n\nArabic translation advantageous but not essential\n\nExperience with ISO9000 quality requirements.Rewards and Benefits:We offer an excellent package which includes:A competitive salary\n\nAccommodation allowance;\n\nTransportation allowance;\n\n22 calendar days annual leave;\n\nMedical and life insurance cover;\n\nCompany gratuity scheme;\n\nDiscretionary bonus scheme;\n\nEmployee Well-Being Programme – 24-hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants.About AtkinsRéalis Created by the integration of long-standing organizations dating back to 1911, AtkinsRéalis is a world-leading professional services and project management company dedicated to engineering a better future for our planet and its people. We create sustainable solutions that connect people, data, and technology to transform the world's infrastructure and energy systems. We deploy global capabilities locally to our clients and deliver unique end-to-end services across the whole life cycle of an asset including consulting, advisory & environmental services, intelligent networks & cybersecurity, design & engineering, procurement, project & construction management, operations & maintenance, decommissioning and capital. The breadth and depth of our capabilities are delivered to clients in key strategic sectors such as Engineering Services, Nuclear, Operations & Maintenance and Capital. News and information are available at www.atkinsrealis.com or follow us on LinkedIn. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}