{"Job ID": "69866477", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Summary\nWe are looking for a Sales & Service Cloud consultant who is skilled in the solution as well as has technical expertise to meet the demands of the customer implementation needs. This role will offer you \n•    To work on global Sales & Service Cloud implementations helping the customers streamline their sales & service processes\n•    Opportunity to enhance your skills on other requisite areas to fast track your aspirations to become a Sales or Service Process Architect / CX Solution Architect\n•    Fine tune your consulting skills with focused learning journeys suited to your needs and opportunities to explore various spheres of consultant journey\n The Role:This role will help you to enhance skills in the specialized solutions space of Sales Cloud and Service cloud while providing opportunities to explore other related solutions under CX portfolioThe Consultant expected toPerforms tasks involved in implementation of SAP CX solution as per customer requirements using predefined methodologies\nTogether with customer define futuristic business processes to cater to Sales & Service processes across industries\nEstablish relationships with customer and to deliver timely, high quality consulting services\ndevelop functional as well as technical design based on the business requirements and to be able to translate the same into project deliverablesRole Requirements:3+ years of IT experience with 1 or 2 Full Life Cycle Implementations in the area of Sales& Service Cloud Solution/ Roll- Outs experience. \nC4C UI Concepts (screen configuration, layouts, business roles, and other concepts) \nSDK skills & Development experience\nMCA / B.Tech or B.E\nGood Presentation and communication skills with Fluent EnglishDesired/Preferred Additional expertiseExperience in other SAP CX solution is an added advantage\nSAP Certifications in the areas of C4CJob Locations: \nBangalore, Karnataka, India\nGurgaon, Haryana, IndiWe build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 372097  | Work Area: Consulting and Professional Services  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}