{"Job ID": "69866218", "Description": "Senior Financial Analyst – Print Commercial OrganisationThe position provides critical financial analysis and guidance to the Print commercial organization as a partner to the business leadership staff. Supports Contra revenue activities and P&L Management. Applies advanced subject matter knowledge to solve complex business issues and is regarded as a subject matter expert. Frequently contributes to the development of new ideas and methods. Works on complex problems where analysis of situations or data requires an in-depth evaluation of multiple factors. Leads and/or provides expertise to functional project teams and may participate in cross-functional initiatives. Acts as an expert, providing direction and guidance to process improvements and establishing policies. Frequently represents the organization to external customers/clients. Exercises significant independent judgment within broadly defined policies and practices to determine the best method for accomplishing work and achieving objectives.Responsibilities:Provides complex and occasionally highly complex financial analysis for a financial function or a business, typically exercising a strong understanding of the business to determine the best method for achieving objectives.\nConsults with business leaders to guide and influence strategic decision-making within a broad scope.\nForecasts financial results within a broad scope.\nLeads business initiatives, typically leading analysts across multiple sub-functions within finance.\nIdentifies opportunities for process improvements and policy development and engages in the design.\nRepresents the business unit during cross-regional or cross-functional planning processes.\nProvide mentoring and guidance to analysts.Education and Experience Required:First-level university degree with a focus in business or economics; advanced degree or accounting certification (e.g., CPA, MBA) preferred.\nTypically 6+ years of experience as a financial analyst.\nTypically experienced in more than one finance function.Knowledge and Skills:Excellent understanding of accounting principles and financial analysis, with advanced knowledge in one area.\nExcellent analytical skills.\nExcellent financial modeling skills.\nExcellent business application skills (e.g., Microsoft Excel).\nExcellent communication and influencing skills.\nAbility to work independently.\nSuperior teamwork skills.\nStrong business acumen.\nGood project management skills.About HPYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.Our history: HP’s commitment to diversity, equity and inclusion – it's just who we are.From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}