{"Job ID": "69867083", "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of 50,000 pioneers around the globe. The teams in our corporate functions enable the best in our dynamic businesses and in our people to maximize our company’s potential. With our leading brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Assisting in Preparation and Review of periodic GST Returns (GSTR1, GSTR3B, GSTR9/9C etc) along with the reconciliation with the books of accounts.\nReconciliation of GSTR 2B with the Input tax credit availed and vice a versa along with coordination/follow up with all stakeholders.\nEvaluate an optimum structure in order to minimize the GST leakages, if any and maximize the availment of input tax credit keeping in mind the business strategy and supply chain;\nAnalysis of the GST Compliance data to find process gaps & implementing corresponding processes/solution/automation Assisting in Drafting/filing of reply to letters and submission thereof with the relevant authority;\nMonitoring / reviewing posting of GST liability / credit on time with accounting principles, E-way bill & E invoicing on supply / receiving of goods & services and E commerce related GST compliances\nEnsuring Job work related compliances and correct GST Credit reversal on FOC & Scrap Sales Co-ordinating with Stat/Tax/Internal Auditors for providing data & relevant clarifications for smooth closure of relevant Audits and providing IDT training (through workshops) to various stake holders- Business, Purchase, SCM etc.\nAdvise/Opinions on indirect tax /GST issues related to applicability of taxes on relevant transactions, eligibility of input tax credit and admissibility for tax benefits/exemptions.\nSAP updates in relation to Tax Configuration/Conditions and assisting in resolving technical issues (incl. SAP) in relation to GST/IDT compliance (incl. capturing GST liability/credit)\nAnalyze and advice on applicability of indirect taxes and duties eligible indirect tax benefits, exemptions, concessions, abatements, incentives if any on identified transactions;\nSuccessful Closure of Tax /Transfer Pricing Audits, Corporate Tax/Transfer Pricing Assessments & Litigation TopicsMinimum 5 years of post qualification experience\nShould be a Qualified Chartered Accountant\nShould have experience in handling/leading Indirect Tax/GST Compliances (incl. Audits/Assessments) and Tax Savings/Tax Planning initiatives/Projects.\nKnowledge/Experience in Corporate Tax/Transfer Pricing Compliances/Litigation would be an added advantage.Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}