{"Job ID": "69869506", "Description": "It’s an exciting time to be at Infoblox. Named a Top 25 Cyber Security Company by The Software Report and one of Inc. magazine’s Best Workplaces for 2020, Infoblox is the leader in cloud-first networking and security services. Our solutions empower organizations to take full advantage of the cloud to deliver network experiences that are inherently simple, scalable, and reliable for everyone. Infoblox customers are among the largest enterprises in the world and include 70% of the Fortune 500, and our success depends on bright, energetic, talented people who share a passion for building the next generation of networking technologies—and having fun along the way.We are looking for a Senior Information Developer to join our Information Development team in Bangalore, reporting to the manager of Information Development. In this role, you will work closely with cross-functional teams, such as Product Management, Engineering, QA, and Support to develop and deliver technical documentation for Infoblox products. You will analyze, structure, and communicate complex product information in a concise and intuitive manner for the target audiences, such as network administrators. You will also investigate and adopt new technology and tools to improve the creation and delivery of customer-facing documentation for Infoblox products.You are the ideal candidate if you are a great collaborator, have a passion for technology, and are deadline-driven. You possess excellent verbal and written communication skills in English as well as excellent organizational and information architecture skills.What you’ll do:Learn Infoblox products and become the subject matter expert (SME) for creating and delivering technical documentation\nReview and analyze technical documents and specifications and communicate with stakeholders and SMEs to gather product information\nWork closely with Product Management, Engineering, QA, and Support to drive the creation and production of technical information on installation, administration, CLI, API, online help, and release notes\nMake documentation plans and project schedules\nCreate accurate and concise documentation and structure the information in a logical manner for target audiences so they can access the information in a timely manner\nCreate illustrations and workflow diagrams to communicate complex information\nUse company-supported tools to maintain source files, project schedules, and other relevant information\nManage documentation reviews and integrate review comments\nPrepare, produce, and deliver final documentation for posting on the Infoblox documentation portalWhat you’ll bring:8+ years of technical writing experience\nBachelor’s degree in computer science, engineering, or communications\nHigh proficiency in both written and verbal English with exceptional editing skills\nExperience with single sourcing and source control systems\nSolid skills in Confluence, JIRA, and MapCap Flare\nExperience with iPhone, Android, and cloud-based applications and knowledge about DNS, DHCP, and IPAM\nAbility to work independently with minimal supervision, a team player mindset, and critical thinking skills\nAbility to handle multiple assignments simultaneously in a fast-paced environment\nExcellent analytical, organizational, research, and interview skillsWhat success looks like:After six months, you will…Learn Infoblox products and gain hands-on experience with them\nDeliver quality technical documentation on your writing assignments and fix JIRA tickets\nEstablish good rapport with stakeholders and SMEs in areas that are relevant to your assignments\nBe familiar with the InfoDev processes, styles guide, and website contentAfter about a year, you will…Become the technical documentation SME in the Infoblox products assigned to you\nContinue to deliver quality technical documentation in a timely manner\nProvide process improvement ideas on InfoDev processes and style guide\nKeep up with industry trends and tools and give feedback to the InfoDev teamWe’ve got you covered:Our holistic benefits package includes coverage of your health, wealth, and wellness—as well as a great work environment, employee programs, and company culture. We offer a competitive salary and benefits package, including a 401k with company match and generous paid time off to help you balance your life. We have a strong culture and live our valuesevery day—we believe in transparency, curiosity, respect, and above all, having fun while delighting our customers. \n\nWhy Infoblox?We’ve created a culture that embraces diversity, equity, and inclusion and rewards innovation, curiosity, and creativity. We achieve remarkable results by working together in a supportive environment that focuses on continuous learning and embraces change. So, whether you’re a software engineer, marketing manager, customer care pro, or product specialist, you belong here, where you will have the opportunity to grow and develop your career. Check out what it’s like to be a Bloxer. We think you’ll be excited to join our team.#LI-AS1Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}