{
    "Job ID": "69867287",
    "Description": "An'yst, Development-(2300017072)Job:TechnologyPrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 7:36:28 AMUnposting Date:OngoingThe Role ResponsibilitiesStrategyStrategize the Technology roadmap for CEE Hive delivery.\nFoster engineering mindset among the people and develop talent within the team.\nProvide Inputs / directions for strategic programs across Solutions, Design and Approach to implementation.\nAdopt the bank’s cloud strategy and drive within your programs / projects.\nStrategize on new areas like choice of design, databases, API strategies, Microservices led Architecture as part of Engineering stream. BusinessUnderstand the bank priorities on the strategic initiatives and on the new programs planned further.ProcessesAdhere to Vx principles and guidelines on all Program delivery.\nCompliance on ICS guidelines, Security and Data protection.\nCompliant to SDF / TDA / RAT process and drive bank towards automating process areas removing redundancies.GovernanceMust be aware of the Group’s regulatory framework and is expected to adhere based on the role.\nMust understand the oversight and controls related to Business Unit, Job Function and deliver.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead India / CCIB CLDM ITO / Application Development, Support and Engineering to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Key StakeholdersCEE Hive ITO, CLDM Business, Vendors related to CLDM / CRA, Interfacing systems to CLDM/CRA (CCIB Business Unit)Other ResponsibilitiesManage and handle all CCIB CLDM Objectives.Our Ideal Candidate6 - 10 years of experience in application development using Java, J2EE and Advance Technologies.\nRecommend future technology capabilities and architecture design considering business objectives, technology strategy, trends, and regulatory requirements.\nGood understanding of fundamental architecture and design principles, object-orientation principles and coding standards.\nExperience in presenting solutions to architecture forums and follow the principles and standards in implementation.\nAbility to learn and adapt to new technologies and frameworks.\nUnderstanding on source control, versioning, branching, etc.\nGood experience in Oracle Policy Automation and Drools.\nExperienced in Agile methodology and Waterfall models.\nVery good presentation and documentation skills.\nAbility to build extensible and scalable solutions.\nGood verbal and written communication skills.\nStrong analytical and problem-solving skills.\nGood knowledge in DevOps, CI-CD.Technical CompetenceStrong hands-on experience on CI-CD pattern with good knowledge on related tools like GIT, Bitbucket, Jenkins, JIRA, OpenShift, Kubernetes, Docker and automation test tool like JMeter, SoapUI.\nStrong experience in open-source frameworks like Spring, Hibernate, Transaction Management and Apache Libraries (Camel / ActiveMQ / Commons).\nGood knowledge in dependency injections like Spring DI / Blueprints and JSON libraries like Jackson / GSON.\nExperience in distributed technologies e.g. Kafka, Apache MQ, RabbitMQ, etc will be added advantage.\nExpertise in RDBMS solutions (Oracle, PostgreSQL) and NoSQL offerings (Cassandra, MongoDB, etc).\nStrong experience in Business rule design and development (Oracle Policy Automation, Drools).\nGood knowledge in Enterprise Application Integration patterns (synchronous, asynchronous).\nExperience in building large scale applications using opensource and J2EE technologies.\nGood knowledge about Design Patterns and Principles, Microservices Architecture.\nGood hands on knowledge on containerized platforms like Kubernetes, OpenShift.\nStrong experience on Unit testing and code coverage using JUnit / Mockito.\nGood knowledge on multi-threading and multi-processing implementations.\nGood Understanding code quality tools like SonarQube, AppScan, XRAY.\nKnowledge in DSE DataStax or Neo4j will be an added advantage.\nGood knowledge in Linux Operating System (Preferably RHEL).\nGood knowledge on API building (Web Service, SOAP / REST).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}