{"Job ID": "69868288", "Description": "Location -Amman ,  ,Jordan (JO) Job ID -5780The role is to act as a business partner to the management and stakeholders of North Africa (“Region”), delivering effective and practical legal advice, direction, and documentation to the Regional Legal Director of MENAT and management in relation to a contract, customer or project related to that Region, in addition to providing leadership and expertise in legal matters to the Aramex subsidiaries in the Region to ensure compliance with the company’s wide Legal governance.Job Responsibilities:Support the MENAT Regional Legal Director in acting as a business partner to the management and stakeholders of the Region.\nLitigation: own, manage and report to the Regional Legal Director and regional management all existing of litigation and/or threatened claims and all related elements including direction, risks, cost, mitigation strategy and lessons learned, etc.\nProvide effective and timely legal advice on various matters related to business including commercial, operational, employment and financial matters.\nBuild and share knowledge within the Region.\nManage the legal function in the Region in relation to all business activities in that Region under supervision of the MENAT Regional Legal Director and in coordination and collaboration with the Regional CEO of that geography.\nRaise legal and regulatory considerations at an early stage, and set realistic expectations for timelines and costs, while also providing practical solutions.\nPlan, manage and address areas of legal risk and/or compliance on the Region’s long-term projects.\nAssist business to prevent, navigate, and resolve complex legal issues in the Region.\nReport to the MENAT Regional Legal Director and Region’s stakeholders, on regular basis or as needed, any updates on applicable laws and regulations that could possibly have an impact on the business. \nAssist in providing legal support on transactions within the Region or as otherwise instructed, including major or complex transactions and participate/assist in M&A transactions.\nAdvise on and negotiate material contract matters in the Region, including risk assessment, and ensure implementation of company’s policies in this regard as agreed with the MENAT Regional Legal Director and the Head of Commercial Contracts.\nManage communication and negotiations with several Postal Authorities and other regulatory bodies and associations in the designated geography in relation to licensing and regulatory laws affecting core business of the company.\nSupport dispute resolution in terms of business issues, potential or actual litigation in the designated geography, maintain up-to-date record of all litigation cases, and generate regular status reports and summaries and share with the MENAT Regional Legal Director and the relevant stakeholders on quarterly basis or as and when needed.\nResearch and resolve legal disputes through the analysis of relevant laws, argument development, evidence collection, and legal representation, and draft effective and practical legal opinions accordingly.\nExamine the legal issues related to new products and services to ensure legal compliance when launching major initiatives, projects or products/services in the Region in coordination with other legal team members and business stakeholders.\nEffectively manage the relationship with external lawyers in the Region.\nReport to the MENAT Regional Legal Director on all legal expenses in the Region.  Ensure optimization and cost efficiency. Regularly negotiate and update retainer agreements with external lawyers as agreed and approved by the MENAT Regional Legal Director.\nEnsure delivery against internal customer satisfaction expectations in the designated geography.Job Requirements (Experience and Education)Education and Certification: must have a law degree from an accredited law school and must be licensed to practice law in the state or jurisdiction where they work. A master’s degree in law from the UK, the US, France or Australia is a plus.\nExperience: should have a minimum of 7 years PQE experience practicing law in a commercial or corporate setting, preferably with experience in the transportation and logistics industry or sector.\nLegal Knowledge: should have in-depth knowledge of laws and regulations related to commercial transactions, including contract law, corporate law, intellectual property law, employment law, and other related areas.\nCommunication and Negotiation Skills: Must have strong communication and negotiation skills to effectively advise clients, negotiate contracts, and resolve disputes. Excellent verbal and written communication skills in English and Arabic. French is a plus.\nAnalytical and Problem-Solving Skills: Must have strong analytical and problem-solving skills to identify legal issues, evaluate risks, and provide effective legal solutions to clients. Approachable, team player, detail and results orients\nBusiness Acumen: must have a good understanding of business and industry practices and should be able to provide legal advice that is aligned with the business objectives of their external and internal stakeholders.\nAttention to Details: must have strong attention to detail to review and analyze legal documents, contracts, and other legal materials.Company Overview:Since our founding in 1982 we have grown to become a world leader in comprehensive transport and delivery solutions for business and consumers. Headquartered in Dubai, at the heart of the world’s most dynamic commercial hub and on the site of historic trade routes linking east and west, commerce and transport are deeply embedded in Aramex’s DNA. We are dedicated to transforming the face of trade, expanding our operations rapidly to better connect businesses and consumers worldwide.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Amman, Jordan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}