{"Job ID": "69867901", "Description": "At Gensler, we design for people. We leverage our global perspective and local presence to innovate at every scale. We’re not just designers. We’re tinkerers, craftspeople, visionaries, innovators and thought leaders. Fueled by passion and entrepreneurial spirit, our people bring new ideas to solve challenging problems.  Whether you’re into sketching new ideas, hacking a building or growing client relationships in global markets, there’s something here for everyone.Our depth of expertise spans disciplines—from aviation and transportation to education, hospitality, retail, technology and more. At our core we embody an entrepreneurial spirit, always looking ahead for new ways to innovate and add to our clients' success. We share the belief that design has the power to transform organizations and change lives; whether we’re refreshing a retailer’s brand, planning a new urban district or designing a super tall building.Our work reflects an enduring commitment to sustainability, and we believe that a diversity of voices and cultures is one of the most powerful strategic tools for securing lasting competitive advantage.As the world’s largest design firm, Gensler has a unique obligation and opportunity to focus on sustainability in the built environment. We deepened our commitment to combat the impact on climate change in the built environment when we launched Gensler Cities Climate Challenge (GC3) in 2019. This is our pledge to meet an ambitious goal: the elimination of all greenhouse gases from our work by 2030.  Your RoleAs a Design Manager at Gensler, you will have a successful track record of managing all phases of projects and will have overall responsibility for client satisfaction, quality control and financial performance. You will deploy resources to ensure that the work process flows smoothly and act as the primary liaison between the team and client.  This is a great opportunity to join a highly creative, collaborative team where you will leverage your attention to detail and interpersonal skills to design and deliver exceptional projects on time and within budget. Grow your project management expertise while working on trendsetting design projects across a variety of practice areas and industries.What You Will DoClient EngagementImplement one or more client projects through the leadership of project teams.\nGrow business for base building and interiors projects within various Practice Areas.\nPrepare project proposals and negotiate contracts and fees.LeadershipProvide leadership to the team and client by communicating project objectives, contract scope, terms, and schedule.\nEnable the project teams to reach their individual potential and maintain a positive team environment.\nCollaborate with your team with an “open door policy”.\nDemonstrate effective written and verbal communication skills.ProjectsResponsible for both managing projects and client satisfaction by focusing on the project process, service/delivery, work environment, project documentation, and building clients’ trust and loyalty in Gensler.\nManage scheduling, budgets, staffing, and project set-up with clients, sub-contractors, vendors and contractors.FinancialMonitor budgets and profitability targets for your projects (e.g work plan, schedule, fees, billings and collections).\nOversee billing and fee management to ensure all financial activities are consistent with Gensler policies and procedures.\nResponsible for accounts receivable, discretionary expenses, expense report approvals and productivity projections.GeneralWork closely with other Design Managers, Finance, Human Resources and Office Directors.\nDemonstrate dignity, respect, and professional attitude.\nBuild and improve external firm image by active participation in appropriate organizations (AIA, RDI, NCIDQ, etc.) and maintain contact with current and potential clients.\nParticipate in office meetings - collaborate with Studio Directors, Office Management and staff.\nDevelop a strategy for Best Practice integration, client satisfaction, and cross studio integration.\nFocus on global relationship building, recruiting and service integration.\nBe an advocate for Gensler sustainability commitments internally and externally.\nMake sustainability an integral part of every project.\nDefine project sustainability targets in collaboration with the client and the project team at the start of each project.\nUnderstand clients ESG goals and work with project teams towards achieving them.\nSupport and encourage team members to pursue sustainability learning.Your QualificationsBachelor’s degree in Architecture, Interior Design or related field.\n10+ years of related project management experience on a range of design projects. 15+ years of total experience within the fields of architecture or design.\nProfessional license or certification preferred.\nExperience negotiating project scope, fees, managing project financial performance, and ensuring fiscal responsibility for projects.\nExperience with the full project lifecycle, through post-occupancy.\nKnowledge of building codes, standards and building structures.\nBasic technical understanding of architectural design, interior and furniture design.\nExperience with project management software, such as MS Project, a plus.\nKnowledge in sustainable design principles required.\nLEED, WELL, Fitwel, LFA or other rating systems accreditation preferable.\nUnderstand key principles for leading and achieving net zero projects.\nCapacity to drive sustainability focused discussions with clients and teams.\nDemonstrated commitment to sustainability and sustainable building practices required.\nPrevious experience in sustainable design projects preferred. At least one project of the candidate portfolio should showcase this focus. Especially built projects with LEED, Living Building Challenge, WELL Building Standard, Fitwel and /or Net Zero Building certification.Your Design Technology QualificationsEssential             Familiarity with the BIM project lifecycle through design, construction and operational phases.\nUnderstanding of BIM deliverables and terminology in contracts.\nGood knowledge and experience with collaboration within the BIM context, including cloud-based markups, consultant coordination and clash detection.\nExperience in establishing and managing BIM teams for project design and delivery.\nExperience in managing design teams with Revit/Rhino/Grasshopper skills.Desirable            Basic understanding and familiarity with real-time rendering processes, and material creation & management within the context of integrated BIM and parametric workflows.\nUnderstanding of the capabilities and application of Information Management tools such as Aconex, Asite, Newforma, etc.Applications we work with                                        Design Authoring - Revit, Rhino, Autocad, Navisworks             \nCollaboration - BIM360            \nComputational Design - Grasshopper, Dynamo             \nBuilding Performance Simulation - Insight, Sefaira, Diva, Ladybug tools            \nVisualisation – Vray, Enscape, Twinmotion, 3DSMax             \nGraphics & Productivity - Adobe Creative Suite, Microsoft Office Suite            \nExperiential – Unreal Engine, Unity            \nDevelopment  – C#, Python\n To be considered, please submit portfolio and/or work samples in PDF format.Life at GenslerGensler Asia-Pacific and Middle East is committed to Diversity, Equity and Inclusion through our Five Strategies. In partnership with our clients, we strive to create a just and equitable future for our communities and our colleagues. We celebrate our diversity and are focused on creating an inclusive workplace environment for all.As a people-first organization, we are as committed to enjoying life as we are to delivering best-in-class design. From internal design competitions to research grants to “Well-being Week,” our offices reflect our people’s diverse interests.We encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability and wellness programs. We also offer profit sharing and twice annual bonus opportunities.As part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}