{
    "Job ID": "69868268",
    "Description": "Location -Tunis ,  ,Tunisia (TN) Job ID -5782Commercial FretSociété ARAMEX reconnue parmi les leaders mondiaux du transport international cherche à recruter Un commercial Fret à Tunis :Mission :Vous êtes issu d’une formation dans le domaine de transport international de préférence licencier/Mastère en transport et logistique et vous justifiez d’une expérience dans le domaine commercial frêt doté d’un tempérament de leader et sens aigu de la relation client.\nUne expérience d’au moins 5 ans dans un poste similaire.\nVous avez de solides connaissances des opérations aériennes ainsi que de bonnes connaissances de la vente Cargo.\nVous êtes responsable, organisés, bon gestionnaire et meneur d’hommes\nLangues : une bonne maitrise de l’anglais et Français est nécessaire\nDriver la relation de nouveaux clients / prospects\nProspecter le marché local en vue d’assurer une croissance organique de l’entreprise sur son périmètre d’intervention\nS’assurer de la bonne implémentation opérationnelle des accords négociés et signés avec les nouveaux clients\nVente des produits de la société\nÉlaborations des offres aux clients\nRapports commerciauxExigences de l'emploiLangues : français, anglais (très bon niveau)\nEtudes minimum Bac+3 (IHEC, ISG ..)\nExpérience 5 ans idéalement dans le transport aérien des marchandises\nConnaissance du marché\nOrganisé et méthodique\nCapacité de travail en équipe, sens de la responsabilité, dynamique.\nMotorisé.Company Overview:Since our founding in 1982 we have grown to become a world leader in comprehensive transport and delivery solutions for business and consumers. Headquartered in Dubai, at the heart of the world’s most dynamic commercial hub and on the site of historic trade routes linking east and west, commerce and transport are deeply embedded in Aramex’s DNA. We are dedicated to transforming the face of trade, expanding our operations rapidly to better connect businesses and consumers worldwide.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Tunis, Tunisia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}