{
    "Job ID": "69867057",
    "Description": "Why BirdEye?15 years ago brands controlled customer experiences. But in 2022, it’s customer experiences that control brands. Customers now choose businesses based on shared experiences, not ads. So marketers now have to create and promote great experiences, and they need a platform that can do this at scale.Birdeye is an all-in-one Experience Marketing platform for multi-location businesses. More than 80,000 businesses of all sizes use Birdeye every day to be found online and chosen through listings, reviews and referrals; be connected with leads and customers on the channels of their choice, and deliver the best customer experience with survey, ticketing and insights tools.Founded in 2012, Birdeye is headquartered in Palo Alto, and led by alumni from Google, Amazon, Salesforce and Yahoo. Birdeye is backed by Salesforce founder Marc Benioff, Yahoo co-founder Jerry Yang, Trinity Ventures and World Innovation Lab. The company has been the highest-rated Experience Marketing platform over the last 5 years on G2.To learn more, please visit: https://birdeye.comWhat You'll DoResponsibilities● Create a lasting and positive first impression of Birdeye for our prospects ● Become an expert at articulating our value proposition to anyone who asks (or who doesn’t ask)● Create successful cold calling and email campaigns targeting new prospects ● Partner with our account executive team to help generate meetings, build sales pipeline and drive deals● Discover new leads through internet research and social media monitoring/messaging, using tools such as LinkedIn Navigator● Manage prospecting status, data integrity, and forecasting in Salesforce ● Identifying champions and key stakeholders within target accounts ● Meet all key performance metrics and goals on a weekly and monthly basisJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}