{"Job ID": "69866241", "Description": "Date Posted:Country:Location:Position Role Type:At Raytheon Missiles & Defense, you have the opportunity to try new things and make a bigger difference across a broader end-to-end solution, a richer technology and product set, an expanded range of disciplines, a growing global footprint and a more diverse team of colleagues and customers.Job Summary:We are seeking a smart and energized Information Technology Analyst, who is looking to take the next step in their career helping shape service delivery and deliver customer excellence at our Qatar office location.  To be successful in this role, you will need to be enthusiastic and an energetic person who loves going above and beyond to exceed support expectations daily. Proactive and responsible, your planning skills will ensure your success in meeting customer expectations and stay one step ahead of customer requirements.  The role will be responsible for providing support not only onsite at our Qatar office location, but to all our employees working at customer sites. Working closely with the Service Delivery Manager, you will help drive change in the Workplace Services Team. You will join a local team and be backed with global expertise as well as a tailored professional development program to ensure you and your work are successful. This position will be located at the Raytheon Doha offices in Qatar.Responsibilities to Anticipate:Address the day-to-day IT support needs of end users by providing exceptional support for incident, service request, and problem management. \nAttend to end user requests by phone, walk-ups, and online ticketing systems. \nSupport senior executive leadership team and VIP’s with outstanding IT Customer Service and can-do attitude. \nLiaise with Enterprise Administrator to coordinate successful roll outs, upgrades, meetings and new technology integrations. \nMaintain, support and provision desktop hardware including PCs, Laptops, Mobile devices, printers, and other peripherals. \nSupport audio visual incidents and staff requests \nAssist in asset management and disposal processes. \nMaintain and update documentation as required, including, but not limited to End User Work Instructions, Self-Help guides and technical documentation for inclusion into the Knowledge Base. \nContribute to process improvement. Qualifications You Must Have:Bachelor’s degree; preferably in Computer Science, Information Technology, Business, or a related discipline\nMinimum 2years experience in a technical IT support and customer facing role. \nDisplay exceptional communication and presentation skills with a willingness to learn and provide an innovative approach. \nExperience supporting Office 365, Windows 10, and Active Directory technologies. \nExposure to Microsoft System Center Configuration Manager (SCCM) Co-Management and Exchange Hybrid environments. \nIn-depth knowledge of troubleshooting hardware and software \nStrong focus on customer satisfaction with excellent verbal and written communication skills. \nAbility to multitask and prioritize effectively while maintaining a high level of attention to detail.Qualifications We Value:Prior digital technology experience supporting large and complex enterprise environments with distributed sites.\nWindows system administration and/or networking experience\nPrior experience executing enterprise scale on-premises to cloud transitions.\nPrior experience supporting operations & manufacturing environments.\nStrong critical thinking skills, ability to exercise independent judgment and manage complexity and ambiguity.\nCertifications in any of the following areas: Agile, ITIL, Cyber, Six SigmaRTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Privacy Policy and Terms:Click on this link to read the Policy and TermsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}