{
    "Job ID": "69866269",
    "Description": "Scope\n• Delivers end-to-end technical solutions for multiple products or complex projects\n• Leads routine projects with manageable risks and resource requirements\n• May manage budgets for small projects or programs\n• Solves complex problems with minimal guidance\nSphere of Influence\n• Immediate QA/Software Development Engineer team\n• Engages with cross-functional teams to execute\n• Trains and mentors more junior colleagues\n• Influences and articulates compelling software solutions for customers and product(s)\n• Explains difficult concepts and influences others to adopt a point of view for ideas and initiatives\nDelivery\n• Designs, develops and tests software systems and/or applications for enhancements and new products  \n• Writes code according to coding specifications established for software solutions. \n• Delivers software features with exceptional quality, meeting designated release plans and delivery commitments.\n• Develops software solutions by studying information needs, conferring with users, studying systems flow, data usage, and work processes; investigating problem areas; and following the software development lifecycle.\n• Prepares and installs solutions by determining and designing system specifications, standards, and programming.\n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\n• Improves operations by conducting systems analysis and recommending changes in policies and procedures.\n• Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment, and by participating in educational opportunities, reading professional publications, maintaining personal networks, and participating in professional organizations.\n• Protects operations by keeping information confidential.\n• Provides information by collecting, analyzing, and summarizing development and service issues.\n•  Accomplishes engineering and organization mission by completing related results as needed. \n• Collaborates with other designers and engineers \n •  Breaks down customer requirements/problems into for the team. \n • Ability to clearly communicate technical concepts to stakeholders \nBusiness Acumen \n• Provides input to department objectives and goals of a sub-Business Unit or function\n• Strong understanding of other roles within the function or Business Unit and how they are connected\n• Establishes and maintains ongoing relationships with customers \n• Demonstrates mastery of a specific discipline across a range of related issues \n• Anticipates and interprets customer needs to identify solutions\n• Interacts and negotiates effectively with internal or external customers \n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Improves operations by conducting systems analysis and recommending changes in policies and procedures.\n• Applies new technologies in software solutions and provides recommendations to the project team.\n• Breaks down functional requirements into technical requirements and specifications for the team.\nLeadership \n• May support and develop software engineers by providing advice, mentoring, training, coaching, and educational opportunities. \n• Leads routine projects with manageable risks and resource requirements\n• Provides subject matter expertise across sub-units\n• Great team player and able to work efficiently with minimal supervision \n • Collaborates with other designers and engineers \n • Breaks down customer requirements into work for the team can execute on. \n • Ability to communicate technical concepts to stakeholders \n • Clearly communicate technical concepts with others in the organization (Technical Communication, Support, Product and Cloud) by adjusting communication style to the audience#LI-AS1Do you want to be part of a team helping re-invent the way knowledge professionals work? How about a team that works every day to create a more transparent, just and inclusive future? At Thomson Reuters, we’ve been doing just that for almost 160 years. Our industry-leading products and services include highly specialized information-enabled software and tools for legal, tax, accounting and compliance professionals combined with the world’s most global news services – Reuters. We help these professionals do their jobs better, creating more time for them to focus on the things that matter most: advising, advocating, negotiating, governing and informing.We are powered by the talents of 25,000 employees across more than 75 countries, where everyone has a chance to contribute and grow professionally in flexible work environments that celebrate diversity and inclusion. At a time when objectivity, accuracy, fairness and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward. Accessibility As a global business, we rely on diversity of culture and thought to deliver on our goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity/Affirmative Action Employer providing a drug-free workplace.We also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law.Protect yourself from fraudulent job postings click here to know more.More information about Thomson Reuters can be found on https://thomsonreuters.com.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}