{"Job ID": "69862220", "Description": "Job Title:  Pre-Press Production SpecialistReport to:  Global lead Pre-PressOverview of Role: Pens.com, a global direct mail marketing company, is seeking a Pre-Press Production Specialist to join our team. We need an energetic self-starter with a positive attitude. This person excels in a busy environment and can multi-task very easily.The Pre-Press production specialist will be in charge of producing marketing letters for global marketing campaigns by merging artwork with live data to produce variable printing files. What you will do:We are looking for a talented individual that is always seeking the best solution to do things better and faster: Prioritize and manage multiple projects simultaneously.\nUse database files and understand variable printing.\nCreate variable data files for printing production.\nCreate custom rules in FusionPro using JavaScript logic.\nBatch Images using Photoshop Actions.What we need from you:Forward thinking: solve problems without constant supervision.\nProactive team player: good communicating with the team and other departments. \nExcellent proofreader: check accurately text against job specifications and correct technical specifications.\nFlexible: works under pressure in a fast-paced, deadline driven atmosphere.Technical Requirements:Must be proficient in editing layouts in Adobe InDesign (mandatory) and Acrobat (plus ) \nExperience with Marcom FusionPro or other variable printing software is a plus \nProduction-oriented (printing) with some graphic arts design skills needed.\nAdobe Photoshop experience a plus.\nJavaScript experience an advantage.\nExcellent fluency in English languageAbout Pens.comPens.com personalized promotional products are created for and inspired by small businesses. With more than 50 years of experience and serving 23 countries worldwide, Pens.com provides personalized marketing solutions that help businesses connect with their customers through a personal brand experience. Pens.com offers a broad range of personalized promotional products, including writing instruments, stationery, drinkware, bags, gifts, and trade show accessories, and operates via a network of more than 10 facilities across North America, Europe, Africa, and Asia.To learn more, visit: http://www.pens.comPens.com is a Cimpress brand (Nasdaq: CMPR).#LI-OnsiteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Tunis, Tunisia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}