{
    "Job ID": "69867879",
    "Description": "The global leader in public transport infrastructure, SYSTRA has specialized in the mass transit and rail market since 1957. The main shareholders of SYSTRA are SNCF and RATP. Its ambition is to serve emerging needs for collective and sustainable mobility throughout the world. With a presence in 80 countries, SYSTRA manages over 3,000 projects for high-speed systems, traditional rail lines, metros and tramways throughout the world. In India, SYSTRA is an international consulting and engineering company operating in the fields of Metros, High Speed Rail, Railways, Roads, Buildings, Urban planning, and Water & Environment for public and private organizations. Our engineers work with passion to deliver the most reliable, cost-effective and made-to measures solutions allowing end users to move seamlessly. SYSTRA’s unique expertise is backed with a reputation built through technical excellence delivered on projects. Thanks to our know-how of our employees spread across India, we are present at all stages from upstream studies to operation and maintenance. We provide a comprehensive solution to manage all kinds of missions: Detailed Design Consultant, Project Management, Independent checking services. SYSTRA has a long-proven experience nationally & overseas in Water & Environment field. Our complete range of services consents to have a comprehensive understanding, of each sector’s essentials, and to constantly improve the project experience. We have worked on Detailed Engineering Design for Infrastructure Utilities Services in Activation Area Dholera Special Investment Region. Scope included Design of Integrated Infrastructure Design (Potable & Recycled WS, UGS, Industrial Effluent, SWD, Electric Lines and Roads), as well as Technical Advice during execution. The Role Responsible to execute assignment in the fields of Water and Sewerage Infrastructure Schemes inclusive of water mains, sewers, Developer led sewers and water mains (Feasibility, Outline Design, Detailed Design) Main DutiesUndertake PHE design to Indian and International standards\nUnderstand and apply Indian and British standards.\nUndertake design of a variety of Public health design elements i.e. water supply, sewerage, underground drainage for Wet utilities designs.\nAssist the Team leader in presenting design solutions in meeting with clients and contractors;\nCheck own PHE designs deliverables and also able to check design prepared within own team and other groups within area of expertise;\nRealistically estimate pricing associated with projects within their area of expertise.\nCarry out feasibility studies and prepare reports for sustainability options\nCoordinate with all other disciplines and improve inter-discipline working with other disciplines such as Architecture, Civil and Structural.\nResponsible for the implementation of the Quality System of HO/RO/Sites & the Quality Policy of the organization.\nResponsible to collect Existing outline design and drawings details, Existing Utility (power, water, telecom) services details, Existing schedule of rates.\nTo prepare the design parameters in consultation with SE & PM. Responsible to prepare documents as per the project requirement i.e. Quantity BOQ ,tender Preparation etc.\nResponsible to maintain risk register containing mitigation and actions history.\nExecution of all activities internally from time to time to verify the design provisions.\nAssisting CAD draughtsman and Jr. Engineers for the work of W & E projects.Educational Qualification & Experience:Graduate in Civil Engineering + Postgraduate in Water Resource/Environmental/Hydraulics Engineering\n15 to 20 years of design experience into Storm Water Drainage.\nKnowledge of analytical software (Water Gems, Sewer gems, Micro Drainage, EPANET, Water CAD, Sewer CAD, etc.) is compulsory.\nFamiliarity and application of IS codes and standards and American, British, European codes of practices\nMust have strong time-management skills and maintain focus and disciplineWe commit to put people who join us at the heart of improving transportation and urban infrastructure efficiency. As we are growing, this is time to be a part of this challenging adventure.It’s not a job - it’s a career!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}