{
    "Job ID": "69867331",
    "Description": "Are you passionate about grants acquisition and management? Do you have experience working with institutional humanitarian and development donors? Do you possess skills and experience in proposal development, report writing, and working with multiple donors?  We're seeking a dynamic Grants Manager who will ensure effective grants management of the WoS projects. What we are looking for:A highly qualified, experienced and dynamic grants management professional to provide support to our teams in NRC Syria offices. The successful candidate will contribute to achieving quality programming by closely supporting NRC Syria offices in ensuring effective grants management of the WoS projects. You will lead on all grants management processes, ensure communication and coordination with critical interfaces, support funding identification and proposal development and support donor reporting and monitoring.What you will do:Lead on all grants management processes for shared projects between NRC Syria offices, ensuring quality and timely deliverables as defined within the WDP and Workplan.\nThe WoS Grants Manager shall ensure regular communication and coordination with both Country Offices Head of Programmes, Grants and Finance leads. The WoS Grants Manager is also expected to closely coordinate with critical interfaces at MERO and Global levels as per NRC standard procedures. \nInitiate the go/ no-go discussion for identified WoS funding opportunities and record discussions and completed checklist. \nOrganise proposal planning meetings for WoS opportunities.\nLead on WoS proposal development, coordinating between departments from different country office and consolidating inputs to ensure quality and timely submissions. \nReview donor contracts using NRC checklists, flag any points that might challenge NRC’s procedures and support contract negotiations. \nSummarise in writing, key reporting and compliance requirements (compliance checklist) including issues to be raised Grant Opening Meetings.   \nArrange Grant Opening Meetings and ensure they take place within 30 days of the grant being activated and all mandatory internal documents are in place (internal logframe, internal budget, procurement plan, work-plan and M&E matrix). \nLead on the development of WoS donor reports and revisions/modifications, coordinating between country offices and consolidating inputs to ensure consistency between narrative and financial reports in line with NRC and donor quality standards;   \nSchedule Progress Review meetings (PRM) and follow up on COs progress review meetings and action points defined during these PRMs.   \nBe familiar with all NRC organisational and donor portfolio compliance requirements and ensure high quality management of grants through meeting of internal KPIs and deadlines; \nSupport and advise programme colleagues with queries related to donor compliance on grants within portfolio and ensure appropriate donor templates are readily available. \nWork with other departments (i.e. programmes, finance, M&E, Compliance) to ensure all documentation required is ready and available for audits (e.g. vouchers, distribution lists) \nSupport close out of WoS and regional grants, including project close-out meetings and audit preparation. \nEnsure all key grant documents for a grant is available within the Grants department by maintaining a standardized information management/filing system. \nEnsure a correct and up-to-date Grants Tracker and/or on-line systems. \nSupport to both Country Offices (Cos): grants capacity building, support on specific grants for each Country Office. \nContribute to the development or review of the WoS donor engagement strategy.\nCoordinate NRC’s HRP reporting for Syria\nUpon request of Country Offices and as per defined within the annual Work Development Plan, the Regional Grants Manager may be requested to support the capacity building of Grants teams in both Country Offices. Capacity building trainings include NRC standards trainings, including (but not limited to): Project Cycle Management, Way Core, PSEAPlease download the detailed job description to learn more about the position. What you will bring:At least 5 years of relevant experience in a related field. \nExperience of donor relations and grants management (e.g. with institutional humanitarian and development donors); \nExperience working in complex environments and with displaced populations. \nKnowledge of the NGO operations and the dynamics of the humanitarian sector. \nGood understanding of donor rules and regulations. \nProven skills and experience in report and proposal development and working with multiple donors. \nGood personal organisational skills, including time management, and ability to meet deadlines and work under pressure independently and with limited supervision.\nHolds self-accountable for making decisions, managing resources efficiently, holds the team accountable to deliver on their responsibilities. \nStaff capacity-building experience; \nWillingness to travel to area offices and work in difficult environment according to travel requirements. \nGood communication and interpersonal skills with excellent written and oral communication skills in English. What we offer:Duty station: Amman Jordan\nContract: 12 months (Renewal is subject to performance and funds availability)\nTravel: Up to 25% regionally.\nSalary/benefits: grade 9 on NRC’s salary scale, with accompanying terms and conditions\nNRC is an equal opportunities employer. We are committed to diversity without distinction to age, gender, religion, ethnicity, nationality, and physical ability.\nWe think outside the box, encourage ideas, and give responsibility to all employees at all levels. You will have many opportunities to be heard and take the initiative.Find out more about the benefits of working for NRCImportant information about the application processInternal candidates only: To apply as an internal candidate, log in with your official email or click on Opportunity MarketPlace.\nWhen creating your profile, include your full name as given on your passport. Complete all the system-required fields for experience, employment history and education.\nSubmit your application and CV in English, taking care to attach your latest CV.\nApplications that do not meet the minimum standards in terms of experience or qualifications will generally not be considered. Unsolicited applications not related to this specific job advertisement will not be considered.\nWe receive many applications for each vacant position and so only shortlisted candidates will be contacted.\nWe invite applications from all qualified and interested candidates. Send in your application by latest September 29, 2023.\nIf you have any questions about this role, please email mero.recruitment@nrc.nowith the job title as the subject line.Why NRC?The Norwegian Refugee Council (NRC) is an independent humanitarian organisation helping people forced to flee. Our 15,000 staff work in crises across 40 countries, providing life-saving and long-term assistance to millions of people every year.NRC currently has over 3,000 staff across the Middle East dedicated to assisting people affected by conflict in Jordan, Syria, Lebanon, Iraq, Libya and Palestine. Its humanitarian interventions are based upon its programming expertise in the Core Competencies of Shelter, Education, WASH, Livelihoods and Food Security, and Information Counselling and Legal Assistance (ICLA) to vulnerable displaced people that were forced to flee.   Entering the thirteenth year of the conflict in 2023, more than half of the Syrian population remains displaced from their homes with 5.4 million refugees living abroad and another 6.8 million internally displaced persons inside Syria. Conflict and protracted mass population displacement, combined with severe economic downturn (fuelled among other things by the impact of the economic collapse in Lebanon, international sanctions and import control, etc.), depreciation of the Syrian pound, inflation with soaring food and fuel prices, loss of livelihoods, water crisis and drought and reduced food production have led to widespread poverty, food insecurity and increased deterioration of the humanitarian situation across Syria.Watch this short video to see NRC in action.We are looking for people who are passionate about helping refugees and people forced to flee. Are you one of those people? If you are, NRC offers you the opportunity to:do demanding and professional work, often in challenging contexts.\njoin a work culture that empowers every employee to share ideas and take responsibility.\nbe part of a welcoming and supportive community committed to human dignity.Learn more about NRC's operations in Syria here.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}