{
    "Job ID": "69869729",
    "Description": "Looking to join the #1 bank in the UAE and one of the most prestigious in the region? We're looking for professionals who are driven, skilled, and ready to take on new challenges. Together, we can achieve our goals, making a lasting impact on both our company and the industry as a whole. Join us and leave your mark on the industry. Let's work together to achieve great things and unlock new possibilities for our employees, customers, and communities. Work with the line manager to implement the annual Group Engagements calendar.Ensure delivery of planned engagements and bespoke experiences across business and report progress.Budgeting and Financial PerformanceMonitor the financial performance of a given area of activity versus budgets and ensure all activities are carried out in line with the approved guidelines while promptly reporting on any variances to management.Policies, Systems, Processes & ProceduresFollow all relevant departmental policies, processes, standard operating procedures, and instructions so that work is carried out in a controlled and consistent manner.\nDemonstrate compliance to organization’s values and ethics at all times to support the establishment of a value drive culture within the bank.Continuous Improvement Contribute to the identification of opportunities for continuous improvement and sustainability of systems, processes and practices considering global standards, productivity improvement and cost reduction.ReportingAssist in the preparation of timely and accurate statements and reports to meet department requirements, policies and quality standards.\nCreative with passion and energy to roll up sleeves and get things done.\nCommunicates effectively with other business and external partners.\nCreates collaborative environment across the team and organization.\nWorks under pressure and be present on-ground at all engagements. Be available to oversee pre-event and activity setup and available when required.\nSupports Line manager in working with various FAB businesses/ departments to initially identify their engagement requirements and implement as per the agreed activity plan, timeline and budget.\nWorks on assigned project as per the agreed activity plan, timeline, and budget, and provide them with post- event report that will assist in evaluating the event.\nEnsures that projects handled are delivered to the quality expected and as planned.\nDevelops strong relationships and alliances with FAB internal business and external organizations across all sectors and participates in local external membership working groups to ensure the bank is sharing and acquiring knowledge to enhance the value and impact of FAB\nIdentifies, engages and mobilizes an internal network of partners to assist in the execution of activities, and deliver effective communications pre and post event.\nIdentifies community needs that provide opportunities for innovative social programmesA degree or relevant professional qualification or proven relevant experience which includes project and events management.\nAt least five years of demonstrable experience of working in events investment ideally within a financial or other corporate environment and with a commitment and passion for events.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}