{"Job ID": "69869131", "Description": "Job DescriptionWe are vital links between an idea for a new medicine and the people who need it. We are the people of PPD clinical research services — thousands of employees in locations worldwide connected by tenacity and passion for our purpose: to improve health. You will be joining a truly collaborative and winning culture as we strive to bend the time and cost curve of delivering life-saving therapies to patients.Summarized Purpose: We are seeking a decentralized clinical trials (DCT) Operations Director to oversee the implementation of the decentralized and digital strategy agreed for the study. This role supports the cross-functional efforts of the project team and DCT vendors to ensure milestone achievements and supports the development of an effective DCT delivery framework to expand the organizational capabilities.You will liaise and collaborate across multiple functional areas throughout the organization to foster cooperation and commitment to evolving clinical delivery through DCT. This is a key position, providing consultation, strategic and operational direction to partners  internal stakeholders on the suitability of digital and decentralized strategies. Essential Functions:Acts as a consultant and subject matter expert for all things relating to DCT trials.\nPartners globally and cross-functionally to support the development and implementation of an effective DCT delivery framework across the organizations.\nProject Delivery in compliance with systems, standard processes, policies and procedures to support the broader transition to DCT. \nResponsible for achieving overall financial goals (revenue and profitability) related to scope of work on assigned projects, and ensuring the timely execution of DCT services. \nCollaborates with the organizations D&DS leadership team and other senior, therapeutic area, geography and functional leaders to enable oversight of operational performance, resourcing, financial health/strategy and business planning and execution. \nRepresents the organizations D&DS at account governance level on designated client and partner accounts and contributes to the compilation of goals and business plan objectives for the strategic partnership. \nProvides input for the development of proposals for new work and project budgets.\nAbility to assess external and industry solutions and to operationalise them. \nOversees execution of digital and decentralized trial strategies in line with agreed upon contracts; optimizes speed for implementation while ensuring quality and cost of delivery.\nCoaches the project team on best practices to implement DCT solutions and to define and manage DCT KPIs, risks and quality issues related to those solutions. \nServes as the project team primary escalation for all things relating to DCT strategy. \nAdvises the project team on contracting and budget management with DCT vendors as well as project and site documentation. \nDevelops excellent working relationships with internal colleagues and leaders responsible for the delivery of projects and services to improve information exchange including best practices and lessons learned related to DCT strategy and their operationalisation.Education and Experience: Bachelor's degree or equivalent and relevant formal academic / vocational qualification.\nPrevious experience that provides the knowledge, skills, and abilities to perform the job (comparable to 12+ years).Knowledge, Skills and Abilities: Accomplished leadership and project management skills including leading and integrating global and/or cross-functional teams and multiple projects simultaneously.\nCapable of coaching, mentoring, and motivating project teams and/or partners to define and achieve project objectives.\nExcellent knowledge of the clinical development lifecycle.\nExperience of cross functional operational execution from study start to close-out and understanding the implications of changes between functions and being comfortable in offering alternative operational strategies. \nPossesses cross cultural awareness and capable of adapting appropriately.\nCreative thinker that can consolidate complex strategies into condensed focused deliverables.\nCapable of analyzing data, anticipating, and mitigating risk, exercising sound judgment, problem-solving, process-mapping, and decision-making while working under pressure and at times with limited desired information.\nAbility to develop business cases for future adoption of DCT related solutions.\nStrong financial acumen with strong knowledge of budgeting, forecasting and resource management.\nExcellent judgment and decision-making capability with ability to apply critical and analytical thinking skills and manage complex/ambiguous situations.\nStrong interpersonal skills and ability to influence at all levels, including the capability to build strong relationships in a matrix organization with experience in problem solving, conflict resolution, planning, team building and training skills.This role has no line management responsibility.At PPD clinical research services we hire the best, develop ourselves and each other, and recognize the power of being one team. We understand that you will want to grow both professionally and personally throughout your career, and therefore at PPD clinical research services you will benefit from an award-winning learning and development programme, ensuring you reach your potential.As well as being rewarded a competitive salary, we have an extensive benefits package based around the health and well-being of our employees. We have a flexible working culture, where PPD clinical research services truly value a work-life balance. We’ve grown sustainably year on year but continue to offer a collaborative environment, with teams of colleagues eager to share expertise and have fun together. We are a global organization but with a local feel.Our 4i Values:Integrity – Innovation – Intensity – InvolvementIf you resonate with our 4i values above, and ultimately wish to accelerate the delivery of safe and effective therapeutics for some of the world’s most urgent health needs, submit your application – we’d love to hear from you!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}