{
    "Job ID": "69867140",
    "Description": "OmboriGrid is hiring an Embedded Linux/ Devices Team Lead to work in Dubai, UAE.What does OmboriGrid do?We are creating the market leading Store Digitalization Platform to power the best in-store shopping experiences for customers and empower employees.We bridge a wide range of IoT devices, AI and machine learning powered cognitive services with touch screens and mobile phones to create solutions that are memorable, easy to use, and delight our customers.We're growing fast\nIn February 2021 we took second round of investment of 60million SEK to fund the next stage of our expansion.What will you be doing?Do you use the Linux desktop as your daily driver? Do you know the difference between Wayland and Xorg? Is your desktop web-browser running smoothly with hardware accelerated rendering and video playback? If the answer is yes, join our team!We are looking for ambitious and creative engineers who are up for the challenge.We are very passionate about technology. We use the latest and greatest tools and we’re always looking for ways to innovate. Everyone in the team actively influences the design and functionality of our products.Your role will be to develop exciting IoT and embedded solutions that improve the lives of end users. This involves developing and maintaining core platform modules as well as user-facing features across our product range:Building and maintaining embedded system that lives at the very heart of Ombori Grid (Linux, Docker, Chromium, Azure)\nOptimising platform software for maximum performance and stability across a vast array of devices (Intel and ARM computers, Smart TVs and more)\nIntegrating various hardware components and peripheral devices with the platform\nDeveloping core platform tooling and libraries\nCoordinating development efforts with colleagues as well as customer tech teams\nFollowing DevOps principlesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}