{
    "Job ID": "69865986",
    "Description": "Job ResponsibilitiesReview Loan documents and process transactions as per SLA\nPerform activities such as review of underwriting documents, Deal closing and loan servicing activities \nInterpret and understand legal documents pertaining to underwriting and perform due diligence to comply with the lending requirements\nProcess Financial Statements, Appraisal reports, Borrowing Base Certificate, Compliance Certificate, Mortgage documents,  Credit Agreement and abstract critical data\nPerform analysis of Financial Statements and complete spreading as per the guidelines\nPerforms required research on the received request within stipulated timelines\nFollows up on deficient documentation with relevant stake-holders       \nMeet and exceed the turnaround time and accuracy rate as per the specified target\nEnsure adherence to the quality control standards that have been set for the process\n   Required Qualifications, Skills and Capabilities6 months to 2 year of work experience, preferably in Banking/Mortgage/Financial Analysis and Loan Operations\nYou should be open to work in night shifts, Strong verbal & written communication to effectively communicate with various stakeholders and across levels\nManage the complex requests with minimum supervision and independently make the decisions related to the process\nPreferable knowledge on aspects of Financial Statements, MIS reporting, Credit Agreement and other loan documents\nACBS/VLS/LIQ servicing system knowledge preferred, Demonstrate the attributes of flexibility and accountability\nExcellent interpersonal skills to work effectively in team environment, Attention to detail and problem solving skills, Client relationship and time management\nMS Office skills, Strong problem solving skills to undertake analysis, resolve issues/problems related to the process, Risk & control mindset, Experience in managing small projectsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}