{"Job ID": "69866223", "Description": "Job Description:In Scope of Position based Promotions (INTERNAL only)Job Title- Risk Analyst – NFRM CoverageLocation- Mumbai, IndiaRole DescriptionThe purpose of the Non-Financial Risk Management (NFRM) function is to ensure that the bank’s Non-Financial Risk (NFR) exposure is adequately managed in-line with the group wide risk appetite and NFRM framework. To achieve this the NFRM function requires:Risk Managers with experience, seniority and tools to assess complex risks and intervene where they lie outside the bank’s risk appetite\nA comprehensive, integrated, simple and easy to use NFR Framework with supporting technology that assists risk identification, assessment and remediation\nStrong understanding of the businesses combined with regular engagement which would allow NFRM to provide support, review and challenge in line with the 3 Lines of Defence Model\nClose coordination with all 2nd Line of Defence (LoD) Risk Type Controllers to facilitate the production of a holistic view of NFR\nProper consideration of emerging risks, rather than just current issues\nEffective governance combined with supporting MI that facilitates decision-makingNFRM is a matrix organization with business/region and functional specialist axes.The role a business aligned NFR manager has within NFRM is to work with a specific business area and manage NFR according to the 3 LoD model and the NFR mandate. Specifically, they perform independent oversight of the implementation of the Group's NFRM Framework within the Business Divisions and Infrastructure Functions and independently assess material risks and/or key controls (as required), providing challenge, approval or veto as appropriate.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesThis role in the NFR Mumbai Risk Centre’s Coverage team will be expected to effectively perform 2nd LoD responsibilities to include the independent advice, facilitation, and monitoring and assessment activities on a risk-basis for the underlying business units.Collaborate with key 1st LoD stakeholders through periodic touchpoints to dynamically monitor changes in the businesses risk profile; identify areas of challenge based on read across of underlying information (e.g. loss themes, metrics, Findings/SIIs and other contextual information)\nProactive identification of internal and external events through internal reports and external aggregators (such as ORX, Reuters, Bloomberg, etc.); strategic analysis of identified control deficiencies to better inform on underlying themes/drivers\nSupport the development of a framework to govern the remediation of identified risks and map these risks to other control issues\nMonitor key metrics through internal reports and systems and flag issues and breaches; collaborate with 1st LoD stakeholders as the issues and breaches evolve and help provide a link to the wider NFR landscape\nAssist in the preparation of decision-making material (such as reports, dashboards, etc.) for the effective 2nd Line of Defense monitoring and challenge of operational risk management\nAssess key risks and controls e.g. review lessons learned, deep dives, scenario analysis/emerging risk discussions, transformation risk and new product reviewsYour skills and experienceDemonstrable experience of developing strong working relationships with business areas to facilitate successful risk management within the 3 LoD model\nAdvanced user of MS Excel / Access database with experience of data aggregation and manipulation to produce meaningful MI\nExperience with external risk related data sources, such as ORX, Reuters & Bloomberg\nWorked with Senior Stakeholders within a high pressure dynamic environment\nAbility to demonstrate effective challenge to divisions with regards to risk identification and risk mitigation; identifying material themes and being able to influence business areas to focus on those areasHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}