{"Job ID": "69866994", "Description": "Position status: This opportunity is for a secured role that is due to commence in November 2023 subject to Client approval. If you would like to be considered as we progress with this position, please click to apply.The opportunityMace is an inclusive employer and welcomes interest from a diverse range of candidates. Even if you feel you do not fulfil all of the criteria below, please apply as you may still be the best candidate for this role or another role within our organisation. Should you require any adjustments to assist during the application/hiring process please advise us.Project: Mace is providing project management consultancy services on a large luxury mixed-use development in the Umluj area of Saudi Arabia.Your responsibilities will include:Ensuring client and 3rd party reviews are scheduled and aligned with programme. \n\nEnsuring client and statutory approvals are built into programme. \n\nEnsuring detailed and/or peer reviews are scheduled if required. \n\nEnsuring value engineering workshops are scheduled and participate. \n\nEnsuring constructability reviews are scheduled and participate. \n\nAssisting in preparation of consultant scopes and project briefs. \n\nAssisting in preparation of RFP/ITT packages. \n\nReviewing Consultant and/or Contractor design submissions and progress reports. \n\nManaging, coordinating, and participating in design and technical review workshops. \n\nChallenging and supporting the design teams to ensure design solutions are optimized. \n\nUtilizing company resources efficiently to accomplish assigned work. \n\nEnsuring that personal health, safety, and wellbeing, and that of the team is maintained. About youYou are proficient in Arabic language with a bachelor’s degree in architecture or any similar qualifications. You will take personal development seriously and be chartered or pursuing a similar level of professional qualification. You are digitally savvy, can build lasting client relationships and provide support strong, motivated teams. You must have experience of programme or project management equating quality and value with the individual client and be hungry to grow your career and enjoy the opportunities Mace has to offer. If you would like to make a confidential enquiry, please contact Ryan Catani in the recruitment team.Please remember the Employee Referral Scheme and if there are any talented people you can recommend, just click the button and use the ‘Refer a friend’ feature found within the relevant job.Apply now for a confidential discussion.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}