{"Job ID": "69866008", "Description": "Lead Reliability Engineer- Drilling ServicesDo you like working in collaborative teams and solving critical issues?Do you have a passion for delivering all types of reliability solutions?Join our Drilling Services team!Our Drilling services Team provides industry-leading products and services that optimize the extraction, production, and processing of energy. We help a diverse range of customers across the value chain to reduce operating costs and improve productivity.Partner with the bestAs a Lead Reliability Engineer, you will be responsible for identifying, leading, and executing activities that are aimed at reducing the costs of failure caused by non-productive time, repair costs, personnel, and premature product failures.As a Lead Reliability Engineer, you'll be responsible for:Leading & participating in Incident Investigation, ensuring the end to end process is considered, (including job planning, preparation, and execution), when determining incident root cause(s) alongside appropriate corrective actions.\nFocusing on preventing failures during the lifecycle management of a product or service through active monitoring and corrective action planning.\nSupporting job planning and preparation by participating in Risk Assessment / deviation waiver / Management of Change (RA / DWR/ MOC) and deployment readiness assessment processes (DRA).\nExecuting the key steps outlined within the Field Incident Management Process (FIMP).\nManaging the FRACAS DMAIC stages & identifying FRACAS trends to identify and prioritize failure modes to investigate for corrective actions.\nApplying root cause analysis (RCA) processes and developing and review cause maps.\nDeveloping RCA reports and technical or field bulletins.\nSupporting new product development in all aspects relevant to reliability engineering, through direct liaison with engineering and the deploying region.Fuel your passionTo be successful in this role you will:Have a Bachelor’s degree in Engineering.\nHave at least 7 years’ experience in reliability engineering\nhave Reliability Engineering experience within Drilling Services.\nHave prior experience in roles such as: Field Engineer/Specialist or Remote Professional, product development, applications engineer, AMO engineer or other technical disciplines.\nDemonstrate effective communication, interpersonal and leadership skills with the ability to influence others and lead teams.\nShow the ability to work in a global matrix organization.Work in a way that works for youWe recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too. In this role, we can offer the following flexible working patterns:Working flexible hours - flexing the times when you work in the day to help you fit everything in and work when you are the most productive.Working with usOur people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.Working for youOur inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:Contemporary work-life balance policies and wellbeing activities.Comprehensive private medical care options.Safety net of life insurance and disability programs.Tailored financial programs.Additional elected or voluntary benefits.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}