{"Job ID": "69869953", "Description": "Madison Pearl is engaged with a UAE based, influential Financial Services group, who are looking to hire a Senior Credit Lead to effectively steer the credit function in all related disciplines. This is a senior role with key management responsibilities and will assist the group in managing complex credit models / products.The ideal candidate would be working in a leading Financial Institution located in the top Financial Centers across the globe, possessing a track record of managing large teams and leading their credit structures.Take the helm and steer the entire credit cycle, encompassing products and tailor-made structured offerings that cater to the diverse credit requirements\nControl several stakeholders, including the Business Head, the Legal & Compliance, and the Audit teams.\nSpearhead the maintenance of our credit manuals and undertake meticulous due diligence on credit-related products and select credit initiatives.\nAct as a cornerstone of support for the business by providing assistance to various internal functions in orchestrating the establishment of credit facilities and bespoke credit solutions\nOffer sage counsel on the most advantageous transaction structures, taking into account factors such as risks, rewards, client profiles, credit policies, competition benchmarks, processes, and alignment with the bank's risk appetite.\nProvide recommendations for the best transaction structures taking into account risks, benefits, client profiles, credit policies, competition's offers, processes, and the bank'sBachelors Degree in Finance or a related disciple (Masters Degree preferred)\nAt least 15 years of experience in credit functions of a large FI\nPossess strong knowledge of modern system & digital technologies\nStrategic management skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}