{"Job ID": "69866238", "Description": "Oncology Business Partner – HCC Upper EgyptDo you have expertise in, and passion for, Sales? Would you like to apply your expertise to impact the lives of patients in a company that follows the science and turns ideas into life changing medicines? Then AstraZeneca might be the one for you!ABOUT ASTRAZENECAAstraZeneca is a global, science-led, patient-focused biopharmaceutical company that focuses on the discovery, development, and commercialization of prescription medicines for some of the world’s most serious diseases. But we’re more than one of the world’s leading pharmaceutical companies.BUSINESS AREAJoin a place that’s working to fundamentally change the way cancer is treated. Evolving to an outcomes-based model – we go beyond treatment to shape the cancer care environment and transform the whole patient experience. We work holistically, from early diagnosis to survivorship, ensuring no patient is left behind. Each of us believes that by delivering earlier stage interventions with curative possibilities and championing the development of precision combinations, we can transform the lives of patients living with cancer across the world.What you’ll doEngage Oncology healthcare professionals in dialogue about approved indications and product efficacy/safety profiles to support on-label prescribing for appropriate patients\nFind innovative solutions for drug accessibility to patients  \nResponsible for right positioning of the genetic testing for treatment paradigm  \nResponsible for different accounts mapping with engagement plan to different stakeholders\nFill the gaps in patients' journey\nEnsure right positioning of the drug and right use throughout scientific message and engagement plans\nFollow up with all the stakeholders in the assigned accounts (Payers, Diagnostics, Purchasers & Pharmacists)\nFocus on all the cases to ensure proper diagnostics to establish testing concept\nAchieve sales target and assigned Sales KPIs in line with our policies and procedures\nPromote AstraZeneca’s portfolio and services by providing the latest and most relevant data and information to the right customer at the right time\nSupport Healthcare professionals’ decision and optimize patient outcomes in an ethical way\nLeverage all available data sources to create, dynamically prioritize and adapt relevant territory and customer engagement plans\nDemonstrate advanced customer engagement skills to deliver high quality customer interactions and maximize customer experience for the benefit of patients\nMaintain a deep and current knowledge of the industry, trade association, competitors, buyer dynamics and focus effort on customer opportunities\nBuild interpersonal inclusion through self-awareness, developing curiosity, active listening and strengthening team/peer inclusion.Essential for the roleAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We all applicable laws and regulations on inclusivity in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Applicants should possess the following qualifications to go through initial screening:Pharmacy or Medicine graduate.\n2 Years Multinational Experience\n1 Year Oncology Experience is a must\nExcellent communication skills in English/ Arabic\nPresentation skills, digital abilities and learning agility\nEffective interpersonal and team building skills.\nCompleted military or other governmental obligations.\nDriving license is required.Why AstraZeneca?At AstraZeneca we’re dedicated to being a Great Place to Work. Where you are empowered to push the boundaries of science and unleash your entrepreneurial spirit. There’s no better place to make a difference to medicine, patients, and society. An inclusive culture that champions diversity and collaboration, and always committed to lifelong learning, growth, and development. We’re on an exciting journey to pioneer the future of healthcare.Date PostedClosing DateAstraZeneca embraces diversity and equality of opportunity.  We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills.  We believe that the more inclusive we are, the better our work will be.  We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics.  We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}