{"Job ID": "69865550", "Description": "About the CompanyWe are the largest oil producer within the ADNOC Group, accounting for over half of ADNOC’s total oil production. As the country’s oldest oil production company, our operations date back to 1939, when a 75-year concession was signed to explore for oil and gas in Abu Dhabi. As a global industry leader in environmental sustainability, we are the first in the world to capture carbon from the iron and steel industry. Our Carbon Capture, Utilization, and Storage (CCUS) facility at Al Reyadah has the capacity to capture 800,000 tonnes of carbon dioxide (CO2) from Emirates Steel Industries (ESI) each year, for us in the Bab and Rumiatha oil fields to support Enhanced Oil Recovery (EOR).About the JobAccountable and responsible for all Upstream Technical Data services support.\nSupervise the Data loading activities for the technical data that involves Quality checking, validation and cleansing of the data.\nManagement of Data loading resources while monitoring the data continuously, analyzing and reviewing current Data-Loading and validation processes and improving the business practices as per defined protocols.\nData Management Governance Framework to support Data Integrity, Security and timely Data Availability to facilitate uninterrupted Asset operations.Key AccountabilitiesResponsible for all Upstream Technical Data Services support including but not limited to Geoscience data,Drilling data, Reservoir data, Production data, Operations data, Engineering data, Geospatial data, Planning data, Economic data etc covering the various data types/formats such as structured data, unstructured data,Static data, Real Time data, corporate data, Master data, Operational data, Analytical data, Interpretated data and Big data.\n\nReview, verify and amend the data for inconsistencies that could skew analytical results to support effective operations decision making.\n\nResponsible for validating and quality checking all data classes and overseeing their loading to the petrotechnical applications and ensure they are in line with Data Management Governance framework while guaranteeing completeness of these data.\n\nMaintain technical data classes for the related disciplines. Responsible to maintain the quality and trust on the available Geological, Reservoir Engineering, Petroleum Engineering and Petro physical data in corporate database for the Asset user to do the Business work like Geological interpretations and Reservoir modelling.\n\nDerives significant and measurable performance in Artificial Intelligence (AI) and digital transformation initiatives by identifying, creating, and leveraging opportunities for upstream technical data innovations based on the wealth of data residing in company’s systems.\n\nResponsible to manage Data management team members to manage respective data across petrotechnical applications by ensuring the implementation of proper data flow procedures for various data classes. Ensure harmony between all technical data classes among different data base systems.\n\nCollaborate with users to define the new data requirements as per current and emerging business requirements. Performing data rationalization based on the business requirements and participate in defining the interfaces between different business units and applications.\n\nRevising operational codes and ensure populating the agreed naming and coding data to assure compliance with data management governance framework. Manage data loading workflow exercises within the company/AGCs for preparing/updating data loading process manual.\n\nParticipate in data governance initiatives in establishing standard data flow procedures, enterprise data model and data stewardship for various technical data classes and business functions. Contribute in developing and implementing best practices to ensure data completeness, quality and validation achievement.Minimum RequirementsBachelor Degree in Geoscience/Petroleum Engineering/Reservoir Engineering or equivalent relevant education\n\nAt least 8 years experience in Technical Data Services & Management in an oil and gas industry\n\nExperience in Artificial Intelligence & Digital Transformation projectsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}