{
    "Job ID": "69866847",
    "Description": "Your career’s next level can create next-level impact. You want to do work that matters. We want to make that possible.For 30 years we’ve helped the world’s most established brands evolve for a more digital future. We combine strategy, experience design, and engineering to build products and innovate game-changing services that allow our clients to thrive. Through it all, one thing has remained constant – the secret to our success is hiring people like you.One team all around the world. Find endless opportunities and access to a vast network with 50+ offices across the globe.As Programme Director, you will lead large-scale, multi-dimensional initiatives enabling your clients Digital Business Transformation. You will partner with senior client executives and ultimately be accountable for the overall strategic shaping, planning, implementation, and effectiveness of work for client engagements. You will guide globally distributed teams to deliver successful software outputs and meaningful business outcomes for clients while influencing change.Act as the primary Engagement Lead for delivery of large-scale and complex programmes for client’s digital business or engineering transformation programmes\nFacilitate internal teams and advise clients to connecting solutions and integrating processes to ensure programme development is in line with broader goals and objectives of the programme\nDefine processes and tools needed by teams across all programmes enabling successful programme implementation and delivery\nProvide guidance on consistent application of project management methodologies that align with strategic plans\nPartner with clients to plan, evolve, and formulate a customer-focused digital business transformation (DBT) strategy; seed, estimate, and facilitate budget planning for value-based digital business transformation engagements\nTrack and evaluate the delivery metrics of the product teams within the engagement and facilitate continuous improvement to improve flow, quality, and value realisation\nAct as a trusted strategic advisor to clients to transform their business by guiding internal leaders and external senior stakeholders on engineering and digital business transformation methods and approaches\nOwn or liaise with the Executive PMO to communicate programme executional metrics, risks, issues, and dependencies\nArticulate engagement commercial metrics including client outcomes, leakage, burn rate, revenue & margins, etc. to support account health and drive account-level planning within the industry vertical\nDeliver thought-leadership around industry, process, PMO, delivery, and technology on behalf of the organisationFluency in Arabic is essential\nExperience with a distributed delivery model, leading diverse teams, and collaborating in a multi-cultural environment for end-to-end engagements\nProgramme management experience in scaled digital implementation leading high performing teams within IT and consulting environment\nEffective systems thinking skills and ability to identify interconnectivity across multiple streams of work\nDemonstrated experience navigating a large organisation, showcasing the ability to influence with storytelling and data\nComfortable with C-suite reporting relationships and presenting to C-level executives, senior business leaders, and technology leaders\nKnowledge of best practices in design thinking/user-centered design (e.g., user research, hypothesis-driven development, prototyping, and usability testing)\nExperience with a variety of methodologies like Scrum, Kanban, Scaled Agile frameworks (SAFe etc.) - We only deliver in Agile as our emphasis is delivering working product\nEffective leadership, analytical skills, and negotiation skills\nEffective conflict resolution skillsWe know the importance of health and wellbeing so offer you extensive retail discount offers and further reimbursement towards activities that contribute to a healthier lifestyle\nWe are proud to actively invest in your learning through various learning platformsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}