{"Job ID": "69868172", "Description": "You as a Protection Engineer (Open) will be part of Hitachi Energy business based in Abu Dhabi, United Arab Emirates. In this role, you will be associated to activities for power network control center (SCADA/EMS) and substation control & protection system. The success candidate will be the part of an International Engineering Team specialized in Network Control Integration. (Beginners accepted) Your responsibilities: Evaluating the substations protections (existing & upcoming). Coordinating design review activities within an international team and between control center and substations. Participating in specification at the tender and pre-tender stage, through standard and customized requirements. Carrying out general and detailed design studies for Tele-information Plan and hand over technical and commissioning documentation with the requested quality level (specifications, drawings…) and within a defined timeline. Participating in the technical discussions / decisions / communications with the customers and Employer covering the whole business value chain where technical knowledge and skills are important (Tendering, Sales, Project execution, After Sales, Services…) Supporting the local & global organization on Support & Maintenance, Supply Chain, quality assurance activities, cost savings.                    Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your background      A bachelor’s degree in relevant field. Testing and commissioning of Main and Backup protection relays with knowledge of communication protocols. Knowledge of communication protocols like IEC61850, IEC101-4, TASE2 etc. Flexible and capable to collaborate with a worldwide multi-cultural technical environment. Knowledge in different areas like Database Management, Telecommunication Protocols, Programming, AI, Cybersecurity. Proficiency in both spoken & written English language is required.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}