{"Job ID": "69867088", "Description": "Job Brief:Responsible for defining and enhancing the organization’s overall customer experience strategy, programs and initiatives to ensure a best-in-class customer experience. Develops the customer journey maps for multiple products and solutions, across all channels and touchpoints. Guided by data, develops clear roadmaps and action plans for building a positive customer experience. All activities should be centered around regularly reviewing how customers perceive the interactions with the company and the brand, while driving higher customer satisfaction, customer retention, new business, and net profit growth.Key Responsibilities:Apply a commercial mindset to lifecycle management, handling specific segment channel design of the customer journey and ensuring that this design is reflected in all consumer products, market and channel activities to drive CEand commercial results.\nRun regular diagnostics of customer-touching processes to assess performance and detect issues impacting customer experience. Report and analyze processes’ discrepancies and deficiencies resulting in such issues.\nMap and analyze business cycles to identify any gaps or potential flaws causing performance fallouts or disparities against best practices and CX guidelines - Proactively identify potential issues and collaborate with cross- functional partners to mitigate issues and risks by planning/implementing solutions with a sense of urgency.\nAssist in overlooking a VOC framework that allows for a holistic view of customers’ needs and experiences across various touchpoints. Catalogue all issues pertaining to these touchpoints, analyze trends, and understand patterns relating to such issues.\nSet and monitor specific performance measures across various access channels in line with the set standards and guidelines- qualitative and quantitative measures, and regular health checks.\nIdentify improvement opportunities in line with process gaps and customers’ feedback – assist in reengineering business cycle and introducing enhancements through process modifications and automation.\nAssess and plan potential development initiatives in line with the reported touchpoints’ experiences, channels performance measures, and VOC outcomes. Use project management tools to track implementation. Ensure that data analysis is conducted to measure post-implementation impact.\nLead on customer experience development projects, supporting launch and testing activities and where necessary take the end to end ownership from design to implementation working with cross-functional stakeholders as well as customer journey business processes design and optimization.\nIdentifies, assesses and solves complex business problems for area of responsibility, where analysis of situations or data requires an in-depth evaluation of variable factors.\nApply testing methodologies and analyze performance for execution optimization.\nPerform Customer Journey product testing in addition to Use case assurance.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Amman, Jordan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}