{
    "Job ID": "69866551",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Who you’ll become Sales Account Executive Responsibilities: The Account Executive's primary responsibilities include prospecting, qualifying, selling and closing new business to existing and net new customers. The Account Executive brings a point of view to the Customer engagement; uses all resources to solve customer problems with appropriate SAP products.  Your end-goal? To help companies of all sizes, solve their unique challenges – and run simpler. As a Sales Account Executive within the SAP Academy for Customer Success, you will be a responsible to:  Successfully complete a 9-month learn-apply program that enhances your support in the sales role, a critical customer-facing function within our Customer Success Board Area.   \n\nImmerse yourself in multi-dimensional, experiential learning with a focus on digital transformation, global intelligence, human skills, business and technology acumen, solution/industry knowledge, and strategy/tools/process.  \n\nLearn how to drive value across the customer lifecycle through solution adoption and ongoing renewals that foster account expansion.  \n\nReceive onboarding in your local market with on-the-job training and mentoring by Senior Account Executive in the field. You will have the opportunity to work both behind the scenes and directly with customers. The program will enrich your knowledge of SAP, as well as enhance your professional experience to be ready to serve our customers. We offer full-time employment from day one with practical learning application for your role.  Upon successful completion of the program, you will move into a direct customer-facing sales role in your market and continue to receive mentoring and coaching support to accelerate your growth.  Sales roles in scope: Industry Account Executive (IAE), Solution Specialist, Midmarket Sales Executive (MSE).   What you’ll bring Up to 3 years’ work experience in a quota carrying sales environment in a technology company OR in a role with significant exposure to software/technology solutions. \n\nMulti-dimensional experience: global experience, leadership role, athletics, entrepreneurial/self-starter, volunteerism, music. Strong communication skills including fluency in English and local language. \n\nProficient interpersonal skills including passion, curiosity, collaborative working style, effective listening skills, professional presence, and empathy.  \n\nDemonstrated ability to collaborate across diverse stakeholders and business functions.  \n\nStrong Business Acumen including demonstrated knowledge of business processes and/or industries.  \n\nUAE National About SAP Academy for Customer Success  The SAP Academy for Customer Success is a world-class training program that develops our next generation workforce by delivering an energizing and inspiring experience within a globally diverse environment. This dynamic 9-month program strengthens the foundation for a successful career at SAP.   Join us for the opportunity of a lifetime, to develop a global peer network, partner and engage with customers to help solve their unique business challenges, and leverage world-class cloud-based products and services, all while earning a great salary and benefits.   \n#SAPAcademyforCustomerSuccess   #SAPSalesProgramG18 The SAP Academy for Customer Success has shifted to a hybrid work model with a 50% in-office expectation. There is a high likelihood a portion (4-6 weeks) of the program will be held in San Ramon, California in late Q3 of 2024. This decision will be made in Q1 2024.  We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 379858  | Work Area: Sales  | Expected Travel: 0 - 100%  | Career Status: Graduate  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}