{
    "Job ID": "69866157",
    "Description": " About the OpportunityA Buildings Revit Technician (MEP) plays an important role in the design delivery and design integration of projects delivered by the Building Services.Using technical experience and excellent people skills, the Buildings Revit technician (MEP) will be responsible for the digital delivery of the MEP systems design for projects. The collective team will produce multi-disciplinary designs and associated deliverables in an integrated and holistic manner using appropriate modelling and associated analytical software; Revit technicians play a key role in implementing the design and delivery process.Key ResponsibilitiesThe digital delivery of MEP models and task information management of the MEP design from initiation to project close out\nSupporting the BIM manager in the delivery of digital outputs within project teams and the seamless sharing of information with other discipline teams\nTask level management of the BIM model\nRepresenting Buro Happold's in liaising with clients, engineers, and other design team members\nDevelop and maintain excellent team relationships through successful project execution\nSupport with development of a content library suitable for the MEP team and integration with the Buro Happold's standard library\nCoordinating the activities, output and standardisation of MEP deliverables\nSupporting development of Revit skills for MEP teamHere’s What You’ll Need:Relevant experience in the modelling of buildings MEP systems – Electrical/ MechanicalBuro Happold is proud to be a practice of a diverse range of professionals. We actively promote inclusivity to enable every individual to reach their full potential, the more inclusive we are the better our work will be.\n\nWe are working to change the lack of representation of minority groups in the built environment, and are particularly keen to hear from anyone who feels they are underrepresented in the industry. We have much to learn from one another. Embracing difference allows us to develop the most innovative and elegant solutions.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}