{"Job ID": "69861181", "Description": "Job Description and QualificationsLocation: Based in NEOM, Kingdom of Saudi ArabiaIntroductionAt Air Products, our purpose is to bring people together to reimagine what’s possible, collaborate and innovate solutions to the world’s most significant energy and environmental sustainability challenges. Grow with us as we embark on building tomorrow together by being the safest, most diverse, and most profitable industrial gas company in the world. At Air Products we always thrive to ensure the duty of care toward our employees and contractors by having an exceptionally safe and healthy environment. Setting our employees and contractors at the center of concern for sustainable development by prioritizing their safety, health, and wellness. We opt to drive a proactive rather than a reactive holistic approach to the aspect of occupational health and wellness. Thriving further in addition to existing resources/tools we continuously ensure meeting our needs to expand resources to meet our team’s wellbeing.Role SummaryReporting to the Projects’ Overall Head of EH&S, on-site, as part of the overarching organization for NGHP and HIDC project, responsible for managing all health care aspects incl. occupational health and medical emergency preparedness and response related to all project elements including contractors’ during the project execution phase.AccountabilitiesOversee all project-related health care, occupational health and medical emergency preparedness and response aspects as well as provide sound technical advice on all preventive health care activities.\nEstablish promotion programs to maintain the well-being of all in the project.\nSupport the projects - in coordination with the Welfare Lead, EH&S managers and 3rd party health care providers - in all project health and welfare aspects.ResponsibilitiesEnsure project elements meet the project requirements related to health care and medical emergency preparedness and response aspects.\nPerform regular inspections and audits.\nEstablishes proactive health programs within the project to help recognize, eliminate, and control health hazards and diseases, with health mitigation plans for any identified risks.\nConduct and supervise inspections and provide recommendations for enforcement of local and national regulations.\nEstablish health programs, advise the Discipline Supervisors, Field Superintendents, and Site Manager of any shortfalls, and provide specialist support.\nContribute to the weekly and monthly overall EH&S reports.\nBecome the Project’s Subject Matter Expert (SME) for current health regulations.\nBecome actively involved in RCA’s / Incident investigations.\nActively participating in health promotion events, competitions, and established programs.\nLead the promotion of health and health education, including injury prevention, and home safety in line with project and community objectives.\nLead infectious diseases prevention with support from an onsite healthcare provider and GH&W.\nWork with respective teams to ensure compliance and that all project set-up is supporting health and well-being.\nEnsure sites/accommodations are implementing infection control protocols that meet best practices.\nMaintaining a strong and effective professional working relationship with the AP Project Management team, Client, interfacing EPCs, sub-contractors, and other stakeholders.\nWhen required or requested, represent the Company in meetings with applicable stakeholders.Competence, Experience and SkillsPhysician\nExtensive experience in construction projects in remote areas in the fields of occupational health and medical emergency preparedness and response.\nExperience in the setup and operation of remote clinics (incl. ambulances), managing occupational health programs incl. fitness to work and medical screenings, and medical emergency preparedness and response.\nCaring with strong interpersonal skills.\nAbility to communicate effectively in English.\nProblem-solving and analytical thinking skills.\nFlexibility with frequent travel to project site locations and outdoor activities.\nAbility to work independently and as part of a team.\nGood Knowledge of Microsoft software, particularly Excel and PowerPoint).\nEffective educator, observer, and coordinator.\nOrganized, disciplined, able to perform under pressure and manage multiple priorities and parallel tasks.\nAbility to work in a multifaceted/multinational organizational matrix with a variety of working relationships.\nResults oriented. Must be able to understand the impact of decisions/changes on project health and welfare risks and overall project success.\nWorks autonomously, reliably communicating upwards when appropriate.\nPossess a driving license or eligible to receive one.\nKSA or middle east experience is of benefit.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}