{
    "Job ID": "69869887",
    "Description": "Seamedu - School of Pro Expressionism is a full fledge media school based in Pune, founded in 2008 to produce world class talent in Media & Entertainment (M & E) fields of Digital Film making, Animation, Game Design, Visual Effects, Sound Design, Broadcast Media, and Broadcast Journalism. Seamedu is the type of institute that nurtures the creativity of the students. Seamedu has been awarded by the Government of Maharashtra in IT & IT related Fields-Multi - media/ Entertainment/ Gaming. Seamedu also has campuses in Bangalore, & Delhi.To know more about us, please visit – www.seamedu.comIndustry: EducationFunctional Area : Visual Effects and Game ArtJob Description:The candidate must be a 3D Generalist. Candidate with 5 years of Industry or teaching experience. Will be responsible for handling all 3D-related subjects for B.Sc Visual Effects & Animation / B.Sc Game Art & Design. Must be interested in creating professional student projects and portfolios.Specific Skill Set:-         Should have good experience in teaching Modeling and texturing.-         Should have good experience in teaching 3D, as a Generalist.-         Software Knowledge: Autodesk Maya, Zbrush, Substance Painter & Adobe Photoshop-         Initiate 3D projects which can be integrated with Game & VFX .-         Good communicator (both oral and written) in English .-         Should demonstrate a positive attitude, high motivation, and interpersonal skills.-         Should have worked for commercial company / freelance projects.Any other skill set:Experience in working / teaching other 3D skills .Experience in working / teaching designing skills.Minimum/ Work Experience Required:5-6yearsLocation(s) of Job: Bangalore (CMR University)Minimum Education Requirements: Bachelor’s degree in Animation or equivalent education with relevant experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}