{
    "Job ID": "69866290",
    "Description": "Work Flexibility: HybridWho we want:\nDescribe the open role, highlighting key responsibilities and tasks. This verbiage will be used in job postings to draw in potential candidates.\nWhat you will do:\n• Lead the team in the development of the project charter and management plan. Direct, manage, monitor, and control project. Evaluate tradeoffs within project.\n• Meet with project stakeholders to understand and refine project scope; review with manager for approval. Create detailed Work Breakdown Structure.\n• Develop and manage the detailed project Gantt chart. Analyze critical path and major workstreams.\n• Collaborate with supervisor and/or project PM to establish sub-project budget. Monitor and maintain costs within budget.\n• Partner with project team to create project Quality Plans using 1-2 quality planning tools and techniques. Monitor and maintain plans.\n• Develop a risk management plan for the project. Identify, analyze and understand project risks, develop and monitor a risk response plan.\n• Contribute in the development of a Procurement Management Plan and collaborate on the selection of procurement partners\n• Estimate, acquire and assign project team resources. Define the role, responsibility, and deliverables for each team member. Provide direct feedback to functional manager on performance reviews.\n• Develop a Stakeholder management plan for the project, based on the identification, analysis and understanding of Stakeholder expectations.\n• Develop and Execute the communications management plan for project team and the needs of key stakeholders\n• Additional role-specific technical areas of responsibilities may be added as deemed necessary by the local hiring manager.\n• Builds successful working relationships with internal and external personnel in various departments. Understands quality system(s).\n• High in emotional intelligence and stays calm under pressure. Adept in conflict resolution\n• Drives results in support of the business, even in the face of demanding timelines. Steps up to take on additional responsibility where appropriate\n• Adept at team management: selects the right people to the right tasks all while maintain team morale and recognizing contributions.\n• Can influence without direct authority in a way that makes others want to be on their team.\n• Incorporates end-user feedback to refine scope through the project lifecycle and can communicate changes, updates and decisions to key stakeholders\n• Can understand and communicate how goals fit into broader organizational goals, and prioritize tasks/schedule accordingly.\n• Keeps the customer at the heart of what we do\n• Exercises good judgment and can weigh benefits and risk in order to make solid decisions despite ambiguity\n• Growth mindset – ability to learn quickly and adapt to a changing environment.\n• Additional role-specific knowledge and capabilities may be added as deemed necessary by the local hiring manager.\nMinimum Qualifications (Required):\n• BS or equivalent and 8+ years of work experience\nPreferred Qualifications (Strongly desired):\n• PMP or equivalent preferredJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}