{
    "Job ID": "69866330",
    "Description": "Archirodon, having earned its reputation as a reliable and respected international contractor for more than a half century in the Engineering, Procurement and Construction (EPC) market, continues to create value to its stakeholders by executing complex EPC projects worldwide, in recognition of its superior standards of performance.  We have an outstanding record in completing major Energy, Marine, Infrastructure and Defense & Security projects around the globe and we pride ourselves on delivering over the years the kind of reliability and trust that the client has the right to expect from a major EPC contractor.We are constantly growing and are currently looking for one (1) Civil QC Inspector to join a top qualified and knowledgeable team of Engineers in our project in Duba, Saudi Arabia.Would you like to be part of a dynamic EPC leader with global presence? We’d like to meet you.Join our worldwide journey. Build on something that matters!What you will need to do:Review of project technical specifications, drawings, and BOQ to identify and determine quality and engineering criteria for materials, workmanship and testing requirements related to civil works.\nPerforms verification inspection of work elements related to civil works, to assure compliance with established procedures and Project’s specified requirements.\nParticipates in on site receiving Inspection of civil materials\nPrepare, review of concrete specification, mix design and ITPs.\nCivil Testing Standards, Concreting, Marine, Onshore & Offshore Construction Inspections.\nKnowledge in all civil laboratory testing requirements.What you will need to have:Degree in Civil Engineering from a recognized/reputed University.\nMinimum 5 yrs. of experience as Civil QC Inspector with strong background in Jetty construction, precast yard, concrete, steel, cast in-situ, etc.).\nFluency in English and preferably Arabic\nComputer literacy, proficient in computer skills including use of MS OfficeWhat it is nice to have:Experience in EPC industry\nJetty construction experienceYou are someone who:Organized, committed and hard worker\nStrong interpersonal skills and a team player with high attention to details\nAn analytical thinker\nA results driven person combined with problem solving techniques\nReport writing and communication skills What is in it for you: Competitive salary and benefits are part of the offering, yet the real joy comes from being a member of smart and passionate teams, within an international leading EPC Group on a mission that matters. We create mega construction projects - literally around the globe - with meaningful impact on the local communities for the years to come. At Archirodon, you will find a proud, productive and human-centric culture, caring for and building on our people and their development!Please note that you will be contacted only in case you are shortlisted for an interview. In the meantime, do not hesitate to stay in touch and keep monitoring our open vacancies and our LinkedIn page!  Rest assured that your application will be treated with strict confidentiality and under all applicable data privacy regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Duba, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}