{
    "Job ID": "69865518",
    "Description": "About the role:In this role, you will be part of support team providing effective and efficient specialist IT service support to users of Qatar Airways Group. You will be the primary point of contact for portfolio users to troubleshoot technical issues and install OS & applications while responding within defined service level agreements. You will be responsible to act as a subject matter expert (SME) of business customers seeking help related to IT systems. Ensure, maintain, and patch end-user devices to eliminate security vulnerabilities. You have to ensure internal process are strictly followed. You should have hands on experience in troubleshooting laptops, desktops, printers & scanners with extensive efficiency in mail management and respond to user queries & notifications.Key responsibilitiesEnsure 24x7 smooth operations of IT, implement appropriate corrective and preventive actions to improve systems availability and stability.\nEnsure that all incidents reported to IT service desk are responded to efficiently and in a timely manner to reduce business impact.\nInstalling/Troubleshooting of Operating Systems, Anti-virus software, MS Office suites and all QR business applications.\nGood hands-on experience with Windows/Linux/Mac OS environments.\nGood understanding of Desktops, Laptops, Tablets Mobile devices and latest tech gadgets and features.\nResearch, diagnose, troubleshoot and identify solutions to resolve system issues quickly and efficiently.\nAdhere to standard process & procedures with timely escalation of unresolved issues to the appropriate internal teams or vendors.\nGood practice of time management, Prioritization of task and calls with multitasking.\nProvide accurate information on IT products and services with highest level of customer service.\nBe attentive and proactive to communicate about upcoming system maintenance/interruption/outage that they may run into and provide potential workaround solutions whenever possible.\nProvides detailed performance reports to an agreed schedule (or on request), including management summary & KPIs.\nConduct Root Cause Analysis of reported incidents in operational systems and ensure accurate changes to system configuration following the standard change management process.\nSupport the delivery of infrastructure projects.\nLiaise with suppliers and internal teams involved in both projects and operational maintenance of systems.\nMaintain high confidentiality and integrity in this role.\nYou will play a key role in development and support of IT processes and procedures in line with ITIL V3 and ISO 20000 standards.\nYou will be responsible in facilitating documentation of such processes and procedures for all internal teams of the department.About you:Bachelor's Degree in Computer Sciences or equivalent stream with minimum 5 years of relevant experience in technical support of desktops, laptops, printers and other end users’ devices.\nWorking experience with large enterprise of over 5,000 employees.\nPreferably ITIL V3 foundation or above certified.\nPreferably with Airport/Airline experience.How to applyPlease see below for all eligibility and requirements for internal applications.Please note that any applications not meeting criteria will not be processed.All internal candidates can only have three active applications at any point in time.\nAll internal candidates must have completed a minimum 10 months in their current role in order to apply for a new role\nAll internal candidates with an active final warning letter will be automatically disqualified from the recruitment process\nIf you are Cabin Crew or Deck Crew (Qatar Airways & Qatar Executive) candidate, you would require NOC to apply for this role.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}