{
    "Job ID": "69867615",
    "Description": "BackgroundDiversity, Equity and Inclusion are core principles at UNDP:  we value diversity as an expression of the multiplicity of nations and cultures where we operate, we foster inclusion as a way of ensuring all personnel are empowered to contribute to our mission, and we ensure equity and fairness in all our actions. Taking a ‘leave no one behind’ approach to our diversity efforts means increasing representation of underserved populations. People who identify as belonging to marginalized or excluded populations are strongly encouraged to apply. Learn more about working at UNDP including our values andinspiring stories.UNDP does not tolerate sexual exploitation and abuse, any kind of harassment, including sexual harassment, and discrimination. All selected candidates will, therefore, undergo rigorous reference and background checks.The ad hoc security management arrangement for cross-border missions into Northwest Syria has been created to facilitate the necessary humanitarian operations to sustain the displaced population in this inaccessible area.The ad hoc Designated Official (DO) for Cross Border missions into Northwest Syria ensures the safety and security of the United Nations personnel and facilities involved in Cross Border missions into Northwest Syria with accountability to the Secretary-General through the Under-Secretary-General for Safety and Security. The level of approval of cross-border missions will be based on the outcome of the Security Risk Management Process and acceptable risk model.Before 06 February 2023, UN Humanitarian Agencies based in Gaziantep, Turkiye, were limited to delivering Humanitarian assistance to NWS via trucks which crossed into Syria via the only authorized border crossing point (BCP) of Bab Al Hawa (BAH) between Hatay province of southern Turkiye and the governorate of Idlib, in NWS, as authorized by UNSCR 2762 of January 2023. The Actual delivery of humanitarian assistance to the beneficiaries was achieved through third-party (INGOs/NGOs) implementing partners.However, following the two earthquakes that impacted Syria on 6 February 2023, the Government of Syria agreed for the UN to cross to NWS to provide lifesaving assistance and respond to the growing humanitarian needs of communities affected by the earthquakes and allowed the use of two more BCPs at Bab Al SALAMEH and AL RA’EE at the border between Turkiye and Northern Aleppo. This led to regular UN cross-border missions aiming to scale up the humanitarian response. Between 14 February and 31 March, nine UN agencies, including IOM, OCHA, UNDSS, UNFPA, UNHCR, UNICEF, UNWOMEN, WFP, and WHO, carried out 46 missions to the 16 subdistricts most affected by the earthquake, making an average of one mission per day. For the UN cross-border humanitarian missions to be conducted safely and securely, minimizing the exposure to security risks by UNSMS personnel, UNDSS NWS swiftly conducted Ad Hoc SRMS for the various districts and locations in NWS which were to be visited by the UNSMS teams. UNDSS Damascus and UNDSS HQ supported the exercise. In addition to the SRM process, UNDSS NWS developed cross-border SOPs, CONOPS, and MSCRs for all border crossings. Reviewing and improving the contextual understanding of the security dynamics in NWS, and by extension, the whole of Syria and regional factors, is a continuous responsibility for UNDSS NWS team.Additionally, UNDSS NWS launched security assessments to inform the security management approach and ensure UNSMS staff safety and security while on field missions. Through these assessments, risk mapping was undertaken and is still in progress. Similarly, liaison with de facto authorities was made to establish communication and ensure coordinated security support when necessary. In addition, UNDSS supported cross-border operations through convoy leadership and coordination.The UNDSS Ad Hoc Security Advisor (SA) for NWS established, activated, and coordinated the Security cell with UNAFPs security officers and security focal points to collectively assess and evaluate the evolving security dynamics and advise the Ad Hoc DO/SMT and Agency heads on the SRM measures necessary for secure delivery of UN Humanitarian programmes in NWS.Between 14 February and 04 June 2023, UNSMS organizations successfully carried out 117 cross-border missions into NWS. The UNDSS NWS team has been actively involved in addition to undertaking approval procedures and carrying out pre-mission Security briefing for participants and ensuring compliance with recommended security measures.The security environment remains dynamic and volatile. The lull in the armed conflict following the earthquake was shortly followed by a resumption of hostilities between the various actors, especially between GoS and the HTS on the IDLEB frontlines.  Meanwhile, the government of Syria has extended the permission for UNSMS cross border missions until 10 August 2023, while renewal of UNSCR 2762 is awaited. UNDSS NWS has been facilitated with a newly approved LCSSB, allowing for increased staffing and capacity to effectively provide security support to the continued delivery of UN Humanitarian assistance in NWS.Position PurposeThe role of the National Security Officer delivers integrated, efficient, and coherent security support to the United Nations’ cross-border field operations, including through its leadership, to address safety and security needs, particularly in the case of crisis or emergency. Ensures effective security risk management for the assigned area of responsibility in northwest Syria by establishing a coordinated security threat and risk assessment mechanism within a standard system-wide methodology framework. Identifies and evaluates the security-related threats and risks faced by the United Nations civilian personnel when delivering their programmes as mandated by SC resolution 2672 authorized border crossing missions to northwest Syria. Ensures a coherent, effective, and timely response to all security-related threats and emergencies that may occur during cross-border missions. Supports the cooperation and collaboration among United Nations Security Management System entities like UNDSS Syria and UNDSS Turkey, including UNDSS Desk MENA, in planning and implementing measures to improve staff security, training, and awareness. Duties and ResponsibilitiesProgrammingProvide security policy guidance and security management support to the Country Director (CD)/Deputy Resident Representative (DRR) and CO management team to enable effective programme planning, implementation and delivery within the framework of all UN security policies and procedures.\nEnsure the mainstreaming of security into all levels of programme design, implementation, and delivery through the substantive monitoring of ongoing and future projects and programmes providing innovative and proactive support, direction and solutions where required, with the guidance of the DRSA. Serves as permanent member of project appraisal committee (PAC).\nReview the potential impact of current as well as future potential security factors and trends on UNDP planning, programme design and delivery, as well as the possible impact that programme design might have on the stability and security, ensuring that possible support needs are identified, and improvements are implemented.\nLiaise and coordinate activities of partner organizations and counterparts in the planning, preparation and execution of missions, ensuring the safety and security of UNDP staff as the highest priority.\nTo protect and minimize the risk to UNDP staff, project personnel, property and    operations in all locations and at the same time enabling UNDP programme delivery throughout.\nMaintain a security network of international and national personnel. \nParticipate as a member of the security cell established by DSS in country.Threat and Risk AssessmentConduct a threat and risk assessment of operations in the districts and regions where UNDP projects are implemented, identify and implement appropriate risk mitigation measures. \nAssist/provide inputs to UNDSS in preparing a comprehensive threat and risk assessment of the country to include all locations where UNDP staffs, dependants and equipment are present. \nAssist/provide inputs to the Security Management Team through the UNDP Country Director (CD) or Deputy Resident Representative (DRR).\nAssist local UNDP travel managers with risk assessments related to air travel.Security Plans and Business continuityEnsure that UNDP procedures conform to the UN Security Framework. \nProvide inputs and assist UNDSS to establish, maintain and update the country specific security plan and contingency plans in accordance with the UN Field Security Handbook (FSH).  \nEnsure that all UNDP personnel are included in the Security Plan of the respective duty stations, (including all UNDP offices housing staff covered under the security umbrella) to be prepared by UNDSS. \nUpdate the UNDP component within the country-specific security plan and contingency plans in accordance with UNDSS. \nTrain UNDP wardens and follow up according to their specific needs for both international and national staff. \nProvide security related contributions to the CO Business Continuity Plan, with guidance from the DRSA. \nFacilitate security clearances for all UNDP staff covered under the security umbrella when travelling in areas where required.Minimum Operating Security StandardsOversight of UNDP personnel and equipment for MOSS compliance. \nEnsure that Country Office management is briefed sufficiently on security requirements in order to take decisions and provide adequate resources so that staff members are provided with; and proficient in the use of, safety and security equipment, including communications equipment, vehicle emergency equipment and personal security safeguards required for work in the field. \nEstablish internal communication systems so that UNDP communications are integrated into the appropriate UN Security Emergency Communications System. \nProvide advice on selection and procurement of appropriate equipment for security (vehicles, telecommunications equipment, etc.). \nProvide advice on the security of transportation and logistics.\nProvide orientation and training to international and national staff members on security guidelines, communication procedures, travel precautions, emergency procedures and existing restrictions in movement, such as curfews, restricted and dangerous areas. \nCoordinate with DSS 24-hour response to all security related incidents involving UNDP staff and eligible dependents. \nIn coordination with UNDSS, and on behalf of the CD, ensure appropriate professional liaison with local authorities responsible for security, law and order, counterparts in diplomatic missions and municipal/civic/religious and traditional leaders.Information ManagementProvide timely and accurate security advice to the Security Management Team, programme managers, project managers and visiting consultants.\nImmediately report all security -related incidents involving UN staff and eligible dependents to the Security Advisor, Ad Hoc DO, SMT and Heads of UN Agencies operating in NWS.\nEnsure that UNDP programme staff members are provided with situation reports and other appropriate security-related information generated by UNDSS in a timely and efficient manner. \nIn cooperation with the HR unit, maintain updated UNDP staff lists, including details of visiting missions and consultants. \nIn coordination with UNDSS in country, establish good relationships with national law enforcement, military and civil intelligence authorities, counterparts in the Diplomatic Missions and municipal/civic/traditional leaders. \nEncourage an exchange of information relative to risk management for UNDP programme implementation. \nIn coordination with UNDSS in country, conduct investigations of death of a staff/family member under suspicious and unclear circumstances. \nParticipate in inter-agency security coordination efforts\nThe incumbent performs other duties within the functional profile as deemed necessary for the efficient functioning of the Office and the OrganizationThe incumbent performs other duties within their functional profile as deemed necessary for the efficient functioning of the Office and the Organization.Supervisory/Managerial Responsibilities: The National Security Officer supervises the relevant staff in the Security Unit.CompetenciesCore CompetenciesAchieve Results:  LEVEL 2: Scale up solutions and simplifies processes, balances speed and accuracy in doing work\nThink Innovatively:  LEVEL 2: Offer new ideas/open to new approaches, demonstrate systemic/integrated thinking\nLearn Continuously:  LEVEL 2: Go outside comfort zone, learn from others and support their learning\nAdapt with Agility:  LEVEL 2: Adapt processes/approaches to new situations, involve others in change process\nAct with Determination:  LEVEL 2: Able to persevere and deal with multiple sources of pressure simultaneously\nEngage and Partner:  LEVEL 2: Is facilitator/integrator, bring people together, build/maintain coalitions/partnerships\nEnable Diversity and Inclusion:  LEVEL 2: Facilitate conversations to bridge differences, considers in decision making People ManagementUNDP People Management Competencies can be found in the dedicated site.Cross-Functional & Technical competencies Business Management - Portfolio Management\nAbility to select, prioritise and control the organization’s programmes and projects, in line with its strategic objectives and capacity; ability to balance the implementation of change initiatives and the maintenance of business-as-usual, while optimising return on investment\nBusiness Direction & Strategy - System Thinking\nAbility to use objective problem analysis and judgement to understand how interrelated elements coexist within an overall process or system, and to consider how altering one element can impact on other parts of the system\nBusiness Management - Communication\nAbility to communicate in a clear, concise and unambiguous manner both through written and verbal communication; to tailor messages and choose communication methods depending on the audience. \nAbility to manage communications internally and externally, through media, social media and other appropriate channels\nAbility to manage communications internally and externally, through media, social media and other appropriate channels\nSecurity Services - Security advice, planning and coordination \nAbility to provide with authoritative advice and guidance on security management, plan and coordinate security activities. \nSecurity Services - Security risk management \nAbility to assess threats and risks, identify and oversee implementation of mitigation measures, including ability to design and test security plans. \nSecurity Services - Security policy awareness & implementation \nKnowledge of security policy concepts and ability to apply to strategic and/or practical situations. \nSecurity Services - Security information management \nAnalytical capabilities to process diverse security information and develop recommendations. Required Skills and ExperienceEducationAn advanced university degree (master’s degree or equivalent) preferably in social sciences, management, or a related security field is required, or\nA first-level university degree (bachelor’s degree) preferably in social sciences, management, or a related security field in combination with two years of qualifying work experience will be given due consideration in lieu of the advanced university degree, or\nA formal multi-year education in Security Management, such as military or police Command and Staff College (minimum 9 months full time) with senior level command experience. \nFormal training in security risk management an asset.ExperienceMinimum 2 years (with Master’s degree) or 4 years (with Bachelor’s degree or formal multi-year security management education) of relevant experience in security and development \nPrevious experience of working in a conflict/post-conflict or crisis environment is an asset.\nIn-depth knowledge of security management and risk management.  \nKnowledge of UNSMS security operations and programming cycle.  \nKnowledge of UNDSS Country structure; roles and responsibilities of the, DO, SMT, UNDSS and UN Security management System.Language:Fluency in written and spoken English is required. A working knowledge of the language (Arabic) spoken in the duty station is highly desirable but is not a requirement. Important:DisclaimerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gaziantep, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}