{
    "Job ID": "69865984",
    "Description": "This role will be responsible for running the governance process to review, validate, and refine the attributes that define our customers. The skilled and detail oriented individual will evaluate targeting across all channels including new experiences to ensure seamless integration with existing systems. They will collaborate with cross-functional teams including execution, product, and reporting to align strategies and optimize processes. They will identify and lead opportunities to improve process, develop efficiencies, and deliver results, while ensuring regulatory compliance.Job Responsibilities:6+ years of campaign execution, strategic marketing, or business administration\nExperience or understand campaign execution management tools that is used in delivering through various channels\nProven understanding of campaign audience targeting, various suppressions \nComfort building and managing relationships with both analytics and business stakeholders\nProven track record of problem-solving using data and building new analytics capabilities\nProven track record of gathering requirements and create business requirement document to implement various process efficiencies \nSuperior written, oral communication and presentation skills with experience communicating concisely and effectively with all levels of management and partners\nBachelor’s degree is requiredRequired Qualifications, Skills and CapabilitiesPartner with multiple stakeholders to implement various projects for campaign process efficiencies\nUnderstand an create business requirements for new and enhancements for various campaign optimization tools\nWork with various analytic teams to understand the suppressions in acquisitions and portfolio campaigns\nReview various suppression rules, track and monitor the trends of suppressions across campaigns\nBe results-oriented with strong attention to detail and problem-solving skills \nPossess strong communication, interpersonal skills, and leadership potential\nDemonstrate they are customer-obsessed by understanding the customer experience\nHave a proven ability to operate in a process-oriented environment, adhere to risk/control, procedure and process expectations, while appropriately delivering what’s best for the customer.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}