{
    "Job ID": "69867120",
    "Description": "About Rentokil Initial HygieneRentokil Initial Hygiene India, operating in more than 75 countries is the trusted hygiene solutionprovider globally. Together with 100 years of experience with tailored solutions to meet customisedbusiness needs, assuring 100% peace of mind with Rentokil Initial services. Rentokil Initial offersthe widest range of washroom hygiene services including the provision and maintenance ofproducts such as air fresheners, sanitisers, feminine hygiene units, hand dryers, soap dispensers,floor protection mats.For more details: https://www.initial.com/in/About the Role:● The incumbent will be responsible for actively seeking out and engaging customerprospects. Providing complete and appropriate solutions for every customer in order toboost top-line revenue growth, customer acquisition levels and profitability.Job Responsibilities:● To present, promote and sell products/services to existing and prospective clients● Perform cost-benefit and needs analysis of existing/potential clients to meet their needs● Maintain positive business relationships● Reach out to customer leads through cold calling● Develop new business opportunities within current and new customer bases in accordancewith the sales strategy.● Expedite the resolution of customer problems and complaints to maximize satisfaction● Achieve agreed upon sales targets and outcomes within schedule● Collaboration with the internal team and external stakeholders.● Analyze the territory/market’s potential, track sales reports● Assist in debt collectionKey Result Areas:● Sales/ Business Development● Customer Service● Maintaining MIS/ReportsCompetencies (Skills essential to the role):● Good Interpersonal & Networking Skills● Ability to communicate effectively● Ability to negotiate with the clients● Ability to achieve targets● Computer SkillsWhat can you expect from Rentokil Initial Hygiene ?➔ Our values lie at the core of our mission and vision. We believe that it’s our people whomake our company what it is. We believe in:● Safety● Integrity● Innovation● Learning & Development● Open & Transparent● Performance OrientationDEI statement: At Rentokil Initial Hygiene, we believe in commitment to build an inclusive, variedworkplace welcoming to people of all backgrounds.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}