{"Job ID": "69867041", "Description": "Fulfillment By Amazon (FBA) is built around Amazon’s world class capability in ordering, fulfillment, transportation and customer service. By leveraging our current scale and supply chain, FBA can provide a low-cost alternative for fulfillment and enable third party Sellers to rapidly grow their business. As mentioned by Jeff Bezos in his annual letter to shareholders, FBA is one of the strategic long-term opportunities for the company to improve the lives of Sellers and buyers while leveraging our billion-dollar logistics infrastructure to generate increasing free cash flow and triple digit return on invested capital. The FBA Support Operations team reviews Sellers’ financial and inventory related questions, and ensures they are addressed in accordance with policy. We believe consistency is the foundation to the world class service we provide our Sellers, and Support Operations is at the center of ensuring consistent and fair evaluation of Seller reimbursement requests.\nFBA Support Operations team is seeking highly motivated Supervisors to lead teams of up to 20 front-line associates. An FBA Support Operations Supervisor holds a front-line management position responsible for managing a team of Machine Learning Data associates. The role is a mix of people and process management and a successful candidate is one who can respond to day to day people issues, while maintaining a focus on the bigger picture.\nKey job responsibilities\n• Set the vision, direction, and culture of the team by managing individual and team performance expectations and goals.\n• Provide individual coaching feedback sessions, and frequent one-on-ones that focus on performance, attendance adherence and career development.\n• Serve as a leader and point of contact for escalated contact resolution of a supervisory or sensitive nature.\n• Partner and communicate with stakeholders to ensure consistent employee experience.\n• Lead team meetings focused on team performance, policy and site updates, and team-building activities.\n• Create and update weekly and monthly productivity reports displaying team performance against expectations. Speak to team on performance and ongoing coaching methods in weekly performance review meetings.\n• Initiate and drive process improvements.\nAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female/ Disability/Veteran/Gender Identity/Sexual Orientation.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND | Blr, KA, IND\n• Should be currently in people management role with a minimum of one year of direct people management experience.\n• Any graduate and above (or) an equivalent degree with people managerial experience.\n• Demonstrated team-building skills within own team or across other teams.\n• Demonstrated ability to develop, direct, and manage a group of individuals including managing career growth.\n• Demonstrated skill in developing and implementing new strategies and procedures.\n• Demonstrated ability to devise and communicate administrative and procedural decisions.\n• Well versed in employee development and performance management skills and strategies including performance reviews, goal setting, and providing feedback.\n• Proven ability to report and analyze data.\n• Demonstrated ability to initiate and drive process improvements.\nPeople Management Skills:\n• Demonstrated ability to develop, direct, and manage a team.\n• Skilled in developing and implementing new processes and procedures.\n• Ability to organize, prioritize and schedule work assignments.\n• Ability to develop, plan, and implement short and long-range goals (both for individuals and for the team).\n• Demonstrated passion for delivering a positive Customer experience.\n• Ability to perform ambiguous tasks without guidance and support.\n• Ability to foster a cooperative environment and work in a collegial fashion with peers in other organizational units.\n• Can adapt well to changing circumstances, direction, and strategy.\n• Ability to manage team performance through training, coaching, and process improvement.\nCommunication Skills:\n• Strong interpersonal and communication skills and the ability to communicate effectively with a wide range of constituencies in a diverse community.\n• Demonstrated team building skills: within own team/across other teams.\n• Ability to provide objective performance feedback.\n• Ability to maintain composure in critical situations and communicate clearly with both internal and external Customers.\n• Excellent documentation skills.\nContinuous Improvement:\n• Strong history of proposing ideas for new metrics and tools.\n• Ability to own data collection and reporting for deep dives and escalations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}