{
    "Job ID": "69866759",
    "Description": "IntroductionDemonstrate cross team cooperation .Good interpersonal and communication skills, quick learner proactive with ability to solve changeling problem and debug skills.\n\nYour Role and Responsibilities\nManual Testing :\nCreate comprehensive test plans, test cases, and test scripts based on project requirements and design specifications. Execute manual test cases to identify defects, inconsistencies, and issues in software functionality. Report and track defects and work closely with development teams to resolve issues. Perform regression testing to ensure that software updates do not introduce new bugs.\nGood understanding of the SDLC & experience of working with Agile modelAutomation Testing:\nDevelop, implement, and maintain automated test scripts and frameworks using industry-standard tools and programming languages (e.g., Selenium, Appium, Java, Python). Identify areas for test automation and collaborate with the development team to implement automation testing strategies. Execute and maintain automated test suites to improve test coverage and efficiency. Analyze test results and report on the status of automated tests.\n\nRequired Technical and Professional Expertise2+ years of experience Java and Javascript is crucial to identify, understand how the code behaves but also being able to develop and maintain test automation.\nExperience with Manula testing\nExperience and expertise on Test Automation\nlike Selenium, Jenkins , Test Ng and knowledge on CI/CDPreferred Technical and Professional Expertise\nGood working knowledge on the following areas will be added advantage:API Testing, Performance testing\nUnix Platform, GIT, AppServer WAS/Weblogic, Database DB2/SQL/OracleJJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}