{
    "Job ID": "69866955",
    "Description": "We are Sinch. Even if you don’t know us by name or recognize our logo yet, chances are you have used our products in one way or other. We are leading global communication Platform (cPaas) provider – the connector between the two through our messaging, voice and video solutions. By year end Sinch will be more than 5000 employees in more than 50 countries with one of our engineering hub at Noida location.Our APIs and platform deal with over 150 billion engagements annually. Sinch, 2nd largest cPaaS and messaging provider in the world is looking for a Finance & Accounts talent at its Noida (India) location.If you are interested in taking on new challenges, and passionate about finance and accounting this is the role for you.Key Role & Responsibilities:Tax WorkReview Monthly, Qtrly and annual Income tax & GST filings.\nReview and assist in Reply preparation for assessment proceedings.\nReview and manage the transfer pricing policy locally and with global team.\nCoordinate with Department and arrange the refunds & nullify the demands.\nReview and finalize the annual Tax audit.\nCoordinate with consultants on different requirements.AccountsTrail balance finalization on different intervals,\nReview of accounting operations and assist the accounting team for any query.\nMeeting with other departments / global office and represent the accounts for any query resolution.\nReview and finalize FAR, COGS MIS, Prepaid working, Service YTD, Opex YTD on monthly basis. (MIS monthly activities).\nReview the provisions on monthly basis and suggest the additional provisions based on the requirement and in linked with budget.AuditLead the Statutory and Group Audit.\nPrepare Standalone/ Consolidated financial statement on different intervals including Notes to accounts.\nMake the necessary audit adjustments and finalize the financial statement.\nLiasioning with other departments and resolve the audit queries.\nAssist the secretarial in MCA Financial filings.\nPrepare the financial results analysis for management.Other TasksAssist on preparation and review the Sales and Collection Incentive.\nDesign and review the Finance SOPs.\nReview other reports like AR, Provision for doubtful debts for clean and clear reporting.\nOther adhoc management and global requirements.Qualifying Criteria:Having exp in over-all accounting of 8-10 years (MNC/Listed corporates preferred)\nPreferred Qualification – MBA / CA Semi Qualified\nLeadership skills to take self-initiative for corrective actions\nHaving exp in telecom/messaging/tech industry will add benefit, but not necessary\nHighly confident to handle situations independently and directly interact with key management personnel.\nShould have excellent communication skills to communicate with global management.\nExperience of working in global organizations with exposure to global assignments preferred.\nTreasury Management – Banking operations/Knowledge of foreign payout mechanisms.\nReview of Global Subsidiary finance and accounts\nKnowledge of IFRS\nExcellent in Excel and PowerPointGrowth at Sinch is a second nature. The once-small Swedish start-up has developed into a global leader in customer engagement. And as Sinch grows, so do our people.\n\nWe encourage our employees to dream big and challenge themselves. And when it comes to career ambitions and opportunities, the sky is the limit for those who are ready to go above and beyond to make big things happen. It's all about hard work and big ambitions - no shortcuts! And that's how we learn and grow together every single day. 🚀\n\nAre you up for the biggest, most rewarding challenge of your career? Apply and join the journey!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}