{
    "Job ID": "69868571",
    "Description": "Missions :Responsable du rendu technique (code) et des choix d’architecture et garant de la qualité \nResponsable du coaching de l’équipe développement justifié par ses années d’expériences, les réalisations produites en tant que Dev, dev senior et manager d'équipe technique.\nÉvaluation, identification et développement de solutions logicielles\nPilotage technique de projets de développement logiciel\nAudit et analyse de l’architecture existante et anticipation des risques ;\nConception de l’architecture logicielle au niveau fonctionnelle et technique en fonction des différents besoins exprimés ;\nContrôle de la cohérence entre la mise en œuvre effective et le modèle d’architecture préconisé.\nRôle de conseiller sur les bonnes pratiques et le respect des méthodologies.\nAccompagnement de la MOA et de la MOE dans les décisions technologiques ;\nVeille technologique pour s’inscrire dans une logique d’amélioration continue\nFormation des membres de l'équipe de développement et supervision de leurs activités\nRecherche des problèmes dans les systèmes logiciels et leurs résolutionsProfil recherché :Niveau de formation : De formation supérieure Bac +4/5 (type Ecole d'ingénieur, universitaire).\nNiveau d’expérience professionnelle: minimum 9 ans en tant architecte logiciel.Compétences Techniques:Expertise très forte en architecture technique et en développement justifiée par ses années d’expérience et les projets mis en place.\nExpertise en différents types de bases de données et en particulier les BDD relationnelles, MYSQL (MySQL Workbench), PostgreSQL (pgAdmin) et NoSQL.\nExpertise en Backend: Java 11+, Spring Boot (starters: web, data-jpa, test, security), maven, lntelliJ/Eclipse, Frontend: Angular 4+, React 16+, Typescript, Javascript ES6 2015+, VSCode/Webstorm, HtmI5, CSS3, Transverse: Git, Git workflow, Gitlab (developer side: merge request, pipeline, code review, branches), Sonar, SonarQube.\nConnaissances en Devops : Gitlab, Rancher et Docker, Jenkins.\nExpériences justifiée en : Clean Code, TDD, SOLID Principles, Design Pattern.\nExpérience justifiés sur des projets réalisés en mode agile en tant que tech lead confirmé (Pratique agile, Code Review, estimation, raffinement technique, Définition de stratégie technique, partage des bonnes pratiques...).Capacité d’encadrer une équipe de développeurs et les faire monter en compétences techniquement, concrétisée par des expériences professionnelles--Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}