{"Job ID": "69867113", "Description": "Assumes responsibilities and supports Hospital-wide provision of quality, as directed. Coordinates all qualityrelated activities assigned section.1. Facilitates the implementation of the specific plan for the assigned section inclusive of annual goals and objectives and reporting mechanisms. 2. Liaises with departments Hospital-wide regarding the assigned section’s activities. 3. Facilitates and supports quality improvement projects requiring interdisciplinary or departmental participation. 4. Coordinates the investigation and conduction of root cause analysis of actual and potential serious/sentinel events in the organization.  5. Perform clinical responsibilities within related specialty such as (Nursing, Laboratory, Respiratory, Pharmacy, etc.) as assigned.  6. Facilitates conducting risk assessment activities for clinical and non-clinical areas as per the risk management plan. Collaborates with Hospital departments and services to identify areas for improvement to implement quality improvement initiatives. 7. Participates in the development and revision of the department’s policies and procedures and the curriculum for staff education and training in alignment with the section plan. 8. Conducts educational sessions relating to assigned section and quality, safety and customer services related education as assigned. 9. Prepares and presents reports on issues impacting Hospital-wide delivery of quality services related to the assigned section. 10. Assumes consultant role on subjects related to quality, patient safety, performance improvement, risk management and National/international standards. 11. Provides assistance to Quality Analysts, as assigned, to support implementation of the section plan.Master’s or Bachelor’s Degree in Nursing, Quality or other healthcare related discipline is required. Four (4) years of related experience with Master’s, or six (6) years with Bachelor’s Degree is required.-Certified Professional in any of the following Certifications is required: Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Medina, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}