{"Job ID": "69866401", "Description": "ABOUT UNILEVER:Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, and that improve the lives of our consumers and the communities around us. We promote innovation, big and small, to make our business win and grow, and we believe in business as a force for good. Unleash your curiosity, challenge ideas, and disrupt processes; use your energy to make this happen. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best. Every day, nine out of ten Indian households use our products to feel good, look good, and get more out of life–giving us a unique opportunity to build a brighter future.Every individual here can bring their purpose to life through their work. Join us and you’ll be surrounded by inspiring leaders and supportive peers. Among them, you’ll channel your purpose, bring fresh ideas to the table, and simply be you. As you work to make a real impact on the business and the world, we’ll work to help you become a better you. ABOUT THE ROLE:PC Analytics Assistant Manager would have an exciting role to enable growth of the personal care business by bringing insights through analytics, market insights and PDC. It is a future fit role as it enables the candidate to build skills that would be required in the future.The candidate will be part of the Global personal care PDC and analytics team focusing on all PC categories and will be responsible for analyzing a wide range of data to help inform marketing, brand and business strategies. They will ensure that internal briefs are translated into analytical projects and will be responsible for ensuring the analysis is relevant for their specific category or market. They will be comfortable using a wide range of analytical tools to help with their analysis and be familiar with both digital data such as social and search right through to traditional business data such as penetration and brand equity. The individual will be responsible for providing quantitative and qualitative analysis and insight on PDC projects, whilst working alongside specialist external analysts where required. As such they need to be comfortable working on their own analytics projects and be able to work with specialist experts on larger, more complex briefs.RESPONSIBILITIES:Primary ResponsibilitiesWork closely with the PDC / MI Manager to translate internal briefs into analytical projects (to include refining the initial brief and asking the ‘right questions’, working through potential hypotheses and storyboarding the output)\nConduct analysis using in-house analytics tools, and be comfortable analyzing a range of social and business data\nBuilding and testing basic queries on in-house social and search data tools\nBuilding and maintaining dashboards for internal customers using internal visualization tools\nProvide qualitative and quantitative analysis and insight to inform business strategy, marketing and brand strategies, digital marketing content and strategy, communications, and new product development\nSynthesizing data and analysis into impactful, action-orientated reports for internal stakeholders\nAble to communicate the key findings and insight to senior stakeholders and peers both conversationally and in formal presentation style\nMonitor progress of deliverables and actively work with delivery analysts in other parts of the business or agencies who will not be co-located on complex briefs\nMaintain knowledge of previous analysis to avoid duplication and to share learnings from relevant past projects\nArrange a follow-up meeting with customers after they have received their analysis to ensure that it has been helpful and document any scope for improvements to the serviceSecondary ResponsibilitiesMaintain a catalogue of previous requests/projects and own the central database of case studies / outputs\nProactively flags any workloads issues or problems to the PDC Insight Manager and identifies opportunities for new services based on demand\nUpdates workflow trackers\nUploads briefs & deliverables to PeopleWorldKEY REQUIREMENTS:Primary Traits (required)Experience in an analytical role and providing insight and recommendation based on analysis\nSome experience of using analytical tools\nSome data modelling or query building experience\nExperience of “storytelling” in a corporate context, and crafting clear, compelling messaging\nMinimum 3 years of experience in Data Analytics or in an equivalent role\nBachelor's degree in relevant field (mandatory), Master's degree (preferred)Secondary Traits (‘nice to have’)Experience of understanding business questions and writing appropriate briefs\nExperience of social analytics or NLP tools\nExperience briefing technical teams and being able to translate business objectives into analytical hypotheses\nPassion for the digital world and its implications for businessINTERFACES:The role will have global scope and deal with Personal CareThe job holder will not have any people management responsibilities but will commission work to agencies when required\nThe job holder will have to work with other Insights Analysts to share learnings and ensure that an equal quality of output is being achieved\nThe job holder will have to ensure that briefs are completed by the analytical pool to the required standard and in a way that answers the original request has context menuJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}