{
    "Job ID": "69866459",
    "Description": "Responsibilities:To follow proper uniform procedures.\nTo run the day-to-day operations of the assigned kitchen section together with the CDP\nEnsure that mise-en-place is prepared freshly every day for the a la carte service\nPrepare in advance food, beverages, materials, and equipment needed for the service. Cook and serve dishes according to the restaurant’s menu\nProvide direction to the Kitchen helpers, including Commis, Cooks, Kitchen Attendants, and Stewards\nTo ensure that sanitation standards are followed as set by Emirates Palace Abu Dhabi and local authorities\nTo assist in proper maintenance and cleanliness of all food preparation equipment.\nTo ensure a safe working environment for all kitchen staff\nTo follow control systems that will ensure quality and portion consistency\nTo store items properly at the end of the shift using the FIFO system.\nTo ensure a clean, neat, and organized working area\nTo ensure food wastage control is being followed.\nTo handle and report any accident to your immediate supervisor\nRespond properly in any hotel emergency or safety situation.\nTo perform other tasks or projects as assigned by hotel management and supervisorSkills & requirementsExtensive experience in the kitchen field in the hotel industry.\nPostgraduate and/or Hotel Management School / Apprenticeship. Master's Degree preferred but not required.\nMust have basic knowledge of cooking and presentation of food for all departments in this kitchen, must have full knowledge of sanitation requirements in handling foods.\nEnsure that kitchen operating equipment is maintained to good standards.\nRequired to have good English when it comes to understanding, speaking, and writing.\nMust be able to exert physical effort in transporting pounds, endure various physical movements throughout the work areas, reach up and down, remain stationary at times throughout work periods, and satisfactorily communicate with guests and colleagues to their understanding.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}