{
    "Job ID": "69866977",
    "Description": "For over 15 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,900 companies and have detected 100 Million threats/day. We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.We are looking for a seasoned DevSecOPS leader who is an engineer at heart. One who is passionate about Secured SDLC, about automation, about shifting-left, about using Gen AI to power product teams, about incorporating application security testing into the CI / CD pipelines, about creating a world class DevSecOPS infrastructure and processes for all of the Zscaler’s product teams and last but not the least, about bringing the best out of each of the team members. This role will report to the Sr. Director of Engineering. Position OverviewAs the Engineering Manager for DevSecOps & Platform Engineering at Zscaler, you will play a crucial role in overseeing a team of highly skilled DevSecOps engineers, DevOps engineers, and developers focused on tool development, including AI/ML-based software solutions. This role requires a blend of hands-on technical expertise, leadership capabilities, and a deep understanding and experience of secured SDLC, application development, test automations, CI/CD pipelines, security scanning, and cloud infrastructure. You will collaborate closely with cross-functional teams to ensure the seamless delivery of secure, scalable, and efficient software products.Responsibilities/What You’ll DoAs a leader of the DevSecOps team, you will be responsible for all the operations that caters to multiple development teams. You will be taking hands-on responsibilities at the same time guiding a small team of engineers, distributing tasks, tracking progress, facilitating them to make them successful in their functions.\nLead the implementation of Scaled Agile Framework (SAFe) across all teams: Apply your knowledge of SAFe practices to streamline development processes, promote agility, and enhance product delivery.\nOwn the end to end process for Open Source License Governance and Vulnerability assessment in software applications developed by several other teams, using tools like Blackduck or Snyk integrated in the CI pipelines.\nDev Infra Management: Responsible for administration & maintenance of source control management systems, such as Bit Bucket, Subversion, GitHub, SubGit, & Nexus, CI/CD systems, Artefact management repositories, test beds etc.\nDesign branching strategies, branch access permissions, merge checks, quality gates vi CI build plan integration on pull requests, to allow several teams to work in parallel on multiple product lines.\nWork with several different teams and develop and manage the Continuous Integration pipelines for applications developed by them in languages like C, C++, Java and Javascript.\nResponsible for integrating SAST, DAST or IAST tools into the CI / CD pipelines\nDefining and tracking KPIs related to CI/CD for the development teams\nCreating deployment pipelines to public cloud infrastructure with adequate gates built in (automated or manually triggered)\nResponsible for managing the required infrastructure for DevSecOps\nResponsible for administration and maintenance of Atlassian stack of tools such as JIRA, Bamboo, BitBucket and ConfluenceMin 10 years of hands-on experience in app development, build & release management, setting up CI/CD pipelines, managing various tools required in the software lifecycle, Scripting in shell, Python, Groovy or Java and Unix / Linux System administration.\nAt least 3-4 yrs of team lead experience\nGood communicator and motivator\nExpertise in using build tools like Maven, Gradle, NPM, Ant, Make for the building of deployable artifacts.\nExpertise in using tools like Jenkins or Bamboo. Hands-on experience in installing and administering CI tools like Bamboo, Hudson/Jenkins, Sonarqube, Subversion, Nexus or JFrog artifactory.\nExperience with static analysis tools like Synopsys Coverity, Fortify, Veracode etc.\nExperience with Code coverage tools like SonarQube, Jacoco, GCov or Bullseye.\nExperienced in using Docker components like Docker Engine, Hub, Swarm, Docker Registry, handling Docker images primarily for middleware installations and domain configurations. Knowledge of Kubernetes.Deep knowledge of automation technologies such as Ansible, Puppet or ChefGood experience in converting build.xml into pom.xml in order to build the applications using Maven.Excellent leadership skills with a track record of managing high-performing teams.\nAbility to work collaboratively with cross-functional teams.Sound Knowledge of Python, JAVA, PHP, SQL and Postgresql or Mysql.\nWorking experience with reporting services like JIRA installation and administration\nGood understanding of the principles and best practices of Software Configuration Management (SCM) in Agile, scrum, and Waterfall methodologies.\nKnowledge of AWS tools (EC2, S3, RDS etc.)\nStrong presentation and communication skillsSelf-motivated, takes ownership and accountability and an empathetic leader who nurtures a team to bring the best out of them.\nBachelor's Degree in Engineering, CS, MIS, or related field#LI-VN1 Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}