{"Job ID": "69866528", "Description": "Join us in creating the technology that helps the world act togetherWe are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world.Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work.The team you'll be part ofNI Customer Delivery IndiaAs BG Delivery Manager, you will be in charge of the delivery process within NI RDC for all aspects related to contracts execution (including HW, SW and Services) on assigned scope with large business volume, high complexity and/or geographical distribution.He will take the ownership for Delivery execution, put in place the right strategy and governance to insure customer intimacy & Quality of DeliverablesActs as a business enabler during project execution and as the single Nokia interface for the customer and all project stakeholders for the contract.Main Responsibilities are:-Owns within NI the delivery process for all aspects related to contract execution (including HW, SW and Services) on assigned scope with large business volume and/ or high complexity and/ or geographical distribution.\nIs accountable for revenue and profit in line with Nokia Mode of Operations (MoO).\nOrganizes and leads the customer contract execution organization for the geography\nManage a matrixed team of project managers and delivery staff\nIs responsible for project execution performance with respect to financial and operational KPIs such as cost, timelines, revenue, project assets, and customer satisfaction.\nOwns and manages customer relationship for assigned scope in services, delivery and performance areas.\nIs the primary contact within Nokia for planning and execution, resource allocation, prioritization and escalation topics for all phases of Execute process.\nIs responsible for end-to-end planning, and communication of financial and operational performance.\nEnsures contract execution is based on Nokia Project Management methodology and applicable BG guidelines and processes.\nApproves project handover from Cx team (G6) and is stakeholder for information on preceding sales process gates (G3, G4, G5).\nDrives for continuous efficiency improvement in terms of cost adherence and cash to optimise projects' operational performance.\nAnticipates risks and evaluates related financial and customer satisfaction impacts.\nEnsures efficient claim management.\nEnsures services execution comply with quality and health / safety requirements.\nSeeks to define new opportunities to expand and renew contracts with the customer.\nContributes to additional services business/ solution creation. For cross BG customer topics.\nDrive Customer Satisfaction through the established survey mechanisms and by providing services that are fully compliant with the SLA/KPI\nEnsures contract execution performance (KPIs, cost, timelines, revenue recognition, project assets)\nProject Asset Rotation Days (PARD) reductionKnowledges and Experiences:In-depth knowledge about NI organization, product, services and solutions\nManagement experience across several functional areas or businesses.Proven Knowledge and strong understanding of Project Management Tools and Methodology\nExcellent communication skills, both oral and written\nAbility to effectively influence internal and external stakeholders.Ability to communicate with customers' exec level (CxOs)\nMastery of a specific professional discipline combining deep knowledge of theory and practice or expertise across several different disciplines within a function.\nCommand of content of sub function, mentoring and coaching knowledge  \nPossess executive presence and strong interpersonal skills to establish key relationships with all decision makers.\nDeal with ambiguous situations and work effectively with cross functional teams\nMust have strong understanding or be able to learn quickly the business and technical aspects associated with Customer Care.\nIndividual Contributor: Typically, highest level of individual contributor in job family. Demonstrates strategic thinking, assumes broad perspective.\nManages implementation/ utilization through other organization resources.\nAt least 20 years of work experience with 5-6 years of NI project delivery is desiredNokia is committed to inclusion and is an equal opportunity employerNokia has received the following recognitions for its commitment to inclusion & equality:One of the World’s Most Ethical Companies by Ethisphere\nGender-Equality Index by Bloomberg\nWorkplace Pride Global BenchmarkAt Nokia, we act inclusively and respect the uniqueness of people.Nokia’s employment decisions are made regarJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}