{
    "Job ID": "69866811",
    "Description": "Amazon is looking for an energetic and enthusiastic candidate to join the fast-paced world of Payroll operations. We are not an average retailer and this is definitely not your average payroll position reporting in through Amazon Finance Operations. We’ll give you the opportunity to really make a difference to our business. We’re looking for exceptional people with outstanding auditing skills, problem solving skills, payroll process combined with payroll system knowledge, and customer service passion.\n\nAmazon seeks a Payroll Analyst with at least two years US Payroll and Tax experience in a large customer-oriented corporate environment. Payroll is processed on a weekly, bi-weekly and monthly basis in multiple states, and this person will perform a variety of technical tasks relative to assigned areas of responsibility including performing tax related adjustments/set ups for employee and employer. Responsibilities also include:\n• Update tax panel changes for employees as per Form W-4.\n• Perform audits to check taxes are deducted as appropriate.\n• Set up new sites for amazon locations and tax panel set up as per legal requirement.\n• Process current year adjustment as per employee request and audit findings.\n• Answer questions related W2 and issue W2 Correction, if required.\n• Process Tax Agency notices and work with payroll Vendor (ADP) for resolution.\n• Perform quarter end and year end activities including YE communication, SIT credit correction, review of W2, client error report, Quarterly Verification letter, wage and tax register review etc.\n• Communicate with employees to resolve their questions using communicator or through call.\n• Process Out of Sequence payroll on quarterly basis for quarter end adjustments.\n• Process Amendment using amendment sheet.\n• Support Tax compliance manager in agency/IRS audits.\n• Perform pre and post payroll interface audits.\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n• 4 - 6years of relevant experience\n• Proficient in Microsoft Excel and Word\n• Flexible to work in shifts\n• Excellent verbal and written skills\n• Strong experience with customer service\n• Detail oriented\n• Strong problem solving and review skills\n• Proficient in using Microsoft Excel/Word.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}