{
    "Job ID": "69865575",
    "Description": "    Plan and coordinate the design, development, monitoring and analysis of Downstream Industry, Marketing & Trading Directorate’s performance measures and reporting in liaison with the Asset Management teams and reporting companies’ performance management divisions.Downstream Industry, Marketing & Trading Performance Scorecards and KPIsCoordinate and develop the performance scorecard for the Downstream Industry, Marketing and Trading Directorate and its Business Line Companies, including development and challenging DM&T Functions performance measures and targets.\nReview the analysis of the Directorate’s performance scorecards on monthly basis and assist Functions to mitigate areas of concerns to realize the strategic objectives in line with ADNOC’s Vision and Mission in the short and long term.\nSupport the Downstream Industry, Marketing & Trading strategy through the design and monitoring of relevant Key Performance Indicators (KPIs) assigned to the strategy action plans.Business Performance ManagementProvide and review the analysis of the Directorate’s performance scorecards on monthly basis and assist Functions to mitigate areas of concerns to realize the strategic objectives in line with ADNOC’s Vision and Mission in the short and long term.\nIdentify areas of improvements and supervise the administration of the Directorate’s performance management system in coordination with ADNOC Corporate Performance Team and reporting companies.\nMonitors the Directorate performance management framework and the KPI’s reported data and highlights the gaps and/or issues across DM&T Directorate and business line companies.\nCoordinate the design and development of the performance metrics used at the corporate level and business Functions level.\nSuggest, prepare and supervise ad hoc quantitative analytical assignments, as requested\nInteract with various Downstream Industry, Marketing & Trading Functions and Group Companies on the implementation of initiatives related to the performance and efficiency enhancement as part of ADNOC’s strategic development.\nConduct and review the analysis on new client registration and oversees the re-evaluation of the existing clients on a periodic basis in order to safeguard ADNOC’s interestsManagement Information System & Business ReportsSupervise the CPMS system to ensure data consistency and quality.\nScope and coordinate relevant data requests collection mechanism and ensure accuracy in coordination with relevant stakeholders.\nOversee the development and maintenance of the Downstream Industry, Marketing & Trading performance databases.SupervisionPlan, supervise and coordinate all activities in the assigned area to meet functional objectives.\nTrain and develop the assigned staff on relevant skills to enable them to become proficient on the job and deliver the respective business objectives.BudgetsProvide input for preparation of the Function / Division / Department / Section budgets, assist in the implementation of the approved Budget, and work plans to deliver business objectives.\nInvestigate and highlight any significant variances to support effective performance and cost control.Bachelor’s Degree in Economics/ Business Management or Engineering, or equivalent, preferably with specialized training in performance management systems/processes9 years of relevant professional experience including 5 years specifically in the Oil and Downstream industry.\nExposure to multiple facets in an integrated energy and petrochemical company.\nExperience in analytical data-driven thinking and decision-makingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}