{"Job ID": "69869763", "Description": "Date Posted: 14th Sep 2023 Position: Port Captain -﻿(OWNED/CO-OWNED VESSELS)Candidate location: UAE Job location: Abu Dhabi  BASIC FUNCTIONEnsure that all vessels are in full compliance with all international and statutory rules and regulation and Client requirements.\nTo ensure the successful, safe and profitable conduct of the vessels operations.\nTo Prepare vessel report in the required report format\nComplies with ADNOC Offshore requirementsDUTIES & RESPONSIBILITIESMaintain complete set of valid class & Flag state certificates for each vessel.\nReport details of all jobs and activities relative to vessel surveys to Management\nCoordinate with the statutory authorities for surveys & inspections to be conducted within the defined time frame.\nEnsure that vessels are equipped with necessary lifesaving appliances & firefighting equipment and ensure that all are in good operating condition.\nEnsure all vessel personnel comply with regulatory training requirements as per Standards of Training, Certification & Watch keeping (STCW) 95 / client requirements.\nBrief all newly appointed masters, Chief Officers and officers on local locations and the performance expected by the client.\nFamiliarize all new joiners fully with clients requirements before appointing them to the vessel.\nEnsure that required manpower is available on vessels at all times to execute scope of work in a safe & efficient manner and meet Safe manning and Clients Criteria.\nEnsure that vessels are stocked with the required navigation charts, navigational publications, stationeries, manuals, client instructions and field charts.\nCarry out inspections on vessels to ensure compliance with all standards. Compliance in accordance with Company codes, IMO (International Maritime Organization), Client standards and HSE standards.\nInterview and approve all new masters, officers in reference to the STCW and client standards.\nMaintain and monitor PMS of all vessels in line with manufacturer manuals.Ensures corrective actions arising out of incident investigations are satisfactorily closed-out. HSE RESPONSIBILITIES & ACCOUNTABILITYEnsures that all new & existing crew are competent to carry out their designated functions and their qualifications are in full compliance with statutory regulations and Client standards.\nNew joining employees are properly inducted and familiarized with their work place rules and regulations.\nCarry out Periodical safety inspections for the vessels LSA and FFA.\nAttends QHSE meetings at all levels.\nDemonstrates his visible commitment to QHSEMS by means of site visits, participates in accident / incident investigations related to his area of operation, and follows up corrective / preventive actions until close out report is issued.\nEnsures all lifting equipment undergo periodical mandatory inspection & certification as per planned program.\nMaintains the validity of all relevant vessel certificates and follows up their renewal in time\nACCOUNTABILITIES\nAnalyzing the Marine crew needs\nThe effective planning of vessel audits plan and inspections.\nThe effective organizing of vessels activities.\nEstablishing KPI to all vessel crew.\nIn-house training pertaining to the development of the crew of vessels.\n AUTHORITIES\nApproval of new Marine staff recruitment.\nProviding the U.A.E Labour law implementation mechanism in his area of accountability\nAppraisal and development of deck crew.\nMotivate and reward crew within the limit of 100 on monthly basis or 300 AED as maximum.\nTermination of crew after approval from marine operation manager.\nRecommend work structures amendment on-board vessel.\nHaving full authority to stop any unsafe work that may harm the health of personnel, cause injury to personnel or damage the environment.\nQUALIFICATION & AGE LIMIT\nMaster Mariner\nMaster STCW-95 Unlimited Regulation II/2 White list\nMore than 35 years.\n SKILLS & EXPERIENCE\nMinimum 4 years experience in the rank of Master on any type of vessels operated \nFluent in written and spoken English.\nComputer literate.Salary AED 25K- 30K + Family benefits Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}