{"Job ID": "69869837", "Description": "Do you want beneficial technologies being shaped by your ideas? Whether in the areas of mobility solutions, consumer goods, industrial technology or energy and building technology – with us, you will have the chance to improve quality of life all across the globe. Welcome to Bosch. At Bosch, we develop, examine and enhance new systems, components and technologies. Our aim is simple – improving lives. The Robert Bosch Automotive Steering Ltd in Eger and Maklar as an automotive supplier produces steering gears, steering columns, I-shafts and remanufactured parts in the best quality and most efficient way for the world's most famous car manufacturers. In line with the „Invented for life\" motto, we are working on creating automated driving, implementing self-driving cars for the future.Experience in Automotive domainOverall Responsible for the Project management.\n\nEstablish Project Agreement and Project development Plan.\n\nProject Kickoff and develop HC planning.\n\nSchedule, quality and budget controlling\n\nPlan and perform Quality gates\n\nProject status update to stakeholders.\n\nControl project risks, Control Project Cost.\n\nCustomer Co-ordination\n\nResponsible for Engineering Change Request Evaluation\n\nStrong communication skills, cooperative/collaborative, team work, persuasive, influencing and effective negotiation.\n\nStrong leadership skills - able to take the team along with him\n\nResult oriented, Strong Process orientation, Structured approach towards problem solving, Active Customer co-ordination and Technical interaction\n\nAgile practices ( added advantage )\n\nPMP certification (added advantage)BE ( Electronics, Electrical, Instrumentation, Telecommunication), ME , M.TechStrong communication skills\n\nExperience on Problem and Change request Management\n\nHands on Automotive SW development in C language\n\nStrong commitment and desire to learn and grow\n\nStrong knowledge in requirements engineering and be able to deep dive into topics\n\nExhibit Ownership and be an independent team member\n\nGood knowledge in Agile methodologies\n\nBasics knowledge of Embedded System\n\nExposure in Model based SW development\n\n7 to 10 years of relevant work experience.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}