{
    "Job ID": "69861401",
    "Description": "Does the hustle and bustle of life excite you? Are you able to create a loyal following, whilst handling the pace and keeping your team checked in? Then why not come and join us at the Radisson Hotel Group to Make Every Moment Matter! where our guests can relax and enjoy the experience!\n\nOur first-class Front Office Team is the heart of the house where we exude patience, empathy and personality to host the show and where we strive to deliver a hospitality experience that is beyond expectation - creating memorable moments for our guests.Situated on Palm West Beach, our vibrant lifestyle resort boasts incredible city and ocean views and provides easy access to the beach. Whether you’re traveling for business or leisure, we have got you covered. Explore our on-site restaurants and bars for all-day dining and exciting drinks menus. Keep your exercise routine on track at our fitness center and find true relaxation at our spa. To unwind, take it easy by the pool or at our full-service private beach. If you’re traveling for work, take advantage of our three fully-equipped meeting and event spaces.\n\nAs an  Assistant Front Office Manager, you will join a team that is passionate about delivering exceptional service where we believe that anything is possible, whilst having fun in all that we do!\n\nInterested then why not say Yes, I Can! as we are looking for passionate people just like you!Key Responsibilities as an Assistant Front Office Manager:·         Supports the smooth running of the front office department, where all aspects of the guest journey and experience are delivered to the highest level.·         Manage and monitor activities of all employees in the Front Office department making sure they adhere the standards of excellence and to the guidelines set in the employee handbook, hotel policies and procedures, coaching, training and correcting where needed.·         Dealing with complaints, problem solving, disturbances, special requests and any other issues that may arise.·         Works proactively to improve guest satisfaction and comfort, delivering a positive and timely response to guest enquiries and problem resolution.·         Delivers on plans and objectives where front office initiatives & hotel targets are achieved·         Supervises the front office team fostering a culture of growth, development and performance within the department·         Accountable for ensuring that costs and inventory are controlled, that productivity and performance levels are attained·         Builds and maintains effective working relationships with all key stakeholders·         Takes ownership to deliver an effective planned guest engagement programme·         Ensures adherence and compliance to all legislation where due diligence requirements and best practice activities are planned, delivered and documented for internal and external audit, performing follow-up as required·         Undertake full responsibility for Scheduling and Payroll of the department.·         Set Front Office Budget, monitor Profit & Loss and cash handling throughout the year. Supervise Upsell program at the Front Office and work as part of the Yield Management team to try and maximize revenue for the hotel.·         Work closely with the Housekeeping Department to improve guest services and foster cross departmental communication.·         Coordinate daily activities with hotel management team on a daily basis.·         Hold monthly department meetings keeping staff informed of all activities in the hotel, reinforcing Standards of Excellence and promoting a strong team atmosphere and culture.·         Be aware and able to enforce all fire-life-safety procedures. Remain current in all updates with regards to new procedures and training. Ensure staff is fully trained in emergency procedures. This position is a member of the hotel’s emergency response team.Requirements and skills: -·         High school degree or equivalent; bachelor's degree or certification in management in related field preferred·         2+ years of previous experience as an Assistant Manager Front Office or a related role preferred·         Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, Outlook, and Excel)·         Solid customer service skills·         Excellent leadership, team building, and management skills·         Encouraging to team and staff; able to mentor and lead·         Ability to find creative solutions with proven problem-solving capabilities offering support where required·         Personal integrity, with the ability to work in an environment that demands excellence, time and energy·         Female candidate who is a Russian/German speaker·         Excellent verbal and written communication skills·         Commitment to delivering exceptional guest service with a passion for the hospitality industry·         Experience of working with IT systems on various platforms·         In-depth understanding of the industryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}