{
    "Job ID": "69866236",
    "Description": "YOU TACKLE FOR QUALITY AND GREAT SERVICE. THIS WILL IMPROVE THE LIFE OF OUR CUSTOMERS.Would you like to become part of the world's most international company in the world?A company that pioneered cross-border express delivery in 1969 and is now active in more than 220 countries and territories worldwide. Do you want to be part of a company that connects people worldwide? And the more people we connect, the better life will be on our planet.Join our team and discover how an international network that's focused on service, quality and sustainability, is able to connect people and improve lives through the power of global trade. And not just for our customers, but for every member of our team too. To learn more about our culture, motivated people and our purpose, please visitwww.dpdhl.jobs/expressDo you want to make a difference? Then come to our \"Insanely Customer Centric\" Team and become a Certified International Specialist!ROLE PURPOSE:To provide maintain and support all Ground Handling Equipment’s and Facility services within Bahrain HUB facility, USPS/MDC facility, BCO facility and to support equipment operations for any required Base.\nTo provide backline support to the Manager & Supervisor and Facility Maintenance Department in all facets of maintenance services.YOUR TASKS:·To maintenance support and services to all DHL GSE always ensuring smooth and reliable operation.·To maintain all DHL GSE regularly and carry out scheduled preventative maintenance accordingly with the minimum disruption to the operations.·To conduct daily inspections and checks of all DHL GSE and repair as necessary.·To maintenance support and services to all DHL Dollies always ensuring smooth and reliable operation.·To conduct daily inspections and checks of all DHL Dollies and repair as necessary.·To maintain all DHL Dollies regularly and carry out scheduled preventative maintenance accordingly with the minimum disruption to the operations.·To carry all welding task for Facility and Dollies & GSE.·To carry all electrical task, inspection/repair to achieve targeted serviceability and operational smoothness.·To carry out revision works, modifications or Service bulletins mandated by the Equipment suppliers.·To keep and track all spare parts, consumables and other requirements and replenish and request/order as necessary.·To prepare, report and log all actions taken on a day to day activities.·Ensure all facility and DHL GSE in good working condition and to attend all callouts as needed.·Ensure all facility and DHL Dollies in good working condition and to attend all callouts as needed.·Ensure that DHL’s service standards, objectives and code of conduct are met or always exceeded.·Ensure that security standards are always maintained.·Record Maintenance, Technical Records on GAMMS (Global Asset Maintenance Management System) and all service details required.·Receive calls and check work order requests on e-mails and coordinate and distribute work orders as requested by Supervisor/ Manager.·Collecting hour meter reading of the equipment and updating in GAMMS for releasing of Preventive maintenance services.·Updating the new GSE DHL asset in Enterprises Asset management system (Info EAM) others.·Support To carry out receiving procedures for all spares as described in the company procedures.·Assist with the creation of scheduling of PPMs across all sites.·Assist Supervisor/Manager for all assigned administrative functions.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}