{
    "Job ID": "69869858",
    "Description": "DescriptionWe are looking for an admissions officer to join our growing school.For all staff in school we share a responsibility to ensure that children are safe and properly supervised at all times. Our school is committed to ‘amazing learning’- providing enjoyable and meaningful learning experiences so that every pupil makes as much progress as possible. All staff are expected to adhere to The Aquila Professional Code of Conduct and commit to promoting our vision – ‘A happy community school with amazing learning at its heart where pupils are empowered to make choices, engage in meaningful learning experiences and make exceptional progress’. Our focus is providing children with amazing learning and to be the school of choice for the community we serve.The Aquila School is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment. All post holders are subject to appropriate vetting procedures and satisfactory Criminal Background Checks or equivalent covering the previous 10 years’ employment history.Core purposes:To manage leads and translate leads into enrolments to maximise pupil numbers\nTo support lead generation and school awareness through in school events and local partnerships to help the school become the school of choice for the local community\nTo take an active role in the day to day running of the schoolKey duties include:To follow up on all new enquiries within one working day, answering questions and converting enquiries to admissions meetings\nFollowing up after meetings for all their appointments, up to and including an offer being made, and liaising with the registrar and finance so there is a smooth hand over for offers\nTo lead parent tours of the school and support meetings as required\nTo manage and maintain the appointment calendar, chasing any missed appointments, and ensuring the welcome area for parents is prepared before meetings\nWeekly reconciliation between Hubspot and Engage to make sure records are always up-to-date\nTo manage the multiple databases of parent enquiries.\nTo participate in regular meetings with the admission/marketing team meetings and to share information with the school leaders and ISP on a regular basis.\nTo cover reception as required and support the day to day running of the school\nTo contribute to the weekly KPI reports, enrolments reports and pipeline reports, with the support of the registrar and head of admissions.\nTo be a primary contact for new incoming enrolment enquiriesMeasures of performance-Targets will be set based on:Number of enrolments\nConversion rate of enquiries to enrolmentsIn addition, all staff are required to carry out any tasks required by the school or the regional office to facilitate the smooth day to day running of the schoolTo be line managed by the school admissions manager Holidays- 30 working days per yearHours of work: 8:15am to 5:00pm Monday to Thursday and up to 1pm on Friday’s (and up to 5:00pm on a Friday every 3-4 weeks as per a rota system) plus occasional evening and weekend work.  The working hours may be amended as the employer deem necessary from time to time (e.g. open days)Person SpecificationExcellent English speaker and communication skills\nWillingness to undertake appropriate training and professional development\nExperience of office administration\nExperience of working in a school\nExperience of working with young people\nUnceasingly optimistic and a ‘can do’ attitude – calm kind and professional with all members if the school community\nCan meet deadlines by effective planning and time management\nStrong work ethic and capacity for hard work\nAbility to relate well to colleagues and students and parents / members of the public\nAbility to work well as part of a team\nWillingness to contribute to extra-curricular activities\nKnowledge of and genuine interest in educational issues and how they apply to our school.\nExcellent interpersonal and organisational skills\nKnowledge of Engage system\nAttention to detail and a good level of numeracy\nStrong ICT skills, including the use of spreadsheets\nKnowledge and understanding of school policies and proceduresTo get a flavour of our school please visit our website and follow us on social media.About the International Schools PartnershipThe Aquila School is owned by a London based company called International Schools Partnership (ISP). The International Schools Partnership (ISP) is a growing group of committed colleagues in financially responsible schools around the world, all of which aim to be the school of choice in their local area. Learning is at the heart of everything we do for our pupils, colleagues and parents. We are committed to getting better, all the time.ISP was founded by an experienced team of committed educationalists and commercial operators who have worked together over many years. Our growing group of private schools located in the UK, the USA, Spain, Costa Rica, Chile, the United Arab Emirates, Qatar, Malaysia, and Mexico educate children and pupils from 2-18 years of age. We have now expanded to over 60 schools delivering multiple curricula and building on local brands and reputations with over 30,000 pupils and 8,000 staff located across the globe.We believe that successful schools are the ones that put learning at the heart of everything they do, always aiming to create rounded individuals that are able to forge successful careers and lives in a rapidly changing world. Our goal is to enable our schools as the leading school of choice in their local area. We are a truly international group working in different cultures and speaking different languages. We work across countries and cultures, too, by working with each other and with other schools and communities. At ISP we continue to engage with schools around the world who are interested in becoming part of our global group of schools and look forward to welcoming more pupils and staff to the group.All our schools: Help children and pupils learn to levels that amaze them.\nInspire children and pupils to be successful now and equip them to be successful later.\nAre truly international, working in partnerships within and across regions, cultures and languages.\nAim to be the schools of choice for children, pupils and their families, wherever we are.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}