{"Job ID": "69865872", "Description": "Requisition Number: 217172External Description:What You’ll DoThis Role will mainly be working as part of Azure & GC Ops for the Cloud Ops L2 team, which is eventually responsible for all Cases, Incidents, Changes, across Azure & Google Cloud Platforms.Few core responsibilities though not limited to would be as below.The Cloud Ops Administrator is responsible for managing Teradata’s as-a-Service offering on public cloud (Azure)\nDelivery responsibilities in the areas of cloud network administration, security administration, instantiation, provisioning, optimizing the environment, third party software support.\nSupporting the onsite teams with migration from On premise to Cloud for customers\nImplementing security best practices, and analyzing the partner compatibility\nManage and support 24x7 VaaS environments for multiple customers.\nDevise and implement security, operations best practices.\nImplementing development, production environment for data warehousing cloud environment\nBackup, Archive and Recovery planning and execution of the cloud based data warehouses\nThroughput monitoring, load balancing, improving the overall system health by optimizing the key Azure resources.\nProactively monitor ticket queue and assignment of tasks to shift members\nEnsuring SLA are met during that shift- Acknowledgement & Update SLAs\nIncident/task prioritization during the shift\nEnsure all scheduled changes are implemented within the prescribed window\nFirst level of escalation for team members\nFirst level of help/support for team members\nProactively highlight any incidents about to miss the SLA. Constantly monitor SLA Dashboard\nEnsure even distribution of workload within shift members.\nHandling S1 during shift\nShift leads would manage transition and share summary of all tickets being transferred\nDivert adhoc tasks to platform leads.Who You’ll WorkThis Role will mainly be working as part of Azure & GC Ops for the Cloud Ops L2 team, which is eventually responsible for all Cases, Incidents, Changes, across Azure & Google Cloud Platforms. This will be reporting into Delivery Manager for Azure & GC Ops.What Makes You a Qualified CandidateMinimum 6-8 years of IT experience.\nMinimum 3-4 years of Cloud hands-on experience (Azure).\nExpert in at least one of the supported public cloud platform (Azure).\nCloud Certification.\nShould have basic leadership qualities.\nITIL or other relevant certifications are desirable\nService Now / ITSM tool day to day Operations\nMust be willing to provide 24x7 on-call support on a rotational basis with the team.\nMust be willing to travel – both short-term and long-termWhat You’ll Bring4 Year Engineering Degree or 3 Year Masters of Computer Application.\nExcellent oral and written communication skills in the English language\nMust be willing to provide 24x7 on-call support on a rotational basis with the team.\nMust be willing to travel – both short-term and long-termTeradata/DBMS Experience Hands on experience with Teradata administration and strong understanding of Cloud capabilities and limitations\nThorough understanding of Cloud Computing: virtualization technologies, Infrastructure as a Service, Platform as a Service and Software as a Service Cloud delivery models and the current competitive landscape\nImplement and support new and existing customers on VaaS infrastructure.\nThorough understanding of infrastructure (firewalls, load balancers, hypervisor, storage, monitoring, security etc.) and have experience with orchestration to develop a cloud solution.\nShould have good knowledge of cloud services for Compute, Storage, Network and OS for at least one of the following cloud platforms: Azure\nManaged responsibilities as a Shift lead\nShould have experience in Enterprise VPN and Azure virtual LAN with data center\nKnowledge of monitoring, logging and cost management tools\nHands-on experience with database architecture/modeling, RDBMS and No-SQL.\nShould have good understanding of data archive/restore policies.\nTeradata Basic\nIf certified with VMware skills will be added advantage.\nWorking experience in Linux administration, Shell Scripting.\nWorking experience on any of the RDBMS like Oracle//DB2/Netezza/Teradata/SQL Server,MySQL.CountryEEOText_Description: Why We Think You’ll Love Teradata We prioritize a people-first culture because we know our people are at the very heart of our success. We embrace a flexible work model because we trust our people to make decisions about how, when, and where they work. We focus on well-being because we care about our people and their ability to thrive both personally and professionally. We are an anti-racist company because our dedication to Diversity, Equity, and Inclusion is more than a statement. It is a deep commitment to doing the work to foster an equitable environment that celebrates people for all of who they are.City: Airoli Navi MumbaiState: MaharashtraCommunity / Marketing Title: Specialist Cloud Admin - AzureJob Category: ConsultingCompany Profile:Our CompanyTeradata is the connected multi-cloud data platform for enterprise analytics company. Our enterprise analytics solve business challenges from start to scale. Only Teradata gives you the flexibility to handle the massive and mixed data workloads of the future, today.The Teradata Vantage architecture is cloud native, delivered as-a-service, and built on an open ecosystem. These design features make Vantage the ideal platform to optimize price performance in a multi-cloud environment.LinkedIn Remote:Location_formattedLocationLong: Airoli Navi Mumbai, Maharashtra INJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}