{
    "Job ID": "69869518",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:Mission Statement :We are seeking an R&D Cybersecurity Analyst (Product Security Engineer) to join our team and assist with cybersecurity, penetration testing, and product security research and development. The successful candidate will be responsible for analyzing and evaluating security measures for our products, conducting penetration testing to identify potential security threats, and developing solutions to address security vulnerabilities. You will be the primary contact and driver to ensure security hardened Products and Systems also including security related knowledge management and rollout in the Enterprise Software Solutions organization.Your Responsibilities :Conduct cybersecurity research and analysis to identify potential security threats.\n\nPerform penetration testing to evaluate the security of our products.\n\nAnalyze and evaluate security measures and controls for our products.\n\nDevelop solutions and recommendations to address security vulnerabilities.\n\nAssist in the development of cybersecurity policies and procedures.\n\nStay up-to-date with the latest trends and technologies in cybersecurity and product security.\n\nWork collaboratively with the R&D team to ensure cybersecurity is integrated into the development process.\n\nAbility to work in a multinational team with agile mentality.\n\nOverall driver for the consistent implementation of HE Cyber Security strategy, processes and communication within Enterprise Software Solutions.\n\nResponsible for tracking, auditing and reporting as per internal Security Development Lifecycle.\n\nEnsure a timely and consistent process for handling of security vulnerabilities in Enterprise Software Solutions products – including detection, assessment, correction and knowledge distribution.\n\nCreating and keeping a comprehensive understanding of global cybersecurity risks and market requirements, including regulations and standards.\n\nAlignment with product management and R&D project leaders to ensure security lifecycle planned within product development roadmaps.\n\nAnticipate and influencing current and future technologies and trends and leading internal knowledge sharing.\n\nActively contributing to find, manage and reduce cybersecurity risks – both today and in the future.\n\nPreparation and execution of internal awareness and training programs.\n\nLiving Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.Your Background :Graduated with a degree in Computer Science, Cybersecurity, or a related field.\n\nCandidate with 2-5 years of relevant experience.\n\nFamiliarity with cybersecurity principles, penetration testing, and product security.\n\nUnderstanding of common vulnerabilities and exploits.\n\nExperience with at least one programming language, such as Python, C# or C++.\n\nFamiliarity with cybersecurity tools such as Kali Linux, Metasploit, and Nessus.\n\nAbility to work independently and collaboratively with a team.\n\nExcellent verbal and written communication skill.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}