{
    "Job ID": "69866364",
    "Description": "If you need assistance during the recruiting process due to a disability, please reach out to our Recruiting Accommodations Team through the Accommodation Request form. This form is used only by individuals with disabilities who require assistance or adjustments in applying and interviewing for a job. This form is not for inquiring about a position or the status of an application.VR Technical SupportVrbo, a world leader in the vacation rental industry, is the place to book beach houses, cabins and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. Vrbo is part of the Expedia Group family of brands.Our Vrbo team is currently looking for motivated individuals with a bias to action, an obsession with resolving customer issues, and collaborating with team members across the globe.As a Technical Support Specialist, you are responsible for providing Level II customer support for the Vrbo suite of tools and websites. You will assist in the resolution of customer* questions and inquiries in booking, configuring, or consuming Vrbo travel-related services. Are you experienced at resolving issues of advanced complexity and skilled at handling higher-level tasks?. Can you explain complex ideas and concepts in a clear, simple manner? Technical Support Representatives require both an intimate knowledge of product as well as some extended general technical knowledge of web browser technologies, operating systems and hardware. You will be interfacing directly with our customers and should possess strong communication skills as well as the ability to explain technical procedures in a way best understood by the individual you are working with.Note: We will provide training on our products and services. This position is in Gurgaon and reports to the Associate Manager, VR Technical Support. There is no opportunity for remote/virtual participation.What you’ll do:Triage, troubleshoot and drive resolution for issues that have been escalated from Customer Support\n\nIdentify and report, track, and effectively escalate internal system issues with product and development teams\n\nHelp to analyze and identify issue severity levels and follow appropriate escalation procedures\n\nReport onemergingand recurring issuespromptly\n\nRecognize and handle customer errors gracefully\n\nEducate customers in best practices for using Vrbo applications\n\nBe an advocate for the voice of the customer\n\nSupply knowledge gained back to Customer Support through documentation of issue resolutions and troubleshooting procedures\n\nDevelop and maintain expert knowledge on Vrbo products\n\nKeen eye for detail and high level of accuracy\n\nExercise good judgment in decision-making\n\nMeet agreed upon and expected service levels for case completion and quality standards\n\nOther duties as assignedWho you are:Bachelor’s degree or related technical field or equivalent related professional experience\n\nMinimum of 1 year of internet based travel or technology experience, preferably in a technical capacity for a consumer website\n\n1 to 2 years experience providing high level technical support in a customer facing environment\n\nProven ability to identify and clearly scope and communicate technical issues\n\nAbleto workshifts that spanweekends and public holidays\n\nExperience with Android, Apple and Windows based mobile devices\n\nExperience with browser technologies including a deep understanding of cookies, security controls, extensions and add-ons for popular browsers like Chrome, FireFox and Safari\n\nExperience with MS Office suite including Outlook, Word, Excel, and PowerPoint\n\nExperience querying data logging and monitoring applications such as Splunk, New Relic, and Data Dog\n\nExperience with basic data analysis tools such as SQL (create/read/update queries), Splunk, Kibana, and advanced Excel functionality\n\nWorking knowledge of SaaS with a focus on GraphQL\n\nExperience troubleshooting connection issues using knowledge of network technologies and hardware including modems/routers, ISPs, Wi-Fi, mobile broadband networks as well as protocols like DNS, DHCP, HTTP, TCPIP\n\nExperience troubleshooting email issues and understanding of IMAP, popular web mail and email providers, settings, filters and relayed/aliased addressesAbout Expedia GroupExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.© 2021 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50Employment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals to whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}