{"Job ID": "69864589", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Job Overview:As a Project Controls/Reporting Manager, you will be responsible for overseeing the reporting process, analyzing project data, and providing accurate and timely reports to support decision-making and project management. This role requires exceptional analytical skills, presentation skills, advanced knowledge of reporting tools, and a deep understanding of project management and construction industry practices.Responsibilities:1. Reporting and Analysis:   - Develop and implement reporting frameworks and standards to ensure accurate and timely reporting of project performance.   - Gather project data from various sources and analyze it to identify trends, patterns, and insights that inform decision-making.   - Prepare regular reports, dashboards, and presentations summarizing project status, key performance indicators (KPIs), and financial metrics.   - Collaborate with project teams to understand their reporting needs and provide customized reports and analysis as required.2. Data Management:   - Establish and maintain a centralized database or reporting system to store, track, and manage project data effectively.   - Ensure data integrity and accuracy by conducting regular audits and implementing quality control measures.   - Develop data collection processes and train project teams on data entry and reporting best practices.   - Stay updated on industry trends and new reporting tools to continually improve the data management and reporting processes.3. Performance Monitoring:   - Monitor project progress, milestones, and deliverables against established targets and benchmarks.   - Identify areas of concern or potential risks and communicate them to relevant stakeholders.   - Collaborate with project managers to develop performance improvement plans and track their implementation.   - Provide recommendations to optimize project performance based on data analysis and industry best practices.4. Stakeholder Engagement:   - Collaborate with project teams, clients, and other stakeholders to understand their reporting requirements and address any concerns.   - Engage in regular communication with stakeholders to provide updates, answer queries, and solicit feedback on reporting processes.   - Foster strong working relationships with internal and external stakeholders, promoting transparency and effective collaboration.5. Continuous Improvement:   - Identify opportunities to streamline reporting processes, automate data collection, and enhance reporting capabilities.   - Actively seek feedback from project teams and stakeholders to improve the relevance and usability of reports.   - Stay abreast of industry trends and best practices in reporting and data analysis, and incorporate them into the organization's reporting strategy.Requirements:- Bachelor's degree in Business Administration, Finance, or a related field (Master's degree preferred).- Proven experience in a similar role as a Project Controls or Reporting Manager or in a related reporting and analysis position.- Solid understanding of project management principles and construction industry practices.- Proficiency in using reporting tools such as Microsoft Power BI, Tableau, or similar platforms.- Advanced knowledge of data analysis techniques and experience with data visualization tools.- Excellent attention to detail and ability to work with large data sets.- Strong communication and presentation skills, with the ability to effectively convey complex information to stakeholders at all levels.- Ability to work independently and manage multiple priorities in a fast-paced environment.- Strong problem-solving and critical-thinking abilities, with a focus on delivering actionable insights from data.Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500® company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}