{
    "Job ID": "69868555",
    "Description": "Regulatory Reporting – Standards and Control ManagerSome careers grow faster than others.If you’re looking for a career that will give you plenty of opportunities to develop, join HSBC and your future will be rich with potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.Digital Business service is the foundation of HSBC. We provide essential support for the bank through operations, technology, key central business services, and our worldwide network of chief operating officers. Our remit includes running customer operations, delivering innovative digital solutions for customers and colleagues, managing bank-wide change, and central services such as procurement and real estate management. Our teams play a vital role in driving great experiences for customers and colleagues, and enabling the bank’s strategy.In this role, you will:Lead the embedding of regulatory reporting process framework in the UAE by:\nDrive Regulatory Reporting strategic deliverables in UAE.\nCoordinate and delivery of the end-to-end regulatory reporting process.\nMaintain oversight of the regulatory reporting inventory in the UAE.\nLead on creating playbooks and overseeing the delivery of multiple material UAE regulatory deliverables (ESR, RBS, EWRA, BRF, etc..) that require bank-wide coordination.\nAct as the single point of contact and SME for specific regulatory reporting requirements, operating as a horizontal layer across all lines of business and bank functions.\nLead transformation and driving effective changes through UAE regulatory reporting and notification process and inventory.   \nEmbed regulatory reporting related policies, procedures and target operating model in UAE regulatory reports.\nLead on Magnus governance activities in UAE regulatory reports.\nEngage with 2LOD functions to scope and manage new reporting requirements.This includes creating and overseeing an end-to-end reporting process across Lines of Business and functions that is defined, owned, IT enabled and effective.  Responsibilities are expected to include:Design: Determining and implementing an optimal bank-wide operating model which is scalable, owned, controlled, visible/subject to workflow, and maximizes efficiency and effectiveness. This includes engagement with department champions and support functions (HOST etc.).\nDevelop: Early identification, work with 2LoD Stewards to scope and manage new reporting requirements, including engagement with the CB and industry bodies to influence proposed/future requirements and delivery of ‘dry runs’.\nProduce: Co-ordination and delivery of the end-to-end reporting process including submission management, internal escalation, and handling post submission Central Bank queries.\nAssurance: Validation of business as usual report submissions via a combination of data assurance and analytical review techniques.  Targeted deep-dive quality assurance reviews, along-side the Controls Office, to drive bank-wide effectiveness and efficiency.\nOther: Management of ad-hoc regulatory reporting requirements; engagement with internal compliance functions (e.g. internal audit, Controls Office etc.); maintaining a report inventory; and other ad-hoc tasks required to support the rapidly evolving regulatory reporting landscape.\nMaintain oversight of a number of Regulatory Reporting strategic deliverables\nDesigning and implementing end-to-end reporting process across Lines of Business and functions that is defined, owned, IT enabled and effective.\nThe key stakeholder is the Regional Chief Operating Officer and Regional Chief Data Officer.  Other stakeholders include the Chief Risk Officer and Chief Accounting Officer.  Finally, engagement across LOBs and sub-functional teams is key to deliver the bank-wide initiative.\nEnsure BAU reporting is delivered in an effective and efficient manner\nThe jobholder will adhere to and be able to demonstrate adherence to internal controls. This will be achieved by adherence to all relevant procedures, keeping appropriate records and, where appropriate, by the timely implementation of internal and external audit points, including issues raised by external regulators.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}