{"Job ID": "69861145", "Description": "We are a search for an AP Assistant. This individual will be responsible primarily for processing a high volume of AP invoices in a 3-way match environment. This is a great opportunity for a motivated AP Assistant to obtain great experience within a large well-known organization.Essential Duties/Principal Responsibilities:Work as a point of contact for the business and external service provider for Invoice to Pay (I2P) processing\nProvide functional support to various end-users as it relates to invoice processing, vendor master changes and payments.\nResponsible for Clearing of the GRNI account.\nWork with external service provider to resolve problems pertaining to Purchase Orders, Goods/Services Receiving and Invoicing to ensure timely and accurate supplier payments\nSupport month end close activities.\nIdentify improvement opportunities and be an active contributor in problem solving and fact finding analysis\nProvide local and regional support to end-users on finance policies and procedures and assist with preparing Standard Operating Procedures.\nWork closely with the local business to understand issues and feedback into process improvement recommendations\nProviding ad-hoc reporting for leadership, effectively communicating with our business partners and participating in special or cross-functional projects. \nIndividual have to perform Supplier statement reconciliation.  Additional Responsibilities:Compliance with SOX procedure documentation and controls, with minimum audit findings\nAssist AP Leader in ICP Reporting in One Stream and get ICP invoices paid in timely basis through netting/Bank.\nIndividual may perform other duties as assigned, including work in other functional areas to cover absences or relief, to equalize peak work period’s, or otherwise to balance the workloadJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Vadodara, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}