{"Job ID": "69867882", "Description": "Leica Biosystems’ mission of “Advancing Cancer Diagnostics, Improving Lives” is at the heart of our corporate culture. We’re a global leader in cancer diagnostics with the most comprehensive portfolio from biopsy to diagnosis. Our easy-to-use and consistently reliable offerings help improve workflow efficiency and diagnostic confidence. Our associates know that every moment matters when it comes to cancer diagnostics. When you come to work, you’re helping develop solutions that enable accurate diagnoses to turn anxiety into answers. Join our diverse, global team of talented people, and be inspired to grow every day.Leica Biosystems is proud to work alongside a community of six fellow Diagnostics Companies at Danaher. Together, we’re working at the pace of change to improve patient lives with diagnostic tools that address the world’s biggest health challenges. The “Application & Implementation Consultant Middle East” for Leica Biosystems is responsible for effectively support the sales process, provide comprehensive training, and manage complex installation/implementation projects to drive successful adoption of Leica Biosystems digital pathology scanners in the Middle East market.This position is part of the Leica Digital Pathology EMEA organization located in Europe and/or Middle East and will be fully remote. At Leica Biosystems, our vision is to advance cancer diagnostics and improve lives.You will be a part of the Leica METAR team and report to the Regional Sales Manager Digital Pathology NEE & METAR responsible for growth of the digital pathology business in the designated regions. If you thrive in a if you are a multifunctional technical expert who knows how to bridge the gap between customer needs in tin cancer diagnostics role and want to work to build a world-class sales & support organization—read on.In this role, you will have the opportunity to:Alignment with a Meaningful Mission: Contribute to our mission of \"Advancing Cancer Diagnostics, Improving Lives.\"\n\nGlobal Leader in Cancer Diagnostics: Work at the forefront of cancer diagnostics, gaining exposure to cutting-edge technology and a comprehensive portfolio to enhance your knowledge and skills in the field.\n\nFocus on Innovation: Engage in innovative projects and continuous learning to stay at the forefront of advancements in diagnostics.\n\nImpactful Work: Directly influence the successful adoption of digital pathology scanners, creating a tangible impact on healthcare in the Middle East.\n\nDiverse and Global Team: Be part of a diverse, global team of talented individuals, with opportunities for networking, collaboration, and exposure to different perspectives and cultures.\n\nMultifunctional Expertise: Develop a versatile skill set and gain experience in sales, technical support, and customer relations.The essential requirements of the job include:Subject Matter Expertise: The candidate should have a deep understanding of digital pathology, including the technical aspects of scanners, image analysis software, and related technologies. This expertise is necessary to effectively communicate with potential customers, address their questions, and provide accurate information during sales discussions and demos.\n\nTechnical and Clinical Proficiency: Strong technical skills are needed to conduct successful product demonstrations and provide training. Additionally, a solid grasp of clinical pathology processes and practices is essential to effectively demonstrate how the scanners can be integrated into the existing workflows of laboratories and healthcare institutions.\n\nSales Support and Communication: The Application Specialist must work closely with the Sales Specialists. Excellent communication skills are required to translate complex technical information into understandable terms for potential customers. This involves showcasing the value of the scanners, addressing concerns, and demonstrating how the product can meet the specific needs of each laboratory.\n\nTraining and Implementation Leadership: The candidate should be capable of designing and conducting training sessions for partner associates and end-users. Moreover, the ability to lead large installation/implementation projects is vital. This includes overseeing the installation and integration of the scanners, training users on proper usage, and providing ongoing support as needed.\n\nProject Management and Accountability: Leading implementation projects requires strong project management skills. The Application Specialist should be able to develop project plans, set timelines, allocate resources, and ensure successful project completion. Accountability for meeting deadlines and delivering successful implementations is crucial to this role.\n\nEducation: A bachelor's degree in a relevant field such as Biomedical Sciences, Pathology, Medical Technology, or a related discipline is the minimum educational requirement. \n\nYears of Experience: 3 to 7 years of relevant experience. \n\nTechnical and Clinical Knowledge: Candidates should possess a solid understanding of both the technical aspects of digital pathology scanners and the clinical aspects of pathology. It would be a plus if you also possess previous experience in:Industry\n\nProject Management Skills.\n\nCommunication and Customer Interaction.At Leica Biosystems we believe in designing a better, more sustainable workforce. We recognize the benefits of flexible, remote working arrangements for eligible roles and are committed to providing enriching careers, no matter the work arrangement. This position is eligible for a remote work arrangement in which you can work remotely from your home. Additional information about this remote work arrangement will be provided by your interview team. Explore the flexibility and challenge that working for Leica Biosystems can provide.When you join us, you’ll also be joining Danaher’s global organization, where 80,000 people wake up every day determined to help our customers win. As an associate, you’ll try new things, work hard, and advance your skills with guidance from dedicated leaders, all with the support of powerful Danaher Business System tools and the stability of a tested organization.\nAt Danaher, we value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve.Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.\nIf you’ve ever wondered what’s within you, there’s no better time to find out.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}