{"Job ID": "69866376", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Position Title:                Cloud & Compute EngineerREPORTING TO:            Senior ManagerWORKING LOCATION:  Bangalore or Chennai or NoidaSUMMARY OF ROLE AND OBJECTIVES:As a Cloud Engineer, you will be responsible for, automating and building our next generation cloud infrastructure. With a focus of automation using CI/CD Concepts. You must be able to work in and adapt to a fluid, fast-paced environment. You must have strong communication, collaboration, and technical skills.ROLE & OBJECTIVES:Specific Assignments:Setup and maintain cloud/OnPrem Infrastructure:\nMaintain existing systems in the cloud\nMonitor the health of all systems in the cloud & On Prem system\nCheck that all systems are complaint to company standards\nAdministrate the cloud permissions and support segregated Sites/Zones\nWork in a team of engineers distributed over multiple locations\nGood Knowledge on Windows/Linux Troubleshooting\nMonitor platforms from an availability, security and performance aspect\nSupport the different product teams\nShare your knowledge and expertise within the companyRequiredWorking Knowledge of Terraform, Ansible / Scripting skills\nHands on Experience in Azure Cloud, GCP\nKnowledge in backup and Storage Commvault\nGood Knowledge in VMware vSphere (ESXi and vCenter)\nGood Knowledge in Handling Application Server.\nExperience with Windows/Linux Patching\nExperience in implementing best security and performance standards in provisioning the infrastructure.\nUnderstand the applications and Dependencies in terms of services, infra resources.\nAbility to come up with new technologies, methods and ideas, and guiding the team for further implementations.\nHigh affinity towards modern technology and cloudEXPERIENCE REQUIRED:7+ years of Infrastructure management with minimum of 2 Years in Azure/GCP CloudPrimary SkillsAzure Mandatory & GCP\nInfrastructure as a code Terraform / Ansible / Scripting skills\nVMware (Good to have and will be exempted if candidate is very strong in Azure)Secondary SkillsWindows/Linux Patching\nKnowledge in backup and Storage CommvaultPersonal profileVery good English communication skills (concise writing and orally convincing);\nAble to engage and influence others to obtain sufficient follow up and attention.\nEager to learn and continuously develop personal and technical capabilities.\nAbility to work in a complex international environment.\nEager to learn and continuously develop personal and technical capabilities.Certification:Cloud certifications in Azure/GCp public cloud -Good to HaveBachelor's degree or comparable education\nCertification ITIL Foundation V3 highly appreciated, but not mandatory\nLanguages: Fluent EnglishJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}