{
    "Job ID": "69867115",
    "Description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.About the Role:The ideal Provisioning Engineering candidate is passionate about technology and customers.  A true problem solver, the Provisioning Engineer will take personal ownership in seeing a problem through to resolution.  You will understand IT environments across heterogeneous operating environments. You will be comfortable speaking with Executives, Security, Product and Customer Operations teams. Candidates must have technical depth and a customer-first mentality, the desire to take the initiative to own and resolve customer issues, and interest in working in a fast paced, high growth, learning environment.What You'll Do:Provide well-thought out and reliable direction, both in technical and non-technical terms, to help customers integrate, deploy and maintain the CrowdStrike service.\n\nProvision new and existing customer features and ensure timely delivery.\n\nMeet or exceed customer expectations on response quality, timeliness of responses and overall customer experience.\n\nPerform audits of customer subscriptions and features to ensure accuracy.\n\nAssist with internal security and access control audits.\n\nCreate process and troubleshooting documentation for the internal teams to reference.\n\nPush creative thinking beyond the boundaries of existing industry standard practices to come up with process improvements and new ways to delight customers.\n\nProvide provisioning-specific product knowledge to the greater technical support team through trainings, Q&A, and documentation\n\nLeverage internal technical expertise, including development engineers, knowledge base, and other internal tools to provide the most effective solutions to customer provisioning issues.\n\nParticipate in technical communications within the team to share best practices and learn about new technologies and complementary security applications.What You'll Need:2+ years of customer support, technical support, system administration or related customer facing role.\n\nFamiliarity with different scripting languages.\n\nPassion for solving customer issues and advocating for their success, in a fast paced, highly technical environment.\n\nAbility to learn new technologies quickly.\n\nExcellent relationship management, customer service and communication skills in a variety of forms (written, live chat, conference calls, in-person.)\n\nAbility to work independently with little direct supervision and as a part of a team.\n\nOutstanding analytical and organisational abilities.\n\nAbility to remain calm, composed and articulate when dealing with tough customer situations.\n\nAbility to manage tight deadlines and variable workload while maintaining an acute attention to detail.Preferred Qualifications:Bachelor’s Degree in Computer Science or equivalent\n\nSecurity + or similar security certifications.\n\n3+ years of Customer Success/Support/Technical Account Management experience in a SaaS organisation.\n\nPython Scripting and RestAPI experience.\n\nExperience with Salesforce in the areas of Sales and Service cloud.#LI-NR1Benefits of Working at CrowdStrike:Remote-first culture\n\nMarket leader in compensation and equity awards with option to participate in ESPP in eligible countries\n\nCompetitive vacation and flexible working arrangements\n\nPhysical and mental wellness programs \n\nPaid parental leave, including adoption \n\nA variety of professional development and mentorship opportunities\n\nAccess to CrowdStrike University, LinkedIn Learning and Jhanna\n\nOffices with stocked kitchens when you need to fuel innovation and collaboration\n\nBirthday time-off in your local country\n\nWork with people who are passionate in our mission and Great Place to Work certified across Asia PacificWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.CrowdStrike is committed to maintaining an environment of Equal Opportunity and Affirmative Action. If you need reasonable accommodation to access the information provided on this website, please contactRecruiting@crowdstrike.com, for further assistance.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}