{"Job ID": "69866698", "Description": "Job Number 23167017 Job Category Sales & Marketing Location The Ritz-Carlton Bangalore, 99 Residency Road, Bengaluru, Karnataka, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY The Catering Sales Manager is responsible for contracting and closing local catering and social business and ensuring that business is turned over properly and in a timely fashion for quality service delivery. The position is responsible for achieving catering revenue goals by actively up-selling each business opportunity to maximize revenue. The incumbent implements the brand’s service strategy and applicable brand initiatives in all aspects of the sales process and drives customer loyalty by delivering service excellence throughout each customer experience. CANDIDATE PROFILE Education and Experience • High school diploma or GED; 2 years experience in the sales and marketing, guest services, front desk, or related professional. OR • 2-year degree from an accredited university in Business Administration, Marketing, Hotel and Restaurant Management, or related major; no work experience required. CORE WORK ACTIVITIES Managing Sales Activities • Manages sales efforts for the hotel including local corporate and social catering. • Works collaboratively with off-property sales channels (e.g., Sales Office, Area Sales, EST) to ensure sales efforts are coordinated, complementary and not duplicative. • Responds to incoming catering opportunities for the hotel. • Identifies, qualifies and solicits new catering business to achieve personal and hotel revenue goals. • Understands the overall market - competitors’ strengths and weaknesses, economic trends, supply and demand etc. and knows how to sell against them. • Closes the best opportunities for the hotel based on market conditions and hotel needs. • Uses negotiating skills and creative selling abilities to close on business and negotiate contracts. • Designs, develops and sells creative catered events. • Maximizes revenue by up-selling packages and creative food and beverage. • Manages catering sales revenue and operation budgets, and provides forecasting reports. • Develops menus which drive sales. • Executes and supports the operational aspects of business booked (e.g., generating proposal, writing contract, customer correspondence). • Participates in and practices daily service basics of the brand. • Monitors the effective resolution of guest issues that arise as a result of the sales process by creating mechanisms to channel issues to property leadership and/or other appropriate stakeholders. • Ensures successful performance by increasing revenues, controlling expenses and providing a return on investment for the owner and the company. Providing Exceptional Customer Service • Interacts effectively with sales, kitchen, vendors, competitors, local community, catering associations and other hotel departments in order to ensure guest satisfaction. • Executes and supports the company’s Customer Service Standards and hotel’s Brand Standards. • Executes exemplary customer service to drive customer satisfaction and loyalty by assisting the customer and ensuring their satisfaction before and during their program/event. • Serves the customer by understanding their needs and recommending the appropriate features and services that best meet their needs and exceed their expectations, while building a relationship and loyalty to the company. • Gains understanding of the hotel’s primary target customer and service expectations; serve the customer by understanding their business, business issues and concerns, to offer better business solution both prior to, and during the program/event. • Develops a close working relationship with operations to ensure execution of strategies at the hotel level. Additional Responsibilities • Performs other duties, as assigned, to meet business needs. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. At more than 100 award-winning properties worldwide, The Ritz-Carlton Ladies and Gentlemen create experiences so exceptional that long after a guest stays with us, the experience stays with them. Attracting the world’s top hospitality professionals who curate lifelong memories, we believe that everyone succeeds when they are empowered to be creative, thoughtful and compassionate. Every day, we set the standard for rare and special luxury service the world over and pride ourselves on delivering excellence in the care and comfort of our guests. Your role will be to ensure that the “Gold Standards” of The Ritz-Carlton are delivered graciously and thoughtfully every day. The Gold Standards are the foundation of The Ritz-Carlton and are what guides us each day to be better than the next. It is this foundation and our belief that our culture drives success by which The Ritz Carlton has earned the reputation as a global brand leader in luxury hospitality. As part of our team, you will learn and exemplify the Gold Standards, such as our Employee Promise, Credo and our Service Values. And our promise to you is that we offer the chance to be proud of the work you do and who you work with. In joining The Ritz-Carlton, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}