{
    "Job ID": "69867865",
    "Description": "Jamjoom Pharma has in a very short span of time emerged, as one of the leading pharmaceutical companies in the Afrasia region. The geographical focus of the company is on countries in the Middle East, Africa, and CIS regions. Strategic focus on selected therapeutic categories has contributed to the rapid growth, market acceptance, and overall success of the company. Job Profile:  Ensuring compliance with accounting standards accepted by auditors and authorities during the daily works and periodic reporting.Responsibilities:Perform financial forecasting, reporting, and operational metrics tracking\nAnalyze financial data and create financial models for decision support\nAnalyze past results, perform variance analysis, identify trends, and make recommendations for improvements\nEvaluate financial performance by comparing and analyzing actual results with plans and forecasts\nProvide analysis of trends and forecasts and recommend actions for optimization\nRecommend actions by analyzing and interpreting data and making comparative analyses; study proposed changes in methods and materials\nIdentify and drive process improvements, including the creation of standard and ad-hoc reports, tools, and Excel dashboards\nMaintain a strong financial analysis foundation creating forecasts and models\nPrepare the budget cash flow statement based on pro forma financial statement.\nPrepare the monthly cash flow statement for local and foreign currency.\nCompute and analyze the variance between the budgeted and actual cash flow monthly.\nCompute and analyze the variance between the budgeted and actual investment\nPrepare analysis reports related to cash flow and the investment presentation.\nPrepare Budget for CapexRequirements: Bachelor degree in Commerce - major Accounting (English Section)\nAt least 4-7 years of experience in manufacturing company in a computerized environment. (ERP experience is an advantage)\nExcellent user of computer application and MS Office (Word, Excel, PowerPoint and Outlook) and preferably having experience on SAP financial module.\nExcellent command of written and spoken English and Very good communication skills.\nAbility to work under pressure and meet deadlines, while maintaining a positive attitude and providing exemplary customer service\nAbility to work independently and to carry out assignments to completion within parameters of instructions given, prescribed routines, and standard accepted practicesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}