{
    "Job ID": "69865573",
    "Description": "JOB PURPOSE:Lead all project quality assurance and control activities pertaining to the successful delivery of the HQ managed Downstream strategic projects portfolio consisting of multiple projects at any point in time and will include both national and international projects executed in co-operation with Joint Venture partners.Report to the ADNOC VP- Project Services on the status of QA/QC initiatives for all projects ongoing within the Strategic Project delivery program.Integrate all Project Quality Assurance & Quality Control disciplines into feasibility study activities, early design, PRE-FEED, FEDD, EPC tender and selection etc. on projects. Ensure the application of best-in-class tools in line with ADNOC standards across all projects and techniques while finding and adopting the right QA/QC solutions required to enhance the feasibility of projects as well as their return on investment.KEY ACCOUNTABILITIES:Project Quality Assurance & ControlLead the Project Quality Assurance & Control activities within the Strategic Project Function (SPF) projects and provide direction and advice related to Project QA/QC matter on all projects in the DS project funnel managed by the SPF, both nationally and internationally.\nSupport implementation of Operational Plans on the development of individual ongoing projects. Ensure the integration of all technical and HSSE disciplines throughout initial feasibility, PRE- FEED and FEED as well as in the EPC tender.\nLead project teams together with the other SPF disciplines, contractors, and partner staff to deliver optimal technical solutions on a wide range of petrochemical investment projects.\nEnsure that project QA/QC plans and schedules are achievable and consistent in their approach across the project portfolio and aim to deliver maximum value to ADNOC.\nCollaborate and ensure that all Project Engineering Teams are working in alignment with ADNOC Operations and with external stakeholders. Focus on achieving the best possible project outcome for ADNOC and the highest possible likelihood of project implementation at FID.\nEnsure that project teams identify, understand, manage, and mitigate all project and business risks.\nCo-operate with the SBD function in DM&T on individual project opportunities for selection and development of new projects in order to implement the best technical and structuring options.\nSupport techno-economic feasibility studies, including PRE-FEED and FEED studies of new projects to deliver growth and economic value from DM&T projects.\nParticipate to the regular project meetings, provide an overview on progress, risks, trajectory, etc. and addressing specific questions for the projects.\nRecommend improvements in internal QA/QC processes against best practices in pursuit of greater efficiency in line with approved standards and define intelligent solutions for issues confronting the SPF.SupervisionPlan, supervise and coordinate all activities in the assigned area to meet functional objectives.\nTrain and develop the assigned staff on relevant skills to enable them to become proficient on the job and deliver the respective section objectives.BudgetsProvide input for preparation of the Section / Department budgets and assist in the implementation of the approved Budget and work plans to deliver Section objectives.\nInvestigate and highlight any significant variances to support effective performance and cost control.Policies, Systems, Processes & ProceduresImplement approved Project policies, processes, systems, standards, and procedures in order to support execution of the division’s work programs in line with Company and International standards.Performance ManagementContribute to the achievement of the approved Performance Objectives for the Section / Department in line with the Company Performance framework.Innovation and Continuous ImprovementDesign and implement new tools and techniques to improve the quality and efficiency of operational processes.\nIdentify improvements in internal processes against best practices in pursuit of greater efficiency in line with ISO standards in order to define intelligent solutions for issues confronting the function.Health, Safety, Environment (HSE) and SustainabilityComply with relevant HSE policies, procedures & controls and applicable legislation and sustainability guidelines in line with international standards, best practices and ADNOC Code of Practices.ReportsProvide inputs to prepare Section MIS and progress reports for Company Management.COMMUNICATIONS & WORKING RELATIONSHIPS:InternalRegular work-related contact with the Vice President, Project Services and with team members on matters related to Project QA/QC activities.\nRegular contact with other divisions in the DM&T Directorate as required.  \nRegular contact with other ADNOC Directorates as required.ExternalRegular Contacts with management and project teams of overseas and national investors, customers, suppliers and joint venture partners in discussions, negotiations and at Board meetings.\nRegular contacts with ADNOC and Abu Dhabi subsidiaries/ventures and partners etc. and with technical contractors, project and business consultants and outsourcing service providers.\nRegular contact with consultants/suppliers on matters related to acquisition of services.\nOccasional contact with Government organisations and entities such as Abu Dhabi Executive Council, Ministry of Energy, Department of Economic Development, Abu Dhabi Investment Authorities and Gulf Cooperation Council, etc.QUALIFICATIONS, EXPERIENCE, KNOWLEDGE & SKILLS:Minimum QualificationBachelor’s Degree in Mechanical Engineering / Science or relevant disciplines with supporting experience. Master’s degree is preferreJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}