{"Job ID": "69867457", "Description": "Associate Director, Priority Clients-(2300017172)Job:Retail BankingPrimary Location:Africa & Middle East-United Arab Emirates-DubaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 10:14:26 AMUnposting Date:OngoingResponsibilitiesStrategyStrategies for Revenue generation and business development\nBusiness objectives and goals\nDrive the Digital Agenda BusinessAcquisition & Sales ManagementGenerate new business to achieve defined targets in terms of no. of customers, volumes and revenue.\nAchieve the Targets set in terms of product mix, active/ passive ratio, liability targets, no. of transactions.\nInduction of all (NTB) new customers brought in by the Branches & Direct Sales team. \nAchieve “best in class” productivity in order to maximize the efficacy of the sales process. \nAchieve the budgeted cross sell targets, consistency and penetration.\nAggressive Sales call plans to acquire large prospective customers through referrals.\nEnsure coverage of customer base in accordance with the approved contact plans.\nUpdate & maintain all Sales MIS (Calls, Prospects, Attritions, Business done, etc.)\nMaintain and update customer information on C Manager. Accurate and timely generation of reports.\nActivation of dormant accounts.\nConstantly updated product and process knowledge by successfully attending Tests/ Quizzes/ Certifications.Customer Relationship BuildingBuild and deepen relationships with existing Priority Customers to achieve increase in share of wallet and revenues.\nEffectively meeting customer expectations and handling/ reduction of customer complaints.\nProvide professional customer service to achieve a high percentage of customer satisfaction and retention.\nManage the portfolio to de-risk against attrition and achieve stability of book.\nHave complete knowledge of the customer base in terms of the profile, demographics & psychographics and assets in the Bank and in other places.\nServe as the one-point contact to the High Net Worth customers of the BankProcessesEnsure compliance of laid down process and procedures.\nFacilitate and Implement work process improvements.\nTo ensure compliance with Global Process Standards on Customer Data Confidentiality.People & TalentLead through example and build the appropriate culture and values.Set appropriate tone and expectations from their team and work in collaboration with risk and control partners.\nEnsure the provision of ongoing training and development of people, and ensure that holders of all critical functions are suitably skilled and qualified for their roles ensuring that they have effective supervision in place to mitigate any risks.\nEmploy, engage and retain high quality people, with succession planning for critical roles.\nResponsibility to review team structure/capacity plans.\nSet and monitor job descriptions and objectives for direct reports and provide feedback and rewards in line with their performance against those responsibilities and objectives.Risk ManagementEnsure KYC/AML updates, proper zero error documentation.\nUpdating the C – Manager, adhering to the Contact Management Plan.\nEnsure full awareness of all policies and procedures issued in relation to money laundering prevention and KYC.\nEnsure compliance with the above policies on an ongoing basis and reported any suspicious transaction immediately to the supervising officer.\nEnsure full awareness of all policies relating to operational risk, sales processes, anti-misselling, etc and comply with the same.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}