{"Job ID": "69866491", "Description": "Apply now Job no: 4087199\nLocation: Oman\n18th November DTStarbucksFrom the beginning, Starbucks set out to be a different kind of company. One that not only celebrates coffee and the rich tradition, but that also brings a feeling of connection. Starbucks coffeehouses have become a beacon for coffee lovers everywhere because they know they can count on genuine service, an inviting atmosphere and a superb cup of expertly roasted and richly brewed coffee every time. It’s not unusual to see people coming to Starbucks to chat, meet up or even work. Starbucks is a neighborhood gathering place, a part of the daily routine – and we couldn’t be happier about it. Get to know us and you’ll see: we are so much more than what we brew. Starbucks prides itself on its people, or ‘partners’ as we call them. We strive to develop each partner to achieve their career goals, whether this is to become a district manager, Coffee Master or work within one of our Head Office functions.The Role:Our Baristas provide customers with freshly made drinks and food items in a fast-paced retail environment. High levels of customer service and the ability to work quickly and accurately are key to this role.Qualifications & Requirements:You will have/be:- 2 years minimum experience in a high-volume, high energy environment.- An excellent command of English.- A high standard of personal presentation and hygiene.- Lively and energetic personality.- Customer focused.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arabian Standard Time\nApplication close: 13 Oct 2023 Arabian Standard TimeBack to search results Apply now Refer a friendJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Oman", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}