{
    "Job ID": "69868365",
    "Description": "Who we are and what we doDeel is a global team that helps businesses hire anyone, anywhere, easily. Deel consists of more than two thousand self-driven individuals spanning over 100 countries. Our unified yet diverse culture keeps us continually learning and innovating the Deel platform and our products for customers.Companies should be able to hire the best talent anywhere in the world, so we are building the best platform to make that a reality. Our market-leading technology, expertise, and global team are crucial to the success of Deel’s platform. We deliver the best products and platform features in our space, enabling millions of jobs worldwide and connecting the global workforce with the best companies and opportunities.Why should you be part of Deel's success story?A 30-mile hiring radius should no longer dictate how companies hire because great talent lives everywhere. Deel sees a world without hiring borders and endless talent that pairs perfect candidates with great companies.We offer global teams all the tools they need to hire, onboard, manage, pay, and scale at full speed. We aim to foster a diverse global economy by building a generational platform that seamlessly connects companies with talent worldwide.After our successful Series D in 2021, we raised another $50M last year, doubling our valuation to $12B.There’s never been a more exciting time to join Deel — the market leader in international payroll and compliance.DutiesBeing our in house HR expert for your country, and handling all complex people related matters as they may relate to the EOR employee lifecycle at Deel\n\nOwning and drive EOR employee lifecycle: onboarding/off-boarding, orientation, employee support, performance management, payroll, benefits\n\nProviding a high-level of support to our EOR employees, being the first point of contact for any HR related queries\n\nAdmin support: generation of reports, employment verification letters, HRIS administration\n\nProviding a high touch local experience where required, and helping the product and operations team create systems that can scale with DeelRequirements5 to 8 years of International HR professional experience in a high-volume and fast paced environment\n\nLocal HR qualifications and certifications are a plusStrong analytical skills: identify, scope and resolve complex and sensitive HR issues\n\nData driven: you challenge status quo and strive to improve response times and employee experience\n\nExperience using JIRA, Zendesk, Intercom or other ticketing tools is a plusTotal RewardsOur workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all. At Deel, you’ll enjoy:Computer equipment applicable to your role\n\nStock grant opportunities\n\nAdditional perks and benefits based upon your employment status and country\n\nThe ability to choose where you work whether it be your home, the beach, or a WeWorkAt Deel, we're an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or other applicable legally protected characteristics.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}