{
    "Job ID": "69866743",
    "Description": "Work from home with Amazon Customer Service!Role: Digital Devices and Alexa Support Associate\nJob Type: 6 Month Contract\nLocation: Work from home in West Bengal, IndiaOur mission at Amazon is to be Earth’s most customer-centric company, and our award-winning Technical Support team is a key part of achieving that goal. Doing our best for our customers is where we get our energy, and that’s why you’ll find we approach things differently here. You won’t be asked to read from a script or learn dialogue by heart. Instead, we’ll provide you with the training to you need to investigate, problem solve, and guide customers towards a resolution. You’ll bring your unique personality to every customer conversation and deliver the exceptional technical support experience our customers love.Do you have an inquisitive mind and a passion for technology? Do you enjoy researching, problem-solving, and sharing your knowledge with others? If so, then read on to find out more about our Technical Support Associate role.What will you do as a Technical Support Associate?As an Amazon Technical Support Associate, you have a very clear purpose: to investigate and resolve queries regarding Amazon’s digital services and devices, such as Kindle, Echo and Fire TV (among others) and to provide outstanding technical support to our customers. You’ll be the first point of contact for our customers by answering their requests through phone, chat, and/or email, and use a variety of tools to analyze and troubleshoot issues in real-time, investigate solutions, and communicate effectively with customers. You will also be responsible for conducting escalations when necessary.  What qualifications do we need from you?Minimum age: 18 years old\nHave the right to work in India\nStrong communication skills in English (both written and oral fluency)\nProficient computer skills\nWillingness and ability to work in rotating shifts (i.e. early, late, overnight, weekend, and overtime as required)\nYou'll need a quiet, distraction free work space (dedicated office space with a desk and chair)\nFrom a technical perspective, a minimum 20 Mbps broadband connection speed using a hard-wire ethernet internet connection (no WIFI).What strengths will you bring?Inquisitive, articulate, and solution-oriented\nLogical and analytical thinking\nFriendly and customer-focused in every situation\nAbility to learn quickly and embrace change\nComfortable multi-tasking in a high-energy environment.What benefits will you receive?Medical insurance\nPension plan\nInternet allowance\nLifestyle benefits and retail discounts through our Amazon Extras program\nExpert training and ongoing opportunities to learn more and develop your skillsIf this role sounds like it’s for you, then click on the link below to start the application process!You’ll need to allow 3 – 4 hours to complete the full application, including assessments which will evaluate your suitability for the role. We recommend using a laptop/desktop computer in order to get the best experience. You will have the option to save your application between each stage of the application process and return to it if necessary, but we strongly advise you to complete the process in one sitting where possible.If successful, we will contact you about next steps!Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}