{
    "Job ID": "69867970",
    "Description": "The global leader in public transport infrastructure, SYSTRA has specialized in the mass transit and rail market since 1957. The main shareholders of SYSTRA are SNCF and RATP. Its ambition is to serve emerging needs for collective and sustainable mobility throughout the world. With a presence in 80 countries, SYSTRA manages over 3,000 projects for high-speed systems, traditional rail lines, metros and tramways throughout the world. In India, SYSTRA is an international consulting and engineering company operating in the fields of Metros, High Speed Rail, Railways, Roads, Buildings, Urban planning, and Water & Environment for public and private organizations. Our engineers work with passion to deliver the most reliable, cost-effective and made-to measures solutions allowing end users to move seamlessly. SYSTRA’s unique expertise is backed with a reputation built through technical excellence delivered on projects. Thanks to our know-how of our employees spread across India, we are present at all stages from upstream studies to operation and maintenance. We provide a comprehensive solution to manage all kinds of missions: Detailed Design Consultant, Project Management, Independent checking services. SYSTRA has a long-proven experience nationally & overseas in Water & Environment field. Our complete range of services consents to have a comprehensive understanding, of each sector’s essentials, and to constantly improve the project experience. We have worked on Detailed Engineering Design for Infrastructure Utilities Services in Activation Area Dholera Special Investment Region. Scope included Design of Integrated Infrastructure Design (Potable & Recycled WS, UGS, Industrial Effluent, SWD, Electric Lines and Roads), as well as Technical Advice during execution. Job Profile:Bachelor’s degree or equivalent in Civil or Railway Engineering.\n15+ years’ experience of railway track alignment design, yard design  etc  and or design supervision is required .\nExcellent  knowledge of railway track alignment and construction and maintenance methods.\nProficient in Autodesk AutoCad Civil 3D, MS Office Suite, Bentley Deisgn Software.\n Solid verbal and written presentation skills. Outstanding organizational abilities and technical mindset. Fluent English; good command of technical terms.\nHigh ethical standards, honesty, and impeccable reputation.\nResilient to coping with conflicting demands, able to prioritize duties and work under pressure.\nAble to benchmark and apply best practices of large infrastructure projects. Strives for continuous improvement and precision in every detail.We commit to put people who join us at the heart of improving transportation and urban infrastructure efficiency. As we are growing, this is time to be a part of this challenging adventure.It’s not a job - it’s a career!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}