{"Job ID": "69866724", "Description": "As a Sales Associate- Partner Led Sales with Amazon Seller Services India, you will have the exciting opportunity to help shape and deliver on new initiatives for Amazon Seller Services in India. This role will be a combination of business development, involving forming alliances with 3P partners and business program cum account management, involving creation of program plans and driving the execution of the tasks identified in the plan.\nYou cultivate these existing partnerships to make sure they can take full advantage of Amazon’s suite of offerings for sellers. You must possess strong relationship-building skills and be able to explore win-win opportunities with partners in order to best represent our products and programs.\nYou will be responsible for developing and managing both internal and external relationships with the goal of growing the Seller Services business. You should be comfortable with balancing multiple priorities, developing and executing plans, working with internal and external partners, as well as strategically analyzing data to drive inputs.\nTo be successful in this role you must have superior communication, presentation and organizational skills. Operating in a fast-moving and sometimes ambiguous environment, you will work autonomously and take full control and responsibility for achieving business objectives. This role provides opportunities to develop original ideas, approaches, and solutions in a competitive and ever changing business climate.\n\nRole and Responsibilities:\n\nBusiness Development: Working in a dynamic business development environment, you will be responsible for managing & scaling assigned partners profitably and ensure seller success. The ideal candidate will possess a demonstrated ability to think strategically about business, with the ability to build and convey compelling value propositions to partners of all sizes.\n· Develop and manage processes with both internal and external stakeholders to help make the program a more meaningful part of Amazon business.\n· Track, monitor and improve performance of key partners to measure and manage their output efficiency.\n\nProgram cum Account Management: You will be responsible for creating and executing a formal strategy with new and existing partners.\n· Implement processes for managing, engaging, and expanding partnerships.\n· Forecast and report business growth and other key metrics, and track progress toward forecasts.\nWe are open to hiring candidates to work out of one of the following locations:\nJaipur, RJ, IND\n- 2+ years of sales experience\n- Bachelor's degree\n- Post graduate (MBA)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jaipur, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}