{
    "Job ID": "69868561",
    "Description": "Who are we and what we stand for?When you work at Schneider Electric you work at a company that is passionate about its people. Our people vision says, Great people make Schneider Electric a great company. We are proud to promote purpose, diversity, inclusion, learning and work-life integration – we’re a great place to work and we are continually striving to be the best place to work!Your role in a nutshellField Sales for planning customer visits to answer their customers\nHelp Disk for answering customer requests regarding Presales functions (configuration & selection)\nHelp Disk for Technical support\nHelp disk for product availability\nVSD Service eng. For Application notes\nEnd users for Application Configuration & Trainings\nChannels For Application Configuration & Closing dealsJob responsibilitiesSupport Field sales, Channel managers, Channels to close VSD Deals with End Users\nSpecify Schneider VSD Products in Customers specification & Convert Competition specifications to Schneider Products\nAnswer customer requests asking the Help desk for Solutions\nExternal VSD Advanced Trainings (Customer Workshops)\nDevelop VSD Application Notes\nReport Success stories to the Product Marketing\nPrepare quotations for Customers with VSD Solutions QualificationsBAC + 5 (Electrotechnique / électronique) Technical education and/or engineering degree preferableProfessional experienceHas relevant experience on building applications in SE's system platforms and knows the possibilities and limitations of them.Minimum to enter in the positionTechnical engineering/application design or validation background\nPreferable experience with Schneider Electric TechnologyTechnical and Managerial skillsB.SC in Electrical Engineering.\nSchneider products range knowledge.\nExcellent knowledge of Arabic and English; French is an asset.\nAnalytical thinking, creative, good communicator, Presentation skills\nProblems solving capacity.\nCustomer service oriented.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Algiers, Algeria",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}