{"Job ID": "69865867", "Description": "JOB DESCRIPTION:As a Professional Sales Manager, you will be responsible for the development and performance of all sales strategies in assigned market. Further, you will drive primary sales, secondary sales and ensuring a brand presence in defined markets. You will supervise/manage the distributor network to achieve desired sales objectives thereby ensuring achievement of financial and ethical objectives of the division as per the business strategy.To achieve this you will have the authority to develop your customer management plan, approve expiry products issue credit note for distributors under your control, recommending appointment and credit limits of distributors, develop, execute & plan your resource utilization and participate in Strategy Execution review meetings to ensure alignment. You have a very important role to play in the Division's success.Roles and Responsibilities in detailArea Business Planning:• Plan for the monthly and quarterly business.• Plan for Trade activation business and overall sales• Plan demand generation and fulfillment• Monitor actual Sales and mid-course corrections and inputs to reduce variance against expectations• Prescription audit for Abbott brands and other competitors brands• To create and update the customer list having a specified number of doctors/chemists (Trade) as per the therapy/product requirement and maintain the same in physical/electronic format.• Identifying potential town and appointing distributor and customers (trade) in line with the business philosophy Business generation & development:• Achieve monthly, quarterly, half-yearly and yearly Sales target by promoting companies product ethically to customers as per the business plan• Having science base discussion with Doctor and chemist for promotion of the product in the clinic and at chemist place• To carry out activations across trade and clinics for brand visibility• To plan and conduct merchandising and sampling activity as per Division strategy.• Facilitate the process of successful new product/products launch in the territory by undertaking correct identification and targeting customers for the new product, meet them at predetermined intervals, effective in clinic/trade promotion and feedback to the company• Execute the customer management plan to ensure that all the customers are covered as per the plan and meet minimum KPIs as follows:a. 100% coverage of Doctors.b. Customer Call average as per the customer management plan of the division/therapy.c. Market intelligence collection, retailer level inventory management calls as per the product profile and marketing strategy of the therapy/division.\n Brand Management:• Ensuring the visibility of Abbott brands on retailers outlet as a part of the brand promotion strategy• To plan and attend Retail meets, Market Blitz etc for sales growthThe base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}