{"Job ID": "69865892", "Description": "Overview Enterprise testing team requires a Automation expert resource to handle the testing activities and coordinate the testing resources required for the project, along with planning and preparing the necessary activities before testing execution, along with providing status reports for execution, defect, risk and issue management for the project. This person will also be responsible for the testing deliverables for the project, and overall governance for the project, partnering and offering the viable services that can be provided to guarantee a successful quality product deployment, by enabling consistent, cost effective, high quality targeted testing processes and services. Responsibilities • Supporting defining and evolving the test management service • Managing resources (contractor via a managed service contract) • Managing test management escalations from engagement and delivery leads. • Lead test execution and ensure deliverables meet schedule and quality • Managing tool usage optimization and reporting standards. • Align service with overall methodology changes / evolution over time. • Assist in ad hoc project work relative to test management. Qualifications Years of Experience: • Minimum 6+ years in IT testing • Minimum Bachelor’s degree is required. Computer Science or Information Systems is preferred. • Good experience working with testing tools (Selenium,CI/CD, Mobile testing tool) Teams, Testing knowledge, Sharepoint, Agile knowledge • Ability to work collaboratively across project teams. • Strong analytical skills • Requires fluent English communication skills including written, verbal, and presentation • Strong influencing, facilitating, and consulting skills in working with stakeholders Mandatory Tech skills: • Strong skills and High level of understanding desired in: • Directed Code reviews • Regression and patch runs (both Automation and manual) • Experience in Test specs and executed them as per requirement. • Implementation of Accessibility testing, API, Mobile Testing. • Designing standardized processes and protocols to continuously improve operational efficiency • Good experience working with Test Management tools • Agile Delivery, Build, & CI/CD, Test Plans • SeeTest: Automation Tool for Mobile Applications • Selenium: Automation Tool for Web Applications • Nice to have knowledge in Clarity, SAP, Salesforce, AppDynamics, ServiceNow & Splunk Mandatory Non Tech skills: • Demonstrates the desire and ability to learn new technology skills, business knowledge, and customer service capability through training, experimentation, and self-study. • Demonstrates ability to effectively communicate with all levels of the organization. • Provides outstanding customer service skills to direct and indirect customers. • Ability to track daily testing execution and work through risks/issues to ensure timely delivery.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}