{
    "Job ID": "69869978",
    "Description": "Job DescriptionService ManagementMaintain high performing service support functions including an IT Service Desk, Desktop Support and VIP Support. Own the Incident, Request, Change and Escalation processes, ensuring high levels of performance in these processes\nAccurate reporting and establishing service improvement activities when require\nAs owner of the escalation process, the Service Delivery Manager will take ownership of major incidents to ensure coordination of parties involved, effective communication to stakeholders and post incident resolution review,\nMonitor, control and support service delivery, ensuring systems, methodologies and procedures are in place and followed\nChampion Service and Support in clients and develop a strong understanding of projects impacting your service area and ensuring service impact is minimized and communicated and agreed with stakeholder\nAccountability for the quality of service and performance, ensuring future growth projections within clients BAU environment and client projects are understood and factored into capacity planning for all associated systems and resource\nDetailed knowledge of the client contracts and obligations (SOW), understanding the contractual risks and opportunities , and using them to your advantage.\nEnsure contract end dates and renewals are effectively managedFinancial managementYear on year increase of the income on the SOW’s you are looking after\nCost management and identification of possible cost savings opportunities YOY\nManage and maintain forecast and budgets for your clients.\nManage and maintain PO’s ensuring valid PO’s with available funds are available at all times\nReduce partner spend by x % year on year, can we do it ourselves approach collaborate\nReduce backup cost by continuously looking at:\nCan we hire ourselves?\nWhat other business do we have in the region?\nSpeak to the other PM’s asking them if they can help collaborate with some of their staff\nFind other cost saving opportunities wherever possible, whilst maintaining or increasing the quality.CommunicationManage communication between the engineers and client as well as the engineers\nDrive internal and third-party service review meetings covering performance, service improvements, quality and processMeeting SupportDeliver excellent Presentation and Audio-Visual support, ensure meeting room technology is maintained to high standards and routinely checked to ensure high levels of availability\nEnsure that training services are in place to educate staff on how to use meeting room and collaboration technology effectivelyTechnicalLead the Management team to continually improve the desktop computing environment\nManage the desktop computing environment to ensure that laptops, PC’s and other access devices are built and maintained to high standards of performance and security\nEnsure that patching and anti-virus updates are carried out promptly and effective\nWork with the Technical Design team evolve standards for hardware, software and security in the desktop environmentPerformance & QualityMake recommendations for Service Improvement Plans and ensure actions are followed through to completion in a timely manner\nWork with internal and third-party teams to ensure actions are implemented and completed to maintain and improve service\nProvide regular and accurate management reporting on Service performance\nEffectively deliver/manage Staff Management including recruitment, mentoring, training, target setting and performance assessmentBe an ambassador for IT, working across the business to provide effective communication   on matters and build relationships with other teams to ensure effective dialogue between departmentsRequirements Essential Core CompetenciesExcellent leadership and people management skills.\nExcellent written and verbal communication skills.\nWillingness to support and mentor junior staff\nExcellent customer-facing/customer service skill\nAble to work under pressure and meet deadline\nAble to demonstrate a high degree of flexibility including shift and out of hours working. \nExcellent organizational skill \nAble to manage sensitive and sometimes confidential information and able to take responsibility\nSelf-motivation and able to take responsibility to manage and prioritise and tasks and time efficiently\nAble to manage and prioritise and tasks and time efficient\nAble to demonstrate initiative and a proactive approach to daily tasksJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}