{
    "Job ID": "69867207",
    "Description": "Job description: Are you interested in being part of rapidly expanding Amazon initiative to redefine how we deliver packages to Amazon customers and take your skills and career to the next level? Join the Last Mile Analytics and Quality (LMAQ) team to raise the bar for our delivery channels and redefines Amazon’s global last mile delivery network.\nWe are seeking a passionate, experienced operations manager to lead our Voice of Customers focused programs in Bangalore, India.\nKey job responsibilities\nWe are seeking a passionate, experienced operations manager to lead our Voice of Customer focused programs in Bangalore, India. The incumbent will be primarily responsible for:\n· Devising operational and business goals for the function that focus on end-customer impact, productivity, accuracy, and speed to market.\n· Establishing measurement, reporting and process excellence indicators for effective accomplishment of goals in core processes. Managing metric performance tactically and strategically.\n· Setting appropriate operational and people goals for the team at all levels and holding them accountable; Owning processes, staffing, metrics and business updates for the function.\n· Thinking long-term and establishing scalable/modular processes for easy adaptation to business scope changes. Managing complex problems, decisions, and escalations. Mitigating long-term risks. Finding a path forward in difficult situations. Making trade-offs: short vs. long-term needs.\n· Proactively identifying tool and system requirements that reduce operational defects; Ensuring impact- and benefit-driven prioritization of process excellence projects.\n· Working with inter-functional teams to streamline processes. Identifying and driving process excellence along with Program and Tech teams.\nA day in the life\nThe ideal candidate will be organized, detail-oriented, and will clearly communicate progress at the needed frequency. In their day to day modus operandi, they will actively participate and contribute to customer- and driver-focused projects by proposing enhancements to tools and working on continuous improvement of business process that address key team pain-points to set them up for success. The person will be seen as a self-starter, who shall set vision, manage teams and set clear goals for team performance management.\nAbout the team\nAre you interested in being part of an intriguing Amazon initiative to redefine the way customer delivery takes place and to delight our customers and take your skills and career to the next level? Join the Last Mile Analytics and Quality (LMAQ) team where we obsess over Customer and Driver experience and maintain a high bar for Amazon’s global last mile delivery network.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND | Hyderabad, TS, IND\n- Bachelor's degree or equivalent, or 3+ years of Amazon (blue badge/FTE) experience\n- 3+ years of employee and performance management experience\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- 7+ years of experience in operations management\n- 2+ years of performance metrics, process improvement or lean techniques experience\n- Knowledge of statistical process controls and projects in the domain will be a plusJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}