{"Job ID": "69866332", "Description": "Job Description:DXC's Digital Identity connects customers, partners, employees and devices to data and digital services. Digital Identity provides measures to reduce risk and increase the security of digital assets. This directly benefits organizations by reducing the risk to organizational value and for individuals to financial loss and personal injury. Organizations generate more value and open new markets with Digital Identity services. Users get a better customer experience with improved data security and privacy protection.We are one of the few companies in the world that can provide end-to-end security solutions from expert advisory services to fully managed security operations. We can implement an integrated, enterprise-wide approach to protecting your enterprise, systems, endpoints, users, processes, applications and data effectively. We provide greater choices in implementing digital technologies, including cloud, mobility and advanced analytics.The Centrify PAM DevOps is responsible for the ongoing support and service maturity of the IAM program. Must have experience with Centrify Privileged Access Management and/or an equivalent tool like Thycotic, CyberArk, BeyondTrust PAM etc. maintaining any custom code/config and the following capabilities/functions within the platform and IAM service as a whole.Responsibilites.Incident/ Escalated Incident ManagementAgree with Customer resolution of incidents\nProcess improvement\nAccept transfers /elevations\nResolve escalated Incidents\nProcess performance management. Operations ManagementProactive Monitoring- Capacity & Performance Track service metric data\nHandle Request for Change activity\nHandle preventive maintenanceProblem ManagementAnalyze incident trends\nVerify/Control known errors and resolve problem cases\nCreate and Maintain problem Management Documentation as required (Root causes and corrective actions)\nInvestigate Change Management activities\nIdentify, verify, and elevate “New” problems\nCompletion of major Problem reviewsChange ManagementAssess impact, benefits and risk of Changes\nManagement & Co-ordination of Change Implementation\nCreate and maintain Change Mgt documentation as required\nMonitoring and Reporting on Change Implementation\nClosing and Reviewing the Change RequestsPersonal skills and qualities:Good communication skills and customer centric focus - ability to communicate clearly and in a timely manner with all customers, partners and users, internal and external\nGood analytical and troubleshooting skills\nTeam player. Ability to collaborate and cooperate with members of team and members of other teams\nUnderstanding of 24x7 mission critical enterprise computing environments and the impact of service disruption on a company’s bottom line\nAbility to pro-actively learn new technology, processes and other skills\nAble to pro-actively search for solutions from knowledge bases, support documentation and other information.\nKeen interest in continual learning and professional development\nFlexible, self-motivated with the ability to work under pressure in an international and culturally diverse organizationDirectory Integrations & Services\nDelegated Authentication\nMultifactor Authentication / Adaptive MFA\nRisk & Behavior-based authentication\nTenant Customizations\nCentrify PAM Command Line\nPython & PowerShell\nAutomated Discovery of systems & privileged accounts\nAutomated Password Rotation & Reconciliation\nSystems Connection Management\nPrivileged Session Management & Recording\nAuditing & Monitoring\nIAM Standards like Header-Based/Kerberos/SAML2.0/OpenID-Connect/OAuth2.0/FIDO2\nPAM Integration with CI/CD Tools such as Jenkins/Terraform/GitHub/SonarQube etc.\nParticipate in and/or lead user acceptance testing and bug-related engineering efforts.Design and Develop IAM solutions based on Centrify PAM platform\nHands-on experience with Centrify Privileged Access Management - Experience in installation and configurations of Connectors, Directory Integrations, Radius endpoints, OAuth tokens etc.\nDevelop and maintain privileged user onboarding workflows, password check in/out, rotation & reconciliation\nMust have a thorough understanding and work experience for Single Sign-On, Access management, Identity Federation, Multi-factor authentication (MFA), Risk-based authentication (RBA).\nMust have a thorough understanding and work experience for capabilities such as SSH, RDP, SMB, Telnet etc. & Header based Single Sign On, SAML, OIDC, OAuth & Radius, etc.\nHands-On experience with Centrify UI customization, writing PowerShell or python scripts to automatically discover systems, accounts for privileged access mgmt. & also integrate with target systems like CI/CD pipeline or target applications\nExperience with PAM self-service registration integration with Identity management system like SailPoint IdentityIQ.\nRESTful & SCIM API development and maintenance for exposing core PAM functions\nDevelop and maintain privileged access provisioning and related services\nSupport integration with Active Directory and other Identity Stores\nGood knowledge of directory servers and LDAP protocol technologies (Active Directory)\nExperience with the operating system (Unix/Linux/Windows) commands, utilities & scripting\nGood understanding of TCP/IP and RESTful API experience with infrastructure, network, database, or security troubleshooting & remediation experience with scripting with PowerShell or GO, Python, Etc.\nExperience with DevOps tools such as Jenkins, Artifactory, GitHub, SonarQube, Terraform, Bitbucket, Dockers, Ansible, Kubernetes, etc.\nProvide support for all design, implementation, and maintenance activities related to Centrify PAM\nImplement monitoring of PAM application/service components using tools like Dynatrace etc.Centrify Certified Professional (CCP) or Centrify Certified Engineer (CCE).\nExperience with other PAM solutions, such as Cyberark, BeyondTrust, or CA PAM.\nExperience with scripting languages, such as PowerShell or Python.Note: The job description provided here is a general outline of the typical responsibilities and requirements for the CyberArk Privileged Access Manager role. Actual job descriptions may vary depending on the organization and specific job requirements..Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}