{
    "Job ID": "69868295",
    "Description": "An exciting opportunity to work within a vibrant and dynamic International School in Tashkent, Uzbekistan, which boasts both the International Baccalaureate and local educational systems.About Oxbridge International School\nWe have 200+ employees so far working with us and 30+ of them are expats. There is a strong commitment to the on-going professional training of all staff and for providing leadership development at all levels. You can find videos of the school on Youtube and get the idea of the school, facilities and the team. Brilliant opportunity to save money, as the cost of living in Tashkent is very cheap.Youtube ChannelInstagramFacebookVery competitive package is provided.Main duties and responsibilities of the job:\nCollaboratively planning, preparing and delivering differentiated lessons\nAssessing and reporting student progress\nResponsible for student welfare and pastoral development of the class group\nMaintaining the learning environment of the classroom and managing resources\nOrganizing and taking part in school events, trips, and extra-curricular activities\nLine management of the teaching assistantThe ideal candidate will have:\nAt least Bachelor's degree\nPrevious experience\nThe ability to differentiate and deliver conceptual, engaging and inquiry-based lessons\nFamiliarity and experience with collaborative planning and a team-teaching approachA wonderful opportunity to discover Central Asia and work in one of the most dynamic schools of Tashkent, Uzbekistan. We have over 250 people working together to provide high quality education to the students and over 40 expats.Please note that the job requires relocation!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}