{
    "Job ID": "69866001",
    "Description": "The Loan Processing Team supports the JPMorgan Private Banking Mortgage Origination business. The team is responsible for processing of mortgages along with simultaneous HELOCs. During this process, the file will exit from the Prelim team and be appropriately assigned out to Processor. The Processor will then complete the entire process; inclusive of engagement with the Underwriting, Rate Lock, Closing, Quality and Mortgage Advisory teams as necessary. The goal is to ensure the complete financial package is received; the underwriting decision has been made; handle any appropriate inter-process changes from the Client or MA; obtain all required third party and vendor information; obtain a clear to close from quality and remediate all QC findings; and ultimately submit to closing according to Federal and State regulatory requirements. Processing Specialist will be responsible to communicate with multiple internal and external groups to resolve any issues that may arise. The role is not client facing, although communication to 3rd parties can occur while clients are signing and messages are relayed.Job Responsibilities:Achieve daily production targets on a consistent basis and turnaround priority reviews within the stipulated timelines\nMaintain high standards and follow all process controls with no lapses\nHandle issues and escalate to management if required\nInteract with different stakeholder to resolve process issues and play key role in adding process controls\nSuggest process enhancements, possible automations for better controls, perform periodic risk and controls analysis with the team for process risk valuation\nProficient in organizing, priority setting, and pipeline managementRequired Qualifications, skills and capabilities:At least Bachelor’s degree \nWilling to work in North America schedules\nExperience in Loan Processing process is preferred\n2+ years of experience in US mortgage loan originations \nExperience in Loan Processing process is preferred\nExcellent written and verbal communication skills to communicate with internal and external parties to resolve issues\nExpertise in Mortgage concepts; Working knowledge of major US Mortgage Regulations\nDetailed understanding of all stages of mortgage originations life cycle\nProficiency in analyzing documents like Title, Home Owners Insurance/Flood, Appraisal, etc.\nMust have had exposure to production management, work allocation, prioritization, exception handling, and process documentation\nProficient in Microsoft Office applications (Word, Excel, and Outlook)JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}