{
    "Job ID": "69869995",
    "Description": "DescriptionINTECH Automation Intelligence is looking for an energized and capable professional for the role of LV & MV E-House Project Manager. The primary objective of the Project Manager is to ensure that the projects are completed as per scope of work, within time, budget, and quality constraints.Project Manager is responsible for planning, executing, monitoring, controlling, and closing projects. It is a specialized role that focuses on the management of multiple internal & external interfaces, sub-contractor management, and Contract & risk management.Responsibilities:Completely responsible for the Profit and Loss of the project\nEnsure contractual compliance for scope, budget, and schedule in project delivery while maintaining required quality standards and producing a strong customer experience\nPrepare project budget. Manage cost through creative methodologies in execution and project procurement.\nReview and approval of the Project plan and schedule.\nDevelop a Project execution plan listing implementation strategy for significant scope components as well as indicating Project organization, roles, and responsibilities of the project team.\nOrganize project execution team for projects\nCoordinate with Engineering, Production, Procurement, and QA-QC to finalize project deliverables and for availability of materials, manpower, inspection, and fabrication activities as per schedule/plan.\nManage coordination with client and their engineering consultant for approval of basic/detailed engineering documents, and resolution of technical queries.\nMeasure project performance using appropriate systems, tools, and techniques as adopted by INTECH.\nTrack and monitor scope change with reference to the scope of work.\nProject review: organize and conduct internal and external project review meetings and monitor action lists.\nProject reporting: Circulate weekly/Monthly Project reports and appraise management on Project status and escalate major issues if any.\nManage for Customer / End User’s complaints and feedback\nPrepare project plan/schedule using tools and processes adopted by INTECH and manage it during the execution of the project.\nReport and escalate gaps, anomalies, and exceptions to the INTECH management and customer/End User/project stakeholders as needed\nTravel to project sites, other INTECH offices, and customers' offices (local/international) as per business requirements and/or when management advises.\nManage a program to review project execution framework and develop/update processes as required\nProvide active support supply chain to identify and qualify new subcontractors related to E-House\nTarget repeat business from existing customers without a bidding process through good business relationships and quality of work\nTechnical Account Management of assigned customers in the territory/region\nOn-demand support to the sales team in business development and pre-award activities with the consent of the project portfolio managerRequirementsBachelor’s/master’s degree in engineering field\n12+ years of work experience in international projects & engineering with a minimum 3-4 years experience in handling E-House projects\nInterpersonal and People Skills (multicultural)\nFluent English Communication\nDecision-Making Skills\nCan-Do & Positive Attitude\nTeam WorkerAdditional Requirements:Experience in structural design, HVAC design, and F&G / FSS design is preferred.\nStrong understanding of the E-House Fabrication & Integration\nShall be able to review & evaluate the sub-contractor construction plans and identify the task dependencies & constraints, possible optimizations & resource allocations.\nShall have experience of handling & managing sub-contractor\nShall be well versed in drafting contracts & Scope of Works\nShall have a good understanding of technical & commercial risks\nShall have an understanding of project-specific quality standards & requirements.\nShall be able to multi-task and manage multiple projects simultaneously\nShall have strong interpersonal skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}