{"Job ID": "69869557", "Description": "About the Role:Our ambition is to be the definitive food company, feeding people three times a day with great food from the World's best-loved restaurants, all with an unparalleled level of convenience. We work with thousands of restaurants worldwide allowing them to open up a new revenue stream and reach new customers. If you want to make an impact on millions of users by solving some of the biggest technical challenges at great scale, come on board and join the ride.Enterprise Technology to support this is working to become the trusted partner, providing a fantastic working environment for all employees. To do that we are undergoing a transformation, building Enterprise level capabilities in Service Management, Automation and creating a world class Employee Workplace.Working as a RPA Business Analyst, you will report to our RPA Engineering Manager and work with the Lead Business Analyst to help us on our journey to help grow the automation capability within Deliveroo. The position is based in our Hyderabad office.What You'll Be Doing:Partner with Business Process Owners to understand end-to-end processes and assess their suitability for automation.\nProduce comprehensive business analysis documents by eliciting processes, data, and requirements from stakeholders. Give specific attention to analysing 'As-Is' and 'To-Be' processes, conducting return on investment calculations, and coordinating User Acceptance Testing (UAT).\nManage stakeholders up to the Director level, comprehending requirements, business objectives, prioritisation, and alignment of automation initiatives with organisational goals.\nFacilitate workshops and presentations to enhance awareness and foster adoption of automation within the organisation. Ensure a clear understanding of the benefits, positive impact, and best practices related to automation.\nUtilise data analysis techniques to identify patterns, trends, and anomalies in business processes and data. Offer actionable insights to lead process optimisation and inform automation decision-making.\nOversee the UAT testing cycle and related documentation. Collaborate with operational teams to provide UAT education, including creating test scenarios and sample data, while coordinating testing activities among multiple technical and operational teams.\nManage small projects across a multifaceted organisation, bridging the gap between technical and non-technical teams. Working with stakeholders to define scope, resource management and timelines.Requirements:Knowledge of RPA technologies and good practices within process automation.\n4+ years of experience within a Business Analyst role using elicitation techniques to document and gather requirements.\nStrong interpersonal skills to manage stakeholders up to the Director level both with technical and non-technical backgrounds.\nCritical thinking and analytical skills to extract insights from data, identify optimization opportunities, and make data-driven recommendations\nExperience of managing small and medium sized projects\nExperience of facilitation and presentation on a small and large-scale to both virtual and live audiences.We're also interested in…Experience working with automation software (e.g UiPath, ServiceNow Automation Engine, Blue Prism)\nExperience working with Data Visualisation tools (e.g Power BI, Looker, Tableau)\nUnderstanding of Lean principles, process mining and re-engineering\nRelevant higher education and professional certifications\nBusiness success with Agile approaches, e.g Kanban, MVP, fast feedbackWorkplace &amp; DiversityAt Deliveroo we know that people are the heart of the business and we prioritise their welfare. We offer multiple great benefits in areas including health, family, finance, community, convenience, growth, time away and relocation.We believe a great workplace is one that represents the world we live in and how beautifully diverse it can be. That means we have no judgement when it comes to any one of the things that make you who you are - your gender, race, sexuality, religion or a secret aversion to coriander. All you need is a desire to be part of one of the fastest growing startups around.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}