{"Job ID": "69867039", "Description": "At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\nWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\nKey job responsibilities\nKey job responsibilities: Defining , building and executing the delivery process from delivery station to customer address\nEnsure enough bandwidth in territorial delivery team to ensure peak time delivery management\nEngage closely with the delivery team including associates, developing and maintaining a highly motivated and performance driven team.\nContinuously improve the delivery process and attain a sustained level of delivery performance, through process and training improvements. Initiates improvements to enhance quality standards, reduce waste, and eliminate unnecessary work.\nAnalysis of the data reports to identify performance bottlenecks and improve performance\nImplement the formal process control and process improvement mechanisms.\nEssential Skills\nStrong leadership capabilities and people management skills - Ability to work under pressure situations\nAbility to work in ambiguous situations\nGood communication skills. Ability to communicate and explain to individuals & the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives.\nListening skills: Gains input and commitment from all involved in delivering their specific part.\nStrong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\nHigh Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\nAnalytical Skills: Effectively analyze and interpret information, identifying & validating the key facts, including reviewing alternatives to determine advantages and associated risks.\nBasic qualifications\nGraduation. MBA desirable.\nPeople management experience. Experience in handling team is highly desirable.\nExperience in handling live operation preferred (wherein decisions have to be taken on the spot and actions needs to be initiated right away)\nKnowledge of city topography and road network is an added advantage\nPreferred qualifications:\nManagement experience in delivery operations is desirable.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- Bachelor's degree\n- Speak, write, and read fluently in English\n- Experience with Microsoft Office products and applications\n- 1+ years of manufacturing or customer-facing environment experienceJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}