{"Job ID": "69867001", "Description": "About BeamBeam is a tech start-up leveraging Generative AI and NLP to build AI Agents for business operations. Beam's generative agents help organisations to boost their productivity by automating repetitive tasks in seconds. Powered by LLMs, AI agents are easy to setup, seamlessly integrate with business applications and support teams where they need them most. We are on a mission to transform business practices by empowering organisations with artificial intelligence to increase efficiency, improve competitiveness, and scale operations globally.To learn more about us, please visit our website at https://beam.so/About the RoleWe are looking for a highly motivated (Jr.) Frontend Engineer to join our team in Karachi. As a Frontend Engineer, you will be expected to:Collaborate with cross-functional teams to develop and maintain responsive web applications.\nWrite clean, maintainable, and efficient code using JavaScript, TypeScript, and React.js to build interactive and dynamic user interfaces.\nImplement responsive web designs with HTML and CSS, ensuring a seamless user experience across different devices and browsers.\nUtilize state management tools like React Query and Redux toolkit for data management.\nCollaborate with UI/UX designers to ensure seamless integration of design concepts.\nImplement and maintain UI components using style components.\nContribute to the development and maintenance of our GitHub repositories.\nVersion control and collaboration using Git and GitHub.\nParticipate in code reviews and contribute to the improvement of development processes.\nStay up-to-date with the latest front-end development trends and best practices.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}