{
    "Job ID": "69868118",
    "Description": "General Information: Business Information: The Hitachi Energy Indian Operations Center (INOPC) is a competence center with around 1500 skilled engineers who focus on tendering, engineering, planning, procurement, functional system testing, installation supervision and commissioning. However, over the last decade, it has evolved to become the largest engineering hub. The India Operations Centre is a key aspect of the Power Grids business Power Up transformation program. The Hitachi Energy Indian Operations Center team at Chennai supports Hitachi Energy’s units in more than 40 countries across a wide portfolio of all the four business units in Power Grid business. To date, the team has executed engineering and commissioning for projects in more than 80 countries. Mission Statement: Computer Aided Design & Drafting (CAD/CAM/CAE) work focuses on the documentation, illustration, and digital modelling of engineering designs and processes including: Assessing engineering requirements and translating into technical blueprints, drawings, layouts, and simulation models using CAD/CAM/CAE software or applying standard CAD/CAM/CAE techniques to digitize, edit, and revise engineering drawings of components, parts, and assemblies. Customizing CAD/CAM/CAE software to model complex or unusual designs. Creating digital proto-types and conducting design simulations for purposes of verifying reliability/safety and optimizing engineering processes. Collaborating with product/manufacturing process engineers by recommending changes to component designs based on outcomes of digital proto-typing and design simulations. May provide materials lists and cost estimates An Experienced Professional (P2) applies practical knowledge of job area typically obtained through advanced education and work experience. May require the following proficiency: Works independently with general supervision. Problems faced are difficult but typically not complex. May influence others within the job area through explanation of facts, policies and practices. Your Responsibilities: Preparation of Substation layouts and section drawings preparation for budgetary offers / tenders / projects based on customer specification. Preparation of Earthing layouts, Lightning Protection drawings, cable routing drawings, Erection Key diagram, Control building layouts, Illumination drawings. Prepare Bill of material of Primary related quantities for tenders or projects based on requirement. Support the senior engineer with the inputs for all design calculations related to Primary & CAD Engineering Expertise in all AIS & GIS in design & drawings Basic understanding of all primary calculations, viz., Grounding system design, Lightning system design, Lighting system design Understanding of Technical data sheets of primary equipment. Basic Knowledge of primary equipment, such as circuit breakers, disconnectors, earthing switches, instrument transformers, power transformers, etc. Follow the QMS process and adherence to the same. Responsible for maintaining and updating the documentation for respective tenders and projects as per quality process. Your Background: Bachelor's Engineering /Diploma in Electrical 3-5 years of experience Proficiency in both spoken & written English language is required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}