{"Job ID": "69866144", "Description": "Business Entity:This role is in Cisco Supply Chain -> Global Manufacturing Operation -> Central Operations org. Procurement & Hub Ops team is responsible for Strategy and Operations of Cisco’s inbound component fulfillment models.Team manages all inbound component Hub types across the globe. Primary responsibility is to manage supply continuity for all PCBA and DF sites with optimal hub inventory and inventory driven costTeam collaborates closely with Network Strategy and Global Logistics team to design and maintain Hub strategy and footprint. Team also works with Service 14 on inventory policies and GSM on supplier strategy.Job responsibilities:Primary responsibility will be to enable and operate Cisco Strategic Hub – Comp/Assy Buy-Back program with focus on Buying from Suppliers or/and Contract Manufacturing Partners (CMs), Selling to CMs and Inventory Management. Procurement can be by Cisco or Third Party.Drive inventory balancing process between the manufacturing sites to mitigate shortage/excess.Procurement, Selling and Inventory Management\nbuy-back process\nBuy-back new buy & sell process.\nMaster data setup and CPN enablement for buy items\nCreate/Manage Sales Orders and ongoing SO management.\nSupporting inventory analysis of aging & excess inventories for ways to mitigate the risks·Create/Manage Purchase Orders and ongoing PO management.·Resolve any EDI/B2B failure message issueGeneral·Work with CMs, DFs to manage, track and expedite shipments as needed·Work with Cisco Finance, CMs, DFs to manage account payable (AP) issues·Work with GSM on price, PPV issuesHandle RTV from Hub to return/exchange defective parts & arrange replacement/credit back\nTrouble shoot with IT/Central team when issues occur and for system/process enhancements\nPerform annual audit with Hubs\nReports & MISOverall, person will work with multiple internal (Supply Chain, Finance, IT) and external (Suppliers, Contract Manufacturers and Hub Partner) stakeholdersLocation: Preferred location is Bangalore candidate must be flexible to work extended hours to support teams in US and AsiaEDUCATIONAL REQUIREMENTS:Candidates with Engineering background preferred; courses in Operations/Supply Chain management field will be added advantage\nEXPERIENCE REQUIREMENTS:6- 9 years of Supply Chain experience preferably in Technology industry\nMust have Procurement, Materials and Partner (Supplier, Customer) management experience\nWorking knowledge of Oracle or other planning/ERP systems\nGood problem solving and analytical skills\nGood communication skills and ability to collaborate with various stakeholdersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Telecommunications", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}