{
    "Job ID": "69867145",
    "Description": "Charger logistics Inc. is a world- class asset-based carrier with locations across North America. With over 20 years of experience providing the best logistics solutions, Charger logistics has transformed into a world-class transport provider and continue to grow.Charger logistics invests time and support into its employees to provide them with the room to learn and grow their expertise and work their way up. We are entrepreneurial-minded organization that welcomes and support individual idea and strategies. We are currently expanding and looking to add a motivated and experienced HR Generalist to our HR Department based out of Mohali.Responsibilities:Be the First Point of Contact for all Admin-related Queries'\nEnsure the Relevant Admin Database is Accurate and Up to Date.\nCoordinate and participate in recruitment and selection process including identifying selection criteria; developing questions and tests; screening applications; interviewing candidates in conjunction with hiring manager; verifying references, etc.\nMaking job offers and preparing and sending out the offer package.\nProvide communication and training to management and staff related to recruitment and selection and retention programs.\nProvide guidance and advice to management and staff on administrative and hiring issues.\nSupport the management team in planning efforts related to staffing levels and requirements.\nSupport current and future business needs through the development, engagement, motivation and preservation of human capital. Perform retention activities.\nNurture a positive working environment.Other HR Support Activities:Participate in Career and Job Fairs. Participate and collaborate in Recruitment initiatives.\nDeveloping, maintaining and updating job descriptions on a periodic basis.\nConducted exit interviews and reported trends to management.\nAdhere to health and safety policies/ practices developed and implemented by Charger.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}