{
    "Job ID": "69866316",
    "Description": "Req ID:429903 Leading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwideJob Title: Hardware Electronics ManagerPurpose of the job:Lead a team involved in a set of programs or projects, ensuring quality target and repeatable performances. Staff the team and follow-up program/project strategy definition and task execution, delivering as per QCD commitments. Identify, generalize, and stabilize best practices, proposing deployment Alstom-wide. Lead continuous team improvement, plan trainings and coach the team, nurture skill growth and capitalization. Stand as reference in your domain, for both your team and your peers.He will interact with all team members, and communicate as well. Ultimately should lead by being recognized as a domain authority, committed to achievement.POSITION IN THE ORGANISATIONReports directly to: Department HeadDirect reports: Engineering team from his Group (Métier or Domain)Network & LinksFor Developments:InternalADM Engineering Community\nSourcing\nMethod & Tools Community\nHuman Resource organizationExternalSuppliers (if any)\nCustomer\nAuditors\nAuthorizing EntitiesACCOUNTABILITIES AND AUTHORITIESKey Accountabilities:Agree and implement with the department head and the peer domain leaders the department guidelines (team profile and skills, growth plans, discipline evolutions in terms of technology, competitiveness, …)\nDevelop and maintain Métier / domain competences, coaching the team and growing World Class Engineering Experts\nSet clear team goals, delegate tasks and set deadlines\nProvide support to team project/program execution\nPromote Alstom values to his/her team\nContinuously motivate, encourage, evaluate and recognize, train and develop resources, in cooperation with HR, as per approved performance evaluation process and targets\nDeploy ADM Process, Methods and Tools in Project Engineering team, providing feedback for Process reviews\nCollect REX from execution and innovation opportunities to feed Reference Library where applicable and share outcomes at department level\nResponsible for HW Electronics design and development, executing the product development for Electronic products and circuit boards.\nManage adequacy between estimated workload and capacity, taking into account subcontracting & business strategies; report status and issues to department head\nCommit in Project/Program/Tender QCD related to its Métier/domainKey job authorities and dimensions:Staffing (hiring management, recruitment process)Department size can be assumed to range between 5-10 people.  EXPERIENCE PREREQUISITES & REQUIRED COMPETENCESEducational Requirements:  Mandatory:Bachelor’s degree in Electronics Engineering\nEnglish, full proficient useExperience:  15+ years of experience in Electronic product developmentMandatory:Engineering and processes background\nExperience in project/program execution and management\nSpecific hands-on experience in his own Metier/Domain\nExperience and understanding in project effort estimation\nKnowledge of several Alstom platformDesirable:Involvement in projects with teams in other Regional and Development Centers\nEstablished networking.Competencies & Skills:  Excellent communication and leadership skills\nOpen-minded\n(Self) entrepreneurial\nOrganizational and time-management skills\nDecision-making skillsAlstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?  Equal opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected.  All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law. \n Job Type:ExperiencedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}