{
    "Job ID": "69867878",
    "Description": "Jamjoom Pharma has in a very short span of time emerged, as one of the leading pharmaceutical companies in the Afrasia region. The geographical focus of the company is on countries in the Middle East, Africa, and CIS regions. Strategic focus on selected therapeutic categories has contributed to the rapid growth, market acceptance, and overall success of the company.Role Summary:Data analytics managers are responsible for overseeing the data analysis efforts of their organization. They work with a team of analysts to develop strategies for analyzing data, identify opportunities for improvement, and implement these changes in order to achieve specific business goals.Data analytics managers must have strong leadership skills in order to coordinate effectively with both technical and non-technical staff. They also need to be able to communicate clearly with all members of their team in order to ensure that everyone is on the same page regarding project objectives and implementation details.Responsibilities:Initially, will focus to bring business value & insight in Supply Chain function, Production Planning, and segment Profitability.\nManagement dashboard , Business insight / KPI.\nSAP modules support to business functions with focus on costing/profitability function.\nConducting analysis on data to produce reports that help businesses make decisions\nDeveloping data models for specific business problems\nCoordinating with IT to ensure that current technology can support the department’s goals\nProviding leadership to teams of analysts and helping them improve their skills\nConducting surveys and focus groups to gather information about customer preferences\nDesigning new processes or procedures based on findings from data analysis\nDeveloping training programs to help employees use data analytics effectively and efficiently\nAnalyzing data to determine patterns and draw conclusions about business operations\nCommunicating with top management regarding results of analyses and recommendations for action.Qualifications: Minimum 5- 10 years of experience in in SAP and Power BI (Business Intelligence) tools.\nBachelor degree in  Computer science/commerce/business administration\nSAP & Business Data analytics professional .\n5+ years experience in development of Management dashboard/KPIs in BI tool.\nIn-depth experience in SAP table /data structure and business process.\nAbility to work efficiently to complete the assigned tasks.\nGood communication and time management skills\nFluency in Arabic & English languages.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}