{"Job ID": "69868540", "Description": "Director, ISB Senior Relationship Manager0000JFNOSome careers open more doors than others.If you’re looking to unlock new job opportunities, take a look at the possibilities right on your doorstep here at HSBC.International Subsidiary Banking (ISB) is Commercial Banking’s international proposition which aims to provide banking coverage to the subsidiaries of Commercial Banking (CMB) customers within the Large Corporate and Mid- Market Enterprise segments. The International Subsidiary Banking strategy is to provide consistent, in-depth and dedicated coverage across the HSBC network with the end goal to deepen our relationship with our customers. The ISB business is a significant contributor of revenue to CMB and consists of a network of dedicated bankers across more than 60 countries.We are currently seeking a high calibre professional to join our team as a Senior Relationship Manager, ISB based in Dubai.In this role, you will:This is an Induvial contributor role\nGrow sustainable revenues from the existing customer portfolio with responsibility across the region for customers and targeted acquisition of new quality customers.\nEnsure proactive relationship building/customer contact plans and pipeline management for both existing and new customers.\nMonitor the client portfolio regularly and generate quality assets through the use of appropriate risk management tools, priced appropriately for risk and within customers ' and HSBC's risk appetite.\nEstablish an effective working relationship with Risk in order to validate the accuracy of the customer risk profile and ensure sustainable asset growth.\nMaintain a proactive calling programme to service clients, ensuring senior management and key stakeholders for large corporate clients are contacted regularly.\nEnsure a quality service for all customers by owning customer engagement, ensuring service excellence at all times, for all aspects of any customer, prospect or professional’s interaction with HSBC\nSupport achievement of the HSBC vision, values, goals and culture in personal behaviour, actions and decision making\nProvide technical leadership and support technical excellence by searching out external best practice, monitoring technical and professional developments, sharing knowledge and encouraging others to do the same in the best interests of HSBC and its customers\nEncourage and enable constructive cross-country and cross-business teamwork by demonstrating collaboration and matrix management in action and challenging actions and behaviours that are not consistent with HSBC's diversity policy and/or the best interests of the business and its customers\nDevelop and recommend changes and improvements to operating models, procedures and practices based on subject matter expertise and understanding of HSBC and market best practice\nCommunicate and adhere to HSBC policy and procedures in order to ensure good operational, financial and project management, policy and procedural compliance and early identification and effective resolution or escalation of issues that arise\nContribute to the implementation and monitoring of the application of policies, governance frameworks, procedures, practices and standards to ensure quality, effective risk management and regulatory compliance.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}