{
    "Job ID": "69865571",
    "Description": "Aramco energizes the world economy.Aramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer. With our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.Headquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.We are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.Directs activities related to sourcing, screening, analyzing, planning and developing a new business venture.\nWill apply advanced business development concepts and techniques and will contribute to the development of new\nprinciples and concepts.DUTY1 / effort % (010)\nManages business development process from screening through deal\nclosure, including drive\nscreening and validation activities to progress proposals through stage\ngates, prioritize\nbusiness proposals against investment criteria and NBD portfolio\nstrategy.\nDUTY2 / effort % (010)\nLeads efforts to formulate a resource and funding plans to transform\nbusiness proposal\nfrom\nConcept to a closed deal and serve as a liaison between NBD and the\ninternal proponent\norganization\nDUTY3 / effort % (010)\nLeads business planning and economic modeling and determine the scope\nand objectives of\nthe\ndeal, offering messages and technical solution that make up Saudi\nAramco's business\noffering.\nDUTY4 / effort % (010)\nAssembles initial offerings to potential investors, Lead investor\nselection activities,\nand Coordinates with Saudi Aramco subject matter experts to draft\nMemorandums of\nUnderstanding/Letter of Intent.\nDUTY5 / effort % (020)\nParticipates in creating the commercial, financial and technical\nframework for the deal,\nleads evaluation of business opportunities including valuation\ntechniques and\nmethodologies, defining scope of due diligence required and coordinating\ndue diligence\nactivities; presenting results of valuation and due diligence\nactivities and leads\ndevelopment of commercial agreements.\nDUTY6 / effort % (020)\nProvides administrative direction in the development and review of legal\ndocuments which\ninclude head of terms, MoU, Cost sharing agreements, and shareholder\nagreements and manage\nbusiness portfolio.\nDUTY7 / effort % (010)\nPrepares for and conduct negotiations to secure a deal is consistent\nwith Saudi Aramco's\noffer, investor expectations and set parameters.\nDUTY8 / effort % (010)\nEnsures compliance to process stage gates and approvals, approves\ncontract payments and\nvariations within limit, provides administrative direction and personnel\nmanagement to all\nassigned Business Development Analysts and performs other miscellaneous\nduties as\ndirected.Educational Level :Bachelors\nDegree Title : Bachelor of Arts\nDiscipline Title : Business and Management\n\nDegree Title : Bachelor of Science\nDiscipline Title : Engineering\n\n\nMinimum Years of Experience :12Title : Certified Financial Analyst (CFA)\nReq./Pref. : Preferred\n\nTitle : Certified Management Accountant (CMA)\nReq./Pref. : Preferred\n\nTitle : Certified Project Management Professional (PMP)\nReq./Pref. : PreferredWorking environmentOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.At Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.We have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}