{"Job ID": "69867022", "Description": "Role PurposeCivica are seeking a creative, passionate, and self-motivated Solution Architect to join the central Architecture Practice.The Architecture practice focuses on providing the following services to Civica projects:\nArchitecture Solution Design. Helping teams to formalise business functional and non-functional requirements; creating an architectural solution based on these requirements along with Civica preferred tooling, technology choices, and architectural patterns.\nArchitecture Solution Implementation. Work with product teams across the Group to implement technical solutions using Civica preferred design patterns, industry best practice and standards.\nArchitecture Assessment. Assess existing Civica product designs and implementations with a view of providing recommendations in line with Civica architectural standards and policies.\nThe Solution Architect will work with project teams across the Group, in a wide variety of sectors and geographies to deliver and support the above services.Key Responsibilities & DutiesTranslate business functional and non-functional requirements into design of solution architectures for Civica Critical Software product teams.\nProvide leadership and mentoring for technical teams.\nPromote the use of Civica preferred tooling, design patterns, and technology choices.\nPromote the reuse of existing technical assets, processes and methodologies and ensuring that any build of new technical assets is executed to enable reuse by teams\nPromote modern security principals such as secure by design and by default.\nBe familiar, on a continual basis, with Civica processes, policies, and practices as set by the Product Strategy Group (PSG).\nPromoting and applying PSG policies and industry best practices across all Civica project teams with regards to architecture and associated methodologies.\nLiaison with relevant third party suppliers and business partners as required.\nReports to Architecture Practice Manager.\nRelationship management with Civica project development and program management teams.Essential CompetenciesSolution-oriented with the imagination to identify workarounds for critical problem.\nStrong organisational and planning skills and be able to work under pressure.\nExcellent communication skills, written and verbal and good presentation skills\nEffective stakeholder management at all levels.\nEffective time management and an ability to recognise and respond to changing priorities and requirements.\nGood interpersonal skills with the ability to guide, direct, motivate and support staff either directly or indirectly.\nCommercial awareness.\nSelf-motivated, resilient, flexible and enthusiastic.EducationFirst class and above grade in BE/BTECH/MCA equivalent degree from a university of UGC accreted.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Vadodara, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}