{"Job ID": "69866342", "Description": "Job DescriptionAre you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.About the teamYou will be part of the Client Success team within International Markets and will work closely with peers within the Client Success team, as well as with other stakeholders and functional partners within FIS’s functional matrix model.This role will provide hands on leadership of all automation testing activities, identifying the best fit tools for the planned scope of automation testing.  Role is required to have extensive Automation testing experience and familiarity with cards processing and/or card-based payment Processing.What you will be doing:Reviewing and analysis of Non-Functional requirements and specifications.\nDesigning and scripting test cases using in-depth technical analysis.\nExecution of tests and recording of results in the form of test reports.\nDevelop, document and maintain test artefacts like the test data, data validation, harness scripts and automated scripts.\nIntegration with defect reporting and results presentation tools.\nNote defects or trends and the possible causes.What you bring:Knowledge of methods, tools and technology used across full suite of Performance/Non-Functional testing (performance, usability, scalability, stability, resilience, disaster recovery, etc).\nKnowledge of defect management tools.\nKnowledge and Experience of automated test tools.\nKnowledge of functions, features and components of existing and planned operating systems and applications.\nMaintaining robust and cohesive automated suites of tests across different types of environments.\nSkill in analysis, solid decision-making and problem solving.\nAbility to collaborate with delivery teams.\nAbility to communicate effectively verbally and in writing.\nAbility to establish and maintain effective working relationships with colleagues.Added bonus if you have:Knowledge of FIS’ products and services\nKnowledge of financial services industry\nKnowledge of basic financial analysis principles and ratios What we offer you:An exciting opportunity be a part of World’s Leading FinTech Product MNC\nTo be a part of vibrant team and to build up a career on core banking/payments domain\nCompetitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}