{
    "Job ID": "69866537",
    "Description": "Summary role description:Hiring for a Technical Lead – Full Stack Engineer, for one of the fastest-growing energy technology companies in India.Company description:Our client is one of the fastest-growing energy technology companies in India, founded by some of the leaders in this space. They lead technological innovation for the most effective energy delivery system in automated metering, smart energy, data capture, analytics, and smart workflows. They are the pioneer and market leader in end-to-end AMI technology, comprising Smart Meters, Communication Networks, and Central Systems. Their 100% made-in-India smart automation solutions solve the most difficult and complex problems in technical and commercial losses in energy distribution. Their team of 150+ devoted professionals have been working hard for >10 years, to change how energy is distributed in India and around the world. They are a culture-driven technology business, with core values of putting employees first, entrepreneurship, honesty, and respect.Role details:Title / Designation: Technical Lead\nReporting to: CTO\nLocation: DelhiRole & responsibilities:Design and develop RESTful APIs and cloud based scalable, extensible, reliable, and maintainable applications on modern cloud stack like AWS, Azure\nDeliver sustainable business solutions and technological architecture in accordance with organisational goals and product roadmaps.\nTrack down and avoid/reduce technical debt using a variety of modern tools\nLead and guide teammates in code reviews and help them with meaningful feedback\nWork with cross-functional teams to design and develop innovative solutions that meets the needs of our customers\nWork on several aspects of the software development lifecycle, such as determining the optimal method, estimating the level of effort, supporting QA testing, deployments, documentation, debugging, post-production support, and shipping security upgrades.\nParticipate and contribute to all Agile ceremonies\nResearch, document, note trade-offs and recommend potential solutions and help prepare technology roadmaps\nCreate and/or update documentation to support development efforts. Documentation may include detailed specifications, implementation guides, architecture diagrams and/or design documentsCandidate requirements:6+ years of full stack engineering experience in building enterprise-level software in .Net and in any one of the frontend technologies like React.js, Angular, Vue.js, jQuery\nExperience in building up RESTful microservices architecture with a full stack engineering background in an enterprise platform\nStrong knowledge on cloud platforms like AWS OR Azure\nUnderstanding and implementation of DevOps practices\nMust have experience in NoSQL database systems such as Oracle, SQL Server, Postgres, MySQL, CouchDB, MongoDB\nTest-driven development expertise and a strong commitment to code and output quality\nExperience in Docker and Kubernetes – nice to have\nExperience in working agile development teams (ideally using Scrum or Kanban)\nEngineering degreeSelection process:Assessment test\nTwo technical discussions (In office) & HR discussionsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Navi Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}