{"Job ID": "69866134", "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.Payments has become a very active/hot area in the last couple of years, creating a strong demand for innovation. This will be a very exciting area in the next 5 to 10 years. Not only is VISA a leader in the payment industry and has been for a long time, but it is also quickly transitioning into a technology company that is fostering an environment for applying the latest technology to solve exciting problems in this area. For a payment system to work well, the risk techniques, performance, and scalability are critical. These techniques and systems can benefit from big data, data mining, artificial intelligence, machine learning, cloud computing, & many other advance technologies and in VISA, we have all of these. If you want to be in the exciting payment space, learn fast, and make big impacts, Payment Systems Risk team @ VISA is an ideal place for you!This position is for a Senior Data Engineer with development experience who will focus on creating new capabilities in the Risk space while maturing our code base and development processes. In this position, you are first a passionate and talented developer that can work in a dynamic environment as a member of Agile Scrum teams.  Your strong technical leadership, problem-solving abilities, coding, testing, and debugging skills is just a start.  You must be dedicated to filling product backlog and delivering production-ready code.  You must be willing to go beyond the routine and prepared to do a little bit of everything.You will be an integral part of the development team, sometimes working on new requirements and design to build new product or service from ground up and at times making changes to an existing system to add new features or refactoring existing functionality for performance and maintainability, but always working on ways to make us more efficient and provide better solutions to our end customers. You will perform hands-on activities including design, documentation, development, and test of new functionality. You must be flexible and willing to switch tasks based on team’s needs.This position will be based in Bangalore, India and reporting to Director of Software Engineering. If this sounds exciting, we want to chat and tell you more about our work culture and environment and see if this will be a good fit for both of us.Essential FunctionsCollaborate with project team members (Product Managers, Architects, Analysts, Software Engineers, Project Managers, etc.) to ensure development and implementation of new data driven business solutions\nEngagement in requirements definition and clarification in collaboration with Business to ensure completeness and common understanding, deep understanding of the business needs is important.\nUnderstand business requirement and create design documentation\nFacilitating design reviews to provide input on functional requirements, product designs, schedules, or potential problems\nWork with other engineering teams to facilitate a common approach to continuous integration that includes build automation, test automation, and deployment automation\nCollaborate with senior technical staff and PM to identify, document, plan contingency, track and manage risks and issues until all are resolvedThis is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Basic Qualifications\n\n• 2 or more years of work experience with a bachelor’s degree or an Advanced degree (e.g. Masters, MBA, JD, MD)\n\nPreferred Qualifications\n\n• 3 or more years of work experience with a bachelor’s degree or more than 2 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD)\n• Experience in creating data driven business solutions and solving data problems using a wide variety of technologies such as Hadoop, Hive, Spark, MongoDB, NoSQL, as well as traditional data technologies like RDBMS, MySQL a plus\n• Ability to program in one or more scripting languages such as Perl or Python and one or more programming languages such as Java or Scala\n• Experience with data visualization and business intelligence tools like Tableau is a plus\n• Experience with or knowledge of Continuous Integration & Development and automation tools such as Jenkins, Artifactory, Git etc.\n• Experience with or knowledge of Agile and Test-Driven Development methodology\n• Strong analytical skills with excellent problem-solving abilityVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}