{"Job ID": "69869525", "Description": "It’s an exciting time to be at Infoblox. Named a Top 25 Cyber Security Company by The Software Report and one of Inc. magazine’s Best Workplaces for 2020, Infoblox is the leader in cloud-first networking and security services. Our solutions empower organizations to take full advantage of the cloud to deliver network experiences that are inherently simple, scalable, and reliable for everyone. Infoblox customers are among the largest enterprises in the world and include 70% of the Fortune 500, and our success depends on bright, energetic, talented people who share a passion for building the next generation of networking technologies—and having fun along the way. We are looking for an Enterprise TSE - SaaS to join our SaaS Technical Support team in Trivandrum, Kerala, reporting to the senior manager of NOC & SaaS Support. In this role, you will provide technical assistance for Infoblox SaaS customers—responding to customer inquiries via phone, email, chat, and web; diagnosing and analyzing problems; working collaboratively with internal teams like Engineering; and providing workarounds and answers for customer issues and questions. This is a complex, fast-paced environment, and you will own the most critical part of the customer experience.You’re the ideal candidate if you are a passionate learner who is eager to take on exciting new technologies, understand customer issues, and work relentlessly to find solutions. You are an independent, proactive, outside-the-box thinker who collaborates across teams and is driven by meeting deadlines and achieving results.What you’ll do:Provide remote technical support for Infoblox SaaS customers and partners\nTake ownership of customer issues and see problems through to resolution\nResearch, diagnose, troubleshoot, and identify solutions to resolve customer issues\nProvide prompt and accurate feedback to customers\nWrite knowledge-based tech notes and articles\nRecommend new and existing solutions, which involves enhancing applications and systems functionality, features, and defect repairs\nUse your intuition and innovation to provide solutions and workarounds for customers\nInstall and configure Infoblox products and third-party software for support lab testing purposes\nCollaborate with Engineering to fix product bugs and make product enhancements\nSupport a 24x7x365 organization by working rotational shifts and taking on-call responsibilitiesWhat you’ll bring:1+ years of experience in supporting Infoblox customers\nSolid knowledge in TCP/IP and networking protocols\nExcellent verbal and written communication skills\nExcellent customer service skills\nBasic understanding of DNS and DHCP \nBasic knowledge in protocols such as VRRP, OSPF, and BGP\nBasic understanding of AWS, SaaS, PaaS, IaaS, and microservices\nBasic understanding of one or more operating systems (Microsoft/Linux) is desirable \nAbility to multitask in a high-pressure, fast-paced, fast-growth environment\nWillingness to relocate to Trivandrum\nWillingness to work in night shifts\nBachelor’s DegreeWhat success looks like:After six months, you will…Understand Infoblox SaaS product technologies and protocols\nHandle Infoblox customer issues\nWork closely with teams within Support and Engineering to resolve customer-related issuesAfter about a year, you will…Have proficient knowledge of Infoblox SaaS product technologies and protocols\nHandle service-impacting customer issues to closureWe’ve got you covered:Our holistic benefits package includes coverage of your health, wealth, and wellness—as well as a great work environment, employee programs, and company culture. We offer a competitive salary and benefits package, including a 401k with company match and generous paid time off to help you balance your life. We have a strong culture and live our values every day—we believe in transparency, curiosity, respect, and above all, having fun while delighting our customers.Why Infoblox?We’ve created a culture that embraces diversity, equity, and inclusion and rewards innovation, curiosity, and creativity. We achieve remarkable results by working together in a supportive environment that focuses on continuous learning and embraces change. So, whether you’re a software engineer, marketing manager, customer care pro, or product specialist, you belong here, where you will have the opportunity to grow and develop your career. Check out what it’s like to be a Bloxer. We think you’ll be excited to join our team.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kerala, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}