{
    "Job ID": "69866609",
    "Description": "Apply now Job no: 569262\nLocation: Western Province, Central Province\nRiyadh Head OfficePropertyWith a store portfolio of over 3,000 stores which grows year on year a career in our Property Division offers fast-paced, dynamic experience on an international level. The Division is spit in to Facilities Management, Real Estate and Project Management offering a diverse range of opportunity for dynamic individuals.To effectively assist the facilities supervisors in per forming the operations and various maintenance activities on the  automated conveyor systems within their area or responsibilityIdentify the potential requirement with respect to the system and report to the supervisor .Actively assist the O&M team by rectifying the faults on the system by adhering all the safetyPractices and ensure the smooth operation of the conveyor system . Need to exhibit team player qualities and need to take ownership of the activities at the site   About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Western Province, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}