{
    "Job ID": "69866995",
    "Description": "Join a leading global real estate enterprise, with a strong footprint in diverse business sectors across Russia and the UAE. With a rich legacy spanning over three years, we pride ourselves on delivering unparalleled service and expertise in the real estate domain.Role Overview: We're on the hunt for a passionate and experienced Real Estate Broker, currently residing in Dubai, ready to make a mark in the bustling Dubai real estate sector.Responsibilities:Lead real estate viewings tailored to clients’ preferences and needs.\nEngage proactively with clients through various channels to understand and cater to their requirements.\nShowcase real estate offerings, emphasizing location, special features, pricing, sales conditions, and other pertinent details.\nDeliver financial analyses and investment insights to guide clients towards optimal decisions.\nOffer superior post-sales service, encompassing paperwork guidance, transaction coordination, and ongoing transaction support.\nFoster robust relations with both internal and external collaborators – from developers to financial institutions.Qualifications:English proficiency of at least B2 level.\nSolid track record in the Dubai real estate landscape, especially in closing deals.\nStellar communication talents paired with a knack for building genuine client rapport.\nUnwavering integrity and ethical standards in professional interactions.\nA driven, team-oriented mindset coupled with a disciplined work ethic.\nProficiency in sales and negotiations.\nInnovative thinking to attract and serve clients in distinctive ways.What's in Store for You:Targeted role for seasoned professionals already based in Dubai.\nNo niche market specialization required; learn and grow with our comprehensive on-site training programs.\nLeverage powerful lead generation resources and tap into limitless growth avenues.\nCompetitive, results-driven remuneration structure, among the best in the industry.\nPost-trial period, avail sponsorship for a work visa.\nEnjoy a vibrant work environment from 10:00 to 19:00 at our prime Business Bay, Dubai office location.We're eager to welcome dynamic individuals driven by excellence and commitment. If your vision aligns with delivering top-notch service and forging meaningful client relationships, we want you on board.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}