{
    "Job ID": "69866785",
    "Description": "Job Requisition ID: 157196 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every dayJOB PURPOSE:To provide competent patient-centred care that addresses health needs and promotes wellness. Such care is based on latest evidence and guidelines, and meets statutory requirements.JOB RESPONSIBILITIES:Provide general practice services to patients, through current best-evidence based standards, using best judgement at all times, in accordance with the clinic medical staff by- laws and rules and regulations and with instructions from the Medical director.\nParticipate equitably in the on-call roster.\nDemonstrate commitment to continuing medical education.\nParticipate in review and planning activities relevant to the development of the general practice services in the clinic.\nFulfil professional requirements for continuing maintenance of competence in all aspects of general practice.\nCarry out other assigned duties within the appropriate scope of knowledge, skills and abilities of a physician and ensure proper record keeping.\nProvide skilled health assessment, diagnosis and treatment services to patients\nOrdering diagnostic tests as needed, checking and informing patients of results in a timely manner.\nConduct routine check-ups to patients to assess their health condition and discover possible issues\nGive appropriate advice for healthy habits (diet, hygiene etc.) and preventative actions to promote overall health\nConduct examinations to ill patients and evaluate symptoms to determine their condition\nAsk intuitive questions to discover causes of illness\nReach an informed diagnosis based on the patient’s medical history, examination and tests results.\nPrescribe and interpret lab tests to obtain more information for underlying pathologies.\nPrescribe medications or drugs and provide comprehensive instructions for administration.\nReferring patients appropriately to other specialist doctors if needed.\nConsulting and collaborating with colleagues to provide optimal care.\nDocumenting all care provided and education/information given to patients within their health record, as per professional and company standards.\nDevelop skills and knowledge within the different specialities areas across the clinic.\nEncourage health promotion and patient education.\nComply with infection prevention control policies and procedures at all times.\nBe aware of safe guarding policies, both local and national, and implement such policies should it become necessary.\nAssess clinical conditions, prioritise health problems, including initiation of effective emergency care.\nProvide emergency care to patients as necessary and attend annual resuscitation trainingQUALIFICATIONS, EXPERIENCE, & SKILLS:Minimum Qualifications and Knowledge:MBBS or MBChB or equivalent qualification from an accredited institution.\nSuccessful completion of internship program and 3 years clinical experience.\nExperience in emergency medicine is highly desired.\nAbility to communicate effectively with patients, families, doctors, nurses, and other clinical staff.\nAppropriate exposure, experience and competence in all aspects of general practice.\nCertification in Basic and Advanced Life Support.\nFluency in English (speak, read and write).\nArabic speaking skills will be an added advantage.\nExcellent Computer Literacy skills is required.Minimum Experience:Minimum 3+ years experience in a similar role.Behavioural Competencies:a) Excellent presentation and analytical skillsb) Strong leadership and supervisory skillsc) Exceptional written and oral communication skillsd) Good decision making skillse) Strong operational thinking skillsf) Critical Thinkingg) Conflict ManagementAbout Al-Futtaim HealthcareWe Hear Your Ambition.\nFor over 90 years, the Al-Futtaim Group has been bringing the world’s leading brands of lifestyle watches, cars, home furnishings and fashion to the UAE. The Group has now introduced a whole new way of holistic healthcare through HealthHub Clinics by Al-Futtaim, its multi-speciality chain of more than 20 clinics in Dubai with over 25 specialties offering the right combination of advanced diagnostics, proven medical expertise and specialised services. \nWhat gives our clinics an edge is that as a part of the Al-Futtaim Group, you can expect world-class quality standards, with access to the best medical services and facilities within a healing environment. It’s a new way of healthcare that’s designed to meet a patient’s needs with a complete range of smart healthcare solutions. As testimony to this, only recently, we’ve earned a rare milestone of being the only primary healthcare network in the UAE to receive the Gold Seal by a reputed international body: Accreditation Canada.   \nAs trusted partners to health, we at HealthHub Clinics adopt evidence-based learning that enables us to listen to our patients more carefully. It helps us in treating the cause and not just the symptoms, while applying global best practices to ensure quality of care for every family member. Most of all, we adopt a patient-centric approach to healthcare that is reflected in the promise of our core belief: “We Hear You.”Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}