{
    "Job ID": "69869558",
    "Description": "Embee is hiring!If you want to be part of global organization in India where your ideas are heard and innovation and collaborative spaces are fundamental pillar, we are here for you.Embee’s story is one of change. We grew, expanded, and adapted, learning more at each step. Now effecting change is at the heart of everything we do. And that doesn't just apply to our customers, it’s how we feel about everyone who works with us.Our priority is to make sure that the people who work with us have the space to create ideas, the confidence to share them, and the resources and support to take them through to reality.About 30 + years we help companies make the right changes to ensure their success in digital transformation by providing end-to-end technology solutions including infrastructure, cloud, virtualization, collaboration, security, mobility and data center. We have quite broad geographical presence – more than 55 countries across 95 cities. Besides recently we have had IPO experience so you could easily find our results – for instance, our revenue is 2.5 billion now.Now we’re looking for BDM- Pune .You’ll be a part of our Delivery Team.Job overview: You’ll work and shape Embee’s performance on IT market.What you’ll do:Responsible for managing and retaining revenue in Microsoft defined accounts in the  Pune region.   \nBusiness Development in a B2B environment in the defined segment.\nIdentifying and generating new business opportunities within the accounts.\nMaximizing the revenue for the region for all Microsoft product specifically in the Cloud offerings of O365 and Azure.\nDeveloping account management strategies to support growth and increase customer goodwill and propose individualized IT solutions\nResponsible for farming the accounts to get a greater share of the wallet.\nCross Selling and up selling our other offerings of  IT products & Solutions (Security solutions, Citrix, BI, SAP B1, etc.)\nResponsible for entire sales life cycle from lead generation to closure for accounts.\nPrepare and maintain business plans and sales forecasts.\nRegular use of all sales tools, such as SAP CRM, to effectively plan and measure sales activities.Profile requirements:Any Grad\nMin. 6 yrs exp\nBase Location- PuneWhat we offer:Should be aligned to fast learning of new technologyDon’t forget to include your CV and cover letter. We receive a lot of applications, but we try to notice each of our potential candidates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}