{
    "Job ID": "69866337",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.OPERATIONAL TITLE:        TM1 & Cognos Analytics Senior DeveloperREPORTING TO:                 Group Accounting & Reporting DirectorREPORTING LOCATION:    Brussels (Belgium)WORKING LOCATION:        Bangalore/Chennai/NoidaSUMMARY OF POSITION AND OBJECTIVES:Job Role Description / Target AudienceThe Group TM1 & Cognos Analytics Senior Developer is responsible for :.The Group Cognos BI and TM1 Sr Developer is responsible for :Development, Maintenance & Optimization of the Cognos Analytics User Interface, including Design, Development, Implementation and Quality Assurance Testing of Group Financial Reports connected to the TM1 OLAP Engine.\nDeveloping both the TM1 (IBM Planning Analytics) backbone and functional models which are and need to be designed to facilitate the Group Financial Consolidation, Controlling/Planning and Reporting Cycles.\nThe Analyst/Developer will closely collaborate with Group Accounting Team in Nantes (France), Group Controlling Team in Brussels HQ (Belgium) and Group Reporting Team in Katowice (Poland), alongside with the off-shore/on-shore senior developers within the Global Centre of Excellence. Due to the nature of the application, this role will have high exposure to Senior Finance Management and a wide Community of Internal Financial Experts (Accountants, Controllers & Analysts).POSITION & OBJECTIVES:Develop Cognos BI as the Group Financial Reports tool. \nDevelop Cognos Analytics as the centralised Group Financial Reporting Portal.\nDevelop the reports for mass-printing.\nMaintain and develop the reports with “Reports Studio” and “Analysis Studio”\nWork with Group Finance and business to analyze & understand financial reporting requirements.  Based on this analysis, propose Cognos BI Reports.\nMaintain the Security in the Cognos Portal:\nMaintain access rights and Group Security\nDevelop Cognos TM1 as the Group Financial Reporting tool. \nDesign, code, test, and analyze TM1 applications. This includes researching, designing, documenting, and modifying TM1 applications, being the backup of the TM1 Sr Developer\nDesign, Create and \"industrialize\" Reports/Forms in Planning Analytics for Excel (PAx), Planning Analytics Workspace (PAW), TM1Web and Cognos Analytics, with the ability to integrate all software components into one single User Interface for a unified User Experience\nSupporting and training the TM1 user community\nSupport users with training.\nProvide ad hoc assistance on Cognos TM1 related questions.Research new technologies and best practices. Advise and recommend changes to existing IT policies procedures and strategy.EXPERIENCE REQUIRED:Personal skillsVery structured with strong organisational skills;\nVery accurate, highly reliable and eye for detail;\nProcess oriented\nHigh level of energy, drive and passion to succeed;\nPragmatic, proactive, flexible and adaptable;\nFast learner;\nAbility to work in an autonomous manner in a fast changing organization;\nStrong leadership skills, ability to lead from a distance/by phone \nGood interpersonal and communication skills\nTeam player enjoying working in a small international team.Language skillsEnglish (fluent written and spoken);\nAny additional language is an asset.Previous experienceA minimum of 6+ years’ experience in developing reports in the Cognos BI and 2yrs in TM1\nHave a very good understanding of the burst mode in the Cognos BI\nHave designed reports from Reports Studio  and Analysis Studio in a multidimensional environment\nHave a design and implementation experience in at least three TM1 BI project\nProven ability to develop reports based in multidimensional environment supporting a growing companies or a changing environment\nAbility to describe/ write in English business process specifications\nHave base line knowledge of all TM1 components and architecture.\nIBM Certified Advanced Solution Expert - Cognos TM1 or BI is desirable.Master Degree in Engineering/Finance or equivalent.What we offer:A launch pad into various senior management opportunities – within the many business lines of Eurofins globally – or into the management hierarchy in our different corporate functions.\nThe opportunity to grow your project management skills in a demanding, fast growing organization.\nA chance to become part of a highly motivated international team of professionals.\nIn a fast growing group, successful leaders are frequently being offered increased areas of responsibility (subject to geographic mobility).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}