{"Job ID": "69866180", "Description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.Note: all candidates are required to meet the minimum requirements of the role.Internal candidates are advised to secure alignment from their supervisor before applying.Job Summary:The Alzheimer's Marketing Lead – covering Saudi region and reports to the Marketing Director – will be responsible for setting efficient brand strategy and ensuring proper planning and execution of Marketing programs to deliver unparalleled customer experience. Leverage Lilly brand perception among the Neuroscience domain as a partner in managing patients and ensure high level of new product Launch readiness for internal and external stakeholders.The role will be responsible for leading on uncovering customer (Health Care Professionals) insights, using strategic market data and analysis to support the development of the product strategy. Further the role will be responsible for supporting the life cycle planning (strategic and marketing), messaging development, implementation, and execution of tactical plans, integrating cross functional partners and relationship management (internal and external) for successful marketing solutions in alignment with global and affiliate strategy. In addition, the individual will be responsible to engage and partner externally with the respective key stakeholders in the Neuroscience field.Path/Level:Note: Employees hired on banded positions (ex: P1-P3, R1-R2, B1-B3, etc.) transfer at their current level, despite the level indicated on the job posting.  For example, if a P2 candidate is selected for a P1-P3 banded position, the candidate will remain a P2 in the new role.Main Accountability/responsibilityAlzheimer’s Marketing Lead role is focused on leading the local strategy and commercialization plan for Alzheimer’s in Saudi. Coach and develop direct report using the Lilly Marketing Competency model with the goal of improving individual and team performance and/or developing skills needed for future career opportunities.This role requires deep competency in brand strategy and execution:Strong strategic thinking and problem-solving skills with quick learning agility\nLead and own the Alzheimer’s/Neurology strategy for current portfolio and new launches.\nDevelopment of solutions for key player; ensure that there is a measurement plan for the solutions developed prospectively; conduct periodic reviews of solution effectiveness; take action to improve execution\nStrong team player with a positive attitude and willingness to be flexible in addressing evolving team needs\nProven Leadership - achieve results through people / influence up, down, and across. Achieve results through others regardless of function, geography and personal style. Demonstrated ability to deliver high performance with high integrity across teams. Demonstrated leadership and influence with executives, senior leaders and business partners.\nConsistent demonstration of the Team Lilly leadership behavior\nMeticulous attention to detail, with ability to grasp and focus on the big pictureDetailed Competencies needed:Analysis:Leads External market analysis/monitoring:Review marketplace data and make recommendations from brand/molecule implications and actions.\nFollow-up on research in partnership with market researchers/agency as needed to investigate implications and draw conclusions.\nCommunicate information about the market and insights to support with brand strategy.\nIdentification of key consumer insights for brand in partnership with market research and agency partners.  Develop a deep understanding of the consumer target. \n Leads Internal analysis:Leads the marketing plan by utilizing and building upon knowledge of brand history, heritage and evolution.\nUses analysis to understand customer insights, identify Moments of truth (MOTs), use SWOT analysis for identify opportunities and issues.Planning:Leads and contributes to strategy development by actively participating and listening to insight generation activities across key players/ cross- functional experts and identifying opportunities/issues.\nLeads and develop a strategic plan.\nParticipate in brand planning process and meetings.\nIdentifies gaps between strategy and clinical/publication/product development plans that effect the life cycle of the brand/molecule.Marketing Planning:Leads in driving a strong and effective cross-functional planning and incorporates global and IBU (International Business Unit) direction.\nUses knowledge of the elements of the marketing mix, other marketing understanding tools, customer journey and ‘moments of truth’ to develop local marketing plans with clear objectives.Identifies and applies the ‘Launch readiness framework’ to prepare for launch success in line with local market needs.\nPlans brand activities in line with local processes and policies to ensure positive customer experience.\nRemoves barriers that will prohibit Lilly KSA from delivering a positive customer experience.\nIdentifies the pre-market conditioning activities that may be necessary to commercialize a molecule.\nDevelops a commercialization plan with guidance of global and IBU (International Business Unit)\nUses working knowledge of standard pharmaceutical promotional practices to gain insight into short-term and future trends.\nEnsures brand tactics and insights are data driven.\nIdentifies insights for brand partnership with Lilly Market Research (LMR)Implementation and execution of brand strategyAbility to update and reflect market strategy to reflect emerging/ changing trends.\nIdentifies and implements Omnichannel brand solutions in collaboration with Digital Marketing.\nRecommends specific marketing tactics based on promotional mix, interpretation of published medical data etc.\nAbility to test, monitor, evaluate marketing tactics and adjusts marketing plans accordingly.\nUses appropriate project management tools to oversee plans and ensure that key milestones are met against specified timelines.\nInfluence decision making cross-functionally, particularly as it pertains to developing insights-based marketing strategies to improve consumer outcomes.  Comfortable with discussion/presentation to Management/leadershipManages vendors and groups involved with tactical development and implementation.\nCreates internal communication plans with tailored messaging for key stakeholders.\nUtilizes data and analytics to track key execution measures and inform key internal stakeholders.\nActively collaborates and close liaison with field-based employees to understand customer needs and to execute tactical plans accordingly.\nReviews production stocking and inventory process indicators to meet sales forecasts.\nEnsure risk management through compliance with all consumer marketing guidelines, good promotional practices, privacy policies, and other policies and procedures. \nEnsures Financial Management through tracking and managing budget for consumer tactics including reconciliation.  Where necessary make recommendations for financial trade-offs as needed.\nEmbrace new corporate/regional/affiliate strategic directions and new initiatives such as selling models and multichannel customer engagement where appropriate.External Relationship ManagementImplements initiatives with key stakeholders that are important in supporting the brand strategy.\nDevelop relationships with key Thought-Leaders, patient support groups and other healthcare organizations in related therapeutic areas to understand partnerships, environment shaping and alignment with Lilly objectives.\nEffectively manage agency relationships to support brand strategy and tactics.Internal Relationship ManagementPartner closely with functions that are integral to the brand’s/molecule’s success (e.g., sales, medical, corporate affairs and KAM/PAM teams) on a local, regional and global level.\nParticipates in and contributes to cross-regional initiatives related to the brand strategy.\nActively seeks and acts on feedback.Develop High Performing/High Integrity Team:Build capabilities of the affiliate and function to effectively execute on function priorities and sharing of best practices and learnings across affiliates to inspire innovation and encourages effective ways of working and ensure integrated, high impact strategies.\nCreates environment where team is actively engaged, regularly monitor impact, and take appropriate action as needed.\nBuilds team synergy by developing relationships of support, trust and knowledge sharing within team and with peers.\nCoaches first line leaders within team on how to effectively develop their people and manage their business.\nEvaluates Team performance against agreed goals & standards.\nSets high expectations for team around compliance, then role models and coaches to these expectations.\nProvide reward and recognition of the team in line with company policy and Team Lilly expectations.MeasurementPro-actively monitors & evaluate marketing tactics and adjusting plans accordingly\nInterprets results, communicates issues/risks, and identifies opportunities for improvement\nRegularly monitors progress in metrics in partnership with management and support functions\nMakes recommendations to management based on the interpretation of results and brand/market knowledge\nAbility to answer key management/leadership questions and leads on this.\n Professional Development:Keep up to date on trainings for professional development\nEnsure myPM objectives are completed in line with company process\nUnderstanding and adherence to all company policies and procedures\n Educational QualificationsBachelor’s Degree in Pharmacy, PharmD or related fields\nMBA\\Masters is desirableKnowledge and ExperienceCore:Minimum 3 years brand marketing experience in multinational pharmaceutical industry\nDemonstrated track record of delivering results.\n Desirable:Alzheimer’s disease experience\\Alzheimer's marketing experience\nPeople management experience\nSaudi market experience\nStrong adoption and execution of Next Generation Engagement Tools such as VAE, eP2Ps, SOAs experience\nExperience in launch readiness\n SkillsExcellent command of English and Arabic language.\nStrong analytical, critical and strategic thinking skills.\nAbility to drive solutions at a senior level\nStrong interpersonal and communication skills with ability to influence.\nAnticipate and effective problem-solving skills to evaluate and resolve highly complex or unusual business and organizational problems.\nAbility to work with strict deadlines and under pressure.\nAbility to effectively integrate and lead internal and external team, cross-functional team.\nStrong command of Microsoft Excel & Power Point.\nAbility to work effectively and deliver results within complex, changing environment.\nEnthusiastic, ability to energize and motivate others.\nExcellent self-management and organizational skills; able to manage workload, set personal and team priorities and adjust as needed. \nMust be able to manage working with many different teams with varying styles, issues, and complexity\nHigh learning agility\nBudget management\n Other role requirementsJob is based in Riyadh, Saudi Arabia\nWill require domestic travel and may require international travel.\nMay require evening/weekend work.\nMust be legally allowed to work in KSA.Eli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.Lilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.#WeAreLillyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}