{
    "Job ID": "69866780",
    "Description": "Do you want to be part of a fast pace and entrepreneurial team? Do you enjoy working in an unexplored space and build world leading solutions to tackle regional complexities?\nIf so, we are looking for a high-judgement Senior Program Manager to develop new ways to build trust with Sellers in the IN region.\nKey job responsibilities\n- Driving key stakeholder and leadership engagement to support regional Seller trust efforts and representing the Selling Partner Trust (SPT) team in IN\n- Working with global product and program teams to understand current and future challenges faced by Sellers\n- Building a nuanced understanding of regional differences in terms of Seller needs and behaviour as well as the specific economic and legislative/regulatory landscape\n- Identifying region-specific opportunities and developing current and new programs that contribute to the delivery of our IN and WW goals\n- Driving the SPT strategy for the IN region and owning the IN SPT roadmap\n- Creating experiments that allow us to move from ‘what is’ to ‘what can be’\nA day in the life\nThe role will be fundamental to building our understanding of regional Seller nuances and driving improvement to Seller experiences. It combines strategic thinking with hands-on planning and oversight, and requires excellent program management, problem-solving, and stakeholder management skills.\nThe ideal candidate is able to influence and gain buy-in from product, business, ops, legal and policy stakeholders while seamlessly delivering in an ambiguous environment. Problem-solving, cross-team coordination, program management, executive communication, and organizational skills are essential to succeed in this role.\nAbout the team\nSelling Partner Empowerment, Communities and Trust (SPECT) is responsible for creating a trustworthy shopping experience across Amazon stores worldwide by protecting customers, brands, selling partners and Amazon from fraud, counterfeit, and abuse as well as providing world‐class support, and building loyalty with Amazon’s millions of selling partners. We value individual expression, respect different opinions, and work together to create a culture where each of us is able to contribute fully. Our unique backgrounds and perspectives strengthen our ability to achieve Amazon's mission of being Earth's most customer-centric company.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- 5+ years of working cross functionally with tech and non-tech teams experience\n- 5+ years of program or project management experience\n- 5+ years of delivering cross functional projects experience\n- Experience defining program requirements and using data and metrics to determine improvements\n- 2+ years of driving process improvements experience\n- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related fieldJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}