{"Job ID": "69867488", "Description": "Job Description:Job DescriptionPluralsight is the technology workforce development company that helps teams build better products by knowing more and working better together. Using our Skills and Flow products, teams can develop critical skills, improve processes and gain insights through data.We build this exciting product ecosystem by working with smart people and uniting behind a passion for what tech can create. We’re a group of good-natured, nimble go-getters dedicated to helping people and businesses build better with technology. That means when we see opportunities to create, we go for it. We don’t let the unknown stop us from solving challenges and winning together. And most importantly, we treat each other like adults. If you can see possibilities where others see problems, have candid conversations to ensure all voices are heard and thrive in a collaborative environment, you’ll do some of the best work of your career here.An IT Service Engineer helps each and every employee at Pluralsight realize their potential with the technology available. As technology grows and advances, our hope is that the potential of each employee is more fully realized. On a day-to-day basis, a Service Engineer will help someone with an Excel issue and then with a conference room problem or a myriad of things between the two. Our goal is to ensure that our technologies work in harmony with each employee, whether that’s an intern, full-time employee, contractor or high-level executive. We tutor or explain the current technologies in our environment, and help to marry that to expectations.Who you’re committed to being:A learner, as we acknowledge that none of us have all the answers - we are committed to learning from those around us.A teacher, as technology professionals we are committed to teaching those around us with the goal of merging technology into their day-to-day activitiesA self starter, a cornerstone of Pluralsight culture is that we are all adults and do not need to be micromanaged, which means each team member is accountable for their actionsDedicated to Pluralsight values, we don’t ask that employees be perfect, but we ask that everyone is dedicated to demonstrating our values throughout their careerA servant to everyone around you, as a support team member you acknowledge that we are here for the greater good - to democratize technology skillsWhat you’ll own:Ensuring the up-time of all employees and conference roomsHardware inventory and management, adhering to team policiesTroubleshooting of devices, hardware and softwareProviding access to the tools necessary for job functionsTroubleshooting network, hardware, software, conference room issuesExplaining how software & integrations work so that employees can efficiently utilize toolsExperience you’ll need:A desire to help and serve othersAn ability to troubleshoot root cause of issuesA detail oriented and logical approach to resolving problemsGood communication skills to effectively communicate with co-workers & document troubleshootingA pleasant demeanor that is approachable and invites both questions and learning opportunitiesAbility to work in Shifts ( US time zone)Our Perks & Benefits include:Competitive salary and meaningful benefitsFully funded comprehensive medical & dental coverage for you and your familyOpen vacation policyKeep active with our wellness program that allows you to expense your gym membership and other sports activitiesTuition reimbursementIf you’re game for doing phenomenal work that matters, challenging your comfort zones, and taking your career up a notch or three along the way, this might just be your happy place. Apply now!Bring yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}