{
    "Job ID": "69869594",
    "Description": "Vacancy Overview Commissioning Process & Piping Lead Airswift is an international workforce solutions provider within the energy, process, and infrastructure industries. Airswift serves as a strategic partner to our clients, offering a turnkey workforce solution to capture and deliver the top talent needed to complete successful projects by aligning with the unique needs of our clients. With over 800 employees and 6,000 contractors operating in over 50 countries, our geographical reach and pool of talent available is unmatched in the industry. Airswift is seeking for a Commissioning Process & Piping Lead to work in Qatar with one of our clients in Oil & Gas Industry. Job Purpose Responsible for managing process and Piping Commissioning during preparation and execution stage of Company Offshore Project to ensure objectives are safely met within the approved scope and schedule. Shall ensures that all his scope of work is completed in accordance with safety and quality standards applicable. Key Accountabilities Focal point for Process and Piping activities starting from preparation stage to final acceptance, for promoting and implementing of system completion and system completion database at site, implement system completion including reporting, monitoring, and control. Lead execution for Process and Piping at site (onshore/ offshore) and keep commissioning execution committed to targets defined by the project management. Review and approval of commissioning deliverable provided by EPC Contractor Champion initiatives with the Contractor to deliver on the project objectives i.e., safety, quality, cost and schedule and review for contractor’s commissioning execution effort and provide recommendations as necessary. Provide guidance and timely review on contractor’s commissioning execution plan and processes verifying fitness for purpose and compliance with contract requirements including codes and standards. Ensure coordination and communication for site activities with other discipline such as construction, Hook up and Completion Team and SHE representative and provide technical support with contractor, quality, safety, planning, engineering and start up/ performance testing. Review, approve and implement Commissioning system completion and commissioning technical documents prepared by EPC Contractor. Review and propose mitigation for Commissioning aspects of the Risk Management Plan and Monitor the mitigation when defined. Review all Commissioning changes, including justification for cost and schedule impacts, in accordance with the PMOC procedure. Maintain a register of lessons learned. QUALIFICATIONS Relevant degree or HNC, or significant relevant experience and trade qualification. KNOWLEDGE AND OR EXPERIENCE Min 8+ years of total experiences with at least 6 years demonstrated as commissioning experience in major capital projects. Experiences for manage Process and Piping commissioning activities during preparation of system completion database, technical commissioning deliverable, execution stage at fabrication yard, onshore, offshore commissioning and during integration testing with another contractor. Hand on experiences with system completion database ICAPS and OPERCOM Methodology. Worldwide commissioning experience with contractors or under company those involved in the Commissioning and start up support of Offshore production facilities. Demonstrated ability and sensitivity to work with people. Should you be interested with the role, you may submit your application to yusrina.zainal@airswift.comJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}