{"Job ID": "69865521", "Description": "Drive business growth through listing of correct identification, promotion planning and activations basis primary data analysis of the identified market territory\n“Mining” from existing customers and driving growth through better account management and retention activity\nAcquisition of new businesses ensuring profitability to meet budgeted targets\nIdentifying growth opportunities with market know-how/ meeting new customers to broaden the opportunity list and developing new customers \nForecasting annual, quarterly, and monthly sales goals and developing specific plans to ensure long and short-term term growth\nMap the market and maintain market intelligence of customers in the region. \nBuild in-depth knowledge of customer' business priorities, challenges and initiatives that can be translated into opportunities.\nBuild value-added relationships within the domain of the account and core account team.\nCreating a positive on-boarding experience for new clients, handling entire life cycle of the customer after onboarding.\nResponsible for billing and payment collection from the customer\nDevelop a prioritized target customer list and focus sales effort to penetrate and grow the target customers\nResponsible for negotiating, maintaining, and updating tariffs on the technology backed tariff management & shipment booking portal.\nBuilding & maintaining relationships within senior management at customer's business who can facilitate decision making & actions needed to achieve the required results\nFinalizing contracts with key clients and establishing SLAs for the fulfillment of each client's long-term goals.\nPlay an integral part in generating new sales that will turn into long-lasting relationships.\nCarryout MBR/QBRs for critical customers\nMonitor and report on market and competitor activities and provide relevant reports and information.\nPresent to and consult with senior level management on business trends with a view to developing new services and productsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Indore, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}