{
    "Job ID": "69867461",
    "Description": "S&P Global Commodity InsightsThe Role: Analyst - Oil Markets, Midstream and Downstream (OMD)The Team: This role is in Global Demand Research, a growing part of the Oil Markets, Midstream and Downstream (OMD) under Fuels, Chemicals and Resource Solutions (FRCS) business line at S&P Global Commodity Insights. Members of Global Demand Research interact actively with other research insights and analysts in Asia, the Middle East, Europe, and globally in subject areas such as global oil production, refining, trade flows, generating fuels, future energy outlooks and integrated analytics.The Impact: This position will have major responsibilities in analyzing elements affecting the Africa Continent oil markets with a particular emphasis on oil demand by product in the global context and presenting results in both written reports and client-facing interactions. The position will also have business development and client retention responsibilities for Africa region.What’s in it for you:Analyst focusing on Africa oil market with a focus on short-term oil demand and market dynamics.\nOpportunity to work on important regional issues and with a highly experienced team in the industry around the globe.\nDevelop your career by interacting with cross-commodity teams within the firm.\nExpand your perspective by interacting with clients on a regular basis.\nOpportunities to work with management of S&P Global Commodity Insights.Responsibilities:Responsible for doing analytics research on short-term Africa oil product demand and market and write monthly reports and spotlights.\nContribute to Global Demand Outlook report.\nBe responsible for detailed petroleum product demand forecast for Africa countries.\nUnderstand policy trends affecting the oil sector in Africa.\nDeliver ad-hoc spotlight reports based on industrial events and client queries.\nWorking closely with other members of Global Demand Research, other teams, and Commodity Insights at large.\nInteract with customers to answer questions and present oil market outlooks.What We’re Looking For:Minimum four years of experience in refining analytics, energy industry consulting, investment banking, equity research or equivalent professional experience\nBachelor’s degree, preferably in economics, engineering, business administration, or similar field\nExcellent communication skills and superb in oral and written English (as most of our communication are done in English internally and externally). Must be able to effectively present forecasts and supporting materials to clients in regular reports, phone calls, emails, and web/live conferences. French language skills will be a big plus.\nInnovative and strong problem-solving skills to streamline processes and identify and implement improvements\nExpert in Microsoft Excel. At ease using features such as pivot tables, matrix formulas and other advanced Excel functionality\nSuccessful candidates will be able to work well under tight deadlines\nExcellent at data mining and data visualization with available software programsGrade/Level (relevant for internal applicants only): 10The Location: Gurgaon, IndiaAbout Company Statement:S&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.S&P Global Commodity Insights enables organizations to create long-term, sustainable value with data and insights for a complete view on the global energy and commodities markets.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}