{"Job ID": "69865740", "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"nstalls foundations, walls, floors, ceilings, and roofs using materials such as: wood, steel, metal, concrete, plastics, and composites of multiple materials.\nFits and installs window frames, doors, door frames, door hardware, interior and exterior trim using a carpenter’s level, plumb bob, and laser levels.\nErects scaffolding and ladders for assembling structures above ground levels.\nStudies specifications in blueprints, sketches, or building plans to prepare project layout and determine dimensions and materials required.\nShapes or cuts materials to specified measurements, using hand tools, machines, or power saws.\nFollows established safety rules and regulations and maintaining a safe and clean environment.\nBuilds or repairs cabinets, doors, frameworks, floors, or other wooden fixtures used in buildings, using woodworking machines, hand tools, or power tools.\nAssembles and fastens materials to make frameworks or props, using hand tools and wood screws, nails, dowel pins, or glue.\nRemoves damaged or defective parts or sections of structures and repair or replace, using hand tools.\nInspects ceiling or floor tile, wall coverings, siding, glass, or woodwork to detect broken or damaged structures.\nMoves necessary materials around jobsite as assigned.\nCleans up worksite debris.Your experience and skills include:\nAbility to work well under pressure in a fast paced environment\nAbility to work cohesively and collectively as part of a team\nAdd diplomas/certifications required if neededYour team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Oman", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}