{
    "Job ID": "69869894",
    "Description": "Bosch Global Software Technologies Limited (BGSW), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.Our specific team from BGSW works with Bosch Sensortec GmbHBosch Sensortec GmbH develops and markets key technologies in consumer electronics – micro-electro-mechanical sensors (MEMS), solutions and systems for smartphone applications, tablets, video game consoles, wearables, and the Internet of things. The sensors enable devices to recognize their surroundings and to transmit the data collected. MEMS are therefore part of the foundation for a networked world. Bosch Sensortec GmbH is a wholly owned subsidiary of Robert Bosch GmbH.Are you ready to boost your career in the exciting areas of sensor systems? We are looking for a skilled firmware expert to work on innovative sensor solutions to design and develop firmware for next gen IoT reference platform using Bosch MEMS Sensors.As part of the Software Engineering team, you develop software components, set up prototype platforms, integrate software algorithms, debug, benchmark and optimize next generation smart sensor systems and influencing hardware design as well.Understand complete software system comprising sensors, signals, busses, interrupts, timers to exploit and push performance boundaries for resource constrained MCU based devices with limited computing power / memory footprint.Working on this topic the developer shall experience a very interesting and challenging work flow with a wide spectrum from analyzing the market trends, Requirement analysis, Software designing to solution development and problem solving using simulation software as well as on actual hardware.Personality: Self-starting with influencing and leadership skills.You convince and inspire others with your ideas and are a positive team player with experience working in multicultural teams.\nExperience & Know-How:  A very good experience in optimized coding for embedded SW with modern C and C++. Ideally, having further experience on MEMS sensors, BLE and understanding and work experience on Sensor Framework, HAL  & device tree (Linux, Android, Zephyr). Furthermore, a familiarity with Hardware Design and common software development tools like Enterprise Architect, Continuous Integration and Git.\nExperience: Solid knowledge and several years of working experience in embedded software systems on several microcontroller platforms (ARM Cortex-M and others), optimizing and debugging techniques, development in C, fulfilling real time requirements is a must.\nLanguages: We are cooperating with different worldwide locations. Therefore, we expect excellent English skills. \nEducation: Bachelor or Master degree in Computer Science, Electronics Engineering, Electrical Engineering or a related technical fieldStrong programming expertise in C, C++. An additional knowledge in Python and linux is preferable.\nHands-on experience with embedded development tools and troubleshooting methodologies\nHands-on development experience in Boot Loader, RTOS and drivers\nExposure and experience with real-time operating systems such as Zephyr, RTLinux.\nExposure and experience with communication protocols such as SPI, I2C, USB, UART etc.\nDomain knowledge on MEMS sensors is must\nGood understanding of power measurement and management of embedded systems\nGood understanding in experience with static code analysis tools, unit testing frameworks.\nGood hold on reading schematics and data sheets for components\nAbility to adapt to fast changing requirements and provide solutions.\nBeing an effective team player and willing to accept challenges and responsibilities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Coimbatore, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}