{
    "Job ID": "69866808",
    "Description": "Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon continues to grow and evolve as a world-class e-commerce platform.\nTo expand the selection of products available to customers Amazon engages with Sellers & Vendors who offer their catalogue of products on Amazons’ global eCommerce platforms. The Selling Partner Support (SPS) team acts as the primary interface between Amazon and its Selling Partners. We obsess over providing world class support, technical assistance and account management services to our global partners. We strive to predict the Vendors & Sellers’ needs, create innovative self-help tools and provide solutions to help our partners better serve their customers and grow their businesses.\nThe SPS Associate is an advocate for the perfect Seller interaction. By serving as the first resolution point for Sellers & Vendors diagnosing technical, operational, system and process issues and propose solutions that will remove barriers to enable resolutions for our Selling Partners. As a subject matter expert in several platforms and specialties, SPS Associates will educate Sellers & Vendors on processes, tools, and standards in real-time.\nThis role requires the ability to multi-task utilizing a wide variety of software tools to navigate various Selling Partner Accounts, research and review policies and communicate effective solutions. The successful candidate will have a commitment to driving excellence in Associate and Selling Partner experience. A strong record of customer focus and a keen interest in process improvement are key requirements for this role.\nKey job responsibilities\n• Supporting Amazon’s Selling Partner’s to solve any incoming issues via 3 channels of communication (Phone, Email & Chat)\n• Managing high volumes of inbound and outbound calls, emails and chats in a timely manner\n• Identifying customers’ needs, clarify information, research every issue and providing solutions\n• Exemplifying Amazon’s Leadership Principle for Customer Obsession by consistently displaying a genuine passion for our customers, delivering an exceptional customer care experience with every contact.\n• Building sustainable relationships and engaging customers by going the extra mile\n• Ability to oversee and achieve various KPIs like Quantity & Quality, Resolution Rate, Transfer Rate etc.\n• Open to collaborating with various stakeholders like Resolver Groups, Account Managers etc.\n• Documenting all Selling Partner interactions and information according to standard operating procedures\n• Ability to troubleshoot and provide product guidance and support to all Amazon’s Sellers and Vendors\n• Attend training sessions, and learn product details and key selling points of products and technologies. SPS participates in several initiatives to increase Seller listings and updates of catalogues in advance of peaks.\n• Any other duties and special projects as directed by management in keeping with the employees skills and experience\n• Multilingual support: fluency in Arabic and English communication is essential\n• Ability to work shifts and open to weekends to accommodate Amazon´s opening hours, 7 days a week” To note, the shifts cannot be confirmed prior to joining Amazon as they are not determined until after the training period.\nWe are open to hiring candidates to work out of one of the following locations:\nCairo, EGY\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Language – Fluent Arabic and English is essential.\n- Completed a 4 year college degree.\n- Military exemption\\ completion\\ 3 years postpone.\n- 2 years’ experience within a customer service environment in Multinational call center.\n- PC Skills: Experience working with Operating systems (Windows) and using Office Suites( Microsoft Word, Outlook)\n- Technical Skills: Basic working knowledge of spreadsheet software such as Excel and the ability to use communication and collaboration tools with ease\n- Demonstrate appropriate sense of urgency and adaptability in response to changing business needs\n- Demonstrates effective communication, composure, and professional attitude\n- Experience with serving Customers from a work from home environmentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}