{"Job ID": "69865840", "Description": "The newly established Global Shared Service Center IT in Pune will be delivering high quality services, among others within BI, Finance Applications, CRM, Product Lifescycle Management (PLM) and End User Services. DNV is in the middle of an exciting digital transformation, as are the industries in which we operate. The centre in Pune is one of the key units in supporting DNV’s business areas with tools and systems to maintain customer contact and services.The PLM Section is responsible for the development, operation and support of a Business Application which is used in different business areas in DNV based on the PLM tool Teamcenter from Siemens. We are seeking a person to support the global PLM team in Teamcenter development, configuration, and improvement initiatives.  In your role as a Front End developer, you will be:Play a major role in redeveloping the Customer Portal built on top of Teamcenter into new UI framework.\nWork with the API team to ensure that the front end works seamlessly with the Teamcenter DB in the backend.\nWork with the business to ensure all current functionality is working correctly as per the existing requirement design specifications.\nBe involved in coding of features and/or bug-fixing while adhering to coding and quality standards.\nIdentify and/or implement areas of improvement within the application, to help improve its performance.Successful candidates should have good understanding of the IT technical aspects as well as good experience in the Teamcenter development activities. We are looking for a person with knowledge and experience in several of the following areas:Proficient understanding of web markup, including HTML5, CSS3\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery\nGood understanding of advanced JavaScript libraries and frameworks, such as ReactJS.\nGood understanding of asynchronous request handling, partial page updates, and AJAX.\nShould be familiar with UX/UI concept because sometimes a front-end web developer needs to make some small adjustments.\nProficient understanding of cross-browser compatibility issues and ways to work around them.\nProficient understanding of code versioning tools, such as Git.\nGood understanding of SEO (Search Engine Optimization) principles and ensuring that application will adhere to them.To maximise your you chances, you will:University degrees at bachelor level in Computer Science / Software Engineering, 4 - 7 yrs of relevant experience in UI development.\nHave good communication skills\nShould have a proactive attitude\nHave a systematic and analytical approach to tasks\nCan work individually, and at the same time maintain a high team spirit\nEnjoy new challenges and personal drive to achieve our objectivesDNV offers to the successful candidate:Full-time employment contract\nThe opportunity of long-term career perspectives in an international environment\nTraining and development opportunities\nGreat working atmosphere and support from your colleaguesDNV is the independent expert in assurance and risk management, operating in more than 100 countries. Through our broad experience and deep expertise we advance safety and sustainable performance, set industry benchmarks, and inspire and invent solutions.The Global Shared Services (GSS) organization within DNV provides high quality, cost effective services and processes within Human Resources, Finance and IT, based on requirements defined by the business areas and Group. GSS also develops central competence for distinct services, projects and development and will support policy, procedures and system implementation on a global, regional, and local level.GSS is about bringing a team of true process experts together, going for professional service levels at industry standards, and offering centers of expertise for competence based advisory. We are driven by people’s competence and motivation to help and support the business areas. As a member of the GSS community you act in a professional, multi-cultural, competent and service oriented environment with good possibilities to enhance your personal competencies and expertise, and to build a strong network with colleagues around the world.DNV is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to gender, religion, race, national or ethnic origin, cultural background, social group, disability, sexual orientation, gender identity, marital status, age or political opinion. Diversity is fundamental to our culture and we invite you to be part of this diversity!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}