{
    "Job ID": "69866522",
    "Description": "Req ID:433432 At Alstom, we understand transport networks and what moves people. From high-speed trains, metros, monorails, and trams, to turnkey systems, services, infrastructure, signalling and digital mobility, we offer our diverse customers the broadest portfolio in the industry. Every day, more than 80 000 colleagues lead the way to greener and smarter mobility worldwide, connecting cities as we reduce carbon and replace cars.Lead Buyer - Indirect Sourcing\nManaging Sourcing process for Indirect spend for multiple projects with in India, the position will be based out of Bangalore location and should be able to travel to multiple Alstom location depends on the project needs.The resource will be responsible for handling sourcing activities for Construction of Industrial Building, Office, Office Interiors, MEP, HVAC, CAPEX & Equipments related to Factory sourcing activities, This activity involesTechnical, Commerical & Contract negotiating and finalising with Contractors, Suppliers & different service providers, The resource will work closely with Regional and Global Commodity Manager to align with thecommodity strategy and to help in implement the same at the desired level with the local units., The position requires good knowledge on Construction Management have considerable work experience in managing allprocurement related sourcing activity from railways industry.\nJob Title\nLead Buyer – Indirect Sourcing\nPurpose of the Job\n. Responsible for designing and implementing Country sourcing strategies for Real Estate, Construction, Office Interiors, Capex and machinery in line with the global Commodity strategy\n. The purpose of this position is to manage the sourcing and management of suppliers and vendors in support of the delivery of Construction activities.\n· Own category expertise: cost model, benchmark, market trends, supplier panel, LCC options.Organisational Reporting\nDirect reporting to Commodity Manager\nKey Network & Links\nSourcing local/central team, Platform team, Project team, Supplier Quality, Supply Chain, Legal, Finance, Engineering, and Train Sub System for RS/Compo.\nWorking in ERP (SAP) including PR, PO and vendor creation work\nWorking with multiple location and different geography\nImplementing Sourcing process and delivering Cost Savings\nMission\nPerformance Measurement\nSavings P&L and Cost to Complete\nOn Time Delivery\nContract Adherence, Coverage, Vendor Rationalization\nSourcing maturity roadmap improvement\nResponsibilities\nAlign with Global Commodity Strategy and implement the same at country level\nSupport strategy deployment with central commodity manager and Indirect sourcing manager\nLead QCD relationships with suppliers at country level\nApplying and maximize the usage of E-Sourcing tools (e-RFx, e-Auctions, e-Contract Management, e-Procurement, e-SRM...) available in the organisation\nIdentify and engage inbound vendors; develop requests for quotations; and negotiate the best value possible; utilize customer routing mechanisms.\nProvide continuous operational improvement, review meeting with contractor to deliver required and committed service levels.\nDevelop market intelligence program that benchmarks key industry indicators/market price to ensure accurate price forecasting and risk mitigation.\nGenerate innovative ideas for increased process efficiency & reduction in cost\nVendor selection / Evaluation / negotiation of contract (within threshold value) /Business case preparation and follow DOA approval flow\nReview and negotiate Construction contract terms and conditions in concert with corporate legal and corporate risk while balancing capacity and service requirements.Negotiating the contractual agreement withthe vendors for the high value work packages and contract management during implementation of the project including monitoring the performance of the vendor and manage claim during the shortcoming of QCDrequirement.\nSupport site team in day to day indirect activities and adhoc requirements\nClosely working with Commodity manager in high Value project requirement and do local co-ordination\nCommodity Management:\nSupport actively in project and tender execution\nOwn category expertise: cost model, benchmark, market trends, supplier panel, LCC options,\nHelp in Managing the catalogue definition and implementation (if appropriate): content, accuracy, evolution in relation with the Technical Advisor/Expert\nApply Alstom Transport sourcing process\nAnalyse risks and sets appropriate mitigation plan\nJOB DESCRIPTION\nAnimate commodity maturity improvement plan\n- Bring operational excellence in sites and regional commodity management\n- TCO and complete ownership of commodity and all marked codes under parent commodity\n- Spend analytics and strategy\n- Continuous improvement in managing total suppliers and spend\n- Handling conflicts and providing rational, acceptable solutions\nTeam facilitation:\n- Ensure Commodity team animation in close link with Commodity manager\nSourcing Strategy:\n· Define and develops commodities strategy with Domain/Sourcing Director and drives its implementation\n- Work closely with Peers, colleagues to achieve common goals\n· Define supplier panel in-line with Sourcing strategy and makes sure it is implemented\n· Support Tender and Project Phases on case to case basis\n· Lead the selection of suppliers for Commodity\n· Ensure early involvement of suppliers at RFQ Stage\nSupplier Relationship Management:\n· Manage long term relationships with the supplier for his commodities (in particular for legal aspects)\n· Negotiate and animates supplier QCD objectives and performance for the commodities\n· Perform regular (min. quarterly) supplier performance review (incl. quality) and solves major issues and secures objectives achievementDrive supplier negotiations as appropriate\n-Develop Trust, Transparency and Innovation with Suppliers\nCandidate Requirements\nEducational requirements/Experence -\nGraduate ( preferably BE/ B Tech)\n10+ years of experience in Indirect Sourcing., Specialized in Real Estate, Construction & Capex .activities\nFor factories, Offices etc., including managing vendors from various streams from Railway /Manufacturing industry\nGood Analytical & Communication skills and fluency in English\nKnowledge and hands on experience in Supply chain management, logistics, sourcing & costing\nTechnical Knowledge\nStrong Technical skills with Construction Industry\nSourcing/Procurement process knowledge\nStrong negotiation and relationship management skills\nPresentation skills on technical matters to management, team and Stake holders\nBehavioral and Technical Skills / Competencies\nFluent English & International mindset\nLeadership, communication, internal and external infl uencing skills, team management, negotiation, strategic vision\nJob Location / Mobility\nBangalore / ModerateYou don’t need to be a train enthusiast to thrive with us. We guarantee that when you step onto one of our trains with your friends or family, you’ll be proud. If you’re up for the challenge, we’d love to hear from you!Important to noteAs a global business, we’re an equal-opportunity employer that celebrates diversity across the 63  countries we operate in. We’re committed to creating an inclusive workplace for everyone.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}