{
    "Job ID": "69866641",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Job Title: Senior Associate - Active Directory L2 / L3AdminReporting To: ManagerWork Location: Bangalore / Chennai / NoidaActive Directory L2/L3 Admin Required Good understanding of AD delegation and tier delegation model. Perform systems analysis and tuning to ensure optimal Microsoft AD infrastructure Resolves and appropriately completes assigned cases and change requests and acts as an escalation for support issues Knowledge of ADFS & Federation Protocols SAML, WS-Fed, OAuth, OIDC This role requires an in-depth knowledge of on Active Directory Federation Service & Certificate Service. Hands on On-prem AD and Azure Active directory Scripting Knowledge on PowerShell AD audit logging and soc compliance reporting Worked on any of the ITSM tools like ServiceNow Applies new solutions through research and collaboration with team and determines course of action for new application initiatives Implements new software solutions as required by the business. Ability to create technical documentation and sopTechnical Experience: Manage on Prem AD and Azure Ad Manage Forest/Domain/OU/User Object management Expertise in Windows Active Directory infrastructure and related services (DNS, DHCP, SMTP, LDAP, ADLDS etc.) Good Understanding of ADS, Group Policies, FSMO Roles, DNS Zones, Replications etc Hands on Microsoft Azure and AD related issues. Experience in Managing/troubleshooting Group policy issues. Should have worked on Enterprise application and MFA Worked on Google Cloud identities (Good to have)Primary Skills On Prem Active directory Azure AD Group policySecondary Skills Azure PKI CertificatesEXPERIENCE REQUIRED:Minimum 5-7 years of professional experience in Active Directory Administration Personal profile Very good English communication skills (concise writing and orally convincing); Very good interpersonal relation skills; Able to engage and influence others in order to obtain sufficient follow up and attention.  Ability to work in a complex international environment; Eager to learn and continuously develop personal and technical capabilities.Certification:Microsoft Certifications in Active directory/relevance (non-Mandate) Any cloud-based certifications (non-Mandate)Qualifications Bachelor's degree or comparable education Certification ITIL Foundation V3 highly appreciated, but not mandatory Languages: Fluent EnglishJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}