{
    "Job ID": "69866632",
    "Description": "As the world’s largest family of luxury hotels, we all take great pride in being genuine ambassadors of the InterContinental® brand. Shaped by decades of international know-how and local insights, our passion for luxury travel spans cultures and customs. Inspiring us to create warm and sophisticated experiences for those seeking a richer perspective on the world.Each of our hotels cultivates a distinctive style and ambiance where we embrace every opportunity to give our guests a personal and enriching experience. If you’d like to embrace a wider world of experiences and opportunities, we’d like to welcome you to join InterContinental Dubai Marina as Senior Painter.InterContinental Dubai Marina is a Five Star luxury hotel in the heart of Dubai Marina with 328 rooms and residence suites, flexible event space and restaurants & bars. With over 30 languages and countries represented by the staff, the hotel weaves together an international five star presence.Your role will be including but not limited to:Perform interior and exterior painting tasks to maintain the hotel's appearance at a 5-star standard\nPrepare surfaces, including cleaning, sanding, and priming, to ensure a smooth finish\nSelect and mix appropriate paints and finishes for various surfaces and areas\nApply paint and other finishes using brushes, rollers, or spray equipment\nRepair and patch damaged areas on walls or ceilings\nMaintain painting tools and equipment in good working condition\nCollaborate with the maintenance team to identify areas in need of painting or touch-ups\nEnsure all work is completed efficiently and with minimal disruption to guests\nAdhere to safety and environmental regulations while performing tasksIdeally, you'll have some or all the following qualifications and experience we're looking for:Proven experience of 3 years in luxury hotels preferably in UAE/ME\nKnowledge of various painting techniques and finishes\nExcellent attention to detail and color perception\nFamiliarity with safety precautions and the use of personal protective equipment \nAbility to work well under pressure in a fast-paced environment & work cohesively with fellow colleagues as part of a multi-national teamWe’ll reward all your hard work with a great salary and benefits and the chance to work with a fantastic team of people. In return we'll give you a competitive financial and benefits package and the chance to work with a great team of people. Most importantly, we'll give you Room to be yourself.So what's your passion? Please get in touch and tell us how you could bring your individual skills to IHG by clicking \"Apply Online\" now!We are an equal opportunities employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}