{"Job ID": "69869666", "Description": "Company:Job Area:General Summary:Job OverviewThe Advanced Tech R&D team is looking for motivated engineers interested in prototyping and testing new DSP and ML algorithms on headsets. You will be working with a team of DSP and machine learning experts to develop advanced noise suppression (NS), adaptive noise cancellation (ANC) and hearing assistive capability for headsets and XR devices.The team includes and works with algorithm, hardware and software engineers across the company to develop, port newly designed solutions to real live prototypes shown at tradeshows and other customer events, and support commercialization activities in upcoming products.Responsibilities:The selected candidate will have responsibilities in one or more of the following areas:•  Work with R&D engineers to evaluate, optimize and port new feature code to prototyping platforms•End-to-end Audio system design, development, prototyping, performance validation and commercialization of new audio features/technologies that meet performance, power, robustness and stability metrics on Qualcomm platforms•  After successful demos to technical and business audiences, work with commercialization teams to transfer and deploy newly developed solutions onto Qualcomm platforms and customer devices•  All Qualcomm employees are expected to actively support diversity on their teams, and in the Company.•  Proven ability to work in a dynamic, multi-tasked environment•  Self-starter who likes to be challenged and solve tough complex problems•  Excellent verbal and written communication and presentation skills.•  Quick learner, self-motivated, able to work independently and a Team player.•  Aspiration for excellence.•  Working in cross disciplinary, geographically-dispersed teamsMinimum Qualifications•Expertise in developing and debugging software on embedded platforms•  Coding experience in Assembly, C/C++, Python, familiarity with ONNX, PyTorch model formats•Expertise in quantizing of ML models and offloading to HW accelerators such as NPUPreferred Qualification•Experience designing Audio system, development, prototyping, performance validation and commercialization of new audio features/technologies that meet performance, power, on any embedded platform•Knowledge of software design patterns, multi-threaded programming, data structures and basic algorithms•Knowledge of any DSP architecture, real time operating system concepts•  Familiarity with recent trends in digital signal processing and machine learningEducation Requirements Required: Masters/Bachelor's degree in Electrical, Electronics, Computer Engineering Engineering or related fieldMinimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}