{
    "Job ID": "69866405",
    "Description": "Apply now Job no: MRF12643\nLocation: Kuwait\nAvenues Mall Al Rai-Phase 3MothercareMothercare has grown from its origins in 1960s Britain into a successful global multi-channel retailer operating in over 50 countries. In 1983 M.H. Alshaya launched its first franchise operation with the brand in Kuwait which was also mothercare's first international store.Mothercare Alshaya is today a highly successful, ever growing and complex business, operating over 300 stores across the Middle East, North Africa, Russia & Central Europe, from large parenting centres to small hospital stores and an incorporating an integrated e-commerce solution. As a brand we pride ourselves on our customer service, making our stores parent and child-friendly environments, staffed by people who are passionate about our products and services and who can offer knowledgeable unbiased advice. This is especially important for new parents, unversed in the technicalities of products such as baby-feeding equipment, cotbeds, pushchairs and car seats.Your role will be to deliver and maintain exemplary standards of visual merchandising, including designing promotional campaigns, giving recommendations, and implementing action plans.You will train the store staff on brand standards, provide on-going coaching, and be a pivotal part of the brand team, working to implement plans for new store openings and new market entry.You will also be responsible for assessing the visual standards of the store and ensuring best practice is followed by staff.Qualifications & Requirements:You will have/be:- At least 3 years' retail operations experience including 2 years in visual merchandising management.- Experience in budget planning and control.- Good planning and organisational skills.- The ability to apply sound brand principles to projects and campaigns.- Computer literate.- A Qualification in Visual Merchandising or Art & Design is also an advantage.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}