{"Job ID": "69866288", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Fire & Safety OfficerProperty and Asset ManagementWhat this job involvesYou will oversee and ensure fire safety at your site. You will use the assigned apparatus and follow the command structure instructions for fire suppression or a related emergency service.  Your duties will involve:Performing equipment set-up upon arrival at a fire scene.\nDispatching and accompanying ERT (Emergency response team).\nPreparing plans and executing (fire and life safety) evacuation drills and other fire safety related trainings to the team members and occupants available in the premises.\nCompleting appropriate rescue, firefighting and salvage operations at a fire scene.\nUsing established procedures to determine if individuals are trapped within a burning facility and taking appropriate actions to secure their rescue.\nPerforming the lift evacuation and rescue drill periodically.\nSecuring affected structure to prevent rekindling.\nTaking inventory of all equipment after suppression has been achieved, recording all equipment, which must be left at the site and incident report.\nAttending and providing information for pre-fire planning studies and maintaining an updated knowledge of pre-fire plans.\nLiaison with Government authorities for periodic renewal of the NOC’s.\nReport and maintain record of all the incidents of site.\nKeep all the checklists and records updated related to Fire equipment’s maintenance and training records.Reporting:You will be reporting to the Fire Safety Manager/ Building Manager as the case may be.Sound like you? Here is what we’re looking for:Being Analytical and MeticulousYou will ensure that all fire and life safety systems installed in the premises are working in an effective and efficient manner; and provide criteria on determining the number or type of fire equipment’s needed in a given area.QualificationsYou will have a Diploma/Degree in Fire Engineering OR Fire Safety with work experience of 3-5 years.If you have a good knowledge of current fire suppression and firefighting techniques along with knowledge of the principles and practices involved in emergency medical services, you will be our preferred candidate.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package. Apply Today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}