{
    "Job ID": "69867152",
    "Description": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment.  The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and ResponsibilitiesLead and organize Supply Chain pursuits and Practice Development initiatives\nDeliver Supply Chain projects successfully\nDevelop external eminence across the sub-capabilities in Supply Chain\nPromote and foster collaboration between practitioners in SAP\nPromote an effective forum for sharing Supply Chain expertiseRequired Technical and Professional Expertise5-12 Years of SAP Functional experience specializing in design and configuration of SAP modules using PI\nHands on SAP PI/PO integration experience.\nYou should have at least one HANA Cloud Integration (HCI) project experience Ability to integrate Cloud applications with On Premise applications and Cloud with Cloud expertise with Open sSurce web frameworks such as Web Services, CXML, HTML5, jQuery, CSS3, JSON, JavaScript, AJAX\nDemonstrable experience in using PI/PO tools (mapping tools/editors) and proficient in different mapping styles (Graphical Mapping, Java Mapping, XSLT Mapping) and Interfaces using at least Advanced Adapter Engine (AAE) in PI 7.1 Ehp1\nExtensively working on PI Adapters (EDI, JDBC, HTTP_AAE, I Doc, AAE, RFC, File, XI, SOAP, SFTP, Ariba Network Adapter and JMS). Expertise in designing interface solution based on Functional Specification, and also reviewing technical specificationsPreferred Technical and Professional ExpertiseHands on experience in SAP PI 7.3.1 or SAP PO 7.4 or SAP PO 7.5 modules\nWith all the above said, we wish you outstanding success in your career and encourage you to bring your best self to work with IBM.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}