{"Job ID": "69866871", "Description": "Job Number 23167190 Job Category Housekeeping & Laundry Location The St. Regis La Bahia Blanca Resort Tamuda Bay, 267 Route Fnideq, Fnideq, Morocco, Morocco VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Respond promptly to requests from guests and other departments. Fill cart with supplies and transport cart to assigned area. Enter guest rooms following procedures for gaining access and ensuring vacancy before entering. Replace guest amenities and supplies in rooms. Replace dirty linens and terry with clean items. Make beds and fold terry. Clean bathrooms. Remove trash, dirty linen, and room service items. Check that all appliances are present in the room and in working order. Straighten desk items, furniture, and appliances. Dust, polish, and remove marks from walls and furnishings. Vacuum carpets and performs floor care duties (e.g., in guest rooms and hallway). Follow all company and safety and security policies and procedures; report any maintenance problems, safety hazards, accidents, or injuries; complete safety training and certifications; properly store flammable materials. Ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information. Welcome and acknowledge all guests according to company standards; anticipate and address guests’ service needs; assist individuals with disabilities; thank guests with genuine appreciation. Speak with others using clear and professional language. Support team to reach common goals. Ensure adherence to quality expectations and standards. Move, lift, carry, and place objects weighing less than or equal to 25 pounds without assistance and in excess of 25 pounds with assistance. Ability to push and pull a loaded housekeeping cart and other work-related equipment over sloping and uneven surfaces. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Stand, sit, kneel, or walk for an extended period across an entire work shift. Grasp, turn, and manipulate objects of varying size and weight, requiring fine motor skills and hand-eye coordination. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Combining timeless glamour with a vanguard spirit, St. Regis Hotels & Resorts is committed to delivering exquisite experiences at more than 50 luxury hotels and resorts in the best addresses around the world. Beginning with the debut of The St. Regis hotel in New York by John Jacob Astor IV at the dawn of the twentieth century, the brand has remained committed to an uncompromising level of bespoke and anticipatory service for all of its guests, delivered flawlessly by a team of gracious hosts that combine classic sophistication and modern sensibility, as well as our signature Butler Service. We invite you to explore careers at St. Regis. In joining St. Regis, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Morocco", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}