{"Job ID": "69868529", "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of a Consultant SpecialistIn this role, you will:Be an expert in analysis of requirements and able to provide technical inputs and estimation quickly.\nFollow all processes and guideline for zero defects and follow guidelines for quality and delivery set in organization.\nInnovate and improve the velocity of team.\nSolve queries and issues quickly and correctly by unblocking the blockers.\nSupport for production issues and CR deployments.\nBe able to effectively communicate with stakeholders and external teams.\nBe able to highlight risk and blockers in advance , with the impact on timelines and delivery.\nLead the team technically and as and when required in sprint and PI events.\nCollaborate with Enterprise/Solution Architects, Business Analyst to deliver high quality APIs to enable reusability in the Group\nProvide professional consultancy/support timely for application teams’ queries/requests\nEnsure the technical design/code structure is technical coherent, future proof and compliance with technology standards and regulatory obligations\nWork with Java/COBOL/RPG experienced developersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}