{"Job ID": "69867102", "Description": "Step into the future with us. As an avant-garde real estate agency in Dubai, we are at the nexus of innovation and property. As we set our sights on transcending traditional boundaries, we're on the lookout for an HR Manager. Someone who not only understands the exhilaration of start-ups but also the distinct dynamics of the real estate arena.Role Overview: Harness your HR expertise to craft and champion initiatives that sync with our pioneering vision. From recruitment to retention, your role is pivotal in cultivating an environment where innovation thrives.Key Responsibilities:Pioneer progressive recruitment strategies, focusing on both frontline and leadership talent acquisition.\nFoster collaborations with department leaders, ensuring recruitment efforts are in lockstep with our innovative direction.\nDive into the vast oceans of recruitment platforms, adopting groundbreaking tactics to draw top-tier talent to our visionary agency.\nUphold meticulous standards in conducting candidate reference and background checks.\nCreate and curate state-of-the-art training and development programs, pushing boundaries and setting industry benchmarks.\nNavigate the realms of performance management, guiding teams towards achieving their zenith.\nRadiate exceptional communication, both written and verbal, becoming the linchpin between HR objectives and company-wide understanding.\nCommit to making every candidate's experience not just positive, but extraordinary.Qualifications:Comprehensive understanding of the UAE's labor legislation.\nBetween 3-6 years in the HR sector, with a significant emphasis on recruitment.\nSystematic yet agile, striking a balance between meticulous planning and innovative execution.\nStellar communication skills paired with an ability to connect and inspire.\nA forward-thinking approach, coupled with a hunger for continuous growth and learning.\nProficient, articulate, and driven by results.Your Day-to-Day:Lead the vanguard in innovative recruitment, targeting a diverse array of roles.\nChampion the full spectrum of recruitment: from conceptualizing the ideal hire, sifting through potential talent pools, to ensuring our company ethos resonates in every interview.\nRegularly apprise stakeholders on recruitment dynamics and insights.\nMeasure, monitor, and mold recruitment KPIs, ensuring continuous refinement and excellence.\nOversee new talent integration, ensuring they're not just onboard but also on-par with our visionary trajectory.\nContribute to, and at times redefine, the blueprint of corporate training in the real estate domain.\nSeamlessly orchestrate HR initiatives, ensuring they echo our innovative heartbeat.Embrace this opportunity to redefine HR in the real estate sector. At our core, innovation drives us, and with you, we aim to reshape the Dubai real estate landscape. Join us, and let's make history together.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}