{
    "Job ID": "69869127",
    "Description": "Job DescriptionWhen you’re part of the team at Thermo Fisher Scientific, you’ll do important work that supports a powerful mission. With revenues of $17 billion and a track record of stability and consistent growth, we’re uniquely able to give our people the resources and chances to create significant contributions to the world.Minimum Requirements/Qualifications:Typically requires 3+ Years of relative experience inMainframe Batch & Console operations.\nKnowledge and use of job scheduling software- CA-7 / CA-11 products.\nKnowledge with hands on experience in z/OS environment –MVS, JES2, ISPF, JCL.\nShould be knowing basic commands onMVS, JES2, DB2 and CICS\nPRE/POST IPL Process – Shutdown / Startup process for IDMS, DB2 and CICS.\nShould be able to handle console messages, WTOR’s and resolve Contention issue.\n2-year technical education beyond high school, equivalent work experience or a combination of both is acceptable.\nTo work any shift assigned including weekend days and holidays as part of a standard schedule is a must.\nAbility to work overtime / alternate shifts as needed and possibly with short notice.\nMust be reliable and dependable; flexible to changing shifts to ensure proper staff coverage during planned / unplanned absences or special business processing times such as Quarter End / Year End.\nability to learn newer technologies in support of the job.\nAbility to balance multiple simultaneous tasks in dynamic and fast paced situations, prioritize them accordingly and react quickly to issues is crucial and a must to be successful within this role.\nAbility to follow implicit instructions when needed but also use experience and to \"think creatively\" when solving issues. Needs to understand deviances from the norm and resolve using prior experiences and resources available.\nProven initiative and follow-through; ability to work with minimal intervention or follow up and see tasks through to completion without continual intervention or follow-up.\nProven verbal and written communication skills and the ability to communicate effectively expertly with a diverse group, executives, managers, service partners and domain experts.\nGood partnership & teamwork skills\nInitiative to continually find opportunities for improvement or add additional business value. Ability to work with others to drive those ideas to implementation / completion.\nMust be able to walk, sit and/or stand for extended periods of time as needed.\nAbility to travel to other sites if needed (this is encouraged to be a very low percentage of time if at all).The work environment characteristics described here are representative of those an employee encounters while performing the essential duties of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Strongly preferred but not required:In addition to theMinimum Requirements/Qualifications,Prior experience in an IT Operations support role (Network Operations Center, Command Center Operations etc.) performing hands-on IT Infrastructure & Application fix and resolution.\nFamiliarization of ITIL processes (Event, Incident, Change, Problem, etc.).\nExperience using ServiceNow or other incident ticket tracking system.\nExperience using major telecommunications' vendor’s ticketing system.\nExperience using Orion SolarWinds, Splunk, Datadog or other Event Management/Monitoring tools.Entry level cloud experience.As Thermo Fisher Scientific is a public company governed by SOX, PCI, FDA and other regulatory agencies/policies, a key responsibility for ITOC staff is to ensure that appropriate artifacts are assembled and retained in the appropriate systems for audit purposes. Additionally, personnel must stay in sync with company’s Global IT Policies & Procedures.At Thermo Fisher Scientific, each one of our 120,000 outstanding minds has a unique story to tell. Join us and give to our unusual mission—enabling our customers to make the world healthier, cleaner and safer. Apply todayhttp://jobs.thermofisher.com.Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}