{
    "Job ID": "69869750",
    "Description": "Company:Job Area:General Summary:Key job responsibilities may include a subset of the following:Developing machine learning algorithms for advanced imaging features (low-light, next-generation sensors, vision and scene understanding etc.) \nWork on training strategies and supporting deployment and commercialization for the machine learning features\nWork on system and algorithmic design changes to improve machine learning inference speed\nDriving regular engagements with software/test teams towards the ML feature commercialization on Qualcomm platformsMinimum qualifications:Bachelor's OR Master’s degree in Science, Engineering, or related field, with 7+ years’ working experience in machine learning and deep network architectures \nWorking experience with machine learning framework/packages (e.g, PyTorch, TensorFlow, Keras etc.)\nStrong background in image and signal processing, statistics, and data analysis.\nStrong programming skills and working experience in C/C++  and Python.Preferred qualifications:Background in color science, and image signal processor pipelines\nKnowledge/working experience in computer vision algorithms\nGood communication skillsEducational requirements:Required: Master’s, Computer Engineering and/or Computer Science and/or Electrical Engineering\nPreferred: Doctorate, Computer Engineering and/or Computer Science and/or Electrical EngineeringKeywords: Machine learning, Image Processing, Camera, ISP, Optimization, Computer VisionMinimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}