{
    "Job ID": "69866796",
    "Description": "Amazon’s technology business is carrying on that tradition while leading the world in Cloud technologies. As a member of the AWS Support team in AWS India, you will be at the forefront of this transformational technology with interactions with leading companies in this space and engineers within Amazon developing the capability. You will be surrounded by people that are smart, passionate about cloud computing, and believe that world class support is critical to customer success. AWS Support provides technical support to a global list of customers that are building mission-critical applications on top of AWS services.\nThe AWS India Support team is seeking an experienced Operations or Support Manager based in India to lead a team of 15-20 Support Engineers providing world-class support on all AWS offerings (http://aws.amazon.com/). Our customer facing Support Engineers resolve customers’ technical issues ranging from general guidance through technical deep-dives identifying and resolving complex configuration and 3rd party integration issues. Support engineers also develop many of their own tools and interact heavily with their peers developing the offerings.\nApart from working on a broad spectrum of technical issues, an AWS India Support Manager may also coach/mentor new hires, develop internal and external facing contents, deliver trainings, partner with development teams on complex issues or contact deflection initiatives, participate in new hiring, write tools/script to help the team, or work with leadership on process improvement and strategic initiatives.\nOur Engineers are also the “voice of the customer” and have a strong voice into the development teams for recurring issues or feature requests. As we operate on a follow-the-sun model, with Support Engineering sites located globally, there is no after hours on-call or mandated overtime in this role!\nA suitable candidate would be someone who is extremely customer focused, who could multi-task and utilize both written & verbal communication skills to help our diverse range of customers resolve their complex technical issues.\nA day in the life\nKey expectations of the AWS India Support Manager include:\n• Manage the day-to-day operations of the shift, ensuring the team in India is staffed and SLA commitments are met.\n• Drive personnel management ensuring the engineers have what they need to provide best-in-class support.\n• Participate in Hiring Process to hire and build/grow team of Support Engineers in India.\n• Influence Sr. Support Engineers and development teams to improve the customer support experience.\n• Propose, drive, and implement initiatives within the support organization to maximize the customer support experience.\n• Managing the engineers in the team effectively to keep their focus on the customers as well as develop their own career.\n• Handle escalations and guide engineers to the proper teams by diving deep into the problem.\n• Drives effective business and technical discussions.\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n• 9+ years of experience in technical support, engineering or operations environment, 4+ of which should be in managing technical teams.\n• Highly motivated and passionate about technology – should have good understanding of the technology that the person is managing.\n• Proven track record of driving improvement programs in the operations, engineering and support fields.\n• BE/B.Tech or equivalent/higher degree preferred.\n• Proven track record of delivering results through people, business and operations management.\n• Hands on experience in one of the technical domains –Cloud Exposure, Strong BigData & related Technologies, Database/DWH, AIML, Gen AI skills.\n• Strong verbal and written communication skills, which will be key in driving customer communication during AWS critical events.\n•International experience is an added bonus.\n•The Amazon Web Services business requires innovative thinking balanced with a strong customer and quality focus. This leader must have a track record of achieving that balance.\n•AIML skills is preferred.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}