{"Job ID": "69866372", "Description": "Who we are looking forWe are looking for a Business/Operational Auditor, Assistant Vice President, who will be an independent advisor, advising management on risks related to strategic initiatives, organization, process and systemic changes. In this role you will be a subject matter specialist and controls experts, providing knowledge and experience in key risk areas. You will be a problem solving partner, looking ahead to help management envision future risks and opportunities. In this role you will be based out of Bangalore and be part of the team that oversees Global Human Resources, Global Security and Legal.This role can be performed in a hybrid model, where you can balance work from home and office to match your needs and role requirements.Why this role is important to usThe team you will be joining plays an important role in the overall success of the organization. Across the globe, institutional investors rely on us to help them manage risk, respond to challenges, and drive performance and profitability. To make that happen we need teams like yours to help navigate employees and the organization as a whole. In your role you will strive for cutting-edge solutions, that are straightforward and scalable. You will help us build resilience and execute day to day deliverables at our best. Join us if making your mark in the financial services industry from day one is a challenge you are up for.What you will be responsible forAs Business/Operational Auditor, Assistant Vice President you willPlan and/ or execute audits according to a risk based methodology in line with Division and Industry Standards.\nSupervise and direct the execution of risk and control assessments, along with effective and efficient testing of key controls.\nReview documentation of audit work and conclusion of audit tests results and overall effectiveness of controls.\nDraft audit reports in accordance with Division standards to clearly communicate key risks and core audit issues.\nWork in partnership with business area management to communicate expectations and manage any project issues that may arise throughout the audit.\nEscalate audit issues to senior management and interact with business line and senior managers to develop and negotiate solutions.\nDevelop and maintain a thorough understanding of audits and assigned functions (Global Human Resources, Global Security, Legal) including utilization of technology, products, organizational activities, and systems.\nEstablish and maintain strong and effective client relationships within the business and supporting IT organizations and assist management in the understanding and adaptation of internal control principles.\nContribute to change initiatives by participation in system and business process change initiatives with strategic corporate significance by providing input on operational and technological risk issues.\nInvest in your development by expanding, maintaining and applying current knowledge of audit industry best practices, regulatory expectations, and subject matter.What we valueThese skills will help you succeed in this roleStrong team leadership skills which include creating an environment of trust, soliciting diverse views from team members and supervising, coaching and developing staff.\nHigh degree of professionalism.\nAble to manage complexity, multi-task and work independently in non-routine situations.\nEffective communication skills (both written and verbal) and interpersonal skills.\nProven ability to research, interpret and apply regulatory requirements.\nInterest in developing as a leader within Corporate Audit.Education & Preferred QualificationsBachelor’s degree required.\nProfessional audit certifications preferred; a CPA, CIA or CISA is a plus.\n8+ years of experience with assessment and testing of operational and/or technology-related controls, including 2+ years leading and supervising audit engagements.\nExperience in either public accounting or financial services internal audit preferred.\nWorking knowledge of Human Resource processes, particularly payroll, compensation and/or benefits.Additional requirementsTravel up to 15% may be required.Are you the right candidate? Yes!We truly believe in the power that comes from the diverse backgrounds and experiences our employees bring with them. Although each vacancy details what we are looking for, we don’t necessarily need you to fulfil all of them when applying. If you like change and innovation, seek to see the bigger picture, make data driven decisions and are a good team player, you could be a great fit.About State StreetWhat we do. State Street is one of the largest custodian banks, asset managers and asset intelligence companies in the world. From technology to product innovation, we’re making our mark on the financial services industry. For more than two centuries, we’ve been helping our clients safeguard and steward the investments of millions of people. We provide investment servicing, data & analytics, investment research & trading and investment management to institutional clients.Work, Live and Grow. We make all efforts to create a great work environment. Our benefits packages are competitive and comprehensive. Details vary by location, but you may expect generous medical care, insurance and savings plans, among other perks. You’ll have access to flexible Work Programs to help you match your needs. And our wealth of development programs and educational support will help you reach your full potential.Inclusion, Diversity and Social Responsibility. We truly believe our employees’ diverse backgrounds, experiences and perspectives are a powerful contributor to creating an inclusive environment where everyone can thrive and reach their maximum potential while adding value to both our organization and our clients. We warmly welcome candidates of diverse origin, background, ability, age, sexual orientation, gender identity and personality. Another fundamental value at State Street is active engagement with our communities around the world, both as a partner and a leader. You will have tools to help balance your professional and personal life, paid volunteer days, matching gift programs and access to employee networks that help you stay connected to what matters to you.State Street is an equal opportunity and affirmative action employer.Discover more at StateStreet.com/careersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}