{"Job ID": "69867456", "Description": "QA Lead Engineer (Contract), Letsbloom, SC Ventures-(2300017477)Job:VenturesPrimary Location:Asia-India-PuneSchedule:Full-timeEmployee Status:Fixed TermPosting Date:14/Sep/2023, 9:17:06 AMUnposting Date:14/Oct/2023, 10:59:00 PMQA Lead Engineer, Letsbloom, SC Ventures, PuneAt Letsbloom, we are enabling organisations operating in regulated industries, such as financial services, healthcare and government, to keep pace with security trends and regulatory demands.Our trusted infrastructure empowers clients to on-board future-ready, fail-proof applications on any cloud, with security and compliance embedded throughout the application development lifecycle. We help our clients stay ‘secure by design’ and ‘compliant by default’.We are a group of tech enthusiast and looking to work with people who are passionate about what they do. If you are someone who is curious, passionate, determined and would like to grow with organisation this is one of its kind opportunity for you to explore.Role Responsibilities·To develop and execute exploratory and automated tests to ensure product quality.·Designing and implementing tests, debugging and defining corrective actions.·Review system requirements and track quality assurance metrics (e.g. defect densities and open defect counts.)·To conducting tests before product launches to ensure software runs smoothly and meets client needs, while being cost-effective.·To provide end-to-end solutions to software quality problems.·Monitor all stages of software development to identify and resolve system malfunctions to meet quality standards.Technical Skills and Ideal Candidate·5 to 7 years of experience in a similar QA Engineering role·Bachelors/ Masters degree in Computer Science Engineering from a recognized University·Testing Skills: Functional Testing , Integration Testing, API Testing , Regression Testing , Automation Testing (Selenium)·Programming Language: Java·PM Tools– Jira·DBs: SQL, MySQL·Performance Monitoring·Mentoring and leadership experience·Good communication and interpersonal skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}