{"Job ID": "69866206", "Description": "Excited to grow your career?We value our talented employees, and whenever possible strive to help one of our associates grow professionally before recruiting new talent to our open positions. If you think the open position you see is right for you, we encourage you to apply!Our people make all the difference in our success.--------------------------------------------------------------Position Overview:Citi Treasury and Trade Solutions (TTS) provide services across the globe covering 96 markets & Transacting in 144 currencies. Performance testing & engineering is key to establish service level agreement & achieve excellent user experience. Non-functional testing group supports 100+ application across multiple line of business within TTS Cash management group. TTS Cash NFT team is looking for IT Quality Sr Analyst, AVP – C12 (Performance Testing Architect) who will take ownership of multiple applications Performance testing solutions & play SME role to engage with Development, Architect & Business team to gather the requirements & design the Performance testing approach to certify the application changes before Production deployments. This role required to work closely with Global NFT team & expected to lead & mentor team. Position is expected to play dual role of Architect & NFT practice manager for assigned LOB or multiple critical applications on need basis. Person should have strong knowledge to lead Non-Functional Testing (Performance Testing & Engineering) for applications with complex architecture and should have exposure in monitoring, profiling & analyzing with industry standard tools.Responsibilities:This role is for IT Quality Sr Analyst, AVP – C12 (Performance Testing Architect) & expected to have SME level knowledge to drive the non-functional testing solution for applications with complex architecture, Middleware application along with Service virtualization & Data Management. Overall responsibility of Performance Engineering and Performance Testing Tasks for engaged projects - including strategy, estimation, planning, execution oversight, metrics reporting and risk management. Bottom-line responsibility for providing thought leadership and expertise concerning Non Functional Testing for the team, its members and the deliverables. Manage, Train and Mentor (as needed) Performance Engineers and Testers in the team.Primary Skills: Performance Testing & Engineering. \nTools: MF Performance Center with Web, Web Services (Rest, Microservices), MQ (Java), Database Testing (ETL), AWR analysis, AppDynamics Profiling, Kibana & Log Analysis, CA Service Virtualization (LISA).\nAbility to assess & design the standalone component or End to End Testing approach connecting multiple components in payments flowThe implementation and execution of a performance test framework for non-functional testing (load, volume, stress, capacity and scalability) which validate business non-functional requirements.\nA strong knowledge of Monitoring tools that allow for analysis of system health and potential bottlenecks. i.e. App Dynamics, Kibana, BMC TrueSight, etc\nProduce and maintain Key Performance Indicators (KPIs) around the testing performed. Manage best in class service quality and manage SLA/OLAs accordingly\nIn-depth knowledge and working experience with Performance Center, App Dynamics, HP Site scope and other latest Performance Engineer & Performance Testing tools (i.e. CA Lisa Virtualization) and Open Source performance testing tools (Apache JMeter, WebLOAD etc)\nA strong knowledge of / experience with profiling application end to end performance and identifying application and hardware / operating systems bottlenecks\nExperience in identifying and providing tuning recommendation for various infrastructure components such as Application Servers, Database Servers, Message Buses and Web Servers\nExperience of working in Agile testing methodology\nGood collaboration & ability to communicate with technical & non-technical stakeholders\nSupport active contribution in creating performance testing artefacts including Performance test strategy and test plans/estimates, optimization & KPI reports.\nCollaboration with other teams including Development, Architect, Business and Production Support\nIdentify, recommend, and implement framework, strategies and toolsets to optimize test execution, expand test coverage, and reduce risk\nStrive towards the continuous process improvement & test framework / scripts optimization to achieve efficient testing solutions\nAttention to details & ability to automate repetitive tasks\nExhibits good understanding of procedures and concepts within own technical area and a basic knowledge of these elements in other areas.\nRequires basic understanding of how own area integrates within IT Quality to achieve objectives.\nGood to have technical & programming knowledge with one or more languages i.e.  Java, JavaScript, C#, Python, Ruby, etc\nBusiness domain knowledge of Corporate Digital Channels, Payments, Receivable & Treasure will be added advantage\nGood to have exposure for developing stubs and driversQualifications:10 to 15 years of experience in an IT Quality role. Ability to work independently or within groups on projects assigned\nRequires in-depth knowledge, understanding and analytical thought. Exhibits comprehensive knowledge of several areas within IT Quality and has a good understanding of the industry.\nStrong understanding of testing processes. In depth understanding of the Systems Development Lifecycle and solid experience in several phases of systems development, preferably in testing program management. Must demonstrate confidence in their abilitiesEducation:Bachelor’s/University degree or equivalent experience-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}