{"Job ID": "69866285", "Description": "CFC Enablement is a service vertical within the CFC Enablement team, driving performance, scale, simplicity, and efficiency for the sales force. This role will be responsible for leading CFC Enablement service delivery activities within the EM Asia region that allow the business to drive quality at scale. The CFC Enablement – PK&PH (Manager) role will strategically collaborate with Biopharma Ops Partners (BOPs), and other colleagues within CFC Enablement to operationalize key services like sales force targeting, deployment and alignment, call planning, and virtual selling. The main market for this role will be PK & PH but may also expand to other markets within the EM Asia region based on the agreed focus processes.The role will apply technical and strategic delivery knowledge and insights to partner with the Service Design Owner for CFC Enablement as well as GTMx product owners as needed to support and enable service improvements within this service vertical.Key Attributes: Accountable for delivering the CFC Enablement remit within Pk & PH while applying skills and knowledge to enhance service delivery continuity and quality.Responsible for the below CFC Enablement activities in PK & PH:Operational focused (day to day) stakeholder engagement\n\nSales Force Targeting\n\nSales Force Deployment & Alignment\n\nCall Planning\n\nVirtual Selling\n\nSupport for customer facing colleagues in obtaining access to hospital systems in an efficient, timely, and cost-effective manner, while remaining compliant\n\nSDM (Sales Data Management)Enables Service Design Owner / Bold Moves team to implement service improvements to CFC EnablementCollaborates with the CFC Enablement Lead – EM Asia and other Regional Leads to deliver strategic solutions that advance and optimize the CFC Enablement under a globally connected, locally-embedded modelReports to CFC Enablement EM Asia Lead This role will be a key member of the CFC Enablement – EM Asia Cluster team.Drives CFC Enablement services in PK & PH: Field Force sales call/detail planning and activities with processes and tools (e.g. Sales Force Automation (SFA), Digital Rep Advisor (DRA))\n\nEnables customer segmentation, sales force sizing, call plans and sales performance projections\n\nBuilds efficient and optimized sales team structures, reporting hierarchies and geographical boundaries (maps)\n\nEnables virtual communications, engagements and details between CFCs and HCPS\n\nSupport for customer facing colleagues in obtaining access to hospital systems in an efficient, timely, and cost-effective manner, while remaining compliant with Pfizer and hospital system policies. Credentials include, but are not limited,to background checks, drug screening, and medical testing.Exercises independent judgement to improve CFC Enablement service delivery within PK & PH:Streamlines and scales systems with central support.\n\nIdentifies needs for innovation or operational support. \n\nTakes appropriate / compliant risks to advance innovative processes and methodologies for moderately complex problems with supervisory support where needed.\n\nUnderstands the CFC Enablement Design and Global Vertical service catalog definition, processes, enhancements, and strategies.\n\nContributes to the standardization, optimization and automation towards higher efficiency, better service quality, and faster solution provisioning.\n\nEnsures the collection and provision of service delivery data and insights to support further service delivery optimization, effectiveness of daily service delivery operations and to provide insight for Biopharma Ops\n\nEnsure the usage of Biopharma Ops service delivery tools and platforms.\n\nImproves quality, consistency (One Pfizer), and compliance across BUs and supported markets.\n\nEnsures all service delivery meets agreed in place quality plans in collaboration with CQO and HR Global Compensation to meet compliance policies, guidelines, and procedures.Defines priorities and allocates resources to drive efficient and effective HCP engagement:Possesses a deep understanding of PK & PH business landscape and BU strategies to determine key priorities and their impact on CFC Enablement activities.\n\nProactively engages with Biopharma Ops Partners (BOPs) and regional colleagues to understand and 1) ensure alignment of Biopharma Ops’ client strategies in supported markets and 2) determinesoptimal resource allocation and investment that enables efficient and high-quality HCP engagement.\n\nManages his/her budget to ensure service delivery commitment and financial expectations are met with supervision.\n\nWill align, contribute to, and implement the new CFC Enablement Design capabilities that are part of the vertical roadmap and strategy.Qualification:Bachelor's degree + Masters (Nice to Have).\nStrong commercial experience, preferably in CFC Enablement work.\nFluency in English required.\nFurther local language skills for supported cluster markets preferred.\nCross-BU and/or diversity of job experiences\nProven track record of delivering business performance.\nAbility to manage complex and multifaceted projects over extended timelines.\nDemonstrated ability with leading innovation/transformation and thought partnership with stakeholders.\nDrive for optimization/excellence.\nDelivery of exceptional customer services and experiences.\nExperience in contributing to the team culture.\nStrong ability to drive collaboration and foster highly productive, functional relationships.\nDemonstrated agility and ability to independently drive program completion in expedited timelines.#LI_PFEWork Location Assignment: FlexiblePfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}