{"Job ID": "69869577", "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The Opportunity:\n As a Cloud Application System Engineer, you will provide support for several of OpenText’s commercial cloud-based messaging platforms, with a focus on application services running on Solaris, Linux, and Windows based systems.    You are great at:\n Evaluation, planning, configuration, and installation of all internally developed and third party commercial & open-source application software in our test and production environments, and where possible, automate the installation of these tasks.\nParticipate in assigned short and long term projects that vary in size, scope and complexity, where interaction with internal and external organizations/customers/vendors is required.\nPerforms and manages continuous system monitoring, verifying the integrity and availability of all systems and key processes.\nRapidly recovers system failures to ensure high service availability. Identifies and escalates situations requiring urgent attention.\nRespond to and troubleshoot/resolve assigned incident tickets\nShare in the daytime and after hours on-call support rotation (during both business and off-hours)\nTake part in the monthly and quarterly scheduled night or weekend maintenance work\nActively participate in the establishment and maintenance of our PCI, HI Trust SOC and other certifications\n What it takes:\n Bachelor’s degree. Equivalent work-related experience or equivalent combination of education and experience will be considered.\nIntermediate knowledge of shell scripting and good knowledge of at least one language that can be used for scripting, such as Perl/Python/Bash/PHP/Ruby or similar.\nIntermediate knowledge of Windows server operating system, DevOps tools (Ansible, Git, etc.), virtualization platforms including VMware\nStrong knowledge of Solaris and Linux operating system\nStrong knowledge of common web application environments, such as SMTP, FTP, MQ, JBoss, Apache httpd, Apache Tomcat, Nginx, etc.\nStrong knowledge of and interest in system/network security and understanding of data protection and encryption techniques\nGood understanding of High Availability and Disaster Recovery, including clustering and data replication techniques\nPractical knowledge working with monitoring (HP Omi, Zabbix or similar)\nPractical knowledge of databases (MySQL, PostgreSQL, Sybase)OpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at 1-800-499-6544.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}