{
    "Job ID": "69866418",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! We are looking for a Java developer for SAP Business Network for Logistics.What you'll doIn your role as a Developer, you will be responsible for the design, coding, testing, and quality assurance in a development team. You will assess and solve issues in new or existing code, and work with high attention to detail, reliability, and efficiency. You will collaborate closely with your team members to ensure success. In your day-to-day you will:• Lead development activities by taking end-to-end ownership of features from design and development through to deployment.• Collect requirements for the Business Network for Logistics Freight Collaboration services and design and develop the services in collaboration with others in a cross-functional team.• Write clean and well-tested code. Discuss, align, and decide on concrete modelling of entities in selected domains relevant for the SAP Business Processes, e.g., Logistics, Transportation Management, Supply Chain Collaboration• Collaborate closely with developers and architects from the Business Network and all lines of businesses to come to feasible and adaptable domain models. Work as part of the Scrum Team.What you bringAre you analytical, self-motivated, and enjoy problem solving? Are you skilled in time management and task prioritization? Do you enjoy continuous learning and working efficiently in a fast-paced environment? If this sounds like you, do you also bring:•    Degree/master’s degree in computer engineering or equivalent subject with minimum 4+ years of experience in Java and related technologies like Spring, REST\n•    Good knowledge of SAP UI5/ SAP Cloud Platform Integration preferred\n•    Strong grasp on relational database system such as SAP HANA•    Experience of designing with HLD (High level Design) and SDD (Software Design Description) knowledge\n•    Experience of working in an Agile Software development environment and teams\n•    Exposure to Microservices based applications, Spring bootMeet your team :Together with your team, you will work on the SAP Business Network for Logistics product. \nSAP Logistics Business Network (LBN) is SAP's new collaborative cloud network that empowers logistics businesses to work together more easily than ever before, share insights, and gain transparency throughout your supply chain. LBN is a cloud-service solution based on SAP Business Technology Platform.\nThe team develops an industry-leading new class of freight collaboration applications as microservice-based cloud services. We are highly motivated and skilled engineers with locations in India, Germany, the US, and China.\n We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 380973  | Work Area: Software-Design and Development  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}