{"Job ID": "69865962", "Description": "Overview The purpose of this role is to lead the planning and release management team in ensuring software and technology products are delivered to the Europe sector (Sector) in a timely, efficient, and high-quality manner, while also fostering a culture of continuous improvement and collaboration among team members and stakeholders. This person will play a dual role as both a senior manager managing the Europe release planning team agenda and a hands-on individual contributor, responsible for managing his own portfolio of releases while also leading and managing a team of release managers. As a team lead: Sector: the person will be responsible for providing guidance and mentorship to the release planning team, ensuring that they have the necessary resources, skills, tools and support to carry out their responsibilities effectively. The person will also be responsible for overseeing the entire release planning process, including planning, scheduling, coordinating, and monitoring IT solutions' deployments across the Europe region. Global: this person will collaborate with global team to facilitate adherence to global standards, partner with global peers to design and improve release management services and best practices, implement and enable DevSecOps operating model from release management point of view, partners with global peers to improve the IT Planning tools and capabilities As an individual contributor, the person in this role will continue to be responsible for their own portfolio of releases, working closely with other stakeholders, such as product managers, development teams, and quality assurance teams, to ensure that releases are delivered on time, meeting the corresponding SoX controls and governance and that all releases are thoroughly tested and validated before they are deployed to production. The person in this role will also be responsible for identifying and implementing process improvements to enhance the efficiency and effectiveness of the release planning process. The duality of this role requires the person to be highly skilled at managing multiple responsibilities and priorities, while also being able to provide effective leadership and guidance to the release planning team. This will require strong communication, collaboration, and problem solving skills, as well as the ability to make sound decisions under pressure. Responsibilities Sector: Supports the delivery of release planning, systems availability and compliance, execution and reports Partner with Europe IT projects to Release and Change management deliverables Provides support for the delivery of release change to the production environment Support with the administration of release planning tools including e.g. Charm, ServiceNow, SharePoint, etc. Attends and provides input requirements to relevant governance groups e.g. Release Advisory Board (RAB), Change Advisory Board (CAB), Technical / Functional review boards, etc. Support delivering the strategy for release management for NON-SAP Applications in Europe Assists in governance/alignment processes with the global functional teams to manage standard solutions and business processes, partners with IT Service management and Controls teams as needed Coordinate the planning for Europe SAP maintenance activities, oversee and approve the weekly execution according to the plan with the relevant technical teams Global: Collaborates with global team to facilitate adherence to global standards Partner with global peers to design and improve Release management services and best practices, implement and enable DevSecOps operating model from Release management point of view Partners with global peers to improve the IT Planning tools and capabilities Qualifications 10+ years working on IT-related roles 5+ years working on release planning or project management roles Experience in release management processes and methodologies Strong understanding of software development lifecycle (SDLC) methodologies and best practices Experience with Agile methodologies and frameworks, such as Scrum and Kanban Familiarity with ITIL processes and practices. Knowledge of DevOps practices, tools, and principles Experience in risk management and mitigation strategies in release management Ability to troubleshoot and resolve technical issues related to releases Leadership skills, including the ability to inspire and motivate teams Excellent communication and interpersonal skills, with the ability to communicate effectively with stakeholders at all levels of the organization Strong problem-solving and critical thinking skills Ability to work collaboratively with cross-functional teams, including developers, quality assurance, operations, and IT stakeholders Strong project management and organizational skills Ability to manage and prioritize multiple projects and deadlines Strong negotiation and conflict resolution skills Ability to manage change effectively and adapt to evolving business needs Ability to mentor, coach, and develop team members Strong attention to detail and the ability to maintain a high level of accuracy in a fast-paced environmentJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}