{
    "Job ID": "69867255",
    "Description": "SummaryNEOM is a new vision of what the future could be. It’s an attempt to do something that’s never been done before and it’s coming at a time when the world needs fresh thinking and new solutions. Put simply, NEOM will not only be a destination, but a home for people who dream big and who want to be part of building a new model for sustainable living.ENOWA, NEOM’s energy and water company is tasked with the mission of developing a 100% renewable energy system to power NEOM sustainably. ENOWA aims to partner with nature to harness the power of wind, solar and water in full circularity to meet this ambition. Key to the cost effectiveness of the system will be to develop a smart and flexible grid energy system that encourages the active participation of all energy assets in transparent and accessible marketsThe ENOWA Flexibility team is tasked with planning, optimizing and executing a portfolio strategy to unlock system flexibility across 4 pillars (Demand Response of strategic reservoirs, Pumped Hydro Storage, novel Long Duration Energy Storage and Li-Ion Battery Energy Storage Systems-BESS)This role will be the key subject matter expert within the flexibility team to lead the activities around system portfolio valuation and merit orders, flexibility market pool and operations, and all related flexibility regulatory and policy topics as ENOWA and NEOM develops.Key Accountabilities and ResponsibilitiesFlexibility Market Design and Operations       Support the market design and setup of the NEOM flexibility pool and market operations activities- providing technical and analytical content from the perspective of the flexibility portfolio team\nSupport in the establishment of the analysis and evaluation techniques to rank system sources of flexibility and market operation procedures to efficiently unlock their valueRegulation, Codes and Standards Development        Key interface for all energy flexibility regulations, codes and standards activities, standards for enabling energy system flexibility.\nCollaborate with NEOM authority, Energy OS program, technical grid teams, regulations, system operations, market design and market modelling teams on flexibility option pricing, portfolio merit orders, regulations (incl grid codes) and related commercial incentives.\nAttend conferences, and support alignment with Neom and KSA authoritiesInvestments and AnalysisWork with the Flexibility asset development team to understand the economic values of the development portfolio and the relevant strategies and commercial structures that will make them attractive for global investors.\nLead the analysis and assessment of policy and regulatory levers as well as incentives to unlock demand side flexibility\nSupport executive leadership with investment decision appraisals and decision analysis related to the overall flexibility portfolio.Background, SkillsTechnical skills:Thorough understanding of the fundamentals flexibility and power markets systems economics:\nLong term network planning and regulatory best practices.\nNetwork investment decision analysis\nPower systems engineering and economics\nShort term energy balancing markets\nAncillary services marketsIn-depth exposure to system operation and interaction with balancing/system/ancillary services\nCongestion and constraint management\nVoltage and Reactive power management\nFrequency management\nReserve margin.\nSystem stability and inertia.\nNetwork asset options and technologiesGood proficiency in\nIndustrial, mechanical, and electrical processes\nThermodynamics and HVAC system design\nWater pumping and district energy systems\nEnergy storage systems (thermal and electrical)Knowledge and Experience:PreferredMinimum of 5 years’ experience working with either a grid system operator, utility or technical consultant in a planning, investment analysis, balancing and ancillary market development role\nExperience working with energy asset aggregation technology and in short term energy balancing markets.\nKnowledge and understanding of district energy systems and thermal energy storage systems (eg. Solar thermal and Geothermal).\nExperience working with large infrastructure or utility company such as Water, Energy or Rail Transport company to unlock flexible energy operations.\nExperience working with Infrastructure investor and familiarity with effective contracting and infrastructure support incentivesRequired10+ years relevant energy industry experience.\nUnderstanding of the costs/benefit tradeoffs and techno-economic assessment for network asset investments (incl generation and storage)\nUnderstanding of electric utility frameworks for operations and underlying regulations.\nFamiliarity of Virtual Power Plant (VPP) principles and implementation capabilities\nFamiliarity with liberalized wholesale energy markets, trading and balancing markets.\nThorough understanding of decentralized energy technologies and other energy efficiency technologies and their potential commercialization in power markets.\nFamiliarity with the energy transition and opportunities for power grid transformationsOther Skills and Experience:Self-starter, entrepreneurial and with a delivery mindset\nAbility to bring innovative ideas from inception to actual implementation through clear value propositions and roadmaps\nGood interpersonal, written and communication (English) skills.\nAbility to operate in a team-oriented and collaborative environment and flexible and resilient to changes due to the greenfield nature of the projects.\nAbility to manage multiple stakeholder needs and distill complexity to build consensus within a matrix organisation.\nAbility to operate in ambiguity and resilience to a dynamic fast changing environment.QualificationsPreferredMasters and above in a technical subject or economics, econometrics, renewable & sustainable energy, climate change and energy regulations policy managementJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}