{
    "Job ID": "69869700",
    "Description": "Division : PDS - Electronics Hardware\nExperience : Minimum 13 years in power electronics product development\nQualification : ME / Ph.D in Power electronics\nJob Description\nBorgWarner Technical Center India Private Limited, a subsidiary of BorgWarner Inc. is looking for experienced and enthusiastic professionals in the areas of electronics hardware design. This engineering manager position is a key role in the electronics hardware architecture ( HWA) team , delivering integrated hybrid and electrified vehicle solutions.Job Responsibilities:Drive methodology and comptetency delvelopments for Power electronics products.Identify technical solutions for improving product performance and optimize the product performance\nDrive cost optimization ideas for Power Inverters, DC-DC converters , battery packs and HV box\nIdentify and resolve technical issues by co-coordinating with multiple sites, competencies & functional groups.\nCoordinates/Collaborates with Global teams towards Engineering assignments and tasks.\nProvide technical direction, conduct regular project reviews and take appropriate corrective actions.\nDrive new competencies for Mechanical and Electrical analysis procedures\nProactively manage project risks.\nResponsible for Process definition, maintenance and adherence within the project teams.\nWork closely with global counterparts, in meeting overall program needs.\nSupport and drive organizational level initiatives with short term and long term goals.\nStructured problem solving to resolve product failuresDefine and deliver on long term capability development strategy for the electronic hardware Group.\nIdentify engineering quality and efficiency improvement opportunities and promote Continuous Improvement through problem solving techniques like Six Sigma.\nUnderstand the customer requirements and translate to the product requirements.Experience/Skill Requisites:Design and develop  Power Electronic products\nExperience in Computer aided Engineering\nExposure in working with CAE teams  – Mechanical, thermal and electrical analysis\nStructured problem solving skills. Exposure to tools like six sigma\nExperience in planning/tracking project teams supporting multiple regions.\nMulti-disciplinary support exposure on Systems, Software, Verification and Validation functions is desirable.\nWorking knowledge/Understanding standard processes for Embedded Automotive Industry.\nGood analytical, problem solving skills.\nExcellent interpersonal and communication skills\nHighly self-motivated and energetic.\nExposure to simulation tools like ANSYSGlobal Terms of Use and Privacy StatementCarefully read the BorgWarner Privacy Policy before using this website. Your  ability to access and use this website and apply for a job at BorgWarner are conditioned on your acceptance and compliance with these terms.Please access the linked document by clicking here, select the geographical area where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.Career Scam Disclaimer:  BorgWarner makes no representations or guarantees regarding employment opportunities listed on any third-party website.  To protect against career scams, job applicants should take the necessary precautions when interviewing for and accepting employment positions allegedly offered by BorgWarner.  Applicants should never provide their national ID numbers, birth dates, credit card numbers, bank account information or other private information when communicating with prospective employers or responding to employment opportunities online.  Job applicants are invited to contact BorgWarner through BorgWarner’s website to verify the authenticity of any employment opportunities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}