{
    "Job ID": "69866409",
    "Description": "Job Number 23166250 Job Category Sales & Marketing Location Al Messila a Luxury Collection Resort & Spa Doha, Um Al Saneem Street, Doha, Qatar, Qatar VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Leads and manages all day-to-day activities related to the sales function with a focus on building long-term, value-based customer relationships that enable achievement of property sales objectives. Achieves personal booking goals and makes recommendations on booking goals of direct reports. CANDIDATE PROFILE Education and Experience • 2-year degree from an accredited university in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 3 years experience in the sales and marketing or related professional area. OR • 4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 1 year experience in the sales and marketing or related professional area. CORE WORK ACTIVITIES Supporting Developing & Executing Sales Strategies • Works with sales leader to ensure understanding of sales strategy and effective implementation of this strategy for the segment. • Works with management team to create and implement a sales plan addressing revenue, customers and the market for the segment led by the DOS. • Assists with the development and implementation of promotions, both internal and external. Maximizing Revenue • Provides positive and aggressive leadership to ensure maximum revenue potential (e.g., sets example with personal booking goals). • Recommends booking goals for sales team members. Managing Sales Activities • Monitors all day to day activities of direct reports. • Approves space release for catering to maximize revenue (DOS, Group) in the absence of a Business Evaluation Manager. • Participates in sales calls with members of sales team to acquire new business and/or close on business. • Executes and supports the operational aspects of business booked (e.g., generating proposal, writing contract, customer correspondence). Analyzing & Reporting on Sales and Financial Data • Analyzes market information by using sales systems and implements strategy to achieve property’s financial room and catering goals. • Assists Revenue Management with completing accurate six period projections. • Reviews sales and catering guest satisfaction results to identify areas of improvement. Ensuring Exceptional Customer Service • Displays leadership in guest hospitality, exemplifies customer service and creates a positive example for guest relations. • Interacts with guests to obtain feedback on product quality and service levels. • Meets with guests during pre- and post-convention meetings to obtain feedback on quality of product (e.g., rooms, meeting facilities and equipment, food and beverage), service levels, execution against contract and overall satisfaction. • Empowers employees to provide excellent customer service. • Observes service behaviors of employees and provides feedback to individuals. • Incorporates guest satisfaction as a component of department meetings with a focus on continuous improvement. • Executes and supports the company’s Customer Service Standards and property’s Brand Standards. • Participates in and practices daily service basics of the brand. • Executes exemplary customer service to drive customer satisfaction and loyalty by assisting the customer and ensuring their satisfaction before and during their program/event. • Serves the customer by understanding their needs and recommending the appropriate features and services that best meet their needs and exceed their expectations, while building a relationship and loyalty to the company. • Gains understanding of the property’s primary target customer and service expectations; serves the customer by understanding their business, business issues and concerns, to offer better business solution both prior to, and during the program/event. Building Successful Relationships • Develops and manages relationships with key stakeholders, both internal and external. • Works collaboratively with off-property sales channels (e.g., Event Booking Center, Market Sales, GSO) to ensure the property needs are being achieved and the sales efforts are complementary, not duplicative. • Works with Human Resources, Engineering and Loss Prevention to ensure compliance with local, state and federal regulations and/or union requirements. • Attends customer events, trade shows and sales missions to maintain, build or develop key relationships with GSO Managers and customers. Managing and Conducting Human Resource Activities • Interviews and hires management and hourly employees with the appropriate skills to meet the business needs of the operation. • Utilizes all available on the job training tools for employees. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. The Luxury Collection Hotels & Resorts, with over 120 properties in more than 35 countries, offers the promise of authentic experiences that evoke lasting, treasured memories. Our more than 100 years of experience, beginning in 1906 under the Italian CIGA brand – a collection of Europe's most celebrated and iconic properties – serves as a solid foundation as we continuously evolve to exceed the desires of the luxury traveler. From legendary palaces and remote retreats to timeless modern classics, each luxury hotel and resort is a unique and cherished expression of its locale – a portal to the destination’s cultural charms and treasures. If you are someone with an appreciation for evocative storytelling, a keen interest and passion for this destination's heritage, and a desire to deliver genuine, personalized, and anticipatory hospitality, then we invite you on our journey. In joining The Luxury Collection, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}