{"Job ID": "69866390", "Description": "Four Seasons Alexandria, at San StefanoChief StewardInterested individuals should have a huge appetite for development and have demonstrated a skill set for working cooperatively.Looking for a Guaranteed Opportunity, this is the place for you.Interested individuals should have a huge appetite for development and have demonstrated a skill set for working cooperatively. Looking for a Guaranteed Opportunity, this is the place for you.Discover Alexandria  Alexandria is the second-largest city in Egypt – and the most culturally diverse – with a coastline that stretches over 30 km. Palm-lined boulevards, beautiful gardens and wide-ranging historical sites combined with a thriving café culture and convivial inhabitants give the city a bohemian air. Alexandria’s proximity to Cairo – only 225 km – provides an ideal opportunity for a twin-centre stay at Four Seasons Hotel Cairo at Nile Plaza or Four Seasons Hotel Cairo at The First Residence. With a distinctive European flair, the Hotel adds 21st-century elegance to Alexandria’s renowned Mediterranean ambience, setting new standards for beach-side living in the summer capital of the Middle East. Four Seasons Alexandria A seaside glamour on the Egyptian Rivera  Located in the heart of Alexandria overlooking the Mediterranean Sea, Four Seasons Hotel Alexandria holds 154 spacious rooms, suites and beach villas designed by the renowned Pierre Yves-Rochon and is only a 10-minute walk from the Royal Jewelry Museum and 9 km from the Library of Alexandria.  The main complex of the hotel includes 10 outlets including restaurants and bars, meeting rooms, spa, indoor pool and gym.  Opposite the hotel, a long stretched, sandy beach with lush green landscaping unfolds the blue waters of the Mediterranean Sea. It is easily accessible by an under-passage from the hotel. The Beach facilities include 30 beach suites, an infinity seawater pool, a beach restaurant, gym, and kids area.   In addition, the Hotel launches a new project located on the Hotel’s private beach to complete its state-of-art complex on the shores of the Mediterranean. The 15 Beach Villas offer guests the opportunity to rent and stay in a comfortable setting while enjoying more space, privacy and exclusivity, alongside the full complement. With multiple options between one, two or three bedrooms, the villas are suitable for families and couples alike.  This key position requires an individual who1. Reading and oral proficiency in the English language2. Prior knowledge of dish machine, steam cleaning, kitchen, and floor cleaning equipment3. Some supervisory experience in either banquets, restaurants, kitchens or stewarding.4. Knowledge of other languages as may be appropriate.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}