{"Job ID": "69867086", "Description": "Grade Level: L1Location: KarachiLast date to apply: 19th September, 2023What is Experience Services Specialist?Experience Services Specialist will be responsible for managing travel, hoteling and fleet services of employees along with any other related services (e.g pick & drop, vehicle maintenance etc). ESS will also be responsible for fuel card management of employees and company vehicles as well as invoice verification and reporting of travel and fuel cards. Relocation of employees with associated services (travel, hotel stay and household luggage movement etc.) would also be the responsibility of ESS. The role is also expected to liaison with internal stakeholders and Jazz business partners (vendors) to ensure smooth execution of operations in line with applicable policies and compliance charter.The role reports directly to the Experience Services Manager and has an extended team of 03 team members.What does Experience Services Specialist do?Responsible to facilitate employee transport for inter and intra city travels during their stay.\nResponsible for making hotel reservations for all the employees travelling to South Region.\nResponsible for issuing air tickets as per travel plans of employees.\nTimely processing of all hotel/ travel related invoices.\nCoordination with contract team for timely renewal of vendor’s contract.\nArranging female & Airport pick & drop services.\nEnsuring maintenance of all company owned vehicles and ensure timely maintenance of all vendor vehicles.\nCoordination with team members for organizing the events in Hotels and verification of event related invoices.\nHandling queries, complaints on Careem for intra city travels.\nResponsible for Careem invoice handling.\nIssuance of employee fuel cards and timely invoice processing.\nLiaison with SCM department for vendor on-boarding and contract execution.\nMaintains effective business relationship with the on-boarded vendors with respect to service delivery and contract compliance.\nProvide travel budget related inputs for every budgeting and forecasting cycle.\nAssures operational excellence within the allocated budget and strive for cost optimization.\nData Maintenance and working on different data related projects.\nAble to handle conflicts across various internal and external stakeholders while ensuring delivery on the promises.Jazz is an equal opportunity employer. We celebrate, support, and thrive on diversity and are committed to creating an inclusive environment for all employees.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}