{
    "Job ID": "69869118",
    "Description": "Trane TechnologiesTMTrane®Thermo King®Job Summary：This position will be responsible for the design and development of End of line/Inline automation systems & automation software needs for manufacturing plants across NA, EMEA & API. The candidate should have a minimum of 12-15 years of experience in C# .Net Windows desktop application development and database concepts & designs. This role calls for collaboration with cross functional & multi-location teams to ensure that the projects are meeting 100% QDC, adhering to our standard processes and systems.Responsibilities: Understand the project requirements from SBU team; write software PDD (Project Design Document), SRS and getting necessary approvals from SBU.\nCo-ordinate closely with SBU and provide all necessary software support needed to build manufacturing automation projects.\n Preparation of module design and architecture diagrams, needed for projects.\n Develop operations for test logics, C# .Net programming and integrating the same with Tester software for in house validation\nWork closely with SMEs, system team for sprint/project deliverables and provide necessary support for bug fixing\nAccountable for timely delivery and providing necessary technical support wherever needed and ensuring 100% Quality (Q), Delivery(D)\nSupport to system engineers during their commissioning located at NA, EMEA & API region.\nMust collaborate with team to complete tasks, meet goals \nBring innovative ideas to improve products and processesQualifications:ME/BE degree - Computer Science/Information technology/ECE\n12-15 years’ experience in Software development, C# WPF.Net 4.0 Programming & database concepts with software integration and unit testingKey Competencies:Expert on Software design patterns & Architecture\nExpert in Software development life cycle processes (SDLC)\nVery strong knowledge in C# .Net Windows Programming using 4.0 framework and above,\nOOAD and design principles,\nOracle Database and RDBMS concepts\nCreation of rich graphical user interface using WPF\nIndustry standard communication protocol like serial, Modbus, TCP/UDP, CAN\nHands on experience in Software Integration & unit Testing\nVerbal & Written Communication skills\nManage team technically across multi geographical location Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}