{
    "Job ID": "69866740",
    "Description": "Amazon Ads is the digital advertising arm of Amazon and one of our fastest growing businesses. We operate at the intersection of content, eCommerce and advertising, offering a rich array of brand building, digital display, and search advertising solutions. We start with the customer and work backwards in everything we do, including in advertising. We believe that advertising, when done well, can enhance the value of the customer experience and generate a positive return on investment for our advertising partners. The quality of Amazon’s audience targeting and the underlying shopper data is unique, and richer than that of any other media platform at scale.\nThe Advertising Billing Programs and Operations (ABPO) team’s vision is to create an accurate and frictionless billing experience for advertisers. The Billing Ops Specialist role drives toward this vision by providing world class customer service and support to advertisers and account teams globally. Daily activities of the Billing Ops Specialist includes processing invoice issue requests such as invoice copy requests or credit and rebill submissions, reviewing/resolving accrued but not billed cases, answering general billing inquiries from account teams, and reviewing/approving billing exception requests for advertisers. The specialist should consistently deliver results from both a speed (SLA) and quality perspective, and show a willingness to share best practices and knowledge across the broader team.\nKey job responsibilities\nThis includes, but is not limited to:\n· Gain a thorough understanding of the business and operational area\n· Process allocated work to meet and exceed daily productivity targets such as total time to resolve, service level agreements, and average handling time.\n· Maintain the highest standard when providing billing support for advertisers and account teams\n· Process invoice issue requests\n· Submit/approve credit and rebill requests\n· Review and resolve accrued but not billed cases\n· Review and approve billing exception requests\nKnowledge & Skills/ Business Acumen\n· Outstanding organizational, prioritization, attention to detail and multi-tasking skills\n· Comfortable in fast-paced, multi-tasked, high-energy environment\nA day in the life\nBilling Support Associates are responsible for the day to day delivery and maintenance of operational billing tasks. In this role, individuals execute invoice revisions, generate requests to other teams and resolve billing investigations.\nWe are open to hiring candidates to work out of one of the following locations:\nVirtual Location - KA\n- 1+ years of program or project management experience\n- Knowledge of SQL and Advanced Excel (Array and Statistical formulas)\n- Experience using data to influence business decisions\n- Educational background or similar experience in Advertising, Finance, Accounting or related fields.\n- General understanding of online advertising processes.\n- Strong research skills.\n- For internal candidates: Must be L4\n- Knowledge of analytics & statistical tools such as SAS, PowerBI, SQL & ETL DW concepts\n- Experience back office operations, escalation management and troubleshooting environmentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}