{
    "Job ID": "69867081",
    "Description": "Energy Aspects is looking for an enthusiastic and dedicated Sales Development Representative (SDR) to join our sales team. In this role, you will be responsible for a range of activities that contribute to the growth of our business. Your day-to-day responsibilities will involve lead generation, report building, data cleansing, and email outreach. With a keen eye for detail and strong analytical skills, you will help identify and nurture potential leads within designated territories.DutiesResearch and Develop Total Addressable Market (TAM): Conduct comprehensive research to identify potential prospects within designated territories. Utilize various resources, including conference lists, commodity moves, and market trends, to develop a detailed TAM. Continuously update and expand the TAM database to ensure accurate and up-to-date information.\nLead Generation: Review and analyze the generated leads to determine their potential fit for Energy Aspects' services from appropriate lists. Collaborate with your line manager to assign qualified leads to the appropriate team members for further engagement. Maintain accurate records of lead assignments and update the CRM system accordingly.\nReport Building: Generate reports on lost clients, accounts with no activity, and non-converted trials to identify potential target prospects.\nData Cleansing: Regularly review and cleanse the CRM database, ensuring accuracy and relevance of contact and account information. Archive unnecessary contacts and accounts to maintain data integrity. Verify job roles of contacts through LinkedIn and other channels to identify changes in employment status or seniority.\nEmail Outreach: Engage in email outreach campaigns using provided templates to connect with prospective accounts. Customize email templates to suit the specific needs and interests of target prospects. Maintain regular communication with potential clients to establish relationships and gauge interest in Energy Aspects' services.RequirementsBachelor's degree in a relevant field.\nProven experience in sales development or lead generation.\nStrong research and analytical skills with a keen eye for detail.\nExcellent written and verbal communication skills.\nProficiency in Salesforce or other CRM systems.\nProficiency in Microsoft Excel.\nFamiliarity with LinkedIn and other professional networking platforms.\nSelf-motivated and able to work independently.\nAbility to prioritize tasks and meet deadlines in a fast-paced environment.\nA genuine interest in the energy industry and global markets.About usFounded in 2012, we are an independent research consultancy that has enjoyed phenomenal growth since our inception, and we have very ambitious plans to continue our upwards growth trajectory. We are passionately committed to providing indispensable and industry-leading short, medium, and long-term analysis, and forecasts of the energy markets, that helps our clients trade, invest, finance and plan. With the recent acquisition of macro research firm Medley Global Advisorsthe combination of our market-leading global macro policy analysis and deep energy markets expertise, has further strengthened our services to the global financial markets and has enhanced our ability to support our expanding client base, as the energy transition gathers pace and markets look to find their feet in an uncertain future.Our suite of subscription services can be tailored to meet our clients’ specific needs and combines a data-rich approach and our extensive network of contacts, with insight on geopolitics and energy policy to provide best-in-class assessment, analysis and forecasts of major trends, topics, and regions. We also deliver timely analysis of breaking news events and offer proprietary data services that cover fundamental trade and supply/demand data, across a wide variety of products and markets.Culture & benefitsThe proud recipient of accreditation from Best Companies, we truly understand the importance of workplace engagement and genuinely value our people. We offer a fast-paced, driven, collaborative and dynamic working culture where you are recognised and rewarded for your contributions to our tremendous growth story.Energy Aspects is proud to be an equal-opportunity employer and promotes diversity within its workforce. As an international business, we are determined that suitably qualified persons will never receive less favourable treatment on the grounds of gender, age, disability, religion, belief, sexual orientation, marital status, race, veteran status or any other basis covered by appropriate law.We build our organisation with the community in mind. All our offices are located in landmark buildings with easy access to shopping, restaurants and public transportation. As part of our Kolkata team, you’ll have the opportunity to take part in the social activities taking place in this rapidly growing team.Our compensation packages include generous commission structures, a company share options scheme, private health insurance, life assurance, income protection, pension contributions and considerable holiday time.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}