{"Job ID": "69866494", "Description": "Join us in creating the technology that helps the world act togetherWe are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world.Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work.The team you'll be part of CFO is a diverse team at the frontline, delivering finance and business services, investor relations, and more across the world. Are you passionate about digital transformation, value openness and want to influence the direction of Nokia? Then, you may be the right fit!Within CFO organization you will be part of Global Business Services (GBS) Source to Pay (S2P) team that is focusing on sourcing, purchasing order management, invoice receiving and payment related activities.You will integrate to a team that is being established and where you'll be able to contribute with your ideas to bring it to the next level. It's a global team with an elevated level of exposure to senior leadership of Nokia.What you will learn and contribute toCLM Solutions ExpertSupports Global team in Contracts creation/Maintenance for compliance requirements, CLM Apttus Material Master data maintenance andCLM Contract queries solution via Global Group mailbox.Supports the BU & Global units CM/RPM/NSM/Stake Holders in CLM contracting activities (provides advises on, Contract creations, signatures, approvals, storing, and archiving in accordance with Nokia internal guidelines and processes) in close cooperation with L&CSupports the CM/RPM/NSM/Stake Holders in the L&C Contracts handling purpose.Assesses existing agreements and monitoring contract coverage accuracy as a part of Business Contracts Compliance management.Master Data governance – Contracts master data, Contract meta data, Nokia material master data including Comm. Code, Master categories, Legal entities, etc.Maintains BU & Global units End users & Owners list.CLM Apttus User & Authorization management (tool roles & Scope).Transformation Management - End User Training and CLM Community Calls (Procurement)Competence Development – End User Document creation / Maintenance, Reports Management.Service Management - Performance Monitoring, alignment and coordination with focus on Standard TIER 3 service support from HCL Team.Operational End User Support - covering daily operational activities, end user request mainly process / tool related issues (not IT tickets)As part of our team, you will:Be the prime Spoc with regard to all contractual matters in CLM APTTUS systemYour skills and experienceFluent English and excellent communication,and presentationskills\nAbility to drive towards common goal and work under pressure.\nSolid skills in determination of changes and additional work during CLM contract management support\nUnderstanding of procurement and contractual processes and tools and effectively communicate to the appropriate employees and or employee groups.\nAbility to support and conduct due diligence on compliance risk assessments in the applicable domain.\nGood knowledge in contract operations.\nDriving best practicesIt would be nice if you also had:Capability to communicate all levels\nExperience working across boundaries\nInfluencing others and assertiveness\nAble to manage complex problems, identify solutions and agreed processes.\nProcurement tools, CLM Apttus Salesforce tool\nNokia Business understanding Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Oman", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}