{
    "Job ID": "69860448",
    "Description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (COVID-19), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have.Some careers open more doors than others. If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.Key Responsibilities:1.Monitoring of all regulatory & internal investment restrictions through Quantis.2.Performing alternate checks for monitoring the investment restrictions.3.Verifying the daily passive breach reported through the system.4.Reporting of the active & passive breach to the investment team and compliance team.5.Updating and maintaining the passive breach register.6.Continuous monitoring of open passive breach and following up with the investment team to ensure that the open passive breaches are resolved within the regulatory timeframe.7.Understanding the restrictions relating to new scheme/ new regulatory requirement and coding the same in Quantis.8.Testing all the new coded restriction in UAT for correctness and effectiveness.9.Preparing the monthly performance report for the fund vis-à-vis the benchmark.10.Monitoring the concurrent auditor’s activity as per SLA.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}