{
    "Job ID": "69869870",
    "Description": "Bosch Global Software Technologies (BGSW), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.\n\nWith over 18000 associates, BGSW is the largest software development center of Bosch outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence in US, Europe and the Asia Pacific region. BGSW is ISO 9001:2008 certified (2012), appraised at CMMI-L5 as per version 1.3 (2011), ASPICE - level3 based on version 2.5 and ISO 15504- 5 and 7, and also ISO 27001 with seven state-of-the-art facilities spread across Bangalore and Coimbatore in India, Ho Chi Minh City in Vietnam and Guadalajara in Mexico, ISO/IEC 20000-1:2011 certified (2014).\n\nWe nurture, build and sustain enduring customer relationships to enable direct operational and strategic benefits to our customers. We make it happen through qualified, motivated and flexible professional associates, who uphold the heritage and values of Bosch - time-tested over 125 years of a successful journey; a journey marked by quality, reliability and innovation of service to enhance the interest of our customers and the community we live in.\n\nWe provide solutions for businesses in primarily three areas:\n\n•Engineering Services\n•IT services\n•Business services\n\nOur focal industries:\n\n•Automotive industry\n•Industrial Technology\n•Consumer Goods and Building Technology.\n\nOur role\n“We see BGSW as helping us to achieve the technological lead we need to have in order to prevail in increasingly competitive world markets….. BGSW is about ensuring product excellence under conditions that allow us to maintain our global competitiveness” – Mr. Franz Fehrenbach, Chairman of the Board of Management, Robert Bosch GmbH.Responsible for defining test specification, execution, automation, and documentation.\nDesign and implement various process (Code Compilation, Unit Testing, Code Coverage, Static Code Analysis, Open-Source Scanning and Artifacts Management) into Jenkins pipelines to automate the software delivery process.\nResponsible for test case quality and test coverage according to V&V strategy.\nSetting-up test environment (including environment for test automation).\nAutomation of tests Triggering/performing review of test automation scripts.\nGiving feedback on time to improve the V&V strategy.\nWork closely with development team and verification team to develop test cases and test automation solutions.\nIntegrate continuous test execution into Jenkins pipelines and publish relevant test results in Jenkins and tools like x-ray.Required Skills:Strong Embedded Testing Skills (Both Manual and Automation)\nSound knowledge and hands-on with Python, shell/batch scripting.\nHands-on experience in Test Management and Embedded products Testing.\nGood experience in both White Box and Black Box testing\nGood experience in developing Python scripts for Test Automation\nGood knowledge in Testing concepts & Test processes and practices, Tools, and techniques.\nStrong logical thinking to design and implement automation.\nKnowledge in source code management tools - GIT, Bitbucket.\nKnowledge in Docker, Ansible and Artifactory version control tools (JFrog Artifactory).\nKnowledge in configuring SW KPI Dashboards using SonarQube/Grafana.\nGood understanding of static code analysis tools & unit testing frameworks.\nExposure to AGILE methodologies and AGILE way of working.\nWillingness to learn new technologies.\nA creative mindset and ability to approach a problem creatively.\nActive partition in customer co-ordination and technical interaction across locations.\nAbility to work with cross functional teams.Bachelor’s or master's degree in Electronics / Electrical / Instrumentation engineering.Experience:8+ years of work experience with hands-on in embedded field.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Coimbatore, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}