{
    "Job ID": "69866542",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. About the team In today’s highly competitive private equity market, firms must not only deliver superior returns, but also respond to more stringent reporting requirements and increasing demands for information – both from within and outside their organization. Throughout the industry there is mounting pressure on organizations to do more, requiring a clear technology strategy that not only addresses the demands of today, but also enables the growth and performance of tomorrow. What you will be doing Analyze and understand functional requirements and be able to translate those requirements into written test plans and detailed test cases.\nContinuously re-evaluating the test strategy to adjust for new information, changing risks, shifting priorities, and schedules\nAccurately assess and quantify the business and technical risks associated with the software you are testing and communicate these risks clearly to project stakeholders in all phases of the solution development life cycle\nExecute test cases, track and report defects and reporting results to the team.\nAbility to perform considerable amount of back-end/database (SQL) testing.\nCreates and identifies test data required to execute test cases and interacts with project team members to ensure the data is available for testing.\nUtilize test tools and complete quality assurance documentation as required.\nCollaborate with members of QA, production and development to align and execute on daily priorities.\nDevelops, maintains and upgrades manual or automated test scripts, utilities, simulators, data sets and other programmatic test tools required to execute test plans.\nPerforms usability testing for total system performance, reliability, scalability and security. What you bring: Knowledge / Experience4+ years’ experience as a QA Engineer or similar QA role with in-depth knowledge of QA concepts and methodology.\nHands on knowledge of Selenium with Java or Protractor\nEffectively communicates testing activities and findings in oral and written forms.\nDevelop, maintain and upgrades manual or automated test scripts, data sets, organizes and maintains the test script library.\nControls and manages own daily test activities.\nExperience with trouble shooting/Debugging.\nKnowledge of methods, tools and technology used in software testing\nAbility to work in an agile development environment where developers and testing personnel work closely together to ensure requirements are met or exceeded.\nAbility to demonstrate interpersonal and teambuilding skills working with technical and non-technical individuals.\nSkill in analysis, solid decision-making and problem solving\nKnowledge and use of quality management methods, tools and technology used to create and support defect-free, application software that meets needs of client/business partnerSkillsHands on knowledge of Selenium with Java or Protractor.\nExperience in page object framework.\nCore java, JavaScript.\nManual Testing.\nBasic knowledge of databases, sql queries.\nAPI testing\nKnowledge of Jenkins and CI.\nExperience in AgileQualificationsBachelor’s degree in business or related field or the equivalent combination of education, training, or work experienceCompetenciesFluent in English\nExcellent communicator – ability to discuss technical and commercial solutions to internal and external parties and adapt depending on the technical or business focus of the discussion\nAttention to detail – track record of authoring high quality documentation\nOrganized approach – manage and adapt priorities according to client and internal requirements\nSelf-starter but team mindset - work autonomously and as part of a global team\nWilling to travel occasionally (no more than 10%)What we offer you A multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nA broad range of professional education and personal development possibilities – FIS is your final career step!\nA competitive salary and benefits\nA variety of career development tools, resources and opportunitiesWith a 50-year history rooted in the financial services industry, FIS™ is the world's largest global provider dedicated to financial technology solutions.  We champion clients from banking to capital markets, retail to corporate and everything touched by financial services. Headquartered in Jacksonville, Florida, our 53,000 worldwide employees help serve more than 20,000 clients in over 130 countries. Our technology powers billions of transactions annually that move over $9 trillion around the globe.  FIS is a Fortune 500 company and is a member of Standard & Poor’s 500® Index.FIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the FIS Online Privacy Notice.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}