{"Job ID": "69866464", "Description": "What you will be doingoApply GAAP or IFRS principles of accounting to Structured Finance portfolios and Hedge Funds.oUpdate financial models and prepare financial reports by compiling information, preparing profit and loss statements, and utilizing appropriate accounting control procedures.oAssist with the preparation of Net Asset Valuation (NAV) calculations, Trial Balance Sheet, Income statements and Annual Financials for Structured Finance (CDO & CLO) portfolios and other related fundsoAnalyze results and resolve accounting discrepancies.oPrepare asset roll forwards to verify accuracy of data.oResponsible for all function’s within operations. Projects may be focused on different aspects of operations like reconcilication, trade processing & settlements, fund accounting, reporting, Loan administration etc.oEnsures KPI’s set for the team as per SLA are met. Have proper control’s in place to monitor the KPI’s & client deliverables.oPlans and coordinates all aspects of operations from processing through delivery.oDevelops, defines and executes daily BAU tasks.oInvolved in monitoring daily tasks as per SLA, training, cross training, building capacity.oAssigns and monitors work of functional teams.oManages operations risks, issues/problems, and activity progress to ensure project goals (e.g., deadline, scope and quality) are achieved. Assists with problem resolution or risk mitigation as needed.oIdentifies process risk and adopt appropriate control to mitigate these risk'soDelivers informational and decision-seeking presentations to business groups in FIS and/or in client organizations.oCreate second line. Selects, develops and evaluates personnel to ensure the efficient operation of the function.oPerforms additional related duties as assignedoPerforms critical functions / Review's work performed by team members.oMaintains MIS, Error Log, Query tracker, Issue Log, Team AttendanceoPlans work allocation to ensure optimum utilizationWhat you bring:Knowledge / ExperienceoTotal Experience of 7-9 years.oTeam handling / leadership experience of 2-4 Years (* this role may not have team handling responsibilities)oExtensive knowledge of capital Markets, operations standards, processes, procedures and guidelinesoDemonstrated skill in managing project budgets and timelinesoExcellent analysis, problem-solving, team, conflict management and time management skillsoExcellent verbal and written communication skillsoAbility to interact effectively with clients, onshore counterparts.Establish strong relationship with onshore counterparts and should be capable of handling Onshore Queries and Issues.oAbility to set clear expectations, manage team performance and build high morale among team membersoAbility to maintain confidentiality and carry out assignments that are sensitive in natureoMaintain and deliver MIS to higher management.oCarry out RCA on critical error’s and reduce repetitive error’s by introducing effective check’s and balances.oCreate / Maintain process critical documents SLA, Process Map’s, SOP’s, SIPOC’s, Query tracker, Issue log, System Outage tracker etc.oCreate and present MBR deck’s.SkillsoStrong understanding of Capital markets, Reconciliation (Assets, Cash), Portfolio Accounting, Security Setup’s, NAV calculation, balance sheet, income statement and cashflow statement.oProficient in Microsoft Excel. VBA Macro will be an added advantage.oStrong written and verbal communication skillsoStrong problem solving and analytical skillsQualificationsoMaster’s Degree in Commerce.CompetenciesoCollaborative – Collaborate with different groups and complete the assigned task.oHighly analytical, organized, detail oriented, self-motivated individual who can handle Multi-Tasking.oSelf-starter but team mindset - work as part of a global team.oReady to work in Flexible shifts to support US Client.What we offer youoA multifaceted job with a high degree of responsibility and a broad spectrum of opportunitiesoA broad range of professional education and personal development possibilities – FIS is your final career step!oA competitive salary and benefitsoA variety of career development tools, resources and opportunitiesWith a 50-year history rooted in the financial services industry, FIS™ is the world's largest global provider dedicated to financial technology solutions.  We champion clients from banking to capital markets, retail to corporate and everything touched by financial services. Headquartered in Jacksonville, Florida, our 53,000 worldwide employees help serve more than 20,000 clients in over 130 countries. Our technology powers billions of transactions annually that move over $9 trillion around the globe.  FIS is a Fortune 500 company and is a member of Standard & Poor’s 500® Index.FIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the FIS Online Privacy Notice.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}