{
    "Job ID": "69866826",
    "Description": "Role PurposeWe are seeking an experienced, result-driven senior manager, who will drive the development and execution of large agricultural projects as part of the NEOM Agriculture team.  These projects aim at developing covered and open field production to deliver against food security and financial targets of the agriculture business unit within the NEOM Food Company.  The successful candidate will work jointly with our technical experts, our asset development and business partners in order to lead the development of pilot and commercial programs.  He/she will have a strong track record in the development of productive agricultural infrastructure at scale, strong project management skills and the ability to operate in a complex environment in compliance with rigorous guidelines.  The senior manager agricultural projects will need a pioneering spirit, team orientation, strong work ethics and the ability to thrive at NEOM as part of a revolutionary project to develop agriculture sustainably in the desert.KEY ACCOUNTABILITIES & ACTIVITIESIntroductionNEOM’s aims at providing opportunities for people to live healthy, productive, and fulfilling lives, while sustainably using the natural resources they depend on. NEOM works to transform ideas into policy, policy into action, and action into impact. NEOM uses its technical knowledge and experience, passionate staff, local presence, and global influence to make a lasting difference in people’s livability especially in desert like conditions in a world facing climate change.The Climate Resilient Agriculture Business Unit within the NEOM Food Company focuses on Sustainable Production of fruit, vegetable and other crops.  Our strategy aims to improve Food and Nutrition Security and Mitigate Climate Change. The senior manager agricultural development will lead the development of covered and open field production infrastructure to deliver against our agriculture strategy in line with our production, sustainability, innovation and financial targets.Position description and responsibilitiesSupport our agricultural strategy to phase agricultural development against production and financial targets\nLead the development and execution of large agriculture projects to produce crops under covered conditions - low to high tech infrastructure – and/or in open field.\nOrganize all necessary planning, technical and financial and deliver against asset development milestones\nEnsure flawless project management in seamless coordination with the asset development team, technical and financial pillars\nDefine and deliver operational models in coordination with the business development and financial teams\nEnsure the development of appropriate partnerships in coordination with the business development team\nEnsure execution of operational model in coordination with operational partners against delivery milestones\nEnsure communication with higher management on progress in asset development and operational performance\nOrganize procurement for all necessary support resources in a timely manner\nPlan and execute seamlessly with asset development partners as per protocols defined in the NEOM plan of workBACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and Experience15+ years of experience in agricultural development\nA proven track record in the delivery of large agricultural assets\nExperience in developing and/or operating agricultural enterprises to produce fruit and vegetable in covered and open field conditions\nExperience with technical and financial planning and execution, from business case to delivering against production and financial targets\nTrack record in team management\nStrong technical background in agriculture\nStrong leadership, communication and interpersonal skills\nAttention to detail, rigor, strong work ethics and result orientation\nAbility to work seamlessly with diverse teams to deliver against targets\nFluent English (speaking and written)\nKnowledge of Arabic not required but is a plusQualificationsBachelor’s or Master’s degree in business management and/or horticulture, plant scienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}