{"Job ID": "69866422", "Description": "Senior Consultant-Portfolio Technical Architect- Pune, India\nWant to do work on a massively global scale with a FINTECH company poised to revolutionize the industry? Are you ready to unleash your potential in a global business that is committed to moving money for the better? Join our growing team and help shape our company’s digital capabilities and revolutionize an industry! Join Western Union as Senior Consultant-Portfolio Technical ArchitectWestern Union powers your pursuit.In this role, you will lead a team and own on-time technical delivery for the projects assigned, with high quality. You will be responsible for developing and implementing new software, maintain, and improve existing software.Role ResponsibilitiesLead a Team and own on-time Technical Delivery for the Projects assigned, with high quality.\nDevelop and implement new software, maintain and improve existing software.\nEnsure that software functionality is implemented with a with a focus on code optimization and organization.\nRecommend improvements to existing software programs.\nTroubleshoot application issues and coordinate issue resolution with operations, functional, and technical teams.\nWork with a software development team and Service providers in a geographically distributed structure.\nProvide coaching and mentoring to Sr. Associates, Associates, and Junior Associates\nWorks independently on complex projects.\nApply Agile methodology daily and follow Definition of Done (DoD) process for better quality by maintaining unit test, code coverage and integration test coverage.Role Requirements10 + years of hand-on expertise on React Native, React JS, AngularJS, Cordova , HTML5, CSS3, Typescript\nHand-on expertise on Native iOS or Native Android\nDeep Understanding and Knowledge about JSON, SOAP, REST, and Microservices.\nWorked with Git, Jenkins, Docker, Familiar with AppStore/Playstore Management.\nKnowledge about Bit.Dev, GraphQL\nGood to have an AWS Cloud CertificationWe make financial services accessible to humans everywhere. Join us for what’s next.Western Union is positioned to become the world’s most accessible financial services company —transforming lives and communities. We’re a diverse and passionate customer-centric team of over 8,000 employees serving 200 countries and territories, reaching customers and receivers around the globe. More than moving money, we design easy-to-use products and services for our digital and physical financial ecosystem that help our customers move forward.Just as we help our global customers prosper, we support our employees in achieving their professional aspirations. You’ll have plenty of opportunities to learn new skills and build a career, as well as receive a great compensation package. If you’re ready to help drive the future of financial services, it’s time for Western Union. Learn more about our purpose and people at https://careers.westernunion.com/.BenefitsYou will also have access to short-term incentives, multiple health insurance options, accident and life insurance, and access to best-in-class development platforms, to name a few\n(https://careers.westernunion.com/global-benefits/). Please see the location-specific benefits below and note that your Recruiter may share additional role-specific benefits during your interview process or in an offer of employment.Your India specific benefits include:Employees Provident Fund [EPF]Gratuity Payment\nPublic holidays\nAnnual Leave, Sick leave, Compensatory leave, and Maternity / Paternity leave\nAnnual Health Check up\nHospitalization Insurance Coverage (Mediclaim)\nGroup Life Insurance, Group Personal Accident Insurance Coverage, Business Travel Insurance\nCab Facility\nRelocation BenefitWestern Union values in-person collaboration, learning, and ideation whenever possible. We believe this creates value through common ways of working and supports the execution of enterprise objectives which will ultimately help us achieve our strategic goals. By connecting face-to-face, we are better able to learn from our peers, problem-solve together, and innovate.  Our Hybrid Work Model categorizes each role into one of three categories. Western Union has determined the category of this role to be Hybrid. This is defined as a flexible working arrangement that enables employees to divide their time between working from home and working from an office location. The expectation is to work from the office a minimum of three days a week. We are passionate about diversity. Our commitment is to provide an inclusive culture that celebrates the unique backgrounds and perspectives of our global teams while reflecting the communities we serve. We do not discriminate based on race, color, national origin, religion, political affiliation, sex (including pregnancy), sexual orientation, gender identity, age, disability, marital status, or veteran status. The company will provide accommodation to applicants, including those with disabilities, during the recruitment process, following applicable laws.#LI-RB2 #LI-HybridJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}