{"Job ID": "69867367", "Description": "Department –DD& IT ART Supply ChainDoes your motivation come from challenges and working in a dynamic environment? Do you thrive in an environment where close collaboration with key stakeholders and strategic alignment is essential? Do you have a can-do attitude with continuous improvement as one of your career objectives? Then we might have the right position for you. Apply now!About the departmentART Supply Chain works continuously to support a strong delivery of products by developing and maintaining future IT solutions to provide a supply chain advantage for Novo Nordisk. The department consist of Specialist and Business analyst with specialized skills in SAP, system management practices and solid knowledge in manufacturing domain. ART operates within an agile environment and closely collaborates with other teams. The ART’s focus is on various aspects of Novo Nordisk's supply chain operations, such as cold chain monitoring, warehouse management, plant maintenance, and serialization to comply with regulatory requirements. The ART provides support for production planning, quality management, and global batch traceability systems. They also work on integrating Novo Nordisk's systems with external trading partners and implementing SAP ECC at new sites. This team is responsible for maintaining the system in GxP areas, providing 24/7 support for incidents and requests, and enhancing and fixing bugs in the existing functionalities.The PositionAgile people Leader is overall responsible for all deliveries and contributions for the operation and maintenance of systems supported from ART pertaining to Supply Chain in PSIT GBS, who continue the support of a strong delivery of products by developing and maintaining future IT solutions to provide a supply chain advantage for Novo Nordisk. Additionally, you will be responsible for:Accomplishing PSIT GBS strategy and vision.\nEnsuring strong people management and nurturing of talents.\nAdapt to global mind-set ensuring effective and efficient global collaboration.\nResponsible for Stakeholder and Vendor management.\nBudget responsible for department and systems in scope.QualificationsMasters or post graduate degree in the field of Engineering, Computer Science, Business Administration.\nSAFe Agilist or any Agile certification is preferred.\nTotal experience of 10+ years is required.\nExperience in SAP  and Supply Chain domain is required.\nMust have experience in Agile methodologies and 3+ years of leadership experience.\nAbility to understand the developer mindset.\nBasic understanding on how IT solution is designed/supported on various layers in terms of Development, Infrastructure, support.\nUnderstands the ever-evolving needs in IT space and systems in terms automation, upgraded, latest technology supporting infrastructures etc.\nExcellent writing, verbal, presentation, communication, and consensus building skills.Working at Novo NordiskWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.Contact\nTo submit your application, please upload your CV online (click on Apply and follow the instructions).Deadline18 Sep 2023.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}