{"Job ID": "69869759", "Description": "Headquartered in Dubai, UAE, The First Group is a dynamic, integrated global property developer with a fast-growing portfolio of upscale hotels, residential properties, F&B brands and real estate asset management services. Since our launch in 2005, we have carved a highly successful niche offering unrivalled property investment opportunities in high-growth markets to clients from more than 70 countries worldwide.We were among the first developers to identify the tremendous potential in providing private investors the opportunity to purchase hotel guestrooms, suites and serviced apartments in our collection of upscale properties located in highly popular locations across Dubai. We back up our success with a list of International Property awards along with strategic partnerships with companies such as Wyndham Hotel group, Millennium Hotels, Emirates Airlines and Jumeirah Hotels and Resorts.To successful candidates, we offer a diverse progressive corporate working environment with clear growth potential along with award winning sales & marketing tools, a state of the art showroom featuring Dubai’s only virtual helicopter tour and endorsements from a number of international sporting celebrities.The First Group, a renowned and rapidly expanding company, is excited to announce a multitude of job opportunities across diverse departments. We are actively seeking talented UAE Nationals to join our team and contribute to our continued success.At The First Group, we are committed to fostering an environment of excellence and providing our employees with ample opportunities for growth and advancement. As part of our ongoing expansion plans, we are eager to review your profile and consider you for various positions that align with your skills and aspirations.If you have a strong work ethic, a passion for delivering exceptional results, and a desire to take your career to new heights, we encourage you to apply to your resume. By applying, you will be granted the opportunity to be considered for future roles that match your unique skills and experience.Valid UAE passport\nFamily book (Khulasat Al Qaid)\nCompleted military service, unless exempt\nExcellent communications skills, both written and verbal\nRequired language(s): fluent English, and native Arabic Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}