{"Job ID": "69866174", "Description": "Pfizer Worldwide Medical and Safety colleagues play a key role in connecting evidenced based, medical decision support with colleagues and stakeholders to enable better health and treatment outcomes. Whether you are creating framework necessary to ensure our evidence is scientifically sound, providing unbiased, medically necessary expertise or investigating how to close gaps in data, our mission is simple. Empower healthcare decisions regarding the safe and appropriate use of medicines for patients.It is our mission to strengthen the oversight of our clinical data through stronger ownership, control, and visibility. You will play an important role in processing, reviewing and receiving clinical data and records and from therapeutic groups as well as internal and outside investigators. You will ensure that accurate, timely, and consistent data reaches the clinical teams and other groups. You will be relied on for data management plans, including data preparation and validation activities, among others.As a Senior Associate, your knowledge and skills will contribute towards the goals and objectives of the team.  Your focus and ability to meet team targets will help in completing important deliverables on time. Your innovative use of communication tools and techniques will make it easy to manage difficult issues and help in establishing consensus between teams.It is your commitment and hard work that will help make Pfizer ready to achieve new milestones and help patients across the globe.Manage own time to meet agreed targets; develop plans for work activities on own projects within a team.\nServe as Data Manager for one or more clinical trials assuming responsibility for Data Monitoring and Management (DMM) activities.\nEnsure operational excellence in collaboration with partners and colleagues for application of standards and develop data cleaning reports in support of the data review plan.\nEnsure operational excellence across all Data Monitoring and Management (DMM) deliverables.\nSet-up and test data review listings to verify the quality and completeness of data as specified in Data Management Plan by reviewing data attributes populated by general users.\nEnsure lessons learnt during the study are documented and shared with other study teams to facilitate cross-study learning.\nBuild good relationships with local and global SMEs from different fields, leverage their expertise in areas such as systems and process and proactively identify issues and work to create solutions.Bachelor's Degree\n3+ years’ experience\nDemonstrated knowledge of data management processes and principles\nExperience with web based data management systems\nWorking knowledge of electronic document management systems\nKnowledge of International Conference on Harmonization and more specifically Good Clinical Practices\nThorough understanding of the processes associated with clinical study management and regulatory operations\nAbility to manage tasks, time and priorities\nDemonstrated effective verbal and written communication skills and adapt communications to audienceMaster's degree\nRelevant pharmaceutical industry experience\nExperience using data visualization tools\nProficient experience using commercial clinical data management systems and/or EDC products\nAwareness of regulatory requirements and relevant data standardsPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}