{"Job ID": "69866113", "Description": "You are a strategic thinker passionate about driving solutions in Finance. You have found the right team.As the Product Control professional in our Asset & Wealth Management, you will spend each day defining, refining and delivering set goals for our firmYou will spend each day driving solutions for the Wealth Management business. Your position will be an individual contributor in Global Private Bank(GPB) in the Product Control team in India, supporting the global structure.Your team is primarily responsible for Product control activities related to Revenue/Income Attribution for Brokerage/Investment/Alternative Products. The team comprises of SMEs who are expected to take end-to-end responsibility for their respective region/product and drive the agenda for the respective CFOs.  Job Responsibilities:Trade reconciliations with Corporate & Investment Banking [CIB] and Asset Management [AM] on different products to calculate the revenues for the month for GPB.\nLiaising with CIB/AM Product controller / financial controller / Middle office / Tech teams for various trade reconciliation and Revenue settlement.\nLiaising with WM Legal Entity Controller and Financial Controller for Accrual Booking/ Cash Settlements and Ageing.\nPosting management reporting entries (MIS), facilitating revenue share postings in the ledger & Ledger vs MIS for Unrec.\nFollow ups on outstanding receivables with Internal & external counterparties.\nPreparing accruals for Management fees related to Hedge Funds & Private Equity Funds. Preparing Private Equity commitment books and fee schedules basis Engagement letter.\nSupport internal & external audits. Participate in collaborative initiatives with team members and global managers, looking for ways to continually simplify, improve, and add value to existing business processes.Required Qualification, Capabilities and Skill:Minimum of CA or an MBA in Finance is required. 3+ years of Finance experience, preferably in Financial Services, and/or accounting/controller background.\nIntermediate to advanced level ability expected in all MS Office tools (Excel, PowerPoint, Pivot Tables).\nExperience in designing workflows & building solutions in Alteryx.\nStrong quantitative, analytical, and problem-solving skills.\nExcellent organizational, management, both verbal & written communication skills with the ability to articulate complex issues clearly. Ability to build strong partnerships with colleagues, desire to learn quickly, be flexible and think strategically\nAbility to articulate and demonstrate thoughtful rationale in design decisionsPreferred Qualification, Capabilities and Skill:Sound judgment, professional maturity and personal integrity, strong work ethic, proactive and results-oriented, and ability to manage multiple tasks simultaneously. \nIntegrity in handling highly sensitive and confidential information. Team oriented, inquisitive, critical thinker who anticipates questions from internal clients and senior management\nSelf-motivated, tenacious & able to work with a high degree of independence. Asset / Wealth Management sector experience is preferable\nHands on experience in building solutions on Python or SQL would be an added advantageJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}