{
    "Job ID": "69866462",
    "Description": "Apply now Job no: 4088147\nLocation: Bahrain\nThe Avenues BahrainPottery Barn KidsPottery Barn Kids is a leading retailer known for its stylish and child friendly furniture, decorative accessories, classic toys and nursery essentials. Each collection is expertly crafted from the finest materials with a careful regard for child safety standards and is designed to inspire kids' imaginations.Quality, value and style are the hallmarks of all Pottery Barn Kids products bringing fresh, beautiful and unique designs to children's' spaces both inside and outside of the home.The Role:As a Sales Associate you will work as an individual and as part of a team to provide customers with a complete service and an enjoyable shopping experience in order to maximise sales.You will also ensure that you have the most up-to-date product knowledge, that stock loss risks are minimised, and that the brand is represented to the required standard.Qualifications & Requirements:You will have/be:- A passion for customer service.- The ability to carry out manual duties, stand for long periods of time, and lift light to medium loads.- Basic IT skills.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}