{"Job ID": "69866521", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! What you`ll do :SAP Enterprise Cloud Services is the organization that defines and delivers all private managed cloud solutions like RISE with SAP S/4HANA cloud, private edition to our customers. ECS CTO Service Engineering acts as the interface between ECS Delivery, responsible for operations, and the SAP field organization responsible for sales. We support Go-To-Market (GTM) teams with operational expertise and conceptual work globally. We pick up service requirements arising from customer engagements and drive Business Development and Portfolio Management to strengthen SAP’s service offering in the managed cloud. We also perform architecture engineering projects and technology innovation pilots to support selected customer projects as well as ECS’s overall portfolio development.As an “IT Architecture Senior Specialist” in ECS CTO Service EngineeringYou develop concepts to match the requirements of ECS customers with containerized application design\nYou support GTM teams with service engineering and operational expertise in large/complex deals\nYou conduct internal and customer workshops, KT sessions and webinars\nYou perform or support technical/architectural projects for SAP Enterprise Cloud Services\nYou bring in ideas to drive our TCO and our customer successWhat you bring :Working experience of more than 8+ years in the IT Industry\nExperience with containerized applications, preferably using Kubernetes and/or SAP Gardener framework\nDevOps knowledge using Continuous Integration & Delivery, Application Definition & Image Build, Automation & Configuration as well as Observability and Analysis\nKnow-how with SAP solutions like SAP NetWeaver, SAP HANA, Business Objects as well as solution resiliency and interfaces, of SAP basis technologies, Network/Web technologies, LINUX based infrastructures, IT Security, IT Business Continuity including High Availability and Disaster Recovery\nKnowledge about one of the virtualization and platform technologies such as VMware or public IaaS solutions like Amazon Web Services, Google Cloud Platform or Microsoft Azure.\nKnowledge in ITIL methodology and IT Operations as well as project management methodology\nExcellent working skills in EnglishMeet your team :Our team is distributed globally and a mix of all SAP experience and skill levels one can think of. We define ECS Private Cloud solutions and services architecture, we closely collaborate and jointly help our colleagues in presales as well as in Delivery. We also own the base for all cost calculations that determines our margin, as well as some essential FinOps topics, to keep our costs and our revenue under control. This is a great spotlight place to work with a lot of recognition and attention from various sides.#SAPECSCareersWe build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 379753  | Work Area: Information Technology  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}