{"Job ID": "69866460", "Description": "We create smart innovations to meet the mobility challenges of today and tomorrow. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses and driverless trains, as well as infrastructure, signalling and digital mobility solutions. Joining us means joining a truly global community of more than 75 000 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.Purpose of the JobPerforming subsystem/component development activities and contributing to the purchasing of subsystems/components developed by suppliers.Organisation ReportingHierarchical Reporting: (Site) Mechanical Domain Leader (MDL)\nFunctional Reporting: Mechanical Lead Engineer (MLE)  Responsibilities\nAccountable for :Defining best trade-off between technical input constraints in order to optimize global QCD.\nPerforming 3D and 2D deliverables in compliance with QCD commitments, Metier rules and processes.\nModelling and allocated volumes and interfaces for sub-systems / components in Digital Mock-Up in Catia V5 and PLM.\n Customer requirements CBC assurance\nPerforming Design on internal sub-systems.\nVerifying consistency of digital mock-up (no clash, etc.) and compliance with requirements (allocated volumes, weight, interfaces,\netc.) on assigned scope.\nPreparing and documenting Domain Design Reviews\nPreparing Customer Reports\nType test procedure preparation\nPrepare Type test plan & signoff with supplier\nChecking CADs' in catia V5  and sub-contractor's Design Quality\nRealizing stack-up analysis with Integration team support.\nRealizing Bill of Material & weight managementResponsible for :Performing the transverse requirement allocations to the various subsystems in close collaboration with the relevant specialists,\nPerforming requirement development, coming from reference and applicable documents from Metiers, Standards, Certification, Safety, Platform and Customer\nDefining the Train System architecture, operational modes and functionalities taking as input the external/internal requirements\nPerforming train system FMECA in coordination with RAMS team\nEnsuring consistency and compatibility between all the sub-systems specifications,\nWriting sub-system specification and architecture description (RSAD2) in collaboration with the SSE/PU/TCE according to train level architecture.\nFill the “Entry “connector” to question the Train design systems catalog.\nFor non-catalog components, under TD Systems design authority:\nWrites the Technical Purchasing Specification (TPS0 - Short Specification) when needed.\nWrites the TPS1 for supplier consultation and manages technical contact (TPS2) until design has been frozen\nDrives technical relationships with suppliers with close management of QCD commitments (CbC), risks & validation (including Design Reviews with suppliers).\nSupporting TPM to define applicable train configuration\nEnsuring coordination between TD/PU/Metier on interfaces, performances, technical issues resolution during detailed design phase.\nOn TPM request, participating to technical meetings with customer in order to provide support.Contributor for :Perform quotation of engineering work-package, upon request\nDefining Project Decomposition (PBS)\nSupporting Sourcing, Industrialization and Manufacturing teams during Production ramp-up.\n Collaborating with MDL for continuous improvement of the Domain (including RoE)Performance Measurement/KPI’sClosure of open points or escalation: 10 days maximum\nCompliance to Engineering WorkPackage (variation orders excluded): 100%\nQuality of delivery (included sub-contractor delivery): 1st time quality rate > 90% (quality rate = modification validated OK /number of applied modification)\nRespect of the delivery planning (included sub-contractor delivery) = 100% on time delivery\nApplication level of standard PPL = 100%\nConfiguration management deliverables = 100% of deliverables properly managed into configuration database\nRespect of Cost allocationKnowledge & ExperienceMechanical Engineering of  5 to 7 experience and preferably 1 to 2 years in  railway products.\nGood knowledge in Catia V5,Enovia.\nGood Communications and interpersonal skills including with third parties (customer).\nTime management and reporting skill.\nSense of urgency / priority.\nStructured and organised with Hands-on approach.\nEnglish operational in read/writing and technical meetings.An agile, inclusive and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}