{"Job ID": "69867738", "Description": "Arcadis is the world's leading company delivering sustainable design, engineering, and consultancy solutions for natural and built assets. We are more than 36,000 talented people in over 70 countries dedicated to improving quality of life. Everyone has an important role to play. With the power of many curious minds, together we can solve the world’s most complex challenges and deliver more impact together.Role Description:This role is part of Arcadis’ Global Excellence Centre (GEC) and will join our 3,000+ talented individuals working in India, Romania, and Philippines, in partnership with Arcadis’ offices globally. The GEC brings key capabilities and capacity to support our clients seamlessly around the world.  For those in GEC there are options to be dedicated to one country; developing deep knowledge and strong relationships, as well as opportunities to be part of teams working truly globally as a centre of excellence, offering diversity and variety.  Arcadians are by nature, globally minded and culturally aware, and Arcadis strongly believes in flexibility which enables change over time as your career progresses. The GEC model is well embedded in Arcadis, and the strong relationships that exist between our global offices are truly unique. Role Accountabilities:To take on a key role within the Rail MEP services sector, providing leadership, technical advice, building technical capabilities and leading by example where appropriate.\nTo manage selected projects (or components of projects) meeting technical requirements, budgetary, quality, safety and timeframe targets, while exceeding Client expectations.\nTo promote and assist in brand building of Arcadis in India, thus helping recruitment process.\nTo actively participate and contribute to the GEC professional group and externally at seminars and conferences.\nTo build networks within the Rail building services industry.\nProactively managing selected projects (or components of projects), taking responsibility for resource allocation, managing the production of analysis and design (including drawings and reports), ensuring the integrity of the overall design (in collaboration with other design disciplines), quality assurance and client feedback \nProviding input to the GEC sector strategy/business plans, as required and contributing towards its achievement.\nCommunicating with team members to ensure that they understand, and become engaged with, sector/discipline business plans.\nLiaising with the Project Manager or Director and the client to keep informed of all developments, changes/modifications associated with the project.\nIdentifying opportunities and driving implementation of standardization strategies to enhance efficiencies at GEC.\nProviding leadership, direction and technical advice to project team members, taking a proactive role in developing team members to their full potential, leading by example to achieve sector/divisional goals and championing a quality, innovative and entrepreneurial culture. \nBeing familiar with, and compliant with, relevant H & S and CDM regulations and to promote a culture of awareness within the team.\nTraining and development of team’s technical capabilities. \nPerforming other duties and responsibilities assigned by your manager as required from time to time.Qualifications & Experience:B.E / B. Tech in Mechanical Engineering from a recognized University. \nChartered Engineer (CEng) with IET / CIBSE / IMechE.\n15 to 20 Years’ experience in design of Mechanical Building services (HVAC, Plumbing & Firefighting) preferably UK/Rail projects.\nHas solid domain knowledge in UK Building service industry. \nProven design experience; including concept, preliminary, detailed, construction phases\nAbility to check and review technical specifications, design basis reports,   etc. \nHas very good appreciation of health, safety and CDM aspects related to typical Rail systems project.\nAbility to carry out design reviews independently.\nFamiliar with international codes, Network Rail and London Underground standards and practices related to UK Rail industry.\nExperience within a consultancy environment specifically in the Rail / Metro industry.\nStrong verbal and written communication skills in the English language, with good report writing, analytical and computer skills.\nAbility to think in an innovative and entrepreneurial manner with good understanding of commercial aspects of a project.\nKnowledge of code & standards and practices of Building services industry \nGood motivation, influencing, people management and delegation skills\nClient Focus – Understands Client’s expectations and align accordingly.\nExcellence – striving for technical excellence.\nTrust – building and retaining relationships of trust with our clients and colleagues.\nTeamwork – working together as a team for the Group, not just the individual.\nResponsibility – taking responsibility for our performance and our safety.Why Arcadis?We can only achieve our goals when everyone is empowered to be their best. We believe everyone's contribution matters. It’s why we are pioneering a skills-based approach, where you can harness your unique experience and expertise to carve your career path and maximize the impact we can make together.   You’ll do meaningful work, and no matter what role, you’ll be helping to deliver sustainable solutions for a more prosperous planet. Make your mark, on your career, your colleagues, your clients, your life and the world around you.Together, we can create a lasting legacy.Our Commitment to Equality, Diversity, Inclusion & BelongingWe want you to be able to bring your best self to work every day, which is why we take equality and inclusion seriously and hold ourselves to account for our actions. Our ambition is to be an employer of choice and provide a great place to work for all our people.Join Arcadis. Create a legacyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}