{
    "Job ID": "69869097",
    "Description": "Job DescriptionWhen you join us at Thermo Fisher Scientific, you will be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $22 billion and the largest investment in R&D in the industry, we give our people the resources and opportunities to make significant contributions to the world.The Technical Writer opportunity is part of the Chromatography and Mass Spectrometry division, which delivers market-leading analytical solutions. Our solutions help customers advance science, become more efficient, and improve their bottom lines. Our offerings shape the lab of the future by accelerating innovation and driving productivity. In short, our goal is to make labs work the way people think they do – with cloud-connected, instantaneous information available seamlessly to scientists across the globe.This role is based in Bangalore or Hyderabad, IN.How will you make an impact?As a Technical Writer, you will collaborate with multiple teams to create high-quality user documentation, animations, and videos that enhance the customer experience. All projects follow our internal quality management system and require the use of various tools for creating, revising, and reviewing product user documentation, animations, and videos, as well as supporting translation initiatives. As part of this role, you'll collaborate with fellow team members to discuss, plan, and implement documentation-focused projects that support a range of organizational initiatives. Technical Writers at Thermo Fisher Scientific can expect:A dynamic work environment\n\nCompetitive salary and benefits packages\n\nOpportunities for professional development and growthWhat will you do?         Research and write hardware and software documentation for analytical instruments, such as liquid, gas, or ion chromatographs and mass spectrometers.\n\nCreate new animations and update existing ones to explain complex workflows, device installation, and maintenance procedures.\n\nCollaborate with scientists, engineers, product evaluation teams, project managers, and product managers in a scientific environment.\n\nContribute to the development and implementation of documentation standards.\n\nPeer review user documentation.\n\nExhibit your skills in creating animations and videos to embed in documentation.\n\nCreate topic-based information that is scalable and reusable.How will you get here?EducationDegree in technical communication, chemistry, biochemistry, or a related field with an emphasis on technical documentation, or equivalent years of relevant experience.ExperienceMinimum of 7+ years as a technical writer, preferably in a hardware device development environment.\n\nExperience in writing hardware installation, maintenance instructions, troubleshooting, or training materials. This may include standard operating procedures, as well as manuals or help systems.\n\nExperience with analytical instruments will be considered an advantage.\n\nFamiliarity with Darwin Information Type Architecture (DITA)-based CCMS and authoring tools.\n\nKnowledge of DITA, content analysis, metadata/taxonomy structuring will be good to have.\n\nExperience with screen-capture software and video production tools such as Captivate, Storyline, Camtasia, or Final Cut Pro.\n\nFlexible and proactive, with the ability to work in an environment of constant change.\n\nMust be able to collaborate with scientists, fellow writers, project managers, and program managers. managers.\n\nStrong communication skills and excellent English writing abilities. Shortlisted candidates will be required to provide writing samples and take a test on camera or at our office.\n\nMust be highly organized and pay attention to detail.At Thermo Fisher Scientific, each one of our 70,000 extraordinary minds have a unique story to tell. Join us and contribute to our singular mission—enabling our customers to make the world healthier, cleaner and safer.Apply today! http://jobs.thermofisher.comThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}