{"Job ID": "69867470", "Description": "Product Owner-(2300016596)Job:Retail BankingPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 11:43:24 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleAs a Product Owner in our cross-functional squads, you will drive the outcomes of the squad to deliver on their objectives and key results. You will build and prioritise the product backlog to achieve business goals and manage stakeholder relationships to align expectation, prioritisation and overall product roadmap.  The PO is responsible forRepresenting the stakeholders, and has the mandate to prioritise scope(functions / features) on behalf of the business.\nCreating and maintaining a prioritised Product Backlog, ensuring it is visible, transparent and clear.\nPreparing the Agile Execution Document, including the Initial Release Plan and other associated mandatory milestones and tracking and reporting delivery against the Initial Release Plan.\nClearly communicating priorities, objectives / goals, mission and acceptance criteria to the Agile Delivery Team.\nEnsuring the Agile Delivery Team members understand items in the Product Backlog to the level needed.\nThe PO may ask the PgPMO or Scrum Master to update the Clarity data on their behalf.\nEnsuring that all submissions to committees (status reports, AED, Red packs, Closure Reports, etc) are of the right quality and are timely.\nCommunicating progress outside the core Agile Delivery Team including reporting RAG status to PgSC.\nEnsuring Project deliverables are of the desired quality and have appropriate endorsements / sign-offs.\nTransitioning and hand over to BAU.\nOwning the review of Benefits over the lifecycle.\nWhen requested, presenting the Agile Delivery Closure report to the PgSC or PRC before the Project is closed.They are the sole person (not a committee) responsible for managing the Product Backlog. While the PO may represent the desires of a committee in the Product Backlog, those wanting to change a Product Backlog item’s priority must request the PO to do so. For the PO to succeed, the entire organisation must respect his or her decisions. The PO’s decisions are visible in the content and prioritisation of the Product Backlog.The Development Team needs to work from the prioritised product backlog as agreed with the PO. They should not be requested to work from a different set of requirements by any other stakeholders.\n\nOutputsImplementing world class digital banking products with highest quality standards.\nImplementing channel agnostic capabilities developed in global stack thereby enabling true global solutions that can be delivered across all RB markets.Risk ManagementResponsible for identifying, assessing, monitoring, controlling and mitigating risks to the Group as well as managing them.\nResponsible to interpret the Group’s financial information, identify key issues based on this information and put in place appropriate controls and measures.GovernanceAwareness and Understanding of the regulatory framework in which the Group operates, and the regulatory requirements and expectations relevant to the role.\nCollaboratively work with internal stakeholders and local regulators to address governance issues.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTakes personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and Group Code of Conduct.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key StakeholdersHead of Group Digital Banking\nITO: Build and Engineering Team\nGroup SC Design Team\nRegional Digital Banking Organization\nGroup Digital Banking Management Team\nGroup Digital Team\nRegional Digital Banking Heads\nCountry Digital Banking teams\nL&C, OR, FCC, GIS, SCMOur Ideal CandidateExperience in Digital Banking Initiatives, especially on Online Banking, Mobile Banking, Wearables, or any other digital channels or devices.\nUnderstanding the Customer Experience design and user experience principles.\nCertified Product Owner and understanding the agile delivery principles and basic knowledge about Scrum.\nGood understanding about digital developments and customer expectations from digital banking products and services.\nExperience using tools such as Azure DevOps, Sharepoint, Jira, Confluence, etc.\nGood understanding about Mobile Apps, mobile operating systems and digital banking / finance apps in the market.\nStrong communication skills.\nStrong Business acumen.What we are looking for?We are looking for talented individuals who can be effective leaders with functional and operational expertise. You must be a strong communicator who builds trust-based relationships within the squad and amongst stakeholders. If you possess traits and experience that match most of the below, we’d love to hear from you10 year experience and proven knowledge in the Digital Banking, especially Online Banking, Mobile Banking, Wearables or any other digital channels or devices.\n10 years in Agile as a Product Owner (or a similar role), strong skills of maintaining and prioritizing a backlog.\nDeep understanding of industry trends and client needs, ability to create a value proposition and a squad vision.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}