{
    "Job ID": "69869671",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:Major Roles and Responsibility:1. Project Analysis Performs analyses of individual projects performance (As sold V/s As engineered v/s Current Estimate or Actuals) with external and internal peers. Works with all concern functions to understand and analyze the drivers of financial performance and identify trends. 2. Monitoring and review Provides input to Finance Controller in opportunity/risk identification. Supports Factory Controller / Project Controller in coordinating and preparing monthly project reviews. Provides input to the project cost report. Provides input to the Project Manager on claim management, back-charges and insurance cases. 3. Reporting Supports preparation of relevant organization financial reporting, business planning, budgeting and forecasting. Validates accuracy of financial data and business information and reports by performing reconciliations and review of exceptions. 4. Information and communication Provides information to management by assembling and summarizing data, preparing reports, making presentations of findings, analyses, and recommendations. 5. Optimization Optimizes own performance to increase productivity by developing automated solutions, eliminating duplications, coordinating information requirements. 6. Internal control and documentation Ensures processes and controls within own area of responsibility are designed and implemented in line with Group and unit requirements. Maintains proper audit trail and documentation for future tax/ internal/external audits and reviews.7. REIWA Project Implementation Supports Finance team for REIWA project implementation (SAP 4 Hana) for data validation, UATs, post go live support. Keeping records of all manual work due system unavailability, etc. Coordinate with Business Process Owners (BPOs) and consultant team for requirements and problem solving.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}