{
    "Job ID": "69865841",
    "Description": "The Roche Kuwait early in career Program is a 12 months rotational development program at Roche. The program is tailored for high potential individuals at an early stage of their career, and NO work experience is required. The program accelerates their professional development and enables them to be key contributors to Roche's purpose and what patients need next.Roche Kuwait offers Application Specialist position for a period of 11 months and one month rotation with the below main responsibilities: Your ResponsibilitiesProvides a high quality application support response which is consistent and in line with the changing requirements of the customer and the business areas.\n\nDelivers best in class support utilizing appropriate systems and processes and providing a consistent and high level of support to customers.\n\nContinues development of application skills to ensure resilience in the support of all products.\n\nEnsures coverage across the required core and out of hours, in line with agreements with customers.\n\nProposes proactively and implement activities aligned with customer satisfaction surveys and on-going customer and business area feedback.\n\nPerforms instrument training, configuration, and instrument commissioning for new installations.\n\nActive member of the installations team supporting the process with setup, optimization, workflow, correlation, etc.\n\nEnsures that all administration is completed in a timely and accurate manner, and guarantees the activity reporting at the CRM software and appropriate escalation of product issues to management center, and ensures that all administration is completed in a timely and accurate manner.\n\nPerforms corrective visits to sites as part of case escalation.\n\nYou are expected to adhere through your conduct to all applicable laws and regulations as well as to the high integrity standards as set forth by Roche.\n\nIncrease Customer Satisfaction levels.\n\nEfficient cost management, contributing to the achievement of the profitability objectives.\n\nAccountable for ensuring compliance’s rules & ethic code when working with Health Care Professional to strengthen the company’s image.Your OpportunityParticipants build an extensive network within Roche and upskill themselves\n\nBest possible work environment is designed to foster participants' learning experience\n\nParticipants will have access to senior leaders and will be assigned to a mentor to support their career journey\n\nContributing to purpose driven projects and taking responsibilities from day 1Who are you?You hold a Bachelor or Master degree in Life Sciences, Economy, Business, Public Affairs or any related areaYou are at an early stage in your career. Fresh graduates will be preferred\n\nHaving a basic understanding of healthcare system is preferred\n\nYou are eager to work with diverse cultures\n\nYou are curious and have passion for learning new things, and have high degree of integrity and courage\n\nYou have excellent communication and innovative skills\n\nYou are proficient in EnglishOur missionRoche is a global pioneer and leader in Personalized Healthcare. We provide breakthrough differentiated medicines and diagnostic tests using expertise in Science, Technology and Data so that people can live better lives. We believe it’s urgent to deliver medical solutions right now – even as we develop innovations for the future. We commit ourselves to scientific rigor, unassailable ethics, and access to medical innovations for all.We are living in truly historic times. The rapid digitalization of healthcare fuels an accelerated transformation in our industry. This change requires leaders who are entrepreneurial, who trust and encourage teams to take risks, learn and progress quickly.Program Characteristics/ScopeA rotational talent development program\n\n12 months in different disciplinesAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}