{"Job ID": "69866960", "Description": "is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are, a visual messaging app that enhances your relationships with friends, family, and the world;, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses,.We are looking for an Account Executive to join Snap Inc! You'll build and manage partnerships with brands and agencies to help them expand their digital presences on Snap. What you'll do: Identify, prioritize, and secure business opportunities\n\nEnsure that our clients receive the highest level of sales and operational customer service\n\nPartner with other cross-functional teams on structuring and driving operational and strategic initiatives\n\nDefine the overall approach for specific accounts, develop work plans, and create compelling sales propositions by utilizing internal and external data\n\nDevelop and implement best practices for client interaction, sales, and services\n\nDevelop metrics to measure the growth and performance of accounts and provide reports as needed\n\nCreate persuasive sales presentations using market trends and case studies\n\nAnalyze campaign performance statistics and recommend performance enhancements\n\nArticulate and update clients on Snapchat products and developments\n\nBe responsible for educating clients and agencies on best practicesKnowledge, skills & abilities:Extensive knowledge of social media, mobile apps, and digital and mobile marketing\n\nAbility to perform well in a highly dynamic, constantly evolving environment\n\nExcellent communication and presentation skills\n\nAbility to engage and partner with C-Level executives\n\nAbility to win the support of key stakeholders\n\nConsistent track record of reaching and exceeding sales goals\n\nCreative, outside-the-box problem solver, and strategistMinimum qualifications:Bachelor’s degree or equivalent preferred\n\nProven experience of marketing, brand advertising, media sales, and/or online advertising experience.\n\nExperience of operating within a retail advertising environment would be highly preferred.Preferred qualifications:Strong existing relationships with top marketing decision makers for brands and their agenciesJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}