{"Job ID": "69867275", "Description": "At Udemy, we’re on a mission to improve lives through the power of learning. We’re a leading global learning company and one of the world’s largest education platforms, with more than 59 million learners. Our goal is to provide flexible, effective skill development to empower organizations and individuals.&nbsp;Talented people are everywhere, and the right opportunity can be hard to come by. That’s why we’re focused on revolutionizing learning, using our skills and expertise to help others develop theirs and reach their full potential. Individually, we bring our unique perspective to reimagine the way we share knowledge. Together, we can improve lives by making learning more accessible for our learners, our instructors, and businesses around the world.Udemy is headquartered in San Francisco with global offices in Australia, India, Ireland, Türkiye, and the US. Learn more on our company page.You’re a collaborative, data-driven, and creative problem-solver who loves diving into the details. You thrive in dynamic environments like ours where you can strategically build systems, processes, and tools to create best-in-class customer experiences. You love influencing our company’s growth journey and enabling our internal go-to-market teams to efficiently generate revenue and scale.As a Deal Desk Analyst, you will be a key member of the Revenue Operations team, directly contributing to the growth of our B2B business by building out the systems, process, and infrastructure to help scale our organization to the next level.&nbsp; This is a full-time position reporting to the Senior Manager of Deal Desk. The Deal Desk Analyst is a cross-functional role that partners with our sales, customer success, legal, and finance teams to streamline our overall quote-to-order process.&nbsp; You will be responsible for reviewing contract booking submissions for accuracy and alignment to our revenue recognition policies, defining standard deal submission procedures, providing analytical and process support to standard deals to drive process improvement and automation, and facilitating requests with our respective stakeholders.Manage the day-to-day optimization of standard deals and serve as the primary point of contact for sales, finance, and legal in these transactions.\nProvide guidance to the sales team on contract accuracy and best practices to increase deal velocity and decrease cycle time.\nEstablish a streamlined review process for pricing, customer information, contract accuracy, and alert Sales of any inaccuracies or supporting information necessary to close the transaction.\nClose all transactions from an operational perspective and ensure all opportunities are accurate.\nContribute to Deal Desk initiatives by participating in special projects, including the creation of the playbook for finalizing booking submissions, Deal Desk automation, dashboards, sales analytics, and various performance metrics.\nEnsure that closed-won opportunities have the appropriate expertise, review, and approvals.Experience driving operational improvements in a Deal Desk or Sales Operations function for a high growth US based B2B SaaS company.&nbsp;\nDemonstrated track record of process improvement for contract processing and general support to the sales organization.\nStrong organizational skills and business judgment with the ability to handle projects independently end-to-end.\nExcellent communication and critical thinking skills to understand sales policies and processes at a company and individual sales rep level.\nSalesforce.com CPQ experience preferred but not required.\nStrong interpersonal skills to work across the UFB business with sales, finance, legal and others.&nbsp;\nStrong process thinking to drive continuous improvements to the Deal Desk.\nAbility to work independently across multiple time zones and coordinate with management based in the USWe aspire to be as vibrant and dynamic as the communities we serve, as inquisitive as those who use our platform, and as revolutionary as the future we strive to open for everyone. Here are some of the things we love about life at Udemy:We’re invested in creating an inclusive environment that welcomes a diverse range of backgrounds and experiences. From creating employee resource groups, ensuring we’re a Fair Pay Workplace, and building a flexible work culture, our belonging, equity, diversity, and inclusion (BEDI) initiatives always put our people first. We want you to be able to bring your authentic self to work because when we all do, we’re better for it.\n\nLearning is what we do – inside and out. Our Learning &amp; Development team is second to none, helping ensure your journey is one of continuous progression. You’ll also have unlimited access to Udemy courses, monthly UDays (meeting-free professional development days), and a generous annual professional development stipend.\n\nOur reason to exist is to revolutionize learning – that calls for taking risks and learning from failures. Whether it’s our hackathons (a company-wide effort to envision new possibilities for our product) or sharing our prototypes, we see experimentation as a crucial step on the path to success.\n\nWe’re committed to creating world-class employee experiences and are proud of the recognition of this by Great Place to Work. Learn more about our certification here and find out what it's like to work at Udemy on our blog.Of course, the best thing about being part of Udemy is knowing your work makes a difference for people and organizations around the world. You’ve got the skills; why not use them to help others develop theirs?At Udemy, we value diversity and inclusion and consider qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition, or disability.&nbsp;Our benefits package at Udemy “starts with U” and is grounded in mission-driven benefits that intentionally align with our core values. Here’s a sneak peek at just a few highlighted benefits if you’re a full-time Udemate based in the India:Core Benefits: Comprehensive medical, life and income protection coverage\n\nParental Benefits: Financial assistance for fertility (including egg-freezing), adoption, and surrogacy expenses; twelve weeks of paid family bonding for birth, surrogacy, adoption, and foster placement. 26 weeks paid maternity leave for birthing parents as well as a two-week “ease-back” program that enables parents to return part-time at full pay\n\nWhole U: Fully paid memberships for meditation/mindfulness, therapy/coaching visits, financial planning, fertility and family building, maternity and newborn care, parenting and pediatrics, menopause care, breastmilk shipping, and caregiving support\n\nLearning: Free access to Udemy and Udemy Business plus a yearly stipend to spend on professional development\n\nRetirement: 12% of your base salary or INR 1,800 per month\n\nCharitable Giving: Corporate charitable match for eligible nonprofits and charities\n\nHolidays: 25 paid holidays throughout the year plus bank holidaysWhen you join Udemy in our Asia Pacific (APAC) region, you’ll have the chance to help our globally established business grow locally. We have a solid foundation and a great reputation — and you can be part of the next stage of our journey.Our investment in the region is significant, with offices in Australia and India and an expanding presence in Singapore, Indonesia, Japan, and beyond. It comes with countless opportunities to make learning more accessible to millions. You’ll work with various cultures with unique needs, affording you the chance to learn and progress in your career. And that progression doesn’t come at the cost of work-life balance; people are at the heart of our mission, which is why we’re committed to looking after ours.Would you like to learn more about Udemy? Here are a few resources:How Udemy Started [video]Investor OverviewInformation regarding data privacy is available within the Udemy Careers Privacy Notice.#LI - REMOTE#LI-TM1Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}