{"Job ID": "69867306", "Description": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment.  The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and ResponsibilitiesDesigns, develops and supports applications solutions with focus on HANA version of Advanced Business Application Programming (ABAP).\nThis specialty may design, develop and/or re-engineer highly complex application components, and integrate software packages, programs and reusable objects residing on multiple platforms.\nThis specialty may additionally have working knowledge of SAP HANA Technical Concept and Architecture, Data Modelling using HANA Studio, ABAP Development Tools (ADT), Code Performance Rules and Guidelines for SAP HANA, ADBC, Native SQL, ABAP Core data Services, Data Base Procedures, Text Search, ALV on HANA, and HANA Live models consumption.Required Technical and Professional Expertise4 -12 years of experience required.\nThe ABAP on HANA Application Developers would possess the knowledge of the following topics and apply them to bring in value and innovation to client engagements: SAP HANA Technical Concept and Architecture, Data Modelling using HANA Studio, ABAP Development Tools (ADT), Code Performance Rules and Guidelines for SAP HANA, ADBC, Native SQL, ABAP Core data Services, Data Base Procedures, Text Search, ALV on HANA, and HANA Live models consumption.\nDesigning and developing, data dictionary objects, data elements, domains, structures, views, lock objects, search helps and in formatting the output of SAP documents with multiple options.\nModifying standard layout sets in SAP Scripts, Smart forms & Adobe Forms\nDevelopment experience in RICEF (Reports, Interfaces, Conversions, Enhancements, Forms and Reports)Preferred Technical and Professional ExpertiseExperience in working in Implementation, Upgrade, Maintenance and Post Production support projects would be an advantage\nUnderstanding of SAP functional requirement, conversion into Technical design and development using ABAP Language for Report, Interface, Conversion, Enhancement and Forms in implementation or support projectsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kolkata, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}