{"Job ID": "69866472", "Description": "Main ResponsibilitiesThe ability to follow proper uniform procedures.\nThe ability to demonstrate a good sense of aesthetics, decorating and producing food products within the quality standard guidelines established by the hotel\nThe ability to work closely with standard recipes and presentations in order to maintain the established quality level of the kitchen\nThe ability to assist in production and maintaining of par stocks of meat, vegetables, dry store, etc. as determined by the Chef De Cuisine\nThe ability to assist in the training of subordinates, particularly to their development and training process.\nThe ability to assume the responsibilities of the Jr Sous Chef in his absence.\nThe ability to work neatly and clean, keeping work areas and walk-ins in accordance with sanitary standards.\nThe ability to maintain a cooperative working relationship with fellow employees.\nThe ability to respond properly in any hotel emergency or safety situation.\nThe ability to perform other tasks or projects as assigned by hotel management and immediate supervisor\nPrepares and submits food production checklist and inventory reports.Skills & requirementsExtensive experience in kitchen field in hotel industries. International Kitchen Experience will be an advantage.\nPostgraduate and / or Hotel Management School / Apprenticeship. Master Degree preferred but not required.\nMust have full knowledge of cooking and presentation of food for all departments in this kitchen, knowledge of sanitation requirements in handling foods. Must possess strong leadership quality, training techniques, good communication and organizational skills.\nTo organize and set up the assigned section of the satellite kitchen as efficiently as possible to increase speed and maximize productivity, to train the culinary employees in that section of the kitchen in the skills necessary for them to perform their given tasks and duties, to ensure that kitchen operating equipment’s are maintained to a good standard with minimum breakage.\nRequired to have good English when it comes into understanding, speaking, and writing.\nMust be able to exert physical effort in transporting  pounds, endure various physical movements throughout the work areas, reach up and down, remain stationary at times throughout work periods, and satisfactorily communicate with guests and colleagues to their understanding.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}