{"Job ID": "69868512", "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Software Engineer.In this role, you will:Providing Monitoring HR IT Interfaces and doing application health checks, following application maintenance schedules and communication stakeholders; including but not limited to:\nUnderstanding Application Monitoring SOPs. Monitoring Interfaces as per the defined processes.\nTroubleshooting system issues and escalating as appropriate. Communicating issues to the relevant teams.\nManaging issues to ensure timely resolution – strong time management to review current issues raised in the queue and escalating issues as needed.\nCreating KB for each issue and maintains KBs.Proper coordination with various teams.\nAbility to take on, monitor, troubleshoot and quickly resolve queries and issues. Ability to escalate in detail to the System Team Leader any system queries and issues that require specialist intervention.\nRaising incidents for any Vendor application issues through Vendor Support Portal. To proactively support the Global HR IT Function Interfaces.\nTo work with relevant parties to resolve any issues with the Interfaces. Assisting other team members in BAU tasks.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}