{"Job ID": "69866678", "Description": "OVERVIEWPositionBusiness Innovation ManagerJob CodeReports toDirector of Planning and FinanceDirect ReportsDivision/SectionNEOM UDepartmentERI FinanceSectorEducation, Research, and Innovation Sector (ERI Sector)Job FamilyFinanceERIThe ERI Sector will be a world class education, research, and innovation hub, that inspires and empowers the best minds: technology to better the world, innovation through the \"lab of the future” and life-long personalized development. It will be focused on the fusion of the liberal arts with digital thinking, computing, and technology to solve humanity’s most pressing problems. ERI Sector’s Faculty, Scientist, and students, through immersive, synergistic relationships and partnerships with the NEOM community, its other sectors, and The Line, will serve as the creators and stewards of the “living laboratory” NEOM aspires to be, to imagine, inspire and enable the groundbreaking discoveries and breakthrough innovations the world needs to advance and to thrive. Their innovative approaches in technology-enabled, personalized experiential learning across disciplines, and their bold research pursuits to conquer pressing societal challenges and to define new scientific frontiers, will be supported by exceptional facilities and laboratories which, augmented through immersive partnerships with the NEOM sectors, their industrial partners, and the Line, will enable and foster an unmatched ecosystem for purposeful collaboration, life-long learning and creative exploration at the service of society.Role PurposeThe Business Transformation Manager within the Finance Department at NEOM's Education, Research, and Innovation sector is a dynamic role that requires a seasoned professional to lead and drive strategic financial transformation initiatives. The role is responsible for partnering with various stakeholders across the organization to streamline processes, enhance financial performance, and ensure compliance with industry standards and regulations.KEY ACCOUNTABILITIES & ACTIVITIESCollaborate with senior leadership to define and execute financial transformation strategies that align with NEOM's vision and objectives.\nIdentify areas for process improvement within the finance department and develop action plans to streamline workflows, optimize resource allocation, and enhance overall efficiency.\nLead change initiatives related to financial transformation, ensuring buy-in from stakeholders and effective implementation of new processes and systems.\nAnalyze financial data to identify trends, assess performance, and recommend strategies for improvement.\nIdentify financial risks and develop mitigation strategies to safeguard NEOM's financial stability and compliance.\nWork closely with other departments, such as Research and Innovation, to align financial objectives and support their initiatives.\nDevelop and maintain financial models to forecast NEOM's long-term financial outlook, considering various scenarios and potential growth trajectories.\nDevelop and review complex financial models and valuations to support innovation initiatives.BACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and ExperienceBachelor's degree in Accounting, Finance, or a related field\nAccounting or finance certification mandatory\nMinimum of 5 years of experience in financial modeling, valuations, and/or innovation leadership.\nProven track record of managing innovative projects and delivering impactful results.\nExperience working across diverse industries.\nAdvanced proficiency in financial modeling and valuation techniques.\nStrong innovation leadership and project management skills.\nExcellent stakeholder engagement and relationship management abilities.\nOutstanding analytical and problem-solving capabilities.\nEffective communication and presentation skills.Note: This job description is intended to convey essential job duties and responsibilities and is not exhaustive. Management may revise this description at any time.COMMUNICATION - MAIN STAKEHOLDERSInternalJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}