{
    "Job ID": "69865911",
    "Description": "Wood is currently recruiting for Construction Supervisor Electrical  with extensive experience in the oil and gas petrochemical industry Candidate must be able to work on rotation14/14  we are only considering applications from local Iraqi nationals preferably residing in Iraq, BasraTo liaise with the Client’s In-Country Team\nTrouble-shooting the design, identifying, and resolving issues with Construction Contractor by raising and resolution of Site/Technical Queries\nLiaise with Construction Supervisors on day-to-day issues\nEnsure compliance with workpack for project execution at site. Raise query (if any) on workpack to engineering team proactively\nCompleting and reviewing as-built documentation\nTo attend daily/weekly progress meetings and generate status reports as requested\nReview and acceptance of final E & I system handover documentation on behalf of the project\nPlan, assist in direction and execution of E & I work, including equipment in the field, to meet project objectives\nMaintains first-level quality assurance to confirm that the installations of all electrical and instrumentation equipment and support systems in accordance with the plans, specifications, and industry standards.\nAssist construction personnel with general technical details\nEnsures that all FAT / SAT and other tests and inspections are performed, witnessed, and documented in accordance with approved procedures\nCollaborates with construction management to eliminate any hazards associated with the work that may adversely affect the environment or the safety or health of employees\nInterpret equipment vendor drawings and manuals, P&ID’s, Schematic diagrams, interconnection diagrams, loop diagrams, layout drawings, cable schedule, cause & effect diagrams, typical installation and hook-up diagrams\nProvides resolution for technical engineering problems, coordinates application of solutions.\nProvide support on material availability to the construction contractor, liaise with material co-ordinator and engineering team (as required)\nAble to review construction method statements, ITPs, MTCs, check lists\nProvide required support during pre-commissioning and commissioning activities. Previous experience of Emerson DeltaV plant ICSS, pre-commissioning and commissioning, will be an added advantage\nEnsure project schedules are being met\nInteract with all subcontractors during construction phase of a projectBSc, BEng or equivalent in Electrical5+ year of relevant experience in oil & gas industry\nElectrical or Instrumentation Background\nSound supervisory and organisational skills\nClear communicator with good interpersonal skills\nAn active listener with the ability to focus on customer requirements\nAble to motivate the EPC contractor on the importance of safety\nFamiliar with ISO and OHSAS standards\nWilling to implement new initiatives, open to new ideas, can move innovative ideas to successful outcomes\nProven experience in a similar role.Construction Supervisory experience essential.Wood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Iraq",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}