{"Job ID": "69867168", "Description": "JASARA PMC, a joint venture between Public Investment Fund (PIF), Jacobs, and Saudi Aramco, is seeking a highly skilled Senior Design Manager to join our team. As the Senior Design Manager, you will be responsible for leading a team of designers and engineers in the development of innovative designs for social infrastructure programs in Saudi Arabia. This includes overseeing the design process, ensuring that designs meet client needs and adhere to project requirements, and managing project budgets and timelines. The successful candidate will have a strong background in civil engineering and proven leadership skills that will enable them to excel in a dynamic, challenging environment.At JASARA, we are committed to excellence in all that we do. As a Senior Design Manager, you will play a critical role in helping us deliver on the promise of Vision 2030 and bring visible change within the Kingdom of Saudi Arabia.Lead a team of designers and engineers in the development of innovative designs for social infrastructure programs in Saudi Arabia\nOversee the design process, ensuring that designs meet client needs and adhere to project requirements\nManage project budgets and timelines, ensuring that projects are delivered on time and within budget\nCollaborate with clients, project managers, and other stakeholders to ensure that project goals are met\nProvide technical expertise and guidance to team members\nDevelop and maintain project schedules, ensuring that all milestones are achieved in a timely manner\nDevelop and maintain strong relationships with clients and stakeholders, serving as a trusted advisor and partner throughout the project lifecycleJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}