{
    "Job ID": "69866164",
    "Description": "Company Overview:If a culture of excellence, innovation and ownership is what you’re searching for, consider putting your experience in motion at Flowserve. As an individual contributor, or as a leader of people, your enterprise mindset will ensure Flowserve’s position as the global standard in comprehensive flow control solutions. Here, your opportunity for professional development and industry leading rewards will be supported by our foundational commitments to the values of people first, integrity and safety. Thinking beyond opportunity and reward, at Flowserve, we are inspired by working together to create extraordinary flow control solutions to make the world better for everyone!As a Pump Original Equipment Supervisor, you will be responsible for overseeing and coordinating all aspects of the pump original equipment manufacturing process. You will lead a team of project engineers/coordinators and work closely with engineering, procurement, and quality control departments to ensure the timely and efficient production/delivery of high-quality pump equipment. Your role will be pivotal in maintaining a smooth workflow, meeting production targets, and ensuring adherence to safety and quality standards.Principal Accountabilities:Project Planning: Lead the team in the development of the Project strategy, plan and schedule. Timely submission of order status, drawings, documentation, and delivery updates and schedules as required by the order.Control: Drive the team to proactively address problems and ensure that small issues do not become time consuming problems. Ensure the Project is on schedule and within budget.Performance & Quality: Ensures that the product meets the Customer’s and Flowserve’s performance and quality requirements, also ensure that these requirements have been documented in the Project Quality Plan and passed down to all functions and suppliers. Ensure Project design reviews are conducted, and that quality is designed and built-in to the product. Ensure compliance with all Engineering standards and ISO procedures.Communications: Work with Sales, Engineering, Technical Services and operations to ensure proper communications with the Customer and facilitate the resolution of discrepancies. Plan and facilitate meetings with Sales and the Customers to accomplish such resolution. Ensure that all communications in and out of the Project Team are clear, handled in the appropriate manner and are documented.Documentation: Ensure that all documentation is completed and delivered as required by the Contract SDRL.Supply Chain: Ensure that the Project quality specifications and Terms & Conditions are routed down to the Engineering office and Purchasing dept. Work with Supply Chain on critical project issues.Contract Change: Ensure that any change to the Contract or POs, whether from the customer or internal to the project team, is addressed in the appropriate manner.Risk Management: Ensure that risk is managed throughout the life of the Project and that solutions are proactively driven by the team.Financial: Ensure that all deliverables meet the Contractual requirements, and that Finance is informed to invoice customers for payment.Complies with Flowserve policies and procedures, as well as all applicable laws and regulations.Requirements:Bachelor’s degree in mechanical Engineer with a business background preferred.\n\nTechnical familiarity with industrial and engineered pumps and ability to hold technical communication with internal and external stakeholders.\n\nExperience in technical reviews and requisition preparation for buyouts such as motors, diesel engines, mechanical seals, and sealing systems.\n\nProject Management experience of 5-8 years in the pump industry - Desirable\n\nProject Management Professional Certification (PMP) - Desirable\n\nExperience with foreign markets, managing operations in remote locations, and export controls necessary.\n\nFamiliarity with financial and operational reporting, metrics, and performance management systems required.\n\nStrong leadership skills are necessary, especially the ability to influence across matrix organization and build high performing teams.\n\nKnowledge of Lean Manufacturing and Continuous Improvement processes are a Desirable for the position.\n\nProficient in using Microsoft Word, Excel, Access, Lotus Notes, Projects and Power Point software.\n\nDemonstrable familiarity with Oracle.\n\nFluent English.\n\nInternational and domestic travel is required – approximately 10%Req ID : R-7177Job Family Group : EngineeringJob Family : EN EngineeringEOE including Disability/Protected Veterans. Flowserve will also not discriminate against an applicant or employee for inquiring about, discussing or disclosing their pay or, in certain circumstances, the pay of their co-workers. Pay Transparency Nondiscrimination ProvisionIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access flowservecareers.com as result of your disability. You can request a reasonable accommodation by sending an email to employment@flowserve.com. In order to quickly respond to your request, please use the words \"Accommodation Request\" as your subject line of your email. For more information, read the Accessibility Process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatif, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}