{
    "Job ID": "69866768",
    "Description": "Job Requisition ID: 153622 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the role\nWe are currently looking for competent & performance driven Data Engineer to contribute build Enterprise Data Lake for Al Futtaim by ingesting, modelling various Data sources using Data platform.What you will doResponsible for implementing robust data pipelines using Microsoft and Databricks technical Stack\nResponsible for building Azure Devops to deploy the ADF pipelines.\nAbility to talk to Business clients, understand the requirements  and convert them to technical specification documents.\nProvide technical design, pyspark coding to accomplish the project deliverables as planned/scoped\nProvide technical design, pyspark coding to accomplish the project deliverables as planned/scoped\nExplore the latest Azure technologies and  passion to learn new products from DatabricksRequired skills to be successfulBachelor’s Degree preferably Information Technology\n5 years’ experience in Data Engineering\nAdvanced working knowledge and experience with relational and non-relational databases\nExperience building and optimizing Big Data data pipelines, architectures and data sets\nStrong analytic skills related to working with unstructured datasets\nPreference will be given to UAE Nationals with family bookAbout the team\nBased in Dubai Festival City, the role will report to the Data Platform Lead and you will be working in a busy environment wherein you will be dealing directly with the business requirements to develop ADF and Databricks pipelines meeting with out any glitch in production Data pipelines. What equips you for the roleThe ideal candidate for this role should possess a strong experience in Azure Datafactory (ADF), Databricks, Eventhub, Python, PySpark ,Azure Synapse and SQL  \nAzure Devops experience to deploy the ADF pipelines.We’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}