{
    "Job ID": "69867147",
    "Description": "Why Birdeye?Once upon a time, local businesses could attract customers through advertising and word of mouth. However, that has all changed. Today consumers choose where to spend their money based on online reputation and digital experiences. Modern companies must deliver exceptional experiences that create repeat customers and need a platform that can do this at scale. Local businesses often need help to overcome the complexity and inefficiencies of using multiple applications to manage and optimize their marketing and customer experience operations. Their use of fragmented point solutions keeps them from achieving true customer insights and acting upon them in real time.This is the challenge that Birdeye solves with its all-in-one reputation and customer experience platform. More than 100,000 local businesses and brands use Birdeye to be found online through local listings and reviews; engage with consumers through webchat, text, and social media messaging; collect digital payments; and gain insights to improve customer experience with survey, ticketing and benchmarking tools.Birdeye is the leading all-in-one platform trusted by over 100,000 businesses of all sizes to manage online reputation, connect with customers, and generate insights. Founded in 2012 by Naveen (the 2021 EY Entrepreneur of the Year) and Neeraj Gupta, Birdeye is based in Palo Alto, CA, and backed by investors Marc Benioff, Jerry Yang, and Accel-KKR. Learn more at birdeye.com.Birdeye is looking for hands-on technologists and experienced Senior Engineering Manager - Mobile Apps with expertise in developing and managing Android and iOS native applications. As the Mobile Senior Engineering Manager, you will be responsible for leading our mobile app development team, overseeing the entire app development lifecycle, and ensuring the delivery of high-quality, user-friendly mobile applications. Your role will involve working closely with cross-functional teams, guiding the technical direction, and driving innovation to maintain our competitive edge in the mobile app market.ResponsibilitiesLeadership and Team Management: Lead and manage a team of mobile developers, designers, and quality assurance professionals.\nFoster a collaborative and innovative work environment that encourages professional growth and creativity.\nSet clear objectives, provide regular feedback, and conduct performance evaluations to ensure team members meet their goals.\nTechnical Strategy and Planning:\nDevelop and execute the technical strategy for Android and iOS app development, aligned with the company's overall goals.\nStay updated with the latest trends, advancements, and best practices in mobile app development, and ensure their integration into the development process.\nPlan and allocate resources effectively to meet project deadlines and objectives.\nProject Management:\nOversee the entire mobile app development lifecycle, from concept to launch, ensuring timely and successful project delivery.\nCollaborate with product managers, stakeholders, and other teams to define project scope, requirements, and deliverables.\nManage project risks, identify potential bottlenecks, and implement mitigation plans.\nQuality Assurance:\nEnsure that the mobile apps meet high-quality standards and are thoroughly tested for functionality, performance, security, and user experience.\nImplement automated testing and continuous integration processes to enhance development efficiency and product reliability.\nTechnical Expertise:\nProvide technical guidance and mentorship to the development team, assisting in complex problem-solving and coding challenges.\nReview and approve architectural designs and code changes to maintain code quality and consistency.\nPerformance Optimization:\nAnalyze app performance metrics and user feedback to identify areas for improvement and optimize app performance and responsiveness.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}