{
    "Job ID": "69866400",
    "Description": "As the world's largest research organization, NielsenIQ is powered by talented creative scientists. Our Data Scientist Business Leaders come from diverse disciplines such as statistics, research methodology, mathematics, psychology, business, engineering, physics and demography. These professionals drive innovation, new product ideation, develops complex analysis and delivery of data insights to measure what consumers buy. Own Data Science solutions for client requests and provide initial recommendations for complex client raised issues. \nSupport Internal and External Clients with the understanding of Data Science design and methodology.\nAccompanied senior leaders meet with clients to understand business needs and help offer innovative solutions.\nWork on creating new solutions use cases, proof of concept and prototypes by exploring diverse data sets using tools such as python/r.\nUnderstand NielsenIQ products and services to suggest new solutions for client challenges.\nCollaborate with other Data Science team units.\n Automate and develop solutions for existing processes.\n Innovate and create out of the box solutions by leveraging large and diverse data sets and state of the art technologies.Professionals with degrees in Maths, Data Science, Statistics, or related fields involving statistical analysis of large data sets.\n1-2 years of experience in market research or relevant fields.\nKnowledge of Pakistan retail & consumer market understanding, geographies, and basic demographics\nPassionate about innovation and technology.\nProblem-Solving skills, resourceful. Responsible.\nAbility to effectively convey complex concepts to non-experts\nIntellectual curiosity and persistence to find answers to questions\nEager to continuously learn and adapt to changing technologies and tools.\nGood command of written and spoken English, requored to liaise with clients.\nGood collaborative and interpersonal skills to communicate at all levels.\nWorking knowledge with Python, SQL, R, and data visualization tools (e.g. Spotfire, Tableau, etc) and mapping tools.\nFamiliarity with marketing analytics, including designing experiments  and  consumer behavioranalysis.You’ve dabbled in data. You’ve perused Python. And you have the communication chops to translate it all into conversation or presentations. While you’ve worked with global cross-functional teams, you can also put your head down and focus on independent projects. Seeing the big picture takes attention to detail. Keeping up with the fast-changing world of digital media measurement takes someone who recognizes that. You know what’s happening in big data and you’re ready to influence what’s next.About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}