{
    "Job ID": "69867297",
    "Description": "To lead Change Management – IP Core and provide 24/7 support, build effective interlocks with partners, fine tune processes and launch initiatives and projects in order to complete the task in defined timeline. Effectively engage with the team in order to coach, empower, motivate and transform to achieve strong performers.Operations Management and excellence – efficiently Manage the team through agreed processes and MOPs. Strong partner governance on daily/weekly/monthly.Take Ownership on defined project & ensure closer of highlighted escalations until resolutions.Enforce adherence to company policies, processes and procedures to eliminate non-compliance.Function KPI Reporting and vendor management – Define the mechanism to provide analytical inputs & trackers. Develop progress reports and statistical reports as required, for management / Partners review.Besides ensuring smooth daily operations, the role is also responsible for periodic cross functional engagements, to identify and implement the opportunities for experience / KPI improvements.Key Responsibilities:Error Free executions of change activities – First time right approach.\nPublishing of function KPI dashboard & trackers.\nAnalytical analysis to identify improvement area.\nTeam management to drive the routine operations.\nEscalation management & prioritization of work flow accordingly.\nExperience in ISP / MPLS large enterprise or Service provider network.\nKnowledge of ITIL v4 framework an Technical certification would be added advantage.Desired profile & Job Knowledge:Exposure various transport technologies in the telco or vendor environment.\nGood understanding of IP technologies.\nHands-on experience on protocols such as Segment-Routing, PCEF, BGP, ISIS, OSPF.\nSolid Work experience in ISP / MPLS large enterprise or Service provider network. Hands On troubleshooting skills on Routing Platforms (Cisco ASR9k/Juniper/Nokia/Huawei)\nStrong team-working and collaboration skills across various levels\nGood in Project handling or Lead > 20 team membersBehavioral competencesResult-orientation\nCustomer focus\nInnovation\nAnalytical skills and strong problem-solving skills\nStress management\nStrong communication and presentation skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}