{
    "Job ID": "69866487",
    "Description": "Job Number 23167294 Job Category Engineering & Facilities Location JW Marriott Hotel Riyadh, King Fahad Road, Riyadh, Saudi Arabia, Saudi Arabia VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? Y Position Type Non-Management POSITION SUMMARY Fix minor plumbing problems such as unclogging drains. Assemble pipe sections, tubing, and fittings. Fill pipes or plumbing fixtures with water or air to detect and locate leaks. Review blueprints, building codes, and specifications. Study building plan and inspect structure in order to plan installations. Measure, cut, thread, and bend pipe to required angle. Install and maintain pipe assemblies, fittings, valves, appliances, and fixtures. Perform miscellaneous minor repairs. Perform preventative maintenance on tools and equipment. Follow all company and safety and security policies and procedures; and report safety hazards, accidents, or injuries; complete safety training and certifications. Ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Welcome and acknowledge all guests according to company standards and anticipate and address guests’ service needs. Develop and maintain positive working relationships with others. Speak with others using clear and professional language. Ensure adherence to quality expectations and standards. Move, lift, carry, push, pull, and place objects weighing less than or equal to 75 pounds without assistance. Assist with moving, lifting, carrying, and placing of objects weighing in excess of 100 pounds. Grasp, turn, and manipulate objects of varying size and weight. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Move up and down a ladder. Stand, sit, or walk for an extended period of time. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}