{
    "Job ID": "69867072",
    "Description": "Engineer CI/CT/CD pipeline that is optimized to run within minutes\nEnforce best practices in code quality and release/deployment process to achieve near zero production incidents.\nBuild manage and various development, test and production environments, required for effective release management. Deliver single click deployment to all environments.\nDesign, build and maintain continuous integration, testing and deployment (CI/CT/CD) pipeline for microservices, middleware, web, Android mobile and iOS mobile apps.\nCollaborate with architects, development engineers and system administrators to provision and maintain the platform infrastructure both on premise as well as cloud (for development, test and production environments).\nBuild and maintain system and application health check and house-keeping jobs.\nTroubleshoot system and connectivity errors and follow up with administrators, vendors or other teams for timely resolution.\nDevelop, maintain and document best practices in source control management and infrastructure as code.\nBuild test and manage the implementation of new application solutions at enterprise scale, leveraging the latest automation and DevOps technologies to minimize support overhead and re-work while streamlining the deployment and upgrade processes.\nTrack, maintain and renew infrastructure, web and mobile application certificates, signing keys, key-stores and profiles.\nTrack, enforce and maintain code quality, security and performance reports.\nIdentify improvement areas and engage the required stakeholders to successful implement the changes.\nKeep track of evolving technologies and perform proof of concept integrations for successful platform integrations as per roadmap.\nMaintain platform collaboration tools such as JIRA and Confluence.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}