{
    "Job ID": "69866825",
    "Description": "GAR (Global Accts Rec) is looking for a proactive, customer and detail oriented Collections Analyst whose main responsibility will be to manage and resolve receivables related queries received from Amazon customers. As a Collections Analyst, you will support Amazon’s customers to resolve billing issues, reconcile accounts and drive monthly collection targets. The successful individual is expected to be self-motivated, be a quick learner, have strong ownership and earn trust with our customers to facilitate timely payment.\n\nSummary of Responsibilities\n- Understanding of Accounts Receivables process\n- Follow-up with customers via emails and phone calls to ensure timely collection of payments for assigned portfolio\n- Maintain detailed post correspondence update on accounts receivable records to ensure aging is up to date, credits and collections are applied, uncollectible amounts are accounted for, and miscellaneous differences are cleared\n- Collaborate with various stakeholders (Billing, Finance, Legal, Tax, Customer Service) to resolve customer disputes and queries, to establish and maintain good client relationships, both internally and externally\n- Monitor high-risk accounts and ensure timely escalation of challenges to management\n- Continually look at ways to improve the customer experience\n- Assist in streamlining and improving the accounts receivable process by identifying areas of improvement\n- Meet the monthly productivity goals\n- Reconcile complex accounts and have excellent attention to detail\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- Bachelor's degree in accounting and commerce (B. Com)\n- Knowledge of Excel at an advanced level\n- Experience with Microsoft Office products and applications\n- 3+ years of finance operations/shared services, accounts payable, account receivable (collections) or general ledger experienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}