{"Job ID": "69865516", "Description": "Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com. Wealth Management Technology Wealth Management Technology is responsible for the design, development, delivery, and support of the technical solutions behind the products and services used by the Morgan Stanley Wealth Management Business. Practice areas include: Analytics, Intelligence, & Data Technology (AIDT), Client Platforms, Core Technology Services (CTS), Financial Advisor Platforms, Global Banking Technology (GBT), Investment Solutions Technology (IST), Institutional Wealth and Corporate Solutions Technology (IWCST), Technology Delivery Management (TDM), User Experience (UX), and the CAO team. Job Profile Define and leads the implementation of strategic solution as well as identify tactical solutions when necessary. Leads projects delivery and ensure projects are within scope, time constraints, and deliverables are of the highest quality. Work with other leads to further technology led transformation agenda Coaches team members to maximize their performance and potential Proactively seeks knowledge through external and internal sources Leverage DevOps to automate application testing and deployments Leads projects delivery and ensure projects are within scope, time constraints, and deliverables are of the highest quality.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}