{
    "Job ID": "69866081",
    "Description": "Your opportunity to make a real impact and shape the future of financial services is waiting for you. Let’s push the boundaries of what's possible together.As a Senior Director of Software Engineering at JPMorgan Chase within the Corporate Investment Bank in Securitized Products Group team you will lead multiple technical areas, manage the activities of multiple departments, and collaborate across technical domains. Your expertise is applied cross-functionally to drive the adoption and implementation of technical methods within various teams and aid the firm in remaining at the forefront of industry trends, best practices, and technological advances.Job responsibilitiesLeads multiple technology and process implementations across departments to achieve firmwide technology objectives\nDirectly manages multiple areas with strategic transactional focus\nProvides leadership and high-level direction to teams while frequently overseeing employee populations across multiple platforms, divisions, and lines of business\nActs as the primary interface with senior leaders, stakeholders, and executives, driving consensus across competing objectives\nManages multiple stakeholders, complex projects, and large cross-product collaborations\nInfluences peer leaders and senior stakeholders across the business, product, and technology teams\nChampions the firm’s culture of diversity, equity, inclusion, and respectRequired qualifications, capabilities, and skillsExperience developing or leading large or cross-functional teams of technologists\nDemonstrated prior experience influencing across highly matrixed, complex organizations and delivering value at scale\nExperience leading complex projects supporting system design, testing, and operational stability\nExperience with hiring, developing, and recognizing talent\nExtensive practical cloud native experience\nExpertise in Computer Science, Computer Engineering, Mathematics, or a related technical fieldPreferred qualifications, capabilities, and skillsExperience working at code levelJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}