{"Job ID": "69866679", "Description": "Amazon.com, Inc. seeks to be Earth's most customer-centric company, where customers can find and discover anything they might want to buy online, and endeavors to offer its customers the lowest possible prices. Today, we operate retail websites in nine countries, offering millions of products in more than 40 categories worldwide, and we still like to work hard, have fun and make history!\nRetail Business Services (RBS) leverages technology to improve customer experience and selling partner experience while lowering Amazon’s cost structure. Vision of RBS is to accelerate Amazon’s flywheel by 1) improving the customer experience by identifying and eliminating Buying issues, 2) improving selling partner listing quality to drive GMS and reducing fulfillment defects to drive profitability . We strive to eliminate the root cause of the defect and wherever not possible, we leverage machine learning to find and fix at scale or surface to selling partners.\nKey job responsibilities\nAs a Program Manager, you will work on reducing customer negative experience with the Retail process. In particular, (1) Partner with Worldwide stakeholders, partnering teams, Subject Matter Experts, Vendor managers & Brand-owners to help streamline and standardize areas impacting buying experience; (2) Work with tech PoCs in RBS and in the partnering team to develop scalable solutions and (3) establish mechanism to monitor the performance of solution post implementation; (4) Prepare holistic reports on Buying experience levers, insights and recommendations\nA successful candidate will be an exceptional strategic thinker and will have exposure to customer experience improvement. Key skills for the role include an extraordinary ability to deal with ambiguity, to network effectively and influence partner teams without authority, to overcome unforeseen obstacles, and a passion for developing a deep understanding of the program, product and ops excellence.\nA day in the life\nThe successful candidate will have good project management skill with the ability to conduct in-depth analyses, think big and identify game-changing opportunities. In addition, you will be expected to deliver solutions and programs that are technology based, highly scalable, secure, and flexible - all while maintaining customer and business partner focus. You will work with internal and external stakeholders to identify, define, and specify solutions meeting our customers’ and vendors’ needs.\nThe individual would have targets on process standardization, automation and business metrics. Would engage with the business and support/service teams and build customer confidence through quality delivery, robust processes and sound reporting metrics. The individual would be responsible and be a point of escalation for the delivery by the teams working with him/her\nWe are open to hiring candidates to work out of one of the following locations:\nChennai, TN, IND\n- 3+ years of program or project management experience\n- 3+ years of working cross functionally with tech and non-tech teams experience\n- 3+ years of delivering cross functional projects experience\n- Experience defining program requirements and using data and metrics to determine improvements\n- Experience managing teams\n- Experience implementing repeatable processes and driving automation or standardization\n- Experience in data mining, data management, reporting, and SQL queriesJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}