{
    "Job ID": "69865914",
    "Description": "Wood is recruiting for a Proposals Manager to be based in our office in Abu Dhabi, United Arab Emirates. The successful candidate will be responsible for the preparation of proposals across the Middle East Projects Business Units reporting to the Regional Tendering and Proposals Manager.The individual in this role has the responsibility and accountability for the preparation, managing the preparation of and quality of proposals for their respective businesses. This role is typically assigned and responsible for a specific part of the business within their respective Business UnitsThe successful candidate will have specialist proposal preparation with requisite commercial skills and knowledge with regards to the Oil, Gas and Chemicals sector and ideally extending across other Wood lines of business. The individual should be highly motivated, have international experience across a large geographic footprint, ideally including GCC countries, and be confident engaging and interfacing at all levels, both internally and client facing.Responsible for managing proposals within Middle East. Mentors and coach direct reports in proposals processes and procedures, personnel development and trainingProviding direction and leadership for all tendering and proposals personnel working within designated region, covering all corporate governance and tendering / proposals deliverables throughout the pre contract activities.Reporting to the corporate commercial function, ensuring delivery of proposals in accordance with the Tender Governance Procedures and the requisite Delegation of Authority. Implementation and delivery of key policies and procedures including Tender Governance Procedures.Success criteria includes:Increased win rates within the respective businesses\nEnsure the business is properly supported\nEnsure quality of proposals, presentations and other customer responses\nThrough proposal audits, ensure process is being followed and best practices are incorporated into customer responses\nIncreased amount of boilerplate content for respective Business Unit in KnowledgeHub Summary of responsibilities include:Foster the sell of Wood Solutions – Encourage and support cross selling of services for Wood across all markets\nMaintain records of active proposals, pre-qualifications and other customer responses with status and submission dates for assigned business\nSupport and contribute to the continual improvement of proposal procedures and processes\nTake end-to-end ownership and command of proposal development and related support processes and procedures, including written proposals, oral presentations, Best and Final Offers, Evaluation Notices, Final Proposal Revisions, etc.\nEnsure compliance of Tender Governance Policy gates during pursuit and proposal development\nAssist Regional Tendering and Proposals Manager in auditing past proposals for businesses within the Business Unit\nProvide training on the proposal process and proposal best practices for all proposal team members within their respective Business Unit as well as all major stakeholders of the proposal process\nManage Proposal Leads and Coordinators for their assigned part of the business including the coordination of workload (allocation of assignments), quality of output, ensure expectations and goals are clear and business is supported\nEvaluate job performance of Proposal Leads and Proposal Coordinators of respective business\nEnsure incorporation of proposal best practices into all customer responses for respective business\nOversee/support pre-proposal positioning where appropriate, as well as proposal development strategies and implementation. This includes development of capture plan and proposal planning document development, facilitation of strategy sessions to develop the win strategy and theme/value proposition for proposals.\nOversee the production of proposals of all sizes / types and other customer responses (including prequalifications, expressions of interest, presentations) and ensure that the proposal is compliant and delivered on time.\nThis key role collaborates with capture management, SMEs, and proposal staff to write, edit, review, and produce winning proposals.\nProactively directs and provides interface management to a team of complex skills and functions, including (but not limited to) BU and BG Wood management, Capture Manager, Technical Lead/Project Manager, volume / section leads, authors, SMEs, Legal, Estimating, Commercial\nEnsure customer's requirements are fully met. This involves conducting searches for appropriate materials and writing and editing project summaries, resumes of project personnel, and other supporting sections of the proposal, as necessary. Leverages existing archived proposal information.\nDevelop and implement the proposal management plan (responsibility / compliance matrix)\nDevelop and implement the proposal schedule\nLead proposal kick-off and review meetings\nOversee and / or expedite the following proposal processes: information gathering and compilation, data entry, formatting, editing, reviews, reproduction and delivery\nWhere appropriate, assist / expedite managers in the management review of contract, tax, and insurance requirements\nExpedite proposal stakeholders to obtain outstanding proposal deliverables per the proposal schedule and in order to make the proposal deadline\nEnsure consistency and branding compliance for all customer responses\nPrepare post-bid submissions, organize the response to requests for clarification\nManage the development of customer presentations (pre-proposal or post-proposal)QualificationsBachelor’s Degree from an accredited university required in Engineering, Business, Marketing, Communications, Journalism, or related majors preferred\nMinimum Eight years proposal experience with similar firms preferredKnowledge, skills and experienceTechnical and / or engineering experience preferred but not required\nThorough understanding of and ability to implement industry best practices and Proposals/Marketing techniques\nIndustry experience related to the supporting business is preferred but not required\nPossess and ability to apply extensive management skills and knowledge in field of specialization/expertise, in order to ensure functional area performs as expected and in compliance with both internal and external policies, laws, etc.\nAbility to manage projects, interface with customer representatives, interpret customer / stakeholder requirements, manage customer/stakeholder expectations, plan workload, organize proposals team resources and deliver on agreed deadlines\nStrong proofreading, editing and business software skills (style, format, grammar, etc.\nExcellent knowledge of Microsoft Word, Excel, PowerPoint, and Adobe Acrobat; Proficiency with SharePoint and InDesign is desired. Personal attributesConsistent personal ethic: integrity, dependability, initiative, and quality in line with our Corporate Vision and Values\nEven tempered in fast-paced, high-pressure environment\nStrategic creative thinker with ability to “think outside the box”\nProven team player, capable of leading and motivating the proposals team\nAdvances analytical skills and ability to follow structured approachWood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}