{"Job ID": "69867322", "Description": "JOB PURPOSE:Responsible for updating the regulatory credit registry system in accordance with governing regulations, and laws in order to ensure effective and transparent reporting. In addition to submitting daily and monthly I-score files in the form of electronic data files in accordance with I-score guidelines.KEY ACCOUNTABILITIES:Prepare & submit daily and monthly I-score files in the form of electronic data files in accordance with I-score guidelines.\nInvestigate and respond to I-score disputes timely and accurately.\nMaintain current knowledge of I-score guidelines for proper reporting and responding to disputes.\nInsert the ID/CR information, related parties & facility type to create CBE code for the new consumer clients.\nInsert notifications of non performing customers on CBE Network.\nPrepare official letters to CBE for amendments & closure of relationships.\nAssists with regulatory queries & provides requested support & documentation. \nExtract reports from CBE Network to be used in validation and review process.\nSupport in conducting  full analysis for (GL) variances against monthly declaration balances and take the corrective actions in this concern before uploading on CIB link.\nCommunicate new regulatory information to multiple departments and ensure that information is interpreted correctly.Support in the Preparation & submission regulatory submissions relevant to CCR & I-score inquiriesPolicies, Processes and ProceduresFollow all relevant department policies, processes, standard operating procedures and instructions so that work is carried out in a controlled and consistent mannerDay-to-day operationsFollow the day-to-day operations related to own jobs in the department to ensure continuity of workComplianceComply with all relevant CBE regulations, banking laws, AML regulations and internal CIB policies and code of conduct in order to maintain CIB’s sound legal position and mitigate any potential risksQUALIFICATIONS, EXPERIENCE, & SKILLS:Qualifications & ExperienceBachelor's degree of commerce business administration, accounting or its equivalent.\n0-2 years’ experience in data entry field.\nKnowledge of technical issues related to financial statement analysisSkillsStrong leadership and communication skills\nGood understanding of financial statements analysis.\nVery good command of English language.\nQualitative and quantitative analytical skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}