{
    "Job ID": "69867510",
    "Description": "Do you ever wonder what happens inside the cloud?DigitalOcean (NYSE: DOCN) simplifies cloud computing so builders can spend more time creating software that changes the world. With our mission-critical infrastructure and fully managed offerings, DigitalOcean enables startups and small and medium-sized businesses (SMBs) to rapidly deploy and scale modern applications. As a remote-first organization, our employees, like our customers, are based around the world.Cloudways - A DigitalOcean.Com Company is hiring for people who already did an amazing job in Software Quality Assurance capacity, and ready to take the next level exciting challenge. Our ideal candidate is a customer focused individual with hands-on functional and automated testing experience.What You’ll Be Doing At Cloudways - A DigitalOcean Company:Build, Manage and Execute functional and automated test suites to exercise our software to verify the growing feature sets and customer requirements.\nAutomate tasks through the creation and maintenance of scripts and tools\nDevelop functional stress and systemic level test suites and test infrastructure in manual and automated ways to measure coverage.\nParticipate in requirements review and understand new feature development.\nCollaborate with the software engineering team on QA/Testing topics.\nPerform platform testing to find out flaws within the interface.\nUpdate the testing procedure to provide better testing analysis and user experience.\nContribute to our quality projects, including automation of test cases, with a focus on feature deployment.\nActively participate in agile meetings with product management and development teams.\nGather requirements, build testing solutions and troubleshoot issues to deliver a high-quality product.\nCommunicate technical concepts/issues clearly to internal teams.\nDevelop, document, and maintain test cases and validation reports.What You’ll Add to Cloudways - A DigitalOcean Company:2-3+ years of minimum, job related experience as a QA engineer, preferably with Selenium/Cypress/Appium/ Cucumber/BDD&nbsp;\nHands-on experience in test infrastructure/test suite development\nExperience in Web Applications and API testing\nAbility to diagnose and debug issues\nUnderstanding of web protocols and tools\nExperience with build systems and version control systems (e.g., Jenkins/Git/TFS)\nStrengths in SQA methodologies include coverage analysis and commitment to quality\nStrong communication and documentation skills.Why You’ll Like Working for Cloudways - A DigitalOcean.com Company:We reward our employees. The salary range for this position is based on relevant years of experience and skills. Employees may qualify for a bonus in addition to base salary; bonus amounts are determined based on company and individual performance. We also provide equity compensation to eligible employees including grants of equity upon hire and the option to participate in our Employee Stock Purchase Program.\nWe value development. You will work with some of the smartest and most interesting people in the industry. We are a high-performance organization that is always challenging our teams and employees to continuously grow. We maintain a growth mindset in everything we do and invest deeply in employee development through formalized mentorship and other internal programs. We provide all employees with reimbursement for relevant conferences, training, and education.\nWe care about your well-being. In addition to cash and equity compensation, we also offer employees a competitive array of benefits. It includes health insurance, unlimited vacation, retirement benefits, a generous parental leave program, and additional resources to support employees' overall well-being. While the philosophy around our benefits is the same worldwide, specific benefits may vary in other countries due to local regulations and preferences.\nWe value diversity and inclusivity. We are an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*This is a remote role#LI-Remote&nbsp;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}