{"Job ID": "69866053", "Description": "As a infrastructure engineer you will Identifies problems, proposes solutions, suggests what's best for the team . Job Responsibilities :\n• Define and provision infrastructure as modular, defined through code. We use cross plane heavily for infrastructure deployment.\n• Evolve a platform that can be deployed across different regions, availability zones and cloud providers.\n• Develop pipelines to roll out infrastructure changes in a safe and testable way.\n• Ensure our cloud deployments are secure and structure our build/deploy pipeline has speed and reliability.\n• Promptly investigate/fix issues, ensure they do not resurface in the future and keep an eye on performance and making sure we use the right approach to identify/solve problems.\n• Provision to monitor and observe infrastructure.\n• Ability to deal with ambiguous requirements, execute POC’s to decide on solutions.\n• Be actively involved and contribute to architectural discussions, challenge existing thought process and amicably work with the team to achieve objectives.\n• Act like a leader, own end to end execution, work with product managers, stakeholders to understand and execute product requirements to collectively accomplish OKR’s.\n• Understand various deployment models for the product, work with the team to build and orchestrate the deployment.\n• Focus on quality, observability and automation in all phases of software engineering from inception to testing and deployment.\n• Work on complex data orchestration pipelines from metadata to event logs and storage to improve data quality and observability for multiple data products. Required Qualification, Skills and Capabilities :\n• A curious mindset, lookout and willingness to engage and solve complex technical problems.\n• Experience in one of terraform, pulumi or cross plane is required. Strong Golang programming skills .We use cross plane heavily, so we expect you to be fluent in cross plane when you start working with us.\n• Awareness of patterns and approaches in building large-scale systems with focus on infrastructure scalability, reliability and observability.\n• Experience with defining and managing automated infrastructure pipeline for Apache Spark, Flink, Pinot and similar frameworks and applications is a plus.\n• Exposure to AWS and GCP, familiarity with cloud concepts is required. Experience with working full time in any cloud is a plus.\n• Academic qualification in a computer science or STEM (science, technology, engineering or mathematics) related field.\n Preferred Qualification, Skills and Capabilities :\n• Take Ownership and identify problems, proposes solutions, suggests what's best to focus on. Sees themselves as a problem solver. Contributes to the problem at hand, even when outside their area of specialty.\n• Collaboration with team. Enjoys pairing and mobbing programming. Doesn't compete with peers. Shares their knowledge and understanding with everybody.\n• Adjusts quickly to changing priorities and conditions. Copes effectively with complexity and change.\n• Doesn't sacrifice the future for the present. Chooses technologies and approaches based on the end goals.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}