{
    "Job ID": "69868527",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC, and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organizations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an experienced professional to join our team in the role of software engineer.In this role, you will:Performing the full range of UAM tasks using SailPoint\nPartnering with application owners to on board applications to SailPoint in a controlled fashion whilst maintaining service quality levels\nProduction of UAM technical, process documentation and training materials\nProviding input to management as a subject matter expert\nGood awareness of other IAM tools and the IAM technical landscape, technological developments and trends\nProficient in integration configuration and implementations of more than one market leading IAM and PAM solution E.g.: SailPoint and CyberArk / Hashicorp/ Centrify would be highly beneficial\nFamiliarity with implementing Roles Based Access Controls.\nDriven and enthusiastic with a 'can-do’ attitude and a strong sense of ownership\nExperience in carrying out application integrations with SailPoint IdentityNow dealing with advanced or custom connectors.\nAnalyse issue reports and develop software solutions and fixes with responsibility for the delivery, with limited or no supervision\nMonitor system performance trends and identify potential issues\nExperience with QA duties is a plus (usability testing, performance testing, automated testing, test scripts, test cases and test plans).\nSecurity software or internal IT audit experience a plus.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}