{
    "Job ID": "69869869",
    "Description": "THE OPPORTUNITYTHE ROLERESPONSIBILITIESBe the leading voice of dubbing production in the respective dubbing market\nDefine standards for excellence and general creative guidelines for the respective territory/country\nAnalyze content to identify and solve localization challenges in collaboration with the Title Managers/Coordinators on select titles\nBuild and leverage strong relationships with the talent community in the respective territory/country. Maintenance and growth of existing talent databases\nCollaborate with Dubbing Partners and/or Title Managers and Coordinators on dubbed talent casting and enforcement of creative guidelines on select titles\nSupervise eligible recording and/or mixing sessions for sensitive and/or high-priority titles\nAccommodate and/or provide risk assessment for any special upstream localization requests in the territory.  Address, resolve and escalate issues and concerns as needed\nConstantly monitor and support local existing dubbing partners to ensure creative and operational excellence is maintained.\nKeen awareness of the local dubbing market and future collaborations\nConsistent upkeep and education around union/labor/talent-related situations that could impact Netflix’s content\nSupport and collaborate with cross-functional partners for Inclusion & Diversity initiatives to ensure our strategy is consistent across the organization\nBe sensitive to the competitive landscape in the respective marketREQUIREMENTS5-10+ years prior experience in managing localization and/or creative workflows within the entertainment industry; background in dubbing creation and a passion for languages and translation quality.\nExcellent written and verbal communication skills. Native speaking skills in at least one regional language, preferably Tamil and/or Telugu is preferred.\nPrior experience in managing localization workflows in the entertainment industry; background in dubbing and subtitling creation and a passion for languages and translation quality. \nDeep understanding of differences, subtleties, and nuances between subtitle and dub translation. \nAttention to detail: able to get to the root cause of a problem; able to creatively figure out a solution or propose changes to existing workflows, priorities, tools & technologies, as required.\nSensitivity to servicing, particularly within the internal organization, including but not limited to the Marketing team, Public Relations, and Content team.\nCreativity and the passion to challenge current industry standards & practices.\nAble to represent Netflix in any industry event on the respective territory/country. \nFamiliarity with the current trends in the entertainment industry in the respective country/territory is a must.\nUnderstanding of all forms of professional audio formats, technology, best practices, and maintenance.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}