{
    "Job ID": "69866423",
    "Description": "Job Number 23167219 Job Category Engineering & Facilities Location Le Méridien Cairo Airport, Cairo International Airport, Cairo, Egypt, Egypt VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Perform minor routine maintenance on property vehicles (i.e., engineering trucks, shuttle vans, electric carts) including checking oil, fluid levels, tire pressure/wear, charging batteries, and replacing spark plugs. Perform preventative maintenance on tools and equipment, including cleaning and lubrication. Maintain proper maintenance inventory and requisition parts and supplies as needed. Maintain daily logs of operation, maintenance, and safety activities, including test results, instrument readings, and details of equipment malfunctions and maintenance work. Follow all company and safety and security policies and procedures; report maintenance problems, safety hazards, accidents, or injuries; complete safety training and certifications; and properly store flammable materials. Ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Speak with others using clear and professional language, prepare and review written documents accurately and completely, and answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees. Move, lift, carry, push, pull, and place objects weighing less than or equal to 50 pounds without assistance. Grasp, turn, and manipulate objects of varying size and weight, requiring fine motor skills and hand-eye coordination. Visually inspect tools, equipment, or machines (e.g., to identify defects). Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. At Le Méridien, we are inspired by the era of glamorous travel, celebrating each culture through the distinctly European spirit of savouring the good life. Our guests are curious and creative, cosmopolitan culture seekers that appreciate moments of connection and slowing down to savour the destination. We provide authentic, chic and memorable service along with experiences that inspire guests to savour the good life. We’re looking for curious and creative people to join our team. If you appreciate connecting with like-minded guests and have a deep desire to create memorable experiences, we invite you to explore career opportunities with Le Méridien. In joining Le Méridien, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}