{"Job ID": "69866706", "Description": "Role PurposeOXAGON, a region of NEOM, is set to be the leading zone for the development of advanced and clean industries, built on renewable energy. It will comprise one of the world’s most efficient and sustainable automated ports, fully integrated with the supply chain and logistics for the whole of NEOM. It will be home to a Research and Innovation district, with the purpose of accelerating labs to market. All of this will be underpinned by exceptional livability – building urban communities that provide quality of life for residents and visitors alike.   OXAGON will contribute to NEOM’s and Saudi Arabia’s vision to diversify the economy towards a knowledge-based economy (see www.NEOM.com). NEOM’s Manufacturing Sector (part of the OXAGON organization) focuses on developing 7 prioritized manufacturing clusters: Autonomous & Sustainable Mobility, Modern Construction, Technology & Digital, Renewable Energy, Water Innovation, Health & Wellbeing and Sustainable Food Production.The primary role of the Brand Manager is to be the guardian of the OXAGON brand across all aspects of the business and to own the brand architecture for expansion and manage agencies to create end to end branding solutions.The role is a senior position within the OXAGON marketing team and touches on all aspects of OXAGON as an organization and development.  This role will work with the Head of Marketing for OXAGON and the Brand Director and Sr. Manager in NEOM corporate to ensure that all materials developed align with the brand guidelines and that communication messaging is consistent with OXAGON and NEOM brand positioning and personality.As an experienced brand strategist you will be responsible for translating vision into clearly articulated brand positioning, visual identity and messaging.As such the role will also be responsible for the development and oversight of the Brand Studio, an in-house creative unit who can design, produce and manage branded material.Key AccountabilitiesPlanning and Strategy To work collaboratively with relevant external (agencies), namely the appointed brand agency and internal partners (Sectors, procurement, Consumer Insights & dev marketing, Communications, and others) to ensure key deliverables are consistently ‘on brand’.\nMaintain ownership and responsibility for the OXAGON brand and ensure all materials are updated regularly and distributed throughout the organization and properly implemented.\nImplementation of the brand with all 3rd party partnerships to ensure consistency and maximum benefit.\nProvide expert input into brand architecture decisions and evolve the architecture strategy considering the evolution of the business – naming and brand strategy for OXAGON districts, zones and assets.\nWork closely with internal stakeholders on the creation of new brands and naming solutions for new entities, initiatives, products, regions etc as required ensuring consistency of approach and alignment to the brand strategy and naming protocols.\nProactively provide input and suggestions on how best to evolve the brand from a visual and messaging perspective.\nDevelop the brand vision for companies and assets within the OXAGON portfolio\nAct as the point person within the organization to provide advice and feedback on branding of merchandise, products, services etc\nEnsure quality of deliverables and brand alignment and to manage workflow coming through the studio.People ManagementEnsure on-going management of the brand agencies by working closely on a day to day basis with their team.Manage the current team members and ensure development plans and objectives are in place.\nEnsure that relevant systems are in place that help the flow of communication across the team.Effectively manage project / business performance by planning, coordinating, delivering, evaluating and communicating as appropriate.Background , Qualifications and Skills8+ years experience in brand marketing within a top tier company or agency.\nA proven track record in brand strategy development and execution, brand roll out and implementation.  Experience in brand building and development of brand creative execution is mandatory.\nExperience in tourism or large scale developments would be beneficial.\nA proven track record in agency management and internal stakeholder engagement is a key requirement.\nExperience of working in Saudi Arabia or the Middle East is highly desirable but not mandatory.\nLine management of a creative team is mandatory and experience within an International corporate environment is desirable.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}