{
    "Job ID": "69866435",
    "Description": "Apply now Job no: 4077180\nCountry: Qatar\nVendome MallBootsBoots has been catering for healthcare and beauty needs for over 160 years. With a mission to help customers’ look and feel better than they ever thought possible,Boots pharmacies have earned a reputation for providing customers with excellent, trustworthy, healthcare advice through the team of highly qualified, professional pharmacists. In addition to this, the store staff provide a friendly and helpful service to customers looking for expert skincare advice, the latest cosmetics, essentials for babies and children and even indulgent hair care treats.The Role:No7 Consultants work at a Senior Sales Associate/ Beauty Advisor level, guiding customers on how to take care of their skin and recommending products from the Boots No7 line accordingly.No7 is Boots' top selling product line, with skincare items ranging from moisturizers to anti-ageing creams, sun screen lotions and more.As a consultant, your responsibilities will include:- Recommending and demonstrating the use of company products to customers.- Supporting management whilst acting in accordance with company policies and procedures.- Providing excellent customer service.Qualifications & Requirements:You will have:- High School level education.- Fluency in spoken Arabic.- A Passion for skincare and skincare products.- Experience in makeup application and sales is an advantage (but not a requirement).- Certification from courses in skin care would also be an advantage.- Only female applicants will be considered for this role.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}