{
    "Job ID": "69866156",
    "Description": "Qualification and abilities :High level technical education\nHave electrical, mechanical and control knowledge (high technical education)\nMinimal 9 years’ experience in technical function (electrical and mechanical)\nTeam builder\nExcellent verbal and oral skills in English language\nProper communicative capabilitiesResponsibilities:Manage the maintenance crew\nImprove performance of maintenance crew\nPerformance communication internally (and with customer)\nLocating improvement opportunities\nMaintenance management for Automated Handling system\nDirect streamlined communication with the customer, subcontractors to ensure maximum synergy between maintenance of the whole plant and the automated handling system.\nHaving direct contact with customer management to create prospects.\nKeeps in close contact with head office for maintenance activities.\nManage maintenance teams\nShift schedules\nEnsure minimal man power & skills distribution\nSchedule and distribute activities\nLocate improvement opportunities, make improvement plan and execute / distribute improvement plan\nRotates staff to ensure wider levels of competence and cover are developed.\nDevelop, maintain and improve methods to gain and use relevant performance data\nAnalyse system, process and maintenance activity performance\nEvaluate and improve system, process and maintenance activity performance\nCommunicate performance status and improvement actions internally and with customer\nInitiate, sell and implement revisions, modifications and, retrofits (RMR);\nCommits to and drives performance improvement.\nWill liaise with operations manager on the impact of maintenance on the delivery of day to day operations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}