{
    "Job ID": "69866334",
    "Description": "Req ID:430479 Leading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwide What will you do?You will work with a team cognitive search experts and analysts,as part of our great and diverse team. You will develop cutting edge search applications .This will include interacting with customers, internal Developers, third party certifiers and other stakeholders.  \nWorking with Alstom will give you a unique possibility to gain in depth knowledge in the technical aspect of our business. This is a company where you can make a career and many of our employees stays with us for years.Job DescriptionInvlove with development activities in the pipeline of a cognitive search engine.\nIndex structured and unstructered data.\nWriting requirements and function specifications , experience in agile methodology\nEvaluate correctness of requirements driving implementation and already implemented design and tests.\nInvolvement in the Software delivery to customer.\n5 - 10 years of experience in Cognitive Search Field\nKey techinical expectation - more than 5 years of experience in angular and UI development.  In depth knowledge of angular and node js\nKey techinical expectation - experience with any search engines , experience in Elastic Search or Sinequa or any search engine\nmore than 5 Experience in C# and ability to write applications in .net (C# being preferred programming language)\nUnderstanding of Azure or AWS, devops, version management, Linux\nprogramming knowledge of python , understanding of machine learning models.Who are you?Computer Science or Information Technology Engineer exposed to Insight/AI/ML/NLP\nSoftware engineering/ Software development knowledge\nExtensive Knowledge and Experience in C#.\nKnowledge in ML/NLP\nExposure to Cognitive Search Concepts\nExposure to agile software development, working in cross functional teams.\nExpsore to  testing is considered a plus.\nEnglish is mandatory for this role; French will be considered a plus.\nExcellent team player and a good communicator.What do we offer?An agile, inclusive, and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.Alstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?  Equal opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected.  All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}