{"Job ID": "69867359", "Description": "Are you a person with innovative thinking and proactive attitude with continuous improvement as one of your career objectives? Join Global Business Service (GBS) Finance team at Novo Nordisk and get a life-changing career!Global Finance GBS Bangalore was established in 2007, is currently responsible for supporting Accounting, Finance & Procurement, Financial Planning & Analysis (FP&A) for Headquarters, North America, International Operations (IO), Product Supply & GBS Bangalore. The main purpose of our existence is to provide superior service to our stakeholders consistently and add value to the processes in terms of standardisation and efficiency.Primarily involved in analysis of budget, forecasting and financial reconciliations and work on any Adhoc analysis as per the business needs. You will be responsible for financial planning & reporting and work closely with the region/affiliate stakeholders to drive FPA initiatives. Simultaneously, you will responsible for various activities like driving continuous improvement of financial controlling or planning processes across department, ensure all the business and process updates are shared within team, proactively pursue to increase own business understanding of Novo Nordisk and the pharmaceutical industry/other and share the same across FP&A department.Qualification• Master’s in finance (or equivalent) from a well-recognised institute with good academic track record and grades• 3-8 years of relevant work experience in Financial Planning and analysis• Experience in business controlling and other finance disciplines• Solid understanding within the field of accounting and finance• Knowledge of pharmaceutical industry is an advantage• Proficient with PC-tools, extensive knowledge of MS Office, SAP ECC, SAP BW.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}