{"Job ID": "69866702", "Description": "Manage the end-to-end delivery of projects prioritised in alignment with the department's strategy. Leverage existing or new technologies to achieve Skywards' vision. Be responsible for the business support and operations functions to ensure Skywards business continuity. Job Outline: - Be the `expert? in the Loyalty domain with experience in implementing products and partnership functions across all interfacing systems. Enable requirements pertinent to security, data governance, communication, legal and analytics. Organise, influence and facilitate end-user requirements gathering with external partners and divisions within Emirates to put in place, system and process enhancements. - Gain understanding of various internal Skywards processes as well as those of vendors, suppliers and partners with the aim of identifying key system and process improvements. - Deliver all projects in a timely manner, within budgets and as per agreed quality standards. Manage end-to-end user and business process testing to ensure all business requirements are met. Maintain a central repository of all relevant documentation. - Contribute to the sourcing, evaluation and selection of solution vendors. - Participate in partner launch negotiation meetings as the Skywards systems expert. Support partner contracting to ensure system formats, procedures, terms & conditions are correctly represented. Ensure all systems and processes are in place to maintain agreed levels of operation and business continuity. - Ensure that all identified stakeholders and end user communities are fully briefed well in advance of new functionality introduced to manage the adoption of change. - Provide regular project updates to internal stakeholders and ensure work is progressing according to agreed priorities and timelines.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}