{"Job ID": "69865775", "Description": "Organization Unit PurposeDue to the introduction of new product, Personal Finance, by the Emirates Islamic Bank.Job PurposeTo build / leverage key business relationships to maximize market share & achieve sales though the personal Finance and cross sell of other products.Job ContentAssigned sales target to be met on yearly and monthly basis.Achieve Cross selling targets of non-assigned products and services to contribute to the revenues and market presence.Explore new markets and customers within the assigned territory to enhance sales volumes.Create and build customer awareness on new products through mailers, personal visits etc. to prospect business.Manage key accounts to ensure superior service and customer loyalty.Person SpecificationsPossesses in depth knowledge of the various dimensions of the market industry. Possesses good understanding of policies & their implications.Self-motivatedExcellent communication skills, result oriented, analytical thinking, capable to develop others.Good public relations, perseveranceAt least 2 years UAE Banking Experience RequiredTanfeethEstablished in 2011, Tanfeeth is the Gulf Cooperation Council’s (GCC) first large-scale Business Service Partner and fully owned subsidiary of Emirates NBD. Tanfeeth is dedicated to supporting the Emirates NBD Group by delivering regional expertise, cost productivity, and excellence in customer service delivery in terms of quality, consistency and efficiency, to the Group’s growing customer base.In Arabic, ‘Tanfeeth’ means ‘getting the job done’ and that’s exactly what we do! We function as an operations and service platform with international customer service standards. Our end goal is to continue to raise the benchmark for customer service across the region and deliver exceptional customer experience through partnership, passion & people.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}