{"Job ID": "69866197", "Description": "TASS Field Technician 4 Doha QatarCACI is seeking a TASS Field Technician. Technicians shall also support the installation, inspection, adjustments, reconfiguration, and introduction of new or advanced technology, update, testing, and the related technical support for these systems by providing on-site technical assistance.What You’ll Get to Do:The installation of electrical system components as assigned (e.g. panels, pull stations, pulling conduit, wire, etc.) for providing enhanced and/or upgraded system capabilities.\n The installation, upgrade of and disassembly and reconfiguration of systems, operator and maintenance training, service, repair and maintenance of electronic and mechanical security systems.\nDiagnose electrical problems or failures in assigned systems for identifying equipment and/or systems repair.\n Provides technical expertise for security systems installed equipment upgrades and reconfigurations at designated bases in Southwest Asia.\n Works closely with the site’s Force Protection (FP) personnel on all security systems issues.\n Makes recommendations to the FP and On-Site FP Commander on the placement of new or upgraded equipment.\nMust understand microwave link installation, alignment, troubleshooting and repair and Radio Frequency monitoring control systems.\nDuties include manual labor, the lifting of heavy equipment unaided, digging, laying cable, power generation, fiber splicing, and working long hours in harsh environmental conditions.Required Skills:A successful candidate will possess a minimum of 10 years of technical experience relating to physical or electronic security system projects.\nMinimum of 5 years working in electronics, basic electric circuit troubleshooting.\nCandidates should have a strong background in installation of intrusion detection system CCDE, like Honeywell's Vindicator, and recent experience with electronic security systems, access control, CCTV, Wide Surveillance Thermal Imager, Long Range Thermal Imager, Ground-based Radars (MSTAR) and other security systems.\nAbility to write detailed trip reports to include sensor recommendations and placement derived from site surveys.\nPossesses a minimum of a high school diploma.  Associates and Bachelor's degree in a technical field preferred.\nMust be able to climb towers and carry a backpack of 50+ pounds unassisted.\nAbility to work independently and in a team environment.\nCandidates MUST BE ABLE TO BE DEPLOYED to war zones.\nA valid US passport and US driver licenses.\nActive US Secret clearance.What We Can Offer You:\n- We’ve been named a Best Place to Work by the Washington Post.\n- Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.\n- We offer competitive benefits and learning and development opportunities.\n- We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.\n- For over 60 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}