{"Job ID": "69861368", "Description": "Cyient is a global engineering and technology solutions company. As a Design, Build, and Maintain partner for leading organizations worldwide, we take solution ownership across the value chain to help clients focus on their core, innovate, and stay ahead of the curve. We leverage digital technologies, advanced analytics capabilities, and our domain knowledge and technical expertise, to solve complex business problems.With over 15,000 employees globally, we partner with clients to operate as part of their extended team in ways that best suit their organization’s culture and requirements. Our industry focus includes aerospace and defence, healthcare, telecommunications, rail transportation, semiconductor, geospatial, industrial, and energy.Job Description4 years of hands-on experience on robot offline programming using ABB Robostudio software for ABB robots and Fanuc Roboguide software for Fanuc Robots\nDesign and implement of robot processes including develop robot offline programs.\nAble to create offline program including paint path creation, paint path optimization, paint process parameters optimization to achieve product quality.\nPerform analysis and feasibility studies for new parts for robotic operations.\nBasic knowledge of Paint process is added advantage.\nOnline or Offline troubleshooting of ABB and or Fanuc Robots is added advantage.\nAbility to manage project without guideline and provide solutions.\nGood in communication Skills & ExperienceCyient is an Equal Opportunity Employer.Cyient recruits, employs, trains, compensates, and promotes regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, veteran status, and other protected status as required by applicable law. We are proud to be a diverse and inclusive company where our people can focus their whole self on solving problems that matter.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}