{"Job ID": "69866518", "Description": "We are looking to hire a hard-working and efficient Commis 1 to prepare meal ingredients for the chef de partie and assist with various kitchen duties. The Commis 1 responsibilities include informing the supervisor of malfunctioning or broken kitchen equipment, unpacking and organizing deliveries, and mopping up kitchen spills to prevent accidents and injuries. You should also ensure that all food items are properly stored to prevent spoilage.To be successful as a Commis 1, you should demonstrate good organizational skills and ensure that all duties are completed in a timely manner. Ultimately, an outstanding Commis 1 should be able to follow all instructions and comply with food health and safety regulations.YOUR DAY-TO-DAY:Accurately measuring meal ingredients for the Chef de Partie.\nPreparing meal ingredients, which includes seasoning of different meats as well as washing, peeling, and chopping vegetables and fruits.\nPreparing basic salads and sauces as directed by the Chef de Partie.\nReceiving deliveries and verifying that all ordered items have been delivered and are of good quality.\nTaking inventory of restaurant supplies and notifying the supervisor of low or depleted supplies.\nDiscarding all expired and spoiled food items stored in the stock rooms, refrigerators, and freezers.\nPerforming basic cleaning duties and ensuring that workstations are properly sanitized.\nPlating and presenting meal items as per the Chef de Partie’s instructions.WHAT WE REQUIRE FROM YOU:Bachelor's degree, diploma, or certification in culinary arts is advantageous.\nA food handler's certificate.\nProven commercial kitchen experience.\nSound knowledge of food health and safety regulations.\nThe ability to stand for extended periods.\nThe ability to work under pressure.\nEffective communication skills.WHAT YOU CAN EXPECT FROM US:We give our people everything they need to succeed. From a competitive salary that rewards all your hard work to a wide range of benefits designed to help you live your best work-life – including a full uniform, impressive room discounts, and some of the best training in the business.Our mission is to welcome everyone and create inclusive teams where we celebrate differences and encourage colleagues to bring their whole selves to work. IHG Hotels & Resorts provides equal employment opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. We promote a culture of trust, support, and acceptance. Always welcoming different backgrounds, experiences, and perspectives.IHG gives every member of the team the room they need to belong, grow and make a difference in a collaborative environment. We know that to work well, we need to feel well – both inside and outside of work – and through our well-being framework, we are committed to supporting well-being in your health, lifestyle, and workplace.So, join us and you’ll become part of our ever-growing global family.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Oman", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}