{
    "Job ID": "69866338",
    "Description": "At Grand Hyatt Doha, we focus on our brand promise of delivering Moments of More by offering challenging and rewarding careers that are more than just your typical job. Our values of Wellbeing, Inclusion, Respect, Empathy, Integrity, and Experimentation are the core of what we do. Our family atmosphere is what keeps our colleagues highly engaged.Maintain the hotel equipment, building, and asset in good condition to ensure its high performance and reduce the breakdown.\nReport immediately any misuse of hotel equipment and assets to their direct Supervisor or Shift Leader.\nUse initiative and foresight to undertake tasks outlined within the preventative maintenance program without the direction of the Shift Engineer/Chief Engineer.\nDaily inspection and rectification of all public areas in relation to your trade.\nRegular inspection and tours of the Mechanical, Electrical plant rooms and ensure that they are clean and in operating order.\nRegular inspection of the utilities and inform immediately the Line Manager in case any of failure, breakage, or shortage.\nEnsure that appropriate files are maintained and resources kept for future reference.\nComplete daily reports outlining work undertaken for the day\nCarry pager and respond to requests from departments regarding minor maintenance issues throughout the day.\nDoes lighting check to ensure all globes are in working order\nInvestigate reported faults, ex. Laundry, kitchen, rooms…etc.\nAssist in the planning, and scheduling of the daily operations and preventative maintenance.\nComplete periodic maintenance schedules\nMonitor Energy & water consumption used in the hotel.\nRegular tours and patrolling in and out of the hotel premises to ensure that the lighting schedule is implemented, for reducing energy consumption; Also to identify any water leaks.\nFamiliarize themself with the green engagement initiatives and the saving plans.\nReview the quality and quantity of the ordered materials and advice the direct supervisor or shift leader.\nFollow up on the purchase orders with the purchasing department.\nTo insure that the ordered equipment, appliances, parts, and chemicals are energy efficient, environmentally or eco-friendly productsMinimum 2-3 years experience in a similar role with a 5* hotel\nYou should have a proven knowledge of the installation, commissioning, operation, maintenance, and repair of the equipment.\nThe ability to find faults and rectify systems are essential.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}