{"Job ID": "69867964", "Description": "Leading the future in luxury electric and mobilityThe Manager, Facilities, will lead the coordination of office and retail locations across the Middle East.  This position will be engaged with stakeholders across multiple functions including Human Resources, Finance, Retail, and I.T.Duties:Ensuring employees are properly accommodated in a workplace that supports their needs and expectations.\nEnsure the office infrastructure is suitable to meet the near- and mid-term needs of the business and complies with all corporate facility standards (physical security, digital security, etc.)\nProcure equipment.\nManage third-party vendors supporting the ongoing maintenance and care of offices (cleaners, office support staff, etc.)\nIn concert with the Retail group and Marketing (brand management), activate galleries to plan, ensuring corporate standards for global retail locations are followed.\nAudit retail locations regularly for compliance, safety, and security.\nDevelop, monitor, and perform to budget for all facilities-related activities.Qualifications:8+ years’ experience managing facilities commensurate with the essential duties listed above.\n12+ years’ experience managing facilities, including luxury retail locations.\nFluent in Arabic and English\nStrong time management skills.\nAbility to prioritize competing requests and needs.\nHighly collaborative; comfortable working with people in a matrixed environment.\nExceptional verbal and written communication skills.\nCompetency in Microsoft applications including PowerPoint, Word, Excel, and Outlook.\nAbility to foster and support a culture of diversity, inclusivity, collaboration and teamwork; able to build and maintain positive relationships with colleagues across all departments .Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}