{
    "Job ID": "69865755",
    "Description": "Are you an Omnichannel Execution Lead who is energized by the challenge of being part of one of the leading pharmaceutical companies worldwide? If so, Omnichannel Analytics & Insights Lead role is the one for you to explore.As an Omnichannel Execution Lead, you will be responsible for the creation of specific OC customer engagement strategies to enhance customer experience and support brand objectives. The OC Execution Lead will lead a team of 5-10 to drive the OC transformation across the organization. He/she will support the design of OC campaigns, drive the deployment of new channels or platform and development of innovative content, and monitor campaign effectiveness to provide best-in-class customer experience through OC excellence.This role will provide YOU the opportunity to lead key activities to progress YOUR career, these responsibilities include some of the following:Primary Duties & Responsibilities:OC Strategy and RoadmapUnderstands and implements organization’s OC vision, strategy, and roadmap, acting as a trusted advisor to ensure seamless & integrated customer experience\nLeads the strategic design, and delivery of OC customer experiences, working closely with the Brand, Marketing, Sales & Medical teams\nSupports the development of data-driven, personalised customer journeys and monitors its implementation\nOversees the content strategy and supports personalization of content based on local HCP needs/preferences\nShares inputs to evolve OC approach to customer engagement by enabling the right capabilities that facilitate a fully integrated channel & content strategy\nAdvocates OC best practices across the organisation, ensuring continuity, unified messaging, and a quality customer experience across all OC touchpointsCross-functional Collaboration and Stakeholder ManagementWorks closely with BUDs / country leadership team to align on OC strategy and roadmap with overall business objectives, and monitor progress against defined targets\nPartners with relevant local and regional teams to evaluate and implement the digital solutions that enables seamless customer engagement\nDefines and co-develops integrated campaign strategies and channel strategies with the brand teams, to support brand objectives\nActs as a bridge between Business and Tech, translating the business requirements into technology builds and oversees the development of suitable Tech solutions to help meet business needsCustomer Insights & AnalyticsShares recommendations on customer experience KPI tracking, and reporting based on the local context aligned with defined business objectives; supports in optimizing OC performance and maximizing the outcomes\nTracks and shares external trends with relevant teams to further enhance GSK’s OC ambition; collaborates with\nMarketing to develop innovative, effective, and efficient solutions that cater to evolving market dynamics\nMaintains oversight of evolving marketplace conditions as well as the competitive landscape; continuously seeks and leverages innovative customer engagement techniques to bring new ways of thinking/CX mindset to the brand teams\nResponsible for monitoring the performance and effectiveness of OC campaigns in the LOCProject ManagementManages the projects for key OC initiatives; develops project plans and coordinates local marketing execution based on defined strategy and KPIs\nProvides strategic guidance and supports the implementation of the OC plans, ensuring strict compliance with local guidelines\nManages issues/concerns/risks related to OC execution and ensures its timely resolutionWhy you?Experience & Educational Qualifications:Bachelor’s Degree in Marketing, Sales, or any other related discipline. MBA preferred. 12+ years of recommended total experience, including 8+ years of relevant experience, preferably in omnichannel marketing, digital marketing, or customer engagement Skills & Knowledge :Technical Skills:Customer Experience ManagementChannel Strategy & ManagementCampaign Design & PlanningComms. Strategy & PlanningPerformance AnalysisDigital MarketingMarketing Analytics & Customer InsightsBiz TechBehavioral Skills:Leadership SkillsTeam ManagementImpact & InfluenceStakeholder ManagementSolution OrientedWhy GSK?\n At GSK, we have already delivered unprecedented change over the past four years, improving R&D, becoming a leader in Consumer Health, strengthening our leadership, and transforming our commercial execution. Now, we’re making the biggest changes we’ve made to our business in over 20 years. We’re on track to separate and create two new companies in 2022: New GSK with a leading portfolio of vaccines and specialty medicines as well as R&D based on immune system and genetics science; and a new world-leading consumer healthcare company of loved and trusted brands.With new ambition comes new purpose. For New GSK, this is to unite science, talent and technology to get ahead of disease together – all with the clear ambition of delivering human health impact; stronger and more sustainable shareholder returns; and as a new GSK where outstanding people thrive.Getting ahead means preventing disease as well as treating it. How we do all this is through our people and our culture. A culture that is ambitious for patients – so we deliver what matters better and faster; accountable for impact – with clear ownership of goals and support to succeed; and where we do the right thing. So, if you’re ready to improve the lives of billions, join us at this exciting moment in our journey. Join our challenge to get Ahead Together.Why Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Contact information:\nYou may apply for this position online by selecting the Apply now button.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}