{
    "Job ID": "69867681",
    "Description": "Who are we and what do we do?BrowserStack is the world's leading software testing platform powering over two million tests every day across 19 global data centers. BrowserStack's products help developers build bug-free software for the 5 billion internet users accessing websites and mobile applications through millions of combinations of digital environments—devices, browsers, operating systems, and versions. We help Tesco, Shell, NVIDIA, Discovery, Wells Fargo, and over 50,000 customers deliver quality software at speed by moving testing to our Cloud. With BrowserStack, Dev and QA teams can move fast while delivering an amazing experience for every customer.BrowserStack was founded by Ritesh Arora and Nakul Aggarwal in 2011 with the vision of becoming the testing infrastructure for the internet. We recently secured $200 million in Series B funding at a $4 billion valuation in June 2021.At BrowserStack we solve real problems—each day is a unique challenge and an opportunity to make a difference. We strive to be open, transparent, and collaborative, so no feat is too big to achieve. BrowserStack is an extension of its people and a place where they can grow both professionally and personally. To that effect, we’re humbled to be recognized  by leading organizations around the world:BrowserStack is Great Place to Work-Certified™ 2020-21\n\nNamed “SaaS Startup of the Year” in 2022 by SaaSBOOMi\n\nRanked in Forbes Cloud 100 in 2021 - for the second time\n\nFeatured in LinkedIn Top Startups India 2018Role in nutshell:Product- Led Growth: You will manage strategy as well as implementation of initiatives spanning across acquisition, monetisation and retention that will deliver tangible business impact. This will be a high visibility and high impact role”Desired experience:At least 8-12 years of relevant experience in a B2B/B2C Tech domain \n\nStructured thinking, strong problem-solving skills with a solid business sense`\n\nProficient in analytics and should be able to develop actionable insights using data\n\nBe able to multitask, prioritize, rapidly iterate and manage communications with different functions in a fast-paced startup environment\n\nStrong interpersonal, communication and presentation skills. Comfortable working with leadership across all functions\n\nExperience in product and/or growth roles with a track record of delivering business results will be valuableWhat will you do?You will lead multiple critical initiatives as a part of our Growth team in the online sales business unit.\n\nOwn the multiple business metrics, help with business planning and goal setting, define strategy to achieve the goals and deliver results to drive business growth\n\nAnalyze unstructured, ambiguous and complex challenges facing the organization making judicious use of qualitative and quantitative data; gather insights, define problems and identify underlying opportunities\n\nMake compelling recommendations; develop a tactical plan to execute and translate them into results\n\nSetup the long term roadmap for achieving best-in-class business growth levels.\n\nLead teams directly and indirectly to achieve the targets\n\nEvaluate and track key performance indicatorsBenefits:In addition to your total compensation, you will be eligible for following benefits, which will be governed by the Company policy:Medical insurance for self, spouse, upto 2 dependent children and Parents or Parents-in-law up to INR 5,00,000\n\nGratuity as per payment of Gratuity Act, 1972\n\nUnlimited Time Off to ensure our people invest in their wellbeing, to rest and rejuvenate, spend quality time with family and friends\n\nRemote-First work environment that allows our people to work from anywhere in India\n\nRemote-First Benefit for home office setup, connectivity, accessories, co-working spaces, wellbeing to ensure an amazing remote work experienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}