{
    "Job ID": "69866360",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Position : Sr Systems EngineerJob Summary:We are looking for a Systems Engineer to help us support, maintain and troubleshoot our constantly evolving infrastructure. The team you will be part of is responsible for ensuring highest levels of availability, performance and security for our business and internal stakeholders. Qualified systems engineers will have a background in IT and/or Computer Systems Engineering.Required Professional Expertise:Fully bilingual\nBS in Computer Science or equivalent\nComprehend and effectively support our infrastructure platform for technical and non-technical audiences\nStrong analytical skills to evaluate complex multivariate problems and find a systematic approach to gain a quick resolution\nITIL Knowledge of at least Incident and Change Management processes.\nExperience interacting with remote teams\nAt least seven (10) years of experience with Infrastructure hardware and software supportTechnical Skills:Experience working with Windows Server Management and troubleshooting of ADFS, DNS, DHCP, GPM, DFS, Terminal Services, IIS, WSUS, MFA.\nExperience working with Active Directory as a Domain Admin configuring/troubleshooting with ADUC, Domains and Trusts, Sites and Services, ADAC and PowerShell.\nAzure Administration experience (AAD, Azure Identity Management, Azure MFA and + O365)\nExperience working with VMware Virtual Machines, ESX Hosts, Vcenter or Hyper-V\nGeneral knowledge of how network LAN are set up\nExperience with Backup solutions/NetApp Storage.Essential Duties and Responsibilities:Operating IT services provided from centrally hosted either in the cloud or strategic Data Centers.\nEnsure that IT Services managed by the IT Operations team are delivered effectively to business customers. This includes the execution of SOPs, management of IT Incidents, IT Changes and IT Problems in ITSM based system on the related processes, procedures and work instructions.\nOperate and install on Enterprise-level Infrastructure for providing Microsoft services, such as AD, for global initiatives following those through to implementation via collaboration with project and support teams.\nIdentify opportunities to innovate, extend and enhance service delivery, Cost Savings, Automation everywhere possible.\nITIL approach to resolve technical problems. Troubleshoot occurring issues, investigating root causes and supporting resolution of the issues found.\nServes as escalation point for application support and troubleshooting, provides guidance and direction in resolution of escalated issues and/or complex production, application or system problems.\nPerform daily system monitoring, verifying the integrity and availability of all involved infrastructure elements server resources, systems and key processes, reviewing system and application logs and verifying completion of scheduled jobs. Ensure that the performance, scalability, and security is maintained and optimized.\nDeliver quality documentation allowing for smooth day-to-day operations.\nImprove existing processes through sustainable solutions to recurring problems and enhancements to existing solutions or documentation by automation.\nContact to vendor technical support for Priority 1 incidents.\nCooperate closely with the rest of IT Infrastructure & Operations, Architecture and Security teams.\nCooperate closely work with On-Shore IT Operations team.\nHave a deep respect for process, procedure, and compliance such as ITIL, Sarbanes-Oxley, SSAE, GxP, HIPAA, ITAR, and PCI-DSS, and HITECHBonus Points:Azure Administrator Certified.\nMicrosoft Certified System Administrator (MCSA) or equivalent experience.\nMicrosoft Certified Solutions Engineer (MCSE) or equivalent experience. \nVMware Certified Professional (VCP) or equivalent experience.\nCisco Certified Network Associate (CCNA), CompTIA Network+ or equivalent experience.\nLAN / WAN device configuration /administration (Cisco routers, CheckPoint Firewall)EVOLUTION: What we offer:A launch pad into various senior management opportunities – within the many business lines of Eurofins globally – or into the management hierarchy in our different corporate functions.\nThe opportunity to grow your project management skills in a demanding, fast growing organization.\nA chance to become part of a highly motivated international team of professionals.In a fast-growing group, successful leaders are frequently being offered increased areas of responsibility (subject to geographic mobility).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}