{
    "Job ID": "69869533",
    "Description": "Assistant Manager, Events \n(9769)At Atlantis, we exist to bring the extraordinary to every holiday and experience through connection, empowerment, precision, care and warmth. Inspired by the majesty and mystery of the ocean, Atlantis resorts are unique destinations full of life, wonder and surprise, where we seek to exceed our guests’ expectations at every possible turn. Atlantis Dubai is an iconic entertainment destination comprised of two world-class resorts; Atlantis, The Palm and Atlantis, The Royal; offering an unbeatable opportunity for you to grow and develop in your career. With a sense of exhilaration and discovery, we create unforgettable memories by providing guests the opportunity to discover an extraordinary world filled with thrilling adventures. Whether we are designing a couple’s retreat or serving the extraordinary in one of our award-winning celebrity chef restaurants, we approach everything with imagination to spark a sense of courage, inspiration and innovation. This is not simply our job, it’s our passion.About the roleDo you have a passion for sales and events? Do you love being part of a team looking to over exceed targets and helping to convert sales leads? Then our events division is awaiting your application today! As an Assistant Manager, Events, you will be responsible for Atlantis the Palm and Atlantis the Royal, and be primarily responsible for converting group leads, allowing the groups segment to reach and/or exceed the departmental revenue and room nights targets. This role is based in Dubai and is customer facing, both within Atlantis the Palm and Atlantis the Royal, and visitation of local accounts.You will report to the Manager, Events and help to prepare all proposals and quotes which must be sent out within 24 hours of the initial enquiry, in line with Atlantis the Palm and Atlantis the Royal’s standard template. You will also assist the team to secure all initial deposits related to the confirmed event, preparing any LPO to ensure swift payment is received.About youThe successful candidate will have at least 1-2 years' experience within a 5-star resort/hotel, within a similar role, and have a passion for events.The ideal candidate will also have experience with systems such as Delphi, have good spoken and written English, possess a flair for sales and events, and a passion for working within the hospitality sector. You will also have very strong administrative skills.Join a team that is adventurous, creative, warm-hearted and extroverted. We believe in making our guests happy beyond anything they have ever imagined. We wow them at every turn and create memories that will last a lifetime. You will be at the heart of this vision, to constantly innovate to deliver Amazing Experiences and Everlasting Memories.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}