{"Job ID": "69867931", "Description": "Who is Forcepoint?Forcepoint simplifies security for global businesses and governments. Forcepoint’s all-in-one, truly cloud-native platform makes it easy to adopt Zero Trust and prevent the theft or loss of sensitive data and intellectual property no matter where people are working. 20+ years in business. 2.7k employees. 150 countries. 11k+ customers. 300+ patents. If our mission excites you, you’re in the right place; we want you to bring your own energy to help us create a safer world. All we’re missing is you!We are seeking an IT intern with a passion for technology, collaboration, and creative problem-solving. The intern will actively contribute to meaningful projects and work closely with a mentor and with senior leadership.IT Intern Duties and ResponsibilitiesSupport the IT team in maintaining hardware, software, and other systems\nAssist with troubleshooting issues and provide technical support\nOrganize and maintain IT resources\nLend IT support in areas such as cybersecurity, programming, analytics, and data center managementRequirementsCurrently studying Computer Science, Information Technology, or Management Information Systems\nMinimum GPA of 3.0\nFamiliar with Java, .NET, JavaScript or HTML/DHTML and Microsoft Office Suite\nStrong verbal and written communication\nExcellent analytical and problem-solving skills\nAbility to work well in teams\nStrong work ethic and attention to detailBenefitsGain hands-on experience in an IT position\nShadowing and training experiences with knowledgeable professionals\nFlexible schedule for students\nCompensation available#LI-DNIDon’t meet every single qualification? Studies show people are hesitant to apply if they don’t meet all requirements listed in a job posting. Forcepoint is focused on building an inclusive and diverse workplace – so if there is something slightly different about your previous experience, but it otherwise aligns and you’re excited about this role, we encourage you to apply. You could be a great candidate for this or other roles on our team.The policy of Forcepoint is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.Forcepoint is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by sending an email to HumanResources@forcepoint.comApplicants must have the right to work in the location to which you have applied.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}