{
    "Job ID": "69865565",
    "Description": "Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com. Investment Mangement IT (IMIT) IMIT provides industry-leading strategies and solutions to enable business growth and deliver best in class functions to Morgan Stanleys Investment Management business. Job Profile This role is in (MSIM) IT team in Bengaluru as a Senior Java tech Lead - VP (10-12 years' experience) to join our performance IT team. This is a great opportunity for an experienced candidate to join a highly professional client facing development team, working on the Strategic MSIM Performance platform by designing & implementing solutions on Portfolio Performance systems. You will be working on the full application lifecycle in a fast-paced, high-stakes agile development environment, by partnering with global IT and business stakeholders of the current and future platform to analyze requirements, conduct business analysis, coming up with proposed designs for review by the wider team, implement and test the solution and finally provide training and support as part of the roll-out. Morgan Stanley Investment Management (MSIM) Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions, and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com. Key Responsibilities Leading strategic projects, working closely with key stakeholders to understand business and build the required technical solutions. Experience in delivery ownership Strong experience in developing enterprise level systems using Java and database technologies. Exposure to developing software in the financial domain is desirable. Lead a team of consultants and permanent staff Desire to learn the business domain and partner with stakeholders to specify new business features Working within an Agile team to ensure that all key technical requirements are identified, estimated, designed, implemented and tested. Working on a collaborative cross-technology team where Java, APIs (services), Angular, Tableau reports, C & PL/SQL interact with a range of business logic interfaces & systems. Understanding of Investment Performance Measurement or Asset Management concepts is highly desirable. Performing and supporting technical & design reviews of your own and other's stories. Ensuring that consistent design patterns, methodologies and design documentation are maintained across all of your development projects. Self-motivated and keen to learn new technologies and methodologies Be self-organizing and independent as well as be a team player Take responsibility of the systems ensuring and maintianing high standards on design, security and system availability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}