{
    "Job ID": "69866735",
    "Description": "SummaryThe Technical Safety Engineer plays a critical role in ensuring that all technical and process safety aspects of ENOWA power generation projects, spanning solar, wind, geothermal, thermal (grid-connected), and off-grid power generation, are adhered to. The Technical Safety Engineer’s expertise ensures that the project's design, construction, and operation phases meet or exceed all technical and process safety standards and regulations, safeguarding people, equipment, and the environment.Key Accountabilities and ResponsibilitiesEngineering Management       Conduct regular technical and process safety risk assessments and hazard analyses.\nIdentify potential hazards and recommend mitigation measures throughout the project lifecycle.\nCollaborate with design teams to ensure that technical safety considerations are integrated from the conceptual stages.\nReview engineering drawings, ensuring that technical safety aspects are inherently built into the design.\nDevelop, maintain, and update technical safety procedures, protocols, and best practices relevant to power generation technologies.\nEnsure all processes, from design to operation, are compliant with local, national, and international safety standards and regulations.\nOrganize and conduct technical safety workshops and training sessions for staff and contractors.\nPromote a culture of safety awareness throughout the organization.\nLead investigations into any technical or process safety incidents, ensuring thorough analysis, documentation, and timely reporting.\nRecommend corrective actions and ensure they are effectively implemented.\nStay updated with the latest safety standards, technologies, and best practices in the power generation sector.\nDrive continuous improvement initiatives to enhance safety performance.\nEngage with internal and external stakeholders, including regulatory bodies, to ensure the project's safety standards meet or exceed expectations.\nProvide regular technical and process safety performance updates to senior management and other relevant parties.Background, SkillsIn-depth understanding of technical and process safety aspects related to thermal and renewable power generation technologies.\nProven experience in overseeing large-scale power generation projects from design to operation from a technical and process safety perspective.\nDemonstrated experience in conducting risk assessments and hazard analyses.\nStrong analytical, problem-solving, and organizational skills.\nExcellent communication skills, both written and verbal, to convey complex safety concepts.\nA track record of successful collaboration with multidisciplinary teams.\nKnowledge of local, national, and international safety standards and regulations in power generation.\nOutstanding problem-solving skills, with the ability to identify, analyze, and resolve technical challenges.\nHighly effective communication skills to liaise with internal teams, external partners, and regulatory authorities.\nStrong organizational skills and the ability to manage multiple projects simultaneously.\nStrong leadership skills and ability to work independently and in a team.\nTravels to project sites as needed.QualificationsBachelor's degree in Engineering, preferably with a focus on Technical Safety, Chemical Engineering, or Environmental Engineering; a Master’s degree or further specialized training would be advantageous.\nMinimum of 5 years of experience in technical and process safety within the power generation sector, with exposure to both thermal and renewable technologies.\nProfessional certifications related to technical safety would be beneficial.\nProfessional certifications (e.g., PMP, PE, CEng) or equivalent.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}