{"Job ID": "69866782", "Description": "At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you. With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.Team  This role will be reporting to Director, Security Engineering. The security engineering org targets building state-of-the-art technology that will help reduce the risk surrounding the sensitive assets of the company with the least impact possible on operations, acts as guidance and facilitator to the security operations teams and helps shifting Security perception from blocker to enabler by building a relationship of trust with the other teams. The Endpoint Security Engineering team is part of larger Security Engineering org. The team’s mission is to provide best-in-class security to end-user devices and protect against cyber threats.Job Description What you get to do in this role: Implement security measures using DevSecOps framework to protect Mac & Windows laptops, VDIs, Mobile devices, Browsers, Email, Managed/Unmanaged software, IoT devices\nImplement user trust and device trust for managed and unmanaged endpoints\nImplement security posture management for managed and unmanaged endpoints\nSecure access to corporate, commercial, and regulated markets network from endpoints\nDeploy Endpoint Detection Response across the enterprise\nCollaborate with Insider Threat team to create DLP policies for hosts, network, email, and apps\nCollaborate with DG team to build connectors that perform data scan on critical assets\nManage privileged access for endpoints\nManage credential vaulting and rotation for corporate assets and endpoints \nParticipate in security incidents and help implement the containment and eradication. \nRemediation of audit findings.\nAccountable for the timely delivery of projects as per established roadmaps by working closely with the business teams To be successful in this role you have: A Computer Science/Engineering degree with 4+ years of proven, related experience is required\n5+ years of proven experience in endpoint or infrastructure security\nGood understanding of DevSecOps and CI/CD principles, with experience integrating security into these practices\nSolid understanding of cloud architecture, Linux and Windows OS and networking concepts\nHands-on experience with security tooling and technologies\nExperience with Automation (Python, Perl, bash scripting, etc.) \nExperience with EPM (JAMF, SCCM etc.) and MDM and MAM (Intune, AirWatch etc.) solutions   \nExperience in Linux, Windows, Mac systems security.  \nExperience/Knowledge with security tools including (not limited to): Anti-Malware and Endpoint Detection Response (CrowdStrike)\nNetworking Security (Firewalls, NAC, Zero Trust, etc.) \nLogging and Aggregation tools \nDeception technologies \nVulnerability scanning (Wiz, Tenable)\nPrivileged Access Management- Privileged Session Management (PAM-PSM) (BeyondTrust EPM/PSM)\nData Loss prevention tools (DLP) (Microsoft Information Purview, Cososys, Zscaler, O365)\nData Governance solutions (BigID)ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.At ServiceNow, we lead with flexibility and trust in our distributed world of work. Click here to learn about our work personas: flexible, remote and required-in-office.If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at [email protected] for assistance.For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.Please Note: Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}