{
    "Job ID": "69869954",
    "Description": "Robert Bosch Engineering and Business Solutions Private Limited (RBEI), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.\n\nWith over 18000 associates, RBEI is the largest software development center of Bosch outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence in US, Europe and the Asia Pacific region. RBEI is ISO 9001:2008 certified (2012), appraised at CMMI-L5 as per version 1.3 (2011), ASPICE - level3 based on version 2.5 and ISO 15504- 5 and 7, and also ISO 27001 with seven state-of-the-art facilities spread across Bangalore and Coimbatore in India, Ho Chi Minh City in Vietnam and Guadalajara in Mexico, ISO/IEC 20000-1:2011 certified (2014).\n\nWe nurture, build and sustain enduring customer relationships to enable direct operational and strategic benefits to our customers. We make it happen through qualified, motivated and flexible professional associates, who uphold the heritage and values of Bosch - time-tested over 125 years of a successful journey; a journey marked by quality, reliability and innovation of service to enhance the interest of our customers and the community we live in.\n\nWe provide solutions for businesses in primarily three areas:\n\n•Engineering Services\n•IT services\n•Business services\n\nOur focal industries:\n\n•Automotive industry\n•Industrial Technology\n•Consumer Goods and Building TechnologyWe develop Bosch Perfectly Keyless – a Smart Vehicle Access System that enables a precise wireless device localization and a secure key management, in order to offer vehicle drivers greater convenience and flexibility when accessing and using their cars.\nThe core features include Key Management, Passive Entry/Start, Remote Commands, Welcome Lighting, and more - all controlled by a digital key on a cell phone.\nIn addition, thanks to the new ultra-wideband (UWB) radio technology, new exciting functions are possible for the next generation.Your tasks as System Engineer include:Taking responsibility for delivery of the System Engineering Work Packages across the System Development Lifecycle for agreed Customer Change Requests and Product features, including:\nAnalysis, Classification, and Technical Acceptance Review of Stakeholder/Customer requirements.\nEnsuring the fulfillment of all Development Process and Quality targets, and Legal, Safety, and Security Requirements according to agreed project milestones.\nActive customer interaction, including requirements clarification and presentations.\nDevelopment of System Requirements according to top-down requirements and bottom-up constraints\nContribution to System functional modelling and System component design according to MBSE in collaboration with Architects.\nLeading the SysFMEA process for the technical scope within your responsibility, with moderation support.\nLeading the root cause analysis and problem-solving process for product issues and customer questions\nFurthermore, you support the Software and Hardware development, as well as the Validation teams for the deployment of your topics of responsibility.\nTogether with Project Managers, you use your expertise and experience to plan the development steps according to project milestones.\nWith customers, you present technical concepts and clarify and discuss product requirements.Education: Btech/Mtech in electronics,electrical engineering, automotive engineering or comparable studies\nPersonality and working style: independent, proactive and systematic working style, team player and responsible, flexible, very good presentation skills\nExperience and know-how:\nexperience in System Engineering, and the development lifecycle of an Automotive ECU,\nknowledge of methods and tools such as DOORS, ALM, IBM Rhapsody,\ninitial experience in model-based system development (MBSE) is an advantage,\nfurther knowledge of Keyless Access Systems and/or Car Connectivity Consortium (CCC) standards is an advantage\nLanguages: very good knowledge of English, both written and spokenexperience level 6+ yearsEnd-to-End Knowledge in Automotive domainHigh functional understanding, structured working methodVery good communication skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}