{
    "Job ID": "69866845",
    "Description": "IntroductionYour Role and ResponsibilitiesAs Subject Matter Expert (SME) – Order to Cash (O2C), you are responsible for processing Accounts Receivable – posting and balancing of daily cash applications, preparing journal entries, filing of records, general account reconciliations.If you thrive in a dynamic, collaborative workplace, IBM provides an environment where you will be challenged and inspired every single day. And if you relish the freedom to bring creative, thoughtful solutions to the table, there’s no limit to what you can accomplish here.ResponsibilitiesAnalysis of receivable accounts, investigation of entries, and pulling audit prep work.\nInvolve in netting instructions, direct Debit run, rejection of Direct Debit and Oracle updating.\nInvestigate unapplied payments, rectify and ensure proper allocation.\nProvide information relating to customer payments, refunds and other miscellaneous accounts receivables questions\nEnsure that client Service Level Agreements (SLA) and timelines are metRequired Technical and Professional ExpertiseMinimum of 4-6 years of Experience in Order to Cash (O2C) basic accounting knowledge and understanding of various accounting principles.\nExperience in participating and collaborating in team meetings to gather/share information\nAbility to achieve individual and Business metrics\nDemonstrated experience in meeting all baseline and project goals for accuracy and timeliness.\nHands-on expertise to increase cash application automation, increase touchless cash settlement, and reduce cash application complexity and instability across accounts assigned.\nPrior experience in monitoring customer account statuses and results regarding cash application against defined critical metrics, goals and objectives.\nProven experience to build and utilize reports to analyze pertinent account information.\nExperience in collaboration and negotiation with customers, sales field, and finance functions to achieve improvements.\nWorking knowledge to identify and implement action plans and process improvements with mentorship.Preferred Technical and Professional ExpertiseProficient in MS office applications and any ERP software as end user\nAmbitious individual who can work under their own direction towards agreed targets/goals.\nProven change management and be open to it good time management and work under tight deadlines\nProven interpersonal skills while contributing to team effort by accomplishing related results as needed\nMaintain technical knowledge by attending educational workshops, reviewing publications.We wish you great success in your career and encourage you to bring your best self to work with IBM.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}