{
    "Job ID": "69869697",
    "Description": "Company:Job Area:General Summary:Audio Systems team is looking for a research engineer with a passion for designing signal processing algorithms for Speaker Amplifier. You will be working with a team of HW Systems and Audio Systems experts to develop advanced technology and solutions for mobile phones, Compute, XR, and variety of IoT devices. Members of our team enjoy the opportunity to participate in cutting edge research while simultaneously contributing technology that will be published in patents/papers and deployed worldwide in our industry-leading devices. The team works with algorithm, hardware and software engineers across the company to develop, port newly designed solutions to real live prototypes shown at tradeshows and support commercialization on snapdragon products.Responsibilities:•  Design and develop innovative signal processing algorithms for Speaker Amplifier•  Develop algorithms for Speaker Protection, excursion control and thermal protection and implement in latest reference designs in collaboration with software/system engineers•Support end-to-end HW-SW system design, development, prototyping, performance validation and commercialization of new features/technologies that meet performance, power, robustness and stability metrics on Qualcomm platforms•  After successful demos to technical and business audiences, work with commercialization teams to enable developed solutions onto Snapdragon platforms and customer devices•  All Qualcomm employees are expected to actively support diversity on their teams, and in the Company.•  Proven ability to work in a dynamic, multi-tasked environment•  Self-starter who likes to be challenged and solve tough complex problems•  Excellent verbal and written communication and presentation skills.•  Quick learner, self-motivated, able to work independently and a Team player.•  Aspiration for excellence.•  Working in cross disciplinary, geographically-dispersed teamsMinimum Qualifications•  R&D experience developing Audio solutions for Speaker Amplifier•  Understanding of speaker characteristics and speaker parameters•Experience working with Speaker Amplifiers, Speaker Modelling and electro mechanical understanding•Strong programming skills in Matlab, C/C++, PythonPreferred Qualifications• Solid background in extroacoustic design of speakers, developingSpeaker Protection Algorithms•  Proficiency in designing, prototyping and implementing Audio solutions E2E such as Speaker protection, limiter, linearization, excursion and thermal control•  Willingness to engage in hands-on R&D in signal processing, machine learning and Speaker processing•Experience using Audio Precision, Klipple equipment for measureming Speaker KPIsEducation Requirements Required: Master's degree in Electrical, Electronics, Computer Engineering or related fieldTargetted Companies:Texas Instruments, Analog devices, Cirrus Logic, Maxim, Samsung, Intel, NXPMinimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}