{
    "Job ID": "69866711",
    "Description": "SummaryTo provide various project management functions across the development of generation projects and support the Director – Generation with the successful delivery of generation projects.Bring your experience across general and stakeholder management, risk, finance, technical, and commercial exposure to aid the efficient development and execution of projects.Key Accountabilities and ResponsibilitiesStrategy Development and Planning  Coordinate numerous stakeholders required to develop a generation project including Urban Planning, Environment, Procurement, and Hydrogen as well as external interfaces such as the Ministry of Energy (MoE), Saudi Electricity Company (SEC), Aramco, and a range of EPCs, suppliers, and consultants.\nSupport the development of generation proposals and the creation of the materials necessary to obtain senior management endorsement and approval.\nParticipate in the procurement and project management of consultancy agreements, equipment acquisition, EPC contracts, and the delivery of early works associated with the delivery of generation projects.\nCoordinate of the land acquisition, permitting, and environmental approval processes within NEOM and other relevant governing bodies as well as supporting the fuel acquisition and allocation from the MoE.\nSupport the acquisition of appropriate Generation License(s) and connection approval from SEC with the responsible ENOWA stakeholders.\nDevelop logistics strategies/plans/infrastructure for the delivery of Generation projects.\nWork across various generation sectors including thermal, off-grid (captive), wind, solar PV, and geothermal.\nMulti-disciplined thinking and approach to deal with all facets of project development from conception to financial close\nPlan, monitor, and engage with SEC group on critical interfaces with the temporary (off-grid) generation assets as well as Duba Green Power Plant plans.\nSupport the development of wind and solar PV plants outside of NEOM and the offshore wind due diligenceBudgeting and Financial Performance           Coordinate inputs to ENOWA business planning processes including project cost forecasts\nInput fuel scenario assumptions into the levelized cost of power\nSupport in budgeting for capex and opex.Procurement/Sales Management and Planning   Develop Scope of Work (SoW) and associated documentation required for the procurement of equipment, consultancy services, and construction required for Generation projectsContract and Assets Management     Manage consultancy and equipment supply agreements\nManage early civil works contractsRisk Management       Support the development of a risk register setting out risks to the successful delivery of generation projects\nLead initiatives on an ad-hoc basis to manage and mitigate project delivery riskPeople Management   Provide guidance and coaching to colleagues on best practices in development, business management, stakeholder engagement, and ENOWA processesBackground, SkillsMinimum of 5 plus years of relevant experience in utility, national or global utilities or energy industry working at manager level\nGood knowledge of interface and stakeholder management\nResilience to manage uncertainty and to respond appropriately in unplanned and unforeseen circumstances.\nHighly collaborative, open mindset and promoting the highest standards of conduct, integrity, and probity\nGood commercial and negotiation skills\nAbility to collaborate and communicate across teams.\nAbility to develop trust and use logic, reasoning, and negotiation strategies to gain commitment with internal stakeholdersQualificationsBachelor’s Degree in Engineering/Finance/Economics/BusinessJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}