{"Job ID": "69867101", "Description": "The CompanyEgon ZehnderEgon Zehnder (www.egonzehnder.com) is trusted advisor to many of the world’s most respected organizations and a leading Executive Search firm, with more than 400 consultants and 69 offices in 41 countries spanning Europe, the Americas, Asia Pacific, the Middle East and Africa. Our clients range from the largest corporations to emerging growth companies, government and regulatory bodies, and major educational and cultural institutions. The firm is a private partnership which allows us to operate independent of any outside interests. As a result of this unique culture, Egon Zehnder has the highest professional staff retention rate for a global firm in our profession. We have a blue-chip client base across all industries and operate at the Board and senior management level.Knowledge Centre India (KCI)Established in 2004, KCI is wholly owned subsidiary of Egon Zehnder based out of Gurgaon. The teams here work in close collaboration with the Global offices of Egon Zehnder. There are 5 teams that make up KCI: Experts, Research Operations, Visual Solutions, Projects/CV Capture and Global Technology Services. With team strength of 500+, KCI supports the global operations of EZ through research services, IT services and documentation. KCI has a team of 80+ Researchers who provide research support and knowledge management services to EZ’s Offices and Practice Groups.Your Journey at Egon Zehnder Starts HereAt EZ, you have the opportunity to deliver digital transformation initiatives across the globe for the organization. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.”Who we are!We are part of Digital-IT team established 15 years ago in Gurgaon, India to provide technology support and rollout digital initiatives to 60 plus global offices. Digital IT has six key pillars – Collaboration Technology; Functional Technology; Digital Technology; Security & Architecture; Infrastructure & Services, Digital Success to support business and to take lead on digital transformation initiatives with the total strength of 150+ team members across the globe.The PositionSr. BI Developer will be responsible for architecting, implementing the secure and scalable BI system on cloud. They will be involved in analyzing, estimating and developing the changes received from business.ResponsibilitiesDesign and develop complex business intelligence analyses utilizing complex data from numerous sources.\nCollaborate with business, application development team to ensure smooth flow of data from different sources.Suggest and implement secure and scalable architecture.\nDevelopment of BI Solution with agreed architecture.\nWork in close collaboration with other members of the team and cross functionally with other analytics-centered teams.\nDevelop/Suggest and implement appropriate controls and quality assurance procedures.\nDoes Impact Analysis for enhancements and share estimates.Keep document updated.\nEnsure compliance with all regulations, policies, and procedures.\nEscalate issues/risks pro-actively to appropriate team members and management.\nRegularly communicate status and challenges to team members and management.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}