{"Job ID": "69867163", "Description": "About Us:We are a luxury jewelry global powerhouse, with over 120 years of legacy and 3 design studios catering to retailers globally, along with building human-centric brands Her Story and Unsaid for consumers. Our aim is to make jewelry more relevant to the evolving new customer, with superior craftsmanship and stories told in design. We do this with a deep knowledge of our consumers, centering everything we do, from in-sighting to creation, around them. Helping create new desires in the world of jewelry.At Walking Tree, we are a team of inspired professionals who mine insights and build on unique and innovative ideas together, to form a disruptive and forward-thinking jewelry powerhouse.For us, our people come first. We are sensitive to the needs of those who make us who we are. We aspire to create simply joyful workspaces that inspire creativity and collaboration. Pooling from our years of expertise and a core value system in place, we ensure that every Walking Tree workspace is infused with infectious energy, resulting in a buzzing creative flow.Browse through below website link to know more about us:https://walkingtree.co/https://herstoryjewels.com/https://unsaid.com/Designation: Content WriterCompany: Walking Tree Ventures Pvt LtdYears of Experience Required: 4+ yearsRole Summary:We are seeking a talented Content Writer to join our team and curate engaging and impactful training material for our sales team specializing in luxury jewelry sales. The successful candidate will play a pivotal role in synthesizing information from design, production, and brand teams to create simplified and persuasive content to be integrated into product cards for both existing and new collections. Your words will be the bridge connecting our exquisite jewelry with the hearts of our valued customers.Responsibilities:- Collaborate with design, production, and brand teams to gather comprehensive information about our luxury jewelry collections, ensuring a deep understanding of each piece's unique features and selling points.- Transform complex technical and aesthetic details into simplified, clear, concise, and persuasive content suitable for product cards.- Craft compelling narratives that resonate with potential buyers, emphasizing the elegance, craftsmanship, and exclusivity of each jewelry piece.- Develop training material that equips the sales team with the knowledge and language to effectively communicate the value of our luxury jewelry to clients.- Collaborate with relevant teams to ensure accuracy and up-to-date information in all training materials.- Continuously refine and update training content to align with evolving collection offerings and market trends.- Maintain a consistent brand voice and style throughout all training materials.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}