{"Job ID": "69869113", "Description": "About UsAt Technip Energies, we believe in a better tomorrow and we believe we can make tomorrow better.  With approximately 15,000 talented women and men, we are a global and leading engineering and technology company, with a clear vision to accelerate the energy transition.  Designing and delivering added value energy solutions is what we do.  If you share our determination to drive the transition to a low-carbon future, then this could be the job for you.  We are currently seeking an Information Management Lead to join our team based in Chennai, India.About the JobDuties and ResponsibilitiesBe the single point of Contact on all topics related to Information Management on the Project and interact with Project, Partners, and Client.\nDevelop and maintain the project Information Management strategy and the Information management plan, according to Technip Energies standards and Construction and client requirements (data structuration, data workflows, data collection, control, consolidation and handover) in coordination with Partners if any.\nClarify with Client the equipment and material identification and numbering Procedure and the requirement in terms of data handover.\nPrepare and Issue deliverables related to data management (Information Management Plan, Data Control Procedure, Suppliers Data Requirements Specification).\nParticipate to the setup of the Engineering Data Warehouse with Methods and Tools team and support the engineering disciplines in using the various modules.\nCreate and maintain a Master Tag Register listing the various components of the project and their related attributes: identify source of tags and set up work processes for data collection and control, with the related KPIs (conformity, consistency, completeness).\nEnsure that Information Management requirements are included in the requisitions issued to Suppliers during inquiries.\nEnsure that these requirements are understood and met, in coordination with Requisition Leads.\nWork in coordination with engineering disciplines to ensure data validation before consolidation in the Engineering data warehouse.\nExtract from the Engineering Data Warehouse the various deliverables, including Partners and Suppliers data, to perform data handover to Construction and to Client.\nIssue regular reporting to Project Management and Client.We offer you not only a job, but an inspiring journey in a truly global environment where you team up to break down boundaries thanks to the innovation, creativity and pioneer spirit which drive our people. About YouWe’d love to hear from you if your profile meets the following essential requirements:Bachelors in Engineering with 9 – 12 Years of working experience in relevant roleInclusion StandardsIn our continuous journey to developing and building culture of inclusion, we adhere to four Inclusion Gold Standards. And you?-        We challenge our biases and embrace diversity of thought ;-        No one has all the knowledge and solutions, collectively we do ;-        We foster a caring environment where people are respected, comfortable to share and be heard ;-        We promote active listening for effective decision and action.What’s Next?Starting Date: ImmediateOnce receiving your system application, Recruiting Team will screen and match your skills, experience, and potential team fit against the role requirements.  We ask for your patience as the team completes the volume of applications with reasonable timeframe.  Check your application progress periodically via personal account from created candidate profile during your application. We invite you to get to know more about our company by visiting www.technipenergies.com and follow us on LinkedIn, Instagram, Facebook, Twitter, Youtube for company updates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}