{
    "Job ID": "69869114",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.Job Description:\nWe are seeking an energetic and practiced Project Management professional to lead a team of Project Leads responsible for orchestrating and governing multiple complex sourcing/resourcing projects. In this critical role, you will play a key part in collaborating with suppliers, the purchasing team and global stakeholders to ensure the successful execution of these projects. Key strengths required include exceptional project management skills, the ability to drive timelines, and a talent for fostering effective cross-functional partnerships.Responsibilities:\n1. Leadership and Team Management:\nLead, mentor, and inspire a team of Project Leads responsible for overseeing complex resourcing projects. Provide strategic direction, guidance, and performance feedback to ensure the team achieves project goals and professional growth.2. Cross-Functional Collaboration:\nCollaborate closely with suppliers, the purchasing team (Buyers and Supplier Development Engineers), Engineering and Operations to develop and execute project plans. Engage with global stakeholders to gather project requirements, align objectives, and maintain clear communication throughout the project lifecycle.3. Project Governance and Management:\nOversee the end-to-end project management process, ensuring effective planning, execution, monitoring, and control of resourcing projects.\nDrive project timelines, identify potential risks, and implement mitigation strategies to ensure on-time and on-budget delivery.4. Supplier Relationship Management:\nFoster strong partnerships with suppliers, utilizing effective negotiation and communication skills to ensure project success and adherence to quality standards.5. Resource Allocation and Optimization:\nAllocate project resources efficiently, ensuring the right mix of skills and expertise to maximize project outcomes and meet objectives.6. Continuous Improvement:\nIdentify opportunities for process optimization, standardization, and best practice implementation to enhance project efficiency and effectiveness.7. Performance Reporting and Analytics:\nDevelop and deliver regular performance reports to stakeholders, highlighting project progress, key milestones, and any potential challenges.Qualifications:\n- Bachelor's degree in Business, Engineering, Supply Chain Management, or a related field (Master's preferred).\n- Proven experience in project management, with a track record of successfully leading complex projects and teams.\n- Strong understanding of supplier relationship management, procurement processes, and supplier development.\n- Excellent communication and negotiation skills to effectively engage with cross-functional teams and external stakeholders.\n- Proficiency in project management tools and methodologies, with the ability to manage multiple projects simultaneously.\n- Analytical mindset, capable of identifying potential risks and devising effective mitigation strategies.\n- Leadership experience, including the ability to inspire and guide a team towards achieving project goals.\n- Results-oriented approach with a focus on driving timelines, meeting deadlines, and delivering high quality outcomes.Join our team and make a significant impact on our Sourcing projects by leading a team of dedicated Project Leads and collaborating across functions to drive successful project execution. If you're a strategic thinker with\na passion for project management and cross-functional collaboration, we encourage you to apply.Caterpillar is not currently hiring individuals for this position who now or in the future require sponsorship for employment visa status. Caterpillar offers many job opportunities outside of the U.S. which can be found through our employment website at  www.caterpillar.com/careers\n\nCaterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}