{
    "Job ID": "69869099",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.Job Description:\nWe are seeking a dynamic and experienced Purchasing professional to lead our efforts in identifying self-sufficient suppliers across various Segments within the Energy & Transportation Business (Fabrications / Tubes / Harnesses / Castings / Crankshafts / Connecting Rods / Radiators / Alternators /etc.). In this critical role, you will play a key part in evaluating suppliers and strategically support respective Category Teams to onboard capable partners to enhance our supply chain's capacity and reliability. This position requires a strong analytical mindset, excellent communication skills, and a deep understanding of supplier relationships.Responsibilities:\n1. Conduct Comprehensive Market Study:\nResearch, analyze and monitor the Asian market to identify potential self-sufficient suppliers for various categories within E&T Procurement. Evaluate market trends, competitor activity and emerging technologies to inform supplier selection.2. Supplier Evaluation and Selection:\nDevelop a rigorous evaluation process to assess potential suppliers based on quality, cost, capacity, financial stability and technical capabilities.\nCollaborate with cross-functional teams to define evaluation criteria and ensure alignment with organizational goals.3. Capacity Onboarding Strategy:\nConduct initial Capacity assessment and provide strategic roadmap for Category Teams to onboard new suppliers to increase our supply chain's capacity and reduce risk. Formulate a clear plan for transitioning production and establishing strong relationships with selected suppliers.4. Supplier Relationship Management:\nBuild and maintain strong partnerships with selected suppliers, fostering open communication and collaboration.5. Team Leadership:\nManage a team of Category Buyers responsible new supplier identification and for specific E&T categories. Provide guidance, coaching and mentorship to the team, ensuring their professional growth and development.\nCollaborate with team members to align their efforts with the overall supplier evaluation and onboarding strategy.6. Continuous Improvement:\nIdentify opportunities to optimize supplier relationships and drive process improvements within the procurement function. Stay informed about industry best practices and trends to enhance the efficiency and effectiveness of the procurement process.Qualifications:\n- Bachelor's degree in Business, Supply Chain Management, Engineering, or a related field (Master's preferred).\n- 6 Sigma Black Belt experience would be preferred.\n- Proven experience in procurement, supplier management or strategic sourcing, with a focus on evaluating and selection of suppliers.\n- Strong analytical skills, including market research, data analysis and financial evaluation.\n- Excellent negotiation and communication skills, with the ability to build and maintain effective supplier relationships.\n- Knowledge of Engine Categories, manufacturing processes and supply chain dynamics.\n- Ability to work collaboratively across Global cross-functional teams and drive results in a fast-paced environment.\n- Strong project management skills and attention to detail.Join our team and play a pivotal role in shaping our Purchasing footprint in Asia by identifying and onboarding self-sufficient suppliers to meet our growing capacity needs. If you're a strategic thinker with a passion for supplier relationship management and team leadership, we'd love to hear from you.This job is open to applications who are eligible to work in India. No visa sponsorship is available for this role.Caterpillar is not currently hiring individuals for this position who now or in the future require sponsorship for employment visa status. Caterpillar offers many job opportunities which can be found through our employment website at  www.caterpillar.com/careers\n\nCaterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}