{"Job ID": "69869943", "Description": "How will you CONTRIBUTE and GROW?Key Responsibilities:Safety/ Security:   Participate in safety tools implementation as per plan prepared by HSE\n\nPrepare report on incidents, near-miss incidents, \n\nAction plan completion and share with Core Team HSE \n\nAdhere to AL safety guidelines\n\nEnsure Zero LTA IMS:Prepare & Maintain documents – SOPs, checklists, WI, PM schedule, SPM, IMS documentsReliability/ Maintenance:Follow preventive maintenance schedule as defined in CIS, equipment maintenance requirement, statutory requirements.                                            \n\nMaintaining safety & reliability of the plant and minimizing downtime\n\nImplement the scheduled maintenance plan, under guidance of Core Team & CRT\n\nConduct daily/routine plant inspection \n\nTroubleshooting of technical issues through TELEFLO with help of PIC/MIC\n\nIdentify maintenance issues and conduct resolution \n\nPrepare report and timely sharing of reliability incidents \n\nIn case of complex issues, escalate to MIC/ PIC / Onsite Manager\n\nTrack timely implementation of maintenance activity. \n\nMonthly report on maintenance activities \n\nMaintain critical Spare parts in the plant. Manage inventory.Operations:Responsible for safe, reliable and efficient operation of the Onsite.\n\nPerform scheduled activities-produce as per production plan at best efficiency levels \n\nEnsure Daily production plan with Site team as per customer reqt. Report actual production levels of the prior day. \n\nOperate plant through telemetry system  (TELEFLO/LEXA) as per production plan (that is, conduct startup, stop, change load of plant in safe and reliable manner as per defined procedures).\n\nIn case of alarm/issues, conduct issue resolution; else escalate to Onsite Manager.\n\nCoordinate with Distribution/Logistics to procure LIN as required. \n\nHandover Operations to next shift\n\nParticipate in RCA incase of incidents, along with a designated team.\n\nEnsure Basic housekeeping of the Onsite.\n\nPerformance Reporting - DPR, customer related, incidents, logging in time\n\nCoordinate with the BD team and prepare customer invoices for daily & peak consumption.Team Management: Travel to other sites to assist/support/ backup/lead in Operations & Maintenance.\n\nReport & resolve issues in consultation with the Regional Operations Manager\n\nManage customer issues & Ensure minimal customer complaints\n\nSubmission of bills/ payment follow ups with customers\n\nManage Operators/technicians at site- work schedules, attendance records, work recordsProcurement: Timely Procurement of materials /services required for the plant in accordance with the procurement system.Follow up for material and close documentation loop for accounting and payments.\n\nLegal/ Compliance: Complete & Maintain all relevant compliances at site- eg: Rule 18, 19, CCoe, test & calibration reports, air/water analysis. Coordinate with customer for compliance completion where customer is connected Are you a MATCH?Desired Skill Sets:Diploma/ Degree in Instrumentation/ Electrical with 2-4 years of experience in Gas process industry in the field of operations and maintenance. Technical skills:Control System, PLC, SCADA, Field Instrumentation, electrical system (LT/HT), Compressor (Centrifugal/screw) Operation and Maintenance, Basic Computer - MS Excel/ Word\n\nSoft: Behavioral skills: Good work ethics, Customer Orientation, Process Orientation, Planning & Organizing Skills, Decision Making Skill, People ManagementAdditional information: Good verbal & written communication skills\n\nSelf motivated & High on energy\n\nAmbitious for personal growth\n\nMature enough to differentiate between aggression and follow up\n\nPunctual, committed and dedicated to selfOur Differences make our PerformanceAt Air Liquide, we are committed to build a diverse and inclusive workplace that embraces the diversity of our employees, our customers, patients, community stakeholders and cultures across the world.\nWe welcome and consider applications from all qualified applicants, regardless of their background. We strongly believe a diverse organization opens up opportunities for people to express their talent, both individually and collectively and it helps foster our ability to innovate by living our fundamentals, acting for our success and creating an engaging environment in a changing world.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}