{"Job ID": "69869093", "Description": "Job DescriptionResponsibilitiesPosition Summary \n \nThe SAP ABAP Developer analyzes user requirements, procedures, and problems to automate processes or to improve existing systems. Provides technical knowledge, system design techniques, methodologies, tools, and standards applied in the IT and business environment. As a key member of the SAP Core team, provide support to the business community for SAP in the ABAP Technical Development area.  This includes all new projects as well as production support across all functions within SAP. \nKey Duties and Responsibilities Applies company policies and procedures to resolve a variety of issues\nExercise judgment and independence in identifying next steps\nEngage with other project personnel to ensure business application systems are developed in a way that aligns with architectural standards and established methodologies and practices\nProvide programming knowledge, usually as a member of a project team, in the analysis, design, and development of SAP reports, interfaces, conversions, business forms, and user exits\nProvide estimates for the programming and unit testing activities of a project when needed\nWrite new and modify existing data sources, infosets and queries\nDevelop and support interfaces to numerous legacy and third-party systems using a variety of techniques such as LSMW, BAPI, IDOC, RFC calls, BDC, and call transaction update methods\nSAP ECC 4.7, 6.0 SAP ABAP on HANA Developer with practical experience using ABAP Development Tools (ADT) in HANA Studio/Eclipse.\nPerform program performance optimization and tuning where vital\nResearch and apply OSS notes\nFollow the IT SDLC process\nUtilization of debugging techniques\nWrite detailed user documentation of program functions\nCross team communication and teamwork\nSupervise and report to management on the status of project efforts, anticipating/identifying issues that inhibit the attainment of project goals and implementing corrective actions\nParticipate in off-hours meetingsRequirements (Must Have)Bachelor’s Degree in Computer Science, equivalent work experience acceptable\nGood interpersonal and excellent documentation skills are a must\nDemonstrable ability to be flexible and work hard, both independently and in a team environment, in a high stress environment with changing priorities\nPro-active, helpful, ‘can-do’ demeanor\nAbility to explain and champion technical concepts to a broad audience\nKnowledge of creating and maintaining detailed project plans using Microsoft products\nExcellent customer service skills required\nStrong analytical skills required, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements\nExcellent verbal and written communication skills in English and the ability to communicate effectively professionally with a diverse group, executives, managers, and domain experts\nSelf-managing and self-motivating; able to meet customer deadlines and expectationsSoftware requirements 3 to 6 years SAP ABAP development experience \nDemonstrated proficiency in the use of ABAP  \nProven ability using BADI’s, BAPI’s, LSMW, ALE, RFC calls, IDOC, BDC, business objects, classes and methods, Adobe Forms, Smartforms, SAPScripts, Data Dictionary, ALV\nExperience with implicit and explicit improvements, screen exits, and menu exits\nABAP debugging skills\nExperience in several of the following modules: SD/SM, FI/CO, MM/PP, QMRequirements (Desired)Relevant technical certificates a plus\nCompleted at least 1 full cycle implementation\nKnowledge of SAP HANA Technical Concept and Architecture,\nStrong implementation knowledge on Native SQL, ADBC, External View, ABAP Core data Services, AMDP Procedures, Text Search, ALV on HANA.\nPractical experience in creating custom and enhance standard CDS view and AMDP class based on business requirement.\nPractical experience of implementing various available annotation in CDS.\nStrong Practical Knowledge of Code Performance Rules and Guidelines for SAP HANA\nStrong implementation knowledge of OData using CDS and AMDP\nWorkflow experience, including support and debugging\nKnowledge of NetWeaver 7.0 experience is helpful\nKnowledge of BI is helpful\nExperience with other programming languages, such as Java, XML, is helpful Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}