{"Job ID": "69867634", "Description": "Teller-(2300016012)Job:Retail BankingPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 4:16:07 AMUnposting Date:30/Sep/2023, 10:59:00 PMThe Role ResponsibilitiesJob RoleDeliver quality service while carrying out the following transactions for customers\nCash deposits\nCash withdrawals\nDemand draft / pay order instructions - accepting and processing\nAccepting instructions for FD breaks\nEffecting internal account to account transfers\nAccepting and processing stop payment instructions\nEnsure that all of the above services are delivered with accuracy and warmth.\nAssist in Service Delivery by ensuring timely service to customers so customer traffic is efficiently managed. Recommend workflow changes for customer service with greater efficiency and effectiveness.BusinessSales Referrals - where relevant, identify prospects for cross-selling from observation of customer transactions and highlight the same to sales staff.ProcessesGeneral Reconciliation and Compliance Activities at their level, which may typically include\nDual control of Cash functions\nControl of Security stationary\nReview of processing entries and vouchersPeople and TalentBanking knowledge\nUnderstanding of front and back office processes and procedures\nGood Interpersonal skills\nStrong Communication skills\nTeam-playing ability\nCustomer and Service Orientation Risk ManagementHe / She is aware of bank’s Mis-selling and Sales Policies and ensure adherence all the times.\nEducating customers about direct banking channels so specific transactions can be migrated to net banking, phone banking, ATMs, etc. \nEnsure candidate is fully aware of all the policies and procedures issued in relation to ORMA, Group Code of Conduct, Know Your Customer and Money laundering prevention. Candidate must ensure compliance with these policies and procedures on an ongoing basis. Any suspicious transaction must immediately be reported to the supervising officer.\nPremises management in areas of merchandising, housekeeping as well as store management As an employee, you are responsible for working with the Bank to ensure a safe and healthy workplace for all. As part of the Health and Safety guidelines you should:\nTake reasonable care for the health and safety of co-workers and those who may be affected by your actions or your omissions\nCo-operate with Management to support and promote Health and safety in the workplace\nEnsure that your actions do not put others at risk\nWork in a healthy and safe manner\nEncourage others to work in a healthy and safe manner\nReport all accidents and incidents; and Bring to the attention of the management any hazard in the workplaceRegulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Our Ideal CandidateGraduate / Post Graduate\nAnywhere between 1 - 4 years of overall experience Role Specific Technical CompetenciesService excellence\nAccurate and Error free processing\nDOI and Audit parameters\nProduct knowledge­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not sJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}