{"Job ID": "69868179", "Description": "Profile : Data Science Project Engineer Roles and Responsibility                           Create a Data Analysis system reposotiory for HUB APMEA PT for various projects and utilize it for business case analysis as well as KPIs. Automate the KPIs /metrics and analyze data to provide insights in improving the business. Create reports to show standardization results in designs, and implementation results for various development projects. Analyze test vs calculated performance data provided by existing data warehouse tools or create new tools/reports to provide insights and also help reduce test failures. Automate the repeat data analysis often done in excel and local queries so we support the business long term and preserve knowledge.   Analyze Margin and Schedule Slippage and provide data regarding trends and projections Identify cost saving ideas from data analysis. Developing logics & programming in BOM transformation rule engine. Supporting implementation for cPLM/Windchill. Coordinate tasks/activities within a worldwide factories network. Staff with the Global Engineering Center Team: You will be part of a Global Engineering Center team and your task is to contribute to the global design work with positive team atmosphere and networking. Place of Work:             Global Engineering Center Office, Vadodara, India Qualification, Skill and Experience Graduate in Mechanical or Electrical Engineering having 2-7 years of experience Experience with Microsoft SQL Mandatory. Experience with Power BI Mandatory. Experience with SAP skill a plus Experience with SQL Reports a plus. Experience performing Data analysis a plus. Experience in cPLM/Windchill will have added advantage. Knowledge of programming languages like Python, VB, C sharp will have added advantage Transformer experience preferred but not mandatory. Good English written and spoken skills Personal Characteristics Good verbal and written English is must Well Organised and attention to details with quality work. A team player, good communication skills and willingness to contribute to team discussions. Ability to work without supervision when required. Quick learner with ability to master new areas of functional skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}