{"Job ID": "69860906", "Description": "Job BriefWe are seeking a corporate lawyer preferably with experience of 3-4 years experienced in an international and local business environment, ideally with experiences gained at multi-national organizations, most preferably in information technology-related domains.VentureDive OverviewFounded in 2012 by veteran technology entrepreneurs from MIT and Stanford, VentureDive is the fastest growing technology company in the region that develops and invests in products and solutions that simplify and improve lives of people worldwide. We aspire to create a technology organization and an entrepreneurial ecosystem in the region that are recognized as second to none in the world.Key ResponsibilitiesYou will be heading the legal department at VentureDive and accordingly may be expected to perform the following tasks:\nAdvising on a variety of legal issues and legal risks;\nDrafting, reviewing, editing, interpreting, and advising on contracts and other legal documents;\nReviewing and providing legal advice on MOUs, Contracts, and tender documents;\nDevelopment of contract templates, reusable language clauses, and forms;\nIdentifying legal and business risks in agreements; verifying that business objectives are accomplished; project managing negotiations; tracking and meeting deadlines, coordinating the input and approval of various stakeholders; providing reports of activities and progress; and training personnel on contracts principles, strategies, and processes;\nWorking with the key stakeholders and liaising with the relevant departments to ensure that where legal risks have been identified, appropriate courses of action have been taken;\nWorking with and managing the relationship with the external counsel; Appear, where required, in the appropriate forums, tribunals, courts, etc. to represent the company;\nProviding legal protection and risk management advice to management especially on contract management;\nReviewing and drafting contracts, agreements and internal policies and ensure that they are in compliance with all statutory or legal requirements in the countries where we work;\nAs needed, providing guidance on contract matters to project managers or other operational staff;\nDevelop understanding of company policies and procedures relating to contract management, governance, due diligence etc. of the company and its subsidiaries as well as the various online tools and portals used by the legal department;\nProviding legal advice over all aspects pertaining to any new strategic initiatives and ventures including investments, new business lines etc.;\nAssisting in streamlining processes and procedures pertaining to key risk areas such as data protection, anti-bribery and anti-corruption etc.;\nProviding opinions and legal advice to personnel at all levels of the business on existing and new commercial arrangements.Required Qualifications and ExperienceLaw degree with up to 3-4 years of experience working at a leading law firm or a company’s in- house legal department.\nExposure and experience with local/Pakistani and international laws is very important for the role. \nCandidates with corporate law experience involving Mergers &amp; Acquisitions, Intellectual\nProperty and/or Software, or experience at Telcos, and exposure around international law areas involving data protection etc, shall be preferred.\nCandidates who are lifelong learners, who stay abreast of evolving local and international laws,shall distinguish themselves.\nA conscientious, self-driven professional is sought, who would work per business deadlines, and be able to juggle multiple and evolving priorities well.\nImmaculate written and verbal communication skills.What we look for beyond required skillsIn order to thrive at VentureDive, you…are intellectually smart and curious…have the passion for and take pride in your work…deeply believe in VentureDive’s mission, vision, and values…have a no-frills attitude…are a collaborative team player…are ethical and honestAre you ready to put your ideas into products and solutions that will be used by millions?You will find VentureDive to be a quick pace, high standards, fun and a rewarding place to work at. Not only will your work reach millions of users world-wide, you will also be rewarded with competitive salaries and benefits. If you think you have what it takes to be a VenDian, come join us ... we're having a ball!  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}