{
    "Job ID": "69866194",
    "Description": "SUMMARY OF THE ROLEResponsibilities:Introduce, promote, and sell Decorative products to allocated customers and geographical territories through regular visits to maintain good relationships and obtain market information.\n\nPromote decorative products by coordinating marketing activities and campaigns to achieve sales budget.\n\nExecute sales policies and marketing activities in line with company rules and regulations to support business growth, uniformity, and business efficacy.\n\nHave a robust follow-up on collection per assigned targets to ensure that company working capital conditions remain healthy.\n\nMaintain good relationships, provide high-quality service to existing distributors, and attend to customers’ complaints.\n\nCreate and maintain data and be an active user of CRM\n\nCoordinate with relevant departments to ensure timely delivery and good customer service\n\nLiaise with the client market and respond to inquiries, introducing products and services to dealers/projects\n\nUndertake and regularly update area audits to identify market potential within own designated geographical area together with SupervisorWHAT WE ARE LOOKING FOR AND WHAT WE OFFERWHAT WE ARE LOOKING FOR- Engineer / Sales University Degree.- Minimum 5 years of Sales experience.- Relevant experience in Construction field.- Strong interpersonal, communication skills- Flexibility to travel in county.PERSONAL QUALITIESEffective communication: communicates in a clear, precise and structured way; speaks with authority and conviction; presents effectively.Execution: adheres to company rules and procedures; executes plans with commitment and determination; achieves high quality results.Business Development: identifies and seizes commercial opportunities; has a strong positive impact on business growth and profitability.Influence makes: an impact; convinces and persuades others; promotes plans and ideas successfully.WHAT WE OFFERWe offer an extensive opportunity for professional and personal development.A friendly and supportive working environment.An international Corporate Culture founded on our four core values: Care, Respect, Loyalty, and Boldness.A work environment that embraces Diversity and is committed to creating an equal opportunity and inclusive environment for everyone.POSITION INFORMATIONCompany:Contract Type:Time Type:CLOSING DATE (dd.mm.yyyy):WHO WE AREVisit our Career Page to know more about life at Jotun.Jotun’s company culture welcomes and values differences in people. Our more than 10,200 employees on all continents represent 90 nationalities, four generations and diversity of professions, gender, abilities, ethnicities, beliefs, cultures etc. We are committed to represent the societies we operate in, promoting equality, equity and zero-tolerance for discrimination.If you are applying to a position and require any additional support in the interview process, please let us know how we can accommodate this.  If you think that this role is what you could be doing next, apply now!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Algeria",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}