{"Job ID": "69866736", "Description": "Job title: Manager : State ReportingHiring Manager: Team Lead Commercial Analytics\nLocation: Hyderabad/Mumbai\n% of travel expected: Travel required as per business need, if any\nJob type: Permanent and Full timeAbout the jobOur Team:Sanofi Global Hub (SGH) is an internal Sanofi resource organization based in India and is setup to centralize processes and activities to support Specialty Care, Vaccines, General Medicines, CHC, CMO, and R&D, Data & Digital functions. SGH strives to be a strategic and functional partner for tactical deliveries to Medical, HEVA, and Commercial organizations in Sanofi, Globally.Main responsibilities:The overall purpose and main responsibilities are listed below:Collaborate across and lead multiple functional teams including SGR, Legal, E&BI, and all Sanofi US Business Units to support execution of operational/submission plan using project management skills to track all deliverables to ensure alignment with deadlines.\nManage and ensure completion of routine state submissions according to state defined requirements and timelines.\nAssess laws and support development of standards and processes to drive delivery of requirements. Manage the creation\\authoring of relevant Business Rules and other guidance/process documents in collaboration with Legal, US Transparency, E&BI and other teams as required.\nImplement training, change management, and process improvement plans to drive stakeholder compliance.\nCreate clear, concise communications that are relevant and appropriate for target audiences. Ensure that direction and guidance can be operationalized by recipient team.\nMaintain intranet web page and SharePoint with links to relevant documents, as well as repository/database to store and maintain relevant data and documentation.\nMaintain industry knowledge to anticipate and impacts from new laws. Stay current on evolving trends within the state law implementation process and Sanofi reporting to support alignment with all regulations.\nSupport continuous improvement activities to ensure operational excellence for deliverable tracking, compliance, and reportingPeople:\nMaintain effective relationship with the end stakeholders within the allocated GBU and tasks – with an end objective to develop education and communication content as per requirement\nActively lead and develop SGH operations associates and ensure new technologies are leveraged\nInitiate the contracting process and related documents within defined timelines; and\nCollaborate with global stakeholders for project planning and setting up the timelines and maintaining budget\nPerformance:\nRefresh Existing Reports and identifies improvement opportunities in reporting and BI tools and as needed structure / functionality with the latest insights as they become available\nCreate dashboards to synthesize and visualize key information and enable business decisions\nWorks to develop deal tracking analytics and reporting capabilities\nCollaborates with Digital to enhance data access across various sources, develop tools, technology, and process to constantly improve quality and productivity\nProcess:\nSupport delivery of projects in terms of resourcing, coordination, quality, timeliness, efficiency, and high technical standards for deliveries made by the medical/ field writing group, including scientific documents and clinical/medical reports\nContribute to overall quality enhancement by ensuring high scientific standards for the output produced by the medical/ field writing group; and\nSecure adherence to compliance procedures and internal/operational risk controls in accordance with all applicable standards\nRefresh report on frequency/cycle basis (weekly/monthly/quarterly/annually), along with QC checks for each refresh\nStakeholder: Work closely with global teams and/ external vendors to ensure the end-to-end effective project delivery of the designated publication/medical education deliverablesAbout youExperience:\n7+ years of experience in pharmaceutical industry. Experience with US government regulations and understands legal, regulatory and compliance risk.\nSoft skills: Strong learning agility; Ability to manage ambiguous environments, and to adapt to changing needs of the business; Good interpersonal and communication skills; strong presentation skills a must; Team player who is curious, dynamic, result oriented and can work collaboratively; Ability to think strategically in an ambiguous environment; Ability to operate effectively in an international matrix environment, with ability to work across time zones; Demonstrated leadership and management in driving innovation and automation leveraging advanced statistical and analytical techniques\nTechnical skills:\nBachelor’s degree from an accredited four-year college or university.\nAt least 7+ years direct experience with pharmaceutical industry.\nExperience with government regulations preferred\nExperience with understanding legal, regulatory or compliance risk.\nMS Excel expert level expertise.\nAbility to forge and maintain cross-functional relationships.\nAbility to work independently to drive problem solving and process improvement\nAbility to collaborate effectively and work across multiple areas, when members of the work team are not direct reports\nComfortable and capable in front of any group and discuss or present the project\nAbility to think strategically and provide insights on opportunities and impacts for the business\nAbility to produce relevant analytics from large datasets independently, in visually clear formats that are validated and quality checked before submitting to supervisor\nPrioritizes tasks by due date and mission criticality.\nDetail-oriented (demonstrates attention to detail) & organized with updating & saving work instructions and file version control.\nActively listens & follows direction as explained to meet expectations.\nPossesses confidence to ask questions & assess risk.\nAccepts constructive feedback & integrates feedback on an ongoing basis moving forward.\nAbility to solve complex issues that may involve several stakeholders.\nAbility to think outside-of-the-box (i.e. success and comfort working in the 'grey' vs 'black-&-white' tasks)\nProactively seeks new tasks & ensures regular touchpoints with task lead (take action), rather than wait for tasks to be assigned\nDemonstrates continuous improvement mindset.\nAutomation experience\nExperience with project accountability & management to ensure defined deliverables are achieved\nInfluence without authority\nAbility to identify risk and know when to escalate to leadership.\nSystem enhancement testing\nEducation: Advanced degree in areas such as Management/Statistics/Decision Sciences/Engineering/Life Sciences/ Business Analytics or related field (e.g., PhD / MBA / Masters)\nLanguages: Excellent knowledge in English and strong communication skills – written and spokenPursue progress, discover extraordinaryBetter is out there. Better medications, better outcomes, better science. But progress doesn’t happen without people – people from different backgrounds, in different locations, doing different roles, all united by one thing: a desire to make miracles happen. So, let’s be those people.At Sanofi, we provide equal opportunities to all regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.Watch our ALL IN video and check out our Diversity Equity and Inclusion actions at sanofi.com!At Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}