{"Job ID": "69865520", "Description": "This role is for a Subject Matter Expert related to corporate regulatory requirements that include Enterprise Risk Management, Data Protection and Environmental Management as a minimum. The role works with and closely supports the Standards & Compliance manager to create relevant internal processes and drive understanding and compliance to corporate regulations.Key accountabilities include:·Coordinating and Maintaining the Enterprise Risk Register for Ground Services ensuring the full and complete internal Enterprise Risk Management process is met with set deadlines.·Support the Standards & Compliance manager in identifying critical and common enterprise risks, review control effectiveness, root causes and consequences, propose control measures and track, manage ground services enterprise risks.·Assess the existing business processes for the department and highlight gaps, areas of improvement and develop processes if required to drive corporate regulatory compliance within the business.·Facilitate and track Data Protection Impact Assessments for existing or new processes to be established within Ground Services.·Maintain the Record of Processing Activities for Ground Services division as per the applicable data protection regulations.·Maintain the Environmental Management process defined for Ground Services which includes coordination with all stakeholders within ground services for conducting environmental aspects and impact assessments and meeting the set deadlines.·Consistent checks on updates related to internal/external publication/regulation, prepare and issue bulletins where applicable in consultation with the Standards and Compliance Manager·Responsible  for  issuing,   updating  and  keeping  track  of document  versions  of TYPE  3 documentation.·Maintaining records of changes in standards and compliance related regulatory requirements, issue bulletins and other related documents.·Coordinate with internal and external stakeholders for standards and compliance relevant system enhancements.·Publish respective Quick Reference Guides, Briefing sheets and any other required documents to drive compliance.  ·Is the SME and point of contact for all related COVID-19 travel requirement enquires. Additionally, Responsible to ensure all COVID-19 regulations are updated in CDMS and COVID-19 related bulletins through communication with ASMs, RASMs, IOC GS and monthly reviews. Also responsible for updating the regulatory matrix, uploading the latest circulars and deleting obsolete circulars/information  from CDMS and QHUB)·Effective and efficient communication with internal and external stakeholders across the network to drive and ensure overall corporate regulatory compliance is being defined and met.·Perform other department duties related to his/her position as directed by the Head of the Department.Be part of an extraordinary storyYour skills. Your imagination. Your ambition. Here, there are no boundaries to your potential and the impact you can make. You’ll find infinite opportunities to grow and work on the biggest, most rewarding challenges that will build your skills and experience. You have the chance to be a part of our future, and build the life you want while being part of an international community. Our best is here and still to come. To us, impossible is only a challenge.Join us as we dare to achieve what’s never been done before.About youThe successful candidate will have the following qualifications and skills:·Relevant College or University qualification·Minimum 4 years of relevant experience·Excellent communication skills with fluency in English language·Extensive knowledge of all areas of airline/airport operations and/or GHA operational environment.·Experience in Enterprise Risk Management, Data protection and Environmental Management.·Proficiency  in  various documentation platforms used at QR -- CDMS,  QHUB,  GSMIS·High level of MS Office, Presentation and Analytical skills.About Qatar Airways GroupOur story started with four aircraft. Today, we deliver excellence across 12 different businesses coming together as one. We’ve grown fast, broken records and set trends that others follow. We don’t slow down by the fear of failure. Instead, we dare to achieve what’s never been done before. So whether you’re creating a unique experience for our customers or innovating behind the scenes, every person contributes to our proud story. A story of spectacular growth and determination.Now is the time to bring your best ideas and passion to a place where your ambition will know no boundaries, and be part of a truly global community.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}