{
    "Job ID": "69865729",
    "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\" Properly check and finalizes daily room revenue report including:\nControl to ensure that any discrepancies between housekeeping and front office room status are reported. Total rooms available for sale agrees with the contracted rooms available.\nMarket segmentation correctly reflects the source of business and correctly reflects in the GL\nVerified the room rate with agreements or reservation, check allowance for room revenue. Room revenue as per PMS is corrected in GL.\nDo physical room check.\nCheck mini bar revenue, laundry revenue telephone and other revenue.\nCheck rebate report, discount report, complementary and house use report, no show posting, late check out ect. To ensure that every complimentary room, house use room, discount or rebate of revenue must have adequate explanation in the approval form.\nReconcile all credit card collections again cashier summary and again lists received from bank.\nFinalizes food cover report and photocopies various documentation for food and beverage control and the Finance Department\nKeys in revenue journal and distributes to Outlet Mangers and management\nControls dockets used in all outlets, maintaining correct sequence used at all times, accounting for dockets and making sure canceled dockets are recorded accordingly\nControls all food and beverage sales by:\nCorrect recording of guest checks on a timely basis\nPerforms spot checks on outlet checks used\nHaving all voided checks, corrections and unsettled checks approved by the Restaurant Supervisor or Manager\nMonitors the buffet controls, especially over cash settled checks to prevent reuse ensuring all revenue is recorded\nEnsure banquet controls are being adhered to\nReconciles total outlet sales to total charges\nEnsures all rebates and miscellaneous charges are supported by documentation detailing the charges.  All rebate credits must be in accordance with Finance Policy.  The rebate credits, miscellaneous charges and paid outs must be summarized and sent to the Finance Manager and General Manager for review daily\nEnsures that programs involving coupons, certificates, and vouchers are adequately controlled and safeguards are in place\nAudits daily collection of the General Cashiers Summary against the bank in slip\nAudits and reconciles advance payments and ensures payments have been applied\nWorks with General Cashier to check all float totals regularly and keeps control on registers in outlets\nReconciles revenues on a daily basis via back up page\nPerforms various special projects as requested and assigned by management\nAdhere to Hotel Handbook and general policies and procedures\nAdhere to Finance Policies and ProceduresYour experience and skills include:\nAbility to work well under pressure in a fast paced environment\nAbility to work cohesively and collectively as part of a team\nAdd diplomas/certifications required if neededYour team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}