{"Job ID": "69868528", "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Consultant Specialist.Defining and implementing Project Strategies covering all testing activities within each project\nRepresent testing at all key project meetings and provide a single point of accountability and escalation for testing within the project\nThe development and ownership of testing documentation in line with HSBC standards\nManaging the risk and the quality of deliverables against scope, budget and schedules\nProvide on-going input into the overall process improvement of the Testing discipline within CDD\nEstablish effective working relationships with other areas of HSBC related in the end-to-end testing cycle (eg Business, Information Security & Risk, Change Delivery etc)\nProvide the testing sign-off and recommendations for the production release\nLead the test team by providing a proper vision with a confirmed plan, strategy and a clear action\nEnsure development projects are delivered on time, meet business requirements and fulfil end-user requirements. Assist with identifying and resolving systems issues.\nImplement, maintain and improve test team principles and strategy that address all aspects of the Test process.\nEnsure the test function follows an auditable robust process where controls can be evidenced.\nEnhance processes without adding unnecessary red tape or admin overhead..\nEnsure test automation is used effectively to minimise test cycle timescales while maintaining high quality standards.\nCoach project and scrum teams in proper test procedure, review techniques used for all types of testing practiced in the test function.\nProduce project estimates and work closely with the Development Manager to ensure project work is delivered to required timescales and quality levels.\nWork alongside business analysts, scrum masters and project managers to understand business goals/drivers and deliver testing artefacts to the required timescales.\nProvide regular reports to senior management to demonstrate progress of the test function.\nParticipate in project meetings with business stakeholders to understand and deliver projects.\nResponsible for test improvement and optimisation\nPromote and advocate test capabilities internally\nTake responsibility for talent, succession planning and able to manage federated test teams\nTake accountability to drive positive energy, motivation within test teams and take care of wellbeing\nMake important decisions relating to test within the context of the delivery environment\nDevelop test strategy for both manual and automated testing ( functional, non-functional) covering tools, technology people and process\nProven track record of implementing and executing an assurance and test strategy and leading testing activities on large integration projects\nIdentification of test entry and exit criteria\nGood experience of test planning, reporting, co-ordination and execution of test activities\nDefect management across all test phases and remediation activities\nGood exposure of software/product test approaches\nStrong stakeholder engagement and communication skills\nExperience of testing toolsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}