{"Job ID": "69865882", "Description": "Introducing Raffles Al Areen Palace Bahrain, an extraordinary addition to Raffles Hotel's renowned portfolio, set to open in the last quarter of 2023. This ultra-luxury property offers a unique experience as \"The Palace of the Secret Garden.\" With 78 private pool villas ranging from 1 to 3 bedrooms, Raffles Al Areen Palace Bahrain redefines luxury hospitality in Bahrain. Our spacious villas, starting from 400 sqm, feature private pools and jacuzzis, providing guests with ultimate relaxation and privacy. Our dedicated team of Raffles Legendary Butlers ensures exceptional service and attention to detail, creating unforgettable moments for each guest. Conveniently located just 40 minutes from the airport and 30 minutes from the City Center, Raffles Al Areen Palace Bahrain offers easy access to Exhibition World Bahrain, Bahrain International Circuit (BIC), and the Al Dana Amphitheater, making it an ideal choice for cultural, entertainment, and business destinations.The overall scope of the position is to maintain and execute the hotel’s Digital Marketing and E-commerce activities including but not limited to developing strategy, content updates, Social media management, email marketing, display and programmatic campaigns, Metasearch and OTA optimization.Reporting directly to GM or Director of Marketing and reporting dotted line to Regional E-commerce.Main responsibilities:Build Digital yearly plan and budget for the hotel across Direct & Indirect channels\nContributing to Hotel Strategy, working closely with key stakeholders from Marketing, Sales, Revenue, PR, F&B\nDevelop quarterly and yearly e-commerce and digital marketing plans covering all digital channels and levers (Direct and Indirect)\nPlan and execute all digital marketing activities including but not limited to SEO/SEA, emailing, social media, display, Metasearch and influencers\nReporting and Analysis of Web Direct and Indirect performance\nMeasure and report the performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)\nEnsure hotel’s presence across key Social platforms relevant to the source markets and social content productionHandle the CRM and email Marketing with the third party tool for Rooms, F&B and other outlets in line with the strategy and corporate guidelinesMonitor and assist in ensuring Rate parity together with the Revenue Director/Manager throughout all distribution channels\nManage Hotel’s online reputation\nReview and monitor hotel’s competitor set on a regular basis and maintain competitiveness in terms of content quality and offer appeal\nIdentify trends and insights, and optimize spend and performance based on the insights\nBrainstorm new and creative growth strategies\nUtilize strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch points\nEnsure Accor App visibility and usage uplift across the hotel\nCollaborate with agencies and other vendor partners\nEvaluate emerging technologies. Provide leadership and perspective for adoption where appropriateQualification & SkillsA minimum of 5 years of experience in E-Commerce / Digital Marketing in Hospitality or Retail\nA degree in Hospitality Management or Marketing and Communications\nExcellent English, both verbal and written\nStrong understanding of current digital marketing concepts, strategy and best practice\nExcellent Presentation and customer relationship skills\nEnergetic and passionate to work\nInnovative approach to workOpportunity to join us in rebranding journey and be part of the first Raffles in Bahrain\nEmployee benefit card offering discounted rates in Accor worldwide\nLearning programs through our Academies\nOpportunity to develop your talent and grow within your property and across the world!\nAbility to make a difference through our Corporate Social Responsibility activities, like Planet 21Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Manama, Bahrain", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}