{
    "Job ID": "69866292",
    "Description": "ROLE SUMMARY\nThe CX GTM team’s mission is to incorporate the voice of the customer into Pfizer strategies by leading the transformation of CX through the strategic implementation of metrics, insights, and innovation to improve the customer experience. The Digital Readiness Team (DRT) sits within CX GTM and aims to accelerate the design, approval, and implementation of innovative initiatives across Pfizer.\nThe Digital Readiness Team (DRT) is a partner for colleagues to co-create Pfizer-first digital innovation projects together with a broad team of SMEs, for advice and guidance on managing customer-facing digital solutions. This area is highly complex with many different interpretations of guidance and multiple distinct country regulatory environments to consider. DRT helps colleagues to navigate these processes by bringing together cross-functional key stakeholder SMEs with decision-making authority (Digital, Medical, Legal, Biopharma Quality, etc.) into one group to enable streamlined execution of new external facing, digital initiatives, and digital upgrades.\nThe International Markets Digital Readiness Team Manager is leading key initiatives in DRT to collaborate with project teams and identify compliant pathways for customer-facing digital innovation at speed and scale to improve customer experience.\nInternational Markets DRT Manager will directly contribute to moving digital initiatives forward faster at Pfizer while interacting with project teams and cross-functional stakeholders. This role will ensure aligned and consistent guidance is available for activation on Social media and other platforms to support digital acceleration in the ex-US markets. As we explore new media and new platforms, we must ensure our regulatory/compliance processes keep pace with this rate of change in order not to stifle our ability to innovate while maintaining our commitment to zero compliance issues. This job is a great opportunity for a colleague looking to support scalable innovation at Pfizer and focus on how we evolve our digital standards.\nColleague in this role will also be responsible for establishing and maintaining smooth operations within the core DRT team and communication efforts to raise awareness of DRT value across the company. This colleague will report to the Global Digital Readiness Team Lead.\nROLE RESPONSIBILITIES\n• Manages key stakeholders in the frame of projects submitted for the International Markets DRT review, interacting with DRT members and project teams, acts as a backup for IM DRT Lead as needed\n• Leads development, update, and review of Social Media and other related guidelines\n• Engages with various cross-functional internal and external stakeholders to track new trends in Social Media platforms. Takes informal leadership role to facilitate review of related trends and incorporates updates in DRT guidelines.\n• Manages agency resources contracted by DRT as needed to implement necessary updates or develop new guidelines\n• Manages International Markets DRT meetings schedule (full DRT (IDM/EM) meetings, focused DRT meetings, intake meetings, ad-hoc meetings) including agenda development, coordinating action items and follow-ups, capturing meeting minutes, facilitating review by DRT members, and circulating minutes to project teams\n• Leads the development, preparation, and communication of IM DRT metrics and other KPIs to key stakeholders\n• Leads the development of International Markets DRT newsletter and other awareness and training materials, manages creative agency work to support this effort\n• Manages DRT communication processes and strategy. e.g. creates and maintains mailboxes, templates, automated mailing solutions, distribution lists, communication, and training schedule\n• Explores and implements new tools for automatization and simplification of DRT operational processes\n• Responsible for maintenance and enhancement of the DRT website; indirectly leading technical team for updates and enhancements, adding, and updating website content\n• Record keeping, filing, and archiving of information in accordance with company procedures and requirements, ensure accessibility of information for audit and inspection readiness purposes\n• Administrative and operational support for the International Market DRT Lead, resolving routine issues on their behalf\n• Ensure audit and inspection readiness of DRT-owned documents\n• Ensure the controlled Documents management tool is up to date\n• Tracking International Markets DRT budget to meet related financial goals, arranging POs, and contracts with related agencies, providing related updates to DRT Lead on budget spend\nQUALIFICATIONS\n• BA Required; MBA or equivalent Master’s-level education preferred\n• 5+ year’s work experience in digital and/or quality and compliance related roles; including experience working in pharma related digital compliance\n• Fluency in digital tactics, social media, and key channels (e.g. mobile, website); Understanding of the broader digital landscape including new and emerging channels, keeping up with new trends and key updates to the major platforms\n• Experience utilizing digital content, social media for brand initiatives, and best practices for social and paid media\n• Awareness of legal, regulatory, and compliance requirements and related internal SOPs, comprehensive knowledge in some of these areas is preferred\n• Previous healthcare or pharmaceutical experience required\n• Proven history of handling multiple projects at once, and ensuring seamless, consistent communication of highly confidential materials.\n• Demonstrate resourcefulness with a proven ability to anticipate needs, prioritize responsibilities, and manage multiple priorities with tight timelines\n• Proven track record of leading projects and leading teams that successfully achieve milestones and deliverables\n• Excellent written and verbal skills in English language\n• Exceptional attention to detail, along with exceptional organizational skills\n• Ability to work well both in a team environment as well as operate independently with minimal supervision\n• Must have the ability and professional demeanor to interface with senior management, international colleagues and important external stakeholders and must be able to exhibit good judgment in handling highly sensitive, confidential information\nNON-STANDARD WORK SCHEDULE, TRAVEL OR ENVIRONMENT REQUIREMENTS\nGiven the global nature of the role, (limited) international travel and working outside of normal work times will be required.\nORGANIZATIONAL RELATIONSHIPS\n• International Markets Digital Readiness Team SMEs and their related teams, Submission teams, etc.\n• Brand teams, project teams, and local teams engaging with DRT\n• CX Transformation Team\n• Customer Experience Team\n• Digital Client Partners\n• CMO, CMAO, GTMX TeamsPurposeBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.School of LeadersWe, as Pfizer Turkey, make a difference with our visionary and pioneering approaches ranging from our concept of raising leaders through rotations, providing international career opportunities to creating a flexible, enjoyable work environment. There are no limits to what we can accomplish to touch lives here!FlexibilityWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!Equal Employment OpportunityWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}