{"Job ID": "69869865", "Description": "EDUCATION DEVELOPMENT CENTER (EDC)Education Development Center (EDC) is a global nonprofit that advances lasting solutions to improve education, promote health, and expand economic opportunity, with a focus on vulnerable and under-served populations.  Since 1958, we have been a leader in designing, implementing, and evaluating powerful and innovative programs in more than 80 countries around the world.EDC promotes equity and access to high quality education and health services and products that contribute to thriving communities where people from diverse backgrounds learn, live, and work together. We support an inclusive workplace culture that embraces many perspectives and broadens our understanding of the communities we serve, enhancing and enriching our work.  EDC is committed to equity, diversity and inclusion in the workplace.Project DescriptionThe goal of the USAID Teacher Excellence Initiative Activity project is to improve the quality and relevance of teacher preparation in Egyptian public universities so that current and future primary school teachers have enhanced skills to increase student learning and advance the Ministry of Education and Technical Education’s (MOETE) reform. The activity will achieve this goal through the following results: At least 7,500 pre-service teachers in undergraduate programs at Faculties of Education in five Egyptian universities have the skills and knowledge to apply practice-based, experiential teaching methods in the classroom. \n5,000 in-service teachers in postgraduate programs at Faculties of Education in 15 Egyptian universities apply practice-based, experiential teaching methods in the classroom. \n50 Government of Egypt personnel from the MOETE, the Ministry of Higher Education and Scientific Research (MOHESR), and the Supreme Council of Universities demonstrate improved capacity to jointly plan, manage, and adapt teacher education. The Program Coordinator will provide administrative and programmatic support to the Capacity Building unit. The Program Coordinator will maintain the filing and documentation for all Capacity Building activities. The Program Coordinator will be responsible for all logistical, administrative, and travel requirements during the different stages of study tours. for the implementation of capacity building activities. The Program Coordinator ensures that work is performed efficiently, problems are resolved promptly, and that EDC procedures and USAID policies are followed. The Program Coordinator will report to the Training Officer. This role is based in-person in Cairo, Egypt.Provide administrative and programmatic assistance for the implementation of workshops and training activities.\nSupport in coordinating with the Logistics Officer to ensure that training supplies’ equipment, services and materials are prepared and available on site as needed.\nCoordinate with the logistics department to identify and secure suitable training venues for TEI events and activities.\nAssist in the planning of Capacity Building activities.\nServe as R1 (Initiator) on TEAMS, the USAID TraiNet and Visa compliance system.\nAssist the Training Officer in all Study Tour related activities: pre-departure activities, participants’ travel arrangements, completing and submitting US visa applications (DS 160), finalizing participants’ R3 packages, and following up on visa issuance.\nMaintain up to date filing system for the Capacity Building unit.\nMaintain and regularly update participants’ information.\nOccasional travel to the different training sites to provide on-site support.\nRespond to other priorities and tasks, as needed.Education:Bachelor’s degree required in education, business administration, or related field.Skills and Experience:A minimum of 4-5 years of progressive experience in project coordination and administrative tasks.\nDemonstrated ability to exercise sound judgment and handle highly confidential information appropriately.\nExcellent Communication skills.\nStrong interpersonal skills including the ability to work as part of a team and to be proactive.\nStrong organizational skills, administrative abilities, and attention to detail.\nStrong verbal and written communications skills in both English and Arabic.\nProficiency using Microsoft office suite, and other relevant software.\nExperience with USAID programming and regulations is preferred.Language:Fluency in English is required.This position is located in the country office.Expected Start Date: October 15th, 2023Due to the volume of applications submitted, only short-listed will be notified. No phone calls, please.Applications submitted without a resume will not be considered.**************************************************************EDC is an Affirmative Action/Equal Opportunity Employer committed to enhancing the diversity of its workforce and ensuring an equitable and highly inclusive work environment. EDC is a smoke-free workplace, and offers a supportive work environment, competitive salary, and excellent benefits. Women, minorities, and individuals with disabilities are encouraged to apply.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}