{"Job ID": "69867103", "Description": "About Flat6LabsFlat6Labs is the MENA region’s leading seed and early stage venture capital firm, currently running the most renowned startup programs in the region.Launched and headquartered in Cairo since 2011, Flat6Labs has multiple offices across the region; with ongoing plans to expand into other emerging markets.For more information, visit www.flat6labs.comAbout the roleAs Flat6Labs Manager, Monitoring and Evaluation, you will be responsible for designing, implementing, and managing the monitoring and evaluation framework for Flat6labs. They will work closely with teams like investment team, Programs team, to assess the impact of our investments, track progress against key performance indicators (KPIs), and identify areas for improvement.Main Responsibilities:Design and implement the monitoring and evaluation framework for Flat6labs.\nDevelop KPIs and metrics to track the performance of our investments and portfolio companies.\nConduct regular evaluations of our investment portfolio to assess the impact and identify areas for improvement.\nDesign preparing performance monitoring plans, including developing and defining program indicators and sources of data, as well as annual reports and other program documents.\nDesign, review and test monitoring and evaluation tools for reporting formats and data collection.\nCreate and implement program cycle evaluation reports.\nCommunicate regularly with the relevant teams and senior management on the performance of our investments and portfolio companies.\nAnalyze data and prepare reports on the performance of our investments and portfolio companies.\nProvide insights and recommendations to improve the effectiveness of our support for our portfolio companies.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}