{"Job ID": "69869664", "Description": "An ASX100 business part that is owned by Australian universities, IDP is a pioneer in international education services. Ourcore business lines include student placement to Australia, US, UK, Canada and New Zealand institutions, English-language testing and training.We are on a mission to build the world's leading platform and connected community to guide students along their journey to achieve their lifelong learning and career aspirations.As a co-owner of IELTS, we deliver the English test that is trusted by more governments, universities and organizations than any other. We also operate English language teaching schools in South East Asia.We are innovators, driven by the needs of our customers and deep data insights. Our 5,000 team members based around the world understand that our services change lives – not only of our customers, but their wider communities.By combining empathy and professional expertise with digital excellence, we create launch pads for our customers to achieve global success.POSITION PURPOSEThe Education Counsellor is responsible for providing information, advice, support and processing of applications for international students seeking placement in education institutions in Egypt, by promoting IDP products and services directly to students. The Education Counsellor is responsible for supporting the achievement of office / country sales performance targets. The counsellor will also provide support and referral for students with issues other than placement, ultimately ensuring the delivery of outstanding customer service.Key Responsibilities;Student Counselling\nDelivering Results\nBusiness Development\nCustomer Service\nClient Relationships\nTeam Work\nCommunicationRESPONSIBILITIESStudent CounsellingCounsel prospective students to identify appropriate study options including suitable courses and institutions.\nSchedule and conduct phone discussions and office meetings to accurately convey course / program information whilst ensuring that each students’ needs are being met. This includes advising students with respect to admissions requirements, processes and qualification options.\nAssist students in determining an appropriate shortlist of applications to submit, thereby ensuring effective use of counselling time.\nSupport the student through the admissions, visa and pre departure processes.\nDevelop and maintain strong relationships with students and their families to ensure that IDP is regarded as a highly professional and trusted service provider.\nMaintain the highest level of integrity and ethics in every interaction with students and their families, clients and colleagues.Delivering ResultsDeliver consistently outstanding service to ensure a high number of students are converted to the next stage of the student pipeline, ultimately submitting applications to education institutions and accepting the resulting offers.\nIdentify opportunities to generate leads and effectively leverage these opportunities. e.g. determine the prospective schools, universities, companies and scholarship bodies from where new leads can be derived and established effective relationships with them.\nCRM system is used to support the end to end counselling process including the capture and follow up of all leads and opportunities to close sales.Business DevelopmentIdentify new business opportunities in consultation with the BUM\nMaintain regular contact and activities with key accounts (schools, scholarship bodies)Customer ServiceAct with the highest level of accountability with students, clients and colleagues.\nRespond to face to face enquiries and enquiries visa phone and email in a timely manner, with accurate and relevant information.\nProcess and submit applications to institutions, obtain offers and facilitate enrolments in a timely manner.\nBuild effective relationships with education institution staff to support timely application processing.\nAssist students with on-arrival issues or and refer to appropriate agencies where necessary\nBuild strong relationships with network counsellors to enable ongoing support of students onshore.Client RelationshipsAttend client briefings, workshops and visits to institutions to support the development of knowledge of institutions and establish relationships with key contacts.\nWork with Business Unit / Operation Managers and institution representatives to developing strategies to effectively promote institutions.\nAct with integrity and professionalism in all interactions with client representatives.Team WorkSupport Business Unit Manager / Operation Manager / Marketing Teams in the organisation of major promotional events such as interview programs, in-house interview sessions and exhibitions, and other activities as required.\nProvide input on marketing or promotional activities to encourage student numbers.\nPromote IDP through activities such institution visits, seminars, exhibitions, student associations etc.\nAssist in the identification of opportunities and threats within the local market.\nAttend, lead and participate in office level meetings and activities to support sharing of information, knowledge and expertise for the benefit of the team as a whole.\nIdentify and leverage opportunities to increase cooperation, efficiency and operational effectiveness between IDP’s student placement and IELTS operations.CommunicationFollow up effectively with students and institutions to ensure enrolment activities are completed effectively.\nUse full range of available communication channels including email, phone and CRM communication features such as SMS and tasks.\nEffectively present relevant information to students, clients and other key stakeholders as required.\nProvide regular updates to line manager to inform them of progress, challenges and / or support that may be required.WHAT WE'RE LOOKING FOREssential requirements:Must be inside the Saudi Arabia\nPrevious experience as a counsellor is a must.\nEducated to bachelor’s degree level or equivalent.\nFluent in English and Arabic.\nExperience in study abroad counselling is a plus.\nExperience of working in a sales driven environment with a strong focus on achieving individual and team based targets.\nKnowledge of education institutions, admission processes, immigration requirements and their international operations.\nOutstanding communication skills and able to communicate effectively with different stakeholders with varying needs (students, parents, institution representatives, colleagues etc.).\nExcellent planning and organising skills with the ability to manage multiple competing priorities.\nCustomer focussed, with a passion for providing outstanding service.\nHighly effective relationship building and relationship management skills.\nEffective team worker, supporting colleagues and contributing positively to overall team’s success.\nAbility to proactively identify, analyse and solve problems effectively.\nSound judgement and the ability to make decisions and act with integrity, in the best interests of IDP.\nStrong IT skills – Microsoft Office suite, CRM systems.Desirable requirements:Experience of working with a CRM system.\nWork and / or study experience in a relevant destination country.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}