{
    "Job ID": "69866595",
    "Description": "At Four Seasons we consider life and work to be richer when we truly connect with the people and the environment around us.Our family members are masters at their crafts – a gardener can become an artist, a manager a conductor, a chef an inventor. We look for employees who share the Golden Rule: people who, by nature, believe in treating others as we would have them treat us. We look for our people to characterize a shared passion for excellence and to infuse that enthusiasm into everything they do.About Four SeasonsFounded in 1960, Four Seasons continues to define the future of luxury hospitality with extraordinary imagination, unwavering commitment to the highest standards of quality, and the most genuine and customized service. Currently operating 180 + Hotels and Private Residences in major city centers and resort destination in 47 countries, and with many more projects in development stage, Four Seasons consistently ranks among the world’s best hotels and most prestigious brands in reader polls, traveler reviews and industry awards.Main Duties/Description:To prepare and cook food according to standard procedures, recipe cards, photographs and given instructions.\n\nTo help the Chef de Partie/Demi Chef de Partie to establish standard recipes and ensure the compliance with them. \n\nConstantly inspect taste, temperature and visual appeal, make sure that all dishes are uniform and that established portion sizes are adhered to.\n\nTo participate in product development and in controlling the smooth operation of the kitchen. \n\nTo ensure food quality, food taste, food presentation and food requisition.\n\nTo have a good knowledge of cuisines to carry out the duties and responsibilities for the position in an efficient and productive manner. \n\nTo be able to manage a shift. \n\nTo ensure proper sanitation procedures are followed and the kitchen is always clean, neat and tidy. \n\nTo assist the Chef’s in the day-to-day operation of the kitchen and to help maintain a high Standard of food preparation.\n\nTo have full knowledge of Four Seasons Food Standards.\n\nTo ensure all equipment is in full working order.\n\nTo ensure an adequate supply of all products prepared on a timely basis.\n\nTo do requisition of all items needed for the following day from the food storeroom, non-food storeroom and stewarding department.\n\nTo prepare exciting and appealing room amenity when needed.\n\nTo demonstrate and maintain at all times a professional behavior and positive attitude. \n\nTo communicate regularly with the Executive Chef/Executive Sous Chef to achieve an excellent rapport throughout the food production department.\n\nTo respond properly in any hotel emergency or safety situation.\n\nTo perform other tasks or projects as assigned by hotel management. This includes packaging design, procurement; marketing and merchandising of food products in conjunction with Executive Chef and Food and Beverage Director.\n\nTo have a full working knowledge of halal food, service and preparation.\n\nTo execute Alternative Cuisine and Spa Cuisine.\n\nTo be certified in Food Service Sanitation as available and to implement protocols.\n\nTo work closely with all chefs in relation to the food.Preferred Qualifications and Skills:Relevant experience in 5 star hotel\n\nExcellent reading, writing and oral proficiency in English\n\nFlexible with schedule and prepared to work a variety of shifts, including overtime and adjust shift and/or off days according to operational requirements. \n\nWorks well in a team environment ability to work effectively under pressure\n\nPreferred Asian nationalThe benefits offered by Four Seasons Hotel Kuwait include:Full board shared living accommodation in a high quality, well-resourced compound.\n\nComplimentary nights at FS Hotels worldwide.\n\nRegular social and sporting events.\n\nPaid home leave tickets.\n\nQuality employee meals.\n\nFree transportation to and from work.Work AuthorizationHotel will apply for the work authorization for the successful candidateWe look forward to receiving your application!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}