{
    "Job ID": "69866710",
    "Description": "Love to conceptualise and build applications in Amazon Advertising from grounds-up? Like to develop real-time, distributed, large-scale, and modern front-end applications? Like to interact with worldwide advertising customers to build systems that makes advertising and it's functions automated and frictionless? Interested in being part of a worldwide Advertising Customer Experience team? Then, Software Development team that builds Tier-1 Advertising Experience wants you!\nAdvertising is one of the fastest growing businesses within Amazon, empowering Amazon Sellers, Vendors, Authors, and Publishers to boost their product reach and sales through performance and display advertising. The Iron Mountain platform is an enabler for SSPA's worldwide rapid growth and offers a singular platform to manage all of the advertisers billing, invoicing, accounting automation, budgets, promotions, payments, and Billing Advertiser Experience(AX) in real-time while being transparent and audit-able from the ground-up. As a part of this high-energy, entrepreneurial team you will get an opportunity to innovate on solutions that control the very levers of our advertisers' experience and have the satisfaction of seeing your work impacting multiple advertising business and bring in multi-million transactions worth 100x in dollar value on a daily basis. This platform owns these mandates for worldwide advertising and for all ad products displayed On or Off Amazon.\nThe Iron Mountain team is looking for a Senior Product Manager Technical to participate in building a global, scaleable, extensible, and secure platform that singularly manages the Sourcing, Storage, Supply, Aggregation, Processing, Reporting of billions of clicks and impressions across multiple Iron Mountain services. This platform has to be capable of interacting with different ad serving platforms, seamlessly store the incoming clicks and impressions for the broad variety of Advertisement programs with no loss in information, and provide the events to downstream Iron Mountain services with the ability to replay/re-drive the events from any point in the past to support recovery. This platform is also responsible for building front-end applications for Billing, Budgeting, Payments, and Promotions Advertiser Experience(AX). This platform has to guarantee a sourcing-storage-supply SLA of sub-milliseconds to ensure that real time budgeting SLAs are not impacted. To build this platform you will need to be well versed with high performance architecture, distributed data processing and storage technologies.\nKey job responsibilities\nWork closely with stakeholders & customers to define the product vision and strategy. Analyze the market, industry trends and gather data to make informed decisions about new features & improvements.Align technical development with business objectives, ensuring that the product roadmap serves the company's goals.\nCollaborate with various stakeholders, including customers, Sales and development teams, to gather and define detailed product requirements. Ensure that these requirements are clear, feasible, and aligned with the product vision. Prioritize the backlog of features and tasks.\nResponsible for managing the product development process - including defining project timelines, milestones, and tracking progress. Oversee the release process, coordinating with development, testing, and deployment teams to ensure a successful product launch.identify and mitigate risks that could impact the success of the product, such as technical challenges, resource constraints, or changes in market conditions.\nDefine key performance indicators (KPIs) and use data and analytics to measure the success of the product. Adjsuting product strategy based on these metrics.\nCollaborate with UX designers to ensure that the product is user-friendly and meets customer needs. Broaden your technical expertise to be able to refine existing frameworks and build newer ones.\nAbout the team\nBilling AX aka Magnox team builds transparent, frictionless, and easy-to-use advertiser experience for billing and payments across SSPA, ADSP and DSP-MS ad businesses.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- Bachelor's degree\n- Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\n- Experience bridging technical and business teams to collect and refine requirements, prioritize incoming work requests, and ensure all committed work is delivered on time\n- 5+ years of end to end product delivery experience\n- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\n- Experience in building and driving adoption of new tools\n- Experience contributing to engineering discussions around technology decisions and strategy related to a productJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}