{"Job ID": "69866196", "Description": "Search JobsJob DescriptionThe Elevator Pitch: Why will you enjoy this new opportunity?VMware End-User Computing runs the world’s largest Digital Workspace Platform- Workspace ONE. With over 60,000 customers around the globe, our End-User Computing team is helping companies deliver work at the speed of life and our technologies are leading what's happening next for users across the enterprise.Our team is building the new AWS-based Cloud Platform. Our goal is to transform the way customers interact with the digital workspace. We are passionate about rapidly developing high quality software and applying automation and software engineering best practices to everything we do. Continuous improvement is part of our DNA.We work with the latest AWS technologies and open source components. Our technology stack includes 15+ dockerized JAVA/Spring-based microservices and many  AWS services including Lambda, Kinesis, Aurora, DynamoDB, Elasticsearch, Redshift, Glue, and EMR/Spark.What is primary need, technical challenge, and/or problem you will be responsible for?Our goal is to enable the new Cloud Platform to scale and manage billions of devices across various operating system platforms and device types. As part of the team, you will be providing technical leadership by driving the design and development of major architecture components. You will be owning engineering initiatives and champion a culture of high ownership, continuous improvement, and engineering excellence. You will coach, manage and mentor team of engineers.Success in the Role: What are the performance goals over the first 6-12 months you will work toward completing?You will have to perform analysis and design and implement one or more difficult projects, having significant latitude in performing technical work\nYou will have to collaboratively work across other teams\nYou will be regularly evaluated on the quality of the product you create and the code you write to ensure continued advancement of your technical skills in an environment that looks to expand them.What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?You will design software, write code, assist with technology selection and actively remove obstacles\nYou will be working on the following tech stack - Docker, Java, Spring framework (security model, dependency injection, events, resources, validation, data binding, type conversion, Data access, AOP etc.), Mock Test frameworks, PL/SQL and Liquibase.\nAWS services including Lambda, Kinesis, ECS , Elastic search ,SNS , SQS etc..\nMock Test framework\nYou will implement and improve processes around DevOps, Agile, and CI/CD\nYou will develop applications using micro-services and other cloud design patterns\nYou care and have strong, well-thought-out opinions on RESTful API design, including API versioning, backwards compatibility, authentication and rate limitingWhat is the leadership like for this role? What is the structure and culture of the team like?You will be joining the new Cloud Platform team reporting to the Manager, Engineering. The global team is spread throughout VMware offices including Palo Alto, Atlanta, Sofia and Bangalore.The team culture is based on continuous improvement and as a member of the team, you'll have the opportunity to work with experienced, passionate, and fun-loving software engineers.What are the benefits and perks of working at VMware?You and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.Employee Stock Purchase Plan\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nHealthy and local inspired snacks in all our on-site pantriesVMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Search JobsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}