{"Job ID": "69869736", "Description": "Abercrombie & Fitch Co. (NYSE: ANF) is a leading, global specialty retailer of apparel and accessories for men, women and kids through five renowned brands. The iconic Abercrombie & Fitch brand was born in 1892 and aims to make every day feel as exceptional as the start of a long weekend. abercrombie kids sees the world through kids’ eyes, where play is life and every day is an opportunity to be anything and better anything. The Hollister brand believes in liberating the spirit of an endless summer inside everyone and making teens feel celebrated and comfortable in their own skin. Gilly Hicks, offering intimates, loungewear and sleepwear, is designed to invite everyone to embrace who they are underneath it all. Social Tourist, the creative vision of Hollister and social media personalities, Dixie and Charli D’Amelio, offers trend forward apparel that allows teens to experiment with their style, while exploring the duality of who they are both on social media and in real life.  The brands share a commitment to offering products of enduring quality and exceptional comfort that allow consumers around the world to express their own individuality and style. Abercrombie & Fitch Co. operates approximately 730 stores under these brands across North America, Europe, Asia and the Middle East, as well as the e-commerce sites www.abercrombie.com, www.abercrombiekids.com, www.hollisterco.com, www.gillyhicks.com, and www.socialtourist.com.The Brand Representative is truly engaged. They provide great customer service by anticipating and responding to customer needs. An individual who is outgoing, stylish, and helpful. They demonstrate a keen awareness of the store environment by ensuring they always remain approachable and warm. They are able to initiate conversations and connect with the customer by communicating in a genuine and articulate way; that ensures the customer is always the first priority. Demonstrates relatable, confident and highly social behaviors on the sales floor that translate into closing the sale.What You’ll DoCustomer Experience\nStore Presentation and Sales Floor\nCommunication\nAsset Protection and Shrink\nPolicies and Procedures\nTraining and Development RequirementsEmirati national\nMinimum 1 year experience with Customer ServiceWhat it TakesAdaptability / Flexibility\nApplied Learning\nAttention to Detail\nMulti-Tasking\nWork EthicFIND A STORE IN YOUR AREA AND BRING YOUR CV TO APPLY & LEARN MORE! SEE WHAT IT’S LIKE TO #WORKATANF - FOLLOW US ON INSTAGRAM @LIFEATANFAbercrombie & Fitch Co. is an Equal Opportunity/Affirmative Action employerJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}