{"Job ID": "69866208", "Description": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren’t words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You’ll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.Bristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us.This position will be part of People Services and has responsibility for execution and administration of the Bristol-Myers Squibb (BMS) total rewards programs. This includes, but is not limited to, benefits (including health & welfare, risk, retirement and savings plans, wellness), and compensation including base pay, long and short-term incentives, job evaluations and pricing, allowances, one-time payments, and recognition programs.Act as escalation point for the resolution of total rewards enquiries or needs within guidelines\nCreates and reviews system generated correspondence and communications, rewards vendor websites (including benefits enrolment tools), HRA training materials, Local Work Instructions and Knowledge Articles to ensure these are current, accurate and market relevant, recommending updates as needed\nAssists with compliance and governance of all total rewards plans and programs including identifying risks, participating in audits and delivering corrective actions\nEvaluate and process, within guidelines, system transactions including job requisitions, compensation changes, job changes and one-time payments requiring non-standard calculationsBenefitsExecute and administer activities related to benefit plan eligibility, enrollments, status changes, and terminations including some social security programs, seeking support on complex cases to senior peers as required\nResearch, problem solve and respond on issues related to benefit programs, objectives and procedures raised by employees, HR and third-party vendors (includes brokers, insurance providers, regulatory agencies, etc.)\nPerform testing activities for benefits administration systems implementations, changes, and ongoing enhancements\nReview and monitor data integration reports to identify and address inaccuracies and systems errors\nPrepare and action monthly changes in provider portals as needed\nLiaise with system providers, local brokers and vendors as needed\nReview, action, and reconcile system generated reports as needed\nUnderstand, interpret, and effectively communicate benefit plan provisions, policies, programs, process and practice as the escalation point for Key Business Partners\nAssist with the administration of wellness programs and vendors.  Coordinate wellness communications as needed\nAdminister invoicing and payment processes vendors including validating payments, etc. within the defined vendor management frameworkCompensationPerform job evaluations, market pricing and provide salary recommendations (new hires, promotions, market catch ups, etc.), seeking support on complex cases to senior peers as required\nConduct and participate in Annual Salary Surveys (Compensation Surveys - local & regional) under guidance of COE\nInterpret salary data and perform analyses to ensure BMS competitive positioning within the market. Support regularly scheduled competitive pay reviews for select groups of employees (e.g. key/top talent, critical skills), proposing updates to salary ranges and hiring guidelines if applicable\nContribute to annual compensation planning\nResearch, problem solve and respond on issues related to compensation programs, objectives and procedures raised by employees, HR and third party vendors\nProvide reporting and analytics support to Total Rewards (Service Lines, Centers of Excellence) for annual activities e.g. mandatory and annual Collective Agreement increases, off-cycle salary reviews, etc. as directed\nPrepare reports to respond to external audit and government bodies as requiredContentContribute to the HR Portal, updating content for Compensation and Benefits.Desired ExperienceBachelors degree from an accredited university/college\nIn depth 3+ years of experience in one or more of Compensation Operations, Benefits Administration\nPractical operational experience of other HR processes, e.g., talent acquisition, payroll, performance\nExperience working within an HR Shared Services delivery model\nExperience working in a rapid, fast-moving environment which is both complex and changing\nGeneral knowledge and understanding of HR policies, processes, regional Employment Laws and total rewards legislative requirements for the relevant region\nExperience working in a multi-cultural/multi-country work environment\nAbility to use business judgment when assessing requirements and performance, in order to identify the right solution to meet business needs\nDemonstrated analytical abilities, attention to detail and the ability to successfully manage multiple competing tasks and priorities\nExperience in coaching others to build capabilities or enhance functional depth\nAbility to network across a global organization in order to align with organization objectives, strategy.  Collaborate with Total Reward Service Lines and Centres of Expertise to recommend, operationalize and deliver enterprise wide solutions\nDemonstrated continuous improvement mindset#LI-OnsiteIf you come across a role that intrigues you but doesn’t perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.Uniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as “Transforming patients’ lives through science™ ”, every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.On-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.BMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.BMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.BMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.Any data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}