{
    "Job ID": "69867150",
    "Description": "About FreshworksFreshworks makes it fast and easy for businesses to delight their customers and employees. We do this by taking a fresh approach to building and delivering software that is affordable, quick to implement, and designed for the end user. Headquartered in San Mateo, California, Freshworks has a global team operating from 13 global locations to serve more than 65,000 companies -- from startups to public companies – that rely on Freshworks software-as-a-service to enable a better customer experience (CRM, CX) and employee experience (ITSM). Freshworks’ cloud-based software suite includes Freshdesk (omni-channel customer support), Freshsales (sales automation), Freshmarketer (marketing automation), Freshservice (IT service desk), Freshchat (AI-powered bots), supported by Neo, our underlying platform of shared services.Freshworks is featured in global national press including CNBC, Forbes, Fortune, Bloomberg and has been a BuiltIn Best Place to work in San Francisco and Denver for the last 3 years. Our customer ratings have earned Freshworks products TrustRadius Top Rated Software ratings and G2 Best of Awards for Best Feature Set, Best Value for the Price and Best Relationship. About the role:\n\nAs a Data Scientist at Freshworks, you will help identify the right business problems that will be more effectively solved with Machine Learning techniques. Then you will apply your algorithmic and statistical skills, knowledge of ML techniques, grasp of fundamental Math, and familiarity with big data to solve the problem in the simplest possible way. Responsibilities Collaborate with product and business teams to understand all aspects of the problem Define the right target metrics that best represent the end-user value Apply knowledge of ML, statistics, and advanced mathematics to conceptualize, experiment and design an intelligent system Work with engineers to build the system end-to-end including Big Data pipelines and ensure the serving system is scalable and highly performant. Qualifications A Bachelor’s degree or a higher degree in Computer Science, Statistics, Mathematics or a related field. Strong problem-solving and programming skills with a deep understanding of data structures and algorithms. Solid understanding of mathematical underpinnings behind Machine Learning algorithms and proficiency in probability, statistics, linear algebra, calculus, and optimization. Experience with NLP, Distributed Systems, large scale computing, Big Data technologies like Hadoop and Spark are plus.1. Minimum 6 years of relevant experience2. Scaling up of models created by Data Scientist;3. Data Structure, Algorithms; Database concepts; JVM/Python; Machine learning algorithmsAll your information will be kept confidential according to EEO guidelines.At Freshworks, we are creating a global workplace that enables everyone to find their true potential, purpose, and passion irrespective of their background, gender, race, sexual orientation, religion and ethnicity. We are committed to providing equal opportunity for all and believe that diversity in the workplace creates a more vibrant, richer work environment that advances the goals of our employees, communities and the business.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}