{
    "Job ID": "69866165",
    "Description": "علن شركة كوني عن وجود وظيفة مندوب مشتريات و سائق  في الرياض حيث يقوم المرشح للوظيفة بعمليات شراء المواد و الأدوات و قطع الغيار بناء على طلبات الموقع و نقلها و تسليمها وفقا لتاريخ التسليم المطلوب والمتفق عليه.:مهام الوظيفةادارة عمليات تسليم المواد والأدوات من الموردين إلى المواقع أو مراكز التوزيع.\nالتنسيق مع مدير الموقع لضمان تسليم المواد للفنيين و المقاولين في الوقت المناسب.\nتحديد البائعين المحتملين والمنتجات الجديدة بما يتوافق مع المواد المطلوبة.\nالتعامل بفعالية مع التحديات المتعلقة مع الموردين.\nالتأكد من نقل الأدوات و قطع الغيار فى الوقت المناسب.\nمسؤول عن مستودع المواد الخاص بالمشروع:متطلبات الوظيفةالالمام بالمواد و الادوات المستخدمة في قطاعات البناء.\nمهارات اتصال شفهية وكتابية جيدة.\nالمرونة و القدره على القيام بمهام متعددة.\nوجود رخصة قيادة حيث يتعين علي القائم بالوظيفة نقل المعدات و الأدوات بين المواقع و المخزن و أماكن الشراء .\nهذه الوظيفة متاحة للمواطنين السعوديين فقطAt KONE, we are focused on creating an innovative and collaborative working culture where we value the contribution of each individual. Employee engagement is a key focus area for us and we encourage participation and the sharing of information and ideas. Sustainability is an integral part of our culture and the daily practice. We follow ethical business practices and we seek to develop a culture of working together where co-workers trust and respect each other and good performance is recognized. In being a great place to work, we are proud to offer a range of experiences and opportunities that will help you to achieve your career and personal goals and enable you to live a healthy and balanced life.Read more on www.kone.com/careersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}