{
    "Job ID": "69866561",
    "Description": "IQ-EQ is a leading Investor Services group which combines global expertise with an unwavering focus on client service delivery. We support fund managers, global companies, family offices and private clients operating worldwide.It’s a numbers game.In IQ-EQ, we make sure that each team member gets the chance to work hard and play even harder. Your role as the coach and Assistant Manager of the team will be critical in ensuring that timely delivery is met and that you and your team are right staffed to support the demands of your clients.Just like every winning sports team, you will need to train your team members, engage, and help them develop so they can perform the output needed by your clients. Every so often, you’ll be asked to show the team how it’s done as you review and/or prepare reporting requirements of your clients like financial statements, working papers and other deliverables.As the Assistant Manager the organization will depend on you to lead, organize, coordinate, develop, monitors the performance, delegate tasks and responsibilities to team members making sure the team meets the KPIs and optimizing the work performance of the team.The question is, are you in this to win? Are you ready to lead a team of winners? Send in your application and we’ll start your journey to success.EssentialGraduate of accounting or any business-related course with 6+ years relevant accounting experience.\nAt least two (2) years supervisory experience.\nExperience with managing service operations and client deliverables.\nExperience in managing staff and/or conducting appraisals.\nActual work experience in the preparation and/or review of working paper files, financial statements with disclosures and other financial information.\nIntermediate Excel skills such as pivot tables, lookup, “if” and other similar functions.\n Experience in e-mail, word processing, presentation, and video conferencing applications such as Microsoft Office.\n Effective written and advance verbal communication skills.\nExperience in using accounting software (Investran software is desired).DesiredDesire to complete Certified Public Accountant qualification, if applicable.\nExperience working in Financial Services or Shared Services office environment. \nExperience working in a multinational office environment.\nOpen to travel and other secondment opportunities abroad.\nUniversity Degree in Accountancy and other accounting-related courses.At IQ-EQ we want you to reach your full potential. We offer an inclusive and diverse environment to support your career aspirations, with a strong emphasis on continuous learning and a holistic approach to your professional and personal development. We also offer opportunities across our service lines and our international network of offices.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}