{
    "Job ID": "69866860",
    "Description": "SummaryThe Logistic Specialist is responsible for overseeing and managing all logistical activities associated with the ENOWA power generation projects, which include solar, wind, geothermal, thermal (grid-connected), and off-grid power generation. The Logistic Specialist ensures the timely and efficient delivery, storage, and movement of materials, equipment, and personnel throughout the design, construction, and operational phases of the project.Key Accountabilities and ResponsibilitiesEngineering Management       Coordinate with suppliers, contractors, and project teams to ensure a smooth flow of materials and equipment as required.\nEvaluate supply chain performance and identify areas for optimization.\nOversee the transportation of materials, equipment, and personnel, ensuring timely deliveries while minimizing costs.\nCoordinate with transport providers, ensuring compliance with safety and environmental regulations.\nMonitor and manage inventory levels at storage sites, ensuring adequate stock while minimizing surplus and obsolescence.\nImplement efficient inventory control methods and systems.\nEnsure all logistical activities adhere to local, national, and international regulations.\nMaintain accurate records of all incoming and outgoing shipments, inventory levels, and transport activities.\nIdentify, evaluate, and collaborate with external logistics providers and vendors.\nNegotiate contracts and service level agreements to secure cost-effective solutions.\nDevelop and manage the logistics budget, monitoring expenditures and identifying cost-saving opportunities.\nProvide periodic cost reports and forecasts to senior management.\nAddress logistical challenges swiftly, devising solutions to prevent disruptions.\nCollaborate with cross-functional teams to troubleshoot and resolve logistical issues.\nProvide regular logistic performance updates to senior management and other relevant parties.Background, SkillsIn-depth understanding of logistics, supply chain management, and transportation principles, preferably within the power generation sector.\nStrong analytical, organizational, and problem-solving skills.\nProficient in logistics software tools and platforms.\nEffective communication and negotiation abilities.\nExperience working in large-scale or giga projects, handling complex logistics requirements.\nOutstanding problem-solving skills, with the ability to identify, analyze, and resolve technical challenges.\nHighly effective communication skills to liaise with internal teams, external partners, and regulatory authorities.\nStrong organizational skills and the ability to manage multiple projects simultaneously.\nStrong leadership skills and ability to work independently and in a team.\nTravels to project sites as needed.QualificationsBachelor's degree in Logistics, Supply Chain Management, Business Administration, or a related field.\nMinimum of 8 years of experience in logistics and supply chain management, with a preference for experience in the power generation sector.\nRelevant professional certifications, such as Certified Supply Chain Professional (CSCP) or Certified in Production and Inventory Management (CPIM), would be beneficial.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}