{"Job ID": "69867664", "Description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.\nYou’ll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio, including Software and Red Hat.\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you’ll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground breaking impact for a wide network of clients. Our culture of evolution and empathy centres on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nYour Role and Responsibilities\nAs a Consultant you will serve as a client-facing practitioner who sells, leads and implements expert services utilizing the breadth of IBM’s offerings and technologies. A successful Consultant is regarded by clients as a trusted business advisor who collaborates to provide innovative solutions used to solve the most challenging business problems.\nYou will work developing solutions that excel at user experience, style, performance, reliability, and scalability to reduce costs and improve profit and shareholder value.Your primary responsibilities include:Evaluating and selecting appropriate tools to improve our teams’ productivity\nModernize our portfolio via migrating / rebuilding current applications on the IBM Cloud.\nBuilding, automating, and releasing solutions on demand\nLeading and prioritizing backlog with guidance from Product Management, Engineering, Support/Operations\nLeading risks and resolving issues that affect release scope, schedule, and quality\nInteract with Client and Business team on requirement gathering and projectRequired Technical and Professional ExpertiseOverall industry experience of 12+ years\nProficiency in Oracle Implementation and Customer Success program and know how to team successfully with Oracle during the delivery process.\nExpertise in implementation and Roll Out Project Experience (European / APAC countries preferred)\nProven ability business process areas preferred (atleast two) – O2C Order to Cash (O2C), Record to Report (R2R), Acquire to Retire (A2R), Procure to Pay (P2P)\nAct as Oracle Cloud domain expert providing best-practice guidance on supply chain business processes and implementation approaches.Preferred Technical and Professional ExpertiseExcellent written and verbal interpersonal skills for coordinating across teams.\nShould have at least 2 end to end implementation experience.\nKnowledge in PPM is an added advantage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kolkata, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}