{
    "Job ID": "69865529",
    "Description": "Aramco energizes the world economy.Aramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer. With our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.Headquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.We are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.Southern Area Production Engineering Department (SAPED) is seeking experienced Petroleum Engineers to work in the Oil/Gas Production Engineering Divisions. As a key member of the oil and gas engineering team, the successful candidate will provide technical support relating to all aspects of oil and gas well activities in actively expanding oil and gas programs, including: well completions, safe operations, production surveillance/optimization, well intervention, and application of new technologies. Also, to have good communication skills to be able to transform the above production engineering activities into presentations, technical papers and reports.Develop and coordinate major studies in any of the Petroleum Engineering areas based upon objectives and requirements established by Management by interpreting scope, initiating new studies or applied technical work as required and directing and performing all phases of the study through formal summary reports and presentation to Management and Owner Company technical personnelConsult with and provides technical guidance to Management and related engineering groups on matters which fall into area of expert technical competence including budget studies, development programs, reservoir studies and equipment purchases and studiesReview activities of various phases of Aramco Petroleum Engineering and Oil Operations activities and reports on adequacy and efficiency of performance. Recommends initiation of or re-direction of new or existing studies and related technical work toward improving operating efficiencies, reduce unit costs and promote better understanding of oil field producing and reservoir behavior and characteristicsServe as consultant in preparing policy recommendations for Management concerning procedures and scope of data and information to be furnished to the Saudi Arabian Government and outside agencies. Makes final review of accuracy and nature of data for release to safeguard Aramco's best interestsKeep current on engineering, research, mechanical and operational procedures and equipment in the United States and other foreign countries and recommends adaptation and application of those that can be used advantageously in Aramco's area of operations. Review work of engineers directed on projects where additional manpower has been assigned. Assists in training and indoctrination of new engineering personnelThe candidate should have between 10 to 15 years of experience as a production engineer in an upstream oil and gas industry.  Have experience in electric submersible pump design, installation and troubleshootingProficiency in PE software applications, including flow simulation, tubing movement, nodal analysis, Buildup and fall off analysis, PTA and production surveillance is required. Also, needs to have well integrity diagnoses experience including corrosion logging analysis and interpretations. Moreover, has an experience in coming up with production optimization ideas. Also, has stimulation and fracturing treatment experienceHas oil, water and gas scale prevention and treatment experience. Also, a good well interventions design and execution experience for both oil and gas wells. Has a good communication skills and has the capability of making technical presentations, writing technical papers and evaluation reportsWorking environmentOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.At Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.We have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}