{"Job ID": "69867543", "Description": "Who are we?talabat is the leading online food and groceries ordering platform in MENA, operating in 9 countries across the region. Founded in 2004 by a small group of entrepreneurs in Kuwait, talabat’s success expanded to the rest of the GCC region, Egypt & Jordan, making it the largest and most popular food ordering app. With over 2,000+ employees and millions of users, we deliver hundreds of thousands of orders every day.We are part of the Delivery Hero network building the next generation of online delivery platforms across the globe. Our network is truly international with engineering teams in 13 countries and operations in 40+ countries.\nRole Summary\nWe are looking to grow our Product Operations team. The role will work with the Shopping tribe closely, focusing on IPM (In product marketing)\nThe goal of Product Operations is to ensure we reduce lead time to value to all our product stakeholders. We do this by aligning with stakeholders, bringing products to markets and optimizing products post-rollout throughout the product development cycle. We also drive key horizontal topics and look to add positive value to the product and tech team here holistically.\n What's on your plate?Oversee the quality assurance checks on all marketing campaigns channeled through our app\n\nIdentify trends and themes in the way we operate campaigns and how to improve further operationally\n\nOptimize products post rollout, to drive continuous improvement\n\nAligning with stakeholders by driving the circulation of Product & Tech deliverables\n\nEnsure functional teams and business stakeholders are aligned to the objectives of your products\n\nSurface insights to Product and Tech and advise further product improvementWhat did we order?Minimum 1 years of experience in operations, business operations, consulting, product, product operations or similar role.\n\nAbility to multitask.\n\nComfortable at dealing with ambiguity.\n\nStrong team player, with an ability to connect people and teams to our company vision.\n\nDrive key processes to enhance daily business and have an ability to prioritise demands in a fast-paced environment.\n\nA proactive mentality and a desire to make an impact.\n\nStrong English skills, in both written and verbal communication.\n\nYou have a voice that is human, personal and matches our Product brand.\n\nAbility to think like a Product user and be invested in our users’ needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}