{"Job ID": "69867038", "Description": "About Jeeny:Jeeny is a Middle Eastern-based mobile application that hosts multiple services to ease daily consumer needs such as transportation, delivery, mobility, and much more on demand with a wallet that spans all services together. Jeeny is a joint venture between MEIG (Middle East Internet Group) - Rocket Internet and IMENA. We have offices in Riyadh, Jeddah, Madinah, Dammam, Khobar, Amman, and Lahore.About the Role:A Marketing Specialist is a key member of our marketing team, responsible for implementing and executing various marketing initiatives to promote Jeeny's services and brand. They will work closely with the marketing manager and other team members to help create and implement marketing campaigns and strategies.We are seeking a Marketing Specialist who is passionate about marketing, highly organized, and capable of handling various marketing tasks. This role will involve executing marketing campaigns, analyzing performance data, and contributing to the overall success of Jeeny's marketing efforts.Roles and responsibilities:Campaign Execution: Assist in the planning and execution of marketing campaigns across various channels, including social media, email, and digital advertising.\nContent Creation: Help create and curate content for marketing materials, such as social media posts, blog articles, and email newsletters.\nMarket Research: Conduct market research to understand customer preferences, industry trends, and competitor activities.\nData Analysis: Analyze marketing campaign performance data and provide insights to improve future initiatives.\nCollaboration: Collaborate with cross-functional teams, including creative, branding, and product, to support marketing efforts.\nEvent Support: Assist in organizing and promoting events, such as product launches or promotional activities.\nReporting: Generate reports on marketing activities and campaign effectiveness.\nCustomer Engagement: Engage with customers on social media and other platforms to build brand loyalty and address inquiries.\nContent Scheduling: Schedule and manage content calendars for various marketing channels.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Marketing", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}