{"Job ID": "69869502", "Description": "Overview Oracle is leading the digital revolution. We are empowering nearly half a million businesses across the globe to turn untapped potential into real business value. You will connect the biggest enterprises of today with the tools to compete in the digital economy of tomorrow.We are building the future of Oracle Cloud in India – in a sense we are building a unicorn business. We are the best technology company, and are rapidly advancing in our journey to become the best Cloud solution provider as well. For setting this vision of ours into action we are in the search of exceptional leaders. Digital Transformation, Security, Analytics are themes adopted by organizations globally. BCP is an additional dimension given the current turn of events. Technology functions, within organizations, are tasked today with having to support their businesses with solutions that can be rolled in hours/days instead of weeks/months. At the heart of this transformation is the growing demand for building cloud native applications, moving enterprise workloads to cloud, establishing resiliency and business continuity, lowering TCO while enhancing experiences and many more. Cloud, that is central to all of these transformations, is disrupting industries, helping business innovate at the speed of thought. Our vision is to be the cloud provider of choice to our clients, in the space we have identified to engage in. Additionally, we would like to be the best Oracle Cloud region globally, gain market share from competition, and reflect the traits of a world class team – client centricity, collaborative approach to problem solving, results orientation, highly skilled and competent, humble, where every individual is respected. About Oracle Cloud Infrastructure (OCI)OCI offers autonomous operations, integrated security, and truly elastic, serverless services in our global public cloud regions or within your data center. OCI offers more than 80 cloud services to migrate, build, and run existing enterprise workloads to new cloud native applications and data platforms. Oracle currently has 44 cloud regions and continuing to grow as one of the fastest expansions of any major cloud provider.DescriptionBehind every successful team is a leader, this role will lead and manage the West region sales team, cloud technology as second line manager. We are in the search of accomplished sales leaders who: Are results oriented – executes for the week without losing sight of the future\nPossesses strong client partnering skills. Has the demonstrated experience of engaging right at C-level to deliver break through insights to clients\nLeads by example\nIs able to guide and lead their team during times of uncertainty\nUnderstands the cloud market, has deep relationships with enterprise clients, is comfortable leading technical discussions with clients, understands Oracle’s cloud value proposition; competitive landscape; and the partner ecosystem. Has a flair for technology, is abreast with all the latest happenings in the Cloud market, and spends time to skill and certify oneself\nInstils trust and credibility with all stake holders – clients, leadership, colleagues, team\nBelieves in the power of collaboration - is able to integrate the whole of Oracle to deliver signature outcomes for the clients\nHelp their team to be ultra-efficient by de-bottlenecking processes and procedures\nIs a talent magnet\nInspires (and not manages) their teams to execute on our vision\nEstablishes an environment where people are invigorated to bring their best selves to work every day\nEnjoys coaching and guiding their team to perform at the peak levels of their capabilities\nBelieves in leading from the frontThe leader will possess 15 years+ experience in leading teams, as a FLM or Second Line Manager, in the IT Sector. She/he should have consistently delivered on business outcomes. Should have demonstrated, from the past, complex solution selling engagements with clients. Experience in having led businesses in the Cloud market is essential. What We’ll Give You A career at Oracle is defined by you. We give you the freedom—and the skills—to write your own success story. Whatever avenue you go down, you’ll gain priceless learning experiences and be supported to do your best work.An Oracle career can span industries, roles, Countries and cultures, giving you the opportunity to flourish in new roles and innovate, while blending work life in. Oracle has thrived through 40+ years of change by innovating and operating with integrity while delivering for the top companies in almost every industry.In order to nurture the talent that makes this happen, we are committed to an inclusive culture that celebrates and values diverse insights and perspectives, a workforce that inspires thought leadership and innovation.Oracle offers a highly competitive suite of Employee Benefits designed on the principles of parity, consistency, and affordability. The overall package includes certain core elements such as Medical, Life Insurance, access to Retirement Planning, and much more. We also encourage our employees to engage in the culture of giving back to the communities where we live and do business.At Oracle, we believe that innovation starts with diversity and inclusion and to create the future we need talent from various backgrounds, perspectives, and abilities. We ensure that individuals with disabilities are provided reasonable accommodation to successfully participate in the job application, interview process, and in potential roles. to perform crucial job functions.That’s why we’re committed to creating a workforce where all individuals can do their best work. It’s when everyone’s voice is heard and valued that we’re inspired to go beyond what’s been done before.Oracle is an Equal Employment Opportunity Employer*. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.* Which includes being a United States Affirmative Action EmployerJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Sales Outsourcing", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}