{"Job ID": "69868522", "Description": "Some careers have more impact than others.If you’re looking for a career where you can make a real impression, join HSBC and discover how valued you’ll be.HSBC is one of the largest banking and financial services organizations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an experienced professional to join our team in the role of GSC HBEG CONTACT CENTREPrincipal responsibilitiesImpact on the BusinessAnswers (or makes) phone calls from our HSBC customers in a polite and friendly way, instilling customer confidence and resolving customer’s issues at first contact where possible.\nDelivers what is promised in line with customer expectations.\nOffers value added products and services based on customer needs analysis and ensures customer understanding of those products.Customers / StakeholdersProvides excellent customer service to basic inbound customer calls by keeping up to date on training and internal communications.\nGenerating customer loyalty through strong knowledge of key products and services.\nOwns and resolves issues and understands how and when to escalate.Leadership & TeamworkActs as a role model for our Group Values and Behaviours (Open, Connected, Dependable), supporting colleagues and customers to deliver superior customer service through these values.\nValues diversity amongst team.Operational Effectiveness & ControlKnowledge of Group compliance, Operational Risk and SOX (Sarbanes- Oxley Requirements) for RBWM Centres.\nMaintains HSBC internal control standards\nAwareness of all elements of Operational Risk associated with the role in compliance to SOX for contact centres.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}