{"Job ID": "69868181", "Description": "General information: You will be assigned role of Offer engineer, reporting to the Engineering Manager, you will support local sales teams and customers by advising on technical and cost-effective GIS layouts. Responsibilities: Knowledge of Power System and Substations is must, specially related to substation layouts, clearances requirement for HV products. Preparation of project layouts based on customer requirements; preference will be for Project / Offer Engineers experienced in GIS / AIS primary Engineering. Communicating with customer, solving technical queries related to Product / Project / layouts. Prepare & release offer drawing of tender enquiries as per the customer specification. Closely coordinate and collaborate with Sales Engineers and Project Engineers as well to furnish correct and optimized offer drawings. Performing diagnostics and analysis to make recommendations for improvement / optimization GIS layouts based on customer needs. Contributing technical details and perspectives in the meeting, proposal and negotiation stages and delivering technical presentations, drawings, and demonstrations on complex layouts. Living core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Data management system shall be followed. Imparting Trainings and knowledge sharing with internal and external customers on areas of specialization. Should have knowledge of the relevant national and international (IEC) standards. Cross functional collaboration and cooperation with team building sprit. Your background: B.E. / B. Tech Electrical with 5-8 years of relevant experience. Preference will be for qualified candidate worked on same / relevant background and GIS Project / Offer Engineering. HV GIS/ HV Product knowledge with knowledge of national & IEC standards. Knowledge of & proficiency in Auto CAD is a must. Knowledge of Pro-E is added advantage. Excellent written and Verbal Communication skills. Presentation skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}