{
    "Job ID": "69869756",
    "Description": "Company:Job Area:General Summary:o   Responsible for power management verification includes Boot, Reset, clock gating, power gating, Voltage/frequency management, limit management and throttling.o   Work closely with design/verification teams within CPU to develop comprehensive test plan.o   Use simulation and formal verification methodologies to execute test plans. Write checkers, assertions and develop stimulus.o   Verify power intent through use of methodologies like UPF.o   Work closely with system architects, software teams and Soc team to validate system use cases.o   Work closely with emulation team to enable verification on emulators and FPGA platforms.o   Debug and triage failures in simulation, emulation and/or Silicon.Minimum Qualifications:Minimum Requirements:o   BE/BTech degree in CS/EE with 5+ years’ experience.o   Experience in power management verification.o   Implementation of assembly and C language embedded firmware.o   Experience in C/C++, scripting languages, Verilog/system Verilog.o   Strong understanding of power management features in CPUs and CPU based Socs.o   Experience in verification of power management features such as clock gating, power gating, UPF, DVFS/DCVS, reliability, throttling etc.Preferred Requirements:o   Good Understanding of CPU architectures and CPU micro-architectures.o   In-depth knowledge of digital logic design, micro-processor, debug feature, and DFT architecture and microarchitectureo   Experience with advanced verification techniques such as formal and assertions is a pluso   Knowledge and verification experience in DFT and structural debug concepts and methodologies: JTAG, IEEE1500, MBIST, scan dump, memory dump is a plus.Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}