{
    "Job ID": "69869804",
    "Description": "Company DescriptionIn India, Bosch is a leading supplier of technology and services in the areas of Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. Additionally, Bosch has in India the largest development center outside Germany, for end-to-end engineering and technology solutions. The Bosch Group operates in India through twelve companies: Bosch Limited – the flagship company of the Bosch Group in India – Bosch Chassis Systems India Private Limited, Bosch Rexroth (India) Private Limited, Bosch Global Software Technologies, Bosch Automotive Electronics India Private Limited, Bosch Electrical Drives India Private Limited, BSH Home Appliances Private Limited, ETAS Automotive India Private Limited, Robert Bosch Automotive Steering Private Limited, Automobility Services and Solutions Private Limited, Newtech Filter India Private Limited and Mivin Engg.Technologies Private Limited. In India, Bosch set-up its manufacturing operation in 1951, which has grown over the years to include 16 manufacturing sites, and seven development and application centers. The Bosch Group in India employs over 30,500 associates and generated consolidated sales of about Rs. 26,827 crores (3.1 billion euros) in fiscal year 2021-22 of which Rs. 24,406 crores (2.8 billion euros) are from consolidated sales to third parties. Bosch Limited is the flagship company of the Bosch Group. It earned revenue of over Rs. 11,782 crores (1.39 billion euros) in fiscal year 2021-22.\nAdditional information can be accessed at www.bosch.inResponsible for leading the planning,execution of projects to collect, store,visualise & analyse data for web based validation solutions by collaborating with cross-functional teams, including component & system engineers, application engineers and business stakeholders, to ensure the successful completion of projects within the agreed scope, time frame, and budgetDetermine Requirements and formulate data acquisition / application approach with CFT\nDefine the use cases and ensure maximum enablement of remote validation through connected solutions\nManage validation (Remote / Field) for PS products / system through appropriate connected solutions\nAssess proactively  and communicate risks, issues, and opportunities to the project stakeholders.\nDefine & implement improvements to the validation process by incorporating feedback and best practices for remote validation through connected solutions\nCollaborate with suppliers and partners to ensure that the connected solutions used in validation, meet the necessary requirements; For eg. Different Telematic devices & protocols\nAssess Competence requirements and mobilise resources Bachelor's degree in Electrical , Electronics , or related fieldExperience:At least 5-7 years of experience in project management or validation of automotive systems or products through web-based solutions\nAt least 5 years of experience working with automotive systems and products\nExperience with web technologies and web-based testing and validation tools and techniquesSkills/CompetenciesUnderstanding of the automotive industry,including knowledge of the latest trends, technology, and regulations\nDeep knowledge of web technologies and web-based solutions , including understanding of web standards, protocols, and frameworks\nStrong background in project management,including the ability to develop and maintain project plans, timelines, and budgets, and lead cross-functional teams\nStrong problem-solving skills ,including the ability to identify and mitigate risks, and to proactively identify and communicate issues and opportunities\nDeep knowledge of automotive systems,power trains, including understanding of their features, functionalities, and inter-dependencies\nDeep understanding of the data pipelines,architecture and cloud components (AWS, Azure)Good knowledge of vehicle communication protocols like CAN,XCP,UDS and interfaces like SENT, LIN\nCommunication and interpersonal skills:Excellent communication skills, to communicate effectively with stakeholders, team members, and partners\nProblem-solving and decision-making: Good analytical skills with the ability to analyze complex problems, assess potential solutions, and make sound recommendations based on data and information\nStrong leadership skills, including the ability to manage and mentor the  team, provide technical guidance and support, and foster a culture of collaboration and continuous improvementJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}