{"Job ID": "69866548", "Description": "IQ-EQ is a leading Investor Services group which combines global expertise with an unwavering focus on client service delivery. We support fund managers, global companies, family offices and private clients operating worldwide.Drawing on your existing experience you will coordinate and execute day to day administrative and legal formalities; meeting our legal and contractual requirements ensuring we comply with Company law. This will include regulated and unregulated Real Estate and Corporate entities including Funds, Trusts and Companies.You’ll be highly organized, pay close attention to detail and know your subject matter as you will be dealing with queries relating to account opening, acquisitions, board resolutions, official publication and also notarial and private deeds, incorporation and liquidations. In addition you will need to monitor invoices and control bank transactions.You will build strong customer relationships with existing and new clients, banks and other external parties, gaining insight into their needs and delivering customer-centric solutions. Presentation skills are essential, as you share your area of expertise internally and with our clients to show  that we are a business that understands the complexities of today's world and demonstrates the strength of our client service delivery.Compliance and regulations has never been more complex; you’ll need to ensure we comply and meet our KYC obligations by preparing, monitoring and maintaining robust client files, safeguarding us from potential risks.You will lead board and shareholders meetings, reviewing related minutes, agreements and documentation.We are never complacent and always encourage our people to look for ways to improve our business; here everyone’s opinion counts and we will value your contribution.Your long-term career goals are important to us too. We want to make sure we’re providing the support and opportunities you need to achieve your dreams so we can build a successful future, together. Master in Corporate, Company or Fiscal Law\nAt least 7 years of significant experience as Corporate Officer/Counsel or Legal Advisor for a Corporate Services Company or in the Financial Industry\nKnowledge of debtor management and of how the client fees are structured\nKnowledge of MS Office and familiarity with relevant computer software (e.g. SAP)\nStrong experience with drafting and managing contracts and other legal documents while ensuring risk mitigation. \n Experience in handling client acceptance procedures / experienced in handling: acquisition of participations, board resolutions, incorporation and liquidation of a company, proxies, advanced knowledge of annual reporting law. Perfect understanding of quality and compliance.\nFluent in English, additional language would be considered an assetAt IQ-EQ we want you to reach your full potential. We offer an inclusive and diverse environment to support your career aspirations. With a strong emphasis on continuous learning and a holistic approach to your professional and personal development. We also offer opportunities across our service lines and our international network of offices.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}