{
    "Job ID": "69865528",
    "Description": "                              \n                                                JD – DGM -Solution DesignBASIC INFORMATION \nPosition Name   DGM – Solution Design\nJob Band   4\n ROLES & RESPONSIBILITIES Job Purpose/Objective   Lead team of experts to understand customer specific supply chain requirements and create customized solutions.Key responsibilities    •   Lead team of experts to understand customer specific supply chain requirements and create customized solutions.\n•   Engage with internal and external stakeholders to co-create solutions \n•   Provide support to sales team in the pursuit of new business, operational implementations, and re-engineering initiatives by reviewing data analytics relating to logistics operations. \n•   Ensure that the team utilizes appropriate software tools for developing, modeling, evaluating, and selecting appropriate solution options for customers. \n•   Leading the customer presentations with required solutions and the key requirements.\n•   Own the process of generating and creating documents for knowledge management based on individual experience of Business Development and projects completed. \n•   Scaling up the customized solutions which lead to creation of the customized products.\n•   To innovate and improve in working practices facilitating to the development of the team methodology \n•   To benchmark and implement the best practice with peer manner and team attitude. For example, development of resource planning, development of Knowledge Management \n•   To act as the internal focal point for access to Logistics Solutions expertise \n•   To ensure that all recommended solutions, implementation plans, meet the requirements\n •   QUALIFICATIONS & COMPETENCIES Skills and Competencies   •   MBA, with or without engineering background, with deep understanding of the Contract Logistics Business\n•   10-15 years of experience in Solution designing.\n•   Hands on knowledge of service solutions across the logistic value chain\n•   Possess excellent communication, team management & interpersonal skills\n•   Advanced Computer Proficiency with rich Experience in solution designing \n•   Understanding of modeling/simulation/CAD tools such as CLASS is desirable. \n•   Know-how of process flow diagrams, time & motion studies \n•   Good interpersonal skills, excellent team building capabilities, planning, co-ordination, and decision-making skills\n•   Demonstration of strong planning skills essential and good project management skills\n•   Good interpersonal skills and ability to effectively work with/coach senior leadership.\n•   Strong desire to improve our service, products, and processes, with ability to drive continuous improvement.\n•   Ability to work across the business to implement and execute change.\n•   Ability to impact organization results through influence across organizational boundaries.\n•   Strong networker, influencer, and team player.\n•   Understanding of upcoming technology for the industryStakeholder   •   Internal: BU’s and Sales Team\n•   External: Customers / External Vendors\n•   Educational Qualification (min)   •    Master’s in business administration, master’s in finance•   Range/ Min no of years - of overall Experience required \n   •    10-15 years\n•   Min no of years of Industry specific experience required, if any & the industry type\n   •    8-10 of experience in logistics industry would be preferredJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}