{
    "Job ID": "69866406",
    "Description": "Req ID:430553 Leading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwideJob TitleEN-DR-32: Mechanical Engineer (ME) – Integration/FittingPurpose of the Job•             Managing Computer Aid Designer (CAD), activities and deliverables on an area in one Mechanical Domain on project in compliance with QCD commitments.•             Applying applicable Mechanical Domain instructions, processes & tools.Position in the OrganisationOrganisation Reporting•             Hierarchical Reporting: (Site) Mechanical Domain Leader (MDL)•             Functional Reporting: Mechanical Lead Engineer (MLE)Network & Links•             Engineering: Design team (other MEs, DLEs, …), TSS, Validation team, Costing Team…•             Project: Train Design Engineer (TDE), Industrial Lead Engineer (ILE), Project Sourcing Manager (PrSM), Project Planning Manager (PrPM), ILS Manager•             Site: Sourcing Department (Buyers), Indus Department, Manufacturing, Quality Department, etc…•             Participating Units & CoE: Mechanical Lead Engineers (MLE) counterparts on the corresponding project(s)/program(s)•             External Interface : Customers, Suppliers, SubcontractorsMissionsPerformance Measurement/KPI’s•             Closure of open points or escalation: 10 days maximum•             Compliance to Engineering WorkPackage  (variation orders excluded): 100%•             Quality of his delivery (included sub-contractor delivery):  1st time quality rate > 90% (quality rate = modification validated OK / number of applied modification)•             Respect of the delivery planning (included sub-contractor delivery) = 100% on time delivery•             Application level of standard PPL = 100%•             Configuration management of his deliverables = 100% of deliverables properly managed into configuration database•             Respect of Cost allocationResponsibilitiesAccountable for:•             Performing 3D, design annotations and 2D deliverables in compliance with QCD commitments, Metier rules and processes.•             Modelling and storing allocated volumes and interfaces for sub-systems / components in Digital Mock-Up.•             Performing Detailed Design on internal sub-systems.•             Filling-up attributes for each part in Digital Mock-Up (naming, material, Fire & Smoke, etc.)•             Verifying consistency of digital mock-up (no clash, etc.) and compliance with requirements (allocated volumes, weight, interfaces, etc.) on assigned scope.•             Preparing and documenting Mechanical Domain Design Reviews•             Updating Digital Mock-Up taking into account Change Requests.•             Checking CADs' and sub-contractor's Design Quality•             Realizing stack-up analysis.•             Realizing Bill of Material.Responsible for:  •             Planning and piloting Mechanical Domain activities of assigned zone and related deliverables on project taking into account applicable instructions/processes and other specific Customer (internal or external) requirements.•             Applying TD rules, processes and tools (single-domain) and ensuring Mechanical Domain deliverables quality and their acceptance by the Customer (internal or external) within committed limits.•             Managing production of deliverables in accordance with Planning targets on Mechanical Domain assigned zone.•             Designing products taking into account project requirements (performances, manufacturability, serviceability, testability, etc.).•             Preparing and documenting Mechanical Domain Design Reviews according to project schedule and following-up the main open actions.•             Checking respect of Allocated volumes/interfaces (no-clashes) on internal design.•             Resolving Project Mechanical issues in assigned zone.•             Reporting on Mechanical Domain activities progress and alerting relevant N+1 in case of issue potentially impacting achievement of QCD commitments.•             Respecting and/or allocating requirements and mechanical interfaces to Sub-Systems/equipments (Allocated volume, weight, location, 3PL, etc.)•             Analysing change request impacts on assigned zone and applying change if request accepted.•             Validating relevant Mechanical Domain deliverables and securing planning.Contributor for:•             Perform quotation of engineering work package, upon request•             Defining Project Mechanical Decomposition (PBS)•             Supporting Sourcing, Industrialization and Manufacturing teams during Production ramp-up.•             Collaborating with MDL for continuous improvement of the Domain (including RoE)Job SpecificationsKnowledge & Experience•             Mechanical Engineering preferably applied to Railway products with 1 to 2 years of experience.•             Good Communications and interpersonal skills including with third parties (customer).•             Time management and reporting skill.•             Sense of urgency / priority.•             Structured and organised with Hands-on approach.•             English operational in read/writing and technical meetings.Team size•             Direct functional reporting : 2 to 5 persons•             Depending on the project size, the scope of accountability represents a workload of up to 10 full time equivalents (with subcontracting)Alstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?  Equal opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected.  All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law. \n Job Type:ExperiencedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}