{"Job ID": "69866252", "Description": "Job Description:Job Title: Client Service OperatorLocation: Mumbai, IndiaRole DescriptionThe Client Service Analyst is responsible for assisting with client issues proactively, efficiently and to the satisfaction of the client, within assigned portfolios.  Typically working under the guidance of the Client Services Manager and/or Client Services Specialist, they provide administrative and analytical support in the daily administration and coordination of assigned clients/accounts; servicing of client enquiries, escalation of client issues, the administration of client service issues including SLA's, preparing client reporting, in some cases assisting with on-boarding activities for new and existing clients and working with Operations to ensure products/services are set up for their client base.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under child care assistance benefit (gender neutral)\nFlexible working arrangements\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesProvide Service and Operations support to the branch customers\nEnsure that DB standards with respect to Customer Service, Compliance, Operations and Corporate Security are adhered to\nEnsure total compliance of al regulatory and compliance guidelines (both internal and external)\nSingle point contact for Branch Operations and ServiceYour Skills and ExperienceOperations Representative at the BranchServiceManage all Branch Customer service related activities\nEnsure that all branch transactions are processed accurately and timely.\nResponsible for maintaining customer complaints/request records at the branches\nResponsible for Overall Customer Service at the branch. Measured through\nCustomer complaints pertains to the branch\nService Request Pending\nOther source of information such as customer service surveyOperations and ControlsManager all Operations related activities at the Branch\nGate keeping for account opening, Demat Account opening , Insurance  and Investment forms\nSuspense Account Monitoring\nDaily Report Monitoring\nKYC Regularisation and KYC Renewal monitoring\nMinimize /control Ops Loss\nConduct training for Sales/Frontline staff on KYC and other key operational processes\nDissimilation of Key Operational circulars to the front office staff\nResponsible for ensuring Fee/Charges from customers are levied for transactions processed at the branches and any exceptions are reported\nEnsure satisfactory audit rating in all internal as well as external auditsBusiness SupportSource leads/referrals from walk-in / existing customers and minimize time lag between referral & closure of business\nEnsure  achievement  as per Service Score Card on deepening the non-qualified customers through customer contact management\nStructured service call for all the new to bank customers and qualified / non-qualified customer baseCostEnsure that Branch Ops and Service related costs are kept as per the budget\nContinuously review cost to ensure cost rationalization is done in terms of Vendor and People Cost.PeopleTraining and Development of Ops and Service ResourcesHow we’ll support youTraining and development to help you excel in your career\nFlexible working to assist you balance your personal priorities\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}