{"Job ID": "69866371", "Description": "IQ-EQ is a leading Investor Services group which combines global expertise with an unwavering focus on client service delivery. We support fund managers, global companies, family offices and private clients operating worldwide.Tired of your daily grind and looking for more opportunities to grow in the accounting field?Be part of a team of goal driven individuals and build an environment of collaborative relationships, focused on delivering consistent results by planning and prioritizing to meet work commitments. Your role will be critical in the review and/or preparation of all reporting requirements such as but not limited to financial statements, working papers/ management accounts, partner statements and ad-hoc client deliverable.EssentialGraduate of accounting or any business-related course with 4+ years relevant accounting experience\nAt least one (1) year supervisory experience\nExperience with managing service operations and client deliverables\nExperience in managing staff and/or conducting appraisals\nActual work experience in the preparation and/or review of working paper files, financial statements with disclosures and other financial information\nIntermediate Excel skills such as pivot tables, lookup, “if” and other similar functions\nExperience in e-mail, word processing and video conferencing applications such as Microsoft Office\nEffective written and advanced verbal communication skills\nExperience in using accounting software (Investran software is desired)DesiredDesire to complete Certified Public Accountant qualification, if applicable.\nExperience working in Financial Services or Shared Services office environment.\nExperience working in a multinational office environment.\nOpen to travel and other secondment opportunities abroad.\nUniversity Degree in Accountancy and other accounting-related courses.At IQ-EQ we want you to reach your full potential. We offer an inclusive and diverse environment to support your career aspirations, with a strong emphasis on continuous learning and a holistic approach to your professional and personal development. We also offer opportunities across our service lines and our international network of offices.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}