{"Job ID": "69869092", "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.At Caterpillar, you build what matters—whether it’s the career you want, crucial work skills, strong relationships, or new digital technologies. There are big jobs to be done worldwide—building critical infrastructure, bolstering local economies, meeting the demand for energy—and that work is powered by our people.Every single Caterpillar employee, including our Financial Services Division team, moves our company forward. Piece by piece, part by part, person by person. Together we create sustainable, world-changing solutions that impact lives around the globe.Position Title: Accounting ManagerJob Location: Bangalore, KA-IndiaJob DescriptionResponsibilities:Ensure timely and accurate processing of payroll/payroll taxes for India payroll employees and International Service Employees.Responsible for the administration employee’s payroll taxes, assuring  proper administration of special payments and deductions made to Caterpillar employees.\nManage relationships with Payroll key business partners and vendors like total rewards team, business unit HR, HR service center.Provide in-depth analysis and act as subject matter advisor to business units on most complex pay and tax issues involving domestic and International Service Employees (e.g., employee investment plan, non-monetary benefits, startup of new facilities or restructuring).Ensure that payroll system and supporting procedures are maintained with adequate control, that legal and tax requirements are met, and that proper interface is maintained with other systems and processes such as time and attendance systems, workday etc. Interpret and provide guidance and assistance regarding pay practices and payroll concerns with consideration for cost optimization opportunities. Provide guidance and assists in the development of new pay practices and requests from business units in accordance to government policies, taxation rules, labor contracts, and local policies and practices.Ensure timely and accurate processing of payroll journals and reconciliations in compliance with the global/country specific policies and procedures.\nCoordinate with the statutory audit/tax auditors to ensure timely completion of audit for in-scope activities.Qualifications and experienceDegree/master’s in accounting or finance.  \n10+ years leadership experience and deep expertise in payroll processing for large corporations.\nStrong business acumen\nExperience with SAP.\nPrior experience in Ramco payroll system will be an advantage.\nFluency in English, understanding and interpretation of the required rules under various statutes related to Labour in India.\n Excellent Leadership and Communication skills to work with a diverse & cross functional team both internal to Caterpillar and external including multiple Government and regulatory agencies.Additional Information:Caterpillar is not currently hiring individuals for this position who now or in the future require sponsorship for employment visa status; however, as a global company, Caterpillar offers many job opportunities outside of the U.S. which can be found through our employment website at www.caterpillar.com/careers\n\nCaterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}