{
    "Job ID": "69869885",
    "Description": "Robert Bosch Engineering and Business Solutions Private Limited (RBEI), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.\n\nWith over 18000 associates, RBEI is the largest software development center of Bosch outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence in US, Europe and the Asia Pacific region. RBEI is ISO 9001:2008 certified (2012), appraised at CMMI-L5 as per version 1.3 (2011), ASPICE - level3 based on version 2.5 and ISO 15504- 5 and 7, and also ISO 27001 with seven state-of-the-art facilities spread across Bangalore and Coimbatore in India, Ho Chi Minh City in Vietnam and Guadalajara in Mexico, ISO/IEC 20000-1:2011 certified (2014).\n\nWe nurture, build and sustain enduring customer relationships to enable direct operational and strategic benefits to our customers. We make it happen through qualified, motivated and flexible professional associates, who uphold the heritage and values of Bosch - time-tested over 125 years of a successful journey; a journey marked by quality, reliability and innovation of service to enhance the interest of our customers and the community we live in.\n\nWe provide solutions for businesses in primarily three areas:\n\n•Engineering Services\n•IT services\n•Business services\n\nOur focal industries:\n\n•Automotive industry\n•Industrial Technology\n•Consumer Goods and Building TechnologyShould have experience in BLE/UWB/NFC technologiesGood knowledge in Autosar Application DevelopmentGood knowledge in SW Development processWorking experience in TI, NXP chips would be an added advantageExperience in safety(ASIL) standardsB-Tech/M-Techexperience level 6+ yearsEnd-to-End Knowledge in Automotive domainHigh functional understanding, structured working methodVery good communication skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}