{"Job ID": "69867071", "Description": "Why Birdeye?Once upon a time, local businesses could attract customers through advertising and word of mouth. However, that has all changed. Today consumers choose where to spend their money based on online reputation and digital experiences. Modern companies must deliver exceptional experiences that create repeat customers and need a platform that can do this at scale. Local businesses often need help to overcome the complexity and inefficiencies of using multiple applications to manage and optimize their marketing and customer experience operations. Their use of fragmented point solutions keeps them from achieving true customer insights and acting upon them in real time.This is the challenge that Birdeye solves with its all-in-one reputation and customer experience platform. More than 100,000 local businesses and brands use Birdeye to be found online through local listings and reviews; engage with consumers through webchat, text, and social media messaging; collect digital payments; and gain insights to improve customer experience with survey, ticketing and benchmarking tools.Birdeye is the leading all-in-one platform trusted by over 100,000 businesses of all sizes to manage online reputation, connect with customers, and generate insights. Founded in 2012 by Naveen (the 2021 EY Entrepreneur of the Year) and Neeraj Gupta, Birdeye is based in Palo Alto, CA, and backed by investors Marc Benioff, Jerry Yang, and Accel-KKR. Learn more at birdeye.com.Job Summary:We are seeking a highly skilled and experienced Visual Designer to join our team. The ideal candidate will have a strong background in brand and marketing design. In this role, you will be responsible for creating visually stunning, world-class, and highly functional creatives that engage and inspire our clients and their customers with beautiful and simple designs.Key Responsibilities:Ideate and shape extraordinary, high-performing, interactive brand experiences on the company prospect facing digital properties.\nMake design decisions with a deep understanding of the customer persona\nCollaborate with marketers, product marketers, project managers, developers, and other stakeholders to ensure smooth and efficient project delivery.\nKeep up to date with the latest design trends and emerging technologies in web design and development.\nDevelop and maintain design standards and guidelines\nUse all the latest technologies, have an acute attention to detail, and work fast to deliver high-quality work within tight deadlines.\nManage multiple projects simultaneously and prioritize workload to\nallocated effectively.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Marketing", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}