{
    "Job ID": "69867189",
    "Description": "A luxury hospitality brand for modern travelers, Anantara connects guests to genuine places, people and stories through personal experiences and providing heartfelt hospitality in the world’s most exciting destinations. From pristine islands and tropical beaches to cosmopolitan cities, tranquil deserts and lush jungles, Anantara welcomes guests for journeys rich in discovery.Responsible for the Leisure segment (all source markets) at Qasr Al Sarab Desert Resort by Anantara, Desert Islands Resort & Spa by Anantara, Anantara Al Sahel Villa Resort and Anantara Al Yamm Villa Resort\nDevelop a leisure sales strategy and plan by analyzing historical, current and future hotel/market trends under the guidance of the department leadership.\nCreate selling strategies to capture the maximum amount of revenue for Cluster properties.\nSolicit new business opportunities from international tour operators, retail travel agents and wholesalers through sound business practices.\nMaintain a personal up-to-date knowledge on all assigned product and service offerings, as well as the products, services, rates and new developments of key competitors, and an awareness of general industry trends of Abu Dhabi, UAE and globally.\nApproach personal sales activities from a strategic perspective, understanding the relative importance and priority of the current account base, and directing personal sales efforts accordingly.\nProspect from various sources to expand existing account portfolio.\nNurture to maintain existing client relationships to ensure repeat business.\nDemonstrate professional presentation skills at Industry Trade Shows, Sales Events and Networking functions.\nTravel to conduct domestic and international sales calls as indicated by the annual Sales Budget and report on each trip via pre and post travel reports.\nOrganize and participate in meet & greet and entertainments for familiarization trips for domestic and international business partners.\nCommunicate all client information to the appropriate departments and conduct pre-arrival internal meetings when necessary.\nPrepare daily / weekly / monthly activity and fortnight production reports for the Cluster Director of Sales\nAssist in pricing decisions and the development of the annual budget for the leisure transient segment(s).\nResearch to modify existing or develop new wholesale contracts as needed based on hotel and/or market conditions.\nRecommend and coordinate deployment of any promotions as may be necessary.\nWork with the marketing team to develop marketing strategies for the assigned leisure transient segment(s).\nAttend and potentially present information for internal and external meetings as assigned.\nExecute additional projects as assigned by the Cluster Director of Sales.\nContinually review the actual production of each account against the potential for that account and review suggestions for improvement with department leadership.\nFocus on assertively establishing new client contacts and developing detailed information on the potential revenues from these accounts.\nAchieve personal financial and non-financial performance objectives, working with department leadership to ensure these objectives are met.\nTake ownership for your professional development, ensuring that you have the financial literacy, negotiation and face-to-face selling skills needed to succeed in your role.\nMaintain accurate management status reporting on business results and associated action planning.\nEnsure that all administration is processed professionally, efficiently and in a timely manner.Sales experience in luxury hotel chain is a must\nLocal UAE market experience is a plus\nBachelor Degree in any related field\nGood command of spoken and written English, \nPreferably western language skills, e.g., Spanish, Italian, French or German\nExcellent computer skills (Microsoft Word, Excel, Outlook Express, Internet, e-mail)\nPositive attitude with excellent interpersonal skill and strong leadership\nWith UAE Drivers LicenseRelocate to remote areaJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}