{
    "Job ID": "69866320",
    "Description": "Job Number 23167245 Job Category Food and Beverage & Culinary Location Ajman Saray a Luxury Collection Resort Ajman, Sheikh Humaid Bin Rashid Al Nuaimi Street, Ajman, United Arab Emirates, United Arab Emirates VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Greet guests and determine the number in their party. Seat guests by finding a clean, available table; pulling out chairs; placing clean/current menu in front of guest, etc. Guide guests through the dining rooms and provide any needed assistance. Move and arrange tables, chairs, and settings and organize seating for groups with special needs. Ensure place settings are appropriate and each guest has a napkin, clean silverware, and any other item that is part of the standard place setting. Check menus to ensure they are current, clean, plentiful, and wrinkle-free. Maintain cleanliness of work areas throughout the day, practicing clean-as-you-go procedures. Monitor dining rooms for seating availability, service, safety, and well being of guests. Follow all company and safety and security policies and procedures; report accidents, injuries, and unsafe work conditions to manager; and complete safety training and certifications. Ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Welcome and acknowledge all guests according to company standards. Speak with others using clear and professional language, and answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards. Stand, sit, or walk for an extended period of time. Move, lift, carry, push, pull, and place objects weighing less than or equal to 10 pounds without assistance. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. The Luxury Collection Hotels & Resorts, with over 120 properties in more than 35 countries, offers the promise of authentic experiences that evoke lasting, treasured memories. Our more than 100 years of experience, beginning in 1906 under the Italian CIGA brand – a collection of Europe's most celebrated and iconic properties – serves as a solid foundation as we continuously evolve to exceed the desires of the luxury traveler. From legendary palaces and remote retreats to timeless modern classics, each luxury hotel and resort is a unique and cherished expression of its locale – a portal to the destination’s cultural charms and treasures. If you are someone with an appreciation for evocative storytelling, a keen interest and passion for this destination's heritage, and a desire to deliver genuine, personalized, and anticipatory hospitality, then we invite you on our journey. In joining The Luxury Collection, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Ajman, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}