{"Job ID": "69867254", "Description": "Terviva India Pvt LimitedPosition: Procurement ManagerReports to: Procurement HeadLocation- MumbaiSalary range- 15-30 LPAJob Type: Full-TimeFEMALE CANDIDATES ARE PREFERREDOVERALL JOB PURPOSEPrimarily responsible for providing all requisite technical inputs and support to model creation and field scale interventions with internal and external customers in the domain of distribution, availabilities, procurement strategy and processing feasibilities of Pongamia beans in India. The primary focus of this position is to roll out technical interventions and build technical capacities of stakeholders – viz. Community resource persons, farmers, self-help groups, supply and processing partners. He will be responsible to manage and execute the forecasts for feedstock procurement and ensure that timelines are effectively followed to meet the purchase requirements of the business in national level. To efficiently manage stocks in terms of volume and cost and manage risk associated with current market conditions to ensure security of supply. To maintain and improve quality, developing company’s brand, and strengthening the link between TerViva and bean gatherers/ suppliers/ partners in all the potential states of India.ROLES AND RESPONSIBILITIESProcurementManage the procurement of Pongamia pods, beans & other value added products.\nIdentification of potential bean cluster area in different states with the historical procurement statistics.\nPlanning and coordination with field functionaries for pre-harvest position of Pongamia beans through visits and updates from potential bean gatherers & suppliers.\nWork closely with the government departments like forest, tribal welfare and agriculture for facilitate the procurement and logistics planning of the produce.\nHe will support regional procurement staffs, logistic persons and certifying agencies during and after the procurement season.\nManage and execute forecasts for feedstock procurement for each season based on company’s annual demand forecast, to ensure supply security and timelines.\nMonitor contracts/ purchase orders against requirements by product, quality, blend, by month, by Supplier Group, resolving any issues that arise.\nDeveloping rapport with the bean supply agencies and bean processing industries for achieving desired goals on a long term basis.\nBe commercially minded when negotiating quality differentials and price in order to obtain best deal for TerViva and suppliers.\nSupport TerViva’s price risk strategy by providing timely and important market information.\nProactively manage feedstock to ensure efficient stock levels at any time depending on latest supply and demand.Partnership with Bean Gatherers/Suppliers/ PartnersLead and organise pre-season Pongamia market survey and business updates for all gatherer/ supplier/ partner groups prior to season’s harvest\nDemonstrate an understanding of the challenges faced by the pod gatherers, gather systematic supplier feedback, and represent their interests\nMeeting with bean gatherers/suppliers/ Partners regularly in their locations and ensure high quality information flows between their organisations and TerViva\nConstantly assess harvests, demand in origin from other markets, and local knowledge, including significant environmental, political and economic factors which may impact the planning processTechnical SupportSeek requisite technical inputs and understanding from technical specialists of TerViva Inc. to promote best practices for procurement, handling and processing of beans in India.\nUndertake mobilization training session with the bean gatherers and support staffs as per the training calendar and be responsible of for implementation of company’s procurement policies with active support from higher authorities.\nWorking under administrative guidance of the Sr. Vice President\nUnderstanding issues and problems faced in the field, aggregate and seek advice from senior colleagues as per requirement.\nTo ensure technical support for quality assurance and quality check of the entire purchase and export quantities of beans.\nProvide Quality Control management services for pre- and post-shipment sampling to ensure consistency of raw material quality to meet TerViva’s standards\nAssist in the development of quality enhancement programs for bean gatherers/suppliers/ partners in order to achieve consistent quality, reliability in supply (continuity), in the context of forest/ environmental sensitivities\nTo ensure that the target number of potential areas are developed through regular interaction with the technical authorities of government, technical institutions and relevant industries.Minimizing Environmental ImpactDrawing experience at origin and at point of feedstock procurement, encourage environment friendly and efficient methods of procurement of Pongamia pods/beans.\nWork with villagers to encourage environmentally sustainable production, support suppliers to strengthen the positive impact they have on the environment, and to use these actions to bolster their livelihoods.Other responsibilitiesBe accountable for timely accomplishment of responsibilities under his thematic operational area line items with respect to the bean procurement and export and other work areas.\nRaise purchase requests in consultation with the supervisors, for products and services deemed necessary towards undertaking prior approved budgeted activities.\nSupport USA team and associates in designing the procurement and logistic plans and sourcing best technical expertise as and when required.\nPerform any other task assigned by the line manager as per company’s requirement.PERSON SPECIFICATIONSkills and KnowledgeDeep understanding of Procurement of Agricultural & Forest produce\nTechnical Degree or equivalent e.g.: Master degree in Agroforestry/ Agriculture/ Forestry with Business Management.\nExperience of working in a large project and as part of a diverse team desirable.\nExperience in supporting and handholding farmers in adopting and adapting to best practices and new products.\nFamiliarity with all the agro-climatic conditions of India.\nStrong facilitation/ training and communication skills\nWillingness to learn from and replicate best practices from elsewhere.\nFinancial Knowledge\nPrice Risk Management\nInternational Business\nFutures and Options in the Agro market\nExperience working with Smallholder producers, suppliers, and wholesalers, at origin\nProject management skillsPersonal QualitiesPassion for Agriculture & Forestry\nUnderstanding of tribal development and gender dimensions within climate smart agriculture and MFP procurement domains.\nAbility to work in a team and build capacity and connect to community stakeholders.\nCommercially Minded – keen to grow business (purchase, market share, profits)\nAbility to deliver innovative, creative solutions\nCommunicates with impact\nCompassionate and respectful of all people\nComfortable operating in a changing world, without clear structures, policies, and procedures\nChallenging - of business/partners to secure what we need to deliver\nDynamic – relentless in pursuit of KPI delivery, acting with pace and urgency\nHigh level of integrity and honesty.\nAdaptable and flexible\nResults-focused – Proactive-Takes the initiative- Doesn’t need ‘managing’\nLanguage skills (Spoken):English (Must)\nHindi (Good to know. Basic level is acceptable)Other regional languages (Good to know. Basic level is acceptable)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}