{"Job ID": "69866220", "Description": "Job Description:Job Title - IT Application Owner, AVPLocation – Bangalore, IndiaRole Description:The IT Application Owner (ITAO) has sound IT risk management skills. They follow one of a number of possible service delivery approaches, acknowledge interference with the IT application’s life cycle and assist with incorporating the adopted approach into best practice.The ITAO is aware of the gap in the current infrastructure solutions and where industry innovations are along the maturity lifecycle. They work with application stakeholders to improve the infrastructure, ensuring compliance with the technical roadmap.The ITAO has a sound knowledge of development methodologies and the IT policies necessary to perform effectively in the organisation, aligned to the bank’s appetite for risk.They act to improve safety and security of the application, compliance with regulations, policies and standards, enhance operational readiness, and ease maintenance of the environment for delivering change into production.The ITAO supports the bank’s audit function in the remediation of audit points and self-identified issues in order to reduce risk.  They are responsible for producing and maintaining accurate documentation on compliance with methodologies, IT policies and IT security requirements. The ITAO interacts with and influences colleagues on the governance of IT platform reliability and resilience.Overview:The applicant will act as an Application Owner for set of applications in Global Markets space. The Application Owner (AO) is accountable for the Application Management of a single or a portfolio of applications. The AO must ensure that the application(s) are enhanced and maintained in accordance with the Bank’s IT Security Risk and Compliance requirements of the client and other stakeholders as included in the application strategy and service levels. The AO identifies and manages the risks and issues associated with the application(s) and escalates appropriately. This position is based out of India Service Centre, BangaloreWhat we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilities:The Application Owner is in charge of a broad set of duties. On one hand an AO has a management responsibility for an application instance. On the other hand the AO is requested to provide detailed administrative information in self-assessments to comply with the IT Policies & Standards.The following are typically some of the tasks for which an AO is responsible for:Facilitate Disaster Recovery activities by reviewing DR plans and coordinating the execution of DR exercise for the application.\nManage Internal and external application audits and Audit issue remediation activities.\nManage remediation of gaps in application lifecycle management activities such as Account recertification, remediation of Application configuration gaps etc.Manage application related Risk and Compliance Evaluation tasks and resolution of gaps in this area.\nManage any IT Security incidents that may occur in the application.\nPlan and Manage Application Events and Database Events monitoring using Bank wide standard monitoring tools.\nManage application capacity forecasting and monitoring.\nPlan and manage Application user access related tasks.\nPlan for Application Hardware / Software / License upgrades\nRemediation activities\nProblem/Release Management\nParticipate and Manage Project Delivery\nInvolve in project management tasks end to end.\nTechnology Roadmap Compliance - align to Bank’s 2020 strategy.\nDefines application services in collaboration with stakeholders.\nFacilitating L0 estimates, reviewing the functional/technical design.\n Your skills and experience:Excellent communication and influencing skills.\nOpen minded\nAbility to work in fast paced environment.\nAbility to manage the expectations of stakeholders.\nPassion about sharing knowledge and best practice.\nAbility to work in virtual teams and in matrix organizations.\nProven project management and people management skills\nFluent English (written/verbal)Business CompetenciesExposure to Banking Domain\nChange Leadership\nIndustry Knowledge\nTransition/Transformation experience\nRisk ManagementTechnical CompetenciesApplication Architecture\nSoftware Technology tools (Unix, Java, Databases – Oracle, Sybase,\nWeb concepts)\nIT Security, Risk & Compliance\nSystems Development Lifecycle\nDev-Ops tools/concepts\nITIL understanding.How we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}