{"Job ID": "69868284", "Description": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and ResponsibilitiesResponsible to design, develop and/or re-engineer highly complex application components and integrate software packages, programs and reusable objects residing on multiple platforms.\nResponsible to Designs, development of applications in one or more of the areas like SAP Portal, SAP Fiori, SAP UI5, SAP Mobile Platform (SMP), SAP Cloud Platform Mobile Services (SCPMs).\nCustomization to standard application in case required.\nExperience in working in Implementation, Upgrade, Maintenance and Postproduction support projects would be an advantage\nPractitioner must willing to travel to client location for the Project duration\nAbility to create Screens, Controllers, OData DPC and MPC. Hands-on HTML5, JS, CSS3 coding experience. SAP Web IDE, SAP Frontend Server Experience.Required Technical and Professional ExpertiseBE / B Tech in any stream, M.Sc. (Computer Science/IT) / M.C.A, Min. 5-6 years of work experience in SAP Portal, SAP Fiori, SAP UI5, SAP Mobile Platform (SMP), SAP Cloud Platform Mobile Services (SCPMs\nExperience in Business Application Programming Interface and XI (Exchange Infrastructure) and Extensive experience in SAPUI5 application development\nExperience in MVC framework for UI, SAPUI5, HTML5, and JavaScript and Expertise in SAPUI5 controls and Fiori Design patterns\nUnderstanding of SAP functional requirement, conversion into technical design and development using ABAP Language for Report, Interface, Conversion, Enhancement and Forms in implementation or support project:Minimum 3-4 implementation experience\nExpertise in Fiori application and system architecture and Exposure in SAP Fiori Launchpad configuration and app integrationPreferred Technical and Professional ExpertiseCement industry business knowledge is preferable\nKnowledge and experience on SAP Workflow and Good experience in OData.\nUnderstanding of SAP functional requirement, conversion into technical design and development using ABAP Language for Report, Interface, Conversion, Enhancement and Forms in implementation or support project: Minimum 3-4 implementation experienceJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}