{"Job ID": "69866703", "Description": "Work from home with Amazon Customer Service!Role: Customer Service AssociateLocation: What will you do as a Customer Service Associate?What strengths will you bring?Hard-working, articulate, and detail-oriented\nFriendly and customer-focused in every situation\nAbility to learn quickly and embrace change\nComfortable multi-tasking in a high-energy environment.What benefits will you receive?Pension plan\nInternet allowance\nLifestyle benefits and retail discounts through our Amazon Extras program\nExpert training and ongoing opportunities to learn more and develop your skillsIf this role sounds like it’s for you, then click Apply to start the application process!Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.What qualifications do we need from you? Minimum age: 18 years old\nHave the right to work in India\nStrong communication skills in English and Bengali.\nExperience working with a computer\nWillingness and ability to work in rotating shifts (i.e. early, late, overnight, weekend, and overtime as required)\nYou'll need a quiet, distraction free work space (dedicated office space with a desk and chair)\nFrom a technical perspective, a minimum broadband connection of 20MB download speed and 8MP upload speed using a hard-wire ethernet internet connection (no WIFI).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}