{"Job ID": "69866228", "Description": "Summary of Position:Alcon is looking to hire a Senior Analyst-Business Planning and Analysis to join our Business Planning and Analysis team at Bangalore in India. The Financial Planning and Analysis Senior Analyst provides analytical, operational & strategic support for the financial performance of the assigned business scope. She/he supports the management and coordination of the company’s budgeting and forecasting process, the analysis and review of consolidated financial data and for driving a strong discipline on financial management and investment decisions within the business. Key customers for the Global Center BPA (Business Planning and Analysis) are both Heads of Finance and key Business Associates in the assigned business scope.Key Responsibilities:Manage Planning process with high degree of accuracy: Long Range Planning, Budget, and Forecasting. Proactively advice on early warnings/opportunities to supported finance and business teams.\nEnsure accountability to established objectives through tracking of actual results and highlight root cause events of variances. Drive existing management reporting. Analyze financial results, distill and synthesize issues, communicate key messages to supported finance and business teams to allow adoption of corrective actions, as necessary\nDirectly contribute to the achievement of Alcon financial objectives (Sales, Profit and Cash Flow) through financial analysis to support operational decision making for the business in scope\nParticipate in ad-hoc projects and ad hoc analysis as assigned.\nDisciplined use of financial systems (ASPIRE, APMR, SAP, etc.) to manage and perform analytical analysis of financial results\nDevelop / deploy / maintain innovative decision support tools and technologies that enhance the depth, breadth, speed and efficiency of the decision support capabilities.Key Requirements/Minimum Qualifications:Bachelor degree + 5years of Financial Planning and Analysis experience OR Master degree + 3years of Financial Planning and Analysis experience Finance operational Experience\nShared services experience is a plusShift Timings: Should be flexible to work in any shift between 8 am to 11pm Preferred Qualifications/Skills/Experience:Chartered accountants are preferredEmployment scams: Alcon is aware of employment scams which make false use of our company name or leader’s names to defraud job seekers. Alcon does not offer any positions without interview and never asks candidates for money. All our current job openings are displayed here on the Careers section of our website, where you can search for open positions and apply directly.If you have encountered a job posting or been approached with a job offer that you suspect may be fraudulent, we strongly recommend you do not respond, send money or personal information, and check our website for current job openings.Alcon is an Equal Opportunity Employer and takes pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital status, disability, or any other reason.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}