{
    "Job ID": "69866028",
    "Description": "Job Responsibilities:  Develop business knowledge of the functional area and processes to understand customer needs, behaviors, data and systems information to support Call Center functions.\nChange delivery, solution management, analysis, testing and client communications., Collaborate with partners on the creation of business case benefits.\nCreate solution support documentation including process workflows, solution interaction flows (call flows), and design documents, Perform solution testing in change delivery and production validation.\nFollow and maintain current processes and procedures keeping in line with structured controls.\nIdentify recommendations to improve solution & customer experience, targeting customer & operational efficiency gains.\nAssist the Area Product Owner in taking data backed / fact-based decisions by ensuring comprehensive research / discovery of project benefits, Participate in / lead scrum team discussions ensuring high quality and effective delivery. \nBe “On-Call” to join urgent / high priority production issues as part of the product team and work closely with resolvers to mitigate the issue.Required Qualifications, Skills and CapabilitiesExperience of Project management methodology to include waterfall and Agile.\nAwareness of the software development lifecycle and ability to explain business needs to development / IT and vice versa teams accurately and effectively.\nExperience in Analysis, Business Management, or IT preferred\nAbility to upskill to latest technologies being used.\nExperience with Problem Identification & Problem Resolution.\nAbility to create visual flows.\nClient servicing skills, strong teamwork ability, customer engagement skills and self-starting action required.Preferred Qualifications, Skills and Capabilities2+ years working knowledge of Contact Center operations and technology solutions preferred.\nExperience in process workflow creation a plus, Requirement’s analysis experience preferred.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}