{"Job ID": "69866086", "Description": "As the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.You're an Individual. We're the team for you. Together, let's transform the way the world pays.For Senior Manager Data Science role in the Middle East and North Africa (MENA) Data Science team, we are seeking an innovative and analytical thinker to champion our data-driven strategies within the region. As a Data Science Senior Manager, you will participate in business development, build predictive and prescriptive models, and develop context-based prototypes and high-impact storyboards that promote data-driven strategies and solutions for Visa clients. This role is dedicated exclusively to working for on a key client account based in the Saudi market.Principal ResponsibilitiesIdentify innovation opportunities around data and data-related processes that will help our clients implement fact-based decisioning processes within their cards and payments program\nWork entails heavy focus on transaction data modelling and analytics for cards and payments products Work with a broader team that consists of Business Managers, Consultants and Data Scientists from both Visa and client organizations to strategies, co-create, deploy, and reap the benefits of data-driven solutions.\nWork with regional and global Data Science teams to develop high-quality analytic products and solutions that promote Visa’s growth in the region.\nKeep Visa at the forefront of technological advancement in Data Science by introducing cutting-edge tools and techniques for generating business insights\nDevelop next-generation analytic methods where existing tools and techniques are inadequate to address business challenges\nReview, direct, guide, and inspire the analytical work of junior members in the team\nCollaborate with internal Technology partners and Data Engineering function to best leverage Visa’s internal technology platforms, data, and the broader Visa ecosystem to support our clients’ technical data needs\nManage workload for self and any direct reports, providing prioritization guidance for project flow to improve process efficiency.\nManage and grow talent within the team.\nDevelop, share, and build global best practices and knowledge management within the team\nSocialize innovative ideas and approaches that are scalable and have market demand\nChampion internal requirements around Model Risk Management, Visa Analytics Rules, and Global Privacy standards around client delivery to ensure that Visa’s highly regarded market standing is maintainedMinimum of 10+ years of expertise in applying Machine Learning solutions to business problems – model development and production experience required\nPost-graduate degree (Masters or PhD) in a quantitative field such as Statistics, Mathematics, Data Science, Operational Research, Computer Science, Informatics, Economics, or Engineering\nExperience working in one or more of the Card & Payments markets around the globe; with specific responsibilities in payments, retail banking, or retail merchant industries\nGood understanding of Payments and the Banking industry, including card verticals such as consumer credit, consumer debit, prepaid, small business, commercial and co-branded product\nExpert knowledge of data, market intelligence, business intelligence, and AI-driven tools and technologies, with demonstrated ability to incorporate new techniques to solve business problems\nExperience planning, organizing, and managing multiple large projects with diverse cross-functional teams, including resource planning and delivery implementation Experience in presenting ideas and analysis to stakeholders whilst tailoring data-driven results to various audience levels\nProven ability to deliver results within committed scope, timeline, and budget\nVery strong people/project management skills and experience\nAbility to travel within MENA on short noticeTechnical ExpertiseExpertise in distributed computing environments / big data platforms (Hadoop, Elasticsearch, etc.) as well as common database systems and value stores (SQL, Hive, HBase, etc.)\nFamiliarity with both common computing environments (e.g., Linux, Shell Scripting) and commonly used IDE’s (Jupyter Notebooks); proficiency in SAS technologies and techniques\nStrong programming ability in different programming languages such as Python, R, Scala, Java, Matlab, C++, and SQL\nExperience in drafting solution architecture frameworks that rely on API’s and micro-services\nProficient in some or all of the following techniques: Linear & Logistic Regression, Decision Trees, Random Forests, K-Nearest Neighbors, Markov Chain Monte Carlo, Gibbs Sampling, Evolutionary Algorithms (e.g. Genetic Algorithms, Genetic Programming), Support Vector Machines, Neural Networks, etc.\nExpert knowledge of advanced data mining and statistical modeling techniques, including Predictive modeling (e.g., binomial, and multinomial regression, ANOVA); Classification techniques (e.g., Clustering, Principal Component Analysis, factor analysis); Decision Tree techniques (e.g., CART, CHAID)Leadership CompetenciesDemonstrates integrity, maturity, and a constructive approach to business challenges\nServes as a role model for the organization by implementing core Visa Values\nShows respect for individuals at all levels in the workplace\nStrives for excellence and extraordinary results\nUses sound insights and judgments to make informed decisions in line with business strategy and needs\nAble to allocate tasks and resources across multiple lines of businesses and geographies\nAble to influence senior management both within and outside Data Science\nSuccessfully persuading internal stakeholders to commit to best-in-class solutions, when required\nLeverages change management leadership as requiredVisa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}