{"Job ID": "69865985", "Description": "Requisition ID: 271820 Relocation Authorized: None \nTelework Type: Part-Time Telework \nWork Location: New Delhi Background:Bechtel is a believed engineering, construction and project management partner to industry and government. Differentiated by the quality of our people and our relentless drive to deliver the most successful outcomes, we align our capabilities to our customers’ objectives to create a lasting positive impact. Since 1898, we have helped customers complete more than 25,000 projects in 160 countries, on every continent, that have created jobs, grown economies, improved the resiliency of the world's infrastructure, increased access to energy, resources, and vital services, and made the world safer and cleaner.Corporate Startup Automation has the responsibility to support all the software tools used by Commissioning and Startup personnel on projects while identifying, evaluating and implementing new ways to improve work processes through data and software automation. Startup Automation exists within the wider corporate-level EPC Functions Automation Organization and is seeking to develop the talent pool of Automation Professionals and Startup Engineers equipped for a digital future to support our projects safety and efficiently execute Pre-commissioning, Commissioning, Startup and Operations of major facilities across our Global Business Units of Oil, Gas & Chemicals, Mining and Metals, Infrastructure, and Nuclear & Security.Position Summary: The Automation Developer will be actively involved in the development and deployment of software applications used by Construction and Startup personnel on projects. The ideal candidate will possess the following leadership behaviors aligned with Bechtel’s Behavioral Framework:Accountable: Takes accountability for making their own decisions linked to their own deliverables. Involves senior members to discuss their plan of actions and key decisions at the right time.\nCollaborate: Actively seeks out others’ opinions and input and is open-minded to their views. Challenges others appropriately and is also open to being disputed on their own views. \nCommunicate: Is effective at adapting their communication style appropriately to their audience, providing context and using the right tone and level of information. \nCustomer Focus: Prioritizes the customer needs and puts these at the forefront of all interactions. Ensures that others within their team maintain this same approach.\nDeliver: Demonstrates making well thought out, timely decisions and prioritization that leads to successful outcomes. Includes the right people at the right time. \nProblem Solve: Accurately assesses a situation to find the best solution or way of working in order to resolve the issues. Is focused on creating a long term fix rather than a short-term solution.\nRole Model: Contributes to the Bechtel culture by inspiring and motivating others through their positive approach and attitude. Comes to work determined to do a good job, for themselves and for their team.Responsibilities: Integral part of the work team helping to improve the digitalization of Bechtel’s work processes.\nEvaluate among different tools and selects suitable software solutions to meet the needs of our end users with a bias for finding long term solutions that can be applied across multiple projects rather than short term fixes.\nWrites SQL queries against MS SQL databases to pull together and manipulate information from different tables and sources to create custom views that are used in reports and other tools.\nWrites SQL DML statements to update, insert and delete data to help support custom applications.\nWrites SQL DDL statements to create and alter tables and views to help support custom applications.\nWrites SQL Stored Procedures to help support custom applications.\nWrites C# based .NET custom applications.\nCompiles and drafts content for technical user manuals, software training videos, training presentations.Supervision Given/Received: Daily supervision by Product Owner – SmartCompletions and assigned to the Digital Delivery Organization.Basic Qualifications: BE or BS Degree in Engineering, Information Technology, Computer Science, or related Technical Degree with 3 to 6 years’ experience.Minimum Qualifications: Experience with SQL Server database systems.\nExperience in Database tools including SSMS.\nExperience in developing complex SQL queries.\nExperience in developing SQL stored procedures and cursor configuration.\nExcellent communication and problem-solving ability.\nExperience in developing C# based .NET application.Preferred Qualifications: Experience with developing in Xamarin.\nExperience with developing in ASP.Net.\nExperience with or exposure to Microsoft Access and Oracle Database.\nExperience with or exposure to configure Power BI and SSRS.\nExperience with or exposure to configure Microsoft Power Apps and Power Automate.Hybrid mode - 2 days per week in officeLocation - GurgaonShift timings - 11.30 am to 8 pm or 1 pm to 9.30 pmExperience:3 to 6 years of work experience is requiredShaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}