{"Job ID": "69866666", "Description": "Job Number 23167299 Job Category Food and Beverage & Culinary Location Jaipur Marriott Hotel, Ashram Marg Near Jawahar Circle, Jaipur, Rajasthan, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Prepare special meals or substitute items. Regulate temperature of ovens, broilers, grills, and roasters. Pull food from freezer storage to thaw in the refrigerator. Ensure proper portion, arrangement, and food garnish. Maintain food logs. Monitor the quality and quantity of food that is prepared. Communicate assistance needed during busy periods. Inform Chef of excess food items for use in daily specials. Inform Food & Beverage service staff of menu specials and out of stock menu items. Ensure the quality of the food items. Prepare and cook food according to recipes, quality standards, presentation standards, and food preparation checklist. Prepare cold foods. Assist management in hiring, training, scheduling, evaluating, counseling, disciplining, and motivating and coaching employees; serve as a role model. Follow all company and safety and security policies and procedures; report maintenance needs, accidents, injuries, and unsafe work conditions to manager; complete safety training and certifications. Ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Anticipate and address guests’ service needs. Speak with others using clear and professional language. Develop and maintain positive working relationships with others; support team to reach common goals; listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards. Stand, sit, or walk for an extended period of time. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jaipur, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}