{
    "Job ID": "69866116",
    "Description": "Role purpose:•    To guide the CTI team and help them gain the required knowledge to do the Job well\n•    To plan , implement and deploy Contact Centre Solutions to meet customer requirements as well as managing any changes/modifications to existing implementations to completion.\n•    To support and maintain Contact Centre Application infrastructure, with developments and modifications to real time systems.\n•    To undertake the technical design of Contact Centre Solutions for internal and external customers.\n•    To consult with all customers and prospective customers on the suitability and viability of Vodafone Contact Centre Solutions.  \n•    To manage the resolution of complex tickets/problems between the various technologies, network elements and business processes.1.    Solutions Implementation / Operational Support\n•        Operational support of enhanced Contact Centre systems.\n•        Implement / support Vodafone’s Contact Centre infrastructure, AaS or CPE\n•        Creation and maintenance of relevant documentation.\n•        Ensure root cause and analysis is preformed on faults to ensure fault repeats is kept to a minimum.\n•        Second level support for engineers in Operation Team.\n•        Regular status reporting (Stakeholders, Vendors, Customers and Project Teams etc.)\n•        Issue and conflict resolution (Vendors, Project members, Customers etc).2.    Solution Development\n•        Guide  other members of Contact Centre Solutions in the establishment of solution feasibility/business cases.\n•        Coordinate the technical design of new and enhanced CTI system solutions.\n•        Development of support processes required for new & existing solutions as required.\n•        Identification of impacts on other solution components if applicable\n•        Support contact centre training to other engineers as applicable.3.    Advice and Support\n•        Provide advice and support (via customer meetings and documentation) to customers so that they can understand what services Vodafone can provide them and how services can be modified to meet the customer needs.\n•        Provide relevant design documentation to the Vodafone Standard.\n•        Understand and define Contact Centre changes, including implementation options, indicative costing, and eventual deployment of successful solutions.\n•        Arrange simulations or other tests to validate system designs, test interface methods and detect potential integration problems.\n•        As needed, Identification and understanding of impacts on core network products and customer's network.\n•        Undertake the technical design of new and enhanced Contact Centre Solutions with a view to delivering the customer outcome and high reliability.4.    Vendor Relationship Management and Interaction\n•        Interaction with Vendors for the purposes of identifying and creating solutions for a particular implementation and/or fault resolution.\n•        Working with vendors to ensure delivery and integration/Operational tasks are completed as part of the overall solution\n•        In consultation liase with 3rd party suppliers and Vendors involved in Contact Centre Solutions, IVR and other change requests.\n•        Assist in the management of supplier performance in accordance with agreed Service Levels.\n•        Systems Support, Management and Implementation\n•        Support Vodafone’s Contact Centre infrastructure \n•        Manage systems in accordance with Vodafone standards and agreed Service Levels.\n•        Assist in the development and implementation of plans for improving CTI systems service/operational performance.\n •    6+ years of Genesys experience\n•    Technical Genesys Certification is a plus\n•    Computing Science either Progamming Based or IT Systems\n•    Java , .Net Certification / programming type skills is a plus\n•    Relevant experience can be substituted in place of qualifyications•    Contact Centre solutions hands on experience  for mre than 5 years ( Genesys Solution Sets, Verint Solution Sets, Cisco CCX)\n•    Technical\n•    Communication Protocol Knowledge (SIP, VOIP, TCP/IP, Networking, Web Services,  POP3, SMTP, IMAP, IM, HTML, JSON, SOAP)\n•    Operating Systems Knowledge ( UNIX, LINUX, Windows)\n•    Database Knowledge ( Oracle, MSSQL, PostgreSQL, Cassandra)\n•    Programming Knowlegde ( VXML, SCXML, EMCA, C#, Java, .Net)\n•    General \n•    Technical Writing\n•    IT Architecutal literacy\n•    IT Design literacy\n•    Good English communication skills Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}