{"Job ID": "69866729", "Description": "Job Number 23167227 Job Category Loss Prevention & Security Location Sheraton Grand Bengaluru Whitefield Hotel and Convt, Prestige Shantiniketan, Bangalore, Karnataka, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Patrol all areas of the property; assist guests with room access. Monitor Closed Circuit Televisions, perimeter alarm system, duress alarms, and fire life safety system. Lock property entrances when required. Conduct daily physical hazard inspections. Respond to accidents, contact EMS or administer first aid/CPR as required. Assist guests/employees during emergency situations. Notify appropriate individuals in the event of accidents, attacks, or other incidents. Defuse guest/employee disturbances. Call for outside assistance if necessary. Complete incident reports to document all Security/Loss Prevention related incidents. Handle all interruptions and complaints. Resolve safety hazard situations. Escort any unwelcome persons from the property without interrupting the orderly flow of property operation. Report to scenes of vehicle accidents/thefts. Call for assistance using proper code responses. Complete a Loss Prevention shift summary/daily activity report. Maintain confidentiality of all Security/Loss Prevention and property reports/documents; release information only to authorized individuals. Conduct investigations and gather evidence. Conduct interviews with relevant parties. Follow all company policies and procedures; report accidents, injuries, and unsafe work conditions to manager; complete safety training and certifications; ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Welcome and acknowledge all guests according to company standards; anticipate and address guests’ service needs; assist individuals with disabilities; thank guests with genuine appreciation. Speak with others using clear and professional language; prepare and review written documents accurately and completely. Develop and maintain positive working relationships with others; support team to reach common goals. Comply with quality assurance expectations and standards. Stand, sit, or walk for an extended period of time. In addition, some states may have additional licensing/registration requirements to be considered for this position. Read and visually verify information in a variety of formats (e.g., small print). Visually inspect tools, equipment, or machines (e.g., to identify defects). Enter and locate work-related information using computers and/or point of sale systems. Move at a speed required to respond to work situations (e.g., run, walk, jog). Stand, sit, or walk for an extended period of time or for an entire work shift. Move, lift, carry, push, pull, and place objects weighing less than or equal to 50 pounds without assistance and objects weighing in excess of 75 pounds with assistance. Grasp, turn, and manipulate objects of varying size and weight, requiring fine motor skills and hand-eye coordination. Move through narrow, confined, or elevated spaces. Move over sloping, uneven, or slippery surfaces as well as up and down stairs and/or service ramps. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. When you join the Sheraton family, you become a member of its global community. We’ve been a place to gather and connect since 1937. At Sheraton, associates create a sense of belonging in more than 400 communities around the world. We invite, we welcome, and we connect guests through engaging experiences and thoughtful service. If you’re a team player who is excited to deliver a meaningful guest experience, we encourage you to explore your next career opportunity with Sheraton. Join us on our mission to be ‘The World’s Gathering Place’. In joining Sheraton Hotels & Resorts, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}