{
    "Job ID": "69869501",
    "Description": "We supply the sustainable and innovative paints and coatings that our customers, communities – and the environment – are increasingly relying on. Our world class portfolio of brands – including Dulux, International, Sikkens and Interpon – is trusted by customers around the globe. We’re active in more than 150 countries and have set our sights on becoming the global industry leader. It’s what you’d expect from a pioneering paints company that’s committed to science-based targets and is taking genuine action to address globally relevant challenges and protect future generations.For more information please visit www.akzonobel.com.© 2023 Akzo Nobel N.V. All rights reserved.To achieve annual volume/revenue/CM targets line-wise as agreed with RSMs for specific areas /territories. Handling of distributors/retailers on a regular basis\nResponsible for meeting debtor targets as agreed with RSM on a monthly basis\nOverdue reduction as per agreed target\nAgree strategy /plan with RSM in order to reduce cheque bouncing\nEnsure that all statements of accounts of customers/dealers within the area are duly signed every month\nExpand connections with dealers and customers to meet targets\nSolve market issues amicably under the supervision of RSM\nEnsure to provide clarity after formal approval from RSM on discounts(monthly, annual special schemes) to the customers\nEnsure proper communication to all customers about ongoing foreign schemes given by the company\nInstall post machines as agreed with RSM \nEnsure compliance with corporate governance and values, and HSE as per company policy3-6 years of sales experience\nWillingness to travel to various locations, even on short notice\nResponsible, hard-working, with strong analytical skills\nFamiliar with MS Office advanceAt least Bachelor's degree from a reputable instituteAt AkzoNobel we are highly committed to ensuring an inclusive and respectful workplace where all employees can be their best self. We strive to embrace diversity in a context of tolerance. Our talent acquisition process plays an integral part in this journey, as setting the foundations for a diverse environment. For this reason we train and educate on the implications of our Unconscious Bias in order for our TA and hiring managers to be mindful of them and take corrective actions when applicable. In our organization, all qualified applicants receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age or disability.Requisition ID: 33856 Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}