{"Job ID": "69869966", "Description": "An individual working as a Senior Data Scientist at Confiz is seen as a person who is technically strong and has an experience of communication with client. You will be required to understand the requirements, assign tasks to junior team members and monitor their overall performance. An exceptional Senior Data Scientist will assume a prominent role in development of his junior team members.Responsibilities:Effectively work in a matrix organization. Lead through influence \nGet things done attitude\nEnsure timely delivery of work\nLead junior team members\nExcellent communication and data storytelling skills \nWork in a cross-functional and in a collaborative environment\nOrganize and prioritize multiple projectsRequirements:Minimum 3 years of hands-on experience in Data Science field\nBachelor's degree in computer science or a related field is required\nMaster’s Degree with a specialization in Data Science would be a plus\nSolid understanding of mathematics, statistics and probability. \nHands on experience in Python scientific computing eco-system (pandas, numpy, scikit-learn and matplotlib) \nFamiliarity with SQL and R (tidyverse and caret) is a plus \nProficiency in the machine learning workflow including data wrangling, feature engineering and model selection and evaluation \nExcellent understanding and working knowledge of Machine learning models: \nSupervised (Classification, Regression)  \nUnsupervised \nAnomaly detection, dimensionality reduction and clustering\nExperience with Time Series models in either of the following: \nStatistical models i.e. (ARIMA, exponential smoothing, Prophet) \nBoosting and tree based models like XGBoost and Lightgbm \nNeural Networks (RNN like LSTM and other variations of RNN etc.) based models. \nFamiliarity with PySpark or deploying machine learning models in production would be a plus We have an amazing team of 550+ individuals working on highly innovative enterprise projects & products. Our customer base includes fortune 5 retail and CPG companies, leading store chains, fast growth fintech and multiple Silicon Valley startups.What makes Confiz stand out is our focus on processes and culture. Confiz is ISO 9001:2015 certified. We have a vibrant culture of learning via collaboration and making workplace fun.People who work with us work with the cutting-edge technologies while contributing success to the company as well as to themselves. To know more about Confiz Limited, visit: https://web.facebook.com/lifeatconfizJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Lahore, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}