{"Job ID": "69867009", "Description": "VavaCars'ta biz sadece bir teknoloji şirketi değiliz. Bizler, Türkiye'deki otomotiv sektöründe devrim yaratmaya kararlı, kullanılmış otomobil endüstrisinde vizyoner, yenilikçi ve öncüleriz. Şirketimiz, derin bir bağlılık, proaktif inisiyatif ve girişimci ruh kültürüyle büyümektedir. Çalışanlarımız sadece bir iş yapmıyor, sınırları zorluyor ve normları çiğniyor. Pratik, departmanlar arası işbirliğinin gücüne ve sadece kendi sektörümüzde değil, ötesinde statükoya meydan okumanın gücüne inanıyoruz.Mesleki geçmişiniz, eğitim geçmişiniz veya sektörünüz ne olursa olsun, istisnai bir çalışma geçmişiniz ve yenilik tutkunuz varsa, sizi ekibimizde görmek isteriz. VavaCars'ta mesele sadece ne yaptığınız değil, neler yapabildiğinizdir.Otomotiv endüstrisinin geleceğini yeniden tanımlarken bu heyecan verici yolculukta bize katılın. İşimiz sadece araba alıp satmak değil, insanların kullanılmış araba pazarını nasıl algıladıklarını yeniden şekillendiren benzersiz bir kullanıcı deneyimi yaratmak. Sadece oyunu değiştirmiyoruz - yeni bir oyun yaratıyoruz.Kariyerinizi hızlı şeride yönlendirmeye hazır mısınız? VavaCars yolculuğuna bugün başlayın!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}