{"Job ID": "69867074", "Description": "TAM is a Saudi publicly listed company, specialized in digital solutions and advisory services for public and private sector clients, leading sustainable public transformation from strategy to execution. For over a decade, TAM has been the partner of choice for 50+ government entities. Our agility, expertise, and holistic approach have helped smoothen the processes and paths of Saudi public impact initiatives operating under the Vision 2030 umbrella.We are currently looking for a Business Development Manager, who is going to be responsible for all new client discussions and proposal development beyond our current client list. The role reports to Managing Partner.\nKey responsibilities and objectives:Define strategic goals, liaise with business partners and stakeholders, identify new business opportunities\nManaging stakeholder expectations, requirements and identifying how they can impact the business\nDevelop a network of contacts to attract new clients and oversee growth projects\nCoordinate department’s research on market insights, industry trends, competing organizations, customer demographics, new technologies and more\nGenerate sales projections and forecast revenue, in line with projected income\nCreate financial models, generate pitch decks, prepare fully-fledged proposals for higher-level staff to review\nSet KPIs for the business development team and develop strategies to meet those goals\nReport and propose interventions to leadership regarding business development and its way forwardAttend professional conferences and industry events for the purpose of lead generation\nManage full-cycle sales process and lead client negotiationsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}