{
    "Job ID": "69869832",
    "Description": "Property Finder is the leading digital real estate platform in the Middle East and North Africa region. A UAE-born startup, Property Finder expanded its operations to Qatar, Bahrain, Saudi Arabia, and Egypt over the years. Recently, it acquired a significant stake in Zingat in Turkey. The company is one of the largest technology start-ups in the region and on a journey to becoming a Unicorn. We are aspiring to create a lighthouse technology company which will have a lasting impact in the entire tech ecosystem in our geography.&nbsp;We are looking for a mid-level Backend Developer to join our team and work on developing and maintaining the backend systems that power our product. You will be working with Go, Kubernetes, AWS, and other technologies to build robust and scalable systems.We are unifying our tech stack around the following technologies.&nbsp;Languages: Javascript/Typescript, GolangFrameworks &amp; Libraries: ReactJS, React Native, next.js&nbsp;Persistent stores: MySQL, Postgres, Redis. Memcached, Elasticsearch/OpenSearch, DynamoDBPlatforms &amp; Services: Docker, Kubernetes, Jenkins&nbsp;PaaS: AWSOur legacy architecture includes PHP and Linode.Design, build, test and maintain backend systems and services\nOptimise APIs for performance\nImplement CI/CD pipelines and automation\nTroubleshoot and debug systems and services\nParticipate in code reviews and knowledge sharing3+ years of experience as a backend engineer\nProficiency in Go\nExperience with Kubernetes and Docker\nExperience developing RESTful APIs\nKnowledge of AWS services (ECS/EKS, RDS, SQS, Eventbridge, S3 etc.)\nExperience with MySQL, PostgreSQL or other SQL/NoSQL databases\nExperience with caching technologies like Redis or Memcached\nExperience with git version control\nKnowledge of TDD, BDD,DDDWorking knowledge of gRPC, JSON Schema, etc.\nFamiliarity with messaging queues like RabbitMQ, Kafka or SQS\nKnowledge of domain-driven design patterns\nUnderstanding of distributed systems\nWorking experience with one or more of the following: Elasticsearch, MySQL, Postgres, DynamoDB, Redis, Memcached\nExperience with operating and monitoring backend systemsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}