{
    "Job ID": "69869132",
    "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The Opportunity:Solution Consultants collaborate with and support Account Managers and provide specialist expertise to the sales teams. Use specialized technical solution knowledge and skills to prospect, technically qualify opportunities and help Sales Representatives win the opportunity. May have named accounts allocated, cover a designated geography. They will be responsible for ensuring technical win.What You Are Great At:Presenting solution to the technical and C-level executives in person and virtually.\nLeading by example and scoping the solution requirements of customers and prospects.\nArticulating the value of OpenText solutions to meet the customer’s needs.\nBuilding trust and credibility of the solution experience through a strong background of successful customer implementations.\nPresenting compelling business cases to customers for technical, business and C-level audiences.What You Will Be Doing: Qualify opportunities for Content Services, Digital Experience, Business Process Management (BPM), Capture technology, Data Archiving, and Analytics in alignment with the OpenText solution portfolio.\nWorking on lift and shift engagements from On-prem to cloud solutions across the product stack.\nDevelop sales leads and provide expert discovery and analysis of customer business and technical requirements.\nArchitect solutions based on OpenText capabilities that will secure the customers’ business case and investment decision.\nPresent and demonstrate both OpenText solutions as well as compelling business cases to customers for both technical and c-level audiences.\nWin projects by helping our customers understand why OpenText solutions are the best choice to help them meet their goals.\nCreate and deliver written solution proposals and presentations to clients including responses to RFPs/RFIs/RFQs.\nProvide on-going technical support to well-qualified prospects conducting evaluations. This may include coaching, proof of concept support, live demonstrations, trouble-shooting, and best-practices consulting.\nWork closely with solution definition and implementation teams to scope and document projects and estimates for proposals.  Ensure smooth transition from sales to solutions implementation.\nWork closely with solutions sales and sales management to establish in depth account plans and strategies. Work with marketing and sales on competitive intelligence, sales collateral, and solution positioning.\nMaintain solid knowledge of OpenText solutions as well as technical, market and industry knowledge.\nMaintain positive working relationship with all other OpenText areas.\nProvide technical leadership and mentorship to peers and your direct reports.What It Takes:At least 12 years’ experience in with enterprise software pre-sales with proven ability to understand and analyze prospects needs and identify, develop and present appropriate solutions in a on or off cloud environment.\nUnderstanding of Enterprise Content Management, Customer Communication, Content authoring/publication solutions\nKnowledge on Capture and BPM solutions for Automation and Digitalization projects.\nKnowledge on Data Archiving along with Document Management technology.\nExtensive experience in Managing Cloud migrations activities involving OpenText solutions to move from on-prem to public/private cloud infrastructure.\nConceptual understanding of different lead applications (ERP, CRM, BPM) and vendors including SAP, Oracle, Infor, Microsoft and others.\nUnderstanding of Industry-specific and best practices for financial services, government, manufacturing and asset intensive.\nExcellent customer relations including written and verbal communication skills in English and local languages.\nExperience developing and presenting clear and concise messages to both technical and business prospects. \nAbility to travel on a regular basis within India\nB.S. or equivalent degree in Computer Science, Engineering or a related field.OpenText's commitment to diversity and inclusion surpasses legal requirements, evident in our Equal Employment Opportunity Statement of Policy which promotes a respectful and empowering environment for employees of all backgrounds, culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at accommodations@opentext.com. Our proactive approach fosters collaboration, innovation, and personal growth, enriching OpenText's vibrant workplace.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}