{"Job ID": "69866031", "Description": "Job Responsibilities Closely monitor the team on day to day basis to ensure all SLA’s are met and any exception are immediately escalated for resolution.\nAdherence to laid down QUALITY & QUANTITY SLA's.\n100% compliance to process related policies, guidelines and controls.\nDeal Closing, processing Drawdowns, Rollovers, Repayments, Pre-payments, Funding, Rate-Fixings, Fees and external payments, collection of interest, Nostro & Past Due Reconciliation.\nSupport the secondary trading desk with Trade booking and settlements\nEscalates issues as required to the management.\nLiaise with other departments within the bank (front office, middle office back office) as well as external contacts (Borrowers, other Banks, Trustees, etc)\nEnsure timely follow ups with the agent / customer for any missing notifications.\nEnsure all the funding with in the SLA are been completed the same day.\nBe the SME – be the first internal POC all Process related queries and clarifications from the Team members.\nBe the first point of escalation for all Process related issues from internal/external customers.\nShould have an eye for detail to ensure all documents are processed correctly.\nAbility to identify changes to processes and procedures to improve productivity and efficiency\nManage adoption towards a robust Knowledge Management model including maintenance of SOPs, process/policy change management, training of new joiners and ongoing training of existing Team.\nMotivate and support the Team Members to meet their Goals and Objectives. Self-motivated and flexible with working hours.\nManage Process improvements and other initiatives.\nAbility to work under pressure and high volumes.Required Qualification, Skills And Capabilities Bachelor's degree with a minimum of 3 – 5 years of relevant loan servicing work preferably for syndicated loans or experience in a back office/financial industryCandidates with knowledge of loan systems like loan IQ will hold an added advantage\nCandidates must have knowledge of nostro/cash matching, General Ledger reconciliation and SWIFT and remittance systems\nStrong problem solving and investigative skills to undertake analysis, resolve issues/problems related to loans operations\nStrong MS office and analytical skills\nExperience in process training a unit\nStrong risk & control mindset\nKnowledge of investment banking products including Loans\nStrong project management skills\nOpen to shifts\nStrong communication skillsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}