{"Job ID": "69867495", "Description": "Team Manager-(2300016895)Job:Retail BankingPrimary Location:Asia-India-AhmedabadSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 9:53:54 AMUnposting Date:14/Oct/2023, 10:59:00 PMThe Role ResponsibilitiesJob RoleThe purpose of the role is to,Meet the business objectives initiated by the respective country Business Clients business\nCustomer focused need-based selling\nDeepen customer relationship and maximize penetrationStrategyDrive the right sales culture and attitude.\nOperational quality - manage sales controllable error, rejection, approval rate, TAT, etc.\nContinuous sales improvement effort, through active engagement with Product, Credit and Operations.\nManage customer experience and NIL Customer Complaints.BusinessAchieve Business Loans sales target.\nAchieve team sales target and increase sales productivity.\nSegment focus, customer focus needs-based selling.\nAchieve segment relationship penetration, multi-product selling or bundles around anchor product.\nArrange / create sales activities.\nBuild and manage relationship with business partners / intermediaries / channels.\nFocus has to be on acquiring new customer relationship along HVS  segments for both Assets and Liabilities.ProcessesEnsure CDD, MLP and TCF diligence.\nZero tolerance - Fraud, Mis-selling.\nDiscipline in HR and training related matters.\nAdhere to all policies, guidelines and procedures, comply with local regulatory requirements, reflect best practices.\nAdhere to operational risk controls and procedures in day to day sales management.\nTo ensure no adverse findings in internal / external audit, governance and compliance review.\nTo comply with all applicable money laundering prevention procedures and, in particular, report any suspicious activity to the Unit Money Laundering Prevention Officer and line manager.People and TalentLead and manage a team of 8 to 9 BDM’s.\nThe Right Coach.\nEngage every team member and build strong team work.\nEffective performance / scorecard / vintage mix management within budget, discipline in performance management.\nIdentify and groom potential sales leaders.\nUpgrade people management skill constantly.\nManage Attrition of Sales force.GovernanceEnsure sales team has the right culture and attitude.\nOperational quality - manage sales controllable error, rejection, approval rate, TAT, etc.\nEngage relevant stakeholders for smooth approval and customer on-boarding experience.\nManage customer experience.\nEnsure nil Customer complaints.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Other ResponsibilitiesLead and engage team of Senior Business Development Executive / Business Development Executive (who are self sourcing).\nProactive performance / scorecard management - motivation and retention of talent.\nTrain and Coach the team.\nUpgrade people management skill constantly.\nManage Attrition.Our Ideal CandidateMust be a graduate. MBA’s would be an advantage.\nSales experience of at-least 2 - 3 years in Home Loans / LAP and CASA; of which 1 year must have been in managing a direct sales team will be preferred.\nShould possess strong people management and leadership skills to manage approx 10-20 sales people.\nGood knowledge of the selected market and customer segments would be an advantage.\nStrong communication and negotiation skills with the ability to influence outcomes.\nStrong inter-personal skills, which encourages and promotes enthusiasm and team spirit.Role Specific Technical CompetenciesMS Excel\nMS Outlook­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better thJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}