{
    "Job ID": "69866956",
    "Description": "Job Title:Job DescriptionConcentrix is a technology-enabled global business services company specializing in customer engagement and improving business performance. We partner with ambitious, progressive executives around the world to future-proof their business and stay ahead of the competition and customer expectations.Role and Key Responsibilities:Preparation of financial statements.\nPreparation of Journal entries to ensure completeness and accuracy of the financials.\nKnowledge of Accounting Standards will be helpful but not compulsory.\nResponsible for monthly account reviews to ensure proper coding.\nWork on Month end Accruals, Prepayments, Fixed Assets, Revenues, etc.\nPrepare Balance Sheet reconciliations.\nGood Knowledge of Bank Reconciliations.\nPrepare month-end and quarter-end variance analysis.\nSupport to Internal and external Auditors.\nAny knowledge of SOX, SEC or any other internal compliances will be helpful but not compulsory.\nTo Support Adhoc requests as required by the Business.\nBe able to adhere to deadlines set by the business.\nBe a Team Player.Key skills & knowledge:Working Knowledge of Financial ERP Applications\nExcellent oral and written communication skills\nHands on experience with Excel and MS officeEducation – GraduateDisclaimer: -'Neither Concentrix nor any authorized 3rd party who assist with our recruitment process, ever ask candidates for ‘recruitment’, ‘processing’ or any other kind of fees in exchange for offer letters from Concentrix. Offer letters and other recruiting correspondence from Concentrix are printed on Concentrix letter head with authentic signatures of appropriate Concentrix authorities.'Location:Language Requirements:Time Type:If you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California ResidentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}