{
    "Job ID": "69866479",
    "Description": "About us.At the lowest point on earth, overlooking one of the world's most magical seas and one of the most spectacular natural and spiritual landscapes, at the shore of legendary Dead Sea sits the new Holiday Inn Resort Dead Sea Here you can relax and rejuvenate with the year-round sunshine, low humidity, ozone rich air and of course the healing mineral loaded waters of the Dead Sea itself.The hotel is just 70 km from Amman Queen Alia International Airport and 55km from the capital Amman. Guest staying at the Holiday Inn Resort Dead Sea will enjoy a fresh new family hotel with spacious rooms complete with a wide variety of leisure activities with free mini bar and free internet access.About the role responsibilities.To collect Store Requisitions ensuring that they are checked and stored. \ncorrectly, whilst adhering to the Resort Requisition System and said par stock.\nTo check that all mise-en-place is carried out prior to service according to the set standards.\nTo greet, help seat guests in his/her section.\nTo set tables prior to service and during service according to the required standards.\nTo serve Food and Beverage to guests to the required standards.\nTo assist Captain to take Food and Beverage orders in a discreet and professional manner and take every opportunity to maximize sales.\nTo carry out and assist Captain when necessary in making special dishes, flambé, portioning and carving to the required standards.\nTo be aware of the Weights and measures Laws and Licensing Laws and to strictly adhere to the provisions set.\nTo carry out the duties of a Bus Boy when required.\nTo be able to operate the Micros Machine according to the set standards and to make guest bills and receive payment.\nFull compliance with the Service standard Manual.\nFull compliance with the hotels Property Maintenance Program.\nStaff are motivated and well trained to perform their jobs effectively.\nCarries our assigned health and safety procedures and trains subordinates in these requirements.\nThe daily logbook is effectively maintained and managed.What you can expect from us:We give our people everything they need to succeed. From a competitive salary that rewards all your hard work to a wide range of benefits designed to help you live your best work life – including a full uniform, impressive room discounts and some of the best training in the business. Our mission is to welcome everyone and create inclusive teams where we celebrate difference and encourage colleagues to bring their whole selves to work. IHG Hotels & Resorts provides equal employment opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. We promote a culture of trust, support, and acceptance. Always welcoming different backgrounds, experiences, and perspectives. IHG gives every member of the team the room they need to belong, grow and make a difference in a collaborative environment. We know that to work well, we need to feel well – both inside and outside of work – and through our my WellbeingFramework, we are committed to supporting wellbeing in your health, lifestyle, and workplace.  So, join us and you’ll become part of our ever-growing global family.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jordan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}