{"Job ID": "69867222", "Description": "What Data Analytics brings to Cardinal Health:The Data & Analytics Function oversees the analytics lifecycle to identify, analyze and present relevant insights that drive business decisions and anticipate opportunities to achieve a competitive advantage. This function manages analytic data platforms, the access, design and implementation of reporting/business intelligence solutions, and the application of advanced quantitative modeling.Data Analytics applies business process knowledge and data analytics to develop, recommend and communicate timely, accurate, relevant and actionable insights to support business decisions and objectives.Accountabilities in this roleSupport Tableau visualizations\nResponsible for SQL code development\nKnowledge on SAP master data & ETL concepts\nMaintain and develop Alteryx workflows.QualificationsBachelor’s Degree preferred.\n2+ years’ experience in related field preferred.\nAlteryx & Tableau (desktop and server) proficiency required.\nSQL proficiency preferred.\nProficient in Microsoft Office Suite, especially Excel and PowerPoint\nAnalytical tool skills preferred.\nExperience developing creative and innovative analytical insights with high business value preferred.\nStrong communication skills preferred.\nBusiness Facing and Pharmaceutical Distribution experience required.\nGCP Cloud Experience preferred.What is expected of you and others at this level?Applies comprehensive knowledge and a thorough understanding of concepts, principles, and technical capabilities to perform varied tasks and projects.\nMay contribute to the development of policies and procedures.\nWorks on complex projects of large scope\nDevelops technical solutions to a wide range of difficult problems. Solutions are innovative and consistent with organization objectives.\nCompletes work independently receives general guidance on new projects.\nWork reviewed for purpose of meeting objectives.\nMay act as a mentor to less experienced colleagues.Candidates who are back-to-work, people with disabilities, without a college degree, and Veterans are encouraged to apply.Cardinal Health supports an inclusive workplace that values diversity of thought, experience and background. We celebrate the power of our differences to create better solutions for our customers by ensuring employees can be their authentic selves each day. Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law.To read and review this privacy notice click hereJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}