{
    "Job ID": "69866668",
    "Description": "SummaryThe Environmental Engineer will provide specialized expertise in ensuring that the ENOWA power generation projects, which encompasses solar, wind, geothermal, thermal (grid-connected), and off-grid power generation, are compliant with environmental regulations and sustainable practices. Their role is pivotal in minimizing the environmental footprint throughout the design, construction, and operational phases of the project.Key Accountabilities and ResponsibilitiesEngineering Management       Conduct/support EIAs to identify potential environmental impacts and propose mitigation measures.\nCoordinate with interdisciplinary teams to integrate environmental considerations into project planning.\nEnsure all project activities adhere to local, national, and international environmental regulations.\nObtain necessary environmental permits and licenses and ensure ongoing compliance.\nCollaborate with design teams to infuse sustainability and eco-friendly technologies into project designs.\nReview project plans and designs to ensure they align with environmental best practices.\nMonitor environmental parameters during construction and operation to ensure compliance with environmental standards.\nPrepare regular environmental performance reports for internal review and regulatory submissions.\nDevelop and oversee waste management plans, emphasizing recycling and minimizing waste.\nMonitor waste disposal methods to ensure they meet environmental standards.\nCollaborate in the development of emergency response plans concerning environmental incidents.\nCoordinate responses to any environmental incidents or concerns, ensuring swift mitigation and thorough documentation.\nInterface with regulatory bodies and stakeholders to address environmental concerns and gather feedback.\nAct as the project's environmental representative in stakeholder engagements.\nProvide regular environmental performance updates to senior management and other relevant parties.Background, SkillsIn-depth understanding of environmental management aspects related to thermal and renewable power generation technologies.\nProven experience in overseeing large-scale power generation projects from design to operation from an environmental perspective.\nStrong analytical, problem-solving, and organizational skills.\nExcellent communication skills, both written and verbal.\nA track record of successful collaboration with multidisciplinary teams.\nKnowledge of local, national, and international environmental standards and regulations in power generation.\nOutstanding problem-solving skills, with the ability to identify, analyze, and resolve technical challenges.\nHighly effective communication skills to liaise with internal teams, external partners, and regulatory authorities.\nStrong organizational skills and the ability to manage multiple projects simultaneously.\nStrong leadership skills and ability to work independently and in a team.\nTravels to project sites as needed.QualificationsBachelor's degree in Environmental Engineering or related field; a Master’s degree or further specialized training would be advantageous.\nMinimum of 5 years of experience in environmental engineering within the power generation sector, with exposure to both thermal and renewable technologies.\nProfessional certifications related to environmental management would be beneficial.\nProfessional certifications (e.g., PMP, PE, CEng) or equivalent.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}