{
    "Job ID": "69866750",
    "Description": "SummaryThe Quality Manager plays a pivotal role in ensuring that the ENOWA power generation projects, which span solar, wind, geothermal, thermal (grid-connected), and off-grid power generation, meet the highest quality standards throughout their lifecycle. This individual champions quality assurance, control, and continuous improvement activities during the design, construction, and operational phases, ensuring the project's longevity, safety, and performance.Key Accountabilities and ResponsibilitiesEngineering Management       Develop and implement a comprehensive Quality Management System (QMS) tailored to the project's needs.\nSet clear quality objectives, benchmarks, and KPIs in alignment with the project's goals.\nCollaborate with design and construction teams to ensure quality considerations are integrated from the onset.\nReview designs, materials, and construction methods for quality compliance and sustainability.\nSchedule and conduct periodic quality audits throughout the project's lifecycle, identifying areas of improvement and ensuring compliance with industry standards.\nEngage third-party auditors when necessary for independent evaluations.\nDrive continuous improvement initiatives based on audit findings, feedback, and technological advancements.\nDevelop and implement corrective and preventive action plans to address identified quality issues.\nFacilitate quality training programs for project teams, fostering a culture of quality awareness and continuous improvement.\nStay updated on industry best practices and advancements, disseminating relevant knowledge to the team.\nEnsure comprehensive documentation of all quality-related activities, from audit findings to improvement actions.\nRegularly report to senior management on quality performance, challenges, and improvement areas.\nCollaborate with suppliers, contractors, and other external stakeholders to ensure they adhere to the project's quality standards.\nAct as the main point of contact for quality-related inquiries from regulatory bodies and stakeholders.\nProvide regular quality performance updates to senior management and other relevant parties.Background, SkillsIn-depth understanding of quality assurance and control principles related to thermal and renewable power generation technologies.\nProven experience in overseeing large-scale power generation projects from design to operation from a quality management perspective.\nDemonstrated experience in developing and implementing quality management systems.\nStrong analytical, problem-solving, and organizational skills.\nExcellent communication skills, both written and verbal.\nA track record of successful collaboration with multidisciplinary teams.\nKnowledge of local, national, and international quality standards and regulations in power generation.\nOutstanding problem-solving skills, with the ability to identify, analyze, and resolve technical challenges.\nHighly effective communication skills to liaise with internal teams, external partners, and regulatory authorities.\nStrong organizational skills and the ability to manage multiple projects simultaneously.\nStrong leadership skills and ability to work independently and in a team.\nTravels to project sites as needed.QualificationsBachelor's degree in Engineering, Quality Management, or a related field; a Master’s degree would be advantageous.\nMinimum of 10 years of experience in quality management within the power generation sector, with exposure to both thermal and renewable technologies.\nRelevant professional certifications, such as Certified Quality Manager (CQM), Certified Quality Auditor (CQA), or equivalent.\nProfessional certifications (e.g., PMP, PE, CEng) or equivalent would be beneficial.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}