{
    "Job ID": "69869863",
    "Description": "Job RoleUnder general supervision from the Aftersales Fleet Manager, performs supervisory duties in the implementation and management of a fleet operation, performs supervisory and of vehicle as needed according to contractsJob ResponsibilitiesAssists in the development of the Fleet Services budget to include a review of past year\nContributing in signing new service contracts. And Follow-Up the current fleet customers\nDevelop knowledge and understanding of the organization's policies and procedures and of relevant regulatory codes and codes of conduct to ensure own work adheres to those standards. Obtain authorization from a supervisor or manager for any exceptions\nEnter relevant information into the CRM system after each contact with a customer to ensure that the organization has quality data to enable effective customer retention and business development activities\nExamines Monthly reports for accuracy on each vehicle\nFollow-Up payment collection and L/C’s of fleet customers\nLiaise with debtors regarding outstanding debt and agree on a deadline for payment.\nMonitors and analysis of vehicle utilization and evaluation of their fleet.\nProduce accurate reports for others by collecting data from a variety of standard sources and inputting it into standard formats\nResponsible for the maintenance and repair of all vehicles as per fleet contract\nSupervises all Fleet Services and evaluates their contract and credit collection.EducationRequired Qualifications & Skills        Minimum Qualifications:\n\nPreferably graduate of Mechanical Engineering but not a prerequisite.\nExcellent communication skills in English written and spoken.\nSAP User.\nComputer skills.\nhighly motivated; manner and appearance; reliable, obliging, effective conversation\n       Minimum Experience:\n\nMinimum three years of automotive experience.\n     Job specific Skills:\n\nIn depth knowledge of the Automotive (sales, service, parts & finance cycle)\nExcellent communication and negotiations skills.\nPresentation skills\nProblem solving\nMS office (Excel, word, power PI & Power point)#LI-NK1Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}