{
    "Job ID": "69866178",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Role PurposeWe are currently looking for Senior Quantity Surveyor/Cost Manager with a Commercial background to be based in Jeddah to work on a range of high-profile property sector projects across the KSA.What this job involvesPreparation of Budget estimates. \n\nPreparation of Bills of Quantities. \n\nMonthly payment valuations. \n\nPreparation of Final Accounts (under supervision).\n\nPreparation of contract Documents. Reviewing and negotiating prices with Contractors. \n\nReview costing’s in conjunction with budgets.\n\nPrice and check additional works as required and complete relevant paperwork. \n\nAttending site meetings. \n\nAttending design team meetings.Contract Management:Review, negotiate, and manage contracts with clients, subcontractors, and suppliers to ensure compliance with legal and commercial requirements.\n\nCollaborate with the legal team to draft and review contractual terms and conditions, ensuring they are favorable to the company's interests.\n\nMonitor contract performance, identify and mitigate potential risks, and make recommendations for contract amendments when necessary.Cost ControlDevelop and maintain accurate project cost estimates, budgets, and financial models.\n\nImplement cost control measures and ensure adherence to established budgets throughout the project lifecycle.\n\nConduct regular cost analysis, identify cost-saving opportunities, and recommend strategies to optimize project profitability.Stakeholder ManagementBuild and maintain strong relationships with clients, subcontractors, suppliers, and other external stakeholders.\n\nCollaborate with project teams to ensure smooth communication and alignment of commercial objectives.\n\nProvide guidance and support to project managers and teams to ensure commercial considerations are integrated into project planning and execution.Desired skills and experience for this Bachelor's degree in QS, Business Administration, Finance, or a related field (Master's degree preferred).\n\nProven experience in a similar role or in a related commercial management position within the construction industry.\n\nStrong financial acumen and experience in budgeting, cost control, and financial analysis.\n\nExcellent negotiation and contract management skills.\n\nIn-depth knowledge of construction industry practices, regulations, and legal requirements.\n\nProficient in using financial software and tools, such as ERP systems and project management software.\n\nExceptional communication and interpersonal skills, with the ability to build strong relationships with stakeholders at all levels.\n\nStrong leadership abilities, with a track record of successfully leading and developing high-performing teams.\n\nHardworking, proactive individual with a strong desire to learn and progress with an eye for detail and a passion for high standards.  Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}