{"Job ID": "69866774", "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Responsibilities/What You’ll DoMonitor and respond quickly and effectively to requests received through the IT Helpdesk.\nIn-person or remotely, you’ll provide technical assistance and support for all incoming IT Helpdesk requests and issues related to computer systems, application, services, software, and hardware.  Follow up and ensure issues have been resolved.\nBecause of your expertise, you’ll document internal procedures and create a training and instruction manual.\nManaging PC/Laptop setup and deployment for employees with standard hardware, images, and software.\nAssist employee orientation and training.\nInstall, modify, and repair computer hardware and software, and provide support to the company local office IT related systems, web/audio conferencing services, printers and phone system.\nOn an on-going basis, you’ll maintain an inventory of all equipment, software and software licenses.\nResolve technical problems with Local Area Networks (LAN), Wide Area Networks (WAN), and other systems.  Maintain daily performance and monitoring of computer systems.Minimum of 3 years’ experience in:TCP/IP, IP networking knowledge and WiFi, i.e. IP subnet, DNS, DHCP.\nPC / Laptop hardware and Windows OS and MacOS experience.\nExperience with Microsoft Office Application.\nWorking with various server and client hardware platforms, i.e. Lenovo.\nWorking with various computer accessories.\nExperience with email system, i.e. Google G-Suite, Microsoft Exchange.\nWeb/Audio Conferencing, i.e. Zoom, WebEx.\nProblem-solving skills and the ability to work on multiple projects and issues.A background in the following is a plus:Experience with conference room equipment and application.\nKnowledge of Phone System, Cloud-based PBX, VoIP.\nExperience with virtual machines. i.e. VMWare\nLinux OS and basic services i.e. SSHD#LI-NT1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chandigarh, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}