{
    "Job ID": "69867750",
    "Description": "YOUR MISSIONOffice basedStructure, plan and manage touchpoints between merchandising and field leadership –Retail Team.\n\nBe a conduit to the field team by soliciting feedback on pain points and areas of confusion or inconsistency.\n\nOwn financial targets on DTCGM%, price reductions, sales units, inventory; and ensure forecast accuracyin budget planning.\n\nResponsible for buying plan approvals for all channels (DTC & Boyner).\n\nPossess a clear understanding of gross margin return on investment; analyze and recommend pricing strategies; and take immediate actions in case of over stocks situation.\n\nPlanning & allocation for DTC channel. Following up the fulfillment rates of the storesbased ondivision & business segment.\n\nManagement of the team – development, performance appraisals, career management.Field basedWeekly & monthly store visits and take actions according to store net sales, stock room, physical appearance.\n\nWorks with logistics and distribution teams to ensure timely product delivery.\n\nRegularly review competitive landscape for features and trends.\n\nAll store executions should be implemented, which are pre-defined during the buying process.University Degree\n\nRetail Merchandising Management experience at least 6-8 years\n\nTeam Management experience required\n\nProactive; ability to make decisions without significant management oversight\n\nProficiency in reports, analysis on excel formats\n\nSystem establishment & maintenance\n\nResults driven, strong interpersonal, written and verbal communication skills. Ability to communicate effectively with internal departments as well as outside organizations.SPEED & SPIRIT is what we look for in our candidates, defined by some simple values that inspire us to BE DRIVEN in our performance, BE VIBRANT in our sporting legacy, BE TOGETHER in our team spirit, and BE YOU to let our individual talent and experience shine. Applying for a job at PUMA is easy. Simply click APPLY ONLINE and follow the steps to upload your application.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}