{
    "Job ID": "69869741",
    "Description": "Job Description:Contract type/duration:- Full-time contract- Permanent positionJob Summary:For Airbus Customer Services, We are seeking an experienced and detail-oriented Aircraft Technician (Systems) to join our team within the department of AME SBCW2 Aircraft Modification & Repair in Dubai. The successful candidate will be responsible for inspecting, maintaining, and repairing aircraft systems to ensure their safe and efficient operation. The Aircraft Technician will work closely with other technicians, engineers, and maintenance personnel to troubleshoot, diagnose, and resolve system-related issues. This position requires strong technical expertise, excellent problem-solving skills, and a commitment to maintaining the highest standards of safety.Main responsibilities:- For the execution of modification embodiment or repair working party, managing complex, high value and cross-functional projects compliant with EASA/FAR Part 145 airworthiness regulation.- Conduct upgrade embodiment activities on external customer aircraft.- Perform major and complex repair projects including but not limited to incidental and fleet wide repairs.- Inspect, troubleshoot, and repair various aircraft systems, including electrical, hydraulic, pneumatic, fuel, and environmental systems.- Conduct regular maintenance checks to identify and rectify system malfunctions and ensure compliance with aviation regulations and manufacturer guidelines.- Perform scheduled inspections, repairs, and modifications as per maintenance schedules and work orders.- Utilize diagnostic equipment, technical manuals, and system-specific tools to diagnose and resolve system-related issues.- Collaborate with other technicians, engineers, and maintenance personnel to develop solutions for complex system problems.- Document all maintenance and repair activities accurately and thoroughly, including work performed, parts used, and hours spent, in compliance with regulatory requirements.- Stay updated with the latest industry trends, technological advancements, and regulatory changes related to aircraft systems.- Participate in training programs to enhance knowledge and skills in aircraft systems maintenance and repair.- Adhere to safety protocols and ensure compliance with all relevant safety regulations and standards.- Maintain a clean and organized work environment, ensuring all tools and equipment are properly calibrated and stored.Requirements:- High School diploma or equivalent; relevant technical certification or diploma preferred.- Experience in Flight Test Aircraft across Airbus Family, A380/A350 are a strong plus. - Proven experience as an aircraft technician/systems technician, preferably with exposure to a variety of aircraft systems.- Strong knowledge of aircraft systems, including electrical, hydraulic, pneumatic, fuel, and environmental systems, and familiarity with their components and functions. - In-depth knowledge of flight control systems, proficient in conducting inspections, adjustments, and repairs on flight control systems to ensure proper functionality and alignment. - Understanding of aircraft engines, including their types, their operation principles and proficiency in performing engine removal and installation procedures in accordance with guidelines and maintenance manuals. - Understanding of landing gear components, including struts, wheels, brakes, and tires, the knowledge of landing gear retraction and extension mechanisms and proficiency in conducting landing gear inspections, maintenance, and troubleshooting. - Familiarity with aircraft maintenance manuals, technical specifications, and relevant regulations (e.g. EASA, FAA).- Proficient in using diagnostic equipment, tools, and software applications for system troubleshooting and repairs.- Excellent problem-solving skills and ability to work well under pressure.- Strong attention to detail and ability to follow instructions accurately.- Ability to work independently as well as collaborate effectively with a team.- Strong communication skills, both verbal and written.- Excellent time management and organizational skills.- Ability to work in a physically demanding environment, including standing, bending, and lifting heavy equipment.Personal profile:- 15+ to 20 years of experience in the aeronautical industry (MRO Part 145 or Aircraft Manufacturing Part 21)- Field of education: Engineering / Production, Manufacturing- A negotiation-level in English is a must, further languages esp. French/German/Spanish are a plus.- Ability to travel worldwide to support Airbus customers- International work experience and strong communication skills.- You are proactive, highly flexible, open-minded and have a very positive working attitude and working style which suits our team and meets business needs to contribute to company success.- You have the ability to work in a dynamic and fast changing environment and integrate yourself quickly within a diverse and international team.This job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth.Company:Employment Type:-------Experience Level:Job Family:By submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus.\nAirbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief.Airbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com.At Airbus, we support you to work, connect and collaborate more easily and flexibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}