{
    "Job ID": "69866177",
    "Description": "Job Overview\nResponsible for the on-time completion of projects or components of large, complex projects for clients in the life sciences field. Identifies and elevates potential new business opportunities and assists in the sales process.\nEssential Functions\n• Participates or leads teams in the design, development and delivery of consulting projects or components of larger, complex projects.\n• Reviews and analyzes client requirements or problems and assists in the development of proposals of cost effective solutions that ensure profitability and high client satisfaction.\n• Provides direction and guidance to Analysts, Consultants, and where relevant, to Statistical Services assigned to engagement.\n• Develops detailed documentation and specifications.\n• Performs qualitative and/or quantitative analyses to assist in the identification of client issues and the development of client specific solutions.\n• Designs, structures and delivers client reports and presentations that are appropriate to the characteristics or needs of the audience.\n• May deliver some findings to clients.\n• Recommends improvements and alternative solutions to resolve problems.\n• May identify new business opportunities of follow-on work and new leads at assigned client.\n• Provides follow-up with client after project deliverable has been completed to ensure client satisfaction.\n• Proactively develops broader and deeper knowledge of related consulting methodologies and life sciences market through on the job experience and participation in training opportunities. Begins to develop CoE specific subject matter expertise.\n• When acting as Project Manager, proactively manages project timelines and manages day to day communication with the client and team members.\nQualifications\n• Bachelor's Degree Req\n• Master's Degree Business Administration Pref\n• 5-8 years of related experience in consulting and/or life sciences industry Req\n• Possesses solid project management skills and client influencing and relationship building skills.\n• Works willingly and effectively with others in and across the organization to accomplish team goals.\n• Experienced with developing consultative relationships with senior level managers and executives at clients in the life science industry.\n• Ability to manage multiple projects, juggle priorities and deliver on tight deadlines.\n• Knowledge of consulting methodologies, tools and techniques related to functional area.\n• Knowledge of key issues and current developments in the life science industry.\n• Excellent presentation, communication and client influencing skills.\n• Has established network and referral contacts.\n• Has necessary subject matter expertise to effectively manage projects within a given CoE.IQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}