{
    "Job ID": "69867692",
    "Description": "Arcadis is the world's leading company delivering sustainable design, engineering, and consultancy solutions for natural and built assets. We are more than 36,000 talented people in over 70 countries dedicated to improving quality of life. Everyone has an important role to play. With the power of many curious minds, together we can solve the world’s most complex challenges and deliver more impact together.Role DescriptionThis role is part of Arcadis’ Global Excellence Centre (GEC) and will join our 3,000+ talented individuals working in India, Romania, and Philippines, in partnership with Arcadis’ offices globally. The GEC brings key capabilities and capacity to support our clients seamlessly around the world.  For those in GEC there are options to be dedicated to one country; developing deep knowledge and strong relationships, as well as opportunities to be part of teams working truly globally as a centre of excellence, offering diversity and variety.  Arcadians are by nature, globally minded and culturally aware, and Arcadis strongly believes in flexibility which enables change over time as your career progresses. The GEC model is well embedded in Arcadis, and the strong relationships that exist between our global offices are truly unique. Role Accountabilities:As Senior Engineer Role, you need to have strong technical, communication (Verbal and Written) and team management skills. You should demonstrate skill in project/task management, resource planning, liaising with internal/external stakeholders and people management skills while supporting complex projects in a single discipline.Desired roles and responsibilities include, but not limited to :Reporting to the Principal Engineer, you will provide technical support into assigned projects ensuring successful delivery of technically challenging schemes.\nYou understand the limitations with codes and standards and develop solutions from first principles.\nYou have a strong command of BIM / digital / data analytics software as it applies to your area today. \nYou proactively engage with the region to help them define task scope and drive the team to deliver the scope.\nYou develop technical methodologies which add value to the scope from the region and guide junior colleagues to do the same. \nYou engage with regional colleagues regarding safe design requirements, and proactively flag risks at appropriate levels also ensure safe design principals are applied to projects.\nYou would have engaged in global initiatives e.g Base camp, Arcadis Way Task Manager Training.\nYou contribute to the continuous improvements of GEC Management System within your area of business.\nYou review work and drive the culture of checking and accountability in the team, including interdisciplinary checks.\nYou develop plans and budgets for medium-size and or complex tasks and monitor progress against these. \nYou recognize team limitations by saying no or suggesting alternatives, where appropriate.\nYou identify training needs and help the team to create development plans to Grow, Perform and Succeed.\nYou encourage your team to adopt the best HS&W practices and lead by example.\nYou create opportunities to collaborate with other teams across the GEC for the benefit of the project.\nYou resolve issues and create strong relationships with project colleagues in the regions, evidenced through continuous conversations and regular feedback.\nYou upskill yourself and encourage your team to seek out new technologies and implement these on projects.\nYou engage with new technologies and future trends and encourage others to implement innovation/ smart working.\nYou innovate to ensure your projects contribute to sustainable development and quality of life.\nTo achieve professional development in line with the BU requirements, you will continue to pursue your Chartership goals with any recognized institute (ICE/IStructE) and support your team members achieve their goals where appropriate.Qualifications & Experience:Have a minimum of 5 years’ experience delivering projects within the Highway Structures sector and can advise on the key components and detailing for highway bridge structures desirable. \nM.Tech candidates are preferred\nShould have developed skills in the Concept design, Preliminary and Detailed design of RC, PSC, Steel and Steel Composite Highway Bridges \nYou have a good understanding and can demonstrate application of Eurocode Design Standards (UK Annex) \nYou have expertise in the assessment of highway bridge structures in accordance with British Standards (DMRB) \nYou have experience of delivering projects in BIM and can manage delivery on common data platforms including ProjectWise, SharePoint or BIM 360 and can demonstrate some specific expertise \nYou are able to navigate and coordinate interdisciplinary project reviews through federated project models in Navisworks \nYou can multitask and can manage and take responsibility for task delivery for multiple projects \nYou have a good understanding of H&S management through the CDM framework and can demonstrate examples where you have been responsible for risk managementWhy Arcadis?We can only achieve our goals when everyone is empowered to be their best. We believe everyone's contribution matters. It’s why we are pioneering a skills-based approach, where you can harness your unique experience and expertise to carve your career path and maximize the impact we can make together.   You’ll do meaningful work, and no matter what role, you’ll be helping to deliver sustainable solutions for a more prosperous planet. Make your mark, on your career, your colleagues, your clients, your life and the world around you.Together, we can create a lasting legacy.Our Commitment to Equality, Diversity, Inclusion & BelongingWe want you to be able to bring your best self to work every day, which is why we take equality and inclusion seriously and hold ourselves to account for our actions. Our ambition is to be an employer of choice and provide a great place to work for all our people.Join Arcadis. Create a legacyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}