{"Job ID": "69868143", "Description": "Manufacturing Production Workers focus on setting up, operating, maintaining, and troubleshooting manufacturing production (i.e., machining, processing, assembly, or packaging) equipment including: Operating machine tool, chemical processing, assembly, or packaging equipment to manufacture products according to production specifications, schedules, volume/cost/wastage targets, and quality standards. Moving, packing, and sorting raw materials or finished goods. Monitoring the quality of output to identify, discard, or re-manufacture faulty products. Maintaining accurate daily production records as input to manufacturing performance analysis A Senior Para-Professional (S3) requires broad knowledge of operational procedures and tools obtained through extensive work experience and may require vocational or technical education. May require the following proficiency: Works under limited supervision for routine situations. Provides assistance and training to lower-level employees. Problems typically are not routine and require analysis to understand. Your Responsibilities Testing of product ensuring the highest quality to meet customer requirements and delivery. Final & Shipping Follow established work instructions in a customized manufacturing environment. Very hands on process. Use computer to check schedules, update manufacturing status of jobs, etc. Complete and maintain all required paperwork, records, check sheets, etc. Operate various types of cranes and fork trucks to aid in material handling. Continually monitor quality of work, addressing and resolving inquiries and problems. Participate in continuous improvements initiatives. Participate actively in team meetings and group discussions. Interface with other departments to accurately communicate information. Must be willing to cross train in multiple skills. Assist in the training of other employees. Must be a team player but able to work independently. Available to work overtime as required including weekends. Perform other related duties, as assigned by management. Your background Diploma in Electrical Basic computer skills. Ability to operate industrial equipment, including cranes and forklifts. Ability to read and understand blueprints and simple schematics. Previous manufacturing, welding or electrical experience is desirable. Experience in lean manufacturing including 4Q, JIDOKA, 6S, etc.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}