{"Job ID": "69867066", "Description": "Responsible for the procurement of equipment, supplies and services for all Hospital facilities; expedites and provides information relative to the purchase order to the requestor/department and negotiates with vendors to discuss product, delivery and discounts for the price containment.1.Reviews Notification and Auto Create screens on the Oracle to accept/reject requisitions under his/her responsibility by verifying their completeness, i.e. catalogue number, manufacturer or other descriptive details.2.Advises the custodian of Processing box if the item required is to be purchased from ROYSPEC.3.Analyzes item history to ensure the specific details, i.e. source local/international, price, etc.4.Prepares Request for Quotation to meet the purchasing category or users requirement through Oracle Purchasing Application.5.Initiates/Creates Purchase Order after evaluation of quotations with guarantee that item details, quantity, price and terms/conditions are précised with quotation and requisition.6.Prints/reviews Purchase Order on formal hospital pre-printed Purchase Order form and organize the P.O. file under the guidelines of related policies.7.Coordinates with healthcare professional staff or other requestors in general prior the procurement of substitutes/alternatives or procure radioactive, controlled drugs, pharmaceuticals/laboratory items under the guidelines or related procedures.8.Assists Purchasing Services in providing training to new employees.9.Liaises with healthcare professional staff or other requestors/departments and representatives of vendor/suppliers, discuss product related matters, negotiate long-term agreements, discounts and payment issues.10.Represents his/her purchasing group in all meetings within department or outside as a member in sub-committees or Ad Hoc Committees.11.Assists the Purchasing Manager in evaluating products.12.Visits market to search and purchase urgently needed items if required.13.Plans vendor visit to discuss product, delivery and discounts.14.Acts as Manager in the absence of the Purchasing Manager.15.Follows all Hospital related policies and procedures.16.Participates in self and other’s education, training and development, as applicable.17.Performs any other related duties as assigned.Master’s or Bachelor’s Degree in Hospital Administration, or other related discipline is required. Grade 09: One (1) year of related experience with Master’s, or three (3) years with Bachelor’s Degree is required. Three (3) years of relatedexperience with Master’s, or five (5) years with Bachelor’s Degree, includingtwo (2) years of (Grade 09) experience is requiredSaudi Nationals only.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}