{
    "Job ID": "69867675",
    "Description": "key Relationship Manager, Employee Banking-(2300016648)Job:Retail BankingPrimary Location:Asia-India-HyderabadSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 4:10:04 AMUnposting Date:30/Sep/2023, 10:59:00 PMJob SummaryCreates and conducts proposal presentations for the portfolio assigned.\nResponsible to maintain cordial relationship with the corporate clients.\nDrive revenue growth to the business with the existing and new corporate customers.\nEnsure knowledge about the market all times to upgrade and rise up to the occasion.\nEnsure that individual targets are met, along with group targets.\nEnsure productivity and cross-sell various products.\nFocus on acquiring new clients - identification of targets\nPlan the client acquisition strategy.\nResolving customer queries and other service issues to maintain customer satisfaction and to meet client excellence.\nLeveraging business from new and established client relationships.\nManaging both assets and liabilities.ResponsibilitiesStrategyMeet the business objectives initiated by the respective country Retail Clients business\nCustomer focus need-based selling\nDeepen customer relationship and maximize penetration\nFullfills corporate employees’ banking needs including payroll and other retail products.BusinessAchieve personal sales target\nSegment focus, customer focus needs-based selling\nActively reducing Non- funding, Sales Error and Increase the Premium Sourcing.\nJob requires generating referrals / cross-selling other products of the bank, such as investments, insurance, mortgages, credit cards ,personal loans etc All relevant internal and external certification to be completed prior to referring / selling wealth products.\nHelp Drive the Employee Banking one bank agenda ProcessesOperational quality -Errors free customer application & documentation\nResponsive and responsible selling\nPractice appropriate sales and marketingRisk Management*Conduct CDD, MLP & TCF diligently\nZero tolerance – Fraud, Mis-selling\nAttend training, acquire knowledge and apply to job function GovernanceAdhere to all policies, guidelines and procedures, comply with local regulatory requirements\nTo comply with all applicable money laundering prevention procedures and, in particular, report any suspicious activity to the Unit Money Laundering Prevention Officer and line managerRegulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead to achieve the outcomes set out in the Bank’s Conduct Principles\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key stakeholdersDirect Sales – Corporate Salary accountQualificationsMBA (MARKETING)\nMust be a graduate. MBA’s will be preferred.\nSales experience of at-least 1 year in the FMCG, Office automation or Retail Banking industry would be an advantage. \nExperience in handling Deposit and Asset Products of a Bank would be an advantage but not a pre-requisite.\nGood knowledge of the selected market and customer segments would be an advantage.\nStrong communication and negotiation skills with the ability to influence outcomes.\nStrong inter-personal skills, which encourages and promotes enthusiasm and team spirit.\nAll relevant internal and external certification to be completed prior to referring / selling wealth products.Role Specific Technical CompetenciesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}