{
    "Job ID": "69866222",
    "Description": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren’t words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You’ll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.Bristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us.BMS Hyderabad is an integrated global hub where our work is focused on helping patients prevail over serious diseases by building sustainable and innovative solutions. This important science, technology, and innovation center will support a range of technology and drug development activities that will help us usher in the next wave of innovation.Position Summary\nThe Senior Manager, EDC Management (Global Library Developer, Tools Developer) contributes directly to the success of the BMS R&D pipeline is responsible for the effective development, management, and implementation of the EDC system at a global level.  This is an individual contributor role.This role reports to the Associate Director, EDC Management within GDM&CM and is a full-time, office-based position.Key Responsibilities•Ensuring the EDC system is being developed and managed at a global level for effective use for study databases which can include one or more of the following:\noDeveloping and implementing the global library structures.\noBuilding, maintaining and documenting the Medidata Rave global library standard objects (e.g., eCRF forms, edit checks) in order to facilitate the creation of study level databases to collect clinical trial data. \noWorking with Clinical Data Standards, Data Managers, and EDC Database Developers to implement new or modified global library objects and to develop appropriate timelines for delivery of the global library objects. \noDeveloping programs/tools to support and/or automate the global library and study level EDC development processes. \n•Managing work assignments to ensure timely delivery. \n•Identifying and resolving issues which may negatively impact delivery of work, using collaborative strategies to reach resolution.  Escalating issues to leadership appropriately. \n•Following procedural documents and participating in reviewing and updating of documents to make sure they are reflective of industry standards and regulatory requirements and include optimal processes. \n•Contributing to the development and application of smart systems and optimal approaches to support the collection of data. \n•Actively participating in and/or leading continuous improvement activities, defining and implementing the changes required to create an industry-leading electronic data capture capability. \n•Supporting preparations and follow-up actions related to Health Authority inspections and internal audits.\n•Liaising with and reviewing work delivered by external partners (e.g. Function Service Providers, CROs, technology providers, etc.) performing activities on behalf of BMS. \n•Developing strong and productive working relationships with key stakeholders throughout GDMCM, GDO, and BMS with the ability to think strategically across a broad portfolio and effectively express his/her views to senior management. \n•Representing the Company in interactions with key external partners as part of any committee or industry group relating to global library development.    Qualifications & ExperienceBachelors degree required•At least 5 years of global clinical trial expertise with a focus on EDC global library development, management, and implementation. \n•At least 5 years of clinical database development experience in Rave with experience in global library management and development of standard data collection objects and/or at least 5 years of programming experience in SAS, Visual Basic (VB) Script, .net depending on the role specific activities.\n•Solid understanding of the drug development process with proven expertise in clinical trial start-up/execution and EDC development, management, and implementation at a global level (not just at the study specific level).\n•Strong knowledge of industry leading EDC tools (e.g. Medidata Rave, Oracle/Inform, etc.) and/or programming languages and well versed in industry trends and emerging technologies supporting data collection. \n•Strong knowledge of GCP/ICH guidelines. \n•Technical expertise, technical writing ability, and proficiency in Systems Development LifeCycle (SDLC) principles. \n•Understanding of database and dictionary structures (e.g. MedDRA, WHODrug). \n•Demonstrated partnership across various collaborative forums. \n•Diverse and sufficient technical expertise to be a credible interface to all global development and business partners (medical, development, commercial, regulatory & quality etc.). \n•Demonstrated ability to self-start, be solution-oriented, collaborate effectively with stakeholders, drive activities to completion, and be accountable for results.\n #HYDDD #LI-HybridIf you come across a role that intrigues you but doesn’t perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.Uniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as “Transforming patients’ lives through science™ ”, every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.On-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.BMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.BMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.BMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.Any data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}