{"Job ID": "69866010", "Description": "Requisition ID: 271498 Relocation Authorized: None \nTelework Type: Full-Time Office/Project \nWork Location: Ras Al Khair About BechtelSince 1898, we have helped customers complete more than 25,000 projects in 160 countries on all seven continents that have created jobs, grown economies, improved the resiliency of the world's infrastructure, increased access to energy, resources, and vital services, and made the world a safer, cleaner place. Differentiated by the quality of our people and our relentless drive to deliver the most successful outcomes, we align our capabilities to our customers’ objectives to create a lasting positive impact. We serve the Infrastructure; Nuclear, Security & Environmental; Energy, and Mining & Metals markets. Our services span from initial planning and investment, through start-up and operations. Core to Bechtel are our values – ethics, safety, quality, people, culture, relationships, innovation and sustainability, and our covenants – integrity, respect, collaboration, trust, and delivery. They are what we believe, what customers can expect, and how we deliver.Role OverviewBechtel is looking for an amazingly talented Lead Information Management Specialist to join our team! In this role, you will get to perform a variety of Information Management functions for a project or department. You will have document management / Information management experience. You will have system experience using Oracle Unifier & BIM & EDMS & GIS. You will report directly to the Data Document Management Manager (DDMM) for this role.Responsibilities may include, but are not limited to the followingEnsures that pre-established document control requirements are satisfactorily met throughout the duration of the Ras-Al-Khair (RIC) project.\nMaintains an established data distribution system and schedule for the assigned project based upon client, project, department, and supplier requirements.\nReview all electronic resources and provide support to all databases in coordination with RIC Royal Commission Technical Affair Section.\nAnalyze all user requirements, ensure effective transition of same into all technical requirements for management processes, and prepare plans for all usability tests for Oracle Unifier.\nSupport the Geographic Information Systems GIS for the EDCC (Engineering Document Control Center) as project focal point for Monitoring and uploading Final As-Built Drawings into GIS and reporting.\nManage the BIM document control process, including receiving, filing, distributing, tracking, and archiving BIM-related documents\nEnsure compliance with the BIM standards set by the client, design team, and other stakeholders\nCoordinate with the BIM team to ensure consistency and accuracy of BIM data and information\nParticipate in project progress meetings and provide updates on the status of BIM-related documents\nConduct periodic audits of BIM-related documents to ensure quality and completeness\nLinking to the BIM agenda and ensuring alignment of the common data environment to other information requirements.\nKeeps up-to-date of Engineering department technologies, techniques and services relevant to area of responsibility. Responds to changing technology environment and participates in decision-making activities relating to customers’ needs.\nProvides assistance to users in capturing and locating electronic information.\nVerifies retention requirements, arranges document cataloging, packing, and long-term storage or disposal of appropriate documents at time of closeout. Manages scheduled destruction of archived documents according to company and/or Client guidelines; provides assistance with document retrieval.\nAssists junior document control staff to ensure effective implementation of project-specific procedures.\nServes as liaison between support group, home office and field personnel. Interfaces with groups inside and outside the organization.\nPerforms other duties commensurate with functional level and responsibilities.\nContributes as a team player who is deadline driven and works well with others.\nPerforms other responsibilities associated with this position as may be appropriate.\nPerform other tasks as assigned by Data Document Management Manager.\nStrive to support Bechtel’s “zero-accident” philosophy through personal safe behavior/work practices and by being aware of surroundings and activities that may be potential safety hazards. Take steps to correct or minimize hazards.\nAbility to work additional hours as needed.Qualifications and Skills:Basic QualificationsRelated Diploma or Degree.\nAt least 10 years of experience with 3 years in ideal document control lead capacity.\nProficient keyboard skills and a working knowledge of MS Windows and related word processing, spreadsheet, and database software.\nWorking knowledge of electronic document management systems (e.g. Aconex & ProjectWise)\nGood leadership and mentoring skills are added advantage but not necessary.\nAssignments will require a working knowledge of Electronic Document Management Systems.\nGood organizational, and interpersonal skills, as well as a demonstrated ability to interact effectively with project personnel and management.\nMust have great attention to detail.\nAbility to follow written direction.\nGood organizational skills.\nWilling to perform repetitive data entry.\nExperience in document control work processes.\nDemonstrated abilities in utilizing databases to perform data entry.\nEffective interpersonal skills (ability to relate at all levels of the organization) with a positive, customer service-oriented attitude.Location: Al-Kharj, Saudi ArabiaGrade 25: At least 12 years of relevant experience with 3 years in a document control lead capacity.\nGrade 26: 18 plus years of relevant experience with 5 years in a document control lead capacity.Shaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}