{"Job ID": "69868127", "Description": "Roles and Responsibility: The success candidate will be the part of an International Design and Engineering Team specialized in Power Transformer design covering different countries. Preparation of General Arrangement, Bill of materials and submission to customer as per project schedule. Responsible to generate active part and windings meeting factory limitation, guideline and checklist as per IEEE standards. Responsible for development of various application transformers designs in coordination with global Hitachi ABB factory based on the purchase order requirements, ordering specification in different areas of transformer Mechanical design Coordinating design activities within a worldwide factories network. Participation in internal design concept reviews. Staff with the Global Design Team: You will be part of a Global Engineering Center team and your task is to contribute to the global design work with positive team atmosphere and networking. Place of Work:             Global Engineering Center Office, Vadodara, India Qualification, Knowledge and Experience: Graduate in Electrical or Mechanical Engineering. 2-7 years’ experience working in Mechanical design for Distribution or Power Transformers manufacturing industry. Candidates with higher experience also to be considered. Should have good understanding of IS/ IEC /IEEE Standards. Should understand clearance/creepage, basic layout and cleats lead arrangement. Experience in winding design is advantage. Knowledge on CAD software, 3D Modeling software like Creo is must. Experience on Microsoft office and tools is an advantage. Skills: Good communication skills in English Language in oral and written form. Ability to speak with and work together with the technical teams in different parts of the world. Demonstrated team building skills, would be a preference. Personal Characteristics: Good verbal and written English is Must Organised and thorough. A team player, open with information and willingly contributes to team discussions with an ability to work without supervision when required. Quick learner with ability to master new areas Additional languages knowledge is considered an advantage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}