{
    "Job ID": "69866237",
    "Description": "Job Description:Job Title:NKP -  FEMA Trade Team Head (AVP)Location: Mumbai, IndiaRole DescriptionHandling of exports, imports, financing product with regards to India regulations.\nLC issuance, Bank guarantee issuance related to local regulations and adherence to FEMA guidelines.\nExperience on NBFC funding, Generic financing, trade credits, Pre & post shipment financing\nWell versed with external benchmark handling of freely convertible currency.\nUnderstanding of trade operational reporting, EDPMS,IDPMS.\nAudit handling. (RBS Tranche III, Concurrent , Statutory)\nTraining and guiding the team to handle trade products and dealing with back office/vendors for improved TAT and measuring quality.\nWorking with product, legal and compliance on strucuted deals and complex deals among other operational handling.\nWorking with customer service and business on requirements from clients and providing solutions.\nNostro and working account montoring.\nWorked on automation projects related to trade products.\nWell versed with RBI master circulars and directions.\nKnowldege of UCP/URDG/URC/URR/ISBP. CDCS certification preferable.\nRisk & compliance mitigation approach.\nManage team independently & ensure work life balance.\nEnsure that transactions processed as per Standard Operating procedures and highlight any procedural modifications wherever required.\nTo ensure that transactions processed within specified TAT.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesThe Trade Operational processes managed by the desk is time critical & is governed by multiple regulations issued by regulators, thus candidate if possible needs to have comprehensive knowledge of external guidelines along with processing knowledge of the products dealt in the local markets or should be willing to pick up the process by putting extra effoty to learn and adapt.\nAround 13 - 18 years  experience in Trade finance industry.Your skills and experienceProficiency in Microsoft Excel / Word a must.\nGood communication skills, oral and written.\nProblem solving attitude and resolving conflicting situations.\nAbility to adhere to tight deadlines and accuracy in pressure situations.\nA customer and service orientation to ensure that outcomes are achieved in line with the organization’s expectations.\nFEMA Knowledge.\nGlobal guidelines understanding (UCP,URDG,URC, ISBP)\nAbility to guide and train the team.Education/ QualificationsMinimum Qualifications - Bachelors Degree from recognised University.\nKnowledge of regulatory guidelines (RBI circular and guidelines)How we’ll support you:Training and development to help you excel in your career \nCoaching and support from experts in your team \nA culture of continuous learning to aid progression \nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}