{"Job ID": "69866278", "Description": "Date Posted:Country:Location:Position Role Type:The Applied Research & Technology (ART) department works with teams around the globe, collaborating with them towards building prototypes, demonstrators, and new products, thereby enabling better innovation and business outcomes for Collins Aerospace.The Emerging Technologies team, part of ART, pursues advanced, emerging, and disruptive technologies and methods relevant to multiple strategic business units (SBUs) with a focus on AI/ML, AR/VR, Cloud and Advance Software Engineering methods.Position Overview:We are seeking a highly motivated individual who is ready to grow and develop the ART – Emerging Technologies team. The individual will be responsible for managing multiple advanced and disruptive technology projects with different stakeholders around the globe. The individual will also be responsible for guiding the teams towards delivering successful Proof of Concepts, Technology Demonstrators and New Product Development.We are also looking for a candidate who is passionate about both people and technology development. The candidate should have a strong background in developing AI/ML applications and should have a good knowledge of Aerospace products & services. The candidate needs to an organized Engineering manager, an active communicator, a good influencer and fluent in the dynamic and everchanging environment of the research and innovation domain.Responsibilities & Duties:·Build and develop the project teams to ensure maximum performance, providing purpose, direction, and motivation towards developing AI/ML applications at Collins Aerospace.·Lead projects from requirements definition through deployment, identifying schedules, scopes, budget estimations, and project implementation plans, including risk mitigation.·To coordinate internal and external resources, ensuring projects remain within scope, schedule, and defined budgets, in collaboration with project staff from various functional departments.·Analyze project progress and, when necessary, adapt scope, timelines, and costs to ensure that project team adheres to project requirements.·Establish and maintain relationships with appropriate client stakeholders, providing day-to-day contact on project status and changes.·Interface with Start-ups and Academia to build new partnerships.·Identify Technology and Industry disruptions in AI/ML on the horizon.Key Competencies & Skillsets:·Good Team Management skills in prior roles as a Project Engineer, Team Lead or a Scrum Master. Experience in coaching and educating project teams to strengthen team members’ capabilities and skill sets.·Strong Software Development experience with AI/ML applications developed for Cloud or Embedded platforms. Good hands-on experience in at least two of the languages - Python, C, C#, C++ or Java is required.·Good experience with Cloud Services & MLOps. Additionally, prior experience in developing AI/ML software for Aerospace industry is a plus.·Strong experience with at least one of the domains – Computer Vision, Natural Language Processing, Data Analytics, with a reasonable understanding of the other two domains. Prior Experience in Generative AI or Explainable AI is a plus.·Strong project management skills with the ability to juggle multiple workstreams simultaneously.·Demonstrated strong interpersonal skills for influencing without authority.·Ability to communicate clearly and well, both verbally and in written form, developing strong partnerships across functions to drive measurable operational results.·Strong focus on quality and ability to navigate through company specific processes.·Ability to ensuring alignment across multiple stakeholders both internally across several business units, and externally with third parties.·Excels in a fast-paced environment with high degree of accountability.·Diligent, disciplined, flexible, reliable, and strives for highest quality output.Qualifications:Minimum:·B Tech. in Computer Science Engineering, Electronics & Communication Engineering or Avionics with a minimum experience of 10 years·At least 3 years of Engineering management experience with teams working on AI/ML technologies.·In depth understanding of project management methodologies (including Agile), and tools like MS Office, MS Project, Kanban boards etc.Recommended:·PMP Certification or Agile SCRUM Master Certification·Advanced degree/certification in Engineering/Management would be a plus.RTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Privacy Policy and Terms:Click on this link to read the Policy and TermsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}