{"Job ID": "69866050", "Description": "What you’ll do\nThe IT Development Specialist focuses upon the development of applications / products in line with the technology roadmap and standards. The IT Development Specialist delivers development of programme logic for new applications / products or analysis and modification of logic in existing applications (activities may also include elements of technical testing). Typically reports to the Senior IT Development Manager of the Head of Technology.\n\nWho you are* Demonstrates a good understanding of procedures and concepts through extensive experience and advices the execution of IT Development plans through the provision of advice and execution of administrative activities;* Effectively interacts with colleagues through development activities enabling achievement of the IT strategy;* Supports the team to deliver activities related, but not limited to development activities in line with the business brief and SLAs, resolving application domain challenges across the critical systems (e.g. Billing, CRM and Provisioning);* Supports the team for the evaluation of Request for Proposal (RFPs) in project delivery. Ensures solving problems, analysis and interpretation of differing situations in order to identify, search and select the best solution;* Uses communication skills to exchange ideas and information in a concise and logical way to provide technological support of demand management during concept and solution design phases and change requests;* Maintains strong relations with relevant stakeholders, to include Architects, Solution Designers, project team and vendors;* Performs other job-related duties or tasks defined by the supervisor or resulting from assigned agendas.Not a perfect fit?Worried that you don’t meet all the desired criteria exactly? At Vodafone we are passionate about Inclusion for All and creating a workplace where everyone can thrive, whatever their personal or professional background. If you’re excited about this role but your experience doesn’t align exactly with every part of the job description, we encourage you to apply as you may be the right candidate for this role or another role, and our recruitment team can help you see how your skills fit in.What's in it for youTogether we canJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}