{
    "Job ID": "69867500",
    "Description": "Branch Operation Manager-(2300016013)Job:Retail BankingPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 1:19:06 PMUnposting Date:23/Sep/2023, 10:59:00 PMThe Role ResponsibilitiesJob RoleApprove daily transactions for selected products as applicable (e.g. traveler’s cheques, cashier’s orders, currency exchange, merchant services, safe boxes) as well as transactions exceeding specified teller limits.\nManage Service Delivery - observe queue time and length; take action as needed to capacitize serving counters and / or managing customer traffic. Ensure that branch premises are maintained to the specified standard. Manage or recommend workflow changes for greater efficiency, improve turn around time.\nMonitor customer satisfaction survey ratings, net promoter score or any other survey / feedback ratings taken from customers and ensure continuous improvement if below bench-mark, sustain and better quality service.\nGeneral Reconciliation and Compliance Activities (may be individually assigned) which may typically include:\nDual control of Cash functions\nControl of Security stationary, deliverables\nReview of processing entries and vouchers\nFollow-up with customers for returned deliverables as applicable (eg. cheque-books / cards / Pins / Combi packs, etc)\nReview of reconciliation proofs for daily control as well as surprise audit proofing.\nPreparation of service quality and productivity management reports and other regulatory returns.\nRectification of internal control issues\nEnsure satisfactory ratings in all internal / external audits conducted at the branch\nEnsure compliance to all Operations health documents like KCD / KRI / OPS manual, process notes and circulars issued from time to time. Perform regular KCS checks mandated. Mandatory reporting of KRIs and teller productivity\nEnsure timely and accurate  submission of all returns both internal and statutory for sales and service.\nEnsure a proper control of Keys, combination settings and passwords that protect cash and valuables.\nEnsure accurate and timely processing of all customer instructions as per applicable processes / circulars.\nEnsure candidate is fully aware of all the policies and procedures issued in relation to ORMA, Group Code of Conduct, KYC / CDD / EDD and Money laundering prevention. Candidate must ensure compliance with these policies and procedures on an ongoing basis. Any suspicious transaction must immediately be\nreported as per guidelines.\nStaff Supervision, Coaching and Training: daily organization of workflow / breaks and staff levels and coaching / training where necessary for improved performance.\nSales Referrals - where relevant, identify prospects for cross-selling from observation of customer transactions to highlight to sales staff.\nAchieve high employee engagement and satisfaction. Ensure optimum teller productivity.\nContribute to branch performance through referrals, efficient customer service, effective operations controls.\nMonitor and track transaction volumes and ensure effective transaction migration to alternate channels of banking.\nHe / She is aware of bank’s Mis-selling and Sales Policies and ensure adherence all the times.\nPremises management in areas of merchandising, housekeeping as well as store management. Branch upkeep and maintenance\nResponsible for health and safety for all. As part of the Health and Safety guidelines you should\nTake reasonable care for the health and safety of co-workers and those who may be affected by your actions or your omissions; Co-operate with Management to support and promote Health and safety in the workplace\nEnsure that your actions do not put others at risk; Work in a healthy and safe manner\nEncourage others to work in a healthy and safe manner\nReport all accidents and incidents and bring to the attention of the management any hazard in the workplace\nAs a manager you are also responsible for the health and safety aspects within your area of control. You need to ensure that\nYour employees are adequately trained and supervised to perform their tasks in a safe manner and are free to raise any Health and safety issues and these issues are addressed appropriately.\nThe contractors working in your area or for you are working in a safe and healthy manner.\nOwnership of the Archival portfolio for the branch. Liaising with the external vendors and ensuring archival and retrieval is carried out in a manner as stated in the policy document without exception.\nMaintain MIS with regard to documents archived with due acknowledgement from the vendor for each of the fileKey ResponsibilitiesEnsure compliance to all Operations health documents like KCD / KRI / OPS manual, process notes and circulars issued from time to time. Perform regular KCS checks mandated. Mandatory reporting of KRIs and teller productivity\nEnsure timely and accurate  submission of all returns both internal and statutory for sales and service\nEnsure a proper control of Keys, combination settings and passwords that protect cash and valuables.\nEnsure accurate and timely processing of all customer instructions as per applicable processes/ circulars\nEnsure he / she is fully aware of all the policies and procedures issued in relation to ORMA, Group Code of Conduct, KYC / CDD / EDD and Money laundering prevention. Candidate must ensure compliance with these policies and procedures on an ongoing basis. Any suspicious transaction must immediately be reported as per guidelinesStrategyAchieve high employee engagement and satisfaction. Ensure optimum teller productivity.BusinessMonitor customer satisfaction survey ratings, net promoter score or any other survey / feedback ratings taken from customers and ensure continuous improvement if below bench-mark, sustain and better quality service.\nGeneral Reconciliation and Compliance Activities (may be individually assigned) which may typically include:\nDual control of Cash functions and try to achieve business numbers through service delivery.ProcessesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}