{"Job ID": "69867984", "Description": "Sutherland is an experience-led digital transformation company. Our mission is to deliver exceptionally engineered experiences for customers and employees today, that continue to delight tomorrow.For over 35 years, we have cared for our customers' customers, delivering measurable results and accelerating growth. Our proprietary, Al-based products and platforms are built using robust IP and automation.We are a team of global professionals, operationally effective, culturally meshed, and committed to our clients and to one another.We call it One Sutherland. #MakeDigitalHuman*Data Entry and Contract Processing will perform data entry related to loan files provided by client to Contractor.*Contractor will review all documents within the funding package to ensure they are present and comply with the client state, and federal requirements.*Contractor will update the loan originations system to accurately reflect the review findings*Reviews all the documentation and information provided to ensure accuracy and completeness based on internal guidelines. \n* Quickly learns and effectively apply the simultaneous use of various applications/systems. \n*Exercises sound judgment to solve operational problems. \n*Works with a sense of urgency \n*Sets and achieves tangible deadlines. \n*Gets ahead and pitches in to help others. \n*Meets or exceed productivity and service goals and standards as defined by leadership. \n*Remains focused and productiveHSC or GraduationData Entry and Contract Processing will perform data entry related to loan files provided by client to Contractor. Contractor will review all documents within the funding package to ensure they are present and comply with the client state, and federal requirements. Contractor will update the loan originations system to accurately reflect the review findings.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}