{"Job ID": "69866154", "Description": "MATERIAL CONTROLLERHelp shape the future of mobility.Imagine a world with zero vehicle accidents, zero vehicle emissions, and wireless vehicle connectivity all around us. Every day, we move closer to making that world a reality. Aptiv’s passionate team of engineers and developers creates advanced safety systems, high-performance electrification solutions and data connectivity solutions so that automakers can bring advanced capabilities to more people around the globe. This is how we enable sustainable mobility and help to prevent accidents caused by human error.Want to join us?Your RoleMonitor and track supplier purchase orders and forecasts on a timely basis to ensure timely availability of materials\n\nLiaise with global vendor planner on supplier shipment conformance\n\nLiaise with production planner to ensure level forecast to suppliers\n\nEnsure suppliers compliance in delivery, services and procedures\n\nStrategize and control material to meet inventory goals\n\nManage materials stock and transactions using SAP\n\nWork with logistic warehouse and production in the materials movement, planning and expediting to support customerYour BackgroundDiploma or Degree in (Logistics & Supply Chain)\n\nStrong co-ordination skills required\n\nStrong excel skills & analytical skills required\n\nStrong communication skills\n\nPossess right attitude towards work commitmentsWhy join us?You can grow at Aptiv. Aptiv provides an inclusive work environment where all individuals can grow and develop, regardless of gender, ethnicity or beliefs.\n\nYou can have an impact. Safety is a core Aptiv value; we want a safer world for us and our children, one with: Zero fatalities, Zero injuries, Zero accidents.\n\nYou have support. We ensure you have the resources and support you need to take care of your family and your physical and mental health with a competitive health insurance package.Your Benefits at Aptiv:If our offering helps us to stand out as an employer in the local market , consider including a list of benefits to showcase our competitive advantages. If not, consider removing this sectionApply today, and together let’s change tomorrow! #CA-S3Privacy Notice - Active Candidates: https://www.aptiv.com/privacy-notice-active-candidatesAptiv is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender identity, sexual orientation, disability status, protected veteran status or any other characteristic protected by law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Morocco", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}