{"Job ID": "69866838", "Description": "NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Sr Manager/ Manager - Tech Support (Backend - PLSQL, Python), Pune India RESPONSIBILITIES -Manager, Tech Support  - 10 to 15 Years :Responding to incidents created from external and internal users - replicate issues, triage, provide workarounds,  restore services, and work with delivery teams if defects require permanent solutions.\nEnd to end coordination of issue to resolution with the user, other support teams, operations, technical delivery teams and vendors if required.\nMaintain knowledge base - Standard Reporting, Knowledge Base, FAQs, Job Aides\nEnsure compliance to standard NIQ Practices / Tools, ITIL, Google, ServiceNow, and JIRA suite (VM)\nInternally prioritize work based on incident priority and deadlines.\nITIL & ITSM is a must skill (Incident and Problem Management they must have experience)\nUnderstanding or exposure to cloud concepts-any one cloud will also be fine.\nImplementation of alerts and monitoring on production systems.\nExperience in Managing 24 X 7 Support Engineers ( Team - 10 members) and supporting weekend calls\nIdentify significant events and patterns based on real time analysis and past experiences.\nHandling minimum 10 members of support team.\nExperience in Monitoring & Observability & handling production deployment activities.\nHands-on in-Service request fulfillment and Support for Server/DB patching, firewall changes.\nLiaise with L3 team for Emergency fixes provided by delivery team are managed, with notification to triage team. Configuration activities (product level hot fixes for basic file and data issues).Senior Manager, Tech Support - 15 + Years :Pinpoint affected application components to focus teams on stabilizing critical user experiences.\nHelp define and implement our Enterprise Monitoring strategy for Multi-Cloud Monitoring and Observability. This includes the collection, delivery, analysis, and visualization of Key monitoring telemetry data around metrics, logs, and traces.\nAssist in building Service Management Process for monitoring platforms covering day-to-day operations, incidents, change, SLA management and Capacity Management.\nDevelop onboarding and integration process and assist in User adoption of monitoring and observability capabilities.\nProvide support to Internal processes related to audit, Compliance, and Risk for monitoring and observability platforms and services.\nHelp define monitoring standards, procedures and manage stakeholder engagement, metrics reporting and monitoring standards governance function.\nDirectly collaborate with End Users, Command Center, Production Support teams and all product stakeholders to understand business requirements, help drive alignment, and build thoughtful solutions.\nProactively identify reliability & data quality problems and drive triaging and remediation process.\nInvest in continuous employee development of a highly technical team by mentoring and coaching engineers and technical leads in the team.\nSolid experience in building and evolving large scale distributed systems to reliably process. Build and lead a team of engineers to deliver reliable, scalable and secure monitoring and analytic services for various business needs.Bachelor’s degree in Engineering, Computer Science, or related field\nGood Hands on experience of some unix shell script ,PL/SQL, Python, Postgres, Mongo DB, MS SQL server programming language.\nExpertise in data processing techniques.\nExperience building services on public cloud platforms like GCP, AWS, Azure.\nAutomation experience.\nStrong communication skills\nExposure to Native Monitoring, troubleshooting skills in the tools including but not limited [DataDog ,Logic Monitor, Pager Duty]\nDataDog Dashboard Creation and Dashboard Tuning and optimization for batch jobs.\nProviding thought Leadership during production triage and incident management call.\nAbility to work flexible & extended work hours as needed.\nPositive attitude, team player, self-starter; takes initiative, ability to work independently.\nComfort working in an Agile environment.\nAdvanced knowledge in infrastructure components. [cloud services, containerization, compute, storage, networking system, On Prem infrastructure]\n Must Have: Exceptional Communication Skills, Flexibility to work in 24 x 7 Shift rotations – Including weekends. Application Support experience in a Microsoft Azure Cloud environment, Microsoft Office Tools, SQL expertise, AnalyticReporting Suite, Metric Dashboards and Application monitoring tools such as Datadog, Logic Monitor, Pager DutyNice to Have: Experience in Global Command Center and SRE practices is a plus.Enjoy a flexible and rewarding work environment with peer-to-peer recognition platforms. \nRecharge and revitalize with help of wellness plans made for you and your family. \nPlan your future with financial wellness tools. \nStay relevant and upskill yourself with career development opportunitiesAbout NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}