{"Job ID": "69869538", "Description": "Demi Chef De Partie, Gastronomy \n(9617)At Atlantis, we exist to bring the extraordinary to every holiday and experience through connection, empowerment, precision, care and warmth. Inspired by the majesty and mystery of the ocean, Atlantis resorts are unique destinations full of life, wonder and surprise, where we seek to exceed our guests’ expectations at every possible turn. Atlantis, The Royal will forever change the landscape of Dubai. Crafted by the world’s leading designers, architects and artists, this iconic destination will offer extraordinary stays, dining, attractions and entertainment. The world is yet to experience anything like it. With a sense of exhilaration and discovery, we create unforgettable memories by providing guests the opportunity to discover an extraordinary world filled with thrilling adventures. Whether we are designing a couple’s retreat or serving the extraordinary in one of our award-winning celebrity chef restaurants, we approach everything with imagination to spark a sense of courage, inspiration and innovation. This is not simply our job, it’s our passion.About the role Are you passionate about the culinary world? Do you thrive working in a fast-paced, multi-cultural environment learning from Talented Chefs? Do you relish the opportunity to use your creativity and innovation? Does this sound like you? If you’re a talented Demi Chef de Partie ready to take on the challenge, we’d love to hear from you!About YouThe ideal candidate will have 1-2 years of experience in a similar role with a proven track record of working in an international luxury hotel. The successful candidate must possess excellent communication skills, be a team player, manage multiple tasks and have confidence in dealing with a diverse set of clienteles.As a Demi Chef de Partie, you will manage and organize the mise en place for your respective section, always producing the highest food quality. As a perfectionist in the kitchen, you will assist the Chef de Cuisine to lead, manage, and organize all kitchen requirements to the highest standards following health and safety operating procedures. In addition to this, you will also have the opportunity to support Chef de Partie and Sous Chef in creating exciting new dishes and recipes.Atlantis Dubai is an iconic entertainment destination comprised of two world-class resorts; Atlantis, The Palm and Atlantis, The Royal; offering an unbeatable opportunity for you to grow and develop in your career.Join a team that is adventurous, creative, warm-hearted and extroverted. We believe in making our guests happy beyond anything they have ever imagined. We wow them at every turn and create memories that will last a lifetime. You will be at the heart of this vision, to constantly innovate to deliver Amazing Experiences and Everlasting Memories.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}