{"Job ID": "69861996", "Description": "AVEVA is a global leader in industrial software. Our cutting-edge solutions are used by thousands of enterprises to deliver the essentials of life – such as energy, infrastructure, chemicals and minerals – safely, efficiently and more sustainably.We’re the first software business in the world to have our sustainability targets validated by the SBTi, and we’ve been recognized for the transparency and ambition of our commitment to diversity, equity, and inclusion. We’ve also recently been named as one of the world’s most innovative companies.If you’re a curious and collaborative person who wants to make a big impact through technology, then we want to hear from you! Find out more at https://www.aveva.com/en/about/careers/The jobBe part of SCADA and advanced applications upgrade projects throughout EURSA region, working with the biggest oil and gas pipeline customers in the region. Participate in all phases of the project delivery, starting from design and then deployment and configuration, testing and troubleshooting as well as providing warranty support. Includes configuration and tuning of the AVEVA baseline software as well as development of small custom apps in accordance with our customer needs. Any previous SCADA experience is an asset.Key responsibilitiesAs a SCADA System Analyst, your day to day activities will include developing applications and creating user interfaces for our applications, creating test documents with different test scenarios, demonstrating developed applications to stake holders, all while ensuring internal processes and company processes are followed. Other responsibilities include:• Participate in code reviews with the team;• Check in source code using version control software;• Develop, enhance and maintain applications interface with Advanced Applications (Measurement Advisor, Gas Day Operations and Pipeline Operations – Liquids);• Develop, enhance and maintain applications using high performance databases to interface with the SCADA Pipeline Edition database or other databases;• Support Delivery teams for any issues or questions for the integration of the developed applications to the customer systems.Requirements- IT Network knowledge, having command of SQL DB- Experience in Microsoft SQL Server Reporting services.- Good command of C# ve C++ programming languages.- Experience in Modbus, IEC104 or similar communication protocols- SCADA, automation experience is preferred.- Good command of English language.- At least 2-3 years of work experience in similar areas.- No travel restrictions.AVEVA requires all successful applicants to undergo and pass a comprehensive background check before they start employment.  Background checks will be conducted in accordance with local laws and may, subject to those laws,  include proof of educational attainment, employment history verification, proof of work authorization, criminal records, identity verification, credit check.  Certain positions dealing with sensitive and/or third party personal data may involve additional background check criteria.AVEVA is an Equal Opportunity Employer. We are committed to being an exemplary employer with an inclusive culture, developing a workplace environment where all our employees are treated with dignity and respect. We value diversity and the expertise that people from different backgrounds bring to our business.\n \nCome and join AVEVA to create the transformative technology that enables our customers to engineer a better world.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}