{"Job ID": "69867240", "Description": "A leading technology company, who are expanding across UAE, are looking for a CISO / Head of Security to drive their cyber security strategy across the Middle East.You will be responsible for establishing and maintaining a company wide information security management program to ensure that information assets are protected.This position is responsible for identifying, evaluating and reporting on information security risks in a manner that meets compliance and regulatory requirements, and aligns with and supports the enterprise risk management.Responsibilities:Develop, implement and monitor a strategic, comprehensive enterprise information security and support risk management program to ensure that the integrity, confidentiality and availability of information is owned, controlled or processed by the organization.\n\nDevelop, maintain and publish up-to-date information security policies, standards\n\nLiaise with the technology teams to ensure alignment between the security and enterprise IT application’s architecture and coordinate the strategic planning implicit in these architectures.\n\nCreate and manage information security and cyber risk management awareness training programs for all employees, contractors and approved users.\n\nDevelop metrics and reporting framework to measure the efficiency and effectiveness of the program, facilitate appropriate resource allocation, and increase the maturity of the security.\n\nProvide regular reporting on the current status of the information security program and IT controls to enterprise risk teams, senior business leaders.\n\nProvide Third-party risk assessments for various IT vendors and Products, and issue security schedules.\n\nCreate a framework for roles and responsibilities with regard to information ownership, classification, accountability and protection.\n\nEnsure that security programs are in compliance with relevant laws, regulations and policies to minimize or eliminate risk and audit findings.\n\nProvide strategic cyber risk guidance for technology projects, including the evaluation and recommendation of technical controls.\n\nLiaise among the information security team and corporate compliance, audit, legal teams\n\nManage security incidents and events to protect corporate technology assets, including intellectual property, regulated data and the company's reputation.\n\nMonitor the external threat environment for emerging threats, and advise relevant stakeholders on the appropriate courses of action.Skills / Experience Required:A minimum of 12 years of professional IT Risk and Security related experience\n\nExpertise and experience in implementing & monitoring Information Security controls, practices and technology for multiple levels within an organization, cascade, and plan\n\nCloud security experience – Azure security certifications is an added advantage.\n\nSOC/Security Incident Management experience – CISM/Similar certification is an added advantage.\n\nNetwork security experience – Firewalls, IPS log analysis\n\nData Security experience – AIP, CASB, DLP, Intune etc\n\nPreventive/Detective security tools – SIEM, xDR, EDR etc\n\nExperienced in handling internal and external audits and IT General ControlsPlease apply today to be considered for this role.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}