{
    "Job ID": "69866226",
    "Description": "Job SummaryThe position controls and is responsible for all company-wide cost plans, monitors and reports on the company project cost plans, and monitors cost and collects the cost data to ensure conformity with the Management’s budget directives regarding cost tracking, forecasting; and financial reporting. The GA Cost Controller ensures resource and activity costing is available on a monthly basis for all projects. Job Responsibilities 1Understands all relevant project documents relating to the cost Management of allocated project(s). Directs the compilation of the CCS accounts for every project audit to ensure correct information is passed to the site. Develops a regime of constant monitoring for the information produced by the cost control system. Manages the completion of the monthly project cost report. Set target dates for cost meetings. Understands all relevant project documents relating to the cost Management of allocated project(s) and provides feedback during the budget approval process. Issue suitable direction to subordinate staff to ensure they have a clear idea of what is required. Supports site Commercial Managers with Budget Transfer information. Reviews, reports and proposes where required Budget (due to missing Items or Miscalculations in the budget) adjustments. Directs the compilation of the CCS accounts for every project audit to ensure correct information is passed to the site. Job Responsibilities 2Develops a regime of constant monitoring for the information produced by the cost control system. Ensures that Projects monthly verification of Stock available at the site and reported to Commercial Director. Prepares monthly reports on PC, SRV, SIV, and reallocation as needed for all projects. Completes regular reviews of the cost reporting mechanism to ensure that it is robust and to best practice standards. Reviews cost control managers' site visit reports and support site visits where required. These site visits are to provide feedback and cost control feedback to the site commercial managers and cost control representatives at least once a month to verify the progress measurements. Submits monthly report for after coordination with site commercial managers the verified into the ERP system of each project (this includes a monthly cost report meeting with the site management team. Produces the Monthly company projects Job Cost Report within 10 Days from the end of the month. Assists in the Production of the Monthly Company Cost Report and achieve it within 15 days from the end of the month.Additional Responsibilities 3Job Knowledge & SkillsKnowledge of Cost Control and estimating packages such as CCS (Candy) is essential. Knowledge in Cost Management, Estimating, and, Change Control. Knowledge of the principles estimating, scheduling, finance, and contract administration.  Computer skills: MS applications and Primavera 6 but not essential. ERP knowledge, preferably SAP functional skills are a requirement to be successful in this role. Job ExperienceMinimum 7 years of total experience.Minimum 4 years of experience in Specialty/industry relevant (required).Minimum 1 year in GCC (preferred).CompetenciesEducationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}