{"Job ID": "69868371", "Description": "It takes the brightest minds to be a technology leader. It takes imagination to create green energy for the generations to come. At Siemens Gamesa we make real what matters, join our global team.Responsibilities:Ensure that all relevant Quality standards and requirements are met.\nEnsure, by verifying it during inspections, the implementation of contract obligations of client provided by the Project Quality Manager in the project specific Quality Management Plan.\nGuarantee that site inspections results are documented and registered.\nCoordinate between inspectors.\nCounterpart for customer quality topics and representative.Tasks:Participate and contribute to Quality Site Kick Off presentation.\nSupport subcontractor to deliver a high-quality product.\nPerform and follow up on inspections, report Non-Conformances, initiate improvements, and gather \"on site\" documentation to fulfil the contractual requirements.\nPerforms quality walk-downs according to Quality Management Plan.\nPerform spot check on installation tools for proper calibration.\nRegister and document inspections results in required IT system.\nRegister deviations in the required systems, request NCR and CO and update status\nSupport internal / external audits by providing documentation to be audited.\nReports the supplier quality status, incidents and problems to Project Manager, Site Manage and Quality Manager.\nSupport Non Conformity and Problem solving processes by providing required evidences.\nSupport corrective actions.\nSupport claim management for Project packages by collecting and preparing supporting documentation for claim management (for both customer and suppliers)\nClaim follow-up and support\nPerforms walkdowns with the customer / his representativeCertification : GWO Certification(Preferred)Expected total years of experience : 3 to 5 years Expected age from the candidate : Less than 30 yearsQualification : Diploma or Degree in Mechanical or Electrical engineeringWork Location : Based on Project requirement. No permanent location. Onboarding will be in Mamandur, Tamil Nadu\n Siemens Gamesa is an equal opportunity employer and maintains a work environment that is free from discrimination and where employees are treated with dignity and respect. Employment at Siemens Gamesa is based solely on an individual's merit and qualifications, which are directly related to job competence. Siemens Gamesa does not discriminate against any employee or job applicant on the basis of race, ethnicity, nationality, ancestry, genetic information, citizenship, religion, age, gender, gender identity/expression, sexual orientation, pregnancy, marital status, disability or any other characteristic protected by applicable laws, rules or regulations. We adhere to these principles in all aspects of employment, including recruiting, hiring, training, compensation, promotion and benefits.We are driven by people - from more than 100 different countries, they build the company we are every day. Our diverse and inclusive culture encourages us to think outside the box, speak without fear, and be bold. We value the flexibility that our smart-working arrangements, our digital disconnection framework and our  family-friendly practices bring to the new way of working.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}