{
    "Job ID": "69865995",
    "Description": "ASSET MANAGEMENT Derivatives middle officeBusiness DescriptionJ.P. Morgan Asset & Wealth Management, is a global leader in investment and wealth management firm with client assets of $2.4 trillion.  The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. Clients include institutions, high-net-worth individuals and retail investors in every major market globally. For individual investors, the business provides retirement products and services plus brokerage and banking services including trusts and estates, loans, mortgages and deposits.OverviewA critical priority for Asset Management is to ensure that a comprehensive set of high-quality data is available to run our business and meet client needs. The team within Asset Management (AM) was established in 2014 to address AM's reference data and account set up strategy. This includes data for clients and accounts, products, securities prices, transactions and holdings, indexes, benchmarks, performance and analytics. We work with the AM business to analyze data, establish data quality standards and ensure data governance. We partner with the business and technology to implement data systems and process solutions. The AM Derivatives team is primarily responsible for supporting OTC & Derivatives business. We also assist in daily enquiries from trading desk, various AM-ops team and provide them tactical/strategic solutions.In order to maintain oversight and control over the business that global derivatives middle office manages there are a number of scheduled meetings that take place on a periodic basis. The meetings are specific to the support of OTC & ETD derivatives and comprise of both internal meetings between the on and offshore middle office teams within JPMAM and our outsourced back office / vendors.Roles and ResponsibilitiesDaily oversight and control of ETD & OTC Derivative\nOTC product affirmation and confirmation\nETD Variation margin settlement\nAttention to details\nResolution of exceptions & queries, Mailbox management. Key Relationships Trading desks\nOnshore partners\nCounterparties, Fund accountants\nRisk management team and technology support for critical applications \nAsset management operations and firm wide teamsQualificationsIndustry Knowledge3-5 years of experience in financial market\nPrior industry experience preferred (18-24 months in current role)Functional Skills Decent understanding of financial markets and products\nGood knowledge on the OTC and ETD derivatives. \nKnowledge of Bloomberg, Marktwire, DTCC/Tradeserve, various industry tools\nGood working knowledge of utilizing MS suite of products Delivery SkillsAttention to details \nDemonstrated ability to prioritize and handle multiple work streams concurrently\nClient focused\nFlexibility to work in night shifts\nExcellent judgment skills - knows when and how to escalate \nAdaptable to working in an evolving and changeable environmentInterpersonal SkillsBuilds strong relationships across globally distributed teams \nAbility to work effectively within team environment.\nCommitted team memberAs a Trading Services Associate, you'll be responsible for understanding trading structures to accurately capture all transactions, complete reconciliation checks, and ensure controls are performed.Job Responsibilities:Timely and accurate capture of all transactions in the Risk Management Systems\nComplete intraday / end of day processes including completeness and reconciliation checks to ensure capture of new trading activity and general book management has been processed accurately\nWork closely with Operations functions and infrastructure groups to support a ‘one team approach’\nEnsure all controls are diligently performed, completed, and signed off on a timely basis\nClear and concise communication with all support teams to ensure the timely and efficient resolution of queries\nParticipate and contribute to the various strategic initiatives; keep improving and evolving processes and business architecture\nBuild an in-depth understanding of all trading structures from both a financial and operational perspectiveRequired Qualifications, Skills and Capabilities:Understand all relevant derivatives and hedging products (Interest Rate Swaps, Basis Swaps, Cross Currency swaps, Forward Rate Agreement (FRA), Foreign Exchange (FX), Zero Coupon and Overnight Index Swaps (OIS), Bond and Futures)\nKnowledge of the front to back Operations process (including the key elements such as confirmations, settlements, and regulatory reporting) and facilitate issue resolution across teams\nUnderstand the key elements of other infrastructure groups (i.e. Finance, Market risk, Credit risk, Operational risk, Legal, Collateral, etc.) and recognize the impact of the actions of the Trade support team on these areas\nMust have clear communication skills and an ability to use these to work collaboratively, explain, and challenge, as appropriate\nStrong problem solving, control, and project management skills\nStrong technical skills, especially in Excel (VBA is a plus)JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}