{
    "Job ID": "69866804",
    "Description": "Job Number 23167001 Job Category Event Management Location Courtyard Bilaspur, Citymall 36, Mangla Chowk, Bilaspur, Chhattisgarh, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Directs and motivates team while personally assisting in providing high quality service based on requirements and standards. Monitors and controls financial and administrative responsibilities including asset protection. Provides clear and concise communications to everyone having ownership in the success of the event. Identifies training opportunities and plans a strategy to accomplish goals. CANDIDATE PROFILE Education and Experience • High school diploma or GED; 2 years experience in the event management, food and beverage, or related professional area. CORE WORK ACTIVITIES Managing Banquet Operations • Projects supply needs for the department, (e.g., china, glass, silver, buffet presentations, props). • Applies knowledge of all laws, as they relate to an event. • Understands the impact of Banquet operations on the overall success of an event and manages activities to maximize customer satisfaction. • Adheres to and reinforces all standards, policies, and procedures. • Maintains established sanitation levels. • Manages departmental inventories and maintains equipment. • Uses banquet beverage records to control liquor costs and manage the banquet beverage perpetual inventory. • Schedules banquet service staff to forecast and service standards, while maximizing profits. • Assists team in developing lasting relationships with groups to retain business and increase growth. Participating in and Leading Banquet Teams • Sets goals and delegates tasks to improve departmental performance. • Conducts monthly department meetings with the Banquet team. • Applies and continually broadens knowledge of food and wine pairings and cutting edge cuisine with emphasis on current event trends. • Acts as a liaison to the kitchen staff. • Leads shifts and actively participates in the servicing of events. Ensuring and Providing Exceptional Customer Service • Sets a positive example for guest relations. • Interacts with guests to obtain feedback on product quality and service levels. • Responds to and handles guest problems and complaints. • Empowers employees to provide excellent customer service. • Ensures employees understand expectations and parameters. • Strives to improve service performance. • Emphasizes guest satisfaction during all departmental meetings and focuses on continuous improvement. • Reviews comment cards and guest satisfaction results with employees. Conducting Human Resources Activities • Communicates and executes departmental and property emergency procedures and ensures staff are trained in safety procedures. • Observes service behaviors of employees and provides feedback to individuals. • Monitors progress and leads discussion with staff each period. • Participates in the development and implementation of corrective action plans. • Reviews quarterly Meeting Planner Survey results and participates in the development and implementation of corrective action to address service challenges; focuses on continuous improvement of guest satisfaction. • Attends and participates in all pertinent meetings. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. At Courtyard, we’re passionate about better serving the needs of travelers everywhere. It’s what inspired us to create the first hotel designed specifically for business travelers, and it’s why the Courtyard experience today empowers our guests, no matter the purpose of their trip. We’re looking for achievers who are passionate about providing a guest experience that goes above and beyond, enjoy being part of a small yet ambitious team, and love learning how to always improve – all while having fun. In joining Courtyard, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}