{"Job ID": "69869668", "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:Your responsibilitiesPlanning, preparing, and coordinating pre-commissioning or commissioning or start-up activities leading to project completion.\nManufacturing Production Workers focus on setting up, operating, maintaining, and troubleshooting manufacturing production (i.e., machining, processing, assembly, or packaging) equipment including Operating machine tool, chemical processing, assembly, or packaging equipment to manufacture products according to production specifications, schedules, volume and cost and wastage targets, and quality standards.\nMoving, packing, and sorting raw materials or finished goods and monitoring the quality of output to identify, discard, or re-manufacture faulty products.\nWorking is routine or follows standard procedures, only very occasionally require interpretations or deviation from standard procedures and under close to moderate supervision.\nCommunicating information that requires some basic explanation or interpretation.\nMaintaining accurate daily production records as input to manufacturing performance analysis\nLiving Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.Your background          A bachelor’s degree in relevant field is required.\nAn Entry Para-Professional requires very basic knowledge of job procedures and tools obtained through limited work experience and may require vocational education.\nProficiency in both spoken & written English language is required.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}