{
    "Job ID": "69869088",
    "Description": "JOB PURPOSETo assist in ensuring the availability of high-quality support and engagement for Abu Dhabi’s culture sites’ visitors, tourists, and residents through the various DCT Visitor Service Centres by providing world-class care and service to the customers.ACCOUNTABILITIESKey AccountabilitiesVisitor Service Center OperationsLead Visitor Services by ensuring the site operations maintain adherence to DCT’s set service standards and industry best practices.\nEnsure that the site is well presented, efficiently organised, easy to use and accessible to tourist and customers.\nInform and educate visitors about the relevant cultural and social policies, rules, regulations.\nWork closely with the site Unit Head and Supervisor to ensure the effective co-ordination of events/activities but not limited to exhibitions, events, venue hire, collections and education groups.\nPromote Abu Dhabi’s various events and festivals in order to invite and encourage visitors to the site and increase overall visitor satisfaction.\nAnalyze different markets and various international events to decide on suitable promotional events to participate. Meet Government and industry partners to discuss issues relating to respective region.\nCoordinate and implement daily operations at the Admissions Area, by managing the queuing system effectively, seeking out visitors and offering assistance to maintain visitor satisfaction.Customer ServiceRemain abreast of the relevant information and data related to local accommodation, attractions, activities, events and festivals in order to convey high-quality and well-informed recommendations and educational material to visitors.\nProvide general educational and cultural awareness to visitors through highlighting the significance of key historical sites and tourism destinations\nEnsure the interests of Abu Dhabi’s visitors and tourists are met by providing guidance that is fitting to their unique needs and requirements.\nCommunicate information to members of the public and respond to enquiries in person, by email and over the phone.\nEnsure that customers and visitors’ questions and concerns are resolved properly and coordinate with subordinates to deal with challenging customers that require escalation to address all customer needs.\nProvide guidance and information to visitors using available information systems, leaflets, timetables, guidebooks and DCT Tourist Service Centre reference kits.\nImplement highest level of customer service standards and monitor visitors’ experiences and feedback/complains and coordinate with internal and external stakeholders to identify solutions.Feedback Tracking and MonitoringEnsure collection of feedback from visitors, tourists, and residents through surveys and questionnaires’ to gauge their impressions and satisfaction and the degree of success of certain events. \nSupervise a database of records, responses, and feedback to communicate findings as appropriate.\nRecord the number of visitors and customers and advise on methods of enhancing visitors’ experience and engagement.Policies, Processes and ProceduresFollow all relevant section policies, processes, procedures and instructions so that work is carried out in a controlled and consistent manner.CollaborationCollaborate with internal and external stakeholders on matters related to The sites unit in order to facilitate flow of information and build awareness of key initiatives or relevant developments.Day-to-Day OperationsFollow the day-to-day operations set by the Line Manager in the The sites section to ensure continuity of work and the delivery of effective and high quality outputs.\nReport on a regular basis to The sites Section Manager on operational activities, challenges, hurdles and methods of resolution or mitigation etc. as required to keep the Line Manager informed and updated about the unit’s activities.EHS (Environment, Health and Safety)Comply with all relevant EHS guidelines, policies and procedures, by reporting incidents and hazards on a timely manner, and reduce consumption of natural resources to support in protecting the environment and ensure a healthy and safe work environment.Change ManagementSupport the creation of culture susceptible to change management through a ‘hands-on’ and ‘can-do’ approach to DCT’s new business opportunities, participating in the development of new initiatives, meeting planned targets, and demonstrating preferred high-performance behaviours.COMMUNICATION & WORKING RELATIONSHIPSInternalExternalCulture SectorTourists\nKey Vendors & Suppliers\nVisitors\nTourism AuthoritiesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}