{
    "Job ID": "69868545",
    "Description": "JOB PURPOSE:  \nSupervise and conduct the maintenance activities for Firefighting and dewatering systems.RESPONSIBILITIES/DUTIES:\n•    Supervise, coordinate, and control all maintenance activities.\n•    Monitoring preventive and corrective maintenance activities for Electromechanical systems.\n•    Supervise & execute all mechanical maintenance tasks. \n•    Supervise & execute all electrical maintenance tasks.\n•    Maintenance of motor control circuits and process controls.\n•    Work on electrical system up to 480 VAC.\n•    Utilize the root cause analysis to investigate breakdown of the failures.\n•    Inspects operating equipments for conformance with operational and safety performance. \n•    Observe and test the operation of equipments to diagnose malfunctions, using testing devices. \n•    Conduct preventative and corrective maintenance for submersible and dry pumps.\n•    Conduct preventative and corrective maintenance work firefighting systems (FM200, CO2, Foam system, Sprinklers, Pumps, Co2 ...)\n•    Conduct periodic Inspect for fire extinguishers. \n•    To ensure all the field activities are carried out as per Safety standards.ESSENTIAL QUALIFICATIONS, KNOWLEDGE & EXPERIENCE \nQUALIFICATIONS: \n•    Diploma/ or a suitable relevant degree.\nKNOWLEDGE: \n•    Had good experience in maintenance process either mechanical or electrical.\n•    Strong knowledge of maintenance of firefighting systems.\n•    Had good experience in maintenance of submersible pumps. \nEXPERIENCE: \n•    10 years of experience in maintenance of pumps and firefighting systems.\n•    5 years of experience in maintenance of metro stations (Preferred).DESIRED BEHAVIORS: \n•    Ability to communicate with staff.\n•    Teamwork \n•    Good listener.\n•    Had the ability to learn new techniques. \n•    Problem solving abilityJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}