{"Job ID": "69866634", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.POSITION TITLE:Senior Software EngineerREPORTING TO:                            ManagerREPORTING LOCATION:              Bangalore/chennai/NoidaSUMMARY OF ROLE AND OBJECTIVES:Candidates should be responsible for design, development and implementation of Programmable.logic controller (PLC) programming at the core is a computer with a high degree of reliability capable of running.a program without interruption 24/7/365 environment. ROLE & OBJECTIVES:Specific Assignments:The main responsibilitiesDevelop, deploy, maintain and troubleshoots machines and plants that use programmable logic controllers.\nIntegrate the PLC programming with other external software, which are specific to instrument and LIMS application.\nWorks closely with Lab users at a global level to understand business requirements and implement new solutions.\nAnalytical thinking, knowledge on HTML, control programs, indirect addressing and arrays.    Other Assignments:Maintain sites and services once they are live by measuring and monitoring availability, latency and overall system health.Scale systems sustainably through mechanisms like automation, and evolve systems by pushing for changes that improve reliability and velocity. QUALIFICATIONS AND EXPERIENCE REQUIRED:Strong 3 years of experience in designing, implementing programmable logic controllers and integration withother Instrument software's.REQUIREDStrong hands-on knowledge on PLC Programming, working Live with PLC and instruments.\nStrong hands on Indusoft web studio to design the interfaces and programmes.\nWorking knowledge of XML, XSLT and XSD\nHands on ODBS and Math worksheets.\nWorking on Various protocols specifically on TCP/IP\nHands on experience on SQL Server 2009 or above or any other relational databases.\nHands-on technical skills with a can-do attitude and ability to work in a dynamic, fast paced environment.\n Strong hands on Microsoft technologies C#.Net, C# Winforms, C# webservices\nMachine Learning Algorithms\nIIS Deployments experience\nStrong analytical and problem-solving skills.\nHigh affinity towards modern technology and cloudADDITIONAL SKILLSExperience in working with large databases\nT-SQL and data analysis skills\nSQL Server query optimization & performance tuning skills\n  Knowledge in scripting languages (Python, ShellScript etc.)\n  Knowledge Messaging Service buster/MSMQ will be added advantage.\n  Ability to come up with new technologies, methods and ideas, and guiding the team for further implementations.Methodology we have in place and expect to be followed:Scaled Agile, Lean, Kanban, Zero Defect development method\nDaily Scrums / Standups with other developers directly involved\nScrum of Scrums, Innovation Sprints (after every 3rd Sprint)\nContinuous integration\nAutomatic Build and Deployments\nAutomated Unit & Functional Testing\nFollow Development guidelines and coding style\nSonarQube based Static Code AnalysisAPPRECIATEDCertifications with Microsoft Azure Cloud.PREFERRED Personal profileVery good interpersonal relation skills;\nThe successful candidate will have a self-motivated, get-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas; and the discipline to pay attention to deadlines, details and quality.\nAbility to work in a complex international environment;\nEager to learn and continuously develop personal and technical capabilities.\nShould have prior experience of Production Support, Incident managementEDUCATION REQUIRED:B.E or B.Tech or B.Sc. or M.Sc. in Information Technology/Computer Science\nLanguages: Fluent in English.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}