{
    "Job ID": "69865569",
    "Description": "About the CompanyWe are the largest oil producer within the ADNOC Group, accounting for over half of ADNOC’s total oil production. As the country’s oldest oil production company, our operations date back to 1939, when a 75-year concession was signed to explore for oil and gas in Abu Dhabi. As a global industry leader in environmental sustainability, we are the first in the world to capture carbon from the iron and steel industry. Our Carbon Capture, Utilization, and Storage (CCUS) facility at Al Reyadah has the capacity to capture 800,000 tonnes of carbon dioxide (CO2) from Emirates Steel Industries (ESI) each year, for us in the Bab and Rumiatha oil fields to support Enhanced Oil Recovery (EOR).About the JobCarry out day to day Telecom maintenance activates in addition to corrective and breakdown maintenance activates related to all Telecom equipment in the assigned field / area. Key AccountabilitiesCarry out routine and preventive maintenance work, repair and testing of Telecom equipment in line with Standard Operating Procedures (SOP’s) and established safe working practices. Responds to work requests/work orders in a timely manner as per work assignments from Telecom Engineer.   Obtain the necessary work permits and certificates as per maintenance procedures and company HSE regulations to safely carry out routine and non-routine tasks.    \n\nMake routine inspections on Telecom installations at various sites within the field/area of responsibility to determine equipment serviceability and ensure that all test equipment and measurement devices are well calibrated and have a valid certification. \n\nMonitor Telecom network performance over the Network Management Systems (NMS) software to determine failure conditions and bring it to the attention of Telecom engineer for quick troubleshooting and resolution.   \n\nCarry out modification and new equipment installations as per approved plans in line with Telecom engineer’s directions and supervises external contractor work as assigned.   \n\nParticipate in the trouble shooting and repair of Telecom equipment that involves other disciplines such as instrumentation in close cooperation with other disciple technicians and external agencies. Interact and Interface with other disciple maintenance personnel as well as external agencies like Etisalat, maintenance contractors Etc. to carry out troubleshooting and maintenance activities. \n\nUpdate maintenance records, databases and redlines as built drawings on modifications for all Telecom equipment in use and update work records in Maintenance Management System.  \n\nCarry out the repair and testing of Telecom equipment modules in a workshop environment \n\nPrepare and maintains a variety of records, files, drawings, manuals, databases etc.. related to Telecom equipment installed, maintenance activity carried out and spare holding.   Minimum RequirementsDegree or Diploma in Telecoms Engineering or equivalent relevant degree / education\n\nAt least 5 years in the same or similar role working in an oil and gas industryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}