{
    "Job ID": "69866020",
    "Description": "Responsibilities:Conduct complex enquiries and investigations for problems that frontline contact centre teams cannot resolve.\nProvide required audit trail and documentation to support the work performed.\nGather requirements and support the build of tools and processes to enhance the work of the C&C team\nLiaise with Development & other Operations teams to co-ordinate the C&C Ops journeys.\nAnalyse current performance of the team and publish statistics and reports.\nSupport and deliver training material for Contact Centre and Ops teams.\nCreate and update playbooks for C&C Ops Team for new payment products.Skills: Relevant knowledge and experience, ideally in a back office, middle office, operations, or similar function of a banking/financial services organisation\nKnowledge and understanding of cards scheme/network, retail banking platforms\nIdeally previous payments experience/knowledge of Visa or MasterCard \nBasic knowledge of Mastercard rules, FPS / BACS / CHAPS / SWIFT scheme with a detailed understanding of at least one scheme\nWillingness to learn new schemes and rulebooks to support C&C Ops. \nDiverse product knowledge, with an ability to develop an understanding of new products\nAbility to work under considerable time pressure, whilst maintaining a high level of accuracy and quality\nExcellent communication and organisational skills\nStrong analytical skills to analyse the information, identify the problems, and work towards finding the solutions\nAbility to partner and influence across businesses and other support groups\nControl focus and mind-set at all times, whilst respectively challenging the status quo\nAttention to detail whilst being cognizant of materiality levels\nA relevant degree, accounting, or financial qualification would be beneficialJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}