{
    "Job ID": "69867128",
    "Description": "About Freshworks\nFreshworks makes it fast and easy for businesses to delight their customers and employees. We do this by taking a fresh approach to building and delivering software that is affordable, quick to implement, and designed for the end user. Headquartered in San Mateo, California, Freshworks has a global team operating from 13 global locations to serve more than 65,000 companies -- from startups to public companies – that rely on Freshworks software-as-a-service to enable a better customer experience (CRM, CX) and employee experience (ITSM).\nFreshworks’ cloud-based software suite includes Freshdesk (omni-channel customer support), Freshsales (sales automation), Freshmarketer (marketing automation), Freshservice (IT service desk), Freshchat (AI-powered bots), supported by Neo, our underlying platform of shared services.\nFreshworks is featured in global national press including CNBC, Forbes, Fortune, Bloomberg and has been a BuiltIn Best Place to work in San Francisco and Denver for the last 3 years. Our customer ratings have earned Freshworks products TrustRadius Top Rated Software ratings and G2 Best of Awards for Best Feature Set, Best Value for the Price and Best Relationship.Responsibilities:● Build product and domain expertise by understanding product functionalities, market        positioning, competitive landscape, product market fit and so on \n ● Establish and maintain healthy relationship with partner teams, prospects and customers in various geographies\n ● Own and meet assigned sales targets (co-owned by channel managers) by working closely with partner sales teams\n ● Collaborate with various internal functions like presales, customer success, marketing, and support to ensure seamless support for partners and customers\n ● Understand local markets thoroughly including factors influencing buyer’s decisions like\n economy, technology, and so on\n ● Assist partners on issues with conversions, objection handling, providing necessary\n resources to achieve closure\n ● Discover and implement new / market-specific lead generation exercises to expand/grow\n existing account base, working closely with marketing teams, CSM and reseller sales teams\n ● Be the single point of contact for partners for all things technical\n ● Coordinate with internal stakeholders and follow up for partners on customer queries\n ● Arrange online training sessions and ensure the partner is up to speed with what&#39;s new in the product\n ● Handle incoming support tickets from partners, manage escalations from\n partners/customers\n Drive the team and motivate them to achieve the primary numbers as well as secondary numbers from the channel teams.\n Qualification/Experience:Bachelor’s degree preferred in computers, marketing or similar stream\n6-10 years of experience in channel sales and hard core Sales.Requirements:\n ● Be willing to work in shifts ( ANZ to NA regions based on the requirement )\n ● Demonstrate high project management skills, Team Buidling, task tracking.\n ● Excellent verbal and written communication skill\n ● Must be willing to travel as required to territory aligned.\n ● Self-motivated with a proactive approach on projects\n ● Technical knowledge on products\n ● Attention to detail, ability to articulate clearly\n ● Interpersonal skills, ability to build rapport - required for close collaboration with cross-\n functional teams at Freshdesk and with partners in the assigned territoryMBA and All your information will be kept confidential according to EEO guidelines.At Freshworks, we are creating a global workplace that enables everyone to find their true potential, purpose, and passion irrespective of their background, gender, race, sexual orientation, religion and ethnicity. We are committed to providing equal opportunity for all and believe that diversity in the workplace creates a more vibrant, richer work environment that advances the goals of our employees, communities and the business.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}