{"Job ID": "69865576", "Description": "Ensure effective completion of month-end/year-end procedures & closing of accounts which include regular review of trial balances, review of individual general ledger accounts, approval of transactions, review and posting of journal entries, deciding on provisioning, co-coordinating with other Business Units and departments on various transactions, updating monthly schedules etc.\nPrepare consolidated Financial Statements together with the relevant schedules and (Income Statement, Balance Sheet) related party details and other related schedules and reporting on a timely manner to DP World Corporate Head Office.\nReview of Legal documents.\nReview concession agreements and calculations and compliance with IFRS 16.\nTo manage the Regional Quarterly Balance sheet review.\nCarry out detailed analysis of the financial statements (income statement, Balance sheet and Cash flow statement) on monthly basis including analysis of key financial ratios. Investigation and documentation of major variances and reasons for those variances to support Management decision making.\nSupport the Tax sections for Financial Accounting Related matters.\nCo-ordinate with other sections of Finance such as Receivables, Payables and Treasury to ensure proper recording of transactions, rectification of errors, if any, providing support & resolving issues.\nTo meet specific DP World HO requirements as and when required.\nTo manage the requirement of Investors reporting.\nTo manage the dividend workings for JVCO Entities.\nLiaise with the auditors to ensure smooth completion of all audits carried out and provide other relevant information and support as and when required. Additionally, to ensure that all issues highlighted by the auditors are resolved on timely manner. The completion of audits to include the below Entities for half year & yearly end audits:Combined audited financials (JAT + JAFZ +NIPM+JVCO)\nJebel Ali Terminals FZE\nJabel Ali Free Zone FZE (\"JAFZ\")\nNational Industries Park FZE\nDP World Jebel Ali Terminals and Free Zone FZCO\nDP World UAE region FZE\nEconomic Zone World (EZW)\nDubai Auto Zone Management FZE (Ducamz)\nDubai Textile City Management FZE (DTC)\nBusiness Center WorldPrepare power point presentations for GL’s monthly accounts to meet management accounting requirements when needed including preparation of the monthly KPI results.\nTo support staff and helping them in sorting out various matters/issues as and when it arises thereby ensuring smooth running of finance function.\nTo mentor Financial Accounting Staff and develop their skills.\nTo manage the SSD cost allocation from JVCO.\nTo manage the Yearly Revenue certificate for various Authorities.\nTo manage the requirement and the preparation of Board Reports for DPW UAER, EZW & JVCO.\nTo manage Fusion Mapping for new GL & Analysis code.\nTo manage the relationship with IT and assist with Systems Implementation & Other IT issues related thereby ensuring updated financial systems to meet financial requirements with a view to identifying, evaluating and driving continuous improvement of the finance function in collaboration with wider stakeholders of DP World GCC.\nPrepare of Flash reports for all Business Units of DP World GCC Region.\nManage intercompany balances for all Business Units of DP World GCC Region, P&T and EZW.\nManage reporting and consolidation of all Business Units of DP World GCC Region, P&T and EZW.\nParticipate in budgeting exercises and assist Management Accounting whenever needed while preparing the consolidated budgeted financial results and help analyze various scenarios, costs and revenues.\nTo manage the Finance Department internal Policy by reviewing it and updating it whenever required.\nTo manage the risk, register of DP World Finance GCC Region.\nTo be up to date with IFRS standards and apply it to the day-to-day activities within Finance Department to ensure full compliance with global accounting standards and best practices.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}