{"Job ID": "69866323", "Description": "About Eurofins – the global leader in bio-analysisEurofins is Testing for Life. The Eurofins network of companies believes that it is the global leader in food, environment, pharmaceutical and cosmetic product testing and in discovery pharmacology, forensics, advanced material sciences and agroscience contract research services. It is also one of the market leaders in certain testing and laboratory services for genomics, and in the support of clinical studies, as well as in biopharma contract development and manufacturing. It also has a rapidly developing presence in highly specialised and molecular clinical diagnostic testing and in-vitro diagnostic products.With over 62,000 staff across a decentralised and entrepreneurial network of ca. 900 laboratories in 61 countries, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of a wide range of products, as well as providing innovative clinical diagnostic testing services and in-vitro diagnostic products.Eurofins companies’ broad range of services are important for the health and safety of people and our planet. The ongoing investment to become fully digital and maintain the best network of state-of-the-art laboratories and equipment supports our objective to provide our customers with high-quality services, innovative solutions and accurate results in the best possible turnaround time (TAT). Eurofins companies are well positioned to support clients’ increasingly stringent quality and safety standards and the increasing demands of regulatory authorities as well as the evolving requirements of healthcare practitioners around the world.Eurofins has grown very strongly since its inception and its strategy is to continue expanding its technology portfolio and its geographic reach. Through R&D and acquisitions, the Group draws on the latest developments in the field of biotechnology and analytical chemistry to offer its clients unique analytical solutions.Shares in Eurofins Scientific are listed on the Euronext Paris Stock Exchange (ISIN FR0014000MR3, Reuters EUFI.PA, Bloomberg ERF FP).We are looking for a young professional who is passionate about data to join us in Bangalore as a part of our ComLIMS Program. \n\nThe ComLIMS Program (Communication and Laboratory Information Management System) consists of two internally developed web applications and a range of additional services (reporting services, data services, Business Intelligence services) which allow our internal customers, the Eurofins laboratories worldwide, to sell their services offered to Eurofins customers. The ComLIMS Program is at the heart of Eurofins' strategy of cross-selling and competence centers. Components of the Program and its data are used by most Eurofins applications, which makes the ComLIMS Program an essential part of ensuring efficient end-to-end sales, production processes and much more.As a Junior Data Management Specialist, your role will be to manage the catalogue of Offers within our ComLIMS Program.Responsibilities:Maintain high levels of data quality and support data analysis.\nManage internal customer (laboratory) data migration and/or data clean-up projects, as well as the daily customer requests according to business priority.\nFollow strict company guidelines and procedures for various customer requests (access management, data management, service requests...) for the review, approval and execution of such requests.\nReview incoming requests for quality and compliance.\nSupport Editorial committee of internal marketing newsletter (proofreading, layout creation, subscription management);\nPerform ad-hoc data extraction by collaborating with Business Analysts and Software Developers.QualificationsBachelor’s degree in business, Science or similar. \nStrong understanding of Excel is required.\nKnowledge of SQL is an advantage.\nFamiliarity with Microsoft SSIS or Excel VBA is an asset.\nKnowledge of Microsoft SharePoint, PHP and WordPress is a plus.\nCritical thinking and detail-orientated skills.\nNot afraid of working with large amount of data / IT work.\nExtreme attention to details – rigor is key as errors in the data handled by the team can have very heavy consequences for the program.\nFluent English communication skills (written/oral). Knowledge of another language is a plus; Clear in written communication.\nKnows how to follow procedures.New graduates who meet the above requirements are highly encouraged to apply!\nAny Full time Degree What We Offer:Challenges within a multi-cultural and cross-regional team as part of the international and fast-growing Eurofins organization.\nA dynamic working environment with a good team spirit where personal development and growth are encouraged.\nResponsibilities for key applications of Eurofins.\nIn a fast-growing group, successful team members are being offered increased areas of responsibility (within the Program and the Eurofins Group);\nExtensive on-the-job coaching.\nAttractive salary package with other benefits.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}