{"Job ID": "69867895", "Description": "Office Manager cum AccountantApply nowThis role provides support to project management team in executing projects.\nThe job description covers assisting in all aspects of a project are dully attended to and completed at the right time, regardless of challenges that may be encountered.\nProject assistants will assist project team in logistics related to work.\nHe/ She will keep track of all activities, like sub-consultancy contract renewals, vendor registrations, invoices (vendors and client), timesheets, trainings by project team, connected conversation status, document control on SharePoint, maintenance of site office infrastructure list, attendance records on site, etc. and ensure that they constantly remind Project team of what needs to be done in order to meet up with deadlines.\nOther responsibility will include:Coordination with other functional departments like finance, facility for compliances.\nUpdating Billings and cash collection plans and forecast in discussion with project managers\nUpdating deployment schedules.\nPreparing and getting approval of credit note.\nAssist project managers in recruitment/resource management.\nCoordinate with site office managers and team to resolve issues related to site\nCreate specific strategies for easier and effective execution of projectAssist project managers in action on outcome of Steering Committee Meetings and ensure to maintain all information on a monthly basis and ensure that it meets all necessary protocolsDesired Qualification, Skills and ExperienceBachelor’s Arts, Commerce or Science or equivalent.\nExperience: 3-5 years of experienceAgile and safe working environment\nCompetitive annual leave and sick leaves\nGroup incentive scheme\nGroup term life insurance, Workmen’s compensation and Group medical insurance coverage\nShort and Long-term Global employment opportunities\nGlobal collaboration and knowledge sharing\nDigital Innovation and TransformationEquality, diversity and inclusionAgile workingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}