{
    "Job ID": "69866670",
    "Description": "Job Requisition ID: 156524 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every dayOverview of the roleWe are looking for a high-performing Commercial Department Manager to help us meet our customer acquisition and revenue growth targets by keeping our company competitive and innovative. You will be responsible for maximizing our sales team potential, crafting sales plans and justifying those to plans to the upper management.What you will doAchieve growth and hit sales targets by successfully managing the sales team\nDesign and implement a strategic business plan that expands company’s customer base and ensure it’s strong presence\nOwn recruiting, objectives setting, coaching and performance monitoring of sales representatives\nBuild and promote strong, long-lasting customer relationships by partnering with them and understanding their needs\nPresent sales, revenue and expenses reports and realistic forecasts to the management team\nIdentify emerging markets and market shifts while being fully aware of new products and competition statusRequired Skills to be successfulExcellent communication and presentation skills\nDemonstrated ability to communicate, present and influence credibly and effectively at all levels of the organization\nProven ability to drive the sales process from plan to close\nExcellent mentoring, coaching and people management skillsWhat equips you for the roleHigh School Educated\nExcellent Excel and Microsoft skillsAbout Al-Futtaim RetailAl-Futtaim Retail has established itself as one of the leaders in Retail across the Middle East, Africa & Asia over the past 30 years. We have developed partnerships with some of the biggest and most respected Brands in the world including IKEA, ACE and Toys R Us in the Middle East and the Inditex Group of Brands (Zara, Mango, Bershka and P&B) across Asia. We are also one of the largest Global partners of Marks and Spencer’s in both regions with over 75 stores offering both fashion & food options.\n \nMost recently we have been responsible for bringing brands to the Middle East for the first time with the exciting launches of Watsons and B&Q and we aim to continue to be agile and adaptive to our markets with new launches and further development. For this to be possible we aim to recruit the best talent from all backgrounds who will continue to challenge and develop our diverse workforce which includes over 100 nationalities across 12 countries. Join us today and make a difference…Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}