{"Job ID": "69869864", "Description": "Bosch Global Software Technologies Private Limited (BGSW) is a 100% owned subsidiary of Robert Bosch GmbH. We are one of the world’s leading global suppliers of technology and services, offering end-to-end Engineering, IT, and Business Solutions.With a global footprint and presence in US, Europe, Japan, China, and the Asia Pacific region, we are at the forefront of designing, developing, and executing IoT ecosystems through our all-encompassing capability within the 3 aspects of IoT – Sensors, Software, and Services.We have always focused on improving the quality of the life of people, providing newer revenue-generating opportunities, and improving operational efficiencies for enterprises through an array of solutions. With our unique ability to offer end-to-end solutions that connect Sensors, Software, and Services, we enable businesses to move from the traditional to digital, or improve businesses by introducing a digital element in their products and processes.The positionIn order to get closer to our vision of accident-free driving, we are developing safe and high-quality software and system solutions. As part of our team, you will be part of our journey in creating a new world of assisted and automated driving. As part of our international and diverse global team, you will paly a key role in the development of base software for next generation of vehicles. You will be taking ownership of key aspects of SW development and drive high quality deliveries.As part of our team, you will have the opportunity to influence the development of high-resolution sensors: Radars & Video cameraYou will have opportunity to learn and contribute to high-quality driving assistance systems. In addition, you will have the opportunity to influence engineering experts of tomorrow by coaching and mentoring.ResponsibilitiesTakes responsibility: you will be responsible for COM stack implementation based on the AUTOSAR\nCreate and maintain technical specification of components. If necessary, work in close collaboration with architect, function developers, product owner and other stakeholders to clarify and understand requirements\nYou design and develop system- and hardware-related software components in C++ in compliance with current guidelines and standards, carry out analyses and reviews as well as the implementation of fully automated, High-performance unit tests based on model or target platform\nShall be using innovative ideas and concepts to solve/implement customer requirements.\nProactively highlight technical challenges and actively contribute to deriving solutions and ensure prioritization for timely implementation with product owner\nYou will be responsible for maintaining high quality of SW documentation for the components developed\nEnsure end to end deliveries with respect to the team delivery scope. Provide those deliveries in a self-organized manner. Support team members in developing necessary skills to be able to deliver value\nYou will also be part of an international team, working closely within platform development and coordinating collaboration with internal and external development partners.Mandatory requirements (Skills)6+ years of total experience in automotive SW development\n3 to 4 years’ hands-on experience in AUTOSAR Communication stack implementation\nPersonality: You are communicative, team-oriented and characterized by a structured and solution-oriented way of working combined with a high-quality awareness and independence. Attentive to details and self-motivated\nWorking method: Analytical, methodical, independent and responsible.\nExperience and know-how\nExpertise in C++ programming must. very good knowledge in the area of object-oriented SW designs and design samples\nGood programming and debugging skills in communication protocol like CAN, CAN FD, Ethernet and related tools\nExperience in requirement analysis, design, implementation and testing of automotive SW\nHands-on experience in development tools like Compiler, Emulator, Debugger, CANoe, CANape, CANAlyzer, HIL and etc.\nExperience with DOORSB.E/B.Tech, M.E/ M.Tech in Computer science, Electronics and Communication, Mechatronics, Electrical, InstrumentationAdditional InformationPassionate at Automotive engineering\nStrong analytical and diagnostic skills\nAbility to work independently and as a part of a team\nAble to apply test driven development concepts and design / development tools as required\nGoal oriented, team player, focus on quality \nKnowledge / experience with Quality process such as ASPICE\nGood communication (verbal and written) skills and interpersonal skills \nGoal oriented, team player, willingness to take higher responsibility\nAgile Mindset\nScripting language knowledge is beneficial (e.g. Python, CAPL)\nExperience of working on adaptive AUTOSAR and using agile practices and sw development process, methods will be added advantageJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}