{"Job ID": "69867521", "Description": "About Jumeirah & the HotelJumeirah Group, a member of Dubai Holding, has been making a distinguished impact on the global hospitality market for more than two decades with its Stay Different™ brand promise. Its award-winning destinations, such as the iconic Burj Al Arab Jumeirah, position service beyond expectations, elevated dining destinations and surprising architecture and design at the heart of every guest experience.Today, Jumeirah operates a world-class portfolio of 23 properties across the Middle East, Europe and Asia and employs over 8,000 colleagues, representing over 106 nationalities. As Jumeirah continues to expand its global portfolio and scales up its operations to the next level of growth, it remains fully committed to developing and empowering our colleagues to excel in world class environments.Jumeirah Al Naseem is a cool and contemporary beachside retreat offering a world of exquisite dining, indulgent wellness, and exceptional comfort in spectacular surroundings. It is located on Jumeirah Beach Road, adjacent to sister properties Jumeirah Beach Hotel and Burj Al Arab Jumeirah; only 26kms from Dubai International Airport / 25 minutes by car. Al Naseem offers 435 rooms and 45 suites, all with sea-facing views. The hotel is located so close to the water that the sounds of the sea reach guest rooms, open terraces, and outdoor restaurants. Home to 11 restaurants and bars, three managed externally and seven managed by Jumeirah Group, Jumeirah Al Naseem has a world of exquisite taste.“Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity.”About the Job:An opportunity has arisen for Intern - Food & Beverage Service in Jumeirah Al Naseem. The main duties and responsibilities of this role are:To maintain efficient workflow by adhering to the Sequence of Service and all timeframes and standards detailed in relevant SOP in the F&B Standard’s Manual.\nTo responsible for the warm welcome of all the restaurant’s guests in a friendly and timely manner.\nTo identify and take all opportunities to enhance the quality of service. \nTo recognize customer dissatisfaction promptly and take action to resolve the situation according to individual level of responsibility.\nTo offer assistance to colleagues when required, to ensure designated work goals are met.\nTo a working knowledge of the dining room layout, table numbers, stations and colleagues working during each shift. \nTo familiar with the menu to answer any questions the guests may have and should inform guests of any specials at time of seating. About You:The ideal candidate for this position will have the following experience and qualifications: Undergoing graduate degree or have recently graduated\nExperience in hospitality is desired (but not mandatory)\nKnowledge and interest in Food and Beverage industry\nGreat interpersonal skills and ability to work in a multicultural environment\nFluent in English, additional language is an advantage\n About the Benefits:We offer an attractive tax-free salary, paid in Dirhams (AED), the local currency of the UAE. In addition, we offer reduced hotel rates across our properties globally, excellent leave and health care package, flights home, accommodation allowance, life insurance, functional incentives, 50% discount off Jumeirah F&B Outlets and reduced hotel rates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}