{"Job ID": "69868544", "Description": "Do you dream of working in a company that is driven by a meaningful purpose? An inclusive company that empowers you to do your best and be innovative?We are looking for enthusiastic young talents who are passionate for a career in Schneider Electric. MEA  Graduate Development Program-Turkey is one year development journey which aims at developing and fostering the capabilities of enthusiastic young talents to a strategic roles in a systematic approach.Schneider Electric is leading the digital transformation of energy management and automation. Our technologies enable the world to use energy in a safe, efficient and sustainable manner. We strive to promote a global economy that is both ecologically viable and highly productive.€25.7bn global revenue137 000+ employees in 100+ countries45% of revenue from IoT5% of revenue devoted for R&DWhat Makes You A Perfect Fit?Bachelor’s degree in a field related to Computer Science, Software Engineering, IT, Electrical Engineering, Mechatronics, Control&Automation, Industrial Engineering, Artificial Intelligence &Data Engineering,\nStrong communication and interpersonal skills,\nAdvanced level of English,\nPassionate for a career in Schneider Electric,\nInnovative, strong digital mindset and high learning agility,\nFresh Graduate or maximum 1 year of working experience.What Can We Offer?Sustainable career journey at world’s most sustainable company in the world,\nAgile working environment and hybrid working opportunity,\nVarious Learning & Development opportunities globally,\nOpportunity to have a career coach,\nRotational set up where you’ll be exposed to several functions,\nInternational professional network and have a personal mentor for your career journey,\nGreat and continuous learning opportunities,\nYou will join 130,000 colleagues around the world in contributing to our commitment to redefine energy management, keep data secure and address the energy dilemma for a more sustainable planet.How does the application process happen?Online Application\nVideo Interview\nAssessment\nCase Day@SE\nJob Offer\nStart @ Junehttps://youtu.be/YtExntUe89cJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}