{"Job ID": "69866366", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Job Title: Senior Software EngineerReporting To: ManagerWork Location: Bangalore / ChennaiIn order to be stronger in our operation part we are looking for significant experience in databases topics (5 years minimum). Inside the CoC Database team, you will work in an international context on the maintenance in operational condition of the database servers for which you are responsible.Your role is mainly to manage tasks until advanced level (L1,L2,L3) and ensure about documentation and knowledge transfer as well.Work using ticketing tool (Service Now), to record, fix incidents and contribute to continuous improvement.\nThe project approach to contribute and develop new features of our Service catalogue.\nTroubleshoot internal tools occurring issues, getting to the root causes and supporting resolution of the issues found.Cooperate closely with the rest of IT Infrastructure & Operations, Architecture and Security teams.Ensure that the performance, scalability, and security are optimized and applied on instances and databases.\nContribute to bringing Eurofins database servers to the next maturity level, by ensuring close observance of the policies, rules, and processes.\nHands-on configure and troubleshoot the most crucial elements of Eurofins global database platforms.\nIdentify, document and promote best practices for database architecture and contribute continuous improvement initiatives to drive higher efficiency and performance of the database services.\nManage First, 2nd and 3rd level of technical support IT Incidents and communicate with our customers or services.\nManage Front changes and Back Office Changes using procedures and provided environment.\nFlexible to work on night shifts or weekend in case of maintenance or on call duty as the company never stop.QualificationsStrong organizational skills.\nExp is 3 to 4 yrs.\nAbility to listen, gather and understand information about people and situations, quickly.\nExcellent attention to detail and quality.\nGlobal company experience.\nExperienced working globally for multinational teams.\nCommunication and team player ability.\nTechnically solid incorporate and enterprise-scale of database implementation.\nSystems Thinking - the ability to see how parts interact with the whole (big-picture thinking).\nProven experience of acting in infrastructure/operations/project teams.\nTechnologies:\nEngines: MS SQL / PostgreSQL. Optional: Oracle / Elasticsearch\nFeatures: SSRS, SSAS, SSIS, Power BI\nLanguages: Transact-SQL, PowerShell\nOperating system: Windows and Linux\nPlatform: On Premise and Cloud (Azure, AWS and Google)\nFlexible to work on night shifts or weekend in case of maintenance or on call duty as the company never stop.\nStrong organizational skills;\nExcellent attention to detail and quality.\nExcellent communication with our customers.\nVery reactive and dynamic.\nCommunication and team player ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}