{"Job ID": "69865769", "Description": "MediaMonks Middle East is looking for an Arabic Copywriter, specialised in Saudi Arabic who can wield words, wisdom and wit as they cover everything from social content, web copy and newsletters to print, display advertising and e-commerce. If you’re a Saudi National, keen to work as part of a global team to produce integrated work for world-class clientele, this is for you!Work with clients in The Kingdom to develop Arabic Tone of Voice.\nCreate and conceptualise Arabia first ideas and content, adaptable for Saudi Arabian target markets. \nEnsure English to Arabic, and Arabic to Saudi Arabic translations and adaptations are correct and regionally relevant. \nAccountable for content review and Saudisation of all client copy and content ensure copy resonates with Saudi audiences.\nWorking as part of a global group of talent on both local and international assignments, you’ll operate across teams and time zones on projects big and small.\nHandle large-scale requests along with single lines of copy.\nSpecialise in creating digital content including website content, social content and display and video ad copy.\nUse data-driven insights to help personalise content across the entire customer journey—from awareness campaigns to e-commerce copy.\nYour writing ensures that the content is in line with the project’s specific objectives and the client’s even-more-specific expectations.\nIn addition to all kinds of user-facing content, you may also be required to produce copy decks and/or copy proposals.\nContribute to improving our workflows, best practices and client relationships across brands.\nYour job is to ensure everything makes sense, is consistent, and meets the client’s objectives.We’re looking for a Saudi Arabic copywriter with 3+ years of experience with clients in Saudi Arabia,\nYou are familiar with the local and regional Arabic cultural scene, and how it translates through digital platforms, music, books etc… \nYour writing is both clear and compelling.\nYou have a keen pulse on everything on and offline.\nYou can produce quality content out of thin air as well as based on briefs or input written by others.\nYou combine creativity with critical thinking; your analytical approach means you ask the right questions and make sense of complex content and marketing strategies.\nYou’re comfortable and capable of presenting work to clients—always able to rationalise your choices and considerations to win people over with your words.\nYour attention to detail is close to annoying: typos, inconsistencies and questionable punctuation marks have little chance of getting past your cursor.\nYou have a great sense of personal responsibility and eagerly go the extra mile if that’s what it takes to make good great.You are in love with the Arabic language, specifically Saudi Arabian dialects and can strategically piece it together to form an emotional copy just as well as  funny, short, and engaging digital content.#LI-FP1About Media.Monks:Media.Monks is the purely digital operating brand of S4Capital plc that connects 8,600+ digital natives across one global team. We are united by a mission to shift industries forward and pave the path towards ambitious outcomes so our clients and our people can realize their full potential for growth. Our unified model combines solutions in media, data, social, platforms, studio, experience, brand and technology services to help our clients continuously reinvent themselves throughout increasingly rapid cycles of disruption. Our efforts to shape culture, build innovative technologies and unlock the future of growth have earned recognition from numerous esteemed panels: we maintain a constant presence on Adweek’s Fastest Growing lists (2019-22), regular recognition at Cannes Lions, inclusion in AdExchanger’s Programmatic Power Players (2020-23), the title of Webby Production Company of the Year (2021-23), a record number of FWAs, and have earned a spot on Newsweek’s Top 100 Global Most Loved Workplaces 2023. Together, these achievements solidify our experience in digital innovation, excellence in craft, and commitment to personal growth.While we continue to grow our teams, please be mindful of fraudulent job postings and recruiting activities that may use our company name and information. Please be mindful to protect your personal information, especially your national identification number, and bank account information during a recruiting process. While Media.Monks may reach out to potential candidates via LinkedIn, we will always ask applicants to apply through our website (https://media.monks.com/careers) and will never ask for payment or bank account information during the recruitment process.Responsible for resourcing and implementing security controls for your teams processes and systems\nResponsible that all your personnel apply information security in accordance with the established information security policyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}