{
    "Job ID": "69866602",
    "Description": "Apply now Job no: 4066768\nLocation: UAE\nAbu Dhabi AirportVictoria's SecretVictoria's Secret is the leading specialist retailer of lingerie and beauty products, dominating the market with modern, fashion-inspired collections, fragrances, cosmetics, celebrated supermodels and world-famous runway shows and creating products on the forefront of fashion and innovation.The vision of the business is to create a brand with high emotional content that makes woman feel alluring, sophisticated and forever young – It is all about her! Victoria's Secret delivers a best-in-class, captivating branded customer experience that builds loyalty, not just through the product but through the customer service experience provided by the in store staff.The Role:Your role will be to maximise store contribution by proactively driving sales, reducing stock loss and managing controllable costs.Motivating and developing your team members will be integral to your role whilst ensuring the store complies with all company regulations and procedures.Qualifications & Requirements:You will have:- Proven store management experience.- Retail fashion management experience.- Excellent English skills.- Good numerical, analytical, interpersonal and networking skills.- The ability to develop and motivate a team.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arabian Standard Time\nApplication close: 13 Oct 2023 Arabian Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}