{"Job ID": "69867922", "Description": "Jamjoom Pharma has in a very short span of time emerged, as one of the leading pharmaceutical companies in the Afrasia region. The geographical focus of the company is on countries in the Middle East, Africa, and CIS regions. Strategic focus on selected therapeutic categories has contributed to the rapid growth, market acceptance, and overall success of the company.Role Summary:Manage integrated system of receiving of FG from Production, getting delivery orders from Logistic, dispensing and issuance of Finished goods to all export customers as per cGMP and standard operating procedures of the company.Responsibilities:To develop and implement standard operating procedures as per SFDA guidelines and cGMP.\nSupervise receiving of Finished Goods and checking of relevant documents provided by Production.\nSupervise storage of Finished Goods as per required storage condition using Warehouse Management System.\nSupervise issuance and dispatch of Finished Goods to Local /Export distributor and customers as per delivery orders provided by Logistic department.\nSupervise issuance and dispatch of Cosmo items to local distributor and customers as per delivery orders provided by Logistic department.\nSupervise issuance of Finished Goods for Export to Shipping section as per delivery orders provided by Logistic department.\nSupervise periodical cycle count as per stated SOP and keep physical and system inventory accurate.\nSupervise cleanliness and hygiene of Finished Goods store as per SOPs.\nInventory accuracy & cycle counting\nReceiving, Order picking, Put-away and Replenishment of stock 100% as per Delivery Order.\nWarehouse layout, storage finished goods & goods handling.\nMaintain Procedures as per SOP & Training.\nMaintain a positive, supportive, and appreciative attitude.\nEnsure a culture of family orientated work environment founded on trust, honesty, transparency, with open communication and fair dealing with the maintenance of  Jamjoom Pharmaceuticals high standard of work and work ethic.\nAssign and delegate responsibility, develop people and monitor the workflow.\nHave Experience in Finished Goods Store.Qualifications: 4-5 years of experience Pharmaceutical Warehousing.\nBachelor’s degree Pharmaceuticals from an accredited college or university.\nPlanning and problem-solving skill.\nRelevant knowledge of SAP ERP system.\nGood communication and time management skills\nFluency in Arabic & English languages.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}