{
    "Job ID": "69866158",
    "Description": "Country:Location:JOB RESPONSIBILITIES:The candidate will be part of Carrier-Transicold Business, working with dynamic cross functional global development team performing embedded systems firmware design and development for our next generation refrigeration system products.Individual must have the ability to understand system requirements, understand system architecture, prepare design & code using C&C++, perform unit and system testing.The selected candidate must have a background in embedded software development with strong coding skills, devices/system interaction and troubleshooting, and will be involved in all aspects of the product development process (concept, design, implementation, validation, verification, compliance and production).The selected candidate will interact frequently with project management both locally and globally. Will need to work with customers at global locations across different time-zones.The selected candidate shall be able to work individually and with team – hardware, software and QA both locally and globally.Additionally, the job will require ability to understand product domain and investigate new technologies and standards as required.EDUCATION PREFERRED:B.Tech/M.Tech – Electronics/Electrical/Computer ScienceExperience: 6 to 8 yearsEXPERIENCE PREFERRED:Essential Competencies :\nProven expertise in all aspects of Product development process, right from conceptualization to field deployment to support\nStrong in Embedded C/C++\nExperience on non-OS(bare metal) and Real Time OS based system designs\nHands on Development experience with serial communications including CAN, LIN, RS232, SPI, I2C, USB, RS485 – at least one\nExperience on 8/16 / 32 bit Microcontrollers\nMust have experience in Debugging, Troubleshooting Embedded systems using Emulators, JTAG\\BDM Debuggers etc\nArchitecture, Design and Documentation of Embedded Systems Software\nHands on Object Oriented Analysis and Design (OOAD).\nWork closely with systems, hardware, validation/reliability and manufacturing engineering disciplines\nAble to understand hardware design and schematics at high level\nMust have experience with software version control and defect tracking software\nUnderstanding of the software development life cycle and processes(Water fall, Agile)Other Competencies\nUnderstanding of the entire system development process.\nStrong English communication skills - oral and written.\nAbility to adapt quickly to an existing, complex environment.\nAbility to quickly learn new concepts and software is necessary.\nPassionate about building high-quality systems with software development best practices.\nWorking experience in product based companies.Understanding and responding quickly to customer issues.Carrier is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Job Applicant's Privacy Notice:Click on this link to read the Job Applicant's Privacy NoticeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}