{
    "Job ID": "69867191",
    "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Adhesive Technologies help to transform entire industries and provide our customers with a competitive advantage through adhesives, sealants and functional coatings. With our trusted brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Maintain regional reports and Dashboards and root cause analysis in regular reviews for top Supply Chain KPI’s Data and Analytical support to Regional and Country S&OP processes for decision making.\nIn addition to reporting directly, help delegating correctly to Shared Service Center.\nSource data from local systems based on ad-hoc requests such as Legal or audit requirements.\nAlso, data visualization and analysis based on ad-hoc requests and/or projects.\nLead projects to enhance or develop new tools and reports to improve efficiency and effectiveness. (eg. SharePoint & PowerBI for visualization)\nDiscover and study new technologies and apply the best fit to Henkel's supply chain\nProvide training of tools and reports to stakeholders and collect feedback and new requirements from stakeholders.\nWork closely with stakeholders to understand the workflow and the process. Translates regional business requirements to tool and report capabilities.\nCollaborate with other professionals to maintain standards and functionality.Minimum 5 years of experience in supply chain analytics.\nSolid knowledge of SAP Solid knowledge of Excel and Power BI – building dashboards and databases.\nSolid knowledge of Excel Macros. Basic Programming skills.\nExperience in building analytical tools to support supply chain.\nStrong Communication Skills and Excellent problem-solving skills and the ability to translate business needs into data-driven solutions.Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}