{"Job ID": "69860976", "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Responsibilities:\n- Work with development teams and product managers to ideate software solutions\n- Design client-side and server-side architecture\n- Build the front-end of applications through appealing visual design\n- Develop and manage well-functioning databases and applications\n- Write effective APIs\n- Test software to ensure responsiveness and efficiency\n- Troubleshoot, debug and upgrade software\n- Write technical documentationBachelor of Engineering in Computer Science/ Information ScienceMandatory Skills:\n- 4-6 yrs proven experience as a Full Stack Developer or similar role\n- Experience developing desktop/web applications\n- Working experience in front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)\n- Working experience in back-end languages (Python) and JavaScript frameworks (e.g. Angular, React, Node.js)\n- Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design\n- Excellent communication and teamwork skills\n- Experience working in agile team\n\nHandling tool development from requirements till deployment ( Requirement, Design, Code, Testing) - SDLC\nGood Debugging & Communication Skills\nAble to handle the topics independently.\n \n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}