{
    "Job ID": "69869539",
    "Description": "Group overview:Headquartered in Riyadh, Saudi Arabia, we operate construction and manufacturing businesses, design & development centers and a host of facilities in the Middle East and other countries.alfanar is involved in:Electrical, Electromechanical and Civil Engineering Construction\nManufacturing and Marketing Electrical Construction Products\nAllied Engineering ServicesOur Main Divisions:alfanar electric\nalfanar Construction\nalfanar Building Systemsalfanar electricalfanar electric is the industrial arm of alfanar, manufacturing a variety of low, medium and high voltage electrical construction products.alfanar electric operates industries in:Riyadh and Jubail, Saudi Arabia\nDubai, UAE\nLondon, UKalfanar has a development and engineering center in Chennai, India.Industrial Complex, RiyadhThe center of alfanar’s industrial activities is alfanar Industrial Complex situated in the Third Industrial Zone on Al-Kharj Road, Riyadh.Spread across 700,000 square meters, the Complex houses alfanar’s facilities.The Complex has a comprehensive infrastructure including a data and communication center as well as a commercial zone.This position exists to oversee the assessment and management of the reliability of operations that could impact a product or business. This helps test current processes and highlight any failures or issuesAct as SME for all ISO related matters, lead QMS internal/external audits and compliance aduits. \nLead the implementation of alfanar quality management standards, participate in product/customer prequalification audits. \nEnsuring the proper implementation of Statistical Process Control “SPC” Implementation, lead cost of quality calculations/enhancements. \nGathers and examines basic reliability data from field studies or database and correlates the data for analysis using well-defined engineering techniques, principles and procedures. \nPerforms detailed/routine engineering calculations involving relatively simple tests on less complicated system details where ingenuity and high-level judgment are not required. \nInitiates elemental engineering studies into equipment/process failures and presents analysis details to more experienced engineers for approval/feedback to gain in-depth experience and improve judgment for advancing to higher level jobs. \nReview business units root cause failure analysis reports and challenge the business unit QA managers to avoid future failures. \nCoordinate with project teams and design an efficient program plans and documents same and perform tests on various new products and execute all reliability maintenance programs and perform regular risk based inspections and analyse all equipment failures. \nDesign all FMEAs for all new products and recommend changes to designs if required to improve reliability of products and prepare and evaluate all test plans and protocols and perform tests on all critical components and subassemblies. \nDevelop and maintain all reliability plans and perform tests on same and recommend improvement processes to various engineering projects and participate in various external forums to maintain quality of all projects. \nProduce and implement alfanar reliability policies for all equipment and systems, ensuring all planned routines are correctly specified and critical spares are available to allow the maintenance team to effectively complete tasks. \nSupply reliability status monthly reporting figures, analyse trends and develop improvement projects to address the issues of concern, make continuous improvement a way of life. This role will also own the site Probability of Failure on Demand (PoFOD) Report and issue twice annually. \nSite lead for all engineering Root cause analysis and implementation of long term engineering solutions to prevent reoccurrences, manage KPI’s including Run Hours, Mean Time Between Failure (MBTF) and Cost to repair of equipment and systems. \nManage all reliability processes and recommend required standardized procedures and equipments and provide support to all engineering programs and design all product specifications and monitor all product issues and perform root causes analysis on all process. \nCollaborate with business units and review all business requirements and recommend appropriate solutions for same and design various equipment maintenance plans for all technologies. \nResponsible for developing and implementing the business units predictive/preventative engineering policies. HR Proficiency:Ability to obtain updated soft and technical skills related to the jobDelivery:Perform the planned activities to meet the operational and development targets as per delivery schedules.\nUtilize resources effectively to achieve objectives within efficient cost and time.\nProvide a periodic report formatted by detailing the deviation and execution of planned tasks.Problem-Solving:Solve any related problems arise and escalate any complex operational issues.Quality:Ensure quality requirements to develop effective quality control and processes including specifications for products or processes or related activities.Business Process Improvements:Coordinate well-defined written systems, policies, procedures, and seek automations opportunities as much as possible.Compliance:Comply to related policy and procedures and work instructions.Health, Safety and Environment:Ensure compliance of relevant safety, quality, and environmental management procedures and controls within defined area of work activity to guarantee safety, legislative compliance, and delivery of high-quality products/services.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}