{"Job ID": "69867218", "Description": "Amazon India is seeking a Tax Manager- Indirect Tax to be based in Bengaluru. This position will be responsible for providing will be responsible for overseeing indirect tax matters related to planning opportunities, strategies, operations and policies. The person would provide in-house tax consulting related to the implementation of various business initiatives, including liaising with the various teams and departments in India and the U.S. The ideal candidate will be able to work with a high level of collegiality.\nThe responsibilities of the ideal candidate will include the following:\n• Analyzing business transactions and initiatives as it relates to marketplace and seller services initiatives, partnering with various teams and functioning as an in-house tax advisor\n• Researching Indian GST and other indirect tax issues - working with outside advisers as necessary - as part of a global tax team\n• Developing and evaluating Indian GST and other indirect tax planning opportunities and strategies\n• Maintaining and communicating knowledge of past, present and potential future Indian indirect tax laws, regulations, rulings, procedures and court decisions\n• Monitoring of applicability of various state specific regulatory requirements\n• Assisting with managing relationships with outside tax consultants and regulatory authorities on an ongoing basis\n• Work with compliance and tech teams ensure adequate information is being recorded in the systems as may be required for the purpose of Tax compliance, audit and litigation.\nThis position interacts with the company’s U.S. and Indian business and support units, so any candidate should be able to work well with cross-functional teams. The candidate must be able to communicate complex indirect tax concepts in ways that are meaningful and useful to non-tax professionals.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- Degree in law or accounting - Chartered/Cost accountant (or equivalent)\n- 6+ years of Indian indirect tax experience with major consulting or law firm, and/or in industry, preferably a multinational corporation.\n- Understanding of Indian tax laws, particularly indirect taxes.\n- Understanding of accounting concepts preferred\n- Able to extract, analyze, and review data and make appropriate recommendations\n- Excellent Excel and general computer skills\n- Ability to understand and work with ERP systems\n- Analytical, problem solver and comfortable in working with technology teams.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}