{"Job ID": "69866583", "Description": "Job Description:Primary Location      : RemoteSchedule                    : Full TimeShift Time                  : Evening/Night Shift (6 PM to 3 AM or 7 PM to 4 AM or 8 PM to 5 AM)Experience Range    : 12 months to 18 monthsEducation                  : Bachelor's DegreeJob Profile/Key ResponsibilitiesResponsible for Policy administration and related services of Life Insurance\nPerforms routine, recurring processing and quality tasks in support of outsourced services within a specific industry and functional area. Adheres to process service level agreements.\nDevelops knowledge and skill in assigned work process (es) as well as general understanding of the client's business and objectives.\nUnderstands and adheres to project and organization quality and compliance standards and any applicable laws and regulations.\nHandles company confidential data according to policy and guidelines. Adheres to existing security policies and procedures.\nRemains alert for critical situations regarding customer service issues and escalates to appropriate individualsMandatory Skills:Experience of working in a BPO set up – 12 to 18 months in Life and & health insurance\nCandidates must possess good communication skill – Both verbal and written\nGood analytical and problem-solving skills\nOpen to work in evening and Night Shifts\nAbility to work in a team environment\nPC literacy, basic knowledge of MS office and e-mail skills\nTyping on keyboard with data entry speed of at least 25 WPM at 90% accuracyDesired Skills:Working knowledge of US Insurance (Preferably Life and Health insurance)\nAcademics with good understanding of Insurance basicsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}