{"Job ID": "69869677", "Description": "Cyient is a global engineering and technology solutions company. As a Design, Build, and Maintain partner for leading organizations worldwide, we take solution ownership across the value chain to help clients focus on their core, innovate, and stay ahead of the curve. We leverage digital technologies, advanced analytics capabilities, and our domain knowledge and technical expertise, to solve complex business problems.With over 15,000 employees globally, we partner with clients to operate as part of their extended team in ways that best suit their organization’s culture and requirements. Our industry focus includes aerospace and defence, healthcare, telecommunications, rail transportation, semiconductor, geospatial, industrial, and energy.Job DescriptionBachelor’s Degree in mechanical engineering / Production Engineering / Industrial Engineering\n4 years of in design of material handling equipment such as Racks, Kit carts, Pallets, using in Creo CAD software\nExperience in Creo CAD tool is mandatory.\nGood knowledge and understanding of Containerization requirement specification and right Sizing in Packing Assist\nExecutes Material Flow projects covering warehouse planning, material replenishment, inventory management, material presentation, containing planning.\nLogistics process design and equipment, Kitting, Sequencing, Dock analysis, Storage Analysis\nExperience in Warehousing, Material Flow, layout optimization, suggest solutions.\nExperience in Factory layout designing and provide solution using AutoCAD/Factory CAD/ Creo CAD tool\nHands on advance excel sheet and PowerBI will be added advantages.\nGood communicate and ability execute project independently.Skills & ExperienceCyient is an Equal Opportunity Employer.Cyient recruits, employs, trains, compensates, and promotes regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, veteran status, and other protected status as required by applicable law. We are proud to be a diverse and inclusive company where our people can focus their whole self on solving problems that matter.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}