{
    "Job ID": "69868369",
    "Description": "It takes the brightest minds to be a technology leader. It takes imagination to create green energy for the generations to come. At Siemens Gamesa we make real what matters, join our global team.Siemens Gamesa has a vision for renewable energy: we believe in the power of nature and technology. Help us to be ready to face the energy challenges of tomorrow and make a green footprint – join us in creating a better future for our planet.We focus on hiring the best people, wherever they may be in the world. We pride ourselves on the flexibility we offer to our employees and are committed to building a workforce that can grow with the company. Siemens Gamesa is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.In our culture of trust, we focus on empowerment, diversity and continuous learning. Valuing our people is what makes us one global team, with our colleagues’ safety at the heart of our organization.   How to contribute to our visionWithin our department we are currently looking for a dedicated Project Manager to lead complex projects within the Major Projects team in NE&ME Continental region. The Project Manager designs, develops and manages such projects, according to defined Project Management (PM) standards, stakeholder requirements and Business Conduct Guidelines (e.g. Tax regulations, Export Control, EHS). Additionally, you will take over the following tasks:Full project responsibility in terms of time, cost and quality delivered - from scoping phase until project closure.\nEnsure EHS standards, procedures and EHS plans are implemented at project sites to create a Home Safe environment.\nDefine the technical project scope together with the technical department and support the tender process together with procurement.\nSupport the CPM with the budget and cost planning structure, risk analysis and contingency plan.\nPlan resources, cranes, platforms, material & tools and logistics for the execution.\nExecute the project according to agreed working packages, budget and timeline.\nControl, prepare and maintain the project status (financially as well as technically), monitor milestones and adherence to budgets, and initiates actions to minimize non-conformance cost.\nContract and claim management of your project and initiate corrective actions where necessary.\nManage and align the projects different stakeholders e.g. suppliers, service providers, official authorities, customers or internal stakeholders.\nLead the daily project execution and stakeholder engagement activities.\nSupport on internal improvement, quality and standardization projects.What you need to make a differencePassion for renewable energy and a sense for the importance to lead the change. Additionally, you fit to the following requirements:You hold a university degree or relevant work experience (technical or commercial studies incl. project management courses), preferably with a focus on the wind business.\nYou gained several years of working experience with project management - preferably of international service/repair projects - with multiple stakeholders and suppliers. It is an advantage if you have documented your experience through relevant Project Management Certification.\nExperience of managing 3rd party contractors always ensuring performance meets required standard with regards to Safety and Quality.\nExcellent English language skills, both orally and in writing. Spanish language skills, both orally and in writing, would be an advantage.\nYou have a structured approach to your assignments (incl. structured documentation) and can handle project scope changes occurring in a dynamic, multicultural environment to the full satisfaction of your stakeholders.\nYou are able to apply the commercial angle into the project to deliver projects on target cost.\nYou thrive in a multi-cultural environment, and you are familiar with working in large matrix organizations.\nYou are prepared for travelling.In return of your commitment we offer you…Become a part of our mission for sustainability: Clean energy for generations to come\nA global team of diverse colleagues who share passion for renewable energy\nTrust and empowerment to make your own ideas reality\nPersonal and professional development to grow internally within our organization\nEmployer-funded pension\nAttractive remuneration package (fixed/variable)\nLocal benefits such as subsided lunch and public transport tickets, employee discounts and much moreEmpowering our peoplehttps://www.siemensgamesa.com/sustainability/employeesHow do you imagine the future?https://youtu.be/12Sm678tjuYOther InformationFor further information regarding the recruitment process, please contact the primary recruiter Nazli Falay through email: nazli.falay.ext@siemensgamesa.com.Our global team is on the front line of tackling the climate crisis, reducing carbon emissions – the greatest challenge we face.Severely disabled applicants are encouraged to reach out to us. We have inclusive recruiting processes specifically for severely disabled persons in Germany and we do our utmost to tailor working spaces to suit your individual needs. In cases of severe disability, applicants who are equally qualified will be given preferential consideration.Siemens Gamesa is an equal opportunity employer and maintains a work environment that is free from discrimination and where employees are treated with dignity and respect. Employment at Siemens Gamesa is based solely on an individual's merit and qualifications, which are directly related to job competence. Siemens Gamesa does not discriminate against any employee or job applicant on the basis of race, ethnicity, nationality, ancestry, genetic information, citizenship, religion, age, gender, gender identity/expression, sexual orientation, pregnancy, marital status, disability or any other characteristic protected by applicable laws, rules or regulations. We adhere to these principles in all aspects of employment, including recruiting, hiring, training, compensation, promotion and benefits.We are driven by people - from more than 100 different countries, they build the company we are every day. Our diverse and inclusive culture encourages us to think outside the box, speak without fear, and be bold. We value the flexibility that our smart-working arrangements, our digital disconnection framework and our  family-friendly practices bring to the new way of working.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}