{
    "Job ID": "69865868",
    "Description": "Wood is currently recruiting for Offshore Instrumentation Designer with extensive experience in oil and gas industry.Responsible for supporting the objectives of the Health, Safety, Security, Environmental and Quality policy and Information Security Management policy by adhering to applicable procedures and work practices while fulfilling of duties.\nExecute assigned work in accordance with the applicable project procedures, DDI and standards, including Wood Group, India Operations and/ or project procedures on safety and quality control within the man-hour budget and the project schedule targets.\nPrepare air distribution schedules and indicate positions of air manifolds on plot plans.\nPrepare instrument cable block diagrams.\nPrepare cable drum schedule.\nFollow the design guidelines for the preparation of cable racking / routing drawings.\nPrepare a cable schedule from the cable block diagram and project specifications / standards.\nPrepare sketches for control room and equipment room layouts based on inputs.\nDevelop the instrument design index based on EFD’s and Instrument Index.\nUsing the instrument database and project specifications / standards, follow guidelines in the preparation of instrument hook-up drawings & installation drawings.\nProduce instrument location drawings based on the instrument database, EFD’s and plant layout drawings.\nDevelop / provide input on the 3D Model to clarify instrument requirements on the model inclusive of cable racking, junction boxes, air headers and field instrument placements.\nPrepare instrument loop diagrams and termination schedules utilising the SPI database.\nPrepare panel layout detail drawings based on inputs.\nIncorporate instrument supplier data received into instrument design database, termination schedules and loop diagrams.\nProvide input for piping / instrumentation interface drawings.\nProvide input for electrical / instrumentation interface drawings.\nMaintain the instrument design database and drawing register in a current project state.\nAssist in preparation of enquiry requisitions for instrument cable and junction boxes.\nAssist in the preparation of the Instrument design MTO.\nLiaise with engineers to ensure design intent is implemented.\nAssist in resolving site queries relative to the instrument design, obtain redline mark-ups and backdraft documents to As-built status.\nAssist in the preparation of Instrument ‘End of Job’ documentation.\nPerform any other duties assigned within reason by the Principal Designer / Dy. Manager / Chief Engineer / Chief Specialist.\nHighlight as applicable to Dy. Manager / Chief Engineer / Chief specialist / Lead Engineer regarding change flags.g)Required  Software experience : Mandatory : E3D /AutoCAD, SPI . Preferred : SP3D , AVEVA Instrumentation\nActivities / Deliverables : 3D modelling , preparation layout drawings, Cable Block Diagrams, Cable Schedule, termination and loop drawingsWood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}