{"Job ID": "69868159", "Description": "General information: Lead the execution of medium-size projects and ensure that all related activities are performed in accordance with Hitachi policy, contractual agreements, quality standards, health, safety & environment requirements, financial targets, as well as schedule commitments. Responsibilities: Project leadership Leads the project team allocated to the project, defining main guidelines, allocating project tasks, and motivating and monitoring internal and external resources to accomplish all tasks and milestones. Provides performance feedback regarding allocated resources working on projects. Planning and scheduling Defines, jointly with the Project Controls department, all project plan documents, including scope and financial plans, schedule and risk management plans. Project execution and control Ensures that the project follows execution best practices and Hitachi policies. Effectively monitors and controls project progress and efficient resource utilization. Monitors and controls project financials, overseeing project invoicing status, cost, expenses and cash flow. Identifies, qualifies, quantifies and manages project risks, and ensures that all opportunities are identified and pursued. Captures, analyses and shares lessons learned throughout the project. Ensures that the project is formally closed out, as contractually agreed. Drives the formal acceptance of the project, contract close-out and its acknowledgement by the customer. Contract, claims and procurement management Ensures that the project consistently applies contract and claims management, in accordance with Hitachi policies and contractual agreements. Coordinates with Supply Chain Management, and successfully procures required services, materials and equipment for the project from external and internal suppliers. Support Supply Chain Management in supplier negotiations, claims and project changes. Stakeholder relations Acts as key contact for the customer and an escalation point for project issues. Builds and maintains strong relationships with internal and external stakeholders and effectively communicates with all stakeholders. Health, safety and environment (HSE) Ensures the project follows and complies with company health, safety, and environmental policies. Your background: 12-16year experience is required to have mid & large size of projects like HVDCJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Vadodara, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}