{"Job ID": "69866103", "Description": "DescriptionTITLE: SAP BTPLocation: PuneModule: Hybrid ModuleDesignation: Deputy Manager _ Assistant Lead#_VOISJob ResponsibilityJob Description:Skills needed:Develop and maintain SAP UI5 / Fiori applications / Cloud native applications\nExpertise in SAP BTP Business Technology Platform\nDesign and develop applications consistent with the UI strategy of the Company\nCompile Technical Specification document for all the developments as per the Company’s requirements\nAt least 3 – 5 years of recent experience as UI5 /Fiori developer and SAP CAP applications on BTP\nStrong knowledge and working experience in UI5 related programming like JavaScript, HTML5, CSS, SAPUI5, FIORI.\nDevelopment using SAP Business Application studio (BAS) -  (Catalog, SQL Console, Trace)\nCloud Application Programming Model(CAP) using NodeJS & Strong JavaScript Knowledge Core Data Services (CDS)\nGood understanding of the standard services / libraries of the SAP Cloud Platform.\nFamiliarity with use of App routers\nSecurity using XSUAA\nStrong experience with SQL Script, PL/SQL, Stored Procedures, Function Calls, Designing tables, data loads, calculation views Cloud Foundry & DB Security concepts (Roles, Privileges etc)\nDebugging (Logs / Traces)\nFIORI launchpad configurations  \nAssistance and should be able to troubleshoot front end backend integrations suggest improvements if needed\nShould have knowledge on best practices and developing secure web applicationsSkillsNot a perfect fit?Worried that you don’t meet all the desired criteria exactly? At Vodafone we are passionate about Inclusion for All and creating a workplace where everyone can thrive, whatever their personal or professional background. If you’re excited about this role but your experience doesn’t align exactly with every part of the job description, we encourage you to apply as you may be the right candidate for this role or another role, and our recruitment team can help you see how your skills fit in.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}