{
    "Job ID": "69866835",
    "Description": "SummaryJob DescriptionYour role in details:Brand management:Assist your manager in developing yearly brand plans for all markets\nWorking under approved strategy & budgets, follow through the implementation of brand plans and guide our retail partners for their executions\nManage the brand calendar for each market\nAttend all brand facing meetings, capture meeting notes and next steps + lead follow-ups with the different internal and external departments and partnersEventsDelivering small to medium scales events from A to Z within provided budget & support for large scale events with the following missions:creating the agenda, selection of final venue, F&B + hotel rooms negotiation, relationship with retail partners, logistics, guest list management, design of invitation gifts… Serve as a brand representative on site as needed Work with retail partners abroad on all event executions, overseeing concept development, approval in line with your management, and perfect execution and reporting.Reporting, monitoring & adminReport information on the latest products, trends, and insights across platforms (social media, blog, print/digital magazines).\nAssist in prepare important project briefs & post campaign reports\nContinuously research and compile information about competitive new launches, advertising, and formulas.\nAdministrative supportPROFILE2-3 years’ experience with a recognized degree in the field of marketing communication or business, you enjoy working in multicultural teams and face paced environment. Previous experience in event management is a must and in the luxury industry is a plus.You have a good understanding of the luxury environment and of the Middle-East culture. You are passionate about new trends in lifestyle, arts, new technologies and sports.You must be fluent in English & Arabic (written & spoken).French would be appreciated.Self-starter, you can work effectively in dynamic environment. You are energetic, self-motivated, action and results-oriented thanks to strong organizational skills. Open-minded, you are also known for your excellent interpersonal and communication skills. You adapt easily to changes and you will bring up new ideas and solutions.Problem-solver, organizational skills and positive attitude are a MUST.Job TypeStart DateScheduleOrganizationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}