{"Job ID": "69869587", "Description": "**Work Where it Matters** Pinnacle Solutions, an Akima company, is not just another federal construction contractor. As an Alaska Native Corporation (ANC), our mission and purpose extend beyond our exciting federal projects as we support our shareholder communities in Alaska. At Pinnacle Solutions, the work you do every day makes a difference in the lives of our 15,000 Iñupiat shareholders, a group of Alaska natives from one of the most remote and harshest environments in the United States. **For our shareholders** , Pinnacle Solutions provides support and employment opportunities and contributes to the survival of a culture that has thrived above the Arctic Circle for more than 10,000 years. **For our government customers** , Pinnacle Solutions delivers comprehensive services for general construction and renovation, as well as civil and marine construction. **As a Pinnacle Solutions employee** , you will be surrounded by a challenging, yet supportive work environment that is committed to innovation and diversity, two of our most important values. You will also have access to our comprehensive benefits and competitive pay in addition to growth opportunities and excellent retirement options. **Job Summary:** Functions as the Aviation Maintenance Quality Control technical inspector under the direction of the Aviation Quality Control (QC) Manager on a CH-47F aircraft. Functions as the data analyst technical compliance documentation administrator, CH-47 Weight and Balance technician and the technical expert on the aircraft ensuring airworthiness. **Job Responsibilities:** + Ensures that maintenance quality control functional activities and procedures among designated organizations are aligned and synchronized with maintenance process and procedures to achieve established platform Operational Readiness (OR) rates IAW contractual requirements. + Responsible for the assistance to QC Manager in establishing and enforcing maintenance quality control processes, procedures, records and reports, that provide immediate situational awareness of platform OR rates. + Assists QC Manager in establishing daily maintenance quality control organizational goals with production control, objectives and priorities for implementation in order to achieve stated OR rates. + Assists with establishing the maintenance quality control processes, procedures, standards, measures, reports in support of the maintenance program. + Reports to directed inquires, investigations, and research analysis related to quality control maintenance processes and supporting maintenance activities to the Maintenance Manager through the Quality Control Manager. + Responsible to remain current in any required certification, training, and qualifications of the quality control technical inspectors functions. + Attends a daily production control meeting for coordination and synchronization with maintenance section representative and SCM representative as required. + Ensures all Quality control maintenance operations and related maintenance support activities are conducted in a safe manner. + Inspects backshops as directed by the Quality Control Manager. + Maintains aircraft historicals with 100% accurateness. + Determines requirement to conduct a Post Maintenance Check Flight (PMCF) / Functional Check Flight (FCF), and provides inspection criteria interpretation to maintenance staff. + Proficient in the use of common measuring tools, precision measuring gages and alignment fixtures (GFE) + Performs as Weight and Balance (W&B) technician to complete Weight and Balance records/forms for all assigned aircraft and complete all appropriate Weight and Balance documentation according to the RSLFAC directives and applicable manuals. + Communicates effectively with QC/PC Manager with Safety and Mission Accomplishment always at the forefront. + Supports, in coordination with the Maintenance Lead and QC Manager, the Downed Aircraft Recovery Team (DART) process and procedure. + Provides On-The-Job training, coaching, and mentoring to RSLFAC personnel in all aspects of Quality Control, Safety and Performance of maintenance activities. + Other duties as assigned and or directed by Quality Control Manager. **Minimum Qualifications:** + Ten (10) years cumulative experience in rotary aviation maintenance. + Five (5) years experience as an MH or CH-47D/E/F/G aircraft mechanic or maintenance technician. + Three (3) years experience as a CH-47D/F Technical Inspector. + Graduate of a US Military aviation maintenance course (15 Series). + Graduate of ALC (BNCOC). + Proficient in the use of AWBS software. + Proficient in the use of computer-hosted interactive technical manuals, aircraft maintenance forms, and other aircraft-related documentation. + Proficient in MS Office software. + Professional verbal, written, and interpersonal communication skills. + Ability to effectively communicate with the customer in a professional and courteous manner. + Possess a valid issued driver’s license. 12. Successfully pass an overseas deployment physical upon hire. + HS diploma or equivalent required. + Must be a US Citizen. **Desired Qualifications:** + Five (5) years' experience as aviation Quality Control Inspector or Supervisor. + Associate degree in aviation management. + FAA A&P certificate. + Inspector Authorization (IA) certificate. We are an equal opportunity employer. All applicants will receive consideration for employment, without regard to race, color, religion, creed, national origin, gender or gender-identity, age, marital status, sexual orientation, veteran status, disability, pregnancy or parental status, or any other basis prohibited by law. If you are an individual with a disability and would like to request a reasonable accommodation for any part of the employment process, please contact us at job-assist@akima.com or 571-353-7053 (information about job applications status is not available at this contract information). **Job:** Military Specific Occupations **Travel:** Yes, 25 % of the Time **Organization:** Pinnacle **Clearance:** Not Applicable **Shift:** Day Job **Work Type:** On-Site **Req ID:** PIN00101Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}