{"Job ID": "69869711", "Description": "As a leading global animal health company, Elanco delivers innovative products and services to improve the health of pets and farm animals around the world because we believe making animals' lives better, makes life better. Since 1954, we have provided solutions that support veterinarians, farmers and pet owners to advance our vision of Food and Companionship Enriching Life. Elanco's promise to employees: Together, we foster an inclusive culture where everyone can make a difference, encouraging ownership, growth and well-being.Job Responsibilities:Supplier Management: Primary contact and relationship manager to assigned CM and suppliers. Manage communication.\n\nRelationship Governance: Responsible for forming, facilitating, and leading the appropriate governance structure with the CM (or supplier), including   local Joint Process Team (JPT), project teams and other as applicable. In India Facilitating Joint Steering Team (JST) managed by global team. Setting relationship goals and success indicators, driving continuous improvement activities and overall monitoring of performance.\n\nLeading API: Responsible for monitoring and empowered to coordinate all internal functional activities associated with API supply from the CMs and suppliers. Lead internal cross-functional teams as needed (e. g. planning/ scheduling (SCM), Regulatory CMC, QC, QA, API TS/MS) to resolve issues and ensure reliable API supply, quality and compliance in a cost-effective manner. Responsible for change control management.\n\nInterface to Finished Products Teams: Responsible for liaising on API related topics with finished products teams (internal formulation sites or EEM drug product). Represents API team in G-Plots or finished products transfer meetings.\n\nCommercial topics or matter: Activate Procurement in any business-related matters. Responsible for working closely with Procurement in the definition of contract terms. Represent EEM-API in negotiations of new contract manufacturing and supply agreements and their renewals (led by Procurement). Provide on-going oversight for ensuring the CM’s or supplier’s compliance to contractual arrangements.\n\nTechnical support: Provide technical support to CM and generic suppliers and involve TSMS for certain projects or special issues if specific technical expertise is required. Ensures local presence in case of investigations and facilitates global activities.\n\nPerformance Assessment and Improvement: Responsible for completing periodic reviews of CM relationships against set goals and objectives; recalibrating expectations as appropriate. Conduct periodic risk assessments of CMs and suppliers and communication of results to senior management. Responsible for improving work practices, quality and reducing costs.\n\nProjects/Business Ventures (Due Diligence): Support activities in relation with projects, products, and company acquisitions or in- and out-licensing.\n\nEnsuring Compliance: Support the respective functions with adherence to appropriate quality, supply chain, HSE, regulatory standards at the external manufacturers. Coordination with Quality Assurance for deviations, OOS results and audits.\n\nCooperation with R&D: Involvement in early phases of product development to ensure that appropriate quality parameters of the APIs are considered, and potential suppliers are selected accordingly under consideration of existing business relations.Job Requirements:Min. 15 years’ experience in a cGMP or related environment\n\nDemonstrated leadership skills without formal authority.\n\nExperience in project management\n\nBasic understanding of organic and analytical chemistry or drug product manufacturing\n\nAbility to influence others to obtain results\n\nDemonstrated learning agility\n\nHigh communication skills\n\nExcellent mentoring and coaching skills\n\nAbility to prioritize multiple activitiesElanco is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected statusJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}