{"Job ID": "69866383", "Description": "Our MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.Our vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.FLEXWORK is an employee-centric reimagining of how we work. We built FLEXWORK based on employee feedback – it is about flexibility, trust, and choice whenever possible. It’s been a journey of disruption that has yielded the best of our values. We offer as much flexibility as possible, and choices that enable you to be most productive, including benefits that meet your needs and learning opportunities that you feel passionate about.Your CareerYou will be tasked with bringing the benefits of Cortex (a next-gen AI-powered security operations platform) to customers. Your portfolio of solutions covers Advanced Endpoint Protection, Cortex XDR (Investigations and Response), Cortex XDR (Analytics), Cortex XSOAR (Security Orchestration, Automation & Response), Attack Surface Management (Expanse), Autofocus and the Cortex Data Lake.As a key member of the Cortex Sales team, you will collaborate closely with cross-functional teams within the region. You will partner closely with Pre-sales Engineers to drive growth for our Endpoint, Behavioral Analytics, and SOC security solutions. You will take ownership of growing the Cortex business within your respective market by staying at the forefront of industry trends and customer needs.Your ImpactDevelop and drive the Cortex business across the region by building external customer relationships as well as partnering with the core sales team and mapping customer strategies and engagement to drive Cortex business\nFacilitate communication on strategic and tactical issues facing our clients and partners\nMaintain continuity and up-to-date knowledge of industry trends, technical developments, and governmental regulations that effect target markets\nDevelop market strategies and goals for customers across the Cortex portfolio - understand the strategies, goals, and objectives of accounts\nTake full responsibility for accurate sales forecasting by demonstrating in depth knowledge of sales cycles from initial contact through the procurement process\nDomestic travel and possible international travel as necessaryYour ExperienceExceeding sales quota as an Account Manager\nIT sales experience as direct contributor\nDeep understanding of channel partners and a channel-centric go-to-market approach\nKnowledgeable in complex solution sales methodology\nExtensive field sales experience in the cybersecurity technology industry\nExperience working with Security Operations Centre teams, selling endpoint and incident response security solutions\nAbility to work with System Engineers and cross-functional teams in a high-growth, startup environmentThe TeamOur sales team members work hand-in-hand with large organizations around the world to keep their digital environments protected. We educate, inspire, and empower our potential clients in their journey to security.As part of our sales team, you are empowered with unmatched systems and tools, constantly updated research and sales libraries, and a team built on joint success. You won’t find someone at Palo Alto Networks that isn’t committed to your success – with everyone pitching in to assist when it comes to solutions selling, learning, and development. As a member of our sales team, you are motivated by a solutions-focused sales environment and find fulfillment in working with clients to resolve incredibly complex cyberthreats. Our CommitmentWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at [email protected].Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}