{"Job ID": "69861139", "Description": "Job NameCountry:City:Function:Reporting Line:Job type:Lead recruiter:About the roleYour OpportunityAbout You You will be a curious and agile self-starter who is able to work in the here and now whilst also able to think about long term objectives\nYour entrepreneurial style means that you will thrive on being the key contact for customers, driving new opportunities, distribution and maintaining sustainable relationships.\nYou’ll bring a positive outlook and point of view to compliment the teams drive and focusResponsibilitiesWith our Consumer at the heart, your key focus will be to:You will be the visible face for our Portfolio and increase brand desire through the development of creating a strong advocacy program, tools and assets. \nYou will provide education and training across our total Portfolio within the On Trade & Off Trade.\nYou will support our sales team in building outstanding relationships with our customers in the On Trade, understanding their needs, their local consumers, and developing and executing solutions.\nCollaborate cross-functionally with Marketing and Sales team to bring our amazing brands to life, through hosting events and brand activations. \nBuild and deploy portfolio education, tastings, workshops at scale (physical and digital solutions for consumers, customers and Primos) and deliver occasion, engagement, and entertainment programs with clear KPIs.\nAs an Spirits expert, you will support the local Commercial and Brand teams in defining how we show up in the relevant outlets and channels with a focus on increasing availability, visibility, quality and execution.Skills and ExperienceThe Skills & Experience needed to create your legacyExtremely knowledgeable about the total Spirits category\nWorking experience in premium on trade\nWide network of strong industry relationships\nStrong communication and influencing skills\nStrong understanding of social media and how to use it effectively \nSelf - organisation\nProficiency in English language skills\nExperience in Spirits and/or Beverage Industry is a distinct advantageBelonging: You have a strong capacity to create a culture of ‘Belonging’, where people feel appreciated for who they are, what they do, and who they can become. You’re an authentic leader who acts with purpose and has an approachable, empathetic, open communication style.  \nMental Agility: You can think critically to penetrate complex problems and expand the possibilities by making fresh connections. You think strategically whilst being execution-focused and bring creativity to the challenges you’re presented with. You will have an attitude of constant learning and improving. Curious, creative, obsessed about the consumer, have a strong sense of popular culture to identify passion points the brand and consumer share.  \nPeople Agility: You bring a deep ability to understand and relate to people and navigate through tough situations to harness and multiply collective performance. You create strong positive first impressions and build those into great relationships. \nSelf-Awareness: You have high levels of self-awareness, are reflective and know yourself well, understanding both your strengths and weaknesses and your impact on others. \nResults Agility: You demonstrate consistent delivery of results in first-time situations by inspiring teams, exhibiting a presence that builds confidence in yourself and others. You operate at pace and are able to multi-skill effectively and are at ease leading projects. You will be highly performance-driven, commercially and financially astute. \nChange Agility: You have a deep natural curiosity, desire to experiment and ability to effectively deal with the heat of change. You have a growth and learning mindset: ready to test, stumble, learn and apply from experience. Comfortable with change and ambiguity.Our cultureWe share the passion and entrepreneurial flair of our founder and are guided by our three culture pillars - Fearless, Family and Founders, they inspire our Primos to be the best they can be and drive us forward in all we do. But what does this mean?·Being Fearless; means adopting an agile mindset, being comfortable trying new things and taking risks. We are empowered to question, challenge and innovate.·Family; We treat each other, and our communities, like Family. Always.·Founders; The spirit of entrepreneurship is at the heart of everything we do. We see the business as if it’s our own. We do the right thing for the business and we all take accountability for our work.When you join Bacardi, you become part of our family and gain more than just a job.Disclaimer: Bacardi is an equal opportunity employer that values workforce diversity. Diversity is core to our business: by embedding diversity into all aspects of our culture, we maximize the opportunity to achieve sustainable business success and growth. The duties and responsibilities described in the role profile might not be a comprehensive list. U.S. applicants have rights under Federal Employment Laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Nashik, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}