{"Job ID": "69866499", "Description": "ETL Manager (Datastage, SAP BO)Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate, and above all fun.About the teamThis role is a part of our Application Support Team which is accountable for the Production environment and meets the nightly batch jobs SLA that Involves implementing, maintaining, and supporting applications software that is delivered on time and within budget. Work closely with customers, business analysts, and team members to understand business requirements that drive analysis and design of quality technical solutions ensuring alignment with the business.What you will be doingPerform support activities required to maintain a high level of availability and stability for one or more applications including incident/problem analysis and resolution.\nPerform client reporting incident ticket investigation and provide a resolution within an SLA.\nPerform change deployment and certification, application performance, application operations management, and development support.What you bring:Must have 12+ Years in Production support management including technical and at least of 5 years leadership experience.\nMust have 5+ years of leadership experience handling 15+ member teams.\nMust have 6+ years’ experience ETL/Datastage experience preferably IBM’s DataStage product and SAP BO\nMust have experience with Unix/Linux-based applications, including a very good knowledge of Unix/Linux commands.\nMust have experience in working with Control M Job Processing tools and Batch job support.\nMust have experience in Oracle & SQL Server Database Bonus if you have:Knowledge of SNOW, Splunk, PowerShell, and Dynatrace is preferred.\nKnowledge in Datastage migration 11.7 to higher environmental is preferred.\nKnowledge in handling Vulnerability remediation is preferred.\nKnowledge of Site Reliability Engineering practice and mindset is preferred.What we offer you :An exciting opportunity to be a part of the World’s Leading FinTech Product MNC\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nWith a broad range of professional education and personal development possibilities – FIS is your final career step!\nA broad range of professional education and personal development opportunities\nTime to support charities and give back to your community.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}