{
    "Job ID": "69869733",
    "Description": "Cyient is a global engineering and technology solutions company. As a Design, Build, and Maintain partner for leading organizations worldwide, we take solution ownership across the value chain to help clients focus on their core, innovate, and stay ahead of the curve. We leverage digital technologies, advanced analytics capabilities, and our domain knowledge and technical expertise, to solve complex business problems.With over 15,000 employees globally, we partner with clients to operate as part of their extended team in ways that best suit their organization’s culture and requirements. Our industry focus includes aerospace and defence, healthcare, telecommunications, rail transportation, semiconductor, geospatial, industrial, and energy.Job DescriptionKey Responsibilities:Understand the end-to-end process, define the transformation goal, focus on identifying the Non-Value-Added (NVA) activities, and bring operational efficiency\nHands-on experience in reengineering the business processes to enable the organization to optimize the business processes and accelerate time-to-market.  \nMust have worked on multiple business process transformation projects leading to the creation of new processes, improved business outcomes, accelerated business growth, and improved digital experience in line with emerging market trends.\nProvide expertise in recommending, influencing, and facilitating organizational and business processes and process changes throughout the enterprise\nApply appropriate change management tools and techniques\nAble to innovate by adapting new capabilities, technology, and concepts to enhance the outcome of business processes.\nContinually look for opportunities to innovate and improve processes.\nWork with Business/Functional Process owners and drive alignment and standardization of requirements and processes and influence the organizational work culture in line with organization strategy.Skills & ExperienceCyient is an Equal Opportunity Employer.Cyient recruits, employs, trains, compensates, and promotes regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, veteran status, and other protected status as required by applicable law. We are proud to be a diverse and inclusive company where our people can focus their whole self on solving problems that matter.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}