{
    "Job ID": "69867969",
    "Description": "Led by Rodolphe Saadé, the CMA CGM Group, a global leader in shipping and logistics, serves more than 420 ports around the world on five continents. With its subsidiary CEVA Logistics, a world leader in logistics, and its air freight division CMA CGM AIR CARGO, the CMA CGM Group is continually innovating to offer its customers a complete and increasingly efficient range of new shipping, land, air and logistics solutions.Committed to the energy transition in shipping, and a pioneer in the use of alternative fuels, the CMA CGM Group has set a target to become Net Zero Carbon by 2050.\nThrough the CMA CGM Foundation, the Group acts in humanitarian crises that require an emergency response by mobilizing the Group’s shipping and logistics expertise to bring humanitarian supplies around the world.Present in 160 countries through its network of more than 400 offices and 750 warehouses, the Group employs more than 155,000 people worldwide, including 4,000 in Marseilles where its head office is located.THE ROLE:Part of the CMA CGM India Agency Commercial Team based in Mumbai, and reporting to the Marketing Manager, you will be working to standardize and track commercial activities for the India. While ensuring the accurate updating, monitoring, and analysis of the  India commercial performance for CMA CGM, you will enable the growth strategy of the Agency.RESPONSIBILITIES: Reporting to the Marketing Manager - Pan India, you are responsible for accurately updating, monitoring and analysing India commercial performance for CMA CGM.\nUsing the knowledge of assigned area, you also provide sales performance analysis per client and per service. In doing this, you will send your recommendations and action requests to the sales managers and / or area manager, and you are responsible for following up on sales actions.\nAs an analyst of the market, you will work on Market identification & commercial intelligence (assimilate local port / ICD statistics, customer & competition updates & key developments) and relay the same to all concerned stakeholders with your recommendations. \nYour supervise the correct implementation, effective utilisation and strict adherence of sales and marketing tools & processes in the zone & branches. \nYou are the focal point for local Marketing & communication initiatives in coordination with Marketing Manager-Pan India.\nYou prepare presentations for Business Development activities along with Spot studies / Addhoc reporting for Stakeholders.\nYou work closely with Marketing manager to ensure implementation of HO Corporate tools as well as work on improving local reporting tools/systems/reports.\nYou monitor key performance standards.\nYou  provide accurate flow of information, analysis & actions required to ensure commercial Management has all the relevant info at hand to devise commercial strategy.\nYou work on all other Reports as per Timelines set by Management.\nYou ensure that Sales KPI / Usage of corporate tools are achieved for respective ZonesPROFILE AND QUALIFICATIONS:According to French law, the VIE is only open to applicants aged 18 to 28 years old who are European citizens.\nYou have a postgraduate degree (5/6 years) in commercial/business development role and ideally have a previous experience in Marketing, Sales or Business Development. \nYou speak English fluently, have strong skills in Microsoft application (especially Advance Excel and PowerPoint) and you can help facilitate easy to use dashboards. Your rigor and sense of details enable you to provide error free analysis and reports. You also have very good presentation skills. A first experience or strong interest for the Shipping industry would be an asset., as well as Programming knowledge.\nYou are proactive, good team player and will be working closely with different departments in the zone and the agency. Good communication and inter personal skills will also allow you to fully succeed in this mission. \n Come along on CMA CGM’s adventure !Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}