{
    "Job ID": "69866075",
    "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.Job DescriptionOur systems and applications are exceedingly available and exceptionally performing. We are into the business, which touch everyone's pocket if card is being used for transaction. Those transactions are happening within fraction of seconds. In addition, within a second, thousands of transactions happen concurrently. Our service is not limited to one junction we are in 200+ countries.  Security is our prior concern. We develop an environment, which is reliable for transactions happening more than a trillion in value. Millions of cyberattacks is always challenging and give us more confidence to make our environment more assured. Availability is ensuring to security. Our environments are available round the clock. As technology is changing day by day, we believe in continuous enhancement of ourselves and like to deep dive of present-day knowledge.What are responsibilities of Site Reliability Engineering?Prime responsibility of Site Reliability Engineering is to make sure that environment is secure and safe. All security findings should be remediated within required resolution date defined by governance.\n\nWe do not allow outage, even for a second. If any issue happens, as owner of the environment we do the needful to make sure those environments are up and running. Root cause analysis should be within hours. We make sure that findings are remediated in Production environment after all tests and checks in lower environments.\n\nAs owner of environment, we keep track of all activities planned or happening in our environments. We are responsible for deploying new code in the environment.\n\nWe look and analyze our environment regularly. If there is a manual task, we do automation of that. We are increasing selfheal capabilities and will continue to do the same until environments become auto-heal.\n\nIf a new service is coming under our support or if migration of old environment is going to happen to new technologies, we start interaction with product developer to sketch out planning for production.\n\nAs our business is running round the clock, we work in shift and synchronize with multiple locations and multiple tracks (sub team).\n\nWe make sure that every activity is being recorded as per incident or change management process. Technical and related run books need to be prepared and shared with the team.This is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Basic Qualifications\n2+ years of relevant work experience and a Bachelors degree, OR 5+ years of relevant work experience\n\nPreferred Qualifications\n3 or more years of work experience with a Bachelor’s Degree or more than 2 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) in IT or Computer Science\nHaving 4+ years of IT experience with expertise in DevOps, Build and release Engineering, Cloud Infrastructure and Automation, Tech support.\nAbility to work as team player\nGood written and communication skills\nPunctual to office time and work\nGreat with problem solving and troubleshooting\nAbility to effectively prioritize and coordinate\nAbility to learn fast and implement latest technology trends in the industry\nGood understanding of CICD technologies.\nCore Skills on Dockers, DevOps, Linux.\nDevOps experience with Jenkins, Ansible, Docker, Kubernetes.\nGood experience in java-based web applications\nImplementing CI CD process\nExpertise in Trouble shouting on java applications in Tomcat services and Web application in Apache.\nGood Exposure on Virtualization and Containers (Docker).\nAbility to build deployment, build scripts and automated solutions using scripting languages such as Shell scripting (Bash)  Java Script  Python  Other\nWorked with Docker and created multiple containers and images and had experience on writing the Docker file\nCreated the deployments, services, and ingress flows for the application setup in the Kubernetes cluster.\nParticipated in release level discussions and gone through the total SDLC and Agile methodology\nSupport On-Call for all DevOps activities.Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}