{
    "Job ID": "69867541",
    "Description": "Fullstack Developer (Contract), Letsbloom-(2300017478)Job:VenturesPrimary Location:Asia-India-PuneSchedule:Full-timeEmployee Status:Fixed TermPosting Date:14/Sep/2023, 9:23:25 AMUnposting Date:14/Oct/2023, 10:59:00 PMFullstack Developer (Contract), Letsbloom, SC VenturesAt Letsbloom, we are enabling organisations operating in regulated industries, such as financial services, healthcare and government, to keep pace with security trends and regulatory demands.Our trusted infrastructure empowers clients to on-board future-ready, fail-proof applications on any cloud, with security and compliance embedded throughout the application development lifecycle. We help our clients stay ‘secure by design’ and ‘compliant by default’.We are a group of tech enthusiast and looking to work with people who are passionate about what they do. If you are someone who is curious, passionate, determined and would like to grow with organisation this is one of its kind opportunity for you to explore.About the roleThis is a Fullstack Developer role, which will be joining an experienced Product Engineering team in creating Letsbloom’s platform. You will build readable, concise, reusable and extensible code that avoidsre-inventing solutions to problems that have been solved previously.Other responsibilities will include, designing the architecture for a scalable, reliable, secure and fault tolerant SaaS application. In addition, you should research new technologies and tools that enables building of next generation systems, as well as working together with different teams within Letsbloom.Role Responsibilities·Take the lead in the development and delivery of a back-end·Highly proficient in a modern frameworks·write clean code·Experience consuming and designing REST APIs, you have worked creating REST APIs in any language.·Ability to drive initiatives and work independently·Making things work end to end is essential to youTechnical Skills and Ideal Candidate·4 years to 8 years of experience in a similar developer role·Bachelors/ Masters’ degree in Computer Science Engineering, from a recognized University·Programming Language : Java·Framework – Go, Python, Spring boot·Rest API, SOAP·DBs: SQL, MySQL, Postgres, Elasticsearch, Arango DB, MongoDB·Familiarity with the React.js ecosystem·Knowledge of functional programming and OOP.·Mentoring and leadership experience·Good communication and interpersonal skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}