{
    "Job ID": "69867110",
    "Description": "About BestEx ResearchBestEx Research is a financial technology and research firm specializing in building sophisticated execution algorithms and transaction cost modeling tools servicing multiple asset classes. The firm provides its services to performance-demanding hedge funds, CTAs, asset managers, and banks through a traditional electronic broker and in a broker-neutral Software as a Service (SaaS) model.BestEx Research’s mission is to become the leader in automation and measurement of execution across asset classes globally and significantly reduce transaction costs for our clients.Its cloud-based platform, Algo Management System (AMS), is the first end-to-end algorithmic trading solution for equities, futures, and foreign exchange that delivers an entire ecosystem around execution algorithms, including transaction cost analysis (TCA), an algo customization tool called Strategy Studio, a trading dashboard, and pre-trade analytics in a single platform. The platform is currently live for US equity and global futures trading.BestEx Research is disrupting a $100 billion industry by challenging the status quo of stale, black-box solutions from banks and offering next-generation execution algorithms that combine performance improvement with transparency and customization. BestEx Research uses leading-edge technology to support its low-latency, highly scalable research and trading systems with its back end in C++, research libraries in C++/Python and R, and web-based technologies for delivering its front-end platforms.Visit bestexresearch.com for more information about our mission, products, research, and services.Why work at BestEx Research?If you want to help investors reduce their trading costs in an incredibly complex market structure and help create and shape an industry-defining product, then this is an excellent opportunity to join an incredibly talented team of 20+. BestEx Research has almost zero turnover, top notch clients, zero bureaucracy, and a flat organizational structure. It is a true meritocracy, set in a collaborative environment, where every employee is working on extraordinarily interesting projects. Our pay scale and benefits are comparable to top-tier firms in our industry, either in the form of cash compensation or a hybrid cash and equity compensation plan. Employees at BestEx Research have exposure to much more variety in the projects they complete and opportunities for growth than in similar roles at other firms.Location: Bengaluru, IndiaOur beautiful Bangalore office is conveniently located in Outer Ring Rd, Bangalore. Amenities include modern work spaces, free parking, recreational games, a fitness center, bike storage, wellness room, and free meals.Primary Job ResponsibilitiesIn this role, you will be responsible for development of various software components of our core trading system such as market data adaptors, exchange connectivity adaptors and exchange simulators. Projects will vary from developing software from scratch (for example implementing a new asset class or a new execution algorithm) to enhancing the current system to support new features or improving performance. Our software stack is written in C++ 17.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}