{"Job ID": "69869688", "Description": "Responsibilities:Assisting the agile team to define testable work that ensures that desired customer experiences and outcomes are achieved and are technically robust, high performing, stable and secure.\nPromoting continuous improvement and identifying opportunities for efficiencies to maximize the customer experience and reduce test cycle time.\nReviewing design documents, business requirements (Stories), acceptance criteria, within the agile team to build test scenarios for testing activities.\nReview and provide feedback on project documents to aid creation of testing strategy, frameworks, script development standards, test plans and test is complete reports. \nPro-actively sharing and reporting risks, issues, challenges, blockers and forthcoming tasks to the Scrum Master or Quality Manager.\nAccountable to ensure the defects are detected and reported to be prioritized (based on impact) with the Product Owners.\nProviding support in highlighting software and hardware requirements to ensure proficient delivery of your role.\nActively contributes to their Centre of Excellence (CoE) specialism by cross sharing of learnings, emerging, good and best practice with their CoE colleagues. Also comply where required with CoE standards & policies.The Role offers:An outstanding opportunity to work in all specific stages of the delivery life cycle including functional, exploratory, regression and accessibility testing. \nHigh visibility, opportunity to understand and analyze acceptance criteria with colleagues to plan and manage the work necessary to perform and deliver testing for projects.\nBuilds effective and trusted working partnerships with a wide variety of individuals. Maintains an open and honest approach.  Essential Skills:Strong script writing experience in automation tools like Selenium and good knowledge in testing practices\nDesigning and implementing Test Automation Strategy.\nExperience configuring and running functional automated software tests.\nCreating modular and reusable Automation frameworks with Selenium + JUnit/TestNG\nExperience in any framework like Cucumber or Date Driven.\nBehavior Driven Development (BDD) framework / Test Driven Development (TDD) framework\nStrong Knowledge of AngularJS, Protractor, Maven and Charles Proxy \nStrong Knowledge of BDD/Cucumber\nExperience using JavaScript & Type Scripting (JS/TS) and knowledge of Puppeteer/Cucumber automation for angular application is desirable JavaScript.\nDesigning and implementing Test Automation Strategy.\nCreating modular and reusable Automation frameworks with Selenium + JUnit/TestNG automation\nFollow established test standards, guidelines, and methodology. Recommend changes as appropriate\nExposure in API and WebServices testing skill and any tools like SOAP UI / REST API / POSTMan\nExposure in writing complex SQL\nExposure in Unix\nExcellent Communication skills – written, oral.Essential Qualification:BE degree Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}