{
    "Job ID": "69866295",
    "Description": "The Finance Reporting Intermediate Analyst is an intermediate level position responsible for the generation, tracking and submission of financial reports in coordination with the Finance Team. The overall objective of this role is to accurately prepare and report business/financial transactions, reports and statements in accordance with local regulatory guidelines.\nResponsibilities:Support the analysis and submission of reports to various constituencies (local regulators, SEC, Fed, OCC, etc.) based on requirements such as US GAAP, US Regulatory, and local statutory reporting\nAssist with closing the books and sub-ledgers, including passing appropriate required adjustment entries and consolidating financials at the end of each accounting period\nAssist with financial and management reporting, planning and analysis, metrics, monitoring and forecasting\nDocument and establish business requirement documents, review test scripts, and interact with business partners to ensure successful migrations of key technology releases\nIdentify and resolve problems using basic Finance knowledge, escalating as needed\nAssist with the implement work flow or process change and redesign\nAssist in the management of one or more processes, reports, procedures, or products\nExecute processes and procedures within defined parameters\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:2-5 years of previous experience required\nStructured Query Language (SQL) and/or Statistical Analysis System (SAS) experience preferred\nSelf-motivated and detail oriented\nWorking knowledge of related industry practices and standards\nProven problem-solving and decision-making skills\nConsistently demonstrates clear and concise written and verbal communication skillsEducation:Bachelor’s Degree/University degree or equivalent experienceThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}