{"Job ID": "69866324", "Description": "About Four Seasons Hotel Abu Dhabi at Al Maryah IslandIn a vibrant urban community right on the water, Four Seasons Hotel Abu Dhabi at Al Maryah Island welcomes guests with bright, open spaces, embracing expansive views of the city skyline and the sparkling waves of the Arabian Gulf. On dynamic, upscale Al Maryah Island – Abu Dhabi’s business and lifestyle destination – Four Seasons is located within a 34-storey glass tower, both high-tech and environmentally advanced. Sophisticated new concepts throughout the Hotel define Four Seasons as Abu Dhabi’s most exciting waterfront location. Blending urban chic and understated luxury, we offer 200 light-filled accommodations, including 38 suites – all with water views. With six creative restaurants and lounges, this is Al Maryah Island’s premier location for stylish entertaining. All venues open to outdoor waterfront terraces and most include private dining rooms. Relaxation awaits in the radiant Pearl Spa – with separate fitness and treatment facilities for men and women. Our expansive swimming pool offers a cool social scene with skyline views. With two bright, airy ballrooms that open onto the water, Four Seasons is Abu Dhabi’s most desirable address for meetings, social events and weddings. Every moment is elevated by thoughtful Four Seasons service, anticipating each guest’s unique personal needs – whether the goal is relaxing on vacation or staying efficient for business.Main Duties/Description:1. Describe the selection of food & beverage menu items to guests by offering interesting, and vivid descriptions of each item, origin, taste, and preparation methods; communicate guest orders including any special needs or requests to the kitchen; coordinate food timings; check completed kitchen orders with the guest’s original order; transport items to the guest table in a timely manner to ensure proper food quality.2. Anticipate guest needs, ascertain satisfaction, and offer suggestions, and respond urgently and appropriately to guest concerns and requests.3. Breakdown, clean and set-up of tables, buffets, and food stations as well as the back-of-house areas.4. Comply with Four Seasons’ Category One and Category Two Work Rules and Standards of Conduct as set forth in Employee Handbook.5. Work harmoniously and professionally with co-workers and supervisors.6. Ability to work closely with stewarding & culinary teams and Housekeeping.7. Ability to work with 3rd parties (i.e. staffing agencies, etc…)8. Plate, prepare food & beverage items and serve as indicated in the Standards Training Manual.9. Assist with food & beverage service throughout hotel, guest rooms, meal periods, special events etc.10. Assist colleagues within the department to complete other duties (i.e. food running, clearing, cleaning, mise-en-place, polishing equipment etc)11. Operate tea/coffee making equipment at any time based on guest requests and BEO instructions.12. Store supplies.13. Take an active role in implementing safety procedures and following up within the department.14. Respond properly in any hotel emergency or safety situation.15. Develop a complete working knowledge of the beverage items and their ingredients and preparation.16. Recognize and address potential intoxicated, disruptive or undesirable guests.17. The ability to carry trays, bus and reset tables with linen, china, glass and silver. \nStandard Duties:1. To provide a friendly and professional service that always exceeds guests’ expectations.2. To ensure you read the hotel's employee handbook and have an understanding of and adhere to the hotel's rules and regulations and in particular, the policies and procedures relating to Fire, Hygiene, Health and Safety.3. To undertake other duties and responsibilities which, while outside the normal routine, are within the overall scope of the position.4. To report for duty punctually wearing professional attire.5. To maintain a high standard of personal appearance and hygiene and adhere to the hotel and department personal appearance standards.6. To comply with local legislation as required.7. To maintain good working relationships with your colleagues and all other departments through working by The Golden Rule.8. To respond to any changes in the division as dictated by the needs of the industry, company or hotel.9. To be flexible and extend job duties to carry out any other reasonable duties and responsibilities within the job capability as assigned, including redeployment to alternative departments/areas if required, to meet business demands and guest service needs.10. Conduct and attend training sessions as outlined.11. Wear hair restraint/hat, gloves to complete assignment within the kitchen areas.12. Must be able to obtain any required food handling and/or sanitation certifications required by local or state agencies.13. Perform other tasks or projects as assigned by the F&B Outlet Manager, or Director of Food & Beverage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}