{
    "Job ID": "69867361",
    "Description": "MISSIONThe Sales Ambassador is an Ambassador of Piaget inside and outside the Piaget Boutique by ensuring a top-level service for each clients.She/ He is responsible to achieve sales and exceed sales targets setting up by the management and to proactively develop the client database by implementing an effective data capture.As a team member, she/ he is an active participant in the daily operation of the boutique.KEY RESPONSIBILITIESSales Performance & Service:Develop the turnover, promote and sell Piaget creations by identifying clients’ motivations.\nDemonstrate a constant awareness and actively strive to achieve Key Performance Indicators (TPIs) in order to increase boutique performance and reach individual and boutique targets.\nAssist and support after sales clients and provide maintenance recommendations.\nDevelop a detailed knowledge of the Piaget pieces including construction, materials, care and design in order to provide exceptional and knowledgeable customer service.\nParticipate in, and represent Piaget during promotional events and activities.\nContribute in suggesting ideas and recommendation to the Management team in order to achieve improvements in all aspects of the boutique performance.\nMake a regular benchmark of the competition.Implement actively and strictly follow required procedures (both Piaget and Richemont), standards and policies as outlined in the Retail Book and RISEClients’ treatment:Provide exceptional standards of customer service surpassing client’s expectations at every opportunity by following our “Piaget Touch” Art of selling.\nDemonstrate and reflect the refined and luxury lifestyle image of Piaget through customer service, attitude, personal grooming, dress code and behavior.\nBehave as an Ambassador of the Brand inside and outside the Boutique.\nEnsure the highest level of service and care to all customers (both Clients and prospects).\nProvide a “wow” treatment to your clients as many time as you can.\nAct as a pair to ensure sales are handled most of the time by 2 persons (key of success).\nImplement an effective data capture & follow up for clients, prospects, CS and reservations.\nBuild, develop and maintain your own Local and International client database ensuring repeat visits and client’s loyalty.Resolve client’s complaints with the highest professionalism, promptly and successfully by investigating problems, developing solutions and making appropriate recommendations to the Boutique Management.Boutique operations:General:Contribute in suggesting ideas and recommendation to the Management team in order to achieve improvements in all aspects of the Boutique Operations/ Maintenance.\nAttend and participate in all boutique meetings and training events as required ensuring good communication is maintained.\nSupport the boutique management in any back of house/ administrative operations as requested.\nDemonstrate flexibility by supporting the boutique management in any other ad-hoc duties as might reasonably be required in the successful running of the Boutique.\nSupport the management team with successfully running and managing the day to day operations of the boutique including but not limited to customer relationships, boutique administration, stock management and visual merchandising.\nEnsure daily traffic is correctly counted on a daily basis.\nMake sure your boutique is properly maintained (lights, furniture…) and inform management team to take corrective action.\nEnsure all back of house standards are maintained at all times both in the communal areas and stock room.\nCommunicate all potential Health and Safety issues to the Boutique Management.\nControl the quality of the stock (scratches, movements, batteries for quartz watches…) and make sure to handle all pieces with extra care and in a perfect selling conditions.Stock Control:Play an active role in replenishing stock according to Piaget procedures and policies.\nMaintain effective stock controls to ensure continued stock supply and ensure good management of the stock (Stock record accuracy)\nParticipate and support the team in daily and annual inventories\nTake responsibility of designated stock/category, maintain the high standards and report any damages.Visual Merchandising:Implement and follow actively our required procedures, standards and policies as per the boutique Visual Merchandising guideline.\nActively ensure merchandise presentation reflect VM standards and general tidiness and cleanliness of the boutique at all times\nCheck the display (products are correctly handled and priced).SKILLSProfessional:Demonstrable sales skills and success gained as a sales consultant (2 years experience minimum)in a luxury Retail or Service environment is required.Fluency in the English language, Arabic language is a plus.\nExcellent communication skills both written and verbal.\nWell-groomed and demonstrate an attitude of professionalism, conscientiousness and reliability.\nKnowledge and understanding of the UAE Luxury market, customer service and High Watch and Jewelry industry.\nShow innovation and initiative in setting customer care standards.\nDemonstrate respect and politeness.\nComputer knowledge in Microsoft; knowledge of SAP is a plus.Personal:Enthusiastic, self-confident and self-motivated with positive attitude at all times.\nProfessionalism is maintained under all circumstances.\nSuccessfully able to handle multiple demands and competing priorities.\nBe a team player and have a strong attention to detail.\nAble to work flexibly, embrace and manage change.\nUnderstand and represent the luxury lifestyle image of Piaget.\nPrepared to go the extra mile to achieve targets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}