{"Job ID": "69868111", "Description": "General information: Responsibilities: He/She will be Responsible for the HSE function in the Factory. Issuing Work Permits and conduct Activity based Risk Assessment prior to work. Monitoring personnel and workspace for safe working. Tracking of Tools, Machineries and PPE's validity. Monitor hazardous chemicals if any. Delivering and deploying HSE training and Performance improvement programs. Providing analysis of HSE data within area of responsibility. Contributes to assessing emerging trends and legislation in HSE and communicates relevant information on legal requirements. Supports to operate in compliance with standards and respective legal obligations. Contributes to driving behavioral change and continuous improvement though delivery of training and competence initiatives and expert support to the Factory in line with yearly HSE plan agreed with the Business Units. Supports the sharing of best practices. Coordinates reporting on HSE performance and support delivery of Group audit program. Contributes to and/or plans and executes Health, Safety and Environment performance and Corporate Responsibility related projects. Comply with the Health, Safety and Environmental Policies. Shall be Optimistic, Self-motivated, flexible, proactive, Self-assured and welcomes change. Independently determines approach and assigned tasks. Engages interest and participation of others and has a collaborative approach to working together and committed to team's development. Shows moral courage, openness, and honesty in all dealings. Good communication and interpersonal skill. Ability to work in a diverse and dynamic environment. Your background: Educational Qualification preferable will be Degree/Diploma in Science / Engineering / Industrial Safety. Completion of an OSHA training program is an added advantage. 3 - 5 years of experience of HSE management is required. Experienced with Microsoft Office (Outlook, Excel, Power Point etc.). Understanding of Electrical / Mechanical Symbols, Schematic, and other technical information. Able to spot potential hazards, identify safety concerns, and recognize practices that could harm the environment. Ability to Audit and Incident Reporting. Skills on Electrical safety, Equipment lockout, Machine safeguarding, Industrial Machinery operations and Ergonomics. Work with other Functional Teams in Factory to create a safe environment for everyone. Knowledge on environmental laws and regulations to review company practices. Good in verbal and written communication and demonstration.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Law Firm", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}