{
    "Job ID": "69867561",
    "Description": "Client care executive- UAE-(2300017193)Job:Retail BankingPrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 9:12:08 AMUnposting Date:OngoingThe Role ResponsibilitiesIn charge of day to day management of team and accountable for their results\nSet targets, review results, deal with individual performance and manage delivery of KPIs\nEnsure that team meets required Targets\nManage, motivate and train team to ensure that performance is optimized\nEnsure that team is not providing any incorrect information or mis-selling to customers\nRegular review with the team on the performance\nAssist in job performance evaluations\nAssist teams in improving Productivity\nHandle escalation\nIdentify & report training needs\nScheduling, if applicable\nIdentify pain areas. Process improvement to be initiated\nFind solutions/ensure outcomes/ result orientation\nMonthly review and reporting on KRI/KPIs\nTo reduce the attrition rates and maintain it within the limits prescribed by the organization\nEnsure self and team compliance with all applicable rules / regulations and group policiesResponsibilitiesScheduling, if applicable\nIdentify pain areas. Process improvement to be initiated\nFind solutions/ensure outcomes/ result orientation\nMonthly review and reporting on KRI/KPIs\nTo reduce the attrition rates and maintain it within the limits prescribed by the organization\nEnsure self and team compliance with all applicable rules / regulations and group policiesStrategyAwareness and understanding of the Group’s business strategy and model appropriate to the roleBusinessAwareness and understanding of the client care centre inbound role and the impact of  economic and market environment in which the Group operatesProcessesResponsible for executing and supervising the Service Levels, identifying the business opportunities, challenges, constraints which needs to get highlighted and bring in controlsPeople & TalentLead through example and build the appropriate culture and values. Set appropriate tone and expectations from their team and work in collaboration with risk and control partners.\nEnsure the provision of ongoing training and development of people, and ensure that holders of all critical functions are suitably skilled and qualified for their roles ensuring that they have effective supervision in place to mitigate any risks.\nEmploy, engage and retain high quality people, with succession planning for critical roles.\nResponsibility to review team structure/capacity plans.\nSet and monitor job descriptions and objectives for direct reports and provide feedback and rewards in line with their performance against those responsibilities and objectivesRisk ManagementThe ability to interpret the Call drivers, identify key issues based on this information and put in place appropriate controls and measuresGovernanceResponsible for assessing the effectiveness and deliver effective governance, oversight,  if necessary, oversee changes in these areas;\nAwareness and understanding of the regulatory framework, in which the Group operates, and the regulatory requirements and expectations relevant to the roleRegulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles. Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key stakeholdersClient Experience teamsOur Ideal CandidateAny Graduate or under graduate with 2 yrs of sales experienceRole Specific Technical CompetenciesCustomer Service Experience\nCommunication\nSales ExposureAbout Standard Chartered We're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by hJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}