{
    "Job ID": "69866229",
    "Description": "Why Patients Need YouAt Pfizer, our mission is to inspire a best-in-class culture of continuous improvement and project management that empowers colleagues and enables simple, effective processes. Whether you are managing projects or liaising with others, your contribution in this team will help in making our work easier and faster so that we can deliver breakthroughs that change patients' lives.What You Will AchieveAs a member of Pfizer’s Continuous Improvement program, you will define, design and implement continuous improvement programs to ensure programs are integrated vertically and horizontally across the organization. Your work will analyze improvement programs and potential results; facilitate and coach improvement teams; establish and maintain performance metrics to measure program success; and install proves excellence supports for program governance, project reviews, communications, training, certifications and rewards.As a Manager, your breadth of knowledge on internal or external business challenges will help us improve our products, processes and services. Your will guide us to lead projects by meeting objectives and preparing forecasts for resource requirements. Your risk-taking ability will help us advance new concepts and methodologies. You will provide technical guidance and oversight to team members and help in problem solving.It is your hard work and focus that will make Pfizer ready to achieve new milestones and help patients across the globe.How You Will Achieve ItManage multiple projects/ongoing work activities of moderate complexity within the department typically involving cross-functional representatives\n\nDevelop and implementa Knowledge Management framework that supports end user requirements & ease of access to relevant information. \n\nAssist with the Operational Excellence (OpEx) organization and manage all site specific OpEx activities with guidance from site and area/business leadership. \n\nDevelop and implement projects and cross-functional teams to cultivate a continuous improvement mindset based on lean principles. \n\nWork closely with management and stakeholders in the Continuous Improvement journey to identify areas where OpEx projects can add value to transform the company’s performance. \n\nPromote the common understanding of OpEx strategy and culture across the company.\n\nCreate, curate, organize and standardize thestorage of processes, tools, training materials, templates and best practices that are current, relevant and consistent with the best practice expectations.\n\nLiaisewith Quality & Compliance leadership to ensure that the knowledge management policies, procedures, practices and documentation meet regulatory expectations.\n\nSupport development of a site or team Community of Practice for sharing Best Practices across workstreams; provide coordination and analytic support to maximize engagement and effectiveness.\n\nProvide day-to-day leadership and direction on continuous improvement projects viz Lean and Six Sigma projects, with a focus on production and business process improvement. \n\nManage Lean and Six Sigma projects end to end viz opportunity assessment, project creation, project management, project coaching, reporting, implementation and control.\n\nCoach Yellow and Green Belt colleagues in the application and use of Lean and Six Sigma.\n\nBuild and maintain a diverse and inclusive team culture and support Pfizer’s Diversity, Equity and Inclusion objectives within the business unit.QualificationsMust-HaveBachelor’s degree and5+ years of applicable experience. \n\nPeople Management Experience.\n\nProven leadership and change management abilities. \n\nAbility to effectively coach and mentor colleagues. \n\nStrong oral and written communication skills.Nice-to-HaveMaster’s degreeand relevant pharmaceutical experience.\n\nExperience leading large projects. \n\nEffective team building skills and negotiation skills.\n\nProject management and continuous improvement certifications (e.g. Agile, PMP, Black Belt Six Sigma, or similar).#LI_PFE \nWork Location Assignment: On PremisePfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}