{
    "Job ID": "69868138",
    "Description": "General information:To comprehend customer requirements and deliver product design & engineering meeting timelines according to customer specifications and assigned KPIs.Responsibilities:Understand customer requirements during quotation stage and after project receipt. Follow engineering process to create order designs and documents, keeping project cost in mind while fully aligning with customer specifications. Perform design verification using engineering tools, standards, and customer requirements. Compiles organize and archive documentation for assigned projects. Proactively identify risks and mitigate in solution concept stage in consultation with Manager. Align with manufacturing plan to deliver design specifications and create requirements in ERP. Actively participate in Design review meetings before finalizing detailed engineering solution. Knowledge of 2D/3D FEM applied to electrostatic/electromagnetic simulation is preferred. Visit and lead discussions with customers for Design reviews, approvals & clarifications. Using latest technology and tools, optimize and adopt innovative design solutions employing best practices. Prepare/check manufacturing documents for Core-winding-active part 3D models, 2D drawings and Bill of material in ERP. Plan and monitor assigned projects consistently achieving related KPIs. Support services for Erection, Commissioning and site related technical matters. Possess knowledge of Indian and International Standards & Codes - IEC, IEEE, BIS, DIN, ISO for electrical design related aspects of power transformers and shunt reactors.Your background:BE/ME - Electrical with 5 - 12 years of industry experience in electrical designing of Power Transformers and Shunt Reactors (preferably 400kVand 765kV product range). Preferred to have knowledge and exposure to 2-D and 3-D CAD software packages like Creo/MagNet or similar. Having experience of working on optimization and cost saving projects utilizing alternative materials, processes, and solutions.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Vadodara, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}