{"Job ID": "69866026", "Description": "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level.As a Salesforce Developer in CRM team within Commercial banking Business, you will be involved in all aspects of the Software Development Lifecycle (SDLC) including analyzing requirements, incorporating architectural standards into application design specifications, documenting application specifications, translating technical requirements into programmed application modules, and developing or enhancing software application modules. You need to identify or troubleshoot application code-related issues and take active role in code reviews to ensure solutions are aligned to pre- defined architectural specifications. You will also be required to assist with design reviews by recommending ways to incorporate requirements into designs and information or data flows, and participate in project planning sessions with project managers, business analysts, and team members to analyze business requirements and outline proposed solutions.Job ResponsibilitiesDevelop customized solutions within the Salesforce platform to support critical business functions and meet project objectives, client requirements and company goals using both configuration and development\nSDLC tools and agile development methodology. Manage daily support and maintenance of internal Salesforce instance, and conduct long-term improvement operations to ensure compatibility with evolving mission requirements\nCommunicate with project managers, clients and other developers to design cohesive project strategies and ensure effective collaboration throughout all phases of development, testing and deployment\nMaintain a flexible and proactive work environment to facilitate a quick response to changing project requirements and customer objectives, and innovate ways to meet mission goals successfully Required Qualifications, Capabilities, and SkillsMinimum of 2+years experience working on the Salesforce Financial Service Cloud implementations in a multi org structure .\nSolid application design, coding, testing, maintenance and debugging skills in Salesforce CRM platform.\nUnderstanding of both how to enhance the platform using configuration and code (Apex & Lightning Components)\nAdvanced knowledge of architecture, design and business processes and expertise in application, data and infrastructure architecture disciplines\nExtensive Software Engineering work experience in an Agile / SDLC environment and solid software design, coding, testing, maintenance and debugging skills in the Salesforce CRM platform\nStrong experience with Salesforce and hands on experience with the Apex programming language, building Salesforce Lightning UI, Salesforce Lightning Connect to call external API, and development of REST APIs, and good understanding of OAUTH2, Caching, Future calls, outlook integration, open CTI and salesforce features\nAn understanding of the sales process to better align changes to the CRM platform and familiarity with modern technology and architecture (cloud, virtualization, object stores, etc.), as well as with SDLC tools and agile development methodology\nSkills Required: Requires experience in the following: JSON; Javascript; REST; CSS; GIT; SOAP and REST web services; Software Development; SQL; XML; Salesforce development; Aura development; APEX development; Sales Cloud; and API Integrations.Preferred Qualifications, Capabilities, and SkillsApplication Development work in Agile environment preferred\nAbility to work collaboratively in teams and develop meaningful relationships to achieve common goals\nPlatform Developer I and Platform Developer II Certification highly desired.\nAbility to develop reports, dashboards, and processes to continuously monitor data quality and integrity and ability to interpret system / business requirements and prepare specification and design documentJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}