{
    "Job ID": "69866244",
    "Description": "Sells a subset of product or services directly or via partners to a large number of named accounts/non-named accounts/geographical territory (mainly Tier 3 accounts). Primary job duty is to sell technology software products and related services in a defined territory. Identifies, qualifies and closes new opportunities. Manages accounts including the entire sales process from business development prospecting and specifications through contract negotiations, signing, and post-sales support. Leverages the Oracle sales model to maximize revenue growth and increase local market share. Builds and expands business partner revenue and self sufficiency. Job duties are varied and complex, needing independent judgment. May have project lead role. 5 years field sales experience including technology sales experience. Ability to forecast, manage sales expenses, and successfully close new Oracle business. Business development, prospecting and presentation skills. Excellent communication skills and problem solving ability. Proven track record of exceeding sales objective and territory/account development. Experience as the focal point for clients for all sales and related issues. Oracle knowledge and/or knowledge of Oracle*s competitors. Travel may be needed. Bachelor degree or equivalent.As part of Oracle's employment process candidates will be required to successfully complete a pre-employment screening process. This will involve identity and employment verification, professional references, education verification and professional qualifications and memberships (if applicable).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}