{"Job ID": "69866098", "Description": "As a Quant Research professional in the Emerging Markets Asia Pacific (EMAP) Equities team, you will be focused on developing, implementing, and maintaining quantitative models for the EMAP Global Emerging Market Equities (GEM) Core team. As a part of this team, you will work closely with quantitative researchers, portfolio managers and software engineers in the team to deliver state of art quant infrastructure and solutions.Job ResponsibilitiesData sourcing, analytics, and database optimization\nDeveloping and maintaining programming libraries, creating numerical library components, performance tuning of these libraries\nFactor/strategy back-tests and portfolio construction using quantitative techniques\nCollaborate with technology and other EMAP and global quantitative research teams on bringing research to production, and building out the databases and research platformRequired qualifications, capabilities, and skills2 to 5 years of experience in quantitative finance, data analysis or front desk quant developer\nStrong analytical and problem-solving skills, and strong attention to detail\nA demonstrated interest in data analytics, financial markets and investing\nExperience in coding required. Proficient in coding in Python and experiences in building library using Python\nExcellent communication skills and ability to thrive in a team environment are criticalPreferred qualifications, capabilities, and skillsStrong academic background; undergraduate degree in finance, financial engineering, data science, or other quantitative or technical fields is preferredJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}