{"Job ID": "69866983", "Description": "At Zscaler, we are on a mission to redefine network security for the Cloud and Mobile-First World. The cloud and mobility are creating a mega-shift that’s disrupting 30 years of networking and security infrastructure. Traditional network security architecture is no longer suitable for the cloud and mobile-first world.Zscaler is a pioneer and leader in cloud security and we are enabling the world’s leading organizations to securely transform their networks and applications for the cloud and mobile-first world.With a solution born and built 100% in the cloud, Zscaler employees have built and operate a massive, global cloud security architecture, delivering the entire gateway security stack as a service. By providing fast, secure connections between users and applications, regardless of device, location, or network.The Support Manager will provide world-class post-sales technical support, by managing a shift of level 1-3 support engineers and team leads, all part of a cohesive hive-team unit.You will foster an environment that is focused on customer satisfaction, continuous improvement, and innovation in the transformation of highly complex customer networks. This role will involve work closely with other support managers in other locations.Responsibilities:Day to Day DutiesManages Technical Team, including 1-on-1’s, and retain top talent.\nLeads escalation calls with customer.\nEnsure teams are trained on process + product.\nEnsure team follows process and corrects deficiencies.\nManages shift, and ensures all shift are filled, PTO managed.TeamManage technical support engineers.\nMentor and train support engineers on process and technical products\nRetain top talent.\nEnsure training programs and certifications are completed.\nManage team shifts, ensure proper issue hand-offs.EscalationsEngage with customers on escalated support issues or critical customer situations.\nSend issues to proper level or get well team engagedTechnicalBecome a Zscaler cloud services expert through self-study, company training, and a desire to excel and become an expert.\nEnsure the team becomes experts.\nLeverage the team and resources for proper issue resolution.AdministrativeMaintain ticket database, logging issues and customer interactions.\nEnsure support process is closely followed, work with team on corrections.\nEnsure SLAs are metOther detailsLimited travel – typically only for company training or meetings\nHours – Weekday shift work, shift may vary, possible on-call.\nOther duties or projects, as assigned.2+ years support manager experience\nProven escalation management experience\nPeople management experience including strong soft skills.\nVery strong verbal and written communication skills (English)\nBachelor of Science in Computer Science/Engineering or equivalent advanced industry certifications.\nMinimum 3 years’ experience working as Support Engineer/ Sr. Support Engineer supporting networking or web security products.  \nWorking knowledge of networking and security products and enterprise network infrastructure.\nRequired knowledge and experience.\nNetworking Experience - VPN technologies such as IPSec and VPN clients\nNetwork Security (SSL/TLS, VPNs, Firewall, IDS/IPS)\nAuthentication systems such as LDAP, MS AD etc\nKnowledge of protocols such as HTTP, SMTP, FTP, DNS\nExperience with operating systems such as Linux, Unix and Free BSD\nNetwork troubleshooting experience - Familiarity with tools such as Ping, Traceroute, MTR, and Network Protocol Analysers such as tcpdump, Wireshark.\nKnowledge of protocols such as HTTP, SMTP, FTP, DNS\nWorking knowledge of Apache and IIS Web Server administration\nScripting knowledge (SHELL, Python, Perl) – not required, a plus.#LI-AW2Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chandigarh, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}