{"Job ID": "69868163", "Description": "Business: Wholesale NFR CoEOpen positions:1Role Title:VP- NFR Technical Training & EducationGlobal Career Band: 4Location (Country / City ):India – Hyderabad & BangaloreThe Opportunity:The job holder will lead the NFR Training Team in the COE. He/she will be supporting the Global NFR team in managing the training programs within the Bank, ensuring that staff gain and develop the knowledge and skills they need to carry out their jobs effectively, whilst mitigating financial crime risks.\nThe role holder should be able to develop, design and deliver technical training in conjunction with the training team, SMEsand the Central L & D Academy.What you’ll do:Principal Accountabilities: Key activities and decision making areasImpact on the Business/FunctionLead and support the NFR team in developing technical training programs for both new joiners and existing staff\nManage, and take responsibility for the development and performance of other members of the NFR Training Team in the COE.\nSupport and monitor the development of the new joiners’ knowledge & expertise according to the current needs of the organisation and latest market trends\nInput into designing and developing an overall training plan across all NFR typologies, inlcuding bespoke learning pathways for both new and existing RMs and Support Staff\nEnsure appropriate governance and timely delivery of technical training across mutliple jurisdictions, factoring in local requirements\nProducing training materials and documentation for in-house training\nLiaising with multiple Global stakeholders in order to identify, manageand deliver training requirements.\nMonitor, maintain and develop all relevant Sharepoint and Intranet sites, ensuring they are fit for purpose and met end user requirements.\nInput into the design and delivery of Global mandatory training programs, such as High Risk Roles Learning, GMT etc.\nReviewing and revising existing training materials in response to stakeholder feedback and Policy revisionsTypical Targets and MeasuresGovern, develop, monitor and deliver technical training programs for GB and CMB frontline and support staff.\nForesee risks and issues in an operational environment anddesign mitigating training materials as approrpriate.Customers / StakeholdersRespond efficiently to ad hoc technical training requests from business and other key stakeholders.\nProduce communicate and deliver training materials as necessary following audit or compliance assurance findings.\nPro-actively liaise with stakeholders to identify emerging risks and produce appropriate training materials to address.Typical Targets and MeasuresIssues identified, training delivered and risks mitigated.\nPositive feedback received from stakeholders and staff.Leadership & TeamworkContribute to the development andimplementation of the training team strategy and the translation of materials for various audiences.Typical Targets and MeasuresFeedback from stakeholders collected, analysed and acted uponOperational Effectiveness & ControlContribute to the creation of a supportive work environment driven by people centric values.\nDevelopment of appropriate training to ensure compliance with Policy, legislation and regulations.\nBuild professional relationships with colleagues in other areas.•Typical Targets and MeasuresPositive audit findingsMajor Challenges (The challenges inherent in the role that require a continual test of the role holder’s abilities)Developing and maintaining sound knowledge of NFR, including regulatory requirements.\nWorking effectively with key stakeholders using strong influencing skills to ensure satisfactory resolution of key issues.\nDesigning and delivering technical training within limited time frames, understanding technical content and working with SMEs to provide effective learning solutions\nCo-ordinating feedback from various stakeholders, who may have different / competing agendas.Management of Risk (Operational Risk / FIM requirements)To continually re-assess the financial crime risks inherent in the business, taking account of changing economic or market conditions, legal and regulatory requirements, operating procedures, management restructures, and the impact of new technology.Observation of Internal Controls (Compliance Policy / FIM requirements)The jobholder must demonstrate adherence to internal controls and procedures. This will be achieved by keeping appropriate records and, where appropriate, by the timely implementation of training requirements identified through internal and external audit points, including issues raised by external regulators.\nThe jobholder will adhere to the Group compliance policy through liaison with Global Head of Compliance, Global Compliance Officer, Area Compliance Officer or Local Compliance Officer. The term ‘compliance’ embraces all relevant financial services laws, rules and codes with which the business has to comply.Role Dimensions (e.g. balance sheet size, lending/expenditure limits, size/volume of transactions, budget)Main areas of responsibilities:Identification of technical training needs and delivery oftechnical training in the areas of AML, Sanctions, Fraud, Tax, ABC, ESG and CMB / GB Product knowledge\nCooperation with ABC, ESG and Fraud Teams, Regional NFR leads, RMs, CMs, CM SMEs, KYC Teams/CDD Support Teams to deliver technical learning solutions\nPerforming tasks related to knowledge management. Development of knowledge and skills as Training Specialist LeadJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}