{
    "Job ID": "69866119",
    "Description": "Job SummaryThis position is responsible to enhance the customer experience through researching and resolving customer claims like Amount miss match, Missing Deposit, Non Post, Non Negotiable, Multi Post Etc. It requires to research and take decision on resolving the customer request by processing debit/credit. It requires strong analytical and decision making skills to resolve customer request and helps the bank to avoid the losses.It requires use of various software (including Microsoft Office), web based, and mainframe applications. Communication, in both written and verbal formats with Branch Manger, Customer Service Representative, other Financial Institutions and internal department of the results of research efforts within established service level agreements will be necessary. \n JOB Responsibilities:As an Operations Team Leader within Customer Resolution Services, you will:\n• Oversee the Daily SLA requests, Escalation, Customer requests, Lockbox Research and secondary review team which consists of approx. 15 – 18 specialists\n• Proactively manage team's incoming volumes and pending requests, ensuring requests are reviewed timely and accurately\n• Communicate with internal business partners regarding issues and field inquiries related to process and procedures, Have Complete end to end Process Knowledge &       emerge as the SME for the process\n• Work with team members to properly review complex requests or process exceptions, including coordination of priority approvals\n• Hold 1x1 sessions with staff, ensure policies and procedures are adhered to; address tough conversations regarding performance issues\n• Evaluate staff performance and provide feedback; manage and escalate performance issues and growth opportunities\n• Review and approve procedural changes and enhancements, Ensure that the Latest Process Updates/Changes are communicated to & understood by all Team    Members, To Conduct Team Meetings / Reviews Periodically and provide feed back to line manager.Required Qualifications, Skills and Capabilities• Graduate/Post Graduate degree preferred\n• Minimum one year of supervisory experience unless an internal candidate\n• Proven team leading ability (back up for TL in case of internal)\n• Research and problem solving knowledge\n• Organizational skills, attention to detail and time management\n• Be able to handle pressure situations and juggle multi tasks/issues\n• Ability to follow complex methods and procedures in the service support of diverse subject matter and routine/non-routine tasks Preferred Qualifications, Skills and Qualifications• Change Management, adapts to change easily\n• Industry knowledge, especially debits/credits and adjustments\n• MS Office, including Outlook, Word and Excel, Leadership Experience preferred \n• Ability to keep team members engaged and motivated in a volume driven environment, Good Coaching Skills, Presentation ability and flexible to work in shifts\n JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}