{
    "Job ID": "69866568",
    "Description": "We are seeking an energetic and well-organized Assistant Banquet Manager to provide our customers with a first-class banquet experience. As an Assistant Banquet Manager, you will liaise with the banquet sales director and the head chef to meet customer expectations. Your duties will include controlling the cost and quality of services, preparing the venue, and coordinating the service of meals.To be successful as an Assistant Banquet Manager, you should exhibit extensive experience in managing banquets and delivering services within budget. Outstanding Assistant Banquet Managers ensure that customers receive a level of service that exceeds expectations.YOUR DAY-TO-DAY:Discussing sales contract details with the banquet sales director and the head chef.\nPlanning the venue layout according to the number of guests and the type of event.\nDetermining the number of table waiters and servers required.\nSupervising the placement of tables, chairs, cutlery, plates, glasses, table linens, centerpieces, heating lamps, serving utensils, and carving stations.\nConsulting with the Head Chef regarding the timing of meal courses to be served.\nOverseeing the seating of guests, the serving of meals and beverages, and the clearing of tables.\nManaging the availability of liquor and soft drinks, when required.\nPreparing work schedules and completing documentation in a timely manner.\nAnswering customers' questions and accommodating special requests.WHAT WE REQUIRE FROM YOU:Accredited certificate or diploma in catering, culinary Arts, hospitality, or similar.\nBachelor's degree in hospitality and culinary arts preferred.\n3-5 years of experience in banquet management, or similar.\nExceptional ability to plan banquets, manage budgets, and meet deadlines.\nExperience in supervising banquet venue staff.\nAbility to collaborate with Sales team and Kitchen team.\nExtensive knowledge of catering equipment and venue requirements.\nIn-depth knowledge of hospitality industry best practices.\nExcellent interpersonal and communication skills.WHAT YOU CAN EXPECT FROM US:We give our people everything they need to succeed. From a competitive salary that rewards all your hard work to a wide range of benefits designed to help you live your best work-life – including a full uniform, impressive room discounts, and some of the best training in the business.Our mission is to welcome everyone and create inclusive teams where we celebrate differences and encourage colleagues to bring their whole selves to work. IHG Hotels & Resorts provides equal employment opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. We promote a culture of trust, support, and acceptance. Always welcoming different backgrounds, experiences, and perspectives.IHG gives every member of the team the room they need to belong, grow and make a difference in a collaborative environment. We know that to work well, we need to feel well – both inside and outside of work – and through our well-being framework, we are committed to supporting well-being in your health, lifestyle, and workplace.So, join us and you’ll become part of our ever-growing global family.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}