{"Job ID": "69866524", "Description": "Req ID:434103 Leading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwidePurpose of the job:Analyst is responsible for dealing with all incoming standard HR service requests from Managers, Employees and HR Business Partners in HRGS Hubs. This involves updating systems, including salary records and creating documents. They support a range of different HR functions. The job holder must resolve as many incoming standard requests as possible to meet the business needs and ensure that the HRGS hub meets its Service Level Agreements. Resolving requests includes an end to end generalist service to secure authorizations, address issues, create contracts, inform suppliers, update systems and maintain employee files; ensures accuracy and completeness of confidential personnel files and employee records; and files and retrieves documents. The job holder will also need to manage customers who are unclear about the nature of their request, provide incomplete information or request services outside the scope of the HRGS, escalating any issues whilst ensuring that confidence of the customer is maintained, and customer satisfaction goals are achieved. Organize and maintain a variety of confidential and statistical records; reports and files; prepare periodic reports.Main ResponsibilitiesCustomer ServiceEnsure that all aspects of work are completed to SLA requirements\nEnsure that all services delivered meet general time and quality requirements.\nEnsure that escalations and requests on hold are progressed.\nEnsure effective communication and customer focused behavior to enhance customer satisfaction requirement\nFaciliatate effective communication with customers\nEncourage customer focused behavior to enhance customer satisfaction requirements.\nOrganize and/or participate in best practice forums and knowledge increase initiatives\nDevelop collaborative working relation with the customerOutbound ServicesSupport the HR global and local processes each year, running and validating reports, creating and checking letters for pay reviews, bonuses, etc.\nSupport the Functional Experts and HR specialist teams in implementing and managing new services and changes to existing services through letters, contract amendments, systems updates, etc. Project ActivitiesEnsure the understanding of and in collaboration with all involved stakeholders ensure implementation of new tools\nSupport the HR global and local yearly/periodical processes - validating reports, doing random quality checks, ensuring proper collaboration with involved workstreams or HRBPs\nDrive projects to develop/improve processes, systems and standards to continuously improve service delivery.Experience Prerequisites & Required CompetencesEducational RequirementsMandatory: University DegreeDesirable: with specialization in HR or equivalent will be additional advantageExperience Mandatory:2~4 years experience in HR OperationsExposure to HR Life Cycle Process, Analytics and Reporting would be an added advantage.Systematic and process-oriented approachDesirable: Success Factors/SAP experience strongly preferred\\Competencies & SkillsStrong interpersonal and relationship building skills, adaptability to work with people from various cultures & areas of business\nConfirmed effective verbal & written communication and presentation skills\nHistory of making decisions with minimal guidance in accordance with policies and established procedures\nVery detail oriented, proactive and organized with strong technology and Microsoft office skills\nAbility to prioritize tasks and flexibility to change priorities when situations arise\nGood project management & analytical skills with ability to identify problems, make decisions, create solutions, and take action.Being able to understand company finances, resourcing and the ultimate aims of the business is importantEXPERIENCE PREREQUISITES & REQUIRED COMPETENCESAlstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?  Equal opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected.  All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law. \n Job Type:ExperiencedJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}