{"Job ID": "69869888", "Description": "Horizon Geosciences is part of the Boskalis group of companies.  Horizon Geosciences provides marine survey and geotechnical services to an array of clients around the world.  Working through their network of offices, supporting every stage of offshore and nearshore projects through their comprehensive range of marine scientific services and fully equipped vessels.Make your mark as an Senior Geotechnical Engineerat Horizon Geosciences!\nAs an senior geotechnical engineer, responsible for assisting the senior principal engineer in the management of the geotechnical engineering deliverables of projects, the planning, project management and supervision of offshore, nearest and Onshore Geotechnical investigations, with subsequent factual and interpretive reporting as necessary. The senior geotechnical engineer is actively in the improvement and widening of technical capability within the geotechnical engineering division.\n\nYour responsibilities as an senior geotechnical engineerTo aid the lead geotechnical engineer manage the resources in the geotechnical team to deliver the agreed outcomes for geotechnical schemes\nTo aid the lead geotechnical engineer in identifying areas for improvement within the team and methods by which improvement may be achieved.\nTo undertake ground investigation activities and where necessary provide lead engineer/party chief role if/ when offshore.\nTo prepare ground models and undertake engineering calculations in accordance with recommended design procedures.\nTo prepare designs, reports, specifications and other deliverables for factual and interpretive reporting deliverables.\nTo ensure engineering assessments are appropriate and meet the expected high levels of technical capability.\nTo seek innovation in the delivery of schemes and techniques used in engineering assessment and analysis\nFacilitate in achieving targets and business improvementYour qualities and experience\nYou can make your mark as an senior geotechnical engineerif you have:Bachelor’s degree with honors in geology or civil engineering (with specialization in geotechnics) MSc in a relevant discipline is a distinct advantage.\nChartered in relevant discipline or pursuing chartership\nKnowledgeable and proven history in procurement and delivery of ground investigations and subsequent interpretive design reporting.\nProven history in geotechnical ground modelling, geotechnical analysis and design such as piled foundations, shallow foundations and settlement, preferably in a marine environment.\nFully conversant in base geotechnical logging software such as gint.\nKnowledge of proprietary engineering analysis software.\nFully conversant in microsoft office suiteWhat you can expectA dynamic environment: A job where you can make an impact, in an earth-moving company, as part of a diverse, international team of experts.\nRewarding conditions: A competitive salary and much more.\nWarm welcome: We warmly welcome our new colleagues, so they feel at home as soon as possible.\nCareer development: Plenty of opportunities to realize your full potential. Challenge yourself with (online) courses in our Boskalis academy.Extra informationYour team: You will be part of the geotech engineering department.\nWhere you will work: You will be working in our office in SAIF Zone, Sharjah, United Arab Emirates.\nFulltime/ part- time job: The position of senior geotechnical engineer is a full-time job.\nProcedure: All you need to do to apply for a job is to complete the online application form and send it to us along with your CV and cover letter. As soon as you have sent your application, you will receive a confirmation email. Depending on the job, we will invite you for two or more interviews via Microsoft Teams or at our office. If both sides are happy to proceed after interviews, we will make you an offer to join Horizon. After successfully completing all the steps in the procedure, we warmly welcome you to our organization.Want to know more?\nWe are more than happy to answer your questions about the position of senior geotechnical engineer. Please contact Jenelyn Duran, HR Assistant via our career page.Interested?\nPlease apply before the 06th of October 2023.Disclaimer for recruitment and selection agencies\nWe do not accept any unsolicited applications or CVs from recruitment- and selection agencies.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Sharjah, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}