{"Job ID": "69861053", "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Job DescriptionCoordinate execution of SW integration and tests to verify system operation.\nWork with software developers as needed to help diagnose and identify the root cause of problems found during software integration. Submit problem reports for errors found.\nManage the software build and release process\nOversee maintenance of source code repository (Jenkins/SVN)\nPlan and manage build release activities and coordinate across multi-site team\nGenerate and maintain software build procedure documentation\nWork closely with team to ensure build processes and configuration management (CM) best practices are followed\nRefine build and release processes as needed\nTracking of quality deliverables and static test reports QAC , UT closures\nDevelop installation scripts to automate the test cases.\nExperience with scripting languages (developing, debugging and maintaining).B.E / B.Tech in Electronics / EEE / E&C / Instrumentation / Computer Science4 to 7 yrsAbility to read and troubleshoot application source code\nMinimum 5 years of experience in Embedded C, Integration activities\nSolid understanding of CM best practices and tools  ( Jenkins/SVN)\nUnderstanding of source control, branching and merge strategies.  Experience with Jenkins/SVN\nExperience with build automation\nBasic knowledge of AUTOSAR , ASPICE ,MISRA standardsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Coimbatore, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}