{"Job ID": "69867479", "Description": "Good Experience on Oracle Service Bus and SOA Suite 11g and 12c.\nGood at Troubleshooting Application related issues quickly & providing resolutions.\nGood at installation, troubleshooting, performance tuning, code deployment, patching, and upgrades.\nGood at understanding the system requirements & prepare Interface specification documents.\nShould have worked on the design of SOA services/web services, SOAP, Rest Services, WSDL, XSD, XML, XPath, JSON, and XSLTs.\nProficiency in working on Unix and Linux platforms.\nExperience in designing SOAP and RESTFUL services.\nAbility to understand the end-to-end customer journey.\nShould have excellent written, communication & leadership skills.\nGood knowledge of SOA principles & architecture, SOA SUITE components like BPEL, BAM, ADAPTERS, etc\nIdentify the low-level development tasks and ensure correct implementation by the team by ensuring the right approaches, standards, and processes are followed.\nEnsure that based on the provided design specifications, the team develops web services, transformation mappings and integration flows correctly.\nDevelop detailed transformation rules using XSLT / XQuery / Custom code based mapping.\nProvide detailed documentation/annotations on WSDLs to describe the usage scenario.\nEnsure that design & code reviews and walkthroughs are conducted.\nResolve & guide the dev team on technical issues faced during design & development.\nHave a clear inclination towards automation of the design, development, test and deployment processes to enhance the rapid delivery of services.\nEnsure that existing coding guidelines, standards, and best practices are followed and applied by development teams.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}