{"Job ID": "69866579", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! SUMMARY:We are looking for enthusiastic innovators who are passionate about technology, fascinated by its unlimited possibilities and can join us in our journey to help every customer to become a best-run business. Join us in helping clients to reimagine their business and create new possibilities that allow them to dream bigger, work smarter and change their worlds using SAP Business Technology Platform.THE ROLE:Analyze, design and develop the cloud solutions using SAP BTP\nParticipate in solution/design of digital / cloud transformation\nEnable and guide customer in building digital experience and hyper-automation using SAP BTP\nSupport customers in their rapid and agile innovation\nAdapt to newer products and solutions gather expertise in the newer areas\nOpen to work on multiple topics and technologies with adequate enablement\nHave an urge to learn and experiment with new technologiesROLE REQUIREMENT:6-10 years of relevant experience in software development / technology consulting and at least 4 years of experience in software design/architecture in the areas listed belowPlatforms / Area: Business Technology Platform (BTP) / BTP ExtensionsProgramming Skills: SAPUI5, JavaScript, Cloud SDK (NodeJS / Java), OData, MDKMethodology: CAP and Cloud-native architecture principlesKnowledge in any of the below area would be an added advantageBuild Process Automation\nSAP Work Zone\nMDK / Angular / ReactMust have basic knowledge of S/4 HANA and LOB Solutions\nStrong analytical and problem-solving skillsEducationMasters or bachelor’s degree in Engineering or Tech from a premiere institute with excellent academic records or exceptional Technical skillsProfessional Training & CertificationPreferred any of these\nSAP Certified Development Associate - SAP Extension Suite\nSAP Certified Development Associate - SAP Fiori Application Developer#TechConsultantT2We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 372895  | Work Area: Consulting and Professional Services  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Gurgaon, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}