{"Job ID": "69869749", "Description": "Job Description:To drive the expansion and growth for SLC business in India with primary responsibility of Sales and Business development. To drive actively the company sales in business and mission critical communications in India. To manage and develop Integrator/partner network in India (Value Added Reseller (VAR) networkAccountable for overall SLC  Sales and Business development activities in IndiaExecute key growth sales strategic plan to achieve sales targets and expand the customer base\nDeliver the order intake contribution according to the operative planning (OP) for India.\nLead sales and pre sales efforts on selected key campaigns.\nReview and align sales strategy with Head of Sales.Maintain a qualified sales funnel and accurately forecast order in-take and revenues, including filtering information to predict success in this area.Maintain a competitive edge, obtain competitor information and share this promptly within SLC marketing and product portfolio strategic group.\nMaintain customers’ satisfaction. Assist finance in obtaining full and timely payment from customers where necessary. Act according to /Airbus ethic and compliance policy.Lead sales and pre sales effort on selected campaigns including notably:\ndefinition of the sales strategy and the capture plan;\ncoordination of the commercial actions and submission of the offer prepared by the bid team;\ndelivery of the best commercial proposal according to the internal SLC rules;\nnegotiation with the customer;\nClosing.\nDrive business growth and expand SLC market penetration by fostering new business models and product innovations.\nDevelop business with public safety organizations, for critical national infrastructures, with transport companies, industries, utilities and MNOs.\nReinforce SLC commercial position by supporting relevant strategic partnerships.\nMaintain a qualified sales funnel.\nGet a deep knowledge of customer’s environment, detecting needs regarding SLC products, services and solutions.\nRespond to customers’ needs with Airbus SLC solutions.\nElaborate with the Head of Sales Operating Plan and Sales Forecasts.\nComply with Airbus SLC and AIRBUS India management policies,\nAdhere to Airbus India  management handbook,\ncontribute to a positive and inspiring work environment,\nStay well informed and familiar with the latest developments\nPersonal & Interpersonal Skills\n\nleadership skills\nHigh motivation for new business development.\nco-ordination and communication skills.\nAbility in problem-solving\nAvailability to travel in the extended region\nProfessional Skills:\n\nWell experienced within the Microsoft office programs, Ability to work in an international environment etc.\n\n+ 5 years Telecommunications/ Critical systems working experience and working in environment requiring engagement and/or promoting to MNO’s and preferable also public safety and/or large business critical customers (TUI). Experience in ICT industry evolution to Cloud is a major advantage. Experience in (professional) account management and service business is equally a significant advantage.This job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth.Company:Employment Type:-------Experience Level:Job Family:By submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus.\nAirbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief.Airbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com.At Airbus, we support you to work, connect and collaborate more easily and flexibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}