{"Job ID": "69866453", "Description": "Job Description:Undertakes the service management activities and minor enhancement involved in the ongoing delivery of Application Management . Provides application lifecycle technical expertise for the support, monitoring, troubleshooting, change and enhancement of packaged (e.g. SAP, Oracle) or custom applications (e.g. Java, .NET and Mainframe) in accordance with contractual terms and conditions and established technical standards such as CMMI and ISO. Provides technical input, and delivery model solutions/recommendations to Application Management Services deal pursuit. Engages in and provides support for transition/transformation efforts. Undertakes the full range of Service Management functions required to ensure service delivery compliance to budget, quality standards and committed service levels on an on-going basis following operational policies and processes that are compliant with industry standards, such as ISO, and best practices such as Information Technology Infrastructure Library (ITIL). Manages the technical/service relationships: between the company and the customer, between the company and subcontractors/vendors, or among various company internal organizations. Works with the key customers, and/or internal businesses/end user representatives (e.g., Account Executive and the Account Delivery Manager) to retain customers and build the business. The company Application Management employees are supported by Service Desk function when they work directly with application end-users on application incidents. Provides input to and/or manages service improvement programs regarding customer satisfaction and service delivery. Employees using this job family should be working in Applications Management not ITO or hardware support.Responsibilities:Technical Knowledge: Apply deep and broad technical background and knowledge of industry trends to operate critical or high-risk technology areas/customer groups. Integrate technical knowledge and business understanding to create superior solutions for the company and for customers. Mentor/consult with team members, other organizations, customers, and vendors on the most complex issues.\nIncident Management: Resolve technical and business incidents independently coordinating multiple delivery organizations and other company groups.\nEscalation Management: Identify, manage, and lead escalations through L5.\nProblem Management: Proactively and reactively look for solutions to prevent the most complex problems from occurring across teams/applicationstechnologies.\nChange Management: Independently review and verify changes/solutions of high complexity and risk to meet customer needs. Lead or participate in a Change Advisory Board or Technical Advisory Board.\nConfiguration Management: Oversee configuration management processes, resolve issues, and design configuration management solutions.\nSolution Design: When justified by business needs, customize or create the company solutions to meet highly complex customer needs across technology areas. Provide feedback to create new company solution sets. The solutions include new service delivery models and quality management frameworks for new services/customers.\nQuality: Provide feedback/influence change in internal and/or vendor provided products/service offerings.\nProject Management: Participate, propose, and/or lead exceptionally complex customer and internal projects, including transformation, across technology customers and/or internal businesses/end user's areas. Mentor/provide review/advice to other projects inside/outside responsibility areas.\nCustomer Relationship Management: Analyze customers and/or internal businesses/end users' business, organization, and information systems needs to construct, sell, and deliver service solution offerings to satisfy those needs based on the company's Services portfolio. Deliver presentations/workshops to executive level clients on technical solutions to business needs. Work with customer user base to maximize the use of applications to solve business problems. Seen by customers or internal businesses/end users as a trusted advisor.\nTeamwork: Lead or work as part of a team, which may be virtual, global, and/or multifunctional, and addressing highly complex issues. Trusted advisor inside and outside team/technology area and across different polices/standards/delivery models.\nContract Knowledge: Provides guidance to others to meet contract obligations, contributes to proposals, evaluates proposal risks. Contributes industry or technology standards.Mentor less-experienced team members on all areas of Applications Management work.\nCapacity and Performance Advises on the capacity requirements of new standard services in relation to obtaining the proper cost and quality balance.\nBusiness Continuity Develop and manage the Application Service continuity management plan to ensure that, at all times, the recovery objectives of the business can be achieved.Education and Experience Required:Bachelor's degree in Computer Science, IT Service Management, Engineering, Business, or related field or equivalent work experience.\nMay have Master's degree in related field. Often holds advanced-level certifications in work field.\nTypically 10+ years of relevant experience .Knowledge and Skills:\nTypical skills include:(Master) in one or more technology areas.\nITIL Expert Certified Expert knowledge of ISO20000.\n(strong+) understanding of related technologies.\n(strong) Customer Service General Project Management.\n(strong) Influencing Others.\n(strong) Customer/Vendor Management.\nBusiness Analysis.\nGeneral Financial Management.\nExcellent client-facing interpersonal skills. Able to lead Applications Management delivery.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}