{"Job ID": "69866558", "Description": "Job title: Professional Sales Manager (Oral Healthcare) Develop, maintain and drive continuous improvement of the relations with existing and potential B2B customers (indirect business channel) in Middle East for Philips Oral healthcare portfolio (Zoom & Sonicare).Your role:\n• Initializing customer tailored sales actions and supporting sales actions.• Being part of Sales Team closely collaborate with Marketing, Pricing, Finance and Supply Chain teams\n• End to end sales and account management opportunity in assigned accounts. We are working in a Hybrid model.\n•A career at Philips comes with all sorts of wonderful benefits. Be sure to speak to your recruiter about benefits in your region.\n You're the right fit if:1. Minimum 7-8 years of Sales/Account Management experience in FMCG/Consumer Health/OTC categories; Oral Healthcare related experience would be a great asset,2. Excellent communication skills & high ownership to drive the business,3. Bachelor’s degree,\n4. Fluency in English is a must and additional Arabic is highly preferred,5. Willing and able to travel.About Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.#LI-EU#LI-HYBRIDJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Sales Outsourcing", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}