{
    "Job ID": "69866616",
    "Description": "IntroductionA career in IBM Consulting embraces long-term relationships and close collaboration with clients across the globe.\nYou’ll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio, including IBM Software and Red Hat.\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you’ll be supported by mentors and coaches who will encourage you to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in groundbreaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and learning opportunities in an environment that embraces your unique skills and experience.\n\nYour Role and Responsibilities\nAs a consultant you will serve as a client-facing practitioner who leads and implements expert services utilizing the breadth of IBM’s offerings and technologies. A successful Consultant is regarded by clients as a trusted business advisor who collaborates to provide innovative solutions used to solve the most challenging business problems.\nYou will work on projects that help clients integrate strategy, process, technology, and information to increase effectiveness, reduce costs and improve profit and shareholder value. You can take advantage of opportunities to master new skills, work across different disciplines, move into new challenges and develop a robust understanding of different industries.Your primary responsibilities include:Manage and engineer Quality for S/4 HANA implementation or upgrade or conversion programs.\nDesign/Create and Implement Test strategies for large SAP programs (Implementation, Upgrade and S/4 Transformation).\nCreate test plan and procedures.\nTest Coordination and manage multiple test cycles.\nDrive end to end Integration testing.\nCoordinate the development of test assets (manual / automated).\nDefect Management.\nDevelop and implement a strong Test Automation Strategy.\nCoordinate with multiple internal and external stakeholders including the customer and their application vendors for seamless business process quality engineering.Required Technical and Professional ExpertiseSelf-driven individual with a sense of accountability and ownership of program quality.\nGood working knowledge of automation tools like WorkSoft or TOSCA.\nThorough knowledge of creating test plans, coordinating, and managing test processes and testing of end user applications.\nExperience with working in a multi-location / international company. Excellent communication skills, Flexible, dynamic personality who works well partnering/collaborating in a matrixed team environment.\nDemonstrated experience and ability to deliver results on multiple projects in a fast-paced, agile environment.Preferred Technical and Professional ExpertiseOverall, 12-25 years of experience with a relevant of 7-8 years of work experience in SAP programs (Implementation, Upgrade and S/4 Transformation).\nExperience in an SAP Test Management for at least 4 years.\nExperience in Test management tools like Microfocus ALM, ADO, QTEST, JIRA, etc.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}