{"Job ID": "69866822", "Description": "Job Requisition ID: 156505 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every dayOverview of the roleBe accountable for individual sales targets and provide Key Performance Indicators (KPI’s) and regular feedback to management to ensure that the store sales targets are achieved. Furthermore offer a highly efficient, courteous and accurate service of home planning for furniture and furnishings and recommend co-ordination to customers that require assistance for small businesses or homes. Safeguard that cash is dealt with solely and that only customers needing assistance with the planning of their home or business are scheduled for consultations.What you will doOperationalPlan meetings with customers according to the scheduled work load convenient to both the co-worker and customer in order to guarantee proper planning.\nEnsure that an updated list of stock levels is available, so that customers aretold of any problems with the choice of their furniture and furnishings and recommend solutions based on stock availability.Maintain accurate and up to date knowledge of the different style groups available as to ascertain that customers are given well planned home furniture and furnishing solutions, in line with the commercial priorities within the store and moreover make sure that customers’ requests are understood and fulfilled\nProvide regular feedback to the Sales Manager – Furniture/ Market hall of any irregular orders required and give feedback of any regular out of stock articles, so that the range department can rectify these deficiencies.CustomersEnsure that customers’ orders are co-coordinated with in-store logistics to avoid that stock levels are interfered with for other store customers.\nProvide friendly and professional service to all customers that require assistance and follow through with any queries and questions that are required to achieve efficient and excellent customer service.\nContact the customers after the completion of delivery and assembly and ICSS result rectify any complaints immediately to project commendable customer support.CommercialMeet pre-set sales targets and communicate constantly to the management opportunities on how to achieve optimal sales, which will also help to improve efficiency of the home planning.\nBe constantly aware of the department sales, individual sales and the store sales targets, so that corrective action can be taken to achieve these targets.\nInitiate sales steering with the view of improving the margins and reducing the level of outgoing articles.\nProvide weekly and monthly KPI’s to enable the department to achieve improvements and required results throughout the year and in line with that to guarantee complete customer service and repeat business.\nHave a very strong level of communication with the line managers, in-store logistics co-workers, specialist sales executives (sales seniors) and the customer service department to ensure relevant information is passed on to the concerned people.\nSchedule convenient delivery and assembly times with the customer and customer service department and update these departments with any changes or potential requirements to enable the business to function as efficiently as possible.\nCommunicate with the contract sales department should a query for their services be requested, and this must also be followed in the case of faxes, Emails, and telephone calls. etc. to avoid losing any business opportunities.Required Skills to be successfulAdvance system proficiency, MS Office, Excel; SAP experience is additional advantage\nProven analytical, tracking & reporting skills\nAdvanced in Excel desired\nAbility to work in a matrix environment with multiple business functions\nStrong team player and ability to work with the cross functional partners and a go getter with the extra-mile approachWhat equips you for the roleA Bachelor’s Degree minimum required\n5+ years’ experience in Home or DIY retail merchandise, financial, demand & supply planningWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.\nAdditional Internal Information:• Reports to: Contract Sales Manager \n• Band: ENote:-You must have been an Al-Futtaim employee for at least 18 months in order to be considered.\nYou must inform your HRBP in confidence of your application.\nPlease note that this vacancy may be advertised externally in the next week so apply without delay.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}