{
    "Job ID": "69867480",
    "Description": "Why BirdEye?Once upon a time, local businesses could attract customers through advertising and word of mouth. However, that has all changed. Today consumers choose where to spend their money based on online reputation and digital experiences. Modern companies must deliver exceptional experiences that create repeat customers and need a platform that can do this at scale. Local businesses often need help to overcome the complexity and inefficiencies of using multiple applications to manage and optimize their marketing and customer experience operations. Their use of fragmented point solutions keeps them from achieving true customer insights and acting upon them in real time.This is the challenge that Birdeye solves with its all-in-one reputation and customer experience platform. More than 100,000 local businesses and brands use Birdeye to be found online through local listings and reviews; engage with consumers through webchat, text, and social media messaging; collect digital payments; and gain insights to improve customer experience with survey, ticketing and benchmarking tools.Birdeye is the leading all-in-one platform trusted by over 100,000 businesses of all sizes to manage online reputation, connect with customers, and generate insights. Founded in 2012 by Naveen (the 2021 EY Entrepreneur of the Year) and Neeraj Gupta, Birdeye is based in Palo Alto, CA, and backed by investors Marc Benioff, Jerry Yang, and Accel-KKR. Learn more at birdeye.com.Are you the kind of person that can take a big idea and bring it to life? Are you an experienced, passionate pioneer in technology - a solutions builder, a roll-up-your-sleeves technologist who wants a collaborative environment, the ability to work with all functions of the business, serving various in demand roles that all surround data? If so, consider an opportunity with Birdeye!Who you are:The ideal candidate will have a strong understanding of Salesforce and how it can be used to maximize operational efficiency and improve customer experience\nThe successful candidate should have a minimum of 4 years of experience in Salesforce, have strong knowledge of Salesforce’s configuration, customization, and integration capabilities, and have a thorough understanding of the Salesforce platform and its data model\nAdditionally, they should be comfortable working closely with stakeholders to help drive business objectives and have a demonstrated ability to troubleshoot and solve complex problems\nThe ideal candidate should have excellent communication skills and be comfortable working in a fast-paced environmentWhat You'll Do:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}