{"Job ID": "69868168", "Description": "Business: Global Finance AssuranceOpen positions: 1Role Title: AVP Assurance, GSC’sGlobal Career Band: 5Location (Country / City ): GurugramRecruiter Name :Madhura GupteWhy join us?Assurance performs independent review and evaluation of end to end processes, risks and Key control environmentsThe Opportunity:This role is a middle management position in Global Finance Operations Centre (GFOC) responsible for managing plus strengthening the Risk and Control Environment. Individual will be part of second Line of Defense and responsible for regular assurance monitoring and governance\nThe overall objective is to create an environment where there are minimum or no surprises, enhanced awareness amongst employees, timely escalations, and strict monitoring.\nThe role’s critical success factors include managing relations within GFOC and the larger HSBC Finance community; ability to work across teams/ sites/ time zones, influencing business outcomes.\nThe role is location agnosticWhat you’ll do:Risk Management & Operational EffectivenessManaging the overall control environment in GFOC and creating awareness across teams and levels with a view to manage operational incidents and ensure compliance with Global standards\nFacilitate and evaluate the risk and control assessment for the processes at GFOC to ensure that risks and underline controls are adequately identified and assessed\nEnsure adequate governance through risk committees and dashboards to highlight the status of risk and control environment\nPerform management and thematic reviews for the high risk processes and socialize themes emerging from the reviews to prevent recurrence\nRecording, tracking and assurance around Management self-identified issues to ensure compliance with internal audit criteria’s\nLiaise with internal/external auditors and ensure audit preparedness of operation teams. Also, track and provide issue assurance for audit findings\nWork closely with regional control teams and global control office to manage the risks in the end to end processes\nEnsure adequacy of framework around SOX controls which would include inventorisation, training and monitoring\nBuilding and managing relationship with the stakeholders AssuranceStrong Knowledge on SOX 404 Internal Controls, COSO Frame work and Guidelines.\nAbility to interact with the Global Business and Process Owners to review the Process and Internal controls associated with the Business.\nConduct Walkthrough Meetings with Process Owners, along with In-country controls Team & PWC Auditors.\nStrong Knowledge in Business Functions for the various Business Areas in HSBC.\nAbility to understand the Process, Polices & Procedures to Assess the Effectiveness of SOX controls.\nAdhere to the ICMP (Internal Controls Monitoring Plan) and work closely with the In country Controls Team.\nUnderstanding various Systems and their Functionality which are used by the Business Areas and are Under Scope of SOX Controls.\nPreparation of critical Month end deliverables, SOX testing and highlighting of issues to business partner / management. Customers / StakeholdersMaintain key stakeholder relationships to enhance awareness of operational risk including its identification, assessment, mitigation and control.\nTo support and ensure that local management fully considers and effectively manages operational risk in accordance with established policies and procedures.Leadership & TeamworkActively engage in establishing a strong control environment at GFOC\nBe a good team player\nSelf-driven and motivated\nAbility to deal with senior managementJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}