{
    "Job ID": "69866832",
    "Description": "DescriptionProject Control Manager - TSSGrade: GG12Location: Dhahran, Saudi ArabiaJOB PURPOSEBAE Systems is the UK Government’s nominated Prime Contractor under the Government-to-Government arrangements that are in place to provide equipment, support and training to Saudi Arabia. We provide maintenance of Royal Saudi Air Force aircraft and train RSAF personnel safely in a training environment in how to use their aircraft, equipment and weapons.BAE Systems Saudi Arabia is committed to supporting the Saudi Arabian National Agenda including Saudisation and the training and development of Saudi National capability through the growth of the Saudi National Partner Companies thereby reinforcing Industrialisation and Partnerships.An exciting opportunity has arisen to join the Tornado Support Service (TSS) Programme. The successful individual will be part of an interesting journey where the programme is transitioning to a new a performance based contract where there will be new principles with the application of the Control Account Management.Working across the Project Teams will offers a challenging and rewarding opportunity to contribute to the development and growth of Project Management Capabilities within TSS Programme in Riyadh, Dhahran and UK.JOB ACCOUNTABILITIESThe Project Control Manager is responsible to the Head of Business Operations – TSS for defining, planning, managing, integrating and delivering the TSS Services contractual obligations and performance to meet both customer and business requirements.The Job Holder will be responsible for the project management and integration aspects of the TSS Services - delivered to cost, time and quality.The key aspect of this role will focus on the project management and integration of the TSS Services, operating closely with and providing expert leadership to other functional areas to ensure that the total capability delivered is fit for purpose. The single most important requirement is to define and maintain a clear and structured project management framework for the successful delivery of the TSS Services to meet the RSAF fleet operation and intermediate maintenance requirements.This role is delivered as an individual contributor with subject matter expertise in a key PM discipline.The Job Holder will ensure that all aspects of the project are fully defined and integrated to ensure customer requirements are achieved in accordance with all business and commercial criteria, as well as company policies and procedures. In doing so the Job Holder will develop and maintain project plans and budgets which will deliver to customer and business needs, ensuring that these plans are consistent with overall programme needs, and that specific deadlines and milestones are agreed and communicated to all parties involved.The Job Holder will manage, control and monitor the project so that it is delivered to agreed time, cost and quality requirements, regularly reviewing and reporting on progress against plan and, where necessary, intervening to resolve issues which threaten delivery to plan. To achieve this it will be necessary to ensure that the project adheres to all policies and procedures and that they are carried out in such a way as to minimise risk and maximise opportunities.The Job Holder will need to manage the project to ensure that the project achieves all its objectives especially assigned relationships with major suppliers and sub-contractors to ensure all contracts are delivered and that issues are effectively addressed. To undertake this role, the PCM will need to ensure the project team possesses the required resources and capabilities to effectively deliver the project in line with all requirements and that staff are led, developed and motivated to ensure they are aware of and capable of meeting their accountabilities. To fully achieve this there will be a need to liaise with all functions relevant to the delivery of assigned projects to build an integrated project team and to enable the achievement of project objectivesThe role requires the application of Project Management skills covering the entire project lifecycle. The position is to lead the project by ensuring the technical support through direct and indirect management of the team (both in the UK and KSA) in the delivery of solution. In the Prime Contractor ship role, a significant aspect of the job will be the management of interfaces between several sub-contractors with the added complexity of significant In Country Industrial Participation and Saudisation. It is intended to continue the transition of the team from European Expatriate positions to Saudi Nationals as the project progresses however, this is a project which requires a high level of skill and knowledge of Military Aircraft Support Solutions. Nevertheless it is proposed to have a Saudi National as the Project Manager who will be guided, developed and exposed to the rigours of project management on a complex project.The Project Control Manager is responsible to the Head of Business Operations – TSS to monitor and control TSS Control Accounts managed by the TSS CAM teams at Dhahran to ensure the contracted services are safely and sustainably delivered within the approved budget.The Job Holder will be responsible for developing and implementing the project control management aspects of the TSS Services at Dhahran which fits into the overall Programme, Risk & Opportunity Management system.The key aspect of this role will focus on the project control management of the TSS Services Control Accounts within Tech Ops at Dhahran, operating closely with and providing project management leadership to other functional areas to ensure that the total capability delivered is fit for purpose and aligns with customer requirements. The single most important requirement is to define and maintain a clear and structured project control management process within the teams for the successful delivery of the TSS Services contractual obligations. In doing so, the PCM will develop a clear Cost control and risk / opportunity management processes to insure all unforeseen events and forecasted scenarios are captured as part of the Control Account Management process.The Job holder will be responsible to liaise with all functional areas to provide project control support and to manage the inputs in senior performance reviews.The Job Holder will control and monitor the project so that it is delivered to agreed time, cost and quality requirements, regularly reviewing and reporting on progress against plan and, where necessary, intervening to resolve issues which threaten delivery to plan. To achieve this it will be necessary to ensure that the project adheres to all policies and procedures and that they are carried out in such a way as to minimise risk and maximise opportunities. In addition, generate a cost performance dashboard which tracks the overall deliverables and what is expected to be delivered.The Job Holder will need to ensure that the project achieves all its objectives especially assigned relationships with major suppliers and sub-contractors to ensure all contracts are delivered and that issues are effectively addressed. To undertake this role, the PM will need to ensure the project team possesses the required resources and capabilities to effectively deliver and control the project in line with all requirements and that staff are led, developed and motivated to ensure they are aware of and capable of meeting their accountabilities. To fully achieve this there will be a need to liaise with all functions relevant to the delivery of assigned projects to build an integrated project team and to enable the achievement of project objectivesUnderstand the IBP and how this impact on business objectives across remits.Executive level engagement with Customer and other stakeholders as appropriate with a view to understanding and exceeding requirements and expected levels of service.Understand the BAE Systems organisation taking full accountability for remit and operating with the requirements of the wider organisation at heart.The Job Holder is responsible for the subcontract management activities for his scope of work as well as the performance reporting in accordance with TSS KPI arrangements.The Job Holder will be responsible for developing and implementing the project control management aspects of the TSS at Dhahran which fits into the overall Programme, Risk & Opportunity Management system.The Job holder will be responsible to liaise with all functional areas to provide project control support and to manage the inputs in senior performance reviews.RECRUITMENT SPECIFICATIONKnowledge and experience of undertaking and delivering business within a Defence contracting or military service environment in KSA or the Middle East.Experience in project management within the industry/sector knowledge; leading significant and diverse projects, with an understanding of all parts of the business lifecycle.Experience of managing Customers, Contractors, Vendors, and teams in the delivery of complex project requirements to cost, schedule and quality.Extensive experience in Project, Programme, or Portfolio Management in a relevant sector.Extensive support industry/sector knowledge (leading significant and diverse military support management projects and teams from a senior position with an understanding of the business lifecycle, in particular, the in-service support phase.Experience of Service Delivery in a military aviation environment and management at a senior level including associated governance requirements.Experience in a management team in a large multi-national complex programme.Understanding of RSAF operational doctrine at operating base locations.Experience across the project lifecycle including, where possible, familiarity with Life Cycle Management.Experience in the delivery of integrated solutions including engineering, maintenance, training, logistics and operational business support.Proven oral and written communications and familiar with the MS Office suite of administrative applications.Recognized ability to deliver against commitments and meet the expectations of customer and business alike.Experience of the development and application of project management processes including, organizational design, information management, Risk and Opportunity management and functional governance.Qualified knowledge of resource management, Risk aware and qualified in undertaking and supporting risk assessment.Qualified capability in managing complex project issues and customer and vendor relationships at all levels.Ability to oversee programme activities to ensure effective integration and cohesion.EXPATRIATE EMPLOYEE BENEFITSIn return for the required high levels of commitment and hard work you will receive a competitive salary, rent free accommodation and access to free recreation facilities, all available within Company secured accommodation. In addition, a generous leave and travel allowance makes this an opportunity not to be missed. On successfully securing a role your appointment to Saudi Arabia will initially be on single status. On commencement of employment in Saudi Arabia you will have the opportunity to apply to have your family join you in the future. A full health care scheme is provided within Saudi Arabia.SAUDI NATIONAL EMPLOYEE BENEFITSIn return for the required high levels of commitment and hard work you will receive a competitive salary and benefits package, including a generous leave and travel allowance, a full health care scheme and access to subsidised recreational facilitiesBAE SystemsAt BAE Systems, we provide some of the world’s most advanced, technology-led defence, aerospace and security solutions and employ a skilled workforce of some 82,500 people in over 40 countries. Working with customers and local partners, we develop, engineer, manufacture and support products and systems to deliver military capability, protect national security and people and keep critical information and infrastructure secure.All appointments in Saudi Arabia are subject to receipt of all necessary Government and/or Customer approvals.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Management Consulting",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}