{"Job ID": "69866398", "Description": "IntroductionYour Role and ResponsibilitiesWho you are:\nAs a Business Sales and Delivery Executive – Industrial Sector you will be responsible for:Sell and deliver position along with client ownership\nIn-depth understanding of the client’s business, goals, strategies and industry trends and directions.\nInteracting with the CxO level and building relationship with client accounts\nHave a good understanding of the Industrial Sector with extensive working experience in one of the Industries (Industrial Products i.e Manufacturing – Process / Discrete, Chemical & Petroleum, Real Estate and Infra companies, Electronics & Electricals)\nWorking with client to identify, qualify, create, shape and close the opportunity. He is providing delivery oversight, while delivery team delivers the contracts.\nThe lead sales person on all client engagements and is responsible for the overall sales effortsWhat you’ll do:\nThe Business Sales and Delivery Executive in this role will have the experience and knowledge to support both the sales of new business opportunities and the delivery of services to clients.\nYou would be working in Industrial Sector of IBM India i.e (Industrial Products i.e Manufacturing – Process / Discrete, Chemical & Petroleum, Real Estate and Infra companies, Electronics & Electricals)\nHe/she should understand large and complex services engagements in their area of expertise, including the appropriate methods and skills needed to solve business problems in the client’s industry.\nEstablish strong, trusted relationships with clients through their ability to articulate solutions, and other areas of IBM used in the delivery of complex services.\nIdentify new business opportunities, creatively participate in the development and sales of solutions, and assist IBM in winning the business.\nWhen not participating in sales activities such as new business development or bid and proposal activity, they support and lead billable client activities within their area of practice and participate in related Sector, Solution, or Community activities.\nAccountable for the financial success of engagements directly managed, as well as the generation of services revenue with the sales of new business.\nValue Proposition to customers at CXO (CFO, CMO, CIO & CEO) level to build deeper client relationship\nHow we’ll help you grow:He/she will develop the market along with a team of experts across multiple Service Lines and offerings that IBM has to offer to the market.\nYou’ll have access to all the technical and management training courses ought to become the guide you want to be.\nYou’ll learn directly from guide developers.\nYou have the opportunity to work in many different areas to resolve out what really excites you.Required Technical and Professional ExpertiseOver 14-16 years of working experience\nGood understanding of Enterprise Solutions (SAP / Oracle), CRM solutions (Sales Force), Adobe, cognitive technologies/AI/Advanced analytics/Big data/Automation/mobility/cloud/ Industry 4.0/ IOT/ AMS solutions\nStrategic account planning and execution skills.\nExperience selling to Industrial Sector clients\nMinimum 14-16 years sales experience in handling Enterprise customers\nPassion and dedication for customer success.\nAbility to sell both an application and deployment of a platform.\nStrong time management skills.\nShown ability for sales in emerging skills like Cloud, Security, Analytics\nAbility to maintain a high level of productivity, handle multiple contending priorities, and work effectively under the pressure of time constraints in a dynamic, complex, reciprocal, and team-oriented environment.\nShown consultative sales solution skills, including the ability to articulate a clear, concise return on investment value statement.Preferred Technical and Professional ExpertiseNoneJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}