{
    "Job ID": "69868176",
    "Description": "Job DescriptionAn exciting opportunity has arisen for Data Engineer to join Rolls-Royce. You would be employed directly by Rolls-Royce Data Labs but would be based in the Bengaluru, Karnataka office.Rolls-Royce is a world-leading provider of power systems and services, for use on land, at sea and in the air. We're proud to have a strong presence and an 80-year heritage in India and are excited about our growing future in Bengaluru. Through innovative solutions and diverse, globally renowned products, we've been focused on the growth of the aerospace sector in India. Powering more than 50% of Wide Body Aircraft to and from India, we are poised to become an engineering hub in the region and are committed to growing our local footprint for high-end technology.Rolls-Royce is one of the most technologically advanced organizations in the world - and our information systems are no exception. By improving information systems (applications and data) and technologies, we support overall business strategy and help teams throughout Rolls-Royce prepare for the future.Key AccountabilitiesSecuring the data supply chain, understanding how data is ingested from different sources and combined / transformed into a single data set.  Understanding how to analyse, cleanse, join and transform data.\nImplementing designed / specified solutions into the chosen platform (e.g. Azure Data Factories / Data Lakes, HDInsight, Talend, MuleSoft or traditional software).\nWorking with colleagues to ensure that the infrastructure available is capable of meeting the solution requirements.\nPlanning, designing and conducting tests of the implementations, correcting errors and re-testing to achieve an acceptable result.\nAppreciate how to manage the data including; security, archiving, structure and storage. Qualifications and Skills5+ years of experience at various levels of Software /Data Engineering roles\nExperience in designing solutions using databases and data storage technology such as RDBMS, NoSQL, MongoDB, Hadoop, Cassandra\nExperience building and optimizing Big Data data pipelines, architectures and data sets. Python experience is must.\nBe up to date with data processing technology / platforms such as Spark (Databricks, Hortonworks, and Cloudera etc.), PowerBI, and Tableau.\nExperience with ETL and/or data integration tools such as Informatica, SSIS, Talend, MuleSoft, Dell Boomi.\nWorked in Agile Methodology.We offer excellent development, a competitive salary and exceptional benefits. These include bonus, employee support assistance and employee discounts.Pioneer the performance of the future. Join us and you’ll develop your skills and expertise to the very highest levels, working in an international environment for a company known the world over for brilliance and innovation.Job CategoryPosting DateJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}