{"Job ID": "69867059", "Description": "Total Number of OpeningsResponsibilities:Conduct comprehensive analysis of financial data, including balance sheets, income statements, and cash flow statements.\nUtilize SAP (Systems, Applications, and Products) software to extract and analyze relevant data.\nCollaborate with stakeholders from various departments to gather requirements and understand business objectives.\nApply statistical and analytical techniques to interpret data, identify trends, and draw meaningful conclusions.\nDevelop and maintain financial models to support forecasting, budgeting, and scenario planning.\nPrepare reports, presentations, and visualizations to communicate findings and recommendations to senior management.\nStay updated with industry trends, market conditions, and regulatory changes that may impact decision-making processes.\nAnalyze and interpret financial data related to inventory management, with a specific emphasis on LIFO accounting principles.\nCollaborate with stakeholders to gather inventory-related information, including purchase records, sales data, and cost of goods sold (COGS) figures.\nEvaluate the financial impact of different inventory valuation methods, including LIFO, FIFO (First-In, First-Out), and weighted average cost.\nConduct scenario analysis to assess the effects of inventory cost fluctuations and provide recommendations on optimizing inventory management strategies.\nDevelop and maintain financial models to forecast inventory levels, assess inventory carrying costs, and support decision-making processes.\nPrepare comprehensive reports and presentations that communicate findings, insights, and recommendations to senior management.\nDevelop and maintain interactive and visually appealing BI reports and dashboards using industry-leading tools (e.g., Power BI).\nDesign and implement data models and visualizations that effectively communicate complex information to stakeholders.\nEnsure data accuracy, integrity, and consistency within the reports and dashboards.\nIdentify and track relevant KPIs and metrics to measure business performance.\nConduct ad-hoc analysis and deep dives into data to uncover insights and provide recommendations.Qualifications and Skills:Bachelor's degree in Business Administration, Finance, Accounting, Statistics, Business Analytics, or a related field. A master's degree , CMA or CPA is preferred.\nProven experience as a Decision Analyst, Business Analyst, or similar role.\nStrong proficiency in SAP software and advanced knowledge of accounting principles.\nSolid understanding of financial statements, balance sheets, and financial ratios.\nExcellent analytical and problem-solving skills, with the ability to think critically and make data-driven decisions.\nProficiency in statistical analysis tools and techniques.\nAdvanced Excel skills, including financial modeling and data manipulation.\nStrong communication and presentation skills, with the ability to convey complex information in a clear and concise manner.\nHigh attention to detail and accuracy.\nExperience with developing BI reports and dashboards using tools such as Tableau, Power BI, or QlikView.\nAbility to work collaboratively in a cross-functional team environment.Chevron participates in E-Verify in certain locations as required by law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}