{
    "Job ID": "69867907",
    "Description": "We go beyond the obvious, using intelligence, passion and creativity to inspire new thinking and shape the world we live in.To start a career that is out of the ordinary, please apply...Job DetailsKantar is the world’s leading data, insights and consulting company. We understand more about how people think, feel, shop, share, vote and view than anyone else. Combining our expertise in human understanding with advanced technologies. Kantar’s 30,000 people based in more than 100 countries help the world’s leading organisations succeed and grow. Nobody knows people better than Kantar. We provide insight and inspiration to help our clients, our people and society to create and flourish in an extraordinary world.Our insights colleagues are guides in human understanding. With expertise covering brand, innovation, creative, media, commerce and customer experience, they help clients define what brands should stand for, how to redefine and renew their offer, how to connect with audiences and how to win with consumers and customers.As a Senior Research Executive at Kantar, you’ll demonstrate our domain expertise to provide business insights that matter to clients. We are seeking someone to translate data into compelling stories, lead account project activities, and cultivate relationships with our clients through day-to-day interaction. This is an incredible opportunity to further develop your capabilities in research and position yourself for expanded career opportunities. You will join a team with a focus on specific expertise, and benefit from a local and international network of experts. You will work on various projects on track, in close partnership with other departments at Kantar.Tasks & responsibilitiesYou are the first point of contact for the client for your projects\nYou translate business issues into an appropriate research approach\nYou set up quantitative research with support from Kantar network resources\nYou monitor deadlines, project progress and you know how to respond flexibly to urgent requests\nYou analyze and interpret the research results and convert them into strategic advice\nYou present the results to the client and know how to make an impact with our insights\nYou keep an eye on the financial / commercial results of your projects and adjust them where necessary\nYou build a relationship with the client through daily interaction, and you are able to recognize opportunities where Kantar can further support the customerYour profileYou have an academic education degree, combined with at least 2 years of work experience in the field of market research (marketing insights)\nYou preferably have experience with branding, you are enthusiastic about brands and are interested in how they can further grow\nYou are adaptable, flexible, with a can-do attitude and a positive approach to your work\nYou display high accuracy, an attention to detail and good organizational skills\nYou enjoy presenting and discussing the results of your work and you are at ease in front of an audience\nYou like numbers and you are curious about their meaning.\nYou enjoy working with statistical analyses (such as modeling). You will focus on quantitative studies\nYou are fluent in EnglishWe offerA versatile job in an inspiring, international, and informal working environment at a leading organization, where you will work together with a team of enthusiastic colleagues on ambitious projects for some of the largest companies in the world.A lot of personal responsibility and space to develop own initiatives\nPlenty of opportunities to grow and develop yourself further\nAccess to the expertise and innovative tools of an international organization that knows everything about brands and how to make them stronger\nRegular fun activities where we gather with the teamWhy join Kantar?We go beyond the obvious, using intelligence, passion and creativity to inspire new thinking and shape the world we live in. We understand more about how people think, feel, shop, share, vote and view than anyone else. Combining our expertise in human understanding with advanced technologies, nobody knows people better than Kantar.And because we know people, we like to make sure our people are looked after as well. Equality of opportunity for our people are our highest priority, and we encourage our people to work in a way that supports their health and wellbeing. While we encourage our colleagues to spend part of their working week in the office, we understand no one size fits all, and we’re flexible in our approach to ensure people feel included and accepted.We’re committed to creating an inclusive culture and value the diversity of our people, clients, suppliers and communities, which is why we welcome applications from all background and sections of society. Even if you feel like you’re not a perfect fit, we’d love to receive your application and talk to you about this job or others at Kantar.LocationKantar Rewards StatementAt Kantar we have an integrated way of rewarding our people based around a simple, clear and consistent set of principles. Our approach helps to ensure we are market competitive and also to support a pay for performance culture, where your reward and career progression opportunities are linked to what you deliver.We go beyond the obvious, using intelligence, passion and creativity to inspire new thinking and shape the world we live in. Apply for a career that’s out of the ordinary and join us.We want to create an equality of opportunity in a fair and supportive working environment where people feel included, accepted and are allowed to flourish in a space where their mental health and well being is taken into consideration.We want to create a more diverse community to expand our talent pool, be locally representative, drive diversity of thinking and better commercial outcomes.Kantar is the world’s leading data, insights and consulting company. We understand more about how people think, feel, shop, share, vote and view than anyone else. Combining our expertise in human understanding with advanced technologies, Kantar’s 30,000 people help the world’s leading organisations succeed and grow.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}