{"Job ID": "69869124", "Description": "ABOUT STRAUMANNHeadquartered in Basel, Switzerland, the Straumann Group is a global market leader in the dental industry, with 10.300 employees globally. Our products, solutions and services are available in more than 100 countries through a broad network of distribution subsidiaries and partners, featuring the global brands Straumann, Neodent, ClearCorrect, and other fully or partly-owned partner companies.Main Tasks and ResponsibilitiesPlan and Manage logistics, warehouse, transportation and customer services.\nDirect, optimize and coordinate full order cycle.\nResolve any arising problems or complaints.\nComply with Jordan laws & regulations.\nPlan and monitor inbound and outgoing deliveries.\nFollow up the Regulatory Affairs activities.\nParticipate in the preparation of high-quality registration applications, registration, renewal dossiers and variations to be submitted to the Jordanian FDA.\nParticipate in finalizing the JFDA clearance of invoices & to follow up the release, also to prepare any import permit to JFDA in timely manner.\nParticipate in clearing the pending commitments related to invoices at JFDA.\nanswering calls, taking messages and handling correspondenceMaintain accurate records and reports\nOversee and support administrative functions\nCoordinate logistics for deliveries and shipments.\nMaintain digital and electronic records of employees.\nAssisting with day to day operations of the HR functions and duties.Education/Professional experienceBachelor’s degree in Business administration, logistics, supply chain, or relevant field.\n5+ years’ experience in an operations management/office management/ Logistics management role.\nExcellent verbal and written English communication skills.\nStrong analytical and problem-solving skills\nExcellent communication skills\nStrong working knowledge of general business software applications\nExperience in working within an international organization.Personal AttributesMature and grounded individual with high level of integrity, commitment, and ethics.\nPerformance-driven hands on professional with entrepreneurial spirit and strong execution abilities in times of change.\nresults in a pragmatic way with a solution-oriented focus with a learner mindset.\nOpen to feedback, positive and willing to learn from various experiences and respectful to others.\nA team player who listens to others and objectively considers others’ ideas and opinions, even when they are in conflict with one’s own.\nEnthusiastic about providing excellent support & service. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or disability.Employment Type: Full Time Alternative Locations: Jordan : Amman Travel Percentage: 0 - 10% Requisition ID: 10396Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Amman, Jordan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}