{"Job ID": "69861205", "Description": "Job NameCountry:City:Function:Reporting Line:Job type:Lead recruiter:About the roleYour OpportunityAbout YouResponsibilitiesWith our Consumer at the heart, your key focus will be to:Deliver on key financial targets (NSV, Gross Margin, Overheads, Profitability, ROI, Value Share)\nDeliver on Pictures of Success targets, complete survey, and work in partnership with customers / distributor to deliver excellence in execution \nDevelop and manage the sales plan for your territory based on delivery of Commercial priorities and the Country Integrated Activity Plan (IAP)\nManage territory / channel / account performance on a monthly/quarterly basis, working with customers / distributor to ensure delivery of forecast and budget (volume / value / execution) in line with Bacardi Scorecard\nDeliver impact from customer and purchaser programs agreed in the Country IAP against KPIs and territory targets\nAct as the leading customer contact, building effective long-term relationships with customers / distributor \nProvide input to the Area Field Sales Managers on key channel, customer, and competitive activity\nCommunicate effectively with customers to seek inputs for product and service improvement and resolve day-to-day operational questions/issues\nManage price plans, discount plans and budgets Skills and ExperienceThe Skills & Experience needed to create your legacyChannel strategies leading to continuous brand-pack-channel mix optimization driving NSV and volumes\nCommercial experience preferably with a beverages / FMCG / alco – bev industry. Drinks and Lifestyle Category experience is an advantage\nWell-developed written and verbal communication skills\nEffective use of networking and leveraging the same with key customers and strong interpersonal skills\nStrong negotiation skills and first-hand on-premises sales experiencePersonal QualitiesYou are Pro-active, Goal-oriented, and Passionate about delivering results and constantly seek to improve\nYou love the consumer. You create strong positive first impressions and easily build those into great relationships with customers\nYou demonstrate resilience by overcoming challenges and staying calm under pressure\nYou demonstrate entrepreneurial thinking, looking for new ways to achieve better resultsOur cultureWe share the passion and entrepreneurial flair of our founder and are guided by our three culture pillars - Fearless, Family and Founders, they inspire our Primos to be the best they can be and drive us forward in all we do. But what does this mean?·Being Fearless; means adopting an agile mindset, being comfortable trying new things and taking risks. We are empowered to question, challenge and innovate.·Family; We treat each other, and our communities, like Family. Always.·Founders; The spirit of entrepreneurship is at the heart of everything we do. We see the business as if it’s our own. We do the right thing for the business and we all take accountability for our work.When you join Bacardi, you become part of our family and gain more than just a job.Disclaimer: Bacardi is an equal opportunity employer that values workforce diversity. Diversity is core to our business: by embedding diversity into all aspects of our culture, we maximize the opportunity to achieve sustainable business success and growth. The duties and responsibilities described in the role profile might not be a comprehensive list. U.S. applicants have rights under Federal Employment Laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}