{"Job ID": "69867219", "Description": "Associate Clinical Data ManagerSDC is a team of diversified professionals who deliver exceptional Biometric Services, Consulting, and Technology Solutions to pharmaceutical, biologic, and medical device/diagnostic companies. Since 2005 our purpose has been to partner with sponsors to provide high quality and experienced team members to develop great medicines that save lives and cure diseases in the most efficient manner possible. Our global team operates as a value partner to our clients by fulfilling their needs as our own and delivering exceptional results. We are a specialty CRO in that we provide scalable service offerings, focused services area specialists, efficient project timelines, optimal technology solutions, and proven success and experience. Our commitment to our clients is the same commitment to our employees. By offering strong benefits including competitive pay, generous time off, attainable career advances and positive work/life balance, we are able to attract some of the most talented people in the industry.Job SummaryParticipates in all data management activities in support of clinical and/or non-clinical research studies for study initiation, setup, maintenance, and closeout with supervision from their line manager or lead data manager. Works closely with Lead DM on multiple studies including study start-up and implementation activities such as User Acceptance Testing, Metrics Reporting, setting up data review reports, External Transfer specifications etc. Perform and/or coordinate review of clinical data, external vendor supplied clinical data, laboratory data, serious adverse event data reconciliation, query management.\n\nPrimary Responsibilities\n• Under supervision of Lead DM, perform study setup activities including CRF design, database structure design, annotation, document creation and/or approval, data entry screen design and testing, validation check testing and approval, etc.\n• Perform/Manage study conduct activities including listing reviews, query management, data transfers etc.\n• Perform study closeout activities leading towards database lock.\n• Serve as a backup resource to other Clinical Data Managers for issues pertaining to data management on multiple studies\n• Assist Clinical Data Managers or Project Managers with management of timelines and budgets as they pertaining to data management activities\n• Performs independent central data review in support of various risk-based monitoring solutions; reviews reports, graphs, visualizations, quality tolerances, listings, key performance indicators to ensure cross site excellence and risk mitigation.\n• Mentor all levels of Clinical Data Associates in their job responsibilities\n• Maintain quality control of the data, project deliverables and closeouts\n• Support and facilitate the review of medical coding for validity and completeness\n• Participate in internal and external team meetings, as necessary\n• Adhere to all aspects of the SDC’s quality system\n• Comply with SDC’s data integrity & business ethics requirements\n• Perform other related duties incidental to the work described herein\n• Adherence to all essential systems and processes that are required at SDC to maintain compliance to business and regulatory requirements\n• Track and maintain audit-ready clinical study documentation within the electronic Trial Master Files for multiple projects\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This document is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}