{
    "Job ID": "69869879",
    "Description": "About PayUPayU, a leading payment and Fintech company in 50+ high-growth markets throughout Asia, Central and Eastern Europe, Latin America, the Middle East and Africa, part of Prosus group, one of the largest technology investors in the world is redefining the way people buy and sell online for our+ merchants and millions of consumers. As a leading online payment service provider, we deploy more than 400 payment methods and PCI-certified platforms to process approximately 6 million payments every single day. Thinking of becoming a PayUneer and you are curious to know more about us? Read more about the life in PayU here Role:Location:Experience: 2+ Year (Must)About the Role:As a Backend Systems- Software Engineer you’re expected to support existing functionalities by addressing historical issues and contributing towards tech debt. You’re also expected to build out new features which are part of the Development Roadmap.About the team:PayU Finance is the credit and lending arm of the PayU brand (a wholly-owned subsidiary of the Prosus group. Previously Naspers group) headquartered in Amsterdam, Netherlands. PayU Finance India has disbursed about 20 billion loans to date by volume and has disbursed more than $280 million in consumer credit. PayU Finance provides consumers with easy access to affordable short-term loans up to INR 5 lacs that can be availed in the form of personal loans, point of sale EMI, and express loans.PayU Finance operates under two brands - LazyPay and PaySense with a focus on Buy now Pay later and personal loan products.Excited yet? Continue reading to find out more about the role:What you’ll be doing:Understand business requirements and identify the best approach to serve the requirement without risking the system's conceptual sanity.\nDrive Implementation approach discussions by taking complete ownership of partially defined problems.\nPractice TDD and help us retain/improve our code coverage.\nOptimise flows within systems for better performance in response times and memory consumption.\nTear down unused flows and concepts to make way for the new and evolved ones.What are we looking for?Someone with at least 2-3 years of experience building backend systems using any of the following languages: Java, Python.\nSomeone who takes ownership of delivery thereby not only closing your own work but also identifying dependencies and making sure they follow the track towards completion.\nSomeone who can work both independently and in collaboration with the team as and when the situation demands for it.\nSomeone who is not averse to learning and growth and has an open mind about inputs/suggestions from any stakeholder.Bonus point if you have:Experience in the Fintech domain and/ or B2C product experience.\nAn understanding of design principles and accepted software design practices.\nExperience building backend systems in Java+SpringBoot or Python+DJango.\nAn engineering degree in Computer Science.\nWorked on products with a massive user scale - 1 Mn+ DAUs especially.What we offerA positive, get-things-done workplace\nA dynamic, constantly evolving space (change is par for the course – important you are comfortable with this)\nAn inclusive environment that ensures we listen to a diverse range of voices when making decisions.\nAbility to learn cutting edge concepts and innovation in an agile start-up environment with a global scale\nAccess to 5000+ training courses accessible anytime/anywhere to support your growth and development (Corporate with top learning partners like Harvard, Coursera, Udacity)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}