{
    "Job ID": "69867330",
    "Description": "Senior Manager- IM-(2300017203)Job:Audit, Accounting & FinancePrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 7:55:31 AMUnposting Date:OngoingRole Responsibilities To be part of System management team supporting Book close and GP&A reporting for Group Management Reporting.StrategyManage process, communication & expectations around Service delivery, Data Quality & Change Management\nDrive, Lead or Contribute to certain key initiatives within the function\nLead information delivery functionBusinessResponsible for ensuring the expected system stability and data quality is maintained month on month while achieving certain improvements.\nEnsure producing appropriate metrics to govern system, data quality and change.\nFacilitate cross functional team discussions (internal / external) to resolve issues.\nFollow Issue Management tracking mechanism, namely, raising problem ticket, CR, logging into issue tracker, follow up for resolution etc.\nWork on strategic fixes for the issues by prioritising the Change BoW\nEnsure good understanding of function specific concepts and KPIs\nWork with Change Management Team in tracking / monitoring closure of issues\nImprove Operational Efficiency by improving process controls and increasing the level of end to end automation.\nProvide necessary support for a smooth Change rollout into BAU.\nParticipate in team engagement activitiesProcessesEnsure adherence to Maker / Checker control and minimize PASS 1 and PASS 2 errors\nEnsure minimal usage of EUCs; reduction of all macros used in the processes\nEnsure DOIs are maintained (that is, review and update as per agreed frequency); include what, why, and how of the processes; understanding of process on why it is being done and its importance as a part of the overall delivery of the service\nIdentify opportunities to remove process waste, engage in standardisation of various reporting packs and encourage, drive and support automation initiatives thereby reduce / remove the non-value adds in the process.\nEstablish robust control and governance on the process\nDrive productivity and achieve cost efficiencies through continuous improvement initiatives\nDrive a culture to capture appropriate metrics for tracking actual hours/ standard hours/ errors etc\nEnsure detailed documentation and it is up to date for all processesPeople & TalentEnsure mandatory learnings are completed on time\nEffective collaboration with team\nHandle people management activitiesRisk ManagementEnsure operations risks are highlighted in a timely manner at appropriate levels and devise an action item and implement the sameGovernanceEstablish robust control and governance on the processRegulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the [country / business unit / function/[team] to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.] \nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}