{"Job ID": "69867214", "Description": "Associate Director  - Sales Development Representative (Technology/Saas Sales)Backstory:2016: Raised Series A round funding from Exfinity Ventures and GrowX Ventures and launched our first two offerings: Route Planning and Control Tower (formerly Dispatch IQ and TrackIQ). \n2018: Achieved a landmark of 10 million successful customer orders.\n2020: Raised series B funding led by Falcon Edge and Tiger Global. Opened our first offices in North America and South East Asia.\n2021: Raised Series C funding of $50 million led by GIC and Qualcomm Ventures and got recognized twice in a row as the Representative Vendor in various Gartner® Market Guides.\n2022: Unveiled our real-world ready dispatch management platform, moving from product-based to platform-based offerings. Expanded our footprint to Mexico.Associate Director  - Sales Development RepresentativeJob Responsibilities:Lead, Manage and scale up the SDR team to achieve quarterly and annual pipeline generation and acceleration goals\n\nIdentify target accounts and prospects and qualify them\n\nAbility to frame opportunities with defined customer pain and use cases to enable high success rates;\n\nOwn all plans and strategies for developing lead pipeline, including but not limited to campaigns, calling outreach, Social outreach, etc.\n\nUnderstand nuances for different geographies and localise campaign and messages accordingly to achieve high engagement rate for the reach outs and campaigns\n\nMotivate and support the SDRs to exceed KPIs through coaching, out-of-the-box creativity, and data analysis.\n\nContinually work on optimising pipeline qualified lead and also accelerating opportunities towards wins\n\nWork closely with the sales and marketing teams to maximise pipeline creation.\n\nUnderstanding Locus’ product offering and use cases we solve for, and being able to translate these into \n\nDevelop and maintain SDR best practices, pitches, and objection handling;\n\nWork cooperatively across broader marketing team on account-based marketing programs, events and other initiatives to get into key accounts\n\nIdentifying new market segments for Locus                \n\nMultitasking across internal and external stakeholders to ensure synergies and seamless handover of a client from lead generation to contract closure stage\n\nRegular update of all client information on Salesforce CRM, and ensuring good Salesforce hygieneRequirements:Past enterprise SDR experience of 8-10 years with proven track record in Logistics/Supply Chain industry experience is a plus      \n\nAt least 5 years experience in leading SDR / Inside Sales team \n\nExperience in International/ Global markets preferred\n\nBackground in technology / SaaS sales                                           \n\nProficiency in English or Multilingual is a bonus                                         \n\nExcellent verbal and written communication abilities\n\nCustomer-First approach                                             \n\nSharp business acumen and target orientedJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}