{"Job ID": "69867178", "Description": "SummaryNeom is developing a 100% renewable power system by harnessing the power of wind and solar generation. Key to the cost effectiveness of the system will be to develop a smart and flexible energy system that encourages the active participation of all energy assets in balancing supply and demand.The ENOWA Flexibility team is tasked with planning, optimizing and executing a portfolio strategy to unlock system flexibility across 4 pillars (Demand Response of strategic reservoirs, Pumped Hydro Storage, novel Long Duration Energy Storage and Li-Ion Battery Energy Storage Systems-BESS)This role will lead the design, planning, development, contracting, construction, integration and commissioning of industrial and commercial scale projects of novel long duration energy storage technologies. You will also contribute to the localization and innovation requirements of NEOM by validating cost and value opportunities related to local manufacturing and technology roadmap to drive down the cost of promising technologies.Key Accountabilities and ResponsibilitiesPlanning and Design  Identify and evaluate all project opportunities for industrial scale LDES projects.\nOversee the site design of technology providers’ projects considering key NEOM aesthetic and land use considerations.\nKey interface to the energy modelling, grid planning and renewable generation activities on plant design, operations and technoeconomic characteristics of utility scale energy storage projects.\nCollaborate in developing NEOM’s technical and commercial requirements for utility scale LDES Project services - tenders, RFPs, RFQs and formal auctions for LDES storage PPA delivery\nDevelopment and Integration     •           New site and business case identification through to legally binding projects, to financial completion.\nAutonomously processing projects, thereby taking responsibility for quality, deadlines and budgeting\nKey interface to NEOM Master planning team for all utility scale LDES projects\nSecuring environmental, grid connection and land use permits for all relevant sites.\nBridging relationships with all relevant stakeholders – Oxagon, Consultants, Technology providers & other suppliers.\nIdentifying and mitigating any and all risks associated with the development journey to prepare projects for auction.\nMonitor and oversee project construction through to commissioning and commercial operationsPeople and Stakeholder ManagementBuild a team of subject matter experts that supports the implementations of advanced and world leading pilot projects while developing long term ENOWA strategic capabilities in the deployment of LDES technologies.\nLead in the negotiations and execution of all relevant contracts with OEMs, Integrators, EPCs and project suppliers\nDevelop tendering and go to market strategies with key stakeholders and suppliers.\nCollaborate with the Flexibility, Digital and Market operations teams to integrate BESS projects into the NEOM flexibility platform.\nAssess vendors of competing technologies and assist the director of flexibility with scenario analysis and board investment decisions.\nSupport in the establishment of a rigorous regulatory, codes and standards regime as well as the establishment of an enduring LDES scale-up hub.\nAttend conferences and support alignment with Neom and KSA authorities.\nSupport and contribute to senior management and executive discussions and decisions on energy storage.Background, SkillsTechnical skills:Proficient in mathematical modelling and understanding of algorithms pertinent to battery management systems\nUnderstanding of charging and discharging of the storage mechanisms and influence of factors (including operational, material, weather, electrical and chemical)\nEnergy and charge conservation principles and electrical network theory\nAbility to investigate commercial and technical feasibility including scalability, real-estate requirements and carbon footprint\nAbility to evaluate safety and sustainability credentials of energy storage projects\nAbility to estimate capital and operational expenditure (including the expected “remaining useful life” and replacement costs) of select systems\nUnderstanding of electro-mechanical enclosure, panel design and engineering including conceptualization, mechanical wiring, routing, interphases, thermal management, safety systems and labelling, support calculations, drafting (2d and 3d)\nFamiliarity with power systems engineering power electronics, batteries and its operations from a battery power standpoint\nExpertise in battery fire suppression systems and related safety standards\nExpertise in basic control and monitoring systemKnowledge and Experience:A strong track-record in the development of renewable energy projects.\nAn extensive network of OEM, integrators and EMS contacts\nFull project lifecycle exposure for utility scale storage in previous roles with references.\nCommercially astute when it comes to development challenges\nA keen interest in renewable energy & sustainability\nCompetent team player, but able to work autonomously where required.\n10+ years relevant energy industry experience.\nUnderstanding of the costs/benefit tradeoffs and techno-economic assessment for network asset investments (incl generation and storage)\nUnderstanding of electric utility frameworks for operations and underlying regulations.\nFamiliarity of Virtual Power Plant (VPP) principles and implementation capabilities\nFamiliarity with liberalized wholesale energy markets, trading and balancing markets.\nThorough understanding of decentralized energy technologies and other energy efficiency technologies and their potential commercialization in power markets.\nFamiliarity with the energy transition and opportunities for power grid transformationsOther Skills and Experience:Self-starter, entrepreneurial and with a delivery mindset\nAbility to bring innovative ideas from inception to actual implementation through clear value propositions and roadmaps.\nGood interpersonal, written and communication (English) skills.\nAbility to operate in a team-oriented and collaborative environment and flexible and resilient to changes due to the greenfield nature of the projects.\nAbility to manage multiple stakeholder needs and distill complexity to build consensus within a matrix organisation.\nAbility to operate in ambiguity and resilience to a dynamic fast changing environment.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}