{
    "Job ID": "69865823",
    "Description": "We are looking for aOrder Analyst Intern ( long-term )at Roche Diagnostics Turkiye for 6 months.Overview:  We are looking for an order analysis intern who will enter the system and analyze the progress payments from the institutions we work with, and who are responsible for the calculation of the order levels that should be accordingly. This role includes improving the quality of stock levels and reducing disposal levels in public hospitals.Responsibilities:Examines progress payment data from the institutions we work with\nEnables data to be combined appropriately\nIdentifies errors and inconsistencies in data and alerts relevant parties to correct them\nCollaborate with relevant teams to resolve issues and inconsistencies with data\nEnters data into the appropriate system\nAnalyzes the entered data and draws meaningful conclusions and reports\nCalculates appropriate order levels and stock levels\nConduct regular audits and reviews to maintain data integrityYou, as an ideal candidate, will have the following skills, experience and education:3rd or 4th grade student at university in Biology, Chemistry, Molecular Genetics, Biotechnology or Bioengineering, Industrial engineering\nFluent English skill\nShould be able to work 3 - 4 days a week remotely or in the office - for at least 6 months of period\nAdvanced skills on Microsoft Office tools (Excel, Word etc.)\nClinical studies and laboratory experience is a plusAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}