{
    "Job ID": "69865824",
    "Description": "IntroductionAt DuPont, we are working on things that matter, whether it’s providing clean water to more than a billion people on the planet, producing materials that are essential in everyday technology devices from smartphones to electric vehicles, or protecting workers in this global pandemic. If you would like to be a part of a premier multi-industrial company that is delivering sustainable solutions that bring real purpose and value, of a company with collaborative spirit because it believes that we work best when we work together as a team and values the diversity of thought, then DuPont is the company for you!WHY JOIN US?Our purpose is to empower the world with essential innovations to thrive. We work on things that matter! Get to know our Purpose and make it yours by bringing innovations to market that improve the world, share a commitment to sustainability that makes our planet better and give back to communities in which we work and live. Get to Experience a collaborative environment where teamwork is celebrated with flexibility that enhances balance and an inclusive atmosphere that is welcoming to all! Have the opportunity to chart your own course, challenge yourself, and acquire new capabilities to build a rewarding and fulfilling career. We reward employees with competitive pay and incentives to recognize skills, competencies, and contributions to business results.As a Specialist, you will have frequent communication with stakeholders, analyze and prepare monthly reports, application of deep accounting knowledge on Fixed assets management (Creation, retirements, sales, transfers, accelerated depreciation) and work with corporate team, local finance & controllers frequently as required.Job Description:Project creation & capitalization\nAsset creation, retirements, sales, transfers, accelerated depreciation\nMaintain fixed asset register in SAP & Creation of WBS elements and define settlement rules.\nDepreciation cycle run & Project settlements\nTransmission of Data into reporting ledger, monthly check & review of reporting data into consolidation tool\nForecast for OL & Share reports like asset listing, expected realizable value, retirements, CAPEX, Flux analysis\nProvide 10 K & 10 Q disclosure requirements, forecast Intangibles amortization.\nDepreciation areas – Local GAAP, Tax & US GAAP and special adjustment handling per statutory law compliances.\nIFRS, GAAP differences & accounting standard guidelines.\nSOX compliance, Internal controls & handle, support audit queries (external & internal) from PI perspective.\nTax reports per country specific requirements.\nBlackline reconciliations of PI with relevant substantiations & make sure no un-reconciled transactions exists for reporting.\nHandle ad-hoc requests & manage committed TAT.\nReadiness to pick up project assignments per requirement with timely actions & high quality.Mandatory: Skill Sets/Experience:M.com / MBA / ICWA inter/ /CA inter with 3-5 years full time experience of Fixed Asset accounting\nCMA/CA would be an added advantage\nSAP (FI) asset accounting experience & end user accounting knowledge.\nShould have working experience on Ms. Excel & Power point\nExcellent Verbal & Written Communication Skills\nStrong problem solving and analytical skills\nAccounting flow & trouble shoot experience in Asset accounting & R2R domain.\nWell versed with conference calls & timely e-mail action up.Desired to have:Macro set-up & Data analyze skills\nGood Multitasking, prioritization, time management skills\nAbility to work independently in complex, challenging, stressful environmentDuPont is an equal opportunity employer. Qualified applicants will be considered without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class. If you need a reasonable accommodation to search or apply for a position, please visit ourAccessibility Page for Contact Information.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}