{"Job ID": "69865896", "Description": "TasksVehicle Validation Test Engineer – Power Network ManagementMercedes-Benz Research and Development, India is seeking for a Senior Engineer with a strong technical background in Vehicle Validation of Electronic Control Units.Key Job Responsibilities:Technical:Requirement Analysis of different functions in Body Electronics\nDevelop test specifications, test scripts and test framework.\nTest case execution on dSPACE / Vector platforms.\nDevelopment/adaption of FUSA testcases.\nAssurance of sufficient test coverage within a given time schedule.\nAnalysis and debugging of reported failures with relevant stakeholders.\nMaximize Test Automation and reduce the time required for testing.\nCommissioning and setup of Test Environment for validation.\nDefinition of work packages for peers and externals with frequent interaction with system and component responsible from Germany/India.\nStakeholder management with business partners in Germany.\nFunctional integration and application of ECU components and software in the vehicle.\nSetting and releasing of vehicle coding.\nOrganize and participate in test drive (winter/summer).\nParticipation in SW release and testing on vehicle and providing confirmation.\nEnsure certification for the vehicle coding data.Basic Qualification:Bachelors or Master’s Degree in Electronics and Communication/Electrical and Electronics\n3-6 years of overall experience in Automotive domainKey Skills and Experience:Automotive domain knowledge – Body electronics/Powertrain/Safety systems: e.g., Door Control module, power windows, sunroof, Interior/ Exterior lighting, airbag, ESP, Powertrain etc. (at least one of the systems)\nExpertise in Dspace/Vector Simulators\nExpertise in any of the Scripting languages (CAPL, VB, Python)\nExpertise in Communication protocols like CAN, LIN, Flexray, Automotive Ethernet\nExpertise in Diagnostics testing: UDS.\nExperience in Automation of Test cases\nGood Analytical and problem-solving skills.\nMonitoring of the assigned tasks to team\nGood knowledge of Test management tools like DOORS, PREEVision, DOORS NG.\nExperience in Functional Testing of Power Network Management / Battery Management System / DCDC Converters would be an added advantage.Preferred Skills:Usage of Vector CAN tools - CANOE, CANape, VTestStudio\nUsage of PROVEtech, Control Desk and Configuration Desk\nUsage of Softing Tools – MONACO\nCAN, FLEXRAY, LIN and Ethernet protocol knowledge,\nUsage of DOORS, PREEVision\nGood communication skills and ability to work in & contribute as a good team player.\nExperience in the automotive field and exposure of multi-cultural environment is an added advantage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}