{"Job ID": "69869503", "Description": "We are looking for a dynamic Community Management Executive to join our company. In this role, you'll be in charge of communicating with customers via social media platforms representing our company.To ensure success as a Community Management Executive, you should know how to effectively use various social media platforms, tools, and technologies. Ultimately, an outstanding  Community Management Executive should be a goal-orientated individual with a solid understanding of the customer experience.ResponsibilitiesRespond to customers through all channels (twitter, Facebook, Instagram, LinkedIn, YouTube, google play and App store) in a timely manner. Make sure no comment is ignored/ not replied for more than 2 hours maximum on any channel.\nBuild out the brand's social voice to be leveraged across all communication channels to ensure channels feel like one cohesive voice, aligning with the social media guidelines.\nIdentify key active consumers to strategically execute surprise and delight opportunities\nKeep a track of consumers' repeated requests, that might be useful for adding new product features for example or create new kinds of posts/ content to cover their needs, and make sure to inform the relevant teams.\nDevelop a unique and engaging social voice and strategy and track performance and make recommendations of how to adjust voice and approach to achieve results.\nBe updated with all company products, new features and services, and be aware of ongoing social media campaigns and competitions.\nActively engage and keep the conversation going with existing or new potential customers.\nDevelop weekly and monthly reports on customer satisfaction, response time, escalation issues, etc.\nCoordinate with Marketing and social media team to ensure brand consistency\nForward and escalate customer feedback and ensure their needs are taken care of by the appropriate department.\nKeep a track of users' positive feedback, that could be used for social media posts.\nCommunicate any repetitive issue(s) that’s related to Wego directly or one of its partnersRequirements:Bachelor's degree in social media management, marketing, or a related field.\nMinimum of 2 years' experience as a social media representative, or a similar role.\nCustomer service experience.\nExcellent knowledge of social media best practices.\nAbility to effectively use a variety of social media platforms, such as Twitter, Facebook, Instagram, LinkedIn, and Google+.\nSolid customer service skills.\nGood communication and interpersonal skills.\nAbility to work independently in a fast-paced environment.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}