{"Job ID": "69867707", "Description": "BackgroundDiversity, Equity and Inclusion are core principles at UNDP:  we value diversity as an expression of the multiplicity of nations and cultures where we operate, we foster inclusion as a way of ensuring all personnel are empowered to contribute to our mission, and we ensure equity and fairness in all our actions. Taking a ‘leave no one behind’ approach to our diversity efforts means increasing representation of underserved populations. People who identify as belonging to marginalized or excluded populations are strongly encouraged to apply. Learn more about working at UNDP including our values andinspiring stories.UNDP does not tolerate sexual exploitation and abuse, any kind of harassment, including sexual harassment, and discrimination. All selected candidates will, therefore, undergo rigorous reference and background checks.UNDP has been working in India since 1951 in almost all areas of human development. Together with the Government of India and development partners, we have worked towards eradicating poverty, reducing inequalities, strengthening local governance, enhancing community resilience, protecting the environment, supporting policy initiatives and institutional reforms, and accelerating sustainable development for all. With projects and programmes in every state and union territory in India, UNDP works with national and subnational government, and diverse development actors to deliver people-centric results, particularly for the most vulnerable and marginalized communities. As the integrator for collective action on the Sustainable Development Goals (SDGs) within the UN system, we are committed to supporting the Government of India’s national development vision and priorities and accelerating the achievement of the SDGs for the people and the planet. UNDP India’s current Country Programme, 2018-2022, is in its final year of implementation. Our new Country Programme (2023-2027), which comes into effect in 2023, builds on our prior work and aims to provide an integrated approach to development solutions in three strategic portfolios:  Strong, accountable and evidence-led institutions for accelerated achievement of the SDGs\nEnhanced economic opportunities and social protection to reduce inequality, with a focus on the marginalized.\nClimate-smart solutions, sustainable ecosystems and resilient development for reduced vulnerabilitySouth-South cooperation, gender equality and social inclusion are promoted across the pillars. The programme is supported by a framework of renewed partnerships and blended finance solutions, strategic innovation and accelerator labs, and data and digital architecture.You are invited to join a team of future-smart development professionals to support India in achieving the national and globally agreed goals. As part of the UNDP team, your focus will be to work with diverse stakeholders to find country-specific solutions that lead to sustainable development and reach those furthest behind first.Indian agricultural producers make a critical economic contribution to the country but face a number of challenges in securing household income and ensuring food security. A key challenge comprises crop failures and yield losses, triggered by the vagaries of climate. These put at risk the livelihood of a large proportion of India’s population viz. 138 million farm families, constituting the largest private enterprise and contributing more than 18% contribution to national GDP. Agricultural production shocks have huge social and financial repercussions, impacting rural income levels, Gross Domestic Product (GDP) and poverty rates.The Government of India’s flagship scheme Pradhan Mantri Fasal Bima Yojana (PMFBY) compensates farmers for crop losses.  The scheme insures farmers against a wide range of external risks — droughts, dry spells, floods, inundation, pests and diseases, landslides, natural fire and lightning, hailstorms, cyclones, typhoons, tempests, hurricanes, and tornadoes.  While insuring farmers against crop losses is not a new initiative, the PMFBY constitutes a serious attempt to plug gaps identified in earlier crop insurance schemes viz. the National Agriculture Insurance Scheme (NAIS) introduced in 1999 and the Modified NAIS (mNAIS) introduced in 2011.UNDP’s Country Programme Document (2018-2022) approved by the Government of India defines “Institutional and Systems Strengthening for Service Delivery” to be one of its foremost programme priorities and the single most important innovation for achieving last mile developmental impact. UNDP leverages its expertise in systems strengthening to support the Ministry of Agriculture through setting up a Technical Support Unit (TSU) for the implementation of PMFBY, to improve institutional and programme responsiveness, increase coverage and better access among marginalised and excluded farm households, offering innovative measures for risk management and reduced crop loss for the rural population in India.  The TSU will also focus on providing Capacity Building and Training support to participating state-level government departments involved in PMFBY and advancing the scheme among new states for improved uptake. Duties and ResponsibilitiesProvide support in conducting an assessment of the vulnerability of farmers to climatic and other forms of risks and their coping mechanisms through formal and informal mitigation support services.\nCompilation of business data and analysis to provide insights regarding current crop insurance trends across the country.\nLiaison with States, Insurers and farmer organisations over crop insurance needs for inputs into product design and innovation.\nLiaison with international crop insurance programmes and experts to draw on international best practices.\nAssess the capacity of insurers, reinsurers and insurance agents to pilot insurance products for identification and introduction of suitable crop insurance products.\nDetermine the views of potential farmer clients regarding PMFBY, RWBCIS and other agriculture insurance scheme including assessment of the affordability of insurance and willingness to pay the premiums.\nWork closely with the Specialist Non-Life Actuary and Crop Insurance & R&D Specialist on the annual review and audit of PMFBY/RWBCIS crop insurance results.\nAnalyse the underlying loss cost in relation to the commercial premium rates being charged by the insurance companies.\nProvide technical backstopping for inputs for training activities supported by the Project.\nProvide timely inputs for the timely submission of all progress reports and presentations as may be required by UNDP, the Ministry of Agriculture.\nPerform any other tasks consistent with the level of the post and/ or assigned by the National Programme Director – Technical Support Unit.CompetenciesAchieve Results: LEVEL 1: Plans and monitors own work, pays attention to details, delivers quality work by deadline.\nThink Innovatively: LEVEL 1: Open to creative ideas/known risks, is pragmatic problem solver, makes improvements.\nLearn Continuously: LEVEL 1: Open minded and curious, shares knowledge, learns from mistakes, asks for feedback.\nAdapt with Agility: LEVEL 1: Adapts to change, constructively handles ambiguity/uncertainty, is flexible.\nAct with Determination:  LEVEL 1: Shows drive and motivation, able to deliver calmly in face of adversity, confident.\nEngage and Partner: LEVEL 1: Demonstrates compassion/understanding towards others, forms positive relationships.\nEnable Diversity and Inclusion: LEVEL 1: Appreciate/respect differences, aware of unconscious bias, confront discrimination.Cross-Functional & Technical competencies:Business Direction and Strategy System Thinking: Ability to conduct problem analysis and judgement to understand how interrelated elements coexist within an overall process or system, and to consider how altering one element can impact on other parts of the system.InsuranceInsurnace analysis skills: The ability to digest a large amount of information and facts in order to frame and understand an issue, apply the insurance framework to the particular set of facts and present a coherent and comprehensive analysis of the situation presented in order to deliver practical and meaningful advice. This skill includes the ability to provide an objective assessment of the case, the organization's best arguments for proceeding and a recommended course of action. It also includes the capacity to think creatively and flexibly, within the applicable insurance framework. \nNegotiation: The ability to lead efforts to work with others to conclude or settle a matter. These are often soft skills and include abilities such as communication, persuasion, planning, strategizing and cooperating. In the UNDP context, this skill includes working closely with the client to understand the parameters of an acceptable solution, and assisting business units in resolving commercial disputes, and working with staff members or their insurance representatives to resolve a grievance, claim or issue. Negotiation often involves working with colleagues of differing views to arrive at an acceptable corporate solution. \nManaging Client relations: The ability to interact with different levels of management and across different agencies and offices to obtain information, develop legal approaches and resolve issues, this skill includes liaison with counterparts and determining the best sequence in which to pursue an issue, where information, particularly for UNDP, may be across different independent UN agencies.General (across the functions)Event planning and execution: Ability to plan, manage and execute of public and private events to ensure that they support and amplify individual communications and advocacy initiatives, as well as UNDP's overall brand and mandate.Partnership managementStrategic engagement: Ability to capture and sustain attention, interest and agreement of high-level, influential policy and decision makers and secure their buy-in of high-level vision and objectives. Business ManagementCommunication: Ability to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and choose communication methods depending on the audience. Ability to manage communications internally and externally, through media, social media, and other appropriate channels.Required Skills and ExperienceAdvanced university degree (master's degree or equivalent)in Agriculture Economics OR Insurance, Business Administration (MBA) or equivalent is required\nA first-level university degree (bachelor’s degree) in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree.Minimum 2 years’ (Bachelor’ Degree) or up to 2 Years’ (Master’ Degree) of demonstrable experience in insurance business in developing countries preferably agricultural crop insurance and RWBCIS products.\nRelevant Experience at the national level working with Governments and private entities in the insurance sector.\nAdditional years of demonstrable experience in insurance business in developing countries preferably agricultural crop insurance and WIBCI products.\nFour or more years of experience Program/project management experience.\nExperience of working with Central and/or State Governments/ national/ international/ public private organisations/on similar assignments will be preferred.\nPrior experience of setting up TSU or technical advisory services in the insurance sector.\nDemonstrates integrity and ethical standards\nPromotes the vision, mission, and strategic goals of the organization\nIn-depth knowledge of Agriculture Insurance, product design, indemnity-based insurance, index-based insurance products, national policies and existing schemes, regulatory laws related to crop insurance, related concepts, policies and practices,\nAdequate experience in project Management practices and ability to formulate and manage budgets,\nBroad based knowledge across cross cutting thematic areas such risk management, CCE, financial legal and regulatory standards, procurement procedures, environmental and social safeguards,\nShould of knowledge of legislative, legal and regulation structure in place with respect to crop insurance in India,\nDemonstrates substantive and technical knowledge to meet responsibilities and requirements of the post with excellence,\nPossesses the capacity for strategic planning, result – based management and reporting.\nGood facilitation and communication skills,\nAbility to carry out research and communicate strategic pieces that guide decisions on strategic programme directions,\nTailors and presents information to diverse audiences using a variety of communication delivery methods (e.g., written, electronic, oral, interpersonal) Documentation,\nGood interpersonal skills and ability to establish and maintain effective partnerships and working relations with people in a multi-cultural, multi-ethnic environment with sensitivity and respect for diversity.\nStrong leadership skills,\nAbility to lead a Technical and Communication team,\nDemonstrated skills in building, mobilizing, and leading multi-disciplinary teams,\nHands-on experience in design, formulation, implementation, monitoring and evaluation of projects,\nAbility to guide the Project Management Unit in implementing and achieving project outcomes,\nAbility to lead consultative meetings at national and state level with partners and senior stakeholders to identify priorities and manage the timely delivery of project activities,\nReliable in delivering own parts of the work as part of a team effort,\nDemonstrates excellent work/project planning skills,\nIs open to change and ability to manage complex, ever-changing environments.Language Requirement:Excellent oral and writing skills in English and HindiNote: Remuneration starting at INR (Annual) 14,35,932 / 1,19,661 INR (Monthly) as per the scale depending on qualifications and experience. The remuneration is excluding 8.33% pension amount paid over and above the salary. DisclaimerJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}