{"Job ID": "69865977", "Description": "As a KYC senior team member, you will be responsible for ascertaining that all KYC and AML policies are adhered to, you will also be responsible for conducting reviews of client’s KYC documentation stored in internal repositories and publicly available information. You will be performing the necessary screening against relevant search engines and sanction lists to communicate any additional deficiencies back to the business. At J.P. Morgan Chase You will be working in an environment where leadership, excellence, integrity, and diversity are among our core principle.You will assist the client-facing teams to ensure all client KYC records are compliant with regulatory standards and timely completion of all client-level due diligence. You will assist in end-to-end operational activities through the periodic renewal process of all clients. You will assist with the drafting and gathering of client documents and verification of client data via publicly available and internal sources at a client level prior to final review by a KYC Operations reviewer and the client-facing team. This research is performed to ensure a client’s KYC profile is appropriately updated and any discrepancies or issues with the profile escalated to the appropriate lines of business.Job ResponsibilitiesAbility to understand the firm’s KYC requirements when completing documentation inclusive of Customer Identification Program (CIP), Minimum Due Diligence (MDD), Enhanced Due Diligence (EDD), Local Due Diligence (LDD), Specialized Due Diligence (SpDD) and Product Due Diligence requirements (PDD)\nCompare and contrast differences within KYC records, highlight and escalate any discrepancies\nEngage with Middle office and be part of KYC/AML interactions to complete the case as per the timeline\nExhibit the highest standards of customer service to our internal and external customers (inclusive of confidentiality)\nAbility to interpret alerts to management when applicable\nHandling and maintenance of confidential client documentation\nBe flexible to work on other migration/remediation projects including Screening resolution, other line of business holistic alignment or Quality Assurance. Ability to comprehend the KYC risk factors and draft the overall risk summary for the clientRequired Qualifications, Skills and Capabilities: Bachelor’s Degree or Graduate Degree\nMinimum 2- 4 years’ experience in the Financial Services industry with a demonstrated track-record of delivery and/or relevant experience in Compliance, Corporate KYC, AML, and Screening \nStrong research, analytical, and comprehension skills with the ability to analyze large amounts of data\nOutstanding client management, partnership building, leadership, and direct experience of dealing with multiple stakeholders at one time \nEffective communication, interpersonal and analytical skills with the ability to work independently on multiple assignments.\nGood understanding of Financial Services industry /AML, Sanctions policies and banking systemsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}