{
    "Job ID": "69869125",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.Job Description:\nAs a Procurement Manager at E&T Procurement, you will assume a leadership role, overseeing and coordinating the activities of three critical positions within the Purchasing organization: Purchasing Supervisor(Systems), Purchasing\nSupervisor(Sourcing Council) and Purchasing Segment Liaison Supervisor. Reporting directly to the Global Procurement Director, your leadership will be pivotal in ensuring the seamless execution of procurement strategies and optimizing collaboration among these specialized teams. This Leadership position requires strong leadership, exceptional communication skills, and a deep understanding of procurement processes.Key Roles and Responsibilities:Leadership and Supervision:\n• Lead and provide guidance to the Purchasing Supervisors\n• Create a collaborative and productive team environment, instilling a sense of teamwork and shared procurement objectives.\n• Ensure that each team is fully aligned with the company's strategic goals and Purchasing priorities.Cross-Functional Collaboration:\n• Facilitate effective collaboration between the three specialized teams under your supervision, ensuring a seamless integration of their efforts.\n• Promote Global cross-functional communication and knowledge sharing to optimize procurement processes across Segments\n• Work closely with the Global Procurement Directors (Segment Managers) to align strategies and objectives.Performance Management:\n• Set clear performance goals and expectations for each team, actively monitoring their progress.\n• Conduct regular performance evaluations, provide constructive feedback, and support professional development.\n• Identify opportunities for process improvement and increased efficiency.Strategic Planning and Implementation:\n• Contribute to the development and implementation of Purchasing's strategic plans and objectives.\n• Collaborate closely with the Global Procurement Directors in setting long-term procurement goals and initiatives.\n• Ensure that all procurement activities effectively align with the organization's overarching strategy.Resource Management and Allocation:\n• Efficiently allocate resources to meet project and procurement demands, considering budget, staffing, and other resource constraints.\n• Ensure that each team has the necessary tools, resources and support to excel in their respective roles.Qualifications:\n• Bachelor's degree in Business, Supply Chain Management, or a related field. Master's degree is a plus.\n• Proven experience in a senior supervisory or leadership role within the purchasing or procurement domain.\n• Exceptional leadership and managerial skills, with the ability to inspire and guide specialized teams effectively.\n• Outstanding communication and interpersonal skills to facilitate collaboration and communication among teams.\n• In-depth understanding of procurement processes and strategies.\n• Strategic thinking abilities and the capability to align procurement activities with organizational objectives.\n• Familiarity with procurement software and tools is advantageous.\n• Certification in supply chain management or procurement preferred\n• Previous experience in a manufacturing or procurement-focused organization, managing specialized teams.\n• Familiarity with international procurement and global sourcing practices.Caterpillar is not currently hiring individuals for this position who now or in the future require sponsorship for employment visa status. Caterpillar offers many job opportunities which can be found through our employment website at  www.caterpillar.com/careers\n\nCaterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}