{
    "Job ID": "69866127",
    "Description": "What you’ll do\nThe Network Deployment Engineer supports the deployment, implementation, integration, commissioning/de-commissioning and acceptance testing of any network components and services (e.g. across Mobile Access, Fixed Access and Access TX / 2G, 3G, 4G, 5G) across the network deployment function following the network infrastructure strategy and carries out administration activities. The Network Deployment Engineer conveys a good understanding of established concepts and procedures to deploy and deliver network equipment and services and conduct performance assessments and optimisation. Typically reports to the Network Deployment Manager.\n\nWho you are* Follows Network processes to deliver tasks to support the execution, implementation and deployment of network equipment, services and infrastructure as per agreed designs/contract service levels;* Supports the team to deliver activities related, but not limited to the smooth rollout of building or upgrading sites or projects that improve cost effectiveness and quality standards;* Delivers tasks relating to establishing Network implementation practices for the Network and driving efficiency programmes, ensuring general compliance and vendor evaluation controls are maintained (e.g. SOX, ISO, BCP);* Uses communication skills to exchange ideas and information in a concise and logical way to support deployment and delivery of network equipment and services and conduct performance assessments and optimisation;* Executes tasks whilst maintaing solid relations with vendors, authorities and other third parties;* Executes assigned tasks for collaboration with stakeholders on project timelines and activities in relation to Network infrastructure (eg. SAP, Remedy, Project monitoring);* Executes assigned tasks for demand fulfillment in close alignment with teams, business units and business customers;* Uses best practice knowledge to perform the detailed roll out planning, implementation and optimisation of the Network;* Understands the needs and follows procedures, processes and standards related directly to Network Deployment;* Performs other job-related duties or tasks defined by the supervisor or resulting from assigned agendas.Not a perfect fit?Worried that you don’t meet all the desired criteria exactly? At Vodafone we are passionate about Inclusion for All and creating a workplace where everyone can thrive, whatever their personal or professional background. If you’re excited about this role but your experience doesn’t align exactly with every part of the job description, we encourage you to apply as you may be the right candidate for this role or another role, and our recruitment team can help you see how your skills fit in.What's in it for youTogether we canJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}