{
    "Job ID": "69866076",
    "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.What a Sr. Manager, Data Science Managed Services does at Visa:The candidate will be part of the Visa Consulting and Analytics (VCA) team.\nSpecific responsibilities will include:\nBuilding & helping our partners to build data science capabilities & analytical solutions to solve their business problems.\nWorking knowledge in retail banking & credit card domain to guide the teams on the solution architecture.\nDrive innovation through using data science techniques.\nAct as data science advocate within our partners, advising and coaching analytical teams and sharing best practices and case studies.\nContinually look at the environment to challenge our assumptions around new sources of data, potential analytics partners, tools, talent and infrastructure.\nExplore leading methodologies and best practices to other teams and importing successful methodologies from other international markets.What you will need:\n• 10+ years' experience building end-to-end analytical systems as a Consultant, Data Scientist, or ML Engineer (or equivalent)\n• Master’s degree in an analytical field such as computer science, data engineering, data science, econometrics, or similar\n• Experience in Card or Retail banking analytical domain is necessary.\n• Experience in managing multiple stakeholders at client site.\n• 7+ years of experience in data science, analytics, and statistical modeling or relevant area\n• Experience in SQL and statistical programming languages\n\nWhat will also help:\n• Knowledge of payment industry\n• Experience in working closely with data science community.\n• Outstanding problem-solving skills, with demonstrated ability to think creatively and strategically.\n• Self-motivated, results oriented individual with the ability to handle numerous projects.\n• Technology-driven mindset, digitally curious\n• Up-to-date with digital and technology literature, trends.\n• Able to challenge the status quo diplomatically and bring teams along with strategy.Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}