{
    "Job ID": "69867358",
    "Description": "Provide rapid response to queries from customers pertaining to technical/ configuration questions.\nAttend to calls routed from call center while ensuring achievement of customer service targets in terms of response time and resolution.\nEnsure that all customer transactions are completed to the satisfaction of the customers in accordance with service level agreements and ensuring that the customers are informed on resolution.\nAssisting our customers with various technical issues that range in complexity.\nLearn thoroughly the specs of the company network, equipment, services and troubleshoot system related issues.\nUse efficient analytical skills, access our internal database and teamwork to develop technical solutions related to technical issues.\nAbility to provide appropriate level of instructions to clients with limited technical knowledge.\nHandle Network troubleshooting and fault analysis; hardware troubleshooting and repair.\nTake ownership of customer issues reported and see problems through to resolution.\nFollow standard procedures for proper documentation, reporting and escalation of unresolved issues to the appropriate internal teams.\nProvide prompt and accurate feedback to customers providing updates on the progress of the case.\nEnsure proper recording and closure of all tickets.\nPrepare accurate and timely reports.Liaise with NOC teams to resolve customer issues.\nEnsure that each support case owned is handled as per our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling SLAs.\nContribute findings to a common knowledge base and keep it up to date.\nGain subject matter expertise in company products and services.\nOn a rotation basis, handle on-call support out of office hours.\nEnsure that the percentage of customer complaints resolved is maximized in minimum iterations to\nConsistently strive to increase customer satisfaction score through timely resolution of complaints.\nEnsure reduction in the number of repeat calls by customers.Identify inefficiencies in the current processes and make recommendations to improve the same.\nSolve any incident in devices (hang-up, high CPU/memory, misconfiguration), services or connectivity (loss in fiber, loss in wireless link) this includes permanent solutions or workaround solutions.\nUtilize knowledge of networking, hardware, and software to diagnose, qualify, and resolve tickets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}