{"Job ID": "69869998", "Description": "BGSW - Bangalore-Coordinate the products development activities in the team and make the projects finished on time and on quality.-Support the product application and acquisition to support the customer on technical issues without customer complain.-Lead the problem solving when there are issues during product development phase and customer application phase.-Responsible for the customer requirements analysis and product specification design. Cooperating with European SW/HW team to finish the products development.-Responsible for creating the system development plan, development status report, product system D-FMEA, TCD, .Etc-Education:Bachelor degree or aboveWorking Experience:With 5 years plus working experience in automotive electronics industry; With system engineering experience. With Embedded SW/HW development background.-Knowledge/Skills:Must:Have the experience of requirement analysis;Experience to define the product specification and design FMEA;Familiar with the system engineering process;No problem to communicate with development team in Europe independently;Good knowledge of CAN/LIN Gateway;Embedded SW/HW development knowledge.Familiar with AUTOSARBetter to have:Automotive/Electronics engineering;Ability of organizing and coordinating;Good knowledge of cyber security, firewall, OTA.Behavior related requirements:Have the mindset to follow the project schedule strictly and set the priority for all the tasks.Have the initiative to optimize the development process and method.Have the initiative to help, coach and share the knowledge to the colleagues• Internal Referral bonus of this vacancy: RMB 3,000 (Valid only for Bosch associates). For the detailed regulation, please refer to Bosch China Internal Referral PolicyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}