{
    "Job ID": "69866073",
    "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.We at Visa, dream of a future where it's easy to pay and be paid. Across the planet. Where ever. Whenever. Securely. Easily. Together, we are building leading edge full-service Payment Management solutions combining global payment processing, fraud management and payment security systems. \n \nThe Engineer will play a lead role in tackling the complex technical problems within Risk and Identify Service. The Engineer is expected to be a Java, Kafka and Containerization Subject Matter Expert to help strategize, execute, and support the migration from a backend perspective. The candidate must also be an SME or have substantial experience designing and implementing solutions in GCP. The responsibilities also include gathering and clarifying requirements, facilitating communication with other groups within the organization, and guiding architectural decisions. It is an opportunity to learn, lead and work on technologies for all Value Added Services.\n \nResponsibilities:\n    · Proficiency in cloud service knowledge skills is crucial since engineer filling this position is expected to Provide GCP subject matter expertise to team.\n    · Software security skills in Google Cloud involve expertise in various aspects of securing applications and data on the platform.\n    · Strategize and implement ways to rearchitect solutions in GCP.\n    · Designs large scale event-based application on GCP with high-availability and high performance.\n    · Possess strong testing skills and a comprehensive understanding of the testing process within GCP.\n    · Familiarity with Docker technology is imperative.\n    · Contribute to development of new products by building quick POCs and converting ideas into real products.\n    · Collaborate with business and technology stakeholders to deliver high quality products and services that meet business requirements and exceeds expectations while applying the latest available tools and technology.\n    · Have a passion for delivering zero defect code.\n    · Effectively communicate status, issues, and risks in a precise and timely manner\n    · Work in Agile/Scrum teams and follow the guidelines.\n    · Create documentation and procedures for installation and maintenance.\n    · Collaborate with global and virtual teams on software development.\n    · Identify opportunities for future enhancements and refinements to products, standards, best practices and development methodologiesThis is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Basic Qualifications\n\n· 13 or more years of relevant work experience with a Bachelor Degree or with an Advanced Degree.\n· 11+ years of relevant experience with software design, architecture and development life cycle.\n· Experience designing solution architectures on Google Cloud Platform (GCP).\n· Solid foundation in cloud computing fundamentals, and understanding the different service models (IaaS, PaaS, SaaS) and deployment models (public, private, hybrid).\n· Proficiency in Google Compute Engine managing, and scaling virtual machines (VMs) to meet diverse workload requirements.\n· Mandatory experience with n-tier web application development and experience in Java/J2EE or other frameworks.\n· Solid experience in frameworks like Spring or Spring Boot, Sprint MVC.\n· Proficient in Web Services/API Development using SOAP or REST, JSON and XML.\n· Proficient in Kafka - Ability to install, maintain and troubleshoot Kafka. Have experience with messaging and stream processing on Kafka. Have ability to set up and configure Kafka brokers.\n· Experience with containerization(Docker, Kubernetes, Docker Swarm, etc.).\n· Experience with RDBMS systems like SQL Server, Oracle or DB2 or No-SQL DBs like Mongo DB.\n· Exposure working on UI/Web development using Angular/React, JavaScript, JQuery, and HTML/CSS technologies is required.\n· Proficient in GIT/Stash, Maven, Jenkins etc.\n· Passionate about delivering zero defect code that meet or exceed the proposed defect SLA and have high sense of accountability for quality and timeliness.\n· Ability to deliver on multiple projects and manage priorities based on changing directions.\n· Leading a module/team or mentoring experience will be a plus.\n· Excellent presentation, collaboration and communication skills required.\n· Experience being part of an Agile/Scrum team and following processes.Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}