{"Job ID": "69866627", "Description": "Position Title: Territory Manager PullLocation: National/Multiple CitiesThe position is part of the Unilever Food Solutions team which is responsible to drive sales and business growth by developing good relationships with our existing operators and onboarding new ones. Responsible for effective distribution management, trade activities execution within the assigned territory, build chefmanship capability and delivery of KPIs.  Job Responsibilities  Responsibilities: Drive the business to the desired ambition of Underlying Volume Growth / Sales Growth \n\nEnsure Volumes / Target tracking of all channels Develop strong relationships with our operators. \n\nDrive Chefmanship capability for the entire team and conduct regular kitchen trainings with chefs. \n\nObtaining competition activities & market feedback and sharing them with stakeholders \n\nHave the acumen for Financial Matrix – Business Profitability / Gross Margin \n\nLead and drive the extended team – Build team & develop talent. Deploy and lead projects like activations/launch plans/ micro marketing plans with meticulous detail with rigorous post launch evaluation/monitoring and take corrective action when required. \n\nRedefine the process post execution analysis with strong analytical skills  \n\nExplore new avenues of business in assigned Territory, augment efficiency of existing business models and implement other benchmark models where feasible Education & Work Experience: Bachelor’s Degree \n\n1-3 years of relevant sales experience in FMCG B2B / Food Services industry is preferred. \n\nSkills:  Customer Relationship Management & Selling Essentials. Excellent Communication Skills \n\nCulinary knowledge \n\nShould be able to coordinate with multiple teams and stakeholders and take them along. \n\nHigh on objective rigor where efforts are focused towards a business target pegged to key priorities and market realities. \n\nExtremely up to date with technology globally and leverage it in their area. Job Specific Skills & Requirements:   Sales: Strong communication and negotiation skills. \n\nStrong Communication skills. \n\nStrong command on numbers Negotiation skills \n\nAbility to multi-task and management competing deadlines. Unilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}