{
    "Job ID": "69866350",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Job description:Proven ability to work on transactional processes related to F&A.\nSupport AP invoice processing and ensure all transactions are completed on time with high accuracy.\nAbility to work on multiple transactional processes.\nCreate process documents and monitor SLA’s for supporting projects.\nMaintain and improve key performance measures.\nProactively manage customer issues related to the support requirement.EVOLUTION:Eurofins has been growing consistently over the years and has been expanding its presence across the world including India. This requirement is for GSC BPO team which was established in the year 2015 to manage and support GSC and NSC teams with their transactional and reporting tasks. As this unit is still in its early stage there will be exclusive opportunities to learn and grow within this team.What we offer:A launch pad into various senior management opportunities – within the many business lines of Eurofins globally – or into the management hierarchy in our different corporate functions.The opportunity to grow your project management skills in a demanding, fast growing organization.\nA chance to become part of a highly motivated international team of professionals.In a fast growing group, successful leaders are frequently being offered increased areas of responsibility (subject to geographic mobility).Total experience of 2-3 years.\nBachelor’s degree in Commerce.\nShould have experience in managing Accounts Payable.\nShould have good logical reasoning and analytical skills.\nShould have passion to continuously learn and grow.\nBasic knowledge in MS Office, especially Excel and PowerPoint.\nGood written and verbal communication.Profile description: AP process associate.Requirements: Experience in managing AP invoice processing or any AR activity .Personal Qualities:Excellent analytical and problem solving skills\nExcellent verbal and written communication skills\nSuccessful teamwork experience and demonstrated leadership abilities are required\nProven ability to transfer knowledge and stay aware of current trends and technical advancements\nAbility to articulate and present different points-of-views on various technologiesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}