{
    "Job ID": "69865748",
    "Description": "Last Date to Apply: 21st September, 2023Employment Type: This is a full-time position.\nGrade: This is a grade 2 position.\nLocation: This role is based in Islamabad, Pakistan (Hybrid)About the Role:As Assistant Manager Talent Acquisition, you will be responsible to lead recruitment process for the assigned positions while ensuring compliance with local and global policies as per Telenor Way (Code of Conduct). You will also get an opportunity to work on flagship projects to strengthen our employer brand and build talent pools for business-critical roles.Your Impactful Goals will include:Ensure healthy recruitment process experience for all stakeholders involved i.e. Line Manager, Candidates, HR Business Partners while delivering within TAT\n\nLead and improve process experience and efficiency through automations and tools\n\nSupport project-based activities in talent acquisition function\n\nDevelop talent pools for business-critical roles and functions.\n\nEnsure achievement of recruitment KPIs.Your Typical Day will look like:Partner with hiring manager to understand roles, position profile, and search calibration.\n\nLead overall recruitment process (advertisement, pre-recruitment meeting, profile sourcing, long-listing, scheduling, interviews, offer placements and closure with hire process) for multiple roles and teams.\n\nBrainstorm innovative sourcing strategies i.e. active search, poaching, referrals, creative advertisements, LinkedIn search etc.\n\nExplore and implement talent screening strategies i.e. tests, case studies etc. on need basis.\n\nEngage in bulk hiring due to business needs or projects.\n\nSupport in annual flagship campaigns and projects i.e. Internships, Open Mind Trainee, Naya Aghaaz Trainee and Functional Trainee programs etc.\n\nEnsure that overall recruitment process and governance is as per local and global policy standards.\n\nUse available systems and tools i.e. workday, share point, referral and background check links, recruitment database, stakeholder experience etc.\n\nDevelop knowledge of Telenor policies and procedures to guide candidates and line managers\n\nActively engage line managers and HRBPs and provide weekly updates against all open positionsYour Career Path:Lateral or vertical roles in Talent Acquisition and/or HR Business Partnering functions.What we're looking for:Education: Minimum Bachelors in the field of business management, HR management.Work experience: 3-4 years experience of working with bulk hiring, technical recruitment for product management, brands, sales and IT roles will be preferred.Functional Skills/Knowledge Areas: Core experience of recruitment\n\nGood communication and people engagement skills\n\nStrong knowledge of IT and Technology, Product Management and Brands functions\n\nExcellent collaboration skills to understand and align multiple stakeholders\n\nAble to handle tight deadlines and high pressure situation.\n\nAttention to detail and ability to manage operations effectively.\n\nResilience to deal with changing expectations and environment\n\nNegotiation and influencing skillsWhy should you join us at Telenor?At Telenor Pakistan, we provide you the platform to work in a challenging and rewarding environment to become a skilled professional in your chosen field of interest. As one of the top employers of the country, we enable you to realize your dreams in a collaborative environment of diversity and openness to new mindsets.   As an equal employment opportunity provider, Telenor Pakistan makes all decisions of employment purely based on merit irrespective of race, caste, gender, creed, color, religion, sex, national origin, or disability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}