{
    "Job ID": "69866179",
    "Description": "Summary Of Position:This role is in charge of implementing Identity and Access Management solutions in SAP, governing the process adherence of our vendors, and supports security and authorization topics in SAP applications.Key Responsibilities:Supports and implements strategic projects and enhancements.\nDomain specific Subject Matter expert for the design of authorization roles and concepts in SAP ECC, BI, GTS, ATTP and related applications.\nCoach and consult the business on their best and most cost-effective security options in their main domain.\nSupport in emergency task force for SAP security related incidents and responsible for supporting RCA and CAPA processes.\nImplement remediation solutions for identified security concerns resulting from audits, security notes, alerts, and testing.\nConsistently review SOS, EWA and white papers for improvement opportunity and acts as a thought leader for one or more expertise areasKey Requirements/Minimum Qualifications:At least 3 years of technical experience in SAP Authorizations preferably in a Global company.\nGood knowledge on SAP ECC and BI authorizations.\nWorked in Large SAP ERP rollout programs in the area of authorizations or similar project.\nHas worked in dynamic organization and has experience with dealing with different solution partners.\nUnderstanding of GxP, SOX and CSV requirements.Work hours: 1 PM to 10 PM ISTRelocation assistance: YesEmployment Scams: Alcon is aware of employment scams which make false use of our company name or leader’s names to defraud job seekers. Alcon does not offer any positions without interview and never asks candidates for money. All our current job openings are displayed here on the Careers section of our website, where you can search for open positions and apply directly.If you have encountered a job posting or been approached with a job offer that you suspect may be fraudulent, we strongly recommend you do not respond, send money or personal information, and check our website for current job openings.Alcon is an Equal Opportunity Employer and takes pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital status, disability, or any other reason.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}