{
    "Job ID": "69866331",
    "Description": "Responsibilities:Kitchen equipment is prepared for use.\nCommunication is polite and displays courtesy to guests and internal customers. Familiarity with property safety, first aid, and fire and emergency procedures is displayed and equipment is operated safely and sensibly.\nAwareness of OH&S policies and procedures is demonstrated and it is ensured that all procedures are conducted safely and within OH&S guidelines.\nHACCP is implemented and practiced.\nPick up of goods ordered from the store or other kitchens\nAcceptance and storage of food deliveries\nEnsure any stock is rotated regularly\nTo assist the junior chefs to carry out daily and weekly procedures including temperature checks, food labeling/dating and storage, and ensuring records of such are up to date.\nMinimize wastage/spoilage\nEnsure the cleanliness and maintenance of all work areas, utensils, and equipment\nActively participates in hygiene and HACCP programs\nAny other duties, which may be assigned to you from time to time as directed by your Supervisor or Manager.\nAdditional responsibilities and tasks can be added at any time according to the needs of the business and of the hotel.\nInspire guests with an attitude of personal attention to their requests\nA commitment to a sense of urgency, immediacy, and total responsiveness\nIntuitively anticipate guests' needs and address them in a refreshingly unique manner\nProactively find opportunities for innovative service delivery\nDemonstrate commitment to uncompromising standards of excellence\nApproach each guest in a confident and welcoming manner\nWork as a team with all other departments in their effort to delight the guest\nDemonstrate a willingness to “ go the extra mile” to exceed guests' expectations\nShow respect for guests' security and privacy at all times\nTake personal responsibility for meeting guests' needs\nCommunicate effectively to ensure service excellence at all timesSkills & Qualifications:A few years of experience in the kitchen field in luxury hotels is required\nPostgraduate and/or Hotel Management School, Apprenticeship with the diploma is an advantage\nMust have Basic knowledge of kitchen operation, full knowledge of sanitation requirements in handling foodTechnical Skills:Ensure that kitchen operating equipment is maintained to proper standards\nRequired to have good EnglishPhysical Requirements: Must be able to exert physical effort in transporting pounds, endure various physical movements throughout the work areas, reach up and down, remain stationary at times throughout work periods, and satisfactorily communicate with guests and colleagues to their understanding.Mandarin Oriental reserves the right to add, delete, change or modify the job duties, and responsibilities described in this Job Description, at the company’s discretion, at any time with appropriate notice. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}