{"Job ID": "69866990", "Description": "Tbot Techno Systems, an IT Solutions and Services company specializing in end-to-end IT Infrastructure Solutions, is seeking a Business Development Executive. The ideal candidate will be responsible for identifying and pursuing new business opportunities, developing and implementing growth strategies, and building and strengthening customer relationships. Tbot Techno Systems is a trusted partner of world's leading IT Original Equipment Manufacturers (OEMs), catering to a wide range of industries and having an impressive customer base that includes renowned organizations such as L&T, Tata Group of Companies, Amazon, IBM, Siemens, Wipro, and many others. As a Business Development Executive at Tbot Techno Systems, you will play a key role in driving the company's success by growing its customer base, expanding its reach, and achieving its overall business objectives.Develop and implement a comprehensive business development strategy to achieve company's sales targets and objectives.\nIdentify and pursue new business opportunities through targeted prospecting, lead generation, market research, and networking.\nBuild and maintain strong relationships with existing and potential customers, and identify their needs and requirements.\nCollaborate with internal teams to deliver customized IT solutions to customers that meet their business needs and improve their overall success.\nWork closely with sales, marketing, and operations teams to create proposals, negotiate contracts, and close new business deals.\nRepresent the company at industry events, conferences, and trade shows to build brand awareness and promote the company's products and services.\nContinuously monitor and analyze market trends, competition, and customer feedback to identify opportunities for growth and improvement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}