{
    "Job ID": "69868558",
    "Description": "Missions : Planifier, installer, automatiser, superviser et améliorer les processus de production.\nSécuriser la production (sauvegarder, sécuriser les flux, prévoir et mettre en pratique des solutions de repli ou de contournement (PRA, PCA).\nGérer les évolutions et la maintenance des matériels, des logiciels et du système.\nGarantir la livraison des services.\nRéférencer et documenter les composants liés à l’infrastructure, aux logiciels et leurs liens avec la couche applicative.\nTenir à jour la cartographie.\nAssumer la responsabilité de projets.\nAssurer la veille technologique sur les différents aspects de l’infrastructure système et de communication (matériels, logiciels, architecture, protocole, mode de transferts).Profil recherché :De formation Bac +4/5 en informatique, vous justifiez d'une expérience d'au moins 3 ans;\nSolides connaissances en administration Linux (Debian, Redhat)\nConnaissances en administration d’environnements haute-disponibilité Linux\nConnaissance des outils d’automatisation (Ansible)\nConnaissance des outils de déploiement, d’orchestration ;\nConnaissance des protocoles d’accès ;\nConnaissance d'un outil de monitoring (Nagios)\nMaitrise d'un ou plusieurs langages de scripting (Shell, Perl, Python, …)\nRéférentiel des bonnes pratiques ITIL\nPrincipes relatifs à la sécurité des systèmes d’informations\nAnticiper les évolutions fonctionnelles et techniques\nÉvaluer une solution informatique\nModéliser et concevoir les architectures techniques du système d’information\nGérer la sécurité de l’information\nRédiger et mettre à jour la documentation fonctionnelle et technique\nPratiquer une veille technologique.--Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}