{"Job ID": "69867046", "Description": "1.Job Details\nThe Customer Support Organization has an important role to play as they serve as the primary customer contact for an assigned portfolio of accounts they bring the customers, sales and business operations together.They are responsible for commercial and operational activities as part of the Order-To-Cash process: i.e. validation and booking of customer orders, managing order changes, providing status updates, managing physical & financial claims with a strong alignment with all relevant internal functions as part of the end-to-end customer experience.2. Principal Responsibilities\nPre-Order EntryTimely gather all relevant info to accurately respond to all customer queries related to: product availability, stock levels, list prices where applicable (awareness of confidentiality constraints), lead times, minimum order quantity and/or value.\n\nAccurately and on time perform system updates: new customer set-up, customer amendment and change (including ship-to, bill-to, payer, direct/indirect customer etc., based on information received from sales)Order Entry\n\nValidation and order entry of customer purchase orders within defined target.\n\nEnsures timely resolution of all potential roadblocks preventing order processing flowing seamlessly to fulfilment (price discrepancy, credit holds, material exclusion etc).\n\nCovers order scheduling according customer specific requirements as well as internal stock availability.\n\nSet up, document and maintaining the order entry process for assigned customersBacklog ManagementüAct as an active interface between customer, ISC, Logistics, Transportation, Finance and Sales to meet customer expectations, improve the end to end cycle where possible as well as maximize revenueüConstantly facilitates removal / mitigation of roadblocks by proactively involving all parties to solve any issues that might arise between order entry and invoicing.üCommunicates proactively with the customer, providing relevant information to potential delays, relevant status updates on open backlogüPerforms regular backlog management activities to address customer requirements vs past due, blocked, incomplete orders and invoices, including system updates to reflect all order changesüSupports revenue maximization activities (pull-in’s, drop ship, expedite requests) and partners with the demand & forecasting teams to ensure a smooth end of month/quarter closure activities.Claims managementüSupports all customer disputes regarding standard return transactions, defective items, damaged shipments and ensures fast resolution in collaboration with other internal departmentsüEnsures accurate reporting on any physical complaints as per the internal process and monitors closure in line with customer expectationüEnsures accurate processing of performance rebates for all major distribution and platinum accountsüActs within defined targets on all financial claims received from customer / Credit and Collection department by validating and performing financial corrections on disputed invoices.Continuous Improvement & HOSüApplies HOS methodology, quality standards and process compliance in day to day activitiesüHighlights process deviations or exceptions, ensures best practice sharing and initiates process improvement opportunities where required.Transition supportüGetting familiar with existing documentation (Value Stream Maps, SOPs, Transition checklists, RASIC and other). Identification of blind spots and potential risks.üSupports Supervisor in transition planning which includes i.e. preparation of the KT agenda, introduction to transition team and to the sending site, participation in regular catch up calls.üActively takes part in shadowing during the visit at the sending site – reviews the documentation and compares it with the tasks that are being done, gathers customers specific requirements, identifies backlogüIdentification of ERP system/version used at the sending site and its initial analysis. Takes part in ERP migration – where applicable.üSupports SAP, Salesforce, InContact and any other necessary system implementation.üBuilds professional relationship with the counterparts and related functions.üSharing the knowledge gathered during the KT at sending site with the receiving team.                           Transformational Projects, Process maintenance, Training & AuditüEnsures end to end customer onboarding and operational training for new team membersüActs as a SME in relation to all users & stakeholders for the respective regionüActs as customer experience champion and leads BPS (best practice sharing) sessions within the teamüActs as delegate & escalation point on complex cases on supervisors’ requestüSupports the quality auditing process for the team, identifying root causes, proposing corrective actions and following through implementationüSupports the tier meetings ensuring progress across multi-functional areasüRepresents CS in transformational projects, ensuring all operational & business inputs are captured in the newly developed processes and procedures. Supports communication and management of change.üDrives process and customer improvement opportunities across teams using advanced analytics capabilities and ensures relevant changes are implemented/monitored3. Requirements:\n \nBachelor’s degree (or equivalent experience).\nBusiness fluent in written and spoken English, other European languages represent a plus.\n\n1-3 years Customer Support experience.\n\nStrong knowledge/experience with CRM/ERP system business processesHigh level of MS office skills (Excel, Word, Outlook, PowerPoint).4. Skills:\n\nProcess documentation skills.\n\nSix sigma knowledge.\n\nSpecialist user level for SAP, SFDC.\n\nOperational knowledge of SharePoint based tools.\n\nCustomer tools/portals knowledge as required by portfolio.\n\nIncoterms & special Trade and Compliance knowledge including applicability and exceptions for own portfolio.\n\nFinancial understanding of the OTC process including: VAT, billing, proforma requirements, credits .\n\nHigh level of customer orientation.\n\nExcellent written and spoken communication skills (phone, mail, email).\n\nAbility to build relationships and networks in a virtual team environment.\n\nStrong team player with the ability to take ownership and follow-through.\n\nFlexible individual with a high level of intercultural sensitivity, able to adapt to a quickly changing environment and drive continuous improvement.\n\nDemonstrated solution-oriented, pro-active “can do” attitude,Willingness and ability to work under own initiative.\n\nSelf-motivated with assertive communication skills, positive and result oriented attitude.\n\nWell organized with good time management, result oriented.JOB ID: req415528\nCategory: Customer Experience\nLocation: One-HON-UTC-2+4F ,UTC, 2F 4F, Sushant Lok Phase I,,Sector 43,Sushant Lok Phase I,,Gurgaon,HARYANA,122022,India\nNonexemptJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}