{
    "Job ID": "69866466",
    "Description": "Apply now Job no: 4056644\nLocation: Central Province\nAlshaya Food Factory Riyadh SudhirCPFAlshaya’s Central Production Facility (CPF) in Kuwait currently employs more than 150 people and manufactures food products for brands such as Starbucks. Now is an exciting time to join CPF as they embark on plan to improve, innovate and build additional revenue streams.You will carry out daily, weekly and monthly production duties ensuring compliance with operation guidelines, company policy and procedure, audit and country law. Key performance areas include:Record employee attendance, vacation and sick leave via electronic attendance on a daily basis.\nCheck daily production and action as required.\nMaintain ministerial documents in store as required by country law and audit compliance.\nEnsure all file are kept in order and documentation is readily available when required. We are looking for someone with:Good Excel skills.\nExcellent communication skills.\n2-4 years' experience in an production role.\nFood industry background will be an advantage.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Central Province, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}