{
    "Job ID": "69867051",
    "Description": "The Operations Manager at “ProgressSoft Oman” is responsible for leading the operation and functional units by managing the day-to-day and overall strategic company operations with clients and prospects for contractual, financial, and strategic roadmaps for both new projects and running systems. The candidate should have payments and banking experience, and good awareness of SDLC and software support lifecycle.Planning and Development:Plan, develop and review company's operational initiatives, objectives, policies, procedures and methods.\nExecute strategies for daily, weekly, monthly, quarterly and yearly operations on projects.\nManage capacity planning and resources allocation with development teams and handling monthly resources planning for projects and services.\nManage capacity planning in coordination with Country Manager and COO to secure continuity of services and projects delivery for ProgressSoft Oman.\nSupport in ProgressSoft business expansion and align with the business team for building business roadmap and planning activities.\nManage Cash-in forecasting based on ProgressSoft signed agreements, maintenance contract, change requests and purchase orders with Customers versus actual delivery and invoicing milestones.Clients:Mange Key Strategic Projects and Customer Engagements.\nReview and manage all clients’ agreements not limited to renewals, licensing, support contracts, SLAs etc.\nOverlook and accountable for timely execution of all projects with clients while maintaining quality of work and customer satisfaction.\nEnsure thorough follow-up of all projects phases while ensuring risk assessment and risk management.\nManage ProgressSoft customers’ accounts in coordination with the Country Manager and COO to ensure Customers satisfaction in terms of high-quality projects and professional services delivery.\nManage all clients’ relationships and ensure meeting client strategic goals and aligns internal teams to meet and support client roadmaps.\nEnsure project changes, updates, upgrades and improvements with clients are timely aligned with development team capacity and delivery.Operations:Establish and monitor operations compliance with policies and procedures.\nOversee productivity objectives and manage the achievement of quarterly and annual productivity plan objectives.\nAssist with performance development and measure job performance and reporting.\nIdentify change initiatives for improved operating efficiency.\nMonitor timely invoicing of projects and services invoicing with Customers and handling necessary follow-up to manage timely settlement of due invoices.\nDeliver weekly reports on the status of all projects to the Country Manager and COO.Anticipated QualitiesSelf-initiation with a proactive mentality and know-how-to-know skills.\nHigh level of performance, especially under pressure.\nDetail-oriented and highly organized.\nExcellent follow-up skills.\nAccuracy and attention to details.\nProficiency in Arabic/English written and verbal communication.\nExperience in Banking industry and IT operations.\nHighly motivated and able to influence and motivate others.\nAbility to work in effective collaboration with technical, finance and business teams to ensure integrated approach.\nKnowledge of Project Management Institute methodologies and standards. Project Management Professional.\nSound judgment in executing plans and achieving future goals.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Muscat, Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}