{
    "Job ID": "69866667",
    "Description": "Apparel Category Team is looking for a smart, enthusiastic, hard-working, and creative candidate to join as a Catalog Specialist. This position offers an exciting introduction to the Amazon Marketplace and provides a training ground for success.\nYou will primarily be responsible for driving increased catalog data quality and solving challenging operational business goals. You will utilize data and develop creative processes to improve program team’s performance. You will directly work with program management teams to develop scalable, long-term solutions which will have a significant impact on internal and external stakeholders.\nOur environment is fast-paced, and requires someone who is a self-starter, detail-oriented, analytical, and comfortable working with multiple teams, partners, and management. The candidate should have a track record of delivering results, experience processing large amount of data and report generation & management. The candidate should be clear and use data to drive their communication with stakeholders. The candidate should be able to resolve issues with reduced guidance.\nA successful candidate knows and loves working with business intelligence tools, is comfortable accessing and working with big data from multiple sources, and passionately partners with the business to identify strategic opportunities and deliver results. The key responsibilities and expectations from the role are:\n· Create metrics and performance dashboards to measure KPIs\n· Drive root cause analysis and propose data-driven solutions\n· Engage with cross-functional teams for implementation of project/program requirements and troubleshooting\n· Managing multiple projects/initiatives\n· Communication at all levels with the ability to present information professionally & concisely with supporting data\nKey job responsibilities\n- Work on the solving variations issues\n- Work on solving catalog issues highlighted by the category team ex- title update, attribute update, size chart update etc\n- Proactively look for opportunities to improve catalog quality and solve\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- Bachelor's degree\n- Speak, write, and read fluently in English\n- Experience with Microsoft Office products and applicationsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}