{"Job ID": "69869108", "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.About Perkins:Globally recognized as a leading provider of electrical power generation, Perkins provide power for prime, standby, and critical applications. Our 400 to 2500 kVA engines are made in India at our Aurangabad and Hosur facilities. From data centers to hospitals and metro rail stations to commercial centers, our engines are trusted to provide the power you need, when you need it mostIn India, Perkins has invested in state-of-the-art manufacturing facilities in Aurangabad and Hosur to serve our valued customers in India and Asia. More recently the Aurangabad facility has also started manufacturing engines for some customers in the Middle East.Using our world-class Indian supply base, we provide customers with the engine they need, tailored to their specific requirements providing reliable power solutions for: Hospitals, Airports, Universities, Real estate, Data centers & Large manufacturing industries.None of this growth and development would be possible without our people. They are selected for their motivation, diverse expertise, and sharp customer focus. Add these valued competencies to their knowledge of India’s markets and culture and our team in India will always go that extra mile to ensure your expectations are met.JOB PURPOSE: To supervise the material planning and functions for the facility, ensuring material availability and POU availability and drive disciplined inventory systems usage and collaboraton with material suppliers.JOB RELATED STATISTICS:Annual facility supplier spend: Up to $250M# Facility Supplier Schedules / Releases per day: Up to 250# Facility work orders for worked material per day: Up to 25%Personnel: Up to 15 Mgmt and Salaried; up to 15 Contract/Agency, up to 10 HourlyJOB DUTIES:1. Material Planning Analysts.2. Plans and directs the material planning and material logistics functions to meet the facility plan objectives and satisfy customer needs. Interfaces with Operations, Business Resources, Global Purchasing Suppliers, Logistics, Engineering and worldwide Cat facilities.3. Plans, initiates, and maintains a material procurement process that establishes and achieves the least total cost, best quality and timely delivery for facility material purchases from internal/external suppliers.4. Includes managing inventory and record accuracy through monitoring shortage / surplus exception, supplier follow ups, negative on-hands and daily delivery performance.5. Develops and directs internal/external material flow planning. Implements efficient supplier and interplant Material supply plans. Meets production and parts requirements while optimizing inventory levels, lot sizing, lead times, packaging, and transportation costs. Provides direct support to manufacturing operations through managing incoming requirements and scheduling of production work orders.6. Implements and coordinates efficient supply-base management. Establishes and nurtures supplier relationships. Includes the identification and implementation of methods to assure suppliers are meeting Caterpillar's technological, communication, material delivery, financial management, and quality needs.7. Participates in supplier-quality improvement efforts. Provides material requirements expertise to Six Sigma projects and Lean Events as required.8. Selects, trains and while providing career guidance and opportunity for added experience and training. Develops staff skills by focusing on evaluative / analytical thinking, innovative approaches to problem solving and team building. The position is responsible for all personnel issues and performance evaluation of direct reports.Minimal Travel RequiredPOSITION IMPACTS: Incumbent is responsible to achieve corporate supply chain targets across InventoryLevel / Turns and point of use availability.JOB REQUIREMENTS:•Completion of Caterpillar Leadership Training•Knowledge and Understanding of 6 Sigma Project management skills•CPS Functional Job Role Qualified•APICS CPIM or CSCP National Certification highly desired•Strong analytical and problem-solving skills.•Ability to develop and deploy creative / original solutions to complex problems•Thorough understanding of company policies and procedures•Solid product knowledge•Supplier Relationship Management skills•College or university degree related to Supply Chain, or equivalent experience, is required.•Excellent interpersonal, communication and leadership skills•Able to work independently with minimal directionRequired Qualification:1. Degree in engineering with minimum 6 years of experience in manufacturing supply chain/logistics is required.2. Working experience in SAP MM is required MS-Excel proficiency is strongly required.3. Experience in handling import suppliers is required. Good communication skill (written & verbal) is required.4. Flexibility to extend normal work hour to attend meeting with US suppliers/stakeholders5. Zeal to follow up with cross functional teams, suppliers to get the work done is required.6. Working experience as people manager is required.7. Working experience in managing teams, stakeholder& international suppliers is required.Desired Qualification:1. A Bachelor/master’s degree is preferred2. Working experience with gunshot/engine manufacturers is preferred.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}