{
    "Job ID": "69867021",
    "Description": "Amazon's vision is to enable customers globally to find, discover, and buy anything online.\nWe are looking for a smart, results-oriented Associate - Site Merchandising to be a part of growing our business. The successful candidate will be responsible for planning and executing best in class site and email merchandising strategies. This role is based in Bangalore.\nAs an Associate - Site Merchandising you will ensure that customer experience and expectations are set and met to a high standard. He or she will execute and schedule content on emails, home pages, category pages, and pages across the site based on the instructions/inputs shared by Site Merchandiser. Also prepare a report on performance and traffic data to our management teams. He or she will assist in creation of new brand and product stores based on the inputs of the Site Merchandiser. This person will be involved in coordinating with the category managers, designers, and other editors in similar roles across the business.\n\nMain responsibilities will include:\n- Coordinate with multiple teams to provide thorough and authoritative category creative content\n- Owning sections of store merchandising and curations\n- Running and analysing proof of performance reports\n- Learning Merchandising tools and widgets\n- Assist execution of the plan as per site merchandising calendar. This includes email programs, new product launches, cross-category placements, developing and executing Amazon site-wide events, browse tree design and search results\n- Assist in developing merchandising for large storewide promotions, and work closely with category managers and merchandising team to schedule promotions\n- Support the creation of emails, category pages, brand stores, campaigns, and develop and manage free search improvement projects\n- Analyse relevant content/traffic metrics.\n\nThe Associate - Site Merchandising must be able to think and act both strategically and tactically. The ideal candidate will demonstrate the following:\n- Designing and executing online campaigns which improve customer experience\n- Strong communication skills; experience in coordinating teams and communicating to Category Managers\n- Strong bias for action and ability to prioritise\n- Ability to use hard data and metrics to back up feature and customer segment recommendations\n- Working independently on key deliverables\n- Aptitude for organisation, flexibility and producing results in a fast paced environment\n- Capability to meet our technical requirements, which include HTML, XML and Excel, plus the ability to learn our in-house tools quickly\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- Bachelor's degree\n- Experience designing and executing online customer experiences\n- Strong communication skills; experience in coordinating teams and communicating to senior management\n- Strong bias for action and ability to prioritise\n- Ability to use hard data and metrics to back up feature and customer segment recommendations\n- Aptitude for organisation, flexibility and producing results in a fast paced environment\n- MBA/Masters degree\n- 2+ years of experience\n- Demonstrated ability to use hard data and metrics to back up feature and customer segment recommendations\n- Capability to meet our technical requirements, which include HTML, XML and Excel, plus the ability to learn our in-house tools quicklyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}