{"Job ID": "69869119", "Description": "At Trane TechnologiesTM  and through our businesses including Trane® and Thermo King®, we create innovative climate solutions for buildings, homes, and transportation that challenge what’s possible for a sustainable world. We're a team that dares to look at the world's challenges and see impactful possibilities. We believe in a better future when we uplift others and enable our people to thrive at work and at home. We boldly go.Job Summary：The Engineer will lead simple to complex projects or phases of a project to ensure the completion of milestones against a committed timeline. Projects could be NPD, NTP, Q&R, Productivity, RTS type. This role calls for collaboration with cross-functional & multi-location teams to ensure that the projects are accomplished to high quality, adhering to our standard processes, systems, and project management principles, while remaining aligned with the strategy and goals of the organization.Responsibilities: Understand project requirements, collaborate with project owners, leaders & cross-functional teams across the globe for the delivery of projects, by adhering to standard processes, systems, and project management principles.\nEnsure the completion of project milestones/deliverables within committed Quality (Q), Delivery (D), Project cost (C) &Product cost (C) targets.\nProficient in Project management.\nAbility to solve technical problems, identify solutions, participate in concept reviews, critical design reviews, other technical discussions with the global team. Able to handle multiple projects at the same time.\nDevelop concepts, design/select & develop components along with suppliers, develop component specifications for structural component (metal, non-metal) and assemblies, DFMEA and test plan.\nCreate and release of engineering documentation using PLM & PDM softwares like ProE & Windchill. (Design, Drawings, Bill of material, and Specifications).\nCo-ordinate with cross functional team to implement design changes.Qualifications:BE degree/ Masters in Mechanical / Auto mobile/ Mechatronics engineering with good academics.\n5+ years hands on experience in component selection, system integration, concept development, design calculations, design engineering in the domain currently working.Key Competencies: Good understanding of the basics of engineering.\nDemonstrates ability to get to root cause and to take effective action to solve problems. Hands on experience with problem solving tools.\nExperience in product design, development process/phases; Hands on experience in DFMEA and test plan development. Exposure to prototype/engineering builds & testing.\nGood Knowledge of metal & Non-metal component design, assy, Mfg process.\nBasic knowledge in refrigeration components & systems. Basics of Electrical system / components would be added advanatage.\nBasic knowledge in understanding material properties for materials selection considering application requirements.\nGood understanding of GD&T for design application considering manufacturing process & tooling limitations.\nDemonstrates innovation & initiative approach at work, ability to develop new methods and approaches.\nFosters effective teamwork where people work together to achieve common goals. A strong team player that is capable of working with others.\nExcellent communication skills. Demonstrates the ability to communicate ideas and results in a clear and concise manner.We offer competitive compensation and comprehensive benefits and programs. We are an equal opportunity employer; all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, pregnancy, age, marital status, disability, status as a protected veteran, or any legally protected status.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}