{
    "Job ID": "69866790",
    "Description": "Role PurposeAs a Sales Operations Business Analyst, you will participate in, and program manage campaign and market sentiment analysis. You will be key to providing the team with actionable insight to drive business success.While mostly focused on data, you may be involved across the entire project lifecycle, including presales through to campaign execution and performance management and sales conversions.An integral part of your role will be working with the team to optimize digital marketing campaigns through Salesforce Marketing Cloud usage and across all marketing channels including offline events.You will act as a trusted source of knowledge to advise clients in line with Marketing Cloud best practice and its growing number of capabilities to ultimately build a vision for a multi-channel roadmap.KEY ACCOUNTABILITIES & ACTIVITIESTROJENADocumentationAn efficient business analyst holds the proficiency to collect and keep information organized. Analysis: You must be able to analyze the needs, the gaps, the process, and hypothesize the solution.\nProblem-solving and analytical thinking using varied data sets including market trends, sales data and marketing campaign data\nData and numerical analysis on data sets from different platformsData ManagementYou should be able to deal with lots of data and you must understand handling it efficiently.\nYou should be able to understand how to analyze the data patterns, avoiding duplicates and recommend best practices (data-led-decisions)Problem SolvingThe ability to see a problem and make quick decisions with limited information. \nRecommend approaches to solve for reporting challenges over a project life-cycle including campaign optimization and customer profiling.Project ManagementPlan, execute, allocate, deliver, resolve and take on the changes suggested by internal stakeholders.\nClearly communicate complex findings to a varied audienceTestingExecute and analyze testing programs (UAT)\nAnalyze campaign performance.\nRecommend areas of improvement based on clearly communicated analysisBACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and ExperienceCRM: Salesforce Marketing Cloud or comparable marketing automation platform\nMarketing: Salesforce Sales Cloud or comparable CRM platform\nTracking/monitoring: Google Analytics and/or Sprinkler or comparable tracking and listening platforms\nAnalytics Platforms: Lytics, Tableau, PowerBi, Teallium, Datorama\nLead requirements gathering, data analytics, campaign reports, reporting framework setups and writing statements of work,\nCommunicate project concepts, reporting/analytics results and outcomes to client project stakeholders around areas such as ROI\nStrong understanding of digital marketing KPIs, such as email marketing, PPC and other marketing conversion metrics\nExperience in helping foster a culture of analysis- and data-driven thinking to support decision making.\nExpertise in SQL and ETL processes for management of data management tooling.QualificationsBachelor’s Degree in Marketing/Digital Marketing/Data analytic/Finance or comparable experience\nCreative customer campaign analysis background is preferred (with experience on major real estate development projects).\n4 years’ + hands-on experience with digital marketing database platforms/tools with understanding of offline marketing and sales metricsPreferrable: Relevant industry/platform certs for Analyst and SQL/Python proficiencyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}