{
    "Job ID": "69866745",
    "Description": "OVERVIEWPositionFinancial AnalystJob CodeReports toDirector of Business Planning and StrategyDirect ReportsnilDivision/SectionFinanceDepartmentTrojenaSectorTROJENAJob FamilyFinanceRole PurposeTo work within the Trojena finance team in order to deliver financial and management reporting and all associated tasks.KEY ACCOUNTABILITIES & ACTIVITIESAccountable to the Director of business planning and strategy on all deliverables.\nTo support the FP&A manager and Management Accountant in order to meet set objectives as well as on demand analysis and reporting.Interface and main point of contact with shared services on payments, POs , SAP system.\nAssist in month end financial reporting process, accruals,  management accounts and explain variances.\nAssist in production of monthly cost reports for each budget holder.\nWorking alongside other finance team members to monitor loan facilities and compliance.\nRaise POs , PRFs and co-ordinate with Procurement team as needed.\nMonthly review of opex and capex , SAP General Ledger , month end accruals\nLeading all accruals for Opex and to coordinate with the stakeholders/ Project Managers.\nLeading all the actuals and be the point pf contact in related to all the Opex invoices and to coordinate with AP.\nUpdate and amend the Opex forecast to align with the program and the Procurement plan.\nChase all suppliers to upload their invoices after it’s been approved internally.\nSend all SES to the projects managers and get their approval on the SES along with upload the deliverables in the SharePoint.BACKGROUND, SKILLS & QUALIFICATIONSKnowledge, Skills and ExperienceAbility to work independently and proactively\nAccounting and Finance experience / qualification\nPower point and Excel skills in order to present outputs to Director and executive management.\nTeam player and result oriented , good commercial sense.QualificationsBachelors degree in accounting / finance  or a professional accountancy qualification such as ACCA, CIMA, ACACOMMUNICATION - MAIN STAKEHOLDERSInternalExternalDirector of Business Planning and Strategy\nTrojena finance team\nTrojena proponentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}