{
    "Job ID": "69866800",
    "Description": "Amazon is looking for a Business Analyst in the Hardlines category team. This opportunity is ideal for candidates looking to have a steep learning curve, expand their knowledge of retail, e-commerce & customer behavior, and derive insights from data to influence key business decisions for Amazon customers and derive continuous improvement using data analysis.\nAre you customer obsessed, flexible, smart and analytical, strategic yet execution focused and passionate about e-commerce, then come join us in our mission “to be Earth’s most customer-centric company, where customers can find and discover anything they might want to buy online, and endeavors to offer its customers the lowest possible prices”.\n\nKey job responsibilities\nA Business Analyst role in the Category team is a high visibility role who works with multiple stakeholders and teams across the org to derive insights from data and support day to day business decisions.\nSome of the key result areas include, but not limited to:\n1. Own the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisions\n2. Ensure data accuracy by validating data for new and existing tools. Learn and understand a broad range of Amazon’s data resources and know how, when, and which to use and which not to use.\n3. Work closely with category, customer service, marketing and finance stakeholders to understand the business requirements and provide analyses.\n4. Understand trends related to Amazon business and recommend strategies to stakeholders to help drive business growth.\n5. Identify, develop, manage, and execute analyses to uncover areas of opportunity and present written business recommendations that will help shape the direction of the business.\n6. The ideal candidate actively seeks to understand Amazon’s core business values and initiatives, and translates those into everyday practices.\nAbout the team\nHCTP Category Excellence team is a group of highly motivated and dedicated individuals from diverse backgrounds. The team takes pride in improving the experience of millions of customers on a daily basis by aiding them in making an informed purchase decision and providing customers with a seamless post purchase experience on all types of high consideration technical products. The team has high visibility across the org and is an ideal place for individuals to grow and utilize their full potential.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- 2+ years of data analytics or automation experience\n- 2+ years of business analysis (dealing with large complex data) experience\n- Bachelor's degree\n- Experience with data mining tools like SQL, SAS, SPSS, or similar\n- Experience with Microsoft Office products and applications\n- Experience working directly with business teams to utilize metrics and analysis to determine improvement opportunities\n- Experience in e-commerce, retail or advertisingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}