{"Job ID": "69868534", "Description": "HSBC is one of the world’s leading banks, with a network covering 62 countries and territories. Our global reach means we offer many ways for you to develop your career. We offer an inclusive, values-led culture, tailored learning and development programmes and competitive benefits.OUR STRUCTUREOur network covers both established and emerging markets across Europe, Asia-Pacific, Middle East and North Africa, North America and Latin America. Within these markets, we serve our customers through our global businesses: Commercial Banking, Global Banking and Markets, Global Private Banking, and Retails Banking and Wealth Management.The Internship Programme is 6 months’ programme offering ‘on the job’ training experience in a fast paced dynamic environment. Interns will go through training program where the programme will equip them with professional, technical and soft skills. We will also engage (BIBF) to support the training. When not in training, interns are expected to spend the majority of their time performing work to support Managers with business as usual (BAU) & non-BAU activities, cyclical work pieces such as reporting, governance, short term initiatives and project work.The role incumbent is not client facing and does not have any portfolios.We have internship opportunities in the following business areas:1. Global Banking and MarketsHSBC Global Banking and Markets provides financial services and products to corporate, governments and financial institutions. We offer a full range of banking services to support clients and continue to invest in digital capabilities to serve them effectively.2. Commercial BankingHSBC Commercial Banking operates in around 54 countries and territories, covering the developed and developing markets that matter most to our customers. Through our teams of relationship managers and digital capabilities we connect entrepreneurial business to opportunities.3. Wealth and Personal BankingWealth and Personal Banking team help customers to manage their day-to-day finances and to manage, protect and grow their wealth. Our international network and breadth of expertise enable us to support individuals, families, business owners, investors and entrepreneurs around the world.4. Digital Business ServicesOur Digital Business Services (DBS) teams are the foundation of HSBC, providing essential support across technology, operations and key central business services for our global business and functions. We play vital role in driving great experience for customers and colleagues and enabling the bank’s strategy.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Manama, Bahrain", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}