{
    "Job ID": "69869807",
    "Description": "Role PurposeThis is a hands-on role and the holder will equally provide configuration to Dynamics 365 F&O, CE and HR modules as well as assisting in the implementation and support of Dynamics 365 solutions. This role requires strong communication to non-technical audience and the holder needs to be able to work at a Strategic level as well as have hands on tactical and operational skills to define work and trouble shoot / resolve issues in an effective way.Role tasks and responsibilities- Working closely with the D365 Solution Architect to support the delivery of D365 initiatives - with a stronger focus on F&O\n- Working with the Business Teams to understand opportunities / requirements, develop user stories in DevOps (or ITSM) and define product backlog\n- Inspiring the business through demonstrations of the possibilities of D365 F&O (more important), CE & HR modules and their wider capabilities / integration to meet Control Risks needs and strategic ambitions\n- Maximizing the use of D365 F&O, CE & HR partnerships and take a configuration first approach within the system vs overly customised. Striving for a vanilla solution wherever possible\n- Supporting the teams with regression testing of solution, UAT, and training. Debugging bugs\n- Developing functional designs, test plans and scripts where applicable\n- Driving innovation such a building, customizing and configuring the system as well as utilizing for example Power Platform into your POC solutions\n- Go-live and post-live support\n- Resolving tickets and issues raised by Business Teams in accordance with internal service levels, processes, and procedures\n- Preparing and representing D365 F&O, CE & HR changes at CAB\n- Advising customers on best practices for D365 F&O, CE & HR processes, user interface and architecture\n- Advising on complex D365 F&O, CE & HR cases and proposing comprehensive solutions\n- Working with Strategic Transformation teams on ad hoc projects as a SME utilisation resource from Enterprise Apps team to complete project tasks on time and within budget\n- Developing solutions that improve the efficiency and capability of F&O system users\n- Implementing product best practices based on Microsoft Dynamics standards and supported configurations\n- Become the subject matter expert in cross-functional projects to represent the requirements and expectations of the tech and business teams.\n- Help and guidance with training SME’s in areas specific to their BAU activities\n- Working closely with the D365 technical delivery manager on areas that require further engagement with the business\n- Working with the business SME’s, help with knowledge, answer questions, drive a knowledge base\n- Supporting on surrounding application projects\n- Help contain and manage DevOps items and ensure awareness of risks and work items being delivered is given to the managers\n- Assisting in the platform releases (upgrades) with regression testing and working with the business to arrange functional tests\n- Data migration: Assist with the facilitation of data sets for ETL activities, working with the business teams\n- Facilitate the collection of diverse data sets from different sources and provide insight into the data based on business needs/requirements. Translate data analysis into impactful insights.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}