{
    "Job ID": "69869556",
    "Description": "BUSINESS INTRODUCTION\nMajid Al Futtaim Retail is the leading shopping mall, retail, communities, entertainment developer and operator in the Middle East, North Africa, and Central Asia regions. With over 48,000 people, revenues of over US$ 11 Billion, and operations in 18 countries. Some of the iconic brands we carry include Mall of the Emirates, Carrefour, All Saints, Lego, City Center, Abercrombie & Fitch, & Vox Cinemas. We believe in making Great Moments for Everyone, Every day.JOB TITLE\nInnovation Chef | MAF Retail | Hypermarket UAE\n\nROLE SUMMARY\nThe Innovation Chef is responsible for supporting the development management team on the development of new products and ranges and take full accountability of the documentation from concept to launch.\n\nROLE PROFILEDevelop food concepts in line with customer feedback/needs, business plan and agreed upon critical path.\nTake full accountability of recipe creation and documentation at product level including packaging.\nPrepare samples for transit trials and travel tests for all dishes.\nMonitor concept costs and ensure they adhere to agreed margins & targets. Ensure all costings are updated at each stage of development up to launch.\nWork closely with procurement & technical teams to ensure all new raw materials meet agreed specifications & parameters. Communicate with B2B once samples are approved so that they can be created.\nLiaise with Operations Manager to draft proposed labor for all projects.\nAssist Operations Manager with product routing.\nComplete “Raw material/ Recipe change” forms for any changes to recipes or ingredients and ensure these are approved in line with internal procedures.REQUIREMENTSFormal culinary qualification or 5+ years’ experience in premium restaurants/ hotels.\nPrevious 2 years food manufacturing experience in the UK, US or Europe (desirable)\nChilled food manufacturing or high volume catering experience (essential)\nExperience in Food manufacturing is a must.\nFluent communication skills in English (writing and speaking)\nUp-to-date with food and beverage trends and best practices.WHAT WE OFFERAt Majid Al Futtaim, we’re on a mission to create great moments, to spread happiness, to build, experiences that stay in our memories for a lifetime. We’re proud to say that over the past 27 years, we have built a reputation as a regional market leader in what we do. Join us!\nWork from any country in the world for 30 days a year.\nWork in a friendly environment, where everyone shares positive vibes and excited about our future.\nWork with over 50,000 diverse and talented colleagues, all guided by our Leadership Model.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}