{"Job ID": "69866823", "Description": "NEOM is a new vision of what the future could be. It’s an attempt to do something that’s never been done before and it’s coming at a time when the world needs fresh thinking and new solutions. Put simply, NEOM will not only be a destination, but a home for people who dream big and who want to be part of building a new model for sustainable living. NEOM will be a hub for innovation, where established global businesses and emerging players can research, incubate, and commercialize groundbreaking technologies to accelerate human progress.Role Purpose:The Regional Manager of Design and Architecture assists the Regional Hospitality Director for NEOM’s Hotels Sector, and provides support for other key sector assets. Responsible for leading the management, coordination, and optimization of the design of the Region’s hospitality asset’s within NEOM, from project inception to delivery and handover, including the interfaces with related infrastructure assets.Key Accountabilities:Provide initial facilities area programs aligned with hotel feasibilities.\nAssist Regional Hospitality Director in establishing hotel the vision and strategy for new and existing masterplan projects.\nProvides technical inputs on design vision, project positioning, scope requirements, and project schedules for initial planning.\nAssists and reviews the risk mitigation measures, to ensure that the project completion and timelines are met.\nManages internal and external teams to ensure that feasibility, program, design, technical, quality and specifications of the projects are achieved through to completion and handover.\nReviews the specific asset development and design briefs to reflect project intent and objectives.\nProvides inputs and reviews with the operator negotiations as they relate to the Technical Services Agreements with Operators.Ensures that the design aspects of the proposed masterplan, phases and individual assets meets NEOM’s and NEOM Hotels business vision and strategy.\nPrepares, updates and revises area summary, design briefs, operating criteria, design standards and outline of consultant’s scope of responsibilities.\nParticipates in, and directs consultants through concept design, schematic design, design development, construction documents, and post-opening deficiency phase.\nAssists in the selection of all consultants and reviews their description of scope of services.Meets with consultants to review the design brief and operating criteria & design standards.\nReview consultant’s responsibilities, budget controls and reporting functions.\nProvides detailed direction to the specialist consultants - kitchen and laundry designers, IT, audio visual, acoustic, lighting, landscaping, etc.\nPrepares the delivery strategy of the hotel developments, coordinates with and integrates the input from other support functions; technical, legal, finance, market research, sales, and marketing and operations, to deliver the project development plan.\nInstruct, organize, and coordinate all development disciplines with the objective of harmonizing the diversified functions, to deliver completed projects in accordance with the objectives established in the approved business plan.\nCoordinate and integrate the development schedules of various stakeholders into the development program to ensure cohesion and alignment\nHolds responsibility for the quality of product delivery at masterplan, concept development, detailed design development, construction, and where required fit-out stages.\nEstablishes procedures for maintaining high standards of quality, reliability, and safety in project designs, by implementing and maintaining design control systems and monitoring procedures for contracted architects.\nDevelops reporting procedures on the progress of the designs.\nProvides advice and expertise on improving product / asset designs and minimizes any risk factors.\nEvaluates and develops improved techniques for the control of product designs, quality, reliability, and safety.Liaise with Operators technical teams to ensure TSA review process is adhered for NEOM contractual obligations.\nMonitors the construction and execution of projects, from initial stages of construction through to substantial completion.\nEnsures the commitment to safety, environment, social responsibility, quality assurance and control are maintained to achieve the integrity of the hotel projects under construction.\nBrings projects to a successful completion and provides leadership and guidance throughout all phases of the project.\nAssists owner’s consultants, contractors and project management teams on value engineering sessions when required.\nWorks with the project managers to prepare the handover schedule and keeps this updated.\nEnsures the NEOM brand standards and product standards are incorporated into all projects, and the integrity of the design standards are adhered to.\nEnsures the professional development of staff, and ensures they keep abreast of technical developments, relevant regulations, and industry best practices.\nResolves conflict and evaluates information for more in-depth relevant information for decision-making.\nSet objectives/ KPl’s / milestones for the respective department / function and conducts appraisals for any direct reports.\nTo seek opportunities to join professional hotel design related associations, to keep abreast of new technology and hotel design issues.Qualifications:Bachelor’s degree (from accredited professional program) or Master’s of Architecture, Engineering, Interior Design, or Construction Management;\nProfessional licensing (NCARB, AIA, RIBA) is a plus.\nLEED Accredited or other sustainability certifications are strongly encouraged.15+ years’ experience within the hotel and development sectors.\nExperience with international operator, and developer experience is preferred.\nKnowledge of hotel operations including Front of House and Back of House planning.\nStrong knowledge of\nMust have extensive knowledge of hospitality design and processes required to assist in contract negotiations, oversee design development, ensure construction is in line with brand standards.\nProficient with technical software (AutoCAD, Microsoft Project, Primavera, MS Suite, etc.)\nProven track record in delivery of hotel projects.\nStrong leadership and organizational skills.\nAbility to think cross-functionally to assist hospitality team members.\nPositive and agile personality with an ability to work in a dynamic environment.\nProfessional proficiency in English (written and verbal)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}