{"Job ID": "69866777", "Description": "SummaryThe Site Manager plays a crucial role in overseeing the daily operations and activities at the ENOWA power generation project sites. The Site Manager ensures that construction and operational activities are executed efficiently, safely, and in compliance with all relevant standards and regulations.Key Accountabilities and ResponsibilitiesEngineering Management       Supervise daily site activities, ensure tasks are performed on schedule, within budget, and adhering to established quality standards.\nCoordinate with project stakeholders, including engineers, contractors, and suppliers, to ensure streamlined operations.\nFollow-up to ensure work progress is meeting the schedule.\nReviewing field designs and drawings where needed.\nImplement and enforce site safety protocols, ensuring a safe working environment for all personnel.\nConduct regular safety drills and provide safety leadership/training for the workforce.\nOversee the allocation and utilization of site resources, including manpower, machinery, and materials.\nIdentify resource shortages or inefficiencies and address them proactively.\nAct as the primary point of contact for onsite issues, addressing concerns from staff, contractors, and external stakeholders.\nProvide regular progress updates to senior management and other stakeholders.\nOversee on-site quality control measures, ensuring that construction and operational activities meet or exceed industry standards.\nCollaborate with the Quality Manager to address any quality-related issues.\nMonitor site expenditures, ensuring activities remain within the allocated budget.\nSwiftly address and resolve on-site challenges, leveraging expertise to ensure minimal disruptions to project timelines.\nFacilitate collaboration among teams to tackle complex site issues.\nProblem-solving and coordination on-site, a key to the position.\nEnsure that the construction schedule is followed and put in place corrective actions with the contractors in case of delay.\nInterfacing with the design team when required.\nKeep the Project Manager updated regularly on progress.\nOrganize and coordinate the contractor's intervention on site.\nNotify and schedule vendor representatives and equipment/system specialists.\nParticipate in weekly project review meetings.Background, SkillsProven experience during construction and operational practices related to power generation projects and sites.\nProven leadership and team management abilities.\nStrong problem-solving, organizational, and decision-making skills.\nEffective communication capabilities for liaising with diverse stakeholder groups.\nFamiliarity with industry-specific tools, machinery, and software would be advantageous.\nBasic knowledge of computer applications such as Word, Outlook, Excel, etc.\nKnowledge of local companies would be beneficial as well.QualificationsBachelor’s degree preferred but not required, or a min of 15 years of experience in Construction Management, preferably turbine experience.\nPrior working experience on generation projects of 10 years for site management.\nRelevant professional certifications, such as Project Management Professional (PMP) or Certified Construction Manager (CCM), would be beneficial.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}