{
    "Job ID": "69867736",
    "Description": "Senior Analyst, TMCB-(2300017139)Job:OperationsPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:27/Sep/2023, 1:18:16 PMUnposting Date:02/Oct/2023, 10:59:00 PMThe Role ResponsibilitiesProcessesManage and / or resolve alerts / cases:\nFollow the Correspondent Banking DOI to process risk events in line with the Assess, Analyse, Act (AAA) process.Risk ManagementAnalyse significant financial crime risk events (e.g. non-compliant transactions, production orders) to ensure that all connected parties, particularly cross-border are identified and reported at the appropriate levels internally across all relevant jurisdictions.\nApply Group and FCC policies and processes (AML surveillance, client screening, risk assessment) to manage risks.People and TalentPromote and embed a culture of openness, trust and risk awareness, where ethical, legal, regulatory and policy compliant conduct is the norm.GovernanceIn the event of serious regulatory breaches, or where risk tolerances have been breached, ensure senior management are informed and that actions are taken quickly to remediate and / or activities are ceased.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the FCSO to achieve the outcomes set out in the Bank’s Conduct Principles: Fair Outcomes for Clients; Effective Operation of Financial Markets; Financial Crime Prevention; The Right Environment.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key StakeholdersFCC Controls representatives in group and country.Other ResponsibilitiesEmbed Here for good and Group’s brand and values in FCSO.\nPerform other responsibilities assigned under Group, Country, Business or Functional policies and procedures.Our Ideal Candidate2 - 4 years of relevant work experience inAML and terrorist financing surveillance skills in relation the respective country jurisdictions and client types.Analysis SkillsAble to analyze data trends and out of pattern activities, working knowledge of Internet and MS Office Suite and independently assimilate, analyse and evaluate information from disperse data sources to determine a course of action (e.g. case closure or escalation) and record and communicate this decision clearly and concisely.BankingKnowledge in terms of customers, products and transactions with expertise in at least one customer segment (retail, corporate, private banking, correspondent banking).\nBanking operations experience (Client Due Diligence, payments, trade, markets or other) and service oriented attitude.\nExcellent communication skill (articulation and writing).Role Specific Technical CompetenciesCompliance Policies and Standards\nCompliance Advisory\nSurveillance (including Screening and Monitoring)\nInvestigations­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\nBe better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long termIn line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locations\nTime-off including annual, parental / maternity (20 weeks), sabbatical (12 weeks maximum) and volunteering leave (3 days), along with with minimum global standards for annual and public holiday, which is combined to 30 days minimum\nFlexible working options based around home and office locations, with flexible working patterns\nProactive wellbeing support through Unmind, a market-leading digital wellbeing platform, development courses for resilience and other human skills, global Employee Assistance Programme, sick leave, mental health first-aiders and all sorts of self-help toolkits\nA continuous learning culture to support your growth, with opportunities to reskill and upskill and access to physical, virtual and digital learning\nBeing part of an inclusive and values driven organisation, one that embraces and celebrates our unique diversity, across our teams, business functions and geographies - everyone feels respected and can realise their full potential.Recruitment assessments - some of our roles use assessments to help us understand how suitable you are for the role you've applied to. If you are invited to take an assessment, this is great news. It means your application has progressed to an important stage of our recruitment process.Visit our careers website www.sc.com/careersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}