{"Job ID": "69866799", "Description": "Come help us create a better everyday life for the many people. That’s the IKEA vision. We do that by offering a wide range of home furnishings with good design and function at prices so low that as many people will be able to afford them.Do you value simplicity, cost-consciousness, a humble attitude and willpower? Then an IKEA career may be right for you.We strive for excellent leadership to lead business and people together. We believe people learn and develop best when they perform and deliver in the real world.PURPOSE OF THE JOB: To monitor the CCTV system to report any loss/theft & safety & security incident.ASSIGNMENT:Monitor that all items passing the checkout counters are checked randomly to make sure they are paid for. Transactions size should be consisted of 30 transactions per cashier.Monitor the general condition for the store all the time to make sure it’s secure.Monitor all checkout areas during prayer time to ensure no unpaid merchandise leaves the premisesMonitor that all emergency exits are not obstructed. If found obstructed report to Rasid Leader who should inform IKEA duty manager.Monitor the money delivery process to make sure it is safe and secure. Wherever the CCTV coverage is applicable.Monitor all type of emergency cases, and report them.Monitor any unusual condition, and report it. Customer/co-worker accessing unauthorized area, Suspicion of harassment, Suspicion of theft…Monitor when the panic alarm lights on and inform the security leader immediately.Monitor the product handling operation in logistics night time especially, and report any incident observed.Review cameras when customer complain for any loss.Make spot check for cashiers to review their operations. Such as cash handling, scanning items and imputing right stock quantities.Report any damages on CCTV equipment’s.Register, log and report all the operations and incidents, and archive them in their proper files.Have knowledge about body language and alert signalsAble to work under high pressure.Investigate about any unusual condition (cars or customers). If a car is parked in the drive ways blocking entrance/exits guards/CCTV operators should be able to spot them and investigate it through the Guards on the floor.In case of emergency immediately coordinating with concerned responsible.Making follow up with Contract Company, in case of cameras are damaged or out of orderArabic & English Language proficiency intermediate level is must.Computer Literary.Work experience in a Similar function is preferred.- Preferable Osha ( 30 Hrs).- Saudi ( to comply the governmental regulations)  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}