{
    "Job ID": "69869675",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:Responsible for pre-qualification of materials/products before installation as well as for all inspection and testing in accordance with the Contract Specifications and Quality Control Plans, in order to ensure the final quality of the work. Acts as the primary contact with the official laboratories, with a particular focus on preparation of test samples, their transmission to official laboratories for analysis, and verification of compliance of the certificates issued by official laboratories with specifications. An Entry Professional (P1) applies broad theoretical job knowledge typically obtained through advanced education. May require the following proficiency: Work is closely supervised. Problems faced are not typically difficult or complex. Explains facts, policies and practices related to job area. Support SCM function to drive localization of various products and components as per TLC guidelines.ResponsibilitiesSupplier Qualification-Drives the supplier qualification process and ensures supplier base is fully qualified and compliant. Schedules, monitors and approves supplier parts and service qualification activities. (e.g. Production Part Approval Process (PPAP), Supplier product qualification process, capacity analysis and verification in accordance with Hitachi Energy Project timing and milestones.\nSupplier assessment- Plans and conducts, supplier assessment including reporting and findings for major and minor opportunities for improvements and verifies effective closure of assessment findings by the supplier.\nSupplier development-Develops and support suppliers to achieve ongoing conformance with Hitachi Energy requirements and continual improvements in quality.\nSupplier performance monitoring – Monitors and reports supplier performance quality issues, NCR and identify development action accordingly Hitachi Ene quality metrics.\nSystem development and utilization- Define and develops local quality procedure for various material categories as per Group/Division/Business Unit instructions and procedures where appropriate.\nSupport initiatives / audits launched by Group function / Division on Sustainability, Material compliance, Integrity and Health, Safety and environment\nCollaboration with other functions SCM, Quality, R&D , Engineering etc.Requirements:Graduate Mechanical Engineer with strong technical background\nRequire a deep understanding of supplier development with quality back ground with 5 to 7 years of experience in mechanical/electrical components and related products.\nKnowledge of handling casting, forging, welded & machining parts and experience / background on Metal Finishing (surface treatments) is an added advantage.\nISO Supplier audits qualification from DnV or BV\nGood knowledge of various tests done by laboratory\nKnowledge of supplier product qualification process, and quality assurance is must.\nSpoken and written English, cross-cultural understanding skills are required.\nExcellent collaboration and work within team skills will help you to succeed in this position.\nConversant with SAP \nWilling to travel.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}