{"Job ID": "69868576", "Description": "Job description:The Field Services Outside Sales Representative is accountable for the promotion and sales of a broad range of technical services including the start-up, maintenance, testing, retrofit, upgrade and digital Services of all major manufacturer's electrical equipment installed at the customer’s site. The Outside Service Sales Representative is also accountable for the selling of turnkey projects ranging from simple replacement of equipment to fully engineered solutions. This position is responsible for developing and maintaining relationships with new and existing Schneider Electric customers to identify the scope of work, estimate and sell system adds/modifications and maintenance agreements so as to meet or exceed his/her profitable sales target. The Field Service Sales develops new sales opportunities and addresses and services the needs of established accounts, utilizes excellent products/solutions/services and customer knowledge to educate customers on pricing and application advantages, and how they meet customer's needs. Creates Field Service Service proposals, and close them facing the customer. He/she interacts with the account manager from the Business Units, and also with Field Service Inside Service Sales Representative and Field Service Operational Marketing. He/she will have to increase the mix of Service Plans sales as a top priority.Essential Responsibilities:Develops account profiles and executes the sales plan. \nApplies market and account skills necessary for dealing with specific target audiences.\nIdentifies and contacts potential customers or prospects, either existing or new.\nSecures customer satisfaction overseeing all ongoing activities with the customer (orders, delivery..)\nUtilizes BFO (Salesforce.com) for sales funnel management and for Account Planning.\nProvides monthly forecasts and summaries in a timely manner.\nParticipates in the preparation of analysis and reports on field service performance.  \nWorks closely with tendering team to ensure the respect of Field Services expected margin.\nWorks closely with Inside Service Sales Representatives and the BU account manager to maximize business opportunities.\nIs “feeding” the Field Services Marketing leaders with Offers feedback and needs\nEducates customers on all SE products and services with special attention on Recurring and digital Offers\nProvides mentoring, coaching and guidance to other sales employees\nCoordinates and/or attends trade shows and marketing/sales seminars as neededMain interactions:Field Services Sales Team, Customers, Field Services Vice President, Field Services Operational Marketing, Inside services sales, BU/Country account managers, Business developers, Services BureauKey Success Factors:Good working relationship and regular coordination with all Account Managers (incl. GAM/KAM) for opportunities identification and support\nRegular collaboration with Field Services Operational Marketing team for thorough understanding of country Installed BaseQualifications:The successful candidate should have a (4-5) year college degree or equivalent work experience in the sale of winders and (3-10) years technical sales experience.\nInside sales or CCC experience is a plus\nAbility to build a sustainable and reliable relationship with the customer. The concept of Customer Intimacy is critical in Field Services.\nExcellent verbal and written communication skills including C-level customers\nThorough knowledge of Schneider Electric services offers throughout the Asset Management Life Cycle of the product. \nProficient in Microsoft Office suite and ERP/CRM related tools.  \nExcellent organizational skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Algiers, Algeria", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}