{
    "Job ID": "69869086",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.Job Description:We are seeking a highly motivated and detail-oriented Category Buyer with a focus on Supplier Evaluation and selection. In this critical role, you will be responsible for establishing a structured process for identifying and onboarding new suppliers, particularly in medium to high complex categories such as engine components, fabrications, tubes, harnesses, electrification components, and more. Your primary responsibilities will include competitive benchmarking, comprehensive market research, initial supplier assessment, and supplier qualification. This role plays a pivotal part in ensuring a robust and diverse supplier base to support our business needs while understanding the requirements of internal stakeholders.Responsibilities:Market Research and Competitive Benchmarking:Conduct comprehensive market research to identify potential export-worthy and self-sufficient suppliers in critical categories. Perform competitive benchmarking to evaluate suppliers' capabilities, pricing, and market positioning.Supplier Identification and Assessment:Scout for new suppliers that align with our business requirements and quality standards and are export-worthy and self-sufficient. Assess and qualify potential suppliers based on criteria such as quality, capacity, financial stability, and technical capabilities.Supplier Relationship Management:Build and maintain strong relationships with selected export-worthy and self-sufficient suppliers, fostering open communication and collaboration.Collaborate with suppliers to establish mutually beneficial terms and conditions.Stakeholder Management:Engage with internal stakeholders, including engineering and procurement teams, to understand their supplier requirements and expectations. Ensure that supplier development initiatives align with and support internal stakeholder needs.Supplier Development:Collaborate with export-worthy and self-sufficient suppliers to develop and improve their capabilities, quality, and delivery performance. Identify opportunities for supplier innovation and continuous improvement.Cross-Functional Collaboration:Work closely with cross-functional teams to align supplier selection with business goals, internal stakeholder requirements, and the goal of identifying export-worthy and self-sufficient suppliers.\n Qualifications:Bachelor's degree in Business, Supply Chain Management, Engineering, or a related field (Master's preferred).\n6 Sigma Black Belt experience would be preferred.\nProven experience in procurement, supplier management or strategic sourcing, with a focus on evaluating and selection of suppliers.\nStrong analytical skills, including market research, data analysis and financial evaluation.\nExcellent negotiation and communication skills, with the ability to build and maintain effective supplier relationships.\nKnowledge of Engine Categories, manufacturing processes and supply chain dynamics.\nAbility to work collaboratively across Global cross-functional teams and drive results in a fast-paced environment.\nStrong project management skills and attention to detail.Join our team and play a pivotal role in shaping our Purchasing footprint in Asia by identifying and onboarding self-sufficient suppliers to meet our growing capacity needs. If you're a strategic thinker with a passion for supplier relationship management and team leadership, we'd love to hear from you.Caterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}