{
    "Job ID": "69865768",
    "Description": "Job PurposeThe purpose of this job is to supervise the manufacturing operations of Tablet manufacturing and filling so that products are delivered and supplied in full and on time to the patients at the end of our supply chain.Education, Experience & SkillsPharm-D\n\n2-3 years of experience in a similar role.\n\nTo efficiently perform production related activitiesKey ResponsibilitiesEnsure Safety of the area with Zero Waste Promotions and ZAP & ZIP reporting.\n\nEnsure strong compliance in Quality, EHS, Legal and other critical parts of the business related to the area responsibilities i.e. Change control, Deviations & Management/Monitoring L1, L2, L3 & L4.\n\nEnsure Data integrity compliance and improve the DI control (ALCOA principle)  at Tablet Manufacturing area.\n\nTo make and agree daily/weekly/monthly production plan for Tablet manufacturing area.\n\nTo supervise Tablet Manufacturing and Filling and ensure to achieve the production plan on time.\n\nMaximum utilization of resources for delivery of quality products and to improve KPIs.\n\nUpdate respective production visual boards.\n\nIdentify, develop and implement improvement/Operational Excellence (OE) projects to generate cost savings (Strategy Deployment).\n\nTo Ensure SAP data posting/transaction/data provider for Tablet Manufacturing and Filling.\n\nRepresentation the Tablet department as QMS Representative.\n\nTo ensure supervision of third party services in the area.Why Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Contact information:You may apply for this position online by selecting the Apply now button.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}