{
    "Job ID": "69866778",
    "Description": "<p><b>Global Online (Career Delivery Group)</b></p><p>Global Online (Career Delivery Group) is seeking candidates for the following position based in the ASF office</p><p>                                                                         </p><p><b>Lead Specialist (GradeD1) – Career Consulting Delivery (Employee Research)</b></p><p>This is an individual contributor role</p><p></p><p><b>What can you expect?</b></p><p>Mercer’s Employee Engagement team provides end-to-end diagnostic services to assess employee engagement, human-capital-program effectiveness, and key drivers of human capital outcomes. Our unique “say/do” approach links HRIS data directly to employee survey results to assess the relationship between what employees say against what they do in such areas as salary/performance history and employee engagement or productivity.</p><p>In this role:</p><ul><li>You’ll have an opportunity to collaborate with one of the On-Line Mercer’s Teams responsible for create, test and deliver of high quality surveys</li><li>This role combines project and stakeholders management, analytical and research skills</li></ul><p>                    </p><p><b>What is in it for you?</b></p><ul><li>Holidays (As Per the location)</li><li>Shared Transport (Provided the address falls in service zone)</li></ul><p></p><p><b><u>We will count on you for:</u></b></p><ul><li>Cooperating with internal and external clients globally to deliver high-quality employee engagement products</li><li>Creating and testing online questionnaires in multiple foreign languages in internal tools</li><li>Coordinating distribution of surveys (setting up invitation emails and reminders in multiple languages, making sure that system is set-up correctly)</li><li>Offering helpdesk support for external clients</li><li>Preparing own calculations in Excel, SPSS, R or Tableau to check the correctness of data in employee engagement reports</li><li>Maintaining high quality of delivered reports</li><li>Helping with the preparation of executive presentations</li></ul><p></p><p><b>What you need to have: </b></p><p><b> Knowledge & Skills:</b></p><ul><li><b>Experience in data analysis or / and preparing statistical reports. Experience in Qualtrics mandatory</b></li><li>University degree, preferably faculty of quantitative / statistics / sociology</li><li><b>Experience in preparing and conducting surveys</b></li><li>Very good command of written and spoken English</li><li>Project management experience</li><li>Advanced knowledge of MS Office products (Excel, Word, PowerPoint)</li><li>“Can do” attitude and ability to resolve escalated issues in a timely and professional way</li><li>Strong analytical and problem solving skills</li><li>Strong attention to detail and follow-through skills to resolve any outstanding issues</li></ul><p></p><p><b>Education:</b></p><ul><li>Graduate</li></ul><p></p><p><b><u>What makes you stand out:</u></b></p><ul><li>Experience in quantitative market research</li><li>Good knowledge of tools like: SPSS / R</li><li>Experience in preparing and conducting surveys</li><li>Change management experience</li></ul><p></p><p><b>      What makes you stand out?</b></p><ul><li><span>Exceptional Communication Skills</span></li><li><span>Adaptable communicator, facilitator, influencer and problem solver </span></li><li><span>High attention to detail</span></li><li><span>Good relationship skills, Proven ability to work on own initiative as well as in a team  </span></li><li>Ability to multi-task and prioritize time effectively</li></ul><div><p></p><p><b><span>About Mercer</span></b></p><p><span>At Mercer, we are a global force of around 25000+ unique individuals working together to make a difference in the lives of more than 115 million people every day by advancing their health, wealth and careers.</span></p><p><span>We’re in the business of creating more secure and rewarding futures for our clients and their employees — For more than 80 years, we’ve turned our insights into actions; Be it designing affordable health plans, or assuring income for retirement, or aligning workers with workforce needs, we’ve been united in our mission of enabling people around the globe to live, work, and retire well. </span></p><p></p><p></p></div><p></p><p></p><p></p>Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}