{"Job ID": "69866188", "Description": "Job Description:Role: Business Analyst (Product Owner)Group:  Risk Finance TechnologyLocation: Pune, IndiaERM (Enterprise Risk Management) & MVRM (Market & Valuation Risk Management) IT group are part of Technology Data and Innovation and own and deliver on the RiskFinder platform to multiple stakeholders and sponsors.RiskFinder is the Bank’s Risk & Capital Management platform. It provides capability to calculate capital metrics, performs risk scenario analysis and portfolio risk analytics and related control functions across the Bank’s business lines. The system calculates over 600 billion scenarios per day on a high-performance compute grid, stores the results into a big data store and provides our end users the capability to aggregate, report and analyse the results.RiskFinder integrates distributed high performance grid compute and big data technologies to deliver the execution and analytics at very large scale required to process the volumes of scenarios within the timeframes required.  The platform leverages in house quantative analytics and inputs to our front office pricing models to deliver full revaluation-based capital metrics across a complex derivates portfolio.Our technology stack includes Java, C, C++, PostGres, OracleDB, Lua, Python, Scala, and Spark plus other off-the-shelf products like caching solutions integrated into one platform, which offers great opportunity for technical development and personal growth in a domain with focus on engineering and Agile delivery practices.About DB Global Technology:A Passion to Perform. It’s what drives us. More than a claim, this describes the way we do business. We’re committed to being the best financial services provider in the world, balancing passion with precision to deliver superior solutions for our clients. This is made possible by our people: agile minds, able to see beyond the obvious and act effectively in an ever-changing global business landscape. As you’ll discover, our culture supports this. Diverse, international and shaped by a variety of different perspectives, we’re driven by a shared sense of purpose. At every level agile thinking is nurtured. And at every level agile minds are rewarded with competitive pay, support and opportunities to excel.About the team:Risk Finance Technology (RFT) caters to Market Risk (MR) and Counterparty Credit Risk (CCR) for the group. RFT is responsible for delivering key risk metrics to senior management on the business side and the regulators across the globe.On CCR, technology is expected to delivery counterparty exposures like EPE, PFE, AEE, LGD etc., stress testing of credit exposures. For MR, technology is enageged to deliver VaR, SVaR, CVA and RWA etc. in a strategic platformRFT undertook the five year roadmap to build strategic “Risk Framework” which will be used bank wide for various metrics across all risk categories. The technology suite used are Java, Oracle, Hadoop, EXTJS [UI], Spring, SAS-VA, SAS-ESP, Base-SAS, HPRisk and C++.Group Technology (Development & Operations):Our Technology team pioneers technologies and re-engineers business processes to deliver exceptional levels of innovation and world-class client service. From moving trillions of Euros through a business every day to integrating two organizations after a major acquisition, we face the technological challenges caused by growth, market change and constant competition.With award-winning mobile banking apps and trading systems, our technology platforms help Deutsche Bank deliver best-in-class products to clients. Naturally, we make sure that the phones work, emails are delivered and PCs run - but we also develop innovative collaboration platforms and workspaces that help our people share their knowledge, their expertise and their passion for our business.Developments in technology are changing the way we communicate, work and even think. Join us here, and you’ll constantly be looking ahead. We’ll look to you to capitalize on new technological trends that can reshape our business and deliver value for our clients, whilst still meeting the demands of customers, regulators and the markets. Role Description:The successful candidate will play an important role in streamline the data exchange protocol in  RFT space. As a business analyst, this person will be responsible for analyzing the business and functional requirements and data analysis; includes writing features,stories, feature Acceptance Criteria, data analysis, tracking issues, controlling change requests, and coordinating testing in higher environment including UAT.This role is responsible for translating the requirements into features/stories, enable solution development, analysing the impact of changes, supporting the business throughout the implementation process and ensuring smooth release into Production. They are also responsible for the production of business-facing documentation such as user manuals and solution briefs.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under child care assistance benefit (gender neutral)\nFlexible working arrangements\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour Key Responsibilities:Maintain the team’s Backlog for current and next Agile Planning Period (‘QBR’ – Quarterly Business Review)\nAssisting the team in the solution design\nProduct Owner Experience\nUnderstand the business flows, translating user requirements, and creating features and User Stories.\nWell Versed with Agile Methodology, tools (Safe Agile, Jira)  and agile methodology.\nWork closely with Product Manager on backlog prioritization and provide timely update on team business objective to them.\nRaise risk and dependencies with Product Managerment and Release Train Engineer and work with required stakeholder for resolution.\nEnsure team is delivering the business value to stakeholder in timely manner.\nChallenge the requirements where needed, explain these requirements to the feature teams.\nCollaborate closely with application owners as the business/functional counterpart in solution identification and estimations\nSupport creation of business case(s) outlining cost impacts and value drivers of proposed solutions.\nManage user acceptance testing and test case development/coordination with the business.\nEnsure that end users & support teams are correctly trained to use solutions being delivered by the project.\nDocument business and process flows.\nSupport implementation team and solve post go-live issues\nCreating presentations for senior management and stakeholders.\nClosely work with Dev team and understand the non-Functional requirements for Risk applications/products.Your Skills & Experience | KnowledgeStrong business knowledge of risk management domain – Counterparty Credit Risk, Market Risk and Enterprise Risk Management\nExpertise and in depth understanding of market and credit risk data and processes across risk functions including trade, counterparty, collateral, trading books, hierarchies etc.\nUnderstanding of different flow products e.g. Repos, SLBs, Listed Derivatives etc. and OTC products related of different assets classes e.g. FX, Rates, Credit and Equities. Incumbent should have in depth knowledge of at least one of the asset classes.\nUnderstanding and experience in one or more areas of PFE, EPE, Default Loss, CVA, FRTB, Exposure Calculations and Stress Testing\nKnowledge and experience in VaR/SVaR methodologies and regulatory landscape (CRD IV, FRTB, Basel II / Basel III, CCAR, Volcker)\nUnderstanding of reference data, hierarchies, netting concepts, agreegation on hierarchical nodes for reporting facets\nExperience in conceptualization and solution definition\nPrior experience with Systems Development Life Cycle and Agile.\nExcellent communication skills\nAttention to detail, ability to work with deadlines\nAssertive with the ability to interact with various control and operational\nGood documentation skills including process modelling\nStrong problem solving and analysis skills\nProactive, delivery orientated approach\nEnthusiastic ‘can do’ approach to all responsibilities\nAbility to take direction as needed as well as being able to work independently\nExcellent PC skills to include proficiency in MS Word, Excel, PowerPoint, Visio, SQL, Python, Jupyter Notebooks.Education | CertificationBachelor in Engineering (BE/ BTech.) or equivalent\nMBA / Post Graduate in Statistical discipline\nCandidates with FRM/PRM are preferred.How we’ll support youTraining and development to help you excel in your career\nFlexible working to assist you balance your personal priorities\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}