{
    "Job ID": "69866791",
    "Description": "Secondary Maths Teacher - Dubai - ASAP 2023\n\nCurriculum: IB DP / MYP & IGCSE\nLocation: Dubai, UAE\nSalary: 9000 - 14000 Dhs per month, tax free\nExperience: 2 Years\nSponsorship: single applicants\nContract: 2 years\n\nSchool Vision: To offer a broad international education, designed for local and expatriate students which promotes excellence in all academic activities, enhancing the educational, social and physical development of students by encouraging analytical and creative thinking in preparation for the next stage of their educationThis school is a member of BSME and MEIBA and is at the heart of the community catering for more than 900 international students from across 80 countries and is supported by an exceptional team who offer warmth, support and encouragement which allows students to develop into responsible life - long learners. Operating the IB MYP / DP and IGCSE curriculum , the school nurtures a communal spirit with parents, teachers and students working in partnership to develop self-esteem and individuality alongside high academic achievements.This is a fantastic opportunity to join a forward thinking team which provides extensive development and training while working alongside professional international educators.Applicant requirements:\n\nYou will be teaching Maths to IBDP (Year 13) level. This ASAP role is due to an increase in student enrolment. Priority will be given to those applicants already based in the UAE.A bachelors degree in Maths along with a relevant teaching certificate\nMinimum two years post qualifying experience\nIdeally you should have IBDP curriculum experience however they may consider superior applicants with a student centred inquiry based approach to their teachingBenefits: A comprehensive package is offered with this position: Tax free salary, single occupancy furnished accommodation, annual flights, and medical insurance plus other benefits.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Primary, Prep, & Secondary School",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}