{
    "Job ID": "69869802",
    "Description": "In India, Bosch is a leading supplier of technology and services in the areas of Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. Additionally, Bosch has in India the largest development center outside Germany, for end to end engineering and technology solutions. The Bosch Group operates in India through twelve companies with a combined strength of over 31,500 associates which includes around 15,650 research and development associates.Bosch Automotive Electronics India Pvt. Ltd. (RBAI) is a 100% subsidiary of Robert Bosch GmbH . Established in 2009, in Naganathapura - Bengaluru, RBAI is primarily focused in manufacturing electronic products for the automotive sector. RBAI has consistently added an average of one product every year resulting in a wide range of products comprising – Engine Control Units (ECU) for both 4W and 2W, Body Control Modules (BCM), ECUs for ABS, DC-DC Converters, iTraMS (Intelligent communication control unit) to name a few. RBAI also produces products for  eMobility like MCU (Motor control Unit), C-Box (Communication Box), VCUs (Vehicle Control Unit), Central gateway modules and is geared up for other futuristic products.  RBAI with its diverse portfolio, not only caters to local markets, but also exports products to all major global customers. The Naganathapura Plant (NhP1)  is seen as a benchmark in Operational Excellence in AE and Bosch India , using an integrated approach of Bosch Production System (BPS) and I4.0. With a young and agile team, RBAI’s mission statement ‘Be RBAI’ (Be Reliable Benchmark Agile Innovative) is a testament to our commitment in providing best in class products and services for its customers.Ensuring production target are met with Safety and Quality standard adherence\nAnalysis of loss contributors\nEnsure operators are working according to standards (Work instruction, Handling instruction,  etc.)\nOn job training for new associates and enhancement of operators multi skilling.\nConducting shift level communication with associates Safety, quality and Production topics.\nConduct regular audits - layer process confirmation\nImplementation and adherence to the quality Standard Problems solving through systematic approach - 5 Why, PSS Responsible for Continues improvements\nPeriodic Responsibility:\nInventory Accuracy\nExecution of BPS standards\nFailure analysis and CAPA\nSystem CIP Projects\nInternal complaints handling\n5S Audit\nLPCDiploma in Electrical / Electronics / Mechanical with 3-4 years experience.KANBAN / Levelling / Pull systemAwareness of Automotive safety productsSAPBasics People handlingGood communication-writing and verbalJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}