{"Job ID": "69865527", "Description": "Client Onboarding & Regulatory Services KYC Refresh Team RTB Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments, and individuals from more than 1,200 offices in 43 countries. As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture. Operations is one of the largest divisions in the firm and has diverse responsibilities, including correctly settling and recording millions of transactions per day, identifying and mitigating all operational risks, developing strong client relationships and partnering with technology to realize the full potential of IT and e-solutions. Throughout, the Operations department continually seeks ways to improve while actively supporting the development of new businesses, structures and markets. Client Onboarding & Regulatory Services (CORS) is an Operations function within Shared Services and Banking Operations (SSBO) and is responsible for regulatory client onboarding, refresh and screening. KYC Refresh supports a number of regulatory compliance requirements specified by our local/global regulators and provide a rigorous and robust process of investigation that seeks, with reasonable assurance, to verify and validate the customer's identity and their business. The Refresh team is responsible for managing the refresh program across global jurisdictions. The team partners closely with Global Financial Crimes, Legal and Compliance, internal/external stakeholders to contribute to the success of the refresh program. Analyst/Associate for Production. Responsibilities: > The Refresh Process Specialists are expected to stay current with all regulatory changes and requirements around client KYC, Suitability and Documentation. > Able to escalate appropriately any risks identified during the documentation review process. > Partnering with the client facing teams to collect required documents and associated information to meet all regulatory and internal polices > Act as a subject matter expert on required AML/ KYC documents and process. > Manage and facilitate client due diligence, including coordinating the participation of MS stakeholders who have KYC responsibilities > Serve as point of contact for KYC and reporting issues for designated clients > Discuss and escalate with Compliance complex issues surrounding client types and structures, financial products and services, and other AML risk-related issues. > Act as an escalation point for client issues - troubleshoot cases and collaborate on solutions. > Review cases before handover to Non Market Risk for assessment > Represent the team at Working Groups and Steering Committee meetings, providing progress updates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}