{"Job ID": "69867311", "Description": "Associate Director, Area Head-NR-(2300017168)Job:Retail BankingPrimary Location:Asia-India-MumbaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 6:00:02 AMUnposting Date:22/Sep/2023, 10:59:00 PMJob SummaryBusiness Drivers \nMaximize sales performance to achieve given revenue targets for self and team as well as that of the branch through liability products [Current /Savings /Term deposits], wealth management products and asset related products(secured, unsecured)\nProvide support for new product launches, and champion new sales initiatives.Device strategies to acquire large prospective customers through referrals, maximize market share in the catchment area of the branch, by below the line activities and promotions. Coordinate customer events along with the product team\nEnsure effective Relationship Management by monitoring the movement of the top customers of the Segment devise and implement a customer acquisition and retention programme. Improve product per customer holding.\nEnsure adherence to laid down processes, facilitate first time resolution. Minimize rejections and customer complaints\nMonitor customer satisfaction survey ratings, net promoter score or any other survey/ feedback ratings taken from customers and ensure continuous improvement if below bench-mark, sustain and better quality service\nAchieve “best in class” productivity in order to maximize the efficacy of the sales process.\nHave complete knowledge of the customer base in terms of the profile, demographics & psychographics and assets in the Bank and in other places.\nHe/She is aware of bank’s Mis-selling & Sales Policies and ensure adherence all the timesResponsibilitiesEnsure branch staff work as a cohesive motivated and top performing sales and service team\nAchieve high employee satisfaction and retention of good performers\nIdentify and address training needs of staff on an on-going basisStrategyCustomer Experience BusinessOperational quality ProcessesResponsive and responsible selling People & TalentAdhere to all policies, guidelines and procedures, comply with local regulatory requirements Risk ManagementRisk Assurance GovernanceTo comply with all applicable money laundering prevention procedures and, in particular, report any suspicious activity to the Unit Money Laundering Prevention Officer and line manager Regulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead to achieve the outcomes set out in the Bank’s Conduct Principles\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key stakeholdersNR Segment/ Wealth Management UnitJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}