{
    "Job ID": "69869961",
    "Description": "At Vialto we create the connections that build global careers and societies, bridging the gap between people and their aspirations. As the world of work continues to evolve, we are bringing together the individuals, ideas, and technology to unlock business and human growth.The tasks, roles and responsibilities pertaining to the job role of an Assistant Manager will include the following:Interacting with senior expatriate assignees and middle management client contacts on day-to-day matters\nReviewing and finalizing the tax computations - withholding tax computation, advance tax etc.\nReviewing individual tax returns\nWorking on advisory projects involving technical analysis and drafting memo, presentations etc.\nIndependently handling scrutiny assessments including preparing the submissions, highlighting complex tax issues and representations before tax officers\nCo-ordinating with the tax authorities and visiting the tax office of regular follow-ups, rectification, refund follow-up etc.\nAnalyzing and interpreting Provisions of the Income-tax Act, 1961, Foreign Exchange Management Act, 1999, Social Security Law, tax treaties, Social Security Agreements.\nResponsible for the complete execution of the assigned engagements.\nOverseeing the work of Associate, Analysts and Senior AnalystsQualifications - Chartered AccountantWorking in this discipline will see an Assistant Manager working on engagements and teams (the sizes of which will vary depending on client/project).To qualify for the same an Assistant Manager will need:To be a Qualified Chartered Accountant with 2-3 year of relevant experience\nThorough knowledge of direct tax and expatriate tax is expected\nKnowledge of the current developments and impact of the same on the individual taxation\nOther prerequisite skills include:\nThorough knowledge of tax regulations, interpretation of treaties etc.\nDemonstrating innovative and critical thinking in managing projects\nExcellent written and verbal communication skills\nStrong analytical and numerical skills\nGood interpersonal skills including the ability to coach juniors\nPassion for client servicing\nExcellent eye for detail\nEfficiency in MS office and report writing skills\nAbility to understand and articulate technical concepts\nAbility to develop project management and supervisory skills, involving effective time management and task prioritization\nOwnership and responsibility of clients/tasks delegatedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}