{"Job ID": "69866812", "Description": "Responsibilities: This role pertains to north & east India geographical area \nFinancial: Set, own, and achieve bookings, sales, and profitability targets for the region managed.\nSales Management:  Plan strategies and resources to deliver monthly sales targets. Build strong relationships with the top management of sales channels.  Conduct periodical reviews and set objectives.\nSales Planning:  Closely work with Operations and Projects teams to forecast orders and help in advance planning of materials and inventories.  \nProject Pursuit: Identify key projects to win and enter early to implement winning strategies.  Build excellent collaboration with the India NG PMO team. \nStrategic Initiatives: Develop strategic initiatives to maximize business from City Gas Companies, Gas Transmission Companies, EPC’s and LPG Distributors.\nSales Promotion:  Organize focused customer exchange events.  Build strong relationships at multiple levels with key customers.\nCustomer Service: Work closely with the Service team to address customer issues and ensure prompt resolution.  Escalate issues to Asia Pacific team where necessary. Grow lifecycle services business in collaboration with LCS manager.\nIndustry Verticals : Natural GasEducation, Experience, Knowledge, Skills and Abilities:Degree in Engineering. Master’s degree will be an added advantage\nMinimum 8-12 years’ experience in Indian Oil & Gas industry with successful track record in Sales Management / Business Development\nStrategic Thinking and Long-Term Planning Capabilities\nEffective communication capabilities, and ability to influence others                           \nGood presentation skills\nTo understand the products, applications, and markets. To grasp the business dynamics and assess competitive field.\nTo develop sales strategies combining direct and indirect selling. To position Regulator Technologies as a preferred partner to customers.\nTo propose and implement long term growth plans.\nTo convince customers on the solutions offered.\nTo make presentations to customers, Regulator higher management, etc.\nEnglish required; Multilingual (Hindi) preferred.2. RelationshipsReporting to Regional Director - East & North and dotted line reporting to India Sales Leader - NG SBU\nExternal interaction:\nWith customers and consultants at the technical and decision-making levels\nDevelop Sales Channels for LPG.\nInternal interaction: \nProposals, Engineering, Project Management team, Sales Order Management team, Service team, Operations group, Finance, and HR\nAP product marketing for NPD / PMR \nEPM India cross functional teams and Industrial vertical managers     3. Other RequirementsTravel extensively within the region.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}