{
    "Job ID": "69866599",
    "Description": "ABOUT UNILEVER:Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that strive to improve the lives of our consumers and the communities around us every day. Every day, nine out of ten Indian households use our products to feel good, look good and get more out of life – giving us a unique opportunity to build a brighter future. We promote innovation, big and small, to make our business win and grow; and we believe in business as a force for good. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best.At HUL, we believe that every individual irrespective of their race, colour, religion, gender, sexual orientation, gender identity or expression, age, nationality, caste, disability or marital status can bring their purpose to life. So apply to us, to unleash your curiosity, challenge ideas and disrupt processes; use your energy to make the world a better place. As you work to make a real impact on the business and the world, we’ll work to help you become a better you!We are looking to hire an Assistant Area Sales & Customer Manager.Here is how your day at Unilever would look like:Customer Infrastructure & satisfaction: The AASCM is responsible for ensuring a robust Customer Infrastructure is in place in the territory. Distributors are appointed by the AASCM wherever necessary and it is his responsibility to track their overall performance on key metrices. AASCM is supposed to optimize the quantity & quality of customers in his area such that there are no service gaps while ensuring adequate service levels for trade and financial viability for customers. He monitors the financial health and profitability of all Customers. The AASCM also needs to step in from time to time to resolve customer issues which cannot be handled at a field-force level. Along with his team (FF) the AASCM is also responsible for primary & secondary customer complaint resolution.Growth & Execution: The AASCM drives Top-line growth in the area and ensures all execution metrices are also in place. He will also need to monitor channel-wise and category-wise growths in the territory. It is also the AASCM’s responsibility to ensure all new launches are landed in the area and to ensure all merchandising activities are run well. Execution metrics are the input metrics for delivering share gaining growth and are hence very important.Drive a team: Team handling & team building are the most important aspects of an AASCM’s role. The AASCM is responsible for managing the team, motivating them and getting them to deliver their metrices. He needs to understand the working style and strengths and weaknesses of each person to get them to reach their potential and also needs to provide developmental inputs on a continuous basis. How an AASCM binds his team together is often a make or break factor in performance of a team.Liaising with key Partner Functions: The AASCM liaises with the Supply Chain Team to ensure packwise estimates are built correctly for the area. He also ensures norms build up at an RS level are hygienic and supplies from depots are in order. He also ensures that the stock build up at Customer points are at the acceptable level. The AASCM works with the Commercial Team to ensure customers are healthy and that payments to company are in order.Ensuring controls & financial hygiene: Along with Commercial & Supply Chain team, AASCM is supposed to have check on system hygiene at customers on aspects like extent of sales return, extent of damage/ shortage claims, mismatch between primary & secondary, physical vs. book stock mismatch, trade discount hygiene etc. AASCM needs to play an active role in probing cases of deviation from norms on the above-mentioned aspects.Key Skills & Requirement:MBA with relevant experience.\nAnalytical skills and demonstrated ability to manage the business by the numbers.\nJobs involving quick decision making.\nJobs involving extensive oral communication, people interaction & negotiation.\nExperience in a highly analytical, results-oriented environment. Preferably FMCG.\nExternal customer interaction.\nExperience of jobs involving active listening skills, highly consultative and solutions-oriented.\nDeep understanding of the retail and wholesale landscape in India with prior interactions with sellers and distributors is desirable.\nExperience in selling new products and developing markets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}