{
    "Job ID": "69866159",
    "Description": "Case Processing:\n Process case files according to Standard Operating Procedures (SOP).\nWork with affiliate offices to ensure required dataset has been received/requested.\nRe-assess the data, ensure accurate product selection and assign required event code(s) in the system.\nComplete initial and follow-up reporting assessments as information is received (initial report, follow-up questionnaires, phone calls, investigation findings).\nRespond to Manufacturing Quality Assurance (QA) requests and Health Authority inquiries\nLaunch required quality investigation records.\nSchedule expedited and periodic regulatory reports based on local and international reporting regulations.\nPerform and receive quality feedback on case management and coding.\nAdherence to all corporate compliance guidelines & corporate programs.\nMaintains a working knowledge of the following:\nAlcon Products for assigned therapeutic areas and corresponding documentation (Product Information, Directions for Use, Manuals, Promotional materials)\nEye anatomy\nCommon diseases\nOphthalmic evaluation procedures\nEye terminology and abbreviations\nSafety database(s) and reporting tools\nProcess and review Surgical – Intra Ocular Lens (IOL) complaint records in accordance with Alcon Standard Operating Procedures (SOPs)Provide support in reconciliation activities and audit as required.\nEvaluate and escalate potential safety issues to management.Role Dimensions:Number of associates:NoneFinancial responsibility:NoneImpact on the organization:LowKey Performance Indicators (Indicate how performance will be measured: indicators, activities…)KPIs will be outlined in detail in the goal sheet, and will largely be around below parameters:Meets internal and external quality standards\nReview and close files within prescribed timelines\nCreates high quality regulatory reports for submission on or before assigned due datesIdeal Background (State the minimum and desirable education and experience level)EducationMinimum:  Graduation in ScienceDesirable: Graduation in Optometry/ Pharmacy/M. Pharm/B. Pharm /BDS/BAMS/BHMS/ Biomedical Engineering / Registered NurseExperience requirement:                              Minimum: Healthcare professional with 0-2 years of experienceDesirable: Experience in Device Vigilance / Pharmacovigilance / Regulatory Submissions / Clinical Research / PVPI/ Medical CodingLanguages:Minimum: English (written and spoken)Specific Professional Competencies: Indicate any other soft/technical/professional knowledge and skills requirementsExcellent listening ability and communication skillsExcellent decision quality and negotiation skillsAbility to manage multiple tasks, attention to detail, prioritize work and manage time wellKnowledge and understanding of national and international medical device regulations and regulatory guidelinesKnowledge of medical aspects of medical device safety, medical device vigilance in pre- and post-marketing safety practiceBasic knowledge of MS OfficeAlcon is an Equal Opportunity Employer and takes pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital status, disability, or any other reason.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}