{
    "Job ID": "69866380",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. \nAbout the team:In today’s highly competitive private equity market, firms must not only deliver superior returns, but also respond to more stringent reporting requirements and increasing demands for information – both from within and outside their organization. Throughout the industry there is mounting pressure on organizations to do more, requiring a clear technology strategy that not only addresses the demands of today, but also enables the growth and performance of tomorrow. What you will be doing:Experience:\n3 to 6 years proven functional test experience (both web-based testing and API testing)\nProficient in automation testing\nKnowledge in performance testing tools is preferrable.\nTechnical Orientation bachelor’s degree minimum, Master preferred\nISTQB Foundation Certification is preferrable.\nAgile Certification is preferrable.\nDispute or Case Management System experience is a plus.\nExperience in cards-based payments is a plus.Hard and Soft SkillsAble to create and execute accurate test cases – manual as well as automated.\nA keen eye for details is necessary for anyone in the testing arena.\nPragmatic and strong analytical mind.\nTechnical mindset\nGood planning and organization skills.\nFamiliar with agile and Iterative development methods.\nCommitment to pursuing a continual improvement of CBK software quality.\nExcellent spoken and written English.\nTools knowledge\nSoap UI, Jmeter\nDatabase - Postgres databases knowledge is must.\nWindows and Linux operating systems\nTest management tools (test rail, Jira, Rally, version control software, etc)\nGood with SQL queries, have good hand on Oracle, DB2, Postgres databases.Responsibilities:Manual Testing – Functional Testing (Web-based and API)\nAutomation Testing – Prepare and execute automation scripts.\nReview and analyse system specifications.\nCollaborate with QA Engineers to develop effective strategies and test plans.\nExecute test cases (manual or automated) and analyse results.\nEvaluate product code according to specifications.\nCreate logs to document testing phases and defects.\nReport bugs and errors\nHelp troubleshoot issues.\nConduct post-release/ post-implementation testing.\nWork with cross-functional teams to ensure quality throughout the software development lifecycle.Place in the project organization:Reports Directly to the Team Lead.\nResponsible for giving the TL accurate information to enable informed delivery choices.\nShould be involved in all test team meetings.. Qualification: BCA/BSC/BE/ME/B.Tech/M.Tech (Information Technology/ computer)\nWhat we offer you: \nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nA broad range of professional education and personal development possibilities – FIS is your final career step!\nA competitive salary and benefits\nA variety of career development tools, resources, and opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}