{"Job ID": "69866987", "Description": "Description :Grade Level: L2Location: IslamabadLast date to apply: Aug 22nd, 2023What is Expert HLR & VAS Planning?Main tasks requires close interaction with Internal/External stakeholder and vendors to manage projects, initiatives and upgrade of VAS & HLR Network.The role reports directly to the Manager HLR/VAS Planning & Operations and has 12 people reporting directly into it.What does Expert HLR & VAS Planning do?Have thorough competency on Home Location Register (HLR), Value Added Services (VAS), & Core Network Product.\nTakes ownership and ensure timely delivery of projects, initiatives, and upgrades.\nContinuously review and bring improvements to the Jazz Technology and Development framework and design innovative solutions as per global best practices.\nHandle day-to-day network planning of Jazz VAS and HLR network.\nEngage in effective coordination with Internal/External stakeholder and Vendor for effective project delivery.\nHandles planning & administration of the Hardware & software of value-added services.\nCoordinate with all relevant technology vendors for any support issues to make sure that Service Level Agreement is always intact.\nComply with all the departmental Standard Operating Procedures (SOPs) during the execution of projects and carrying out all job related duties.\nBe involved in training operations team after project delivery.\nRemains updated on current policies, procedures, promotions, products and value added services offered by the Jazz.Jazz is an equal opportunity employer. We celebrate, support, and thrive on diversity and are committed to creating an inclusive environment for all employees.RequirementsWe are looking for someone who has already worked for HLR & VAS planning with hands on experience on especially on Nokia HLR/HSS/AAA, SMSC, RBT, CGW and VAS products from different vendors. Must be a good at project management, stakeholder management and innovative solutions. We are also looking for someone who has excellent communication & leadership skills to be able to promote the department and technology portfolio with professionalism, maturity, and a balanced, holistic view of any competing viewpoints and last but not the least, the candidate must be a good team player.Innovative thinking and solution orientation to craft leadership development solutions in line with our philosophy, competencies, and expectations from leaders\nCommunication and presentations skills to make solutions/ideas understandable for respective audience segments\nDrive for results to own initiatives and continuously evolve in line with analysis and feedback\nHands on experience in process automation/simplification\nSQL/Oracle for data extractions & query writing\nBasic knowledge of programming languages like python, Perl, and JavaScriptWhy Join Jazz?As one of the leading employers in the country, Jazz epitomizes the philosophy that each Jazz employee is passionately living a better every day inspired and enabled by visionary leadership, a unique professional culture, a flourishing lifestyle, and continuous learning and development.Our core values include qualities essential for a positive organizational culture - truthfully guiding entrepreneurial and innovative mindsets, harnessing professional and interpersonal collaboration, and fostering across-the-board customer-obsession.As one of the largest private sector organizations in Pakistan, our objective is to continue to change the lives of our 75 million customers for the better. This is an opportunity for someone who wants to be part of something transformative, someone who can play a critical role in driving our success. Together, we can empower millions more with the tools necessary to progress in an increasingly digital economy.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Islamabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}