{"Job ID": "69866354", "Description": "RESPONSIBILITIES:-Driving sales for Interactive Flat Panels (IFPs), Smart Signages, Video Walls and ‘instant presentation’ (Instashow) products and solutions across focused customer verticals.\nThorough experience and knowledge of solution selling for Corporate Boardroom/Conference Room/Huddle Room.\nDevising local Go-To-Market strategy to build deep relationships and business penetration in focused customer verticals of large enterprise, retail & hospitality, IT/ITES, BFSI, Security, Transportation etc.\nIdentifying, recruiting and developing key AV system integration (AVSI), IT system integration partners focused on doing business in aforementioned key customer verticals.\nConstantly tracking and strategizing to improve overall market share for the business segment and each product sub category by ensuring proper model mix.\nClosely tracking and sharing key competition strategy, model line-up, pricing and schemes, organization structure and SI partner base through competition mapping reports on a regular basis.\nRegular assessment and reporting of key technology trends in the market, changing customer requirements along with detailed evaluation of market demand in identified key customer segments.\nRegular travel across major cities in the assigned territory to meet key customers AVSI partners and distributors and key consultants for regular business reviews, support for ongoing & future projects and to gather relevant market information.\nRegularly organizing product presentations and demonstrations at key customer places.\nHighly developed skill set to incorporate/influence customer and consultant level product and system specifications by incorporating key products as a part of RFQ (Request For Quotation)/tenders.\nThorough knowledge of process and documentation of buying cycle of large enterprises, PSUs and retail & hospitality brands.\nHighly structured and disciplined working on funnel management software programs like Salesforce.com (SFDC).\nAbility to accurately provide detailed funnel and model wise rolling forecast for next 12 weeks for each SKU and account.\nOrganizing regular and detailed product and solutions training for key SI partners, their sales and pre-sales teams.\nOrganize effective participation in key industry trade shows and technical seminars.\nOrganize/sponsor/participate in industry conferences/round tables/interactive sessions for customers/industry verticals for enhancing equity among buyers.DOMAIN KNOWLEDGE:-Understanding of latest technology in the respective verticals especially display technology\nDeep understanding of Corporate Boardroom/Conference Room/Huddle Room solutions - MANDATORY\nHands on understanding of Corporate, Enterprise, Retail & Hospitality segments\nHighly developed skill set in Key account management & SI partner development\nShould have an expertise in B2B sales model focused on industry verticals\nWorking knowledge of Salesforce.com (SFDC)\nMS Office (MS Excel & PowerPoint)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}