{
    "Job ID": "69861385",
    "Description": "AFRICA BASEDMINIMUM REQUIREMENTS AND QUALIFICATIONS:Desirable university or tertiary qualification.\n3 Years’ of sales account management.\n7 Years’ experience in the hotel industry.\nFluent in English (both written and spoken). PRIMARY OBJECTIVE OF POSITION:Strategically drives total profitable revenue and market share growth for the assigned region.\nEnsures that all opportunities (all segments) for the region are optimized from, to and within the region. \nThe job incumbent should be active, proactive, analysing and achieving results in every respect. \nAll work will be in line with the regions guidelines, business plan, Radisson Hotel Group corporate guidelines and service concepts.\nDrive performance and market share from all regional accounts.\nRepresent Radisson Hotel Group at meetings as requested to support both sales and the region.TASKS, DUTIES AND RESPONSIBILITIES:Overall Management/LeadershipInducts all new hotel Director of Sales on all Radisson Hotel Group policies and procedures.\nEnsures they familiarize themselves with product knowledge for the regional portfolio.\nMaintain strong relationships throughout the area and hotels; sales, revenue, marketing and operations departments.\nLives and acts in accordance with the Radisson Hotel Group corporate values and company culture.\nUtilizes leadership skills to help maximize hotel sales team’s productivity.\nEnsures that they exceed client expectations.\nEnsures that they act as ambassadors for Radisson Hotel Group, becoming acknowledged experts on market and customer issues within the territory of all Radisson Entities in the Middle East.\nLeads by example and develops own sales team to successfully meet their targets\nEnsures team use all available RHG sales toolsSales Strategy and DeliveryConducts regular meetings with the Senior Area Director of Sales & Revenue Optimization, Middle East & Africa and General Managers in order to set objectives, ensure that action plans are in place for the region and review performance of the hotel sales teams.\nIdentifies new business opportunities or strategies for all hotels in the region.\nCreates and drives new sales plans when applicable within the region.\nAchieves overall sales targets for all segments.\nImplements strategies to facilitate market penetration for increased national and international production to meet increasing demands reflecting in the change and growth of the Company.\nMonitors sales productivity by ensuring sales tools are used and always up to date.\nIncreases sales volumes and profitability by formulating and executing projects for all market segments for the region.\nAnalyses sales statistics to formulate and increase profitability.\nReviews market analysis to determine client needs, occupancy potential, desired and competitive rates etc.\nDrive business with the focus on total profitable revenue.Role & ResponsibilitiesResponsible for all business generation inbound and outbound of the region.\nAccount management of own assigned accounts – both existing and new.\nUnderstand the needs of each hotel within the region to develop and implement a sales strategy to meet their needs.\nCreates and implements initiatives for all assigned hotels within the region in order to develop, implement and maintain sales strategies to meet their needs.\nKey sales support and communicator for all hotel General Managers within the region (hotel strategic point of contact) to global stakeholders to support commercial needs.\nEnsuring RGI (Revenue Generation Index) growth for the region.\nDirects all sales opportunities to hotels in a timely fashion and assist them with the quotation and securing the business.\nAttends major travel functions and trade shows to promote the hotels within the region.MiscellaneousEnsure client satisfaction by attending to their requests and/or enquiries courteously and efficiently.\nAccepts flexible work schedules and work hours for uninterrupted service to clients and stakeholders.\nContinuously seeks to endeavour and improve knowledge and job function.\nPerforms all duties and responsibilities in a timely and efficient manner in accordance with established company policies in order to achieve the overall objectives of this position.\nMaintains proper flow of information and communication to the hotels and the area sales team.\nShares best practices with the hotels and the area sales team.\nAbides by Radisson Hotel Group and brand specific policies and procedures.Please note that the above-mentioned roles and responsibilities are not limited to and not exhaustive and may be modified and amended in line with the responsibilities of this role at any time.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}