{
    "Job ID": "69866473",
    "Description": "EducationB.E. Electronics/E&TC/ Computer ScienceExperience range3-7yrsDetails of know-how expectedKnowledge of current standards in use (ISO, SAE)\nInterest in Automotive or transportation technologies.\nThe Build Master is responsible for release build activities and maintenance of the configuration management repositories in the software project.\nSynonyms:\nBuild Manager\nBuild Engineer\nResponsibilities\nComplementing to the listed activities above, the responsibilities of this role include:\nManage build status, build quality, and build efficiency collaborating with the proper responsible engineers and using the available DevOps tools and resources.\nChallenge, develop and improve processes to ensure the proper functionality and efficiency of the Build System.\nCreate and maintain required automation for DevOps practices (e.g. Continuous Integration, Continuous Testing, Continuous Deployment, Release, Monitoring & Logging, Infrastructure as Code, etc.)\nAnalyze, design, and evaluate automation systems and scripts aiming to reach fast and reliable feedback to development team.\nDetect DevOps inefficiencies during the lifetime of the project and work to solve them.\nResponsible to analyze, review and have a fast reaction on build results and outputs to assure a “green light” status of the project.\nHelp the team investigate and solve build and test related failures when needed.\nMentor software developers on DevOps best practices.\nCreate and maintain the software configuration, build, and deliver required documentation and coordinate with software project management and configuration management. e.g.: GIT & GitFlow\nCreate and maintain project wiki, dashboards and code repository according to Lear strategy acting as interface with Lear Process Team and DevOps Team.\nMonitor the proper usage and assure the healthiness of the project repositories.\nAct as interface between project team and other departments for the Configuration & Change Management issues and problems.\nReleases: work to address the management and coordination of the product build from development through production by automating the release process\nAnalyze, design, and implement solutions for automated deployments and integration testing while ensuring high availability.\nPerform automated, complete, and consistent releases to customers.\nCollaborate with DevOps Team to resolve incidents and implement DevOps strategies.\nInterface with Software Quality Assurance and Metrics Team to manage the integration of automated metrics and safety measures into all aspects of the platform.\nSupport to collect, verify, and communicate reliable code-based metrics.\nInitiate and coordinate actions with Testing Engineer to identify automated tests needed for the lifetime of the project to test the code from the initial stages (Shift Left Strategy) reaching all the testable levels and quality criteria.\nSupport the project team to include automated tests.\nSkills\nThe main skills needed by a Build Master are:\nDeep knowledge of the Release & Build procedures established in the organization and project.\nKnowledge of the Configuration management procedures\nKnowledge of the Configuration management system & strategy established in the project\nKnowledge of the Configuration management tools used in the organization & project e.g. GIT, SVN\nKnowledge of the change management tools used in the organization & project e.g. Azure Boards, JIRA\nKnowledge of the problem resolution tools used in the organization & project e.g. Azure Boards, JIRA\nDevOps tools knowledge e.g. Azure DevOps\nDeployment Automation & Orchestration\nKnowledge of DevOps and Agile principles e.g. Continuous Integration, Continuous Test, Continuous Deployment\nScripting e.g. PShell, Python, etc.\nHighly motivated self-starter\nLeadership skills to facilitate collaboration and challenge status to drive results.\nBe intuitive to anticipate needs. Be able to understand how the people, culture and processes work together to impact their job to fill the gaps in technology with expert care.\nAssignment Approaches\nThis role can be assigned in the following ways:\nOne team member performs this role exclusively. This commonly adopted approach is suitable for large software projects that are difficult to build or a set of related projects that need to continuously build and release software variants.\nOne team member performs this role and other activities within the software development project. This is a good option for smaller or resource-constrained software project teams.\nAnalytical, problem solving and debugging skills\nCreative and innovative\nShould be a good team player\nExcellent communication skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}