{"Job ID": "69869836", "Description": "About PayUPayU, a leading payment and Fintech company in 50+ high-growth markets throughout Asia, Central and Eastern Europe, Latin America, the Middle East and Africa, part of Prosus group, one of the largest technology investors in the world is redefining the way people buy and sell online for our+ merchants and millions of consumers. As a leading online payment service provider, we deploy more than 400 payment methods and PCI-certified platforms to process approximately 6 million payments every single day. Thinking of becoming a PayUneer and you are curious to know more about us? Read more about the life in PayU here Role: Senior SDETCompany: PayU Finance India Pvt LtdLocation: Bangalore/MumbaiRole Type: FTEResponsibilities:Assures quality within the software application by developing and implementing effective test plans, test cases and test scripts and by assuring the business logic is appropriate and maintained for the client.\nParticipates in production implementation verification and accountable for validating particular enhancement(s). \nEstablishes and maintains test environment, test data, and test tools. \nPlans, documents, evaluates and tracks program testing results to ensure proper operation and freedom from defects.\nWorks with users, systems analysts, designers and programmers to create/analyze various required project documents.\nParticipate in all phases of the test cycle, including Unit Testing, Integration/System Testing, Performance Testing, Load Testing, Regression Testing, User Acceptance Testing, etc.\n Responsible for both manual and automated test tools/techniques\nComplies with the standards in the software life cycle and follows the strategies, plans, and procedures.\nMaintains production software as needed.\nCommunicates and interacts with appropriate groups on problems, changes, and enhancements that may impact data, workflow, and/or functionality.Requirements:Bachelors/Master's degree in Computer Science, Engineering or a related subject \nMinimum 3-6 year’s experience as QA Engineer.\nTest Planning and Execution experience\nExperience working with Development, Business Partners, Production Support, and Change Management partners\nExperience in Agile SDLC\nStrong SQL Query writing Skills\nUnderstanding of End-to-End Testing Cycles using Agile\nHands-on experience in driving the QA release cycle End to end, defect reporting.\nHands-on work experience in preparing Test plans, Test Scripts, and RTM.\nFintech Domain experience is a plus.\nExcellent Communication Skills and Presentation Skills.\nDemonstrated Analytical, Problem-solving, and Interpersonal Skills.\nKnowledge programming language Python/Java.Bonus point if you have:Experience in the Fintech domain and/ or B2C product experience\nAn engineering degree in Computer Science (or) software development experience\nWorked on products with a massive user scale - 1 Mn+ DAUs especiallyWhat we offerA positive, get-things-done workplace\nA dynamic, constantly evolving space (change is par for the course – important you are comfortable with this)\nAn inclusive environment that ensures we listen to a diverse range of voices when making decisions.\nAbility to learn cutting edge concepts and innovation in an agile start-up environment with a global scale\nAccess to 5000+ training courses accessible anytime/anywhere to support your growth and development (Corporate with top learning partners like Harvard, Coursera, Udacity)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}