{"Job ID": "69867283", "Description": "Are you highly motivated by being able to make a difference in improving patients’ lives? Are you an efficient executive who is energized by taking exceptions and able to influence people around you? If so, you should continue reading and apply today!The Region Asia Pacific (APAC) Senior Manager Clinical Quality, Training role provides you the opportunity to work in an efficient team and contribute directly towards the business results while creating values for the patients with diabetes, obesity, and other serious chronic and rare diseases.\n About the department\nNovo Nordisk (NN) is a global healthcare company with 100 years of innovation and supervision in diabetes care. This heritage has given us experience and capabilities that also enable us to help people defeat obesity, haemophilia, growth disorders, rare diseases, and other serious chronic diseases. Headquartered in Denmark, Novo Nordisk employs over 60,000 people in 80 countries and markets its products in more than 170 countries.The position\nAs the Region APAC Senior Manager, Clinical Quality & Training, you will regularly perform risk assessment, develop risk mitigation activities and coordinate the quality, training and education activities for Clinical Operations teams together with clinical quality and training teams located in India, Thailand, Australia and South Korea. This position aids high quality and solid compliance with International Conference on Harmonization (ICH) Good clinical practice (GCP), and relevant regulation Novo Nordisk (NN) internal Standard operating procedures (SOPs). The position should have substantial knowledge of international clinical trial methodology as well as execution/conduct. The position will provide quality status to management as needed in Global councils and forums.This position will be operating from one of the locations- Bangalore, India or Kuala Lumpur, Malaysia and will report to the Region APAC Clinical Operations Director based in Dubai.You will plan, coordinate, and manage GCP Inspection Readiness activities across APAC for Health Authorities (HA) inspections e.g., Food and Drug Administration (FDA) or European Medicines Evaluation Agency (EMA) and acts as the chair in major foreign HA inspections in APAC countries. Work closely and coordinate/lead APAC CQTM group of 10 people. \nMaintain Clinical Quality Management system (QMS) in APAC in line with the Novo Nordisk Global Clinical QMS .\nYou will plan, coordinate, and perform GCP compliance visits to ensure high level of compliance to ICH-GCP, NN SOPs and all relevant local requirement. \nYou will represent APAC in global and other international forums.\nIdentify clinical training needs in APAC countries and prepare yearly training plan and keep up to date accordingly. Develop and maintain training modules for new hires of different roles. QualificationsDegree or higher qualifications in Pharmacy, Life Sciences or other related field.\nAt least 7-10 years of experience in the conduct of clinical trials and 3 years in clinical quality & training areas. Preferably certified as a lead auditor.\nExperienced in GCP (Good clinical practices) Audits & Inspections. \nWorked or experience in clinical quality/GCP quality/GCP compliance/GCP quality oversight/clinical compliance/ clinical quality oversight/clinical operational excellence/clinical excellence areas.\nRequire clinical trials operational experience in roles such as CRA, clinical trial project manager, clinical research manager or clinical trials manager. The candidate is expected to have leadership/line manager experience.    \nWorking at Novo NordiskNovo Nordisk is its people. We know that life is anything but linear, and balancing what is important at different stages of our career is never easy. That’s why we make room for diverse life situations, always putting people first. We value our employees for the unique skills they bring to the table, and we work continuously to bring out the best in them. Working at Novo Nordisk is working toward something bigger than ourselves, and it’s a collective effort. Novo Nordisk relies on the joint potential and collaboration of its more than 50,000 employees. Together, we go further. Together, we’re life changing.Contact\nPlease send your CV online and please be aligned with your current manager on your career aspirations (click on Apply and follow the instructions).Deadline \n7 October 2023We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.#LI-AMS1Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}