{
    "Job ID": "69869512",
    "Description": " Group Overview:  Headquartered in Riyadh, Saudi Arabia, we operate construction and manufacturing businesses, design &  development centers and a host of facilities in the Middle East and other countries.alfanar is involved in:  • Electrical, Electromechanical and Civil Engineering Construction  • Manufacturing and Marketing Electrical Construction Products  • Allied Engineering Services Our Main Divisions:  • alfanar electric  • alfanar Construction  • alfanar Building SystemsThis position exists to perform analyzing user requirements, procedures and system problems to automate and improve efficiently, in timely manner and quality standards as per the defined policies and procedures to achieve departmental operational plans and developments.Process Documentation:Provides reference by writing documentation.\nDevelop and document end to end process of all functions within scope.\nSystem Activation:\nEnsure effective and efficient system activations across all functions within scope.\nDefine and prioritize systems requirements as well as respective activation cycle.Customer Relations:Achieve customer satisfactions through CRM.\nDefines application problem by conferring with clients, evaluating procedures and processes.System Enhancement:Define, tackle, and eliminate process gaps through process engineering methodologies.\nSystematically review and continuously improve applied systems to cope with internal and external fluctuations.HR Proficiency:Ability to obtain updated soft and technical skills related to the job\nTo have a vision and a plan for the career path and how to achieve it.Delivery:Perform the planned activities to meet the operational and development targets as per delivery schedules.\nUtilize resources effectively to achieve objectives within efficient cost and time.\nProvide a periodic report formatted by detailing the deviation and execution of planned tasks.Problem-Solving:Solve any related problems arise and escalate any complex operational issues.Quality:Ensure quality requirements to develop effective quality control and processes including specifications for products or processes or related activities.Business Process Improvements:Coordinate well-defined written systems, policies, procedures, and seek automations opportunities as much as possible.Compliance:Comply to related policy and procedures and work instructions.Health, Safety, and Environment:Ensure compliance of relevant safety, quality, and environmental management procedures and controls within defined area of work activity to guarantee safety, legislative compliance, and delivery of high-quality products/services.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}