{"Job ID": "69866709", "Description": "At Zscaler, we are on a mission to redefine network security for the Cloud and Mobile-First World. The cloud and mobility are creating a mega-shift that’s disrupting 30 years of networking and security infrastructure. Traditional network security architecture is no longer suitable for the cloud and mobile-first world.Zscaler is a pioneer and leader in cloud security and we are enabling the world’s leading organizations to securely transform their networks and applications for the cloud and mobile-first world.With a solution born and built 100% in the cloud, Zscaler employees have built and operate a massive, global cloud security architecture, delivering the entire gateway security stack as a service. By providing fast, secure connections between users and applications, regardless of device, location, or network.Drive business outcomes by developing recommendations based on data (pricing, sales, customer, product)\nCreate analyses that tell a “story” focused on insights, not just data analytics\nDevelop product and pricing performance dashboards to enable extended teams to make decision related to pricing profitability, discounting trends, pricing competitiveness and pricing effectiveness\nDevelop deal pricing tools\nDesign, analyze, and interpret the results of pricing experiments\nApply models on large datasets to measure results and outcomes\nEvaluate various options in terms of appropriate modeling technique/algorithm and apply the one which fits best in the overall business & technical environment\nWork closely with the Pricing, Product, Finance and Strategy teams\nCollaborate with Data Platform teams to improve availability and usability of pricing data and insights in Snowflake and TableauBachelor's or master’s degree in Computer Science/ Management/ Statistics or related fields\n3-5 years of experience in a Pricing Analytics, Business Operations, and/or Data Analytics role, with a focus on analyzing large data sets to solve problems\nExpert knowledge of SQL\nExpert in visualization using Tableau (or similar tools)\nPrior experience in Pricing / Product management at a leading technology company\nEntrepreneurial spirit that thrives in a fast-paced environment, deals well with ambiguity and focuses on driving impact.\nSkills in influencing without authority\nAttention to detail\nIntuition for understanding business needs You should include these in your application: Description of the most interesting analysis you’ve done, key findings, business decisions that were taken and final impact You're encouraged to apply even if your experience doesn't precisely match the job description. Your skills and passion will stand out—and set you apart—especially if your career has taken some extraordinary twists and turns. #LI-AW2Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chandigarh, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}