{"Job ID": "69869110", "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.JOB PURPOSE:Seeking a Diesel Engine Aftertreatment (AT) Design Engineer responsible for providing design concepts, and complex system integration solutions for Caterpillar and Perkins branded engines.\nDesigns should provide superior performance, durability, quality and serviceability.\nThe incumbent is responsible for requirements gathering, design solutions and integration of AT systems, product validation, supplier management, driving strong manufacturing collaboration, and ensuring adherence to Caterpillar Product and Process excellence standards.JOB DUTIES:   Responsible for design solutions and system integration of AT system working with Core Technology experts and team members from multiple locations globally\nResponsible for planning and delivery of complex design projects\nResponsible for drawing and model quality\nEstablish, develop and maintain strong relationship and collaboration with Manufacturing and Suppliers, building consensus and ensuring product is developed first time right\nAdhere to Caterpillar Lean development principles\nDrive innovation and foster continuous learning\nAdopt flexible approach to ensure enough overlap of working hours with teams in USA/UK/China as needed\nBe willing to travel aligned to business requirementsBACKGROUND/EXPERIENCE:Requires an accredited Mechanical/Automobile Engineering degree\n6+ years of combined experience in Component and System Development for Diesel Engines Aftertreatment\nExperience in DOC, DPF and SCR canning design/development\nExperience in DEF mixing systems design/development\nExpert knowledge of Pro-E / Teamcenter/ GD&T\nAbility to develop new design concepts that meet cost, quality, and manufacturability targets\nExperience with standard NPI process tools such as FMEA, DVP&R, APQP, PPAP, BIQ, etc.\nStrong ability to communicate technical information effectively with team members and others in the work group, as well as employees in other units, customers and suppliers\nVAVE execution, Cost Reduction experience\nStrong communication skills – oral and written\nGood knowledge of Caterpillar productsTOP CANDIDATES will have:Advanced degree from reputed institution\n3+ years of Aftertreatment component (DOC/DPF/SCR canning/DEF mixing systems) design and/or development experience working with global and regional teams\nExperience in working with regional/global suppliers\nGood knowledge of cross functional roles in domains such as Manufacturing, Purchasing, Quality, related to engines / ATAbout Mechanical Design Division (MDD)Are you a person that stops to marvel at the awesome sight of a Caterpillar machine hard-at-work? Do you enjoy learning in a highly technical environment that also produces the maximum number of Innovations? Come and join the Mechanical Design Division (MDD) where engineers work to translate technical concepts into practical mechanical applications that work first-time-right.Using fundamental engineering principles combined with modern technology and tools, MDD engineers work on a range of designs related to Machines, Engines and Components. Through due diligence, MDD engineers design a concept, optimize it, build it, test it, and release it to production through close collaboration with suppliers and manufacturing to produce a world class product for both regional & global markets. MDD also encourages and supports upskilling via hands-on opportunities during the product lifecycle.Come join our team and engineer the future mechanical products today!Benefits:Our goal at Caterpillar is for you to have a rewarding career. Our teams are critical to the success of our customers who build a better world.Here you earn more than just a salary. Because we value your performance, we offer a total rewards package that provides day-one benefits, including but not limited to:Competitive salary and annual bonus program\nMedical Insurance\nTerm Life Insurance\nShort Term Incentive Plan (STIP)\nPaid time off plan (Vacation, Holiday, Volunteer, Bereavement)\nPaid parental leave (Maternity, Paternity, Adoption)\nCreche facility for women employees\nRelocation allowance and Reimbursement\nEmployee Assistance Program\nCaterpillar Tuition Assistance Program (CTAP)\nFlexi pay Benefit Program\nNational Pension Scheme\nEmployee Investment Plan\nLeased Car Program (Salary Grade 21 & above)Employees can also join one of the 14 Employee Resource Groups (ERG) and participate in the various activities that promote a positive and inclusive employee experience.Caterpillar also encourages and supports it employees to volunteer in the various Corporate Social Responsibility (CSR) initiatives that contribute directly to our communities.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}