{
    "Job ID": "69866507",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Position Title: Software EngineerReporting To: ManagerWork Location: BangaloreEurofins IT Solutions, Bengaluru, Karnataka, IndiaWith 36 facilities worldwide, Eurofins BioPharma Product Testing (BPT) is the largest network of bio/pharmaceutical GMP product testing laboratories providing comprehensive laboratory services for the world's largest pharmaceutical, biopharmaceutical, and medical device companies.Behind the scenes, BPT is enabled by global engineering teams working on next-generation applications and Laboratory Information Management Systems(LIMS). These are sophisticated computer programs that will be used by our scientists, engineers, and technicians to document research, experiments, and procedures performed in our international network of laboratories.This role reports to a Manager.Required Experience and SkillsExperience:2 to 5 years of experience with developing end-to-end web applications using Microsoft stack of technologies.\nStrong working knowledge of Web application development using .NET, C#, Asp.net, MVC, WebAPI.\nStrong Working knowledge of Angular 2 or above, JavaScript, TypeScript, jQuery, HTML5 and CSS3.\nGood working knowledge of MSSQL – SQL etc.\nExperience with usage of TFS\nFamiliar UI testing and Unit Testing (MS Test/ Jasmine/ MOQ/ NUnit/ Karma etc.)\nGood understanding of object-oriented programming (OOP)\nStrong working knowledge of SOLID principles and design patterns that includes Creational, Structural, Behavioral\nStrong experience in designing and working with n-tier architectures\nAble to provide technical recommendations and solve technical problems\nShould have working knowledge on Code review that includes, raising code review, resolve comment reviews, Closing code reviews.\nShould be aware of best practices in programming\nShould know how to troubleshoot performance-related issues, how to write efficient code and query, how to use SQL profiler\nShould have worked on at least one SOA (Service Oriented Architecture) project\nShould have worked in an AGILE practice methodology (preferably SCRUM)Desirable ExperienceStrong skills in frontend development technologies like Angular, Html, Javascript, CSS etc\nStrong orientation towards writing clean/performant code, applying design/SOLID principles and OOPS concepts with Microsoft technologies.Required Qualifications:Bachelors in Engineering, Computer Science or equivalent.Personal Skills:The successful candidate will have a self-motivated, get-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas, working with uncertainties; and the discipline to pay attention to deadlines, details and quality.\nGood communication and interpersonal skills.\nQuick learner, strong troubleshooting skillsPERFORMANCE APPRAISAL CRITERIA:Eurofins has a strong focus on Performance Management system. This includes quarterly calibrations, half-yearly reviews and annual reviews. The KPIs shall be set and may vary slightly between projects. These will be clearly communicated, documented during the first 30 days of your joining.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}