{
    "Job ID": "69866210",
    "Description": "OverviewOracle is leading the digital revolution. We are empowering nearly half a million businesses across the globe to turn untapped potential into real business value. You will connect the biggest enterprises of today with the tools to compete in the digital economy of tomorrow.About Oracle HardwareOracle hardware includes a full suite of scalable engineered systems, servers, and storage that enable enterprises to optimize application and database performance, protect crucial data, and lower costs. Organizations improve database performance, simplify management, and lower costs with exclusive features and automated operations not available with other solutions. Oracle hardware is used by thousands of customers worldwide to run and protect business-critical Oracle Databases and applications with high performance, scale, and security, while reducing administrative burdens and TCO.Hybrid cloud architecture uses both a public cloud provider, such as OCI, and on-premises infrastructure to meet enterprise IT needs. This approach provides the flexibility to move some workloads to the public cloud while retaining others on-premises. Hybrid cloud architecture is gaining importance as certain workloads cannot be moved to public cloud data centers for reasons that include data residency, network latency, and infrastructure performance requirements. Dedicated region deployment options such as Oracle Alloy and Oracle Cloud@Customer are the only offerings among public cloud vendors that bring a complete portfolio of more than 100 cloud services into customer data centers, enabling hybrid cloud architectures.DescriptionWhat You’ll DoBe the vital piece of the puzzle that connects us to the millions of businesses that need our help to evolve. This position is responsible for new account development and/or expanding existing accounts within an established geographic territory. You will:·Work as part of an account team to identify, qualify and deliver Hardware products/ solutions. Responsible for the account plan to drive goal attainment in assigned territory.·Coordinate with the other members of the sales team (employees and partners) to support account sales and business development strategies.·Help identify and engage the appropriate partner to meet customer specifications. Becomes trusted advisor to key customer influencers and decision makers.·Drive company's strategy into assigned accounts.·Follow all companies' methodologies and processes related to sales opportunity pursuit.·Ensure that the company's sales programs are known and executed in assigned territory, including personal follow-up and engagement in selected opportunities.·Achieve or exceed the quarterly and annual sales goals.Required Skills/ExperienceWhat You’ll BringYour enthusiasm, knowledge, and customer-centricity will help us become the number one cloud company in the world. We also look for:· 8-15  years relevant work experience. ·Hunting experience (vs. working with known customers – continuous search for new customers in a programmatic manner) is strongly preferred.·Strong business acumen with the ability to identify and pursue sales opportunities to closure·Ability to nurture customer relationships, understand their unique business realities to develop strategies and enhance Oracle’s share of the market·High level of communication skills, both written and oral / excellent presentation skills·Influencing and negotiating skills·Customer focus and ability to build relationships·Consultative selling experienced, able to position solutions at an executive level.·Self-motivator with the ability to work independently (as required)BenefitsWhat We’ll Give YouA career at Oracle is defined by you. We give you the freedom—and the skills—to write your own success story. Whatever avenue you go down, you’ll gain priceless learning experiences and be supported to do your best work.·Multinational working environment that brings people from diverse backgrounds, perspectives and abilities together·Corporate culture that promotes diversity, inclusion and innovation·Exposure working with a leading Technology firm at an exciting time where the focus is on Cloud whilst experiencing growth and transformation!·Competitive benefits Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Islamabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}