{
    "Job ID": "69866959",
    "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.As a  Software Engineer(multiple levels), you will work on building the next generation Zscaler Private Access (ZPA) product and Shift product in the Emerging Technology group. You will play a crucial role in designing, building, and enhancing distributed systems components, write high-performance code using very efficient algorithms, and ensure that memory is used efficiently so that system responsiveness is maintained during high load times. You must also be able to process packets at both ingress and egress points at very high speed so that the client using the system does not perceive any increased latencies. Additionally, you will collaborate with the operations team (OPS) to deploy, monitor and if required patch the changes with fixes and enhancements as well as continuously scale the systems as more customers/users get added, The engineer should be able to identify hotspots, and timely alleviate/remediate the situation.Come and join our team and be part of this exciting transformation to cloud-based security.   Build robust and scalable data infrastructure (both batch processing and real-time) to support needs from internal and external users·     Design Database schema and modeling, designing and implementing API's that provide access to feature and functionality with an eye towards scale and security·     Maintain and enhance a platform to collect and ingest several billion (and growing) log events from our globally distributed cloud infrastructure and provide actionable insights and visibility to our customers and researchers. 10+ years of experience in Java development in a highly distributed and enterprise-scale environmentExtensive experience in Microservices and scalable environments.Good experience in design and architecture.·     Strong database knowledge of SQL constructs, and data modeling·     Familiarity with implementing services following the REST model ·     Ability to learn, evaluate and adopt new technologies·     Bachelor Degree in computer science or equivalent experience·     Experience working with streaming data processing infrastructure and/or experience with identities and access management systems, like Okta, SAML protocols, and security services.·     Experience with data serialization techniques and data stores for persisting events.·     Working knowledge of cloud infrastructure services on AWS/Azure.#LI-MS6Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}