{
    "Job ID": "69867954",
    "Description": "The global leader in public transport infrastructure, SYSTRA has specialized in the mass transit and rail market since 1957. The main shareholders of SYSTRA are SNCF and RATP. Its ambition is to serve emerging needs for collective and sustainable mobility throughout the world. With a presence in 80 countries, SYSTRA manages over 3,000 projects for high-speed systems, traditional rail lines, metros and tramways throughout the world.In India, SYSTRA is an international consulting and engineering company operating in the fields of Metros, High Speed Rail, Railways, Roads, Buildings, Urban planning, and Water & Environment for public and private organizations.Our engineers work with passion to deliver the most reliable, cost-effective and made-to measures solutions allowing end users to move seamlessly.SYSTRA’s unique expertise is backed with a reputation built through technical excellence delivered on projects. Thanks to our know-how of our employees spread across India, we are present at all stages from upstream studies to operation and maintenance. We provide a comprehensive solution to manage all kinds of missions: Detailed Design Consultant, Project Management, Independent checking services.SYSTRA has built a reputation of technical  excellence by delivering successful highways projects, both in Design and Construction Supervision,  across the world. In India, we have been providing design and construction supervision services for various National highways, State Highways/PWD and other road projects for various government institutions and private organizations since 1982.Our design teams are have experience of designing in accordance with various international codes as the design centre in India has delivered projects across the world. We are also conversant with BIM (Building Information Modelling) which enhances all stages of the infrastructure life cycle, from design to construction and maintenance, which is why we integrate it into our projects and offer it to our clients. Our design and supervision teams have extensive exposure to both domestic and international markets, contracts, codes and specification.The RoleWith ambitious growth plans, this is an exciting time to join SYSTRA Ltd as we continue to develop and raise our profile in the India with the recruitment of a Senior Bridge Engineer. The role could be based on our Faridabad/Ahmedabad/Kolkata/Bangalore/Chennai Offices. The Bridges team at SYSTRA has an exciting pipeline of work and will be continuing its growth throughout 2022.Main DutiesCarry out Hydraulic study for bridges & culverts where required.\nTo prepare inventory and carrying out condition survey for Bridges, Flyover, Grade separated structures, ROB/RUB, Culverts etc.\nTo prepare detail proposal for widening and strengthening of the structures.\nTo co-ordinate activities between field and office.\nTo prepare a design standard, technical specification and finalize list of drawing with the use\nof Auto CAD department.\nJoin kick off meeting for assigned projects.\nPreparation of Improvement Proposals, Designs & drawing production.\nTo carryout Detail Design for Bridge Components /Canopy /Toll Plaza Buildings using Indian & International Standard code in Practice.\nTo carryout BOQ & Cost estimate for different type of structures\nTo carry out Client meeting/ Design Coordination as per requirement of Domestic / International Assignment.ExperienceGraduate in Structural Engineering\nPostgraduate in Structural Engineer\n05 to 10 years of design experience through STAAD Pro, Midas Civil, Auto Cad.\nMust be outgoing and self-motivated with a strong desired to excel; and the ability to lead others.\nMust have strong time-management skills and ability to multitask and maintain focus and discipline\nMust have excellent written and oral communication skillsWe commit to put people who join us at the heart of improving transportation and urban infrastructure efficiency. As we are growing, this is time to be a part of this challenging adventure.It’s not a job - it’s a career!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}