{
    "Job ID": "69866315",
    "Description": "Please note - this is a local position, only candidates with existing work permit in Turkey (either Turkish Nationals or Turkish ID holders will be considered).Four Seasons Hotels Istanbul is seeking a Reservations and Communication Agent. Don't miss this unique opportunity to be part of our award winning team, while excelling your career with the world's leading luxury hotel company!Join our TeamThe  Reservations and Communication Agent works directly with the Director of Reservations, responsible for selling the hotel and providing information to the guests and The PBX Operator position is the front line for all incoming calls to the hotel. Agents are to capture sales from incoming calls and coordinate details of each reservation to ensure to hundred percent guest satisfaction. The agent’s demeanour should reflect the quality of the hotel to our potential guests with a positive attitude, knowledge of the hotel and attention to details.Ideal CandidateWe are looking for individuals who possessHigh level of professionalism and integrity while maintaining the confidentiality of the office\nStrong writing capabilities and a solid working knowledge of all MS systems; Word, Excel and OPERA\nAdvanced proficiency in English and Turkish, second language is preferred.\nHigh attention to detail, strong organization skills, result orientation and the ability to multi-task in a fast paced environment\nA positive attitude and a can-do approach to any task\nDynamic adaptability and flexibility to the needs of hospitality industry work schedule\nSuperior communication skills The ideal candidate has a minimum of two years of experience in Reservations / Front Desk operations. A degree in a related field is preferred, however, not essential if applicants have previous relevant work experience. About Four Seasons Hotels Istanbul\nA thriving metropolis that connects continents, cultures and religions, Istanbul captivates all who visit. Within this cradle of civilization, Four Seasons provides an oasis of quality and beauty in two unsurpassed locations. Four Seasons Hotel Istanbul at the Bosphorus shines with a modern, almost resort-like experience that welcomes guests with luxurious sophistication. Like staying in a friend’s home, Four Seasons Hotel Istanbul at Sultanahmet greets guests with a warm embrace, and ushers them to a front row seat to culture, peeling back layers of history as they discover more about the world.  Sky’s the Limit\nFour Seasons Hotels and Resorts have been ranked FORTUNE magazine’s ‘100 Best Companies to Work For’ every year since 1998... Come and find out why! With over 100 hotels in 38 countries, Four Seasons is dedicated to perfecting the travel experience through continual innovation and the highest standards of hospitality. The deeply instilled Four Seasons culture is personified by its employees – people who share a single focus and are inspired to offer great service.What to Expect\nCompetitive Salary & Wages\nPrivate Health Insurance\nExcellent Learning and Development opportunities\nComplimentary Accommodation at other Four Seasons Hotels and Resorts\nComplimentary Dry Cleaning for Business Attire\nComplimentary Employee MealsDiscounted Indoor Parking Privileges\n… and so much more!\nLearn more about what it is like to work at Four Seasons, visit us:\nhttp://jobs.fourseasons.com/\nhttps://www.linkedin.com/company/four-seasons-hotels-and-resorts\nhttps://www.facebook.com/FourSeasonsJobs\nhttps://twitter.com/FourSeasonsJobsLegal Disclaimer:7 Nisan 2016 tarihli Resmi Gazetede yürürlüğe giren 6698 Sayılı Kişisel Verileri Koruma Kanununa istinaden, özgeçmişinizde yer alan kişisel bilgileriniz kurum bünyesinde oluşacak mevcut ve gelecek işe alım talepleri doğrultusunda istihdam amaçlı kullanılacak olup, kişisel bilgileriniz veri tabanımızda gizlilik içerisinde saklanacaktır.Özgeçmişinizin veri tabanımızda istemediğiniz takdirde contactus.bosphorus@fourseasons.com adresi ile iletişime geçmenizi rica ederiz.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}