{"Job ID": "69867288", "Description": "Lead, Development-(2300017331)Job:TechnologyPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 7:50:45 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleLooking for a Datastage Developer whose primary responsibility will be application development and production support.The candidate will be part of a team that works with Business Analysts, Operations, Quality Assurance Testers and other System Professionals. The candidate will also be responsible for trouble shooting and resolving support issues.Key ResponsibilitiesAnalyse business requirements then design and develop applications to support them.\nDesire to work on multiple Databases like Oracle, DB2, Mango DB, SQL Server.\nDevelop, execute, and manage Datastage, Oracle PL / SQL programs units procedures, functions, packages and database triggers.\nParticipate in various projects and new initiatives; develop / deploy and make suggestions as a technical resource involving Oracle 12c / 19c Database Server, as well as performing duties such as documenting requirements, sources – to- target mappings, and program logic, designing solutions, testing, and implementation.\nDesign and develop of software primarily complex PL / SQL batching with JAVA Coding.\nDevelop and maintain system documentation, including technical specifications, data mapping, program logic and flowcharts.\nPerform additional duties and projects as assigned by management.\nDesire to learn Windows, Unix, Linux and HP-UX environment.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Our Ideal CandidateBachelor’s degree in Computer Science, Engineering, or equivalent work experience.\nStrong 4 years of experience required.\nMust have demonstrated experience in Datastage, Control-M.\nworking knowledge of Oracle PL / SQL, Software Development Lifecycle and Eclipse IDE.\nStrong experience in Application Development with knowledge of full software development life cycle.\nExperience with Java preferred and understanding of database deployment architectures.\nMust meet performance standards including attendance and punctuality.\nExcellent verbal and written communication skills and leadership skills.\nMust be able to manage priorities and handle simultaneous demands; willingness to work in a fast paced and demanding environment.\nIBM DataStage certification or similar.Role Specific Technical CompetenciesDatastage\nOracle DB\nUnix\nControl-M­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\nBe better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long termIn line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locations\nTime-off including annual, parental / maternity (20 weeks), sabbatical (12 weeks maximum) and volunteering leave (3 days), along with with minimum global standards for annual and public holiday, which is combined to 30 days minimum\nFlexible working options based around home and office locations, with flexible working patterns\nProactive wellbeing support through Unmind, a market-leading digital wellbeing platform, development courses for resilience and other human skills, global EmployeeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}