{"Job ID": "69868575", "Description": "Dear trailblazers, forward-thinkers, and doers - We want you. DataStax is at the forefront of the generative AI revolution, with proven technologies that empower any organization to deliver the AI-powered applications that are redefining business. The companys marquee product is Astra DB, the industrys only vector database for building real-world, production-level AI applications using real-time data. Built on Apache Cassandrathe massively scalable open source database proven by AI leadersAstra DB is the data engine for responsive AI applications that consistently deliver accurate results, without artificial hallucinations. Thousands of developers and hundreds of the worlds leading enterprises, including Audi, Capital One, The Home Depot, Verizon, VerSe Innovation, and many more rely on DataStax technologies. Learn more at DataStax.com We subscribe to a set of principles that guide how we collaboratively work together. We inspire each other with our values, obsessing over developers and enterprises, taking action and focusing on results, innovating in technology, products, and everything we do, and defining success as the team winning. We foster a diverse working environment that is respectful, generates new ideas, promotes ownership, and encourages highly motivated individuals to shape tomorrow. These form the foundation of the DataStax culture and help drive our decisions.We are looking for an India Sales Leader to increase AstraDB market share for DataStax. This will be a player/coach role. By prospecting to commercial accounts within an assigned region, you will be responsible for driving new business and managing an install base for both customer satisfaction and upsell/cross-sell opportunities.What you will do:Lead AstraDB opportunities and drive new logos in some of the fastest scaling and growing companies in the market/industry.\n\nGuide and manage the activities of the Account Executives within assigned region to ensure that company revenue goals and objectives are exceeded\n\nDevelop and execute on a business plan to expand business into new accounts throughout a given region\n\nJuggle the closing of current-quarter deals while nurturing longer-term opportunities\n\nCoordinating and managing weekly and monthly one-on-one and team pipeline reviews, meetings and training sessions to ensure ongoing improvement and best-practice sharing.\n\nManaging daily and weekly activities, pipelines, forecasts and closed deals to ensure above quota results based on successful pipeline management\n\nAttracting, hiring, onboarding and retaining top sales talent; managing attrition\n\nDisplay a thorough understanding of business needs and revenue potential for accounts in the assigned region\n\nWork with team members individually as needed while always promoting a healthy team environment\n\nSupporting the sales team in their sales meetings with prospects\n\nOther duties as assigned by leadership\n\nGenerate leads from trade shows and regional networking events.\n\nEnsure 100% customer satisfaction and retentionYour experience should include:Excellent C-level communication skills\n\nMinimum of 5-7 years enterprise software sales experience successfully selling solutions at the C-level (preferably CMO's) with 3+ years of direct sales management experience\n\nExperience managing and building a team of successful SaaS and or Cloud sales professionals\n\nProven leadership ability to influence, develop and empower employees to achieve objectives with a team approach\n\nTotal comfort demonstrating SaaS/cloud-based software and discussing it with business leaders\n\nStrong track record of exceeding company sales quotas in a complex sales environment\n\nExperience in territory management and planning, at the regional and account levels\n\nProven expertise with teaching, coaching and training sales methodologies\n\nStrong written, verbal, presentation and organizational skills required\n\nWilling to travel as needed throughout the regionNot sure if you qualify?Apply anyway! We extend opportunities to a broad array of candidates, including those with diverse workplace experiences and backgrounds. Whether you're new to the corporate world, returning to work after a gap in employment, or simply looking to transition or take the next step in your career path, we are excited to connect with you.#LI-RemoteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}