{
    "Job ID": "69869744",
    "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob DescriptionSatış ekibine aktif destek olmak, satış ekibiyle uyumlu çalışmak,\nŞube deposunda yer alan ürünlerin haftalık ve aylık periyodlarda sayım & envanter işlemlerinin gerçekleştirilmesi, sipariş çekilmesi ve stoğu azalan ürünlerin takibini yapmak,\nŞube deposunda yer alan ürünlerin FİFO kuralına göre tasnifi ve depolanmasını sağlamak,\nŞubeye gelen ürünlerin sayım yapılarak kontrollerinin sağlanması ve depoya tasnifini gerçekleştirmek,\nŞubedeki paletlerin envater takibi ve merkeze geri gönderimini sağlamak,\nToptancı müşterilerimizin ürün teslimatlarına destek olmak,\nServis araçlarının sabah satışa hazırlanması ve ürün zimmetleme işlerinin gerçekleştirilmesi ve servis araçlarının servis dönüşü ürün kontrolünü yapmak,\nŞube rampa ve çevresinin düzenli ve temiz kalmasına destek olmak,\nŞube müdürünün bildireceği işleyişle ilgili diğer işlemleri yerine getirmek.Desirable requirementsEn az lise mezunu veya tercihen Meslek Yüksek Okulu Elektrik, İklimlendirme ve Soğutma bölümlerinden mezun,\nDepoculuk işinde en az 1 yıl iş deneyimine sahip,\nBilgisayar kullanabilen (Excel bilgisi iyi olan),\nOrganizasyon becerisi gelişmiş,\nYoğun iş temposuna uyum sağlayabilecek,\nTercihen sürücü belgesine sahip, \nİzmir Gaziemir ilçesinde veya yakın civarda ikamet eden.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Izmir, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}