{
    "Job ID": "69866357",
    "Description": "Company DescriptionDentsu Media is the largest area of specialism within the dentsu network. It is brought to markets globally, through three award-winning agency brands: Carat, iProspect and dentsu X. All three are underpinned by a scaled network offering of talent, capabilities, and services to support, grow and transform the world’s leading advertisers. Operating across more than 145 countries, dentsu Media is trusted by leading brands across a broad range of sectors, from pioneering technology to cutting-edge fashion. Dentsu leverages technology, creativity, and in-depth data analytics to drive superior results that amplify its clients' brands. Dentsu Media is transforming advertising as a force forgrowth, a force for good and has become the destination for employees to cultivate meaningful careers and for brands to accelerate previously unseen, sustainable growth.Job DescriptionDevelop and generate holistic performance reports covering a range of digital channels, including search, social media, programmatic advertising, and other relevant platforms.\nCollaborate with cross-functional teams to gather necessary data and metrics for inclusion in the reports.\nCreate post-campaign wrap reports that encapsulate the effectiveness and results of each digital campaign.\nUtilize analytical tools and techniques to extract meaningful insights from data and present them in a clear and concise manner.\nGathering and procuring data from digital vendors (including direct purchase platforms like Samsung, Native touch, Waze, etc.) to formulate the report.\nComprehending the reports provided by the vendors and initiating further inquiries or follow-ups for enhanced clarity in cases where the reported figures lack coherence or are not easily interpretable.\nIdentify trends, patterns, and opportunities for optimization within digital campaigns through data analysis.\nCollaborate with other team members teams to understand campaign objectives and KPIs (Key Performance Indicators) to ensure accurate reporting.\nStay up to date with industry trends and best practices in digital marketing and reporting.Experience in digital marketing, analytics, Reporting or a similar role.\nStrong proficiency in analytical tools and platforms used for digital marketing reporting.\nExcellent communication skills, with the ability to translate complex data insights into actionable recommendations.\nDetail-oriented approach with the ability to maintain accuracy while working with large datasets.\nFamiliarity with various digital marketing channels, including search engines, social media platforms, programmatic advertising, etc.\nPrevious experience in creating wrap-up reports at the conclusion of campaigns is highly desirable.\nProficiency in data visualization tools and techniques is a plus.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}