{"Job ID": "69866722", "Description": "Job Purpose• Overall responsibility for all aspects related to liabilities, Insurance Define strategy for each product in terms of P&L, distribution strategy/execution, proposition build, financial management, regulatory and compliance requirements. • Support the respective sales team to achieve Banking sales / revenues and promote the cross selling of bank products to all existing clients.• To ensure that respective sales team is providing clients with personalized service to develop close relationships, achieve maximum profitable contribution to the client and the bank, retain their loyalty and respect, and successfully meet customer expectations.• To support the team and help to source new business of all segment clients through referrals, campaigns, partnerships, marketing activities, and personal contacts.Key Result Areas• Define Strategy for all businesses, Deposit and Insurance business • Define & Manage business plans; balance sheet and P&L  • Identify key capital expenditure initiatives and project manage delivery• Align staffing and resourcing of delivery channels with the target / plans • Influence the performance of delivery channels by defining right KPIs, ensure effective remuneration & performance management techniques and training to achieve the product objective. • Identify and equip the front line with the right tools to understand customer needs, evaluate and recommend improvement to business models.• Guide, align and manage the product & customer experience in coordination with stakeholders;1. Executing overall strategies and product level plans to ensure the delivery of commercials objectives: Develop effective commercial initiatives & prioritize delivery & delivery of commercial objectives. 2. Developing of products to support portfolio growth as well as increased penetration and overall profitability on all businesses. 3. Customer Management:  define and implement product segment level strategies. Identify and manage sub-segments. Ensure effective marketing and sales support for strategy implementation. Follow through strategies to implementation to increase share of wallet & deliver profitability.4. Enhancing penetration. Profitability and retention by working with other product managers, Sales Management, Marketing Communications, Retail Credit Centre, Customer / Market Research, Operations and the Marketing Committee.5. Product & process management: all product level campaigns and interaction with the stakeholders. 6. Identifying product gaps & bundling opportunities, process efficiencies with the product team and process owners and work together to improve customer satisfactions. • Enhancing product sales and profitability performance.• Negotiate commercial tie-ups with 3rd party vendors for delivery of customer benefits.• Managing commercial tie-ups with 3rd party vendors for delivery of customer benefits.• Continuously refine the financial & nonfinancial benefits (on boarding experience, customer promises and moment of the truth etc.)• Enhancing product value proposition for all segments and ensure best experience to the client..• Launching targeted marketing campaigns (mix of ATL, BTL, Sales contests, customer offers, bundles etc.). Development of product-specific marketing plans.• Set-up & manage the banc-assurance business to ensure that sales and P&L targets are met in addition to handling relationship with insurance provider/s. • Ensure that full product suite is being offered and all channels are sourcing banc-assurance. • Ensure acceptable cancellation & collection ratios are being met. Knowledge, Skills and Experience• Minimum of 12 plus years of proven background in Retail Financial Services with a min of 5/6years experience in related businesses.• Experience of working within large and complex financial institution.• Strong managerial, analytical, problem solving, strategic planning, interpersonal and leadership skills & Business case development, including financial modeling and analysisJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}