{"Job ID": "69868098", "Description": "We have a number of fantastic opportunities for Clinical and Counselling Psychologists to work for a mental health and wellness centre providing high quality outpatient services to children, adults, couples and families. Arabic speakers are also required for some of these roles.Located in Dubai, our client brings together an international team of licensed psychologists, psychiatrists, occupational and speech & language therapists offering a range of treatments and working with corporations, schools, hospitals, the government and other organisations to promote mental health and well being through a broad range of seminars and workshops.  Requirements; Masters or Doctorate level qualification in Clinical, Health or Neuropsychology;\nExpertise working with adults, couples, families, adolescents or children; \n5+ years' experience post Masters Degree or 3+ years' experience post PhD in more than one setting and not only private practice; \nQualifications from US/UK/Western Europe/Australia/South Africa;\nMust be licensable by the Dubai Authorities; LocationDubai is the largest and most populous city in the United Arab Emirates. On the southeast coast of the Persian Gulf it is the capital of the Emirate of Dubai, one of the seven emirates that make up the country.Dubai is extremely well known for its warm hospitality and rich cultural heritage. With year-round sunshine, intriguing deserts, beautiful beaches, luxurious hotels and shopping malls, fascinating heritage attractions and a thriving business community, Dubai receives millions of leisure and business visitors each year from around the world. Dubai has attracted world attention through large construction projects and sports events, in particular the world's tallest building, the Burj Khalifa.How Head Medical can helpArranging a position overseas is very exciting, but we understand that it can also be daunting and time consuming. We’re the UK’s specialist in international medical recruitment and we’ve helped many Doctors relocate since we first started out in 2008 (you can read what people have said about working with us on our testimonials page). We know it’s important to balance career opportunities with lifestyle and we’ll talk through your plans and will get to know you to make sure we find the right role in the right location. \n\nOnce we have secured a job for you, we’ll manage the Medical Registration and Visa application process, and support you (and your family) with the relocation itself.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}