{
    "Job ID": "69865519",
    "Description": "Support business excellence management processes to prioritize resources, maximize the contribution and capture optimization opportunities within the Downstream Directorate. This includes business process management; business procedure management, corporate procedure management, data management, quality management; change management; benchmarking; reporting audit finding, knowledge management, and digitalization landscape architecture management.\nExecute and support all initiatives related to Downstream Business Continuity Management “BCM” and Enterprise Risk Management “ERM” and ensure effectiveness of resources, processes, procedures and tools.\nDevelop and implement business excellence initiatives, framework and approach for ADNOC Downstream Directorate and associated group companies. Support the creation of a corporate culture where excellence is achieved, fostered and sustained through building innovation capabilities, ensuring organizational change and quality are well-managed using various methods such as enhanced internal communication, quality tools, innovation tools and change management practices.\nSupport all initiatives under innovation and improvement, corporate quality, internal communications and change management portfolios. This includes the ADNOC Integrated Management System to maintain ISO standards and Audit & Management Action Plans.DM&T Business Continuity ManagementParticipate in the overall implementation of the Directorate HQ Business Continuity Management “BCM” Program with the involvement of concerned DM&T Functions.\nIdentify Department’s potential problem areas and single points of failure that may result in interruptions to critical processing operations.\nCoordinate routine updates to the detailed information supporting the Business Continuity procedures within the Directorate.\nParticipate in general and specific Business Continuity training and workshops to fulfil the assigned “BCM” roles and responsibilities.\nFollow-up DM&T Functions BIA updates in addition to the Directorate BCP approval and submission.DM&T Quality ManagementAssist in the establishment of an overall quality culture throughout the Directorate by adopting various methods, tools, international standards and best practices to ensure full adherence to the Corporate Quality Management directives, programs, policies and procedures.\nSupport the development of Self-Assessment culture & single point of repository for auditing purpose.\nConduct workshops with the Directorate assigned Focal Points to develop related ISO documentations such as Communication Plan, Issues Register, Legal Register, Interested Parties Register and Opportunity Register in compliance with corporate IMS requirements.\nCoordinate different levels of audits with ADNOC Corporate IMS and A&A teams in addition to the external audit (Third Party). Ensure all the necessary documentations are well maintained and updated to achieve “Zero” nonconformity and obtain ISO 9001:2015 Certificate.\nResolve any non-conformance activities within Directorate and perform the analysis and identification of the root causes. Develop corrective or preventive actions and ensure future conformance.\nSupport in the development of the Directorate’s annual QMS objectives & targets plan and regularly monitor its implementation. Update the Directorate QMS: organization structure, roles & responsibilities & assigned focal points for better communication within DM&T employees & to foster the collaboration.DM&T Enterprise Risk ManagementSupport in the implementation of the Directorate Enterprise Risk Management “ERM” activities in coordination with ADNOC Corporate ERM team.\nFollow-up quarterly risk reviews and updates across the Directorate Functions. Submit DM&T quarterly risks to ADNOC Corporate ERM team as per the agreed & communicated milestones.\nProvide comments and area of improvements on RSA Archer System for process enhancement.\nSupport DM&T reporting Group Companies in quarterly risk submissions and RSA Archer System implementation in coordination with Corporate ERM team.\nParticipate in ERM periodical “Community” meetings as scheduled by Corporate ERM team to discuss accomplished achievements, ERM reporting calendar, new guidelines/initiatives and risks submissions.DM&T Change ManagementSupport in the implementation of Change Management process within the Directorate & in coordination with DM&T assigned Focal Points to align with the corporate procedure and close audit action(s), if any\nCoordinate risk and mitigation plans and participate in the development of solutions, which add value to the business and increase the Directorate’s performance.\nAssist in risk reviews of proposed changes & assess impact on overall change management process.Supervision\n•    Plan, supervise and coordinate all activities in the assigned area to meet functional objectives.\n•    Train and develop the assigned staff on relevant skills to enable them to become proficient on the job and deliver the respective section objectives.\nBudgets\n•    Provide input for preparation of the Section / Department budgets and assist in the implementation of the approved Budget and work plans to deliver Section objectives. \n•    Investigate and highlight any significant variances to support effective performance and cost control.\nPolicies, Systems, Processes & Procedures\n•    Implement approved Section / Department policies, processes, systems, standards and procedures in order to support execution of the Section’s / Department work programs in line with Company and International standards.\nPerformance Management\n•    Contribute to the achievement of the approved Performance Objectives for the Section / Department in line with the Company Performance framework.\nInnovation and Continuous Improvement\n•    Design and implement new tools and techniques to improve the quality and efficiency of operational processes.\n•    Identify improvements in internal processes against best practices in pursuit of greater efficiency in line with ISO standards in order to define intelligent solutions for issues confronting the function.\nHealth, Safety, Environment (HSE) and Sustainability\n•    Comply with relevant HSE policies, procedures & controls and applicable legislation and sustainability guidelines in line with international standards, best practices and ADNOC Code of Practices.\nReports\n•    Provide inputs to prepare Section MIS and progress reports for Company Management. Bachelor’s Degree in Business Management/Engineering/Economics or equivalent. 8 years of relevant experience preferably in an oil and gas industry.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}