{"Job ID": "69866385", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Network EngineerJob Summary:The Network Engineer is primarily responsible for the engineering, configuration, installation, maintenance, and upgrade of networks, routers, switches, firewalls, remote access systems, and network management systems. As part of an organization’s IT team, Network Engineers work closely with Systems Engineers, Network Architects, and IT Managers.Required Professional Expertise:BS in Computer Science or equivalent\nComprehend and effectively support network infrastructure for technical and non-technical audiences\nStrong analytical skills to evaluate complex multivariate problems and find a systematic approach to obtain a quick resolution\nITIL methodology, at least version 3.\nGood Communication skills to interact with US Team and Experience interacting with remote teams\nAt least seven (7) years of experience with Network Infrastructure hardware and software supportExpert level of:Azure Networking.\nNext Generation Firewalls (Checkpoint preferred).\nLAN device configuration & administration (Cisco routers, switches, WLCs, Aps and Cisco ISE)\nWireless, Switching and Routing technologies, including management/administration protocols like DHCP, DNS, AAA and SNMP.\nTCP/IP, OSPF, VRF, MSTP and LAN Security protocols (Port Security, Dynamic ARP Inspection, DHCP Snooping).General knowledge of:                                                                                          Server Load Balancing, IPSec, dynamic and route-based VPN tunneling, and Data Center Technologies (ACI, SAN).\nPacket captures (how to run and analyze) to support problem resolution of issues.\nSDWAN Technology (VMWare/VeloCloud experience preferred).\nOSI Layers 1 & 2 connectivity and (cabling) standards.\nCybersecurity.\nIPAM.\nUnix-like Operating Systems.Essential Duties and Responsibilities:Installing, configuring, and supporting the LAN, WAN, and security devices in enterprise environment.\nDay-to-day network management, including seeing through critical issues to resolution and juggling different priorities to support the business requirements.\nDeploy and administer of various network Solutions (Cisco, CheckPoint, etc.)\nMaintain network equipment to ensure that equipment is up-to-date, security is not compromised, and performance optimized.\nWork and assist with management of defined IT processes and procedures including Systems Development Life Cycle methodology, changes, incidents, tasks, and problem management.\nConduct network audits to identify gaps and challenges in the technology, team expertise, process, documentations, etc. and deploy the service improvement plan\nHave a deep respect for process, procedure, and compliance such as ITIL, Sarbanes-Oxley, SSAE, GxP, HIPAA, ITAR, and PCI-DSS, and HITECHBonus Points:Experience with at least one regulatory compliance: HIPAA, PCI-DSS, GxP, ITAR or other industry or governmental regulatory compliance\nCisco Certified (CCNA, CCNP or CCIE), CompTIA Network+ or equivalent experience.\nProficiency with Cisco Call Manager, Cisco Unity or other VoIP technologies.\nScripting/Automation, Ansible, or Python.\nCheck Point Architecture, including Gaia, SmartConsole, SmartProvisioning, SmartUpdate or related.EVOLUTION: What we offer:A launch pad into various senior management opportunities – within the many business lines of Eurofins globally – or into the management hierarchy in our different corporate functions.\nThe opportunity to grow your project management skills in a demanding, fast growing organization.\nA chance to become part of a highly motivated international team of professionals.In a fast-growing group, successful leaders are frequently being offered increased areas of responsibility (subject to geographic mobility).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}