{
    "Job ID": "69867132",
    "Description": "Job DescriptionAre You Ready to Make It Happen at Mondelēz International?Join our Mission to Lead the Future of Snacking. Make It With Pride.You lead a field sales representative team to ensure delivery of the sales strategy and achievement of annual KPIs and targets for a particular area. You work closely with cross-functional colleagues to deliver on activation and reporting against KPIs.How you will contributeYou will:Manage, develop and motivate the team and work closely with the sales capability team to ensure delivery of training to the team.\nCreate and manage an annual business unit plan to deliver agreed channel revenue KPI’s and targets and provide reporting as required.\nManage winning customer business relationships that facilitate “best in industry” execution of our categories.\nWork closely with key stakeholders including the account team, category, activation team, sales capability and customer finance to provide the optimum return across your area.\nFully understand category and insights knowledge, coaching the team in the use of category tools to engage and influence customers to make informed decisions that will grow our categories and deliver our annual plan.What you will bringA desire to drive your future and accelerate your career and the following experience and knowledge:Knowledge of market and routes-to-market in which Mondelēz International performs\nExperience in sales\nStrong organizational and analytical skills\nExcellent communication and interacting skills\nSolid knowledge about sales and negotiation processes\nPerseverance and attention to detailsMore about this roleEducation / Certifications:Bachelor's degree or equivalentJob specific requirements:Bachelor’s Degree .\nmin 2-3 yrs. experience in E-commerce from FMCG industry\nAnalytical skills .\nTeam player, able to work in mixed teams across different functions\nFluency in verbal and written English & Arabic is essential .Travel requirements:Local Travel .    Business Unit SummaryMondelēz International is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation or preference, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.Job TypeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Public Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}