{
    "Job ID": "69867161",
    "Description": "placeFixed term | 12 months | November 2023For the past 30 years, international NGO Acted has been going the last mile to save lives. Currently, Acted supports 20 million people across 43 countries to meet their needs in hard-to-reach areas – and pursues a triple mandate as a humanitarian, environmental and development aid actor. Acted relies on an in-depth knowledge of local territories and contexts to develop and implement relevant long-term actions, with a wide range of local and international partners, building together a “3ZERO” world: Zero Exclusion, Zero Carbon, Zero PovertyActed has been present in Yemen since 2012 with a coordination office in Sanaa, and 6 area offices in Aden, Al Dhalee, Marib, Saadah, Dhamar, and Al Hudaydah. Acted currently intervenes in 8 governorates (Aden, Al Dhalee, Al Hudaydah, Abyan, Marib, Raymah, Saadah, and Dhamar). Key areas of intervention focus on providing emergency response, Durable Solutions, and sustainable development depending on each governorate’s unique circumstances. Acted achieves these goals by focusing on several key sectors, namely: WASH, Food Security and Livelihoods, Sustainable Agriculture, Camp Coordination and Camp Management (CCCM), Infrastructure Rehabilitation, Economic Recovery, Capacity-Building of Local Civil Service Organizations, and Cash & Voucher Programs. Acted is a proud member of the Cash Consortium of Yemen (CCY), Yemen Displacement Response (YDR) consortium, and recently led a flagship consortium project focused on developing Pathways to Durable Solutions for IDPs in Yemen.Prior to the commencement of conflict in Yemen in 2015, Acted focused more heavily on development projects (infrastructure, sustainable WASH, etc.), whereas the needs began to shift towards emergency response programming as the situation evolved. In response, Acted has adapted its programming to best suit the needs of each governorate, whether that be emergency response, sustainable development, or through a hybrid approach.The Humanitarian Access Manager is responsible for overseeing daily security management of all Acted premises\nand project sites, ensuring a permanent monitoring and assessment of the security situation in country, as well as\nreviewing and implementing Acted security management guidelines and protocols. He/she will also advise the\nCountry Director and Senior Management Team on all issues of safety and security and provide appropriate\nsecurity training and mentoring.Main dutiesDepartment management\nContext & Risk analysis\nDevelop and update Country Security Plans, SOPs and Contingency Plans\nDaily Security Management\nCrisis management\nReporting\nTraining and briefing\nDevelop and maintain a security network\nEnsuring external representationAt least 2-3 years of working experience in insecure environments; preferably in Africa, Asia, or the Middle\nEast;\n• Extensive experience in security management and procedures;\n• Demonstrated communication and organizational skills;\n• Ability to train, mobilize, and manage both international and national staff Flexibility and ability to multitask under pressure;\n• Ability to work well in unstable and frequently changing security environments;\n• Willingness to work and live in often remote areas under basic conditions;\n• Proven ability to work creatively and independently both in the field and in the office;\n• Advanced proficiency in written and spoken English;\n• Knowledge of local language and/or regional experience highly desirable.Salary between 3500 and 4700€ monthly (before income tax), depending on the level of education, security level, etc as well as a monthly living allowance of $300\nAccommodation and food provided in Acted guesthouse\nPension, health insurance, life insurance and repatriation assistance (& unemployment insurance for EU citizens)\nFlight tickets every 6 months & visa fees covered\nContribution to the luggage transportation: up to 100 kgs, depending on the length of the contract\nRest & Recuperation (R&R) every 2 months, flight tickets covered up to $500 and allowance of $200\nAnnual leave of 25 to 43 days per year\nOne week pre-departure training in Acted HQ, including a 4-days in situ security training\nTax advice (free 30-minute call with a tax consultant)\nPsychological assistanceHAM/YEMJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Yemen",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}