{"Job ID": "69866161", "Description": "The Service Delivery Manager role is responsible for maintaining a culture of service excellence to clients and S&ES team through the provision of timely, high quality, value-added internal and external services.They are responsible for owning vendor relationships, representing services internally to Pfizer stakeholder and overseeing operational metrics, driving continuous service delivery improvement, and defining the vision for program policies.The Service Delivery Manager, Global Operations is a critical position in the operational functioning and development of flexible service delivery to Pfizer globally via the PfizerWorks platform which is a Global Platform accessed by thousands of colleagues across the globe to request commercial and other services.The Service Delivery Manager, Global Operations along with his/her peers is responsible for the support of compliant & controlled delivery and subsequent chargeback of approximately ~$90 million in service contracts spread across multiple suppliers involving all PfizerWorks operations and ~900 + FTEs.  The contracts enable the PfizerWorks operating and delivery models which supply on-demand and managed services to Pfizer colleagues, business units and the Pfizer enterprise, anchored in but not limited to commercial offerings.  Approximately ~27,000 cross-BU projects flow through PfizerWorks on an annual basis. As a Service Delivery manager, you will be accountable for seamless service delivery of projects through PfizerWorks Platform which is the central platform for all project requests routed through PfizerWorks. Responsibilities include but not limited to seamless execution of Project lifecycle without any technical issues or failures, manage stakeholders relation internal and external, technically able to understand and articulate the work to teams related to platform enhancements, infrastructure like operating system, .Net and knowledge of coding languages, database, middle ware network cloud etc. Continuously improve the technical support model and service delivery through PfizerWorks platform.In addition you will support development and implementation of multiple processes, methodologies, tools and operating models, e.g., process ownership models, methodologies for achieving process transformation, sharing best practices, metrics management, charge-back methodologies, compliance, and customer service delivery models.  In addition, the incumbent will have input into the development of key governance processes such as Service Level Agreements development, business reviews, and issue resolution. As the PfizerWorks service model involves both on and offshore operations as well as both managed and on-demand services, the Service Delivery Manager, Global Operations must have acumen in global operations as well as unique service delivery models.The candidate is expected to prioritize initiatives, along with Operations colleagues, the vendors, other Enterprise Services teams where applicable, and business unit customers.  The candidate will maintain and initiate new projects, both independently and in collaboration with others.  The candidate will have an ongoing dialogue with all major constituents to ensure that the priorities remain consistent with the evolving commercial and other business needs, vendor capabilities, PfizerWorks capabilities and resource availability.This position will report solid line to the S&ES Delivery Lead for PfizerWorks.Service Delivery OperationsManage engagement with 3rd party vendors in the execution of customer-facing vendor operations relating to one or more of the following (non-exhaustive):\n\nPfizerWorks Service DeliveryVendor Relationship OwnershipLead projects to identify potential suppliers for service delivery operations, and ensure that they meet the company's procurement criteria\n\nManage vendor teams to ensure that they meet their contractual obligations and that the company receives the expected level of service\n\nEngage with vendors to measure performance to ensure that they are meeting agreed-upon service levels\n\nCo-Lead the implementation of vendor management policies and procedures and ensuring that they are followed by all relevant stakeholders\n\nResponsible for tracking vendor performance metrics such as on-time delivery, quality, and cost, and worked with vendors to continuously improve their performance\n\nCo-lead risk assessments involving identifying potential risks associated with working with third-party vendors and developing strategies to mitigate these risksPfizerWorks Platform support & Management (Technology)Manage and support projects related to platform. Understand the pipeline of work and ensure proper demand management\n\nPartner with stakeholders for collective alignment for issue resolutions (Digital, security, Platform teams etc.)\n\nHold vendor teams accountable for highest standards of platform support, delivery, and enhancements\n\nEnsure compliance to processes and digital policies for platform including access management, roles management and audits.\n\nWork collaboratively with internal stakeholders to gather requirements and create roadmap of platform development\n\nContribute to budget planning from a platform/technology perspective\n\nCoordinate with vendors and stakeholders for effective change management related to PfizerWorks platformBusiness Partner Relationship Management & Service Awareness (Marketing)Manage the development of standardized operating procedures for end-to end service delivery.\n\nEngage with respective stakeholders from other departments such as legal, procurement, and IT, to ensure that vendor management processes are integrated with overall business processes\n\nManage the execution of marketing campaigns to promote enterprise services, resulting in increased brand awareness and new business leads\n\nBuild material for training and reference purposes across process flows and toolsPeople Management & DevelopmentManage outsourced vendor to manage and monitor all elements of Service operations\n\nOversee trainings and support to other employees involved in vendor management processes to ensure that they understand their roles and responsibilitiesService DeliveryTypically provides support to predominantly operational activities\n\nTypically provides support to activities of medium operational criticality of services\n\nTypically has business stakeholder relationship ownership responsibilities\n\nTypically manages business stakeholder relationships of medium or low complexityOther Responsibilities:In partnership with PW Operations Peers, support the service delivery for shared service platform consisting of 12 core services delivered by 9 vendors and approximately 900 +/- FTEs located primarily in India (but also dispersed in other countries across the globe).\n\n Support the creation and reporting of various operations and management dashboards working across teams and stakeholders.\n\nSupport key improvement projects and strategic initiatives involving multiple stakeholders.\n\nSupplier operations and contract management support for multi-million-dollar contracts.\n\nManage Pfizer compliance, operational, and financial controls requirements.\n\nOversee quality control systems and processes including but not limited to creation and periodic review of operational work instructions. Ensure compliance to the agreed upon processes and escalate issues as necessary.\n\nOversee systems to ensure vendor compliance with operational, hiring, retention, and service delivery expectations as defined in the vendor SLAs.Collaborate with other functional colleagues and divisions including but not limited to IT, Finance, Procurement, Audit, and HR to ensure all components of transition and compliance are addressed.\n\nMaintain knowledge capital generated during transition; develop and document appropriate SOP’s.\n\nWork with PfizerWorks Team and Pfizer Risk, Compliance and/or internal audit to ensure proper process controls for existing, new, or modified processes.\n\nWillingness and ability to frequently and regularly work non-standard hours while delivering services globally.\n\nWork in close partnership with PfizerWorks Customer Facing Account Directors to ensure a successful customer experience, value delivery, and new service development and deployment.\n\nCreatively and resourcefully support PfizerWorks global service delivery model expansion.\n\nOnboarding new suppliers when applicable and overseeing initial vendor recruiting and training of team members to ensure supplier quality and effectiveness. \n\nSupport/Manage the vendor governance process with PfizerWorks suppliers in the vendor management tool.EXPERIENCEExperience: Minimum 5-8 years, Service delivery management (IT preferred), Project Management, Operational Excellence, Business Process Optimization, Commercial Operations, Technology, and/or Consulting.\n\nTechnical Skills required: Technology, Operations, Business Process & Workflow\n\nAcademics Preferred: Masters in IT/Business/Computer science.  Preferred Disciplines: Project Management, Information Technology, Operations, consulting.\n\nPreferred Certifications: Six Sigma, ITIL, PMP\n\nBehavioral competencies: Business Transformation, Learning Agility, Change Management, Learning Agility, Influence, Cross-cultural Awareness & Engagement and Business Partnership.Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}