{
    "Job ID": "69865827",
    "Description": "51,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.Whatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.comPurposeResponsibilitiesDeliver process engineering services that meet Worley, its customers and applicable statutory and regulatory specifications, on time and within budget.\nPerform process engineering services such as:\nidentify and report changes to project scope;\nassist with the preparation of proposals, estimates, budgets and schedules;\nprovide assistance during procurement, construction and commissioning activities. For example, write requisitions, conduct technical bid evaluations and write purchase orders;\ncontribute to appropriate studies, analyses and recommend actions;\nassist with the preparation of detailed designs and drawings, specifications, data, calculations and reports.\nKeep up-to-date with the latest developments and technical innovations in process engineering.\nCommunicate effectively with the process engineering team and project stakeholders, including the Customer.\nIdentify issues and problems, develop appropriate solutions, and ask for assistance when required.What you will bring Technical and Industry ExperienceSound technical and practical engineering skills and ability to consistently deliver quality, accurate and timely work to Worley and its customers.\nA working knowledge of the fundamental requirements of process engineering, and the basic requirements of other engineering fields.\nA working knowledge of applicable local and international standards and statutory and regulatory specifications.\nCompetent use of process engineering specific software and relevant software such as MS Office Suite.\nEngineering experience in the same or similar industry.Education – Qualifications, Accreditation, TrainingRequired:Preferred:What we offer youIf you have the passion and talent to keep up, it's time to test the limits of what you can become.  Find your future with Worley.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}