{"Job ID": "69869726", "Description": "Company:Job Area:General Summary:The Advanced R&D team is looking for a research engineer with a passion for signal processing and machine learning with application to voice/speech/audio processing. You will be working with a team of voice signal processing and machine learning experts to develop advanced technology and solutions for mobile phones, headsets, XR, and variety of IoT devices. Members of our team enjoy the opportunity to participate in cutting edge research while simultaneously contributing technology that will be published in patents/papers and deployed worldwide in our industry-leading devices. The team works with algorithm, hardware and software engineers across the company to develop, port newly designed solutions to real live prototypes shown at tradeshows and support commercialization activities in upcoming products.Responsibilities:The selected candidate will have responsibilities in one or more of the following areas:•  Develop innovative signal processing/machine learning algorithms for speech/audio data processing in C/C++/Python, file corresponding patent disclosures and papers•  Create machine learning models for advanced voice/audio uses cases to push human-machine speech interface to new levels•  Tailor algorithms to particular use cases and implement in latest reference designs in collaboration with software/system engineers•  Work on quantizing and offloading the ML models to NPU HW accelerators•  After successful demos to technical and business audiences, work with commercialization teams to transfer developed solutions onto Snapdragon platforms and customer devices•  All Qualcomm employees are expected to actively support diversity on their teams, and in the Company.•  Proven ability to work in a dynamic, multi-tasked environment•  Self-starter who likes to be challenged and solve tough complex problems•  Excellent verbal and written communication and presentation skills.•  Quick learner, self-motivated, able to work independently and a Team player.•  Aspiration for excellence.•  Working in cross disciplinary, geographically-dispersed teamsMinimum Qualification•  2+ years of R&D experience of voice/speech/audio applications in academic/industry•  Familiarity with recent trends in machine learning such as deep neural nets (DNN, CNN, LSTM-RNN, UNET, Transformer, BERT, wav2vec, HuBERT) and traditional statistical modeling/feature extraction techniques for voice/speech/audio applications•  Working experience on any ML frameworks such as ONNX,Pytorch, TensorfloPreferred Qualification•  R&D experience developing generative and masking models in voice/speech/audio application area•  Proficiency in designing, implementing and training DL algorithms in high-level languages/frameworks (e.g. PyTorch, TensorFlow, Caffe, Caffe2)•  Willingness to engage in hands-on R&D in signal processing, machine learning and modeling of voice/speech/audio data•  Coding experience in C/C++/pythonMinimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}