{"Job ID": "69866788", "Description": "Job Requisition ID: 157074 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the roleAs the Senior Specialist Talent & Leadership Development, the primary purpose of the role is to support the development of leadership development strategies and paths and deliver talent management solutions that strengthen Al Futtaim’s  leadership bench strength, retaining and developing high potential employees, middle managers, senior leaders, and UAE Nationals. The role will act as a strong contributor to growing internal talent and leadership capabilities that align with Al Futtaim’s strategic goals and objectives, and empower leaders to drive high performance, foster a positive work culture, and achieve excellence.What you will doSupport review and develop the framework to identifying critical roles and successor planning. Responsible to action, follow up and review the collective and individual development needs for both critical roles and successors\nCoordinate divisional wide annual and periodical talent identification exercises with HRBPs and identify high potential talent and talent pools and support the development of high impact solutions and actions to increase the development and retention of all leadership talent, including nationals.\nDefine and prepare talent data and analytics to stakeholders as relevant\nDesign and conduct assessment centers for talent validation and succession planning, including the use of various talent assessment tools/psychometrics\nSupport the implementation of mentoring and coaching frameworks and tools for leadership development\nDevelop Talent Management programs and solutions to support achieving the Talent Management & Leadership strategy and roadmap and design career and learning paths for defined roles and job families\nFacilitate leadership skills courses to middle managers (both face to face & virtual) using various instructional and digital design techniques and partner with Talent Management & Leadership leaders and the business to conduct relevant needs diagnosis and gap analysis that input into leadership development strategy and planning\nCoordinate annual performance cycle activities and report progress from the goal setting, performance reviews and work with HRBPs and Talent Centre to embed ‘continuous performance management’ culture\nManage divisional communication plan for performance management milestones and awareness in coordination with group level communication cascade.Required Skills to be successfulExperience in implementing talent review, talent identification and succession planning, defining career and learning paths across job families.\nExperience delivering various leadership skills courses to supervisor levels/middle managers  with strong knowledge of leadership theories, models, and best practices, with the ability to apply them to real-world scenarios.\nExperience implementing coaching and mentoring programs/solutions for leaders.What equips you for the roleBachelor's degree in Human Resources, Organizational Development, Business Administration, or related field (Master's degree preferred).\nMinimum 2-3 years of experience in leadership development, talent management and L&D or related rolesStrong reporting and analytical skills backed by advanced excel capability. Preferable experienced in creating dashboards to support data-driven decisions using various tools administer and debrief various psychometric tools preferable (e.g. Hogan, SHL, etc).We’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}