{"Job ID": "69865507", "Description": "1. Receive the Vessel file from the output section after vessel completion and ensure that all charges are included according to the CTMS summary and invoice summary.\n2. Verify all charges and ensure all is correctly billed, in case of any missing charges or discrepancy, raise manual supplementary invoice for the same and communicate to supervisor for review and approval.\n3. Raise all manual invoices for charges, update the CTMS and email it to supervisor for further action.\n4. Raise all manual charges invoices which are not captured in the CTMS automation and ensure the same is update in the system.\n5. Ensure that all the generated invoices are checked against the data provided by the Output department and there is no loss of revenue.\n6. In case of disputes in invoices from the agents, verify the details and forward to supervisor for further actions.\n7. Prepare a billing advice for invoicing, which includes details of the cargo, delays, equipment & gears used and other details chargeable to the agent, raise a supplement invoice for the supplement manifest and forward the invoice to Finance and the agent.\n8. Attend to the agent and consignee queries, when required, receive and confirm supplier invoices (Stevedoring) by checking for any errors and forward the same for payment.Aluminum Billing:\n9. Prepare a report consolidating the data regarding Handling, Storage and Lashing and Additional EGA operations, Tarpaulin and Rebinding, overtime and cargo import, confirm with operations update the charges in system and send to Supervisor for approval.\n10. Archive the document for reference.GC Billing:\n11. Prepare Vessel Stevedoring, shed & Borouge Invoices.\n12. Share with supervisor for approval & amend if required.T&D Billing:\n13. Update invoices for ray shifting, Weighbridge shifting, Cargo shifting between Terminals, Mafi trailer and Detention charges, ITT shifting charges & share it with supervisor for approval.Trade is the lifeblood of the global economy, creating opportunities and improving the quality of life for people around the world. DP World exists to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally.   With a dedicated, diverse and professional team of more than 106,500 employees from 158 nationalities, spanning 73 countries on six continents, DP World is pushing trade further and faster towards a seamless supply chain that’s fit for the future.  We’re rapidly transforming and integrating our businesses -- Ports and Terminals, Marine Services, Logistics and Technology – and uniting our global infrastructure with local expertise to create stronger, more efficient end-to-end supply chain solutions that can change the way the world trades. What's more, we're reshaping the future by investing in innovation. From intelligent delivery systems to automated warehouse stacking, we’re at the cutting edge of disruptive technology, pushing the sector towards better ways to trade, minimizing disruptions from the factory floor to the customer’s door. We make trade flow to change what's possible for everyone.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}