{"Job ID": "69866219", "Description": "Careem is building the Everything App for the greater Middle East, making it easier than ever to move around, order food and groceries, manage payments, and more. Careem is led by a powerful purpose to simplify and improve the lives of people and build an awesome organisation that inspires. Since 2012, Careem has created earnings for over 2.5 million Captains, simplified the lives of over 50 million customers, and built a platform for the region’s best talent to thrive and for entrepreneurs to scale their businesses. Careem operates in over 70 cities across 10 countries, from Morocco to Pakistan.About The Team:Careem's Community Management is the most successful team for providing the best-in-class digital customer experience. It’s a team of award-winning community management specialists who make memes, go viral, have fun, and stay on the ball 24/7 for all the Captains, Customers, and other stakeholders.What You'll DoBuild and execute captain communication plans for our digital assets (social media posts, push notifications, in-app stories and etc)\nAchieving and sustaining digital CX measures such as SLA, CSAT, and Social Sentiment\nFully understand social media tool’s (training will be provided) technicality, to produce better work all around\nUse analytical tools to identify the special trends and causes\nAbility to deal with data, insights and create reports on a weekly and monthly basis\nManage FTE requirements in a multi-skill environment\nEngage with Customers and Captains on our Social Media pages, humanizing the Careem brand and elevating overall Social Media engagement, reputation, and status\nProblem-solving abilities and escalating the complaints accordingly\nUnderstand the business stakeholder requirements on operational SLA’s\nInitiate engagement ideas in line with the ongoing trends and campaignsWhat You'll Need&nbsp;At least 2 years of experience in Social Media Marketing and Community Management\nAbility to create engaging content; knowledge of meme marketing is a huge plus\nOutgoing personality: sociable, articulate, positive, talkative, and eager to support our customers and captains\nOverall: great time management skills, ability to multitask, intelligent, handles pressure\nAbility to use project management tool like asana for managing cross functional tasks\nWriting skills: excellent use of language (both English and Urdu) matched with proper customer relations and content creation\nWillingness to work on a shift basis: Community Management is a 24/7 job. The CM Department allocates times and shifts to each member of the team on a rotational basis, this includes evening and night shifts, weekends, and public holidays\nAbility to think quicklyWhat we’ll provide youWe offer colleagues the opportunity to drive impact in the region while they learn and grow. As a Careem colleague you will be able to:Work and learn from great minds by joining a community of inspiring colleagues.\nPut your passion to work in a purposeful organisation dedicated to creating impact in a region with a lot of untapped potential.\nExplore new opportunities to learn and grow every day.\nEnjoy the flexibility that comes with the trust of being an owner; work in a hybrid style with a mix of days at the office and at home, and remotely from any country in the world for 30 days a year with unlimited vacation days per year.\nAccess to healthcare benefits and fitness reimbursements for health activities including: gym, health club and training classes.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}