{
    "Job ID": "69866720",
    "Description": "Imagine being part of an agile team, where your ideas have the potential to reach millions. Envision working within a startup atmosphere, while being able to leverage the resources of a Fortune-500 company. Do you have a passion for fostering high impact partnerships? Are you a customer-obsessed expert in relationship management and financial management? If so, this role could be for you.\nThe Amazon Fuse Business Operations organization works across Amazon to bring our consumer service offerings, including Prime, Prime Video, Amazon Music Unlimited, Kindle, Alexa, and more, to hundreds of global partners across mobile operators, OEMs, retailers, banks, QSR and CPG brands, and more. We focus on business growth and value creation for customers. We focus on building trustful relationships with enterprise partners to deliver financial results to partners and Amazon.\nWe are looking for a Regional Program Manager within our Business Operations team to manage the oversight of, and continual improvements to, the billing services used by internal and external stakeholders. This is a pivotal role that enables you to have significant business impact through your direct involvement in customer financial modeling, target setting, and operations support. This role will provide partner development around billing and payments as well as manage troubleshooting efforts where needed. This role will also be responsible for leveraging reporting tools to develop and maintain scaled, automated, user-friendly reports and dashboards that will support the inquiries of partners. This position requires a proactive, highly motivated individual with an aptitude for critical thinking and process improvement, who can assist in the strategic development of systems for global billing. The successful candidate will be a self-starter who is comfortable with ambiguity, is analytical and detail oriented, demonstrates backbone, and possesses the ability to work well with cross-functional teams.\nThis role is located in Delhi, IN\nKey job responsibilities\n- Work with stakeholders to understand opportunities, desired outcomes, and success criteria\n- Plan, manage and deliver partner invoices, billing queries, and SLAs to ensure there is a strategy to measure accounts and support as a result\n- End to end ownership, from design requirements and build to implementing and reporting\n- Run feedback loops and quickly implement changes while staying focused on long-term goals\n- Conduct regular audits to maintain accuracy and relevance of disputes to reflect service updates and process changes\nThe successful candidate will have:\n- Excellent written and verbal communication skills with a customer focused, detail driven, and professional demeanor\n- A passion for building trust with internal and external stakeholders by being proactive and innovative in solving problems that affect customers\n- A proven ability to meet tight deadlines and prioritize workload\nWe are open to hiring candidates to work out of one of the following locations:\nDelhi, IND\n- 5+ years of working cross functionally with tech and non-tech teams experience\n- 5+ years of program or project management experience\n- 5+ years of delivering cross functional projects experience\n- Experience defining program requirements and using data and metrics to determine improvements\n- 2+ years of driving process improvements experience\n- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related fieldJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Delhi, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}