{"Job ID": "69869939", "Description": "Are you passionate and driven enough to fill our house? We’ve got first class rooms … your challenge is to fill them. Then why not come and join us at the Radisson Hotel Group to Make Every Moment Matter! where our guests can relax and enjoy the experience!\nOur Reservations Team are natural organizers, sales driven with finicky attention to detail and totally tuning into guests needs. They are first class and strive to deliver a hospitality experience that is beyond expectation - creating memorable moments for our guests.\nAs Reservations Supervisor, you will join a team that is passionate about delivering exceptional service where we believe that anything is possible, whilst having fun in all that we do!\nInterested then why not say Yes I Can! as we are looking for passionate people just like you!\nKey Responsibilities of the Reservations Supervisor:\n-Supports the smooth running of the reservations department, where all aspects of the guest journey and experience are delivered to the highest level\n-Works proactively to improve guest satisfaction and comfort, delivering a positive and timely response to guest enquiries and problem resolution\n-Delivers on plans and objectives where reservations initiatives & hotel targets are achieved\n-Supervises the reservations team fostering a culture of growth, development and performance within the department\n-Accountable for ensuring that costs and inventory are controlled, that productivity and performance levels are attained\n-Builds and maintains effective working relationships with all key stakeholders\n-Reviews and scrutinizes the performance of the business, providing recommendations that will drive financial performance\n-Ensures adherence and compliance to all legislation where due diligence requirements and best practice activities are planned, delivered and documented for internal and external audit, performing follow-up as required\nRequirements of the Reservations Supervisor:\n-Experience in reservations\n-Strong supervisory and managerial skills with a hands-on approach and lead-by-example work style\n-Commitment to delivering exceptional guest service with a passion for the hospitality industry\n-Ability to find creative solutions with proven problem-solving capabilities offering support where required\n-Personal integrity, with the ability to work in an environment that demands excellence, time and energy\n-Experience of working with IT systems on various platforms\n-Strong communication skillsRadisson Blu Hotel, Ajman has stylish interiors, a wide array of restaurants and bars, and service-minded team with Yes I Can! attitude.Radisson Blu Hotel, Ajman is one of the latest jewels in the Northern Emirates, with 148 elegant rooms all equipped with Apple TV connectivity, and a signature restaurant: Filini - simply cooked Italian food crafted from carefully chosen ingredients. Relaxation and rejuvenation are never far away with our elegant spa facilities having private massage rooms and a temperature-controlled swimming pool. Guests can enjoy the turquoise waters of Ajman with our shuttle service to our private off-site white sandy beach.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Ajman, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}