{
    "Job ID": "69866171",
    "Description": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren’t words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You’ll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.Bristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us.BMS is hiring Senior Market Access Manager (SMAM) in Istanbul reporting directly to Market Access Director.Key ResponsibilitiesSMAM is the key point of contact for all access and reimbursement related issues of our product(s) in the respective area. He/she defines the local Market Access strategy for our products in the  respective indication(s) in order to maximize access for eligible patients and optimize the reimbursement conditions of the products\nThis includes the preparation of the reimbursement submission to the authority with the selection of appropriate comparator. Within this process he/she is responsible for the the compilation of the dossier based on the evidence and aligned with the value proposition, the strategic focus/alignment of the dossier and the internal approval processes. He/she prepares all steps during the reimbursement assessments (written statements, analysis, internal communication).\nDrives the design, interpretation, customization and implementation of HEOR projects to support the commercialization of our compounds in close alignment with the local market access, medical and marketing functions\nHe/She develops strategies, tactics and implements activities considering the overall Market Access environment and business needs.  Monitor and anticipate relevant reimbursement trends  and create action plans to address upcoming market access challenges\nHe/She develops the development of specific pricing schemes and the conduction of business cases in close cooperation with the WW teams and commercial teams.\nHe/She will be active member of  cross functional Meetings for new products in cooperation with access team, other functions and Works cross-departmentally to ensure the effectiveness and efficiency of reimbursement and pricing policies and procedures and implementation of new programs\nFollow up the budget of products and coordinate budget allocation, ensure POs, payments and other relevant documents are coordinated.\nSupport corporate affairs strategies and plans to generate earned awareness and advocacy to build reputation for BMS and its brands, driving synergies across plan elements\nInfluences corporate affairs plans and business decisions as trusted partner, conveying potential risks in choices and opportunities\nDevelops deep knowledge of PAGs and relevant NGOs/associations and stakeholders, leverage connections to generate endorsements and gains insights to guide strategyRequired skills/knowledge and experienceThe SMAM  needs the ability to manage complex interdiscipliniary matrix teams under time pressure with high senior management attention\nThe SMAM brings experience in the analysis of complex issues, is trained in strategic thinking and in the implementation of strategic plans\nHe/She has a profound understanding of the entire Turkey Market Access process including negotiation , Turkey health care and drug legislation  and corporate affairs management\nHe/she has a university degree in life science and/or economics and working experience in the access field and pharmaceutical industry required at least 10 years, preferred in an international or national market access, HEOR, pricing  functions.\nThe needs strong writing and communication skills (Word and PowerPoint), e.g. experience in delivering communication tools for different targets groups such as management, field access, authority and associations\nProfound drug pricing knowledge (e.g. value based pricing) combined with MS-Excel capabilities is welcomed\nStrong project management expertise, the SMAM must be a team player to support the high requirements within the Market Access and Cosporate Affairs team and should have leadership skills as well as\nLiaises with sales, marketing, registration and medical teams and co-operate with relevant national authorities and associations\nUnderstanding of legislative/policy decision-making processes and mechanisms, healthcare systems, including funding policies, pharmaceutical law, and general pricing and HEOR mechanisms\nA very good team member and effective communication skills\nNo restrictions for travel\nUnderstanding of Bristol-Myers Squibb products and its priority business objectives. Fluent in English oral and written is mandatoryIf you come across a role that intrigues you but doesn’t perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.Uniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as “Transforming patients’ lives through science™ ”, every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.On-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.BMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.BMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.BMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.Any data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}