{"Job ID": "69867943", "Description": "Graduate Digital ConsultantApply nowMott MacDonald launched a Graduate (ECP) Development Framework across the GCC region, with an aim to invest, grow and nurture future leaders. The framework is structured to ensure all graduates are given opportunities to gain experience and learn new skills,\nwith focused training on technical as well as soft skills development.We are now looking for Graduate Digital Consultants in all disciplines to support and enhance the delivery of a variety of projects across the GCC region. Joining this development program, you will have an opportunity to better understand the Mott MacDonald operating model, work closely with assigned Line Managers and Mentors and engage with different communities and networks within the organisation. During this time, you will be exposed to the following:Inductions to Mott MacDonald\nGraduate Induction Workbooks to build on your strengths profile\nSector overviews by each Sector Leaders\nProfessional and Technical Excellence\nEarly Career Professional (ECP) Network\nDigital Delivery\nInnovation & Innovative Approaches to Digital.\nOpportunities to introduce and apply your digital skills on a variety of projects and initiatives.\nWIN Phase and Account LeadershipKey responsibilities and duties are listed, but not limited to, the below:Under the supervision of a Senior Digital Consultant and Senior Engineer, perform assignments requiring knowledge and application of basic engineering codes and principles using Digital and innovative advanced methods.\nAssist with the preliminary selection and adaption of engineering possibilities. (Push and test the boundaries)\nSupport on technical deliverables of designs, models and drawings to principle engineer\nAttendance at design co-ordination meetings and preparation of minutes\nProviding input for monthly reports on progress on the project and initiatives\nAssisting in the management of change control and Digital development\nCoordination with authorities / stakeholders / Digital teams\nAssist the Project Manager and Digital Leads as necessary (e.g, meetings, digital enablement)Minimum Bachelors’ in all Engineering disciplines or Data Science, Data analytics, Digital Engineering, Digital Technology, Automation & Computational Design.\nProactively take ownership of their own career – take initiative and responsibility of work-related matters\nDemonstrate flexibility by adopting to different work styles and behaviors\nBe Digitally inclined and search for innovative methods for work application.\nKnowledge of BIM, ISO:19650,\nExperience or familiar in following toolsets: Microsoft Office, Power Bi, Autodesk Revit or Civil 3D, Navisworks, Coding, Programming and Automation applications knowledge preferred.\nSelf-motivated, curious and a can-do attitude.90 calendar days’ paid maternity leave\nCompetitive annual leave\nAn annual professional institution subscription\nAnnual company performance bonus scheme – Subject to company performanceEquality, diversity and inclusionAgile workingMore about Mott MacDonaldJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}