{
    "Job ID": "69866146",
    "Description": "MPH is currently recruiting an Aveva Diagram Administrator.\nContract Duration till Dec 2024\nLocation : DohaACTIVITIES\nDuring preparation Phase:•Perform audit of FEED deliverables to identify the gaps between “as-is” and “required for Detailed Design Phase”\n•Review and update the document template aligning with disciplines to prepare ready for use template for the EPC phase.\n•Review existing documents, identify errors, and apply corrective/mitigation actions including data check and/or clean up, documents template adjustment, reports building/fixing, database errors fixing if needed, deliverables extract testing\n•Develop additional required documents (not developed during FEED) for EPC phase in AVEVA Products\n•Participate in AVEVA solution (for the EPCIC phase) technical setup, documenting, testing etc.\n•Support the CFT process for AVEVA related subject and assist in performing technical demo, workshops, clarification meeting with potential Bidders\n•Assist in training of MP Team on AVEVA products.During Project Execution-EPCIC Phase\n•Support EPCIC Contractor in full set up of AVEVA products\n•Assist in handover the required template and documentations related to AVEVA to EPCIC Contractor at the commencement of the project\n•Coordinate the AVEVA kick-off meeting with EPCIC Contractor•Perform routine works on content control including:\ni. Progress review\nii. Data technical consistency check\niii. Document deliverables extraction/supervision (frequency will depends on final solution configuration)\niv. Data extraction/supervision (frequency will depends on final solution configuration)\nv. Data quality and consistency checks (application and documents integrity), preparing report and communicating it’s to the Contractor\nvi. Data analyses\nvii. Track errors resolution with the Contractor•Provide support to RUYA Package team, and consulting, collecting requirements, issues, problems related to the AVEVA application and propose/implement resolution\n•Provide training to the package team, new commers and knowledge refreshment\n•Reports extraction and/or modifying existing, and/or new report building\n•Interface with AVEVA admins on other packages to ensure the consistent information/solution are communicated through all packages\n•Interface with MP EMT in Doha, with AVEVA and other stakeholders to provide full support to the package in order to address the issues/questions from RUYA Package team as well as EPCIC Contractors\n•Perform technical audit of the Contractor during execution as per agreed milestones to identify issues/errors and areas for improvement.\nDuring Close out and Handover•Perform final review of the deliverables,\n•Conduct final acceptance of deliverables from Contactors\n•Conduct data merging and preparation actions for final handover\n•Participate in handover process to E&C and Operation Teams\n•Provide required training for end Users.\nQUALIFICATIONS & EXPERIENCE REQUIRED• Qualification: Associate’s or bachelor’s degree (or equivalent experience) in a relevant engineering discipline.\n• Proven 10 years or more knowledge of engineering, design, procurement or construction within a relevant industry (e.g. Oil & Gas, Energy or Marine industries) from either an owner-operator or an engineering contractor background.\n•Proven 3 years or more experience of AVEVA products or similar technologies\n•Experienced in at least one of the below AVEVA products:\nAVEVA Diagrams\nAVEVA Electrical & Instrumentation\nAVEVA NET and reporting\nAVEVA Engineering and RDL managing•Experience of execution of AVEVA applications through a detailed design phase of EPC projects is a plus.\n•Knowledge of multiple AVEVA products would be an advantage.\n•Knowledge of Information Management practices for Capital Projects would be an advantage.\n•Knowledge in programming using, SQL, python, PowerShell, VBA, C# would be an advantage.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}