{
    "Job ID": "69865865",
    "Description": "The Roche Kuwait early in career Program is a 12 months rotational development program at Roche. The program is tailored for high potential individuals at an early stage of their career, and NO work experience is required. The program accelerates their professional development and enables them to be key contributors to Roche's purpose and what patients need next.Roche Kuwait offers Marketing Specialist position for a period of 11 months and one month rotation with the below main responsibilities: You ResponsibilitiesHelp achieve company goals by helping to plan and organize successful events\n\nDelivers events on time, within the budget, that meet (and hopefully exceed) expectations, and are aligned with Roche compliance policies, the local law and the industry code\n\nSets, communicates and maintains timelines and priorities on every project\n\nManage the availability of all Marketing Material in a proactive approach\n\nCommunicates, maintains and develops client relationships, ensuring excellent customer service and quality delivery\n\nManages operational and administrative functions to ensure specific projects are delivered efficiently\n\nTravels to onsite inspections and project managing events\n\nResponsible for all project budgets, negotiating contracts and fees in close coordination with procurement colleagues.\n\nBooks locations, halls and equipment, overseeing setting up of a venue and event environment\n\nCoordination for all out of the country events, in collaboration with sub-regional & regional colleagues\n\nWorks with creative teams to come up with branding ideas, advertising copy, graphic designs, and promotional materials\n\nSupports team with customer events\n\nProvides needed reports timely and tracks marketing activities conducted and in the plan\n\nLead & initiate Marketing campaigns initiatives in different product / disease areas in collaboration with internal stakeholders\n\nHandle the internal process of pricing the products with a proactive approach to ensure availability in the Market timely\n\nInitiating leads by working proactively to develop, implement, and track marketing programs such as email, social media, or digital campaigns, and events\n\nCollaborate with other internal teams (e.g. product and sales) to develop and monitor strategic marketing initiatives\n\nAnalyze and report on the performance and efficiency of campaigns\n\nConduct market research and analyze trends to identify new marketing opportunities\n\nDevelop and create marketing materials, such as sales and product collateral, and ensure brand guidelines are met\n\nWork with external agencies and vendors to execute marketing programsYour OpportunityParticipants build an extensive network within Roche and upskill themselves\n\nBest possible work environment is designed to foster participants' learning experience\n\nParticipants will have access to senior leaders and will be assigned to a mentor to support their career journey\n\nContributing to purpose driven projects and taking responsibilities from day 1Who You Are (requirements)Bachelor or Master Degree in Life Sciences, Economy, Business, Public Affairs or any related area\n\nAt an early stage in your career.\n\nPreferably, basic understanding of healthcare system\n\nEagerness to work with diverse cultures\n\nPassion for learning new things and high degree of integrity and courage\n\nExcellent communication and innovative skills\n\nProficient in EnglishOur missionRoche is a global pioneer and leader in Personalized Healthcare. We provide breakthrough differentiated medicines and diagnostic tests using expertise in Science, Technology and Data so that people can live better lives. We believe it’s urgent to deliver medical solutions right now – even as we develop innovations for the future. We commit ourselves to scientific rigor, unassailable ethics, and access to medical innovations for all.We are living in truly historic times. The rapid digitalization of healthcare fuels an accelerated transformation in our industry. This change requires leaders who are entrepreneurial, who trust and encourage teams to take risks, learn and progress quickly.Program Characteristics/ScopeA rotational talent development program\n\n12 months in different disciplinesAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kuwait",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}