{
    "Job ID": "69867900",
    "Description": "We are looking for a \"Business Controller\" for our leading business partner in plastics industry.Client DetailsOur business partner is a global company in manufacturing sector.DescriptionDaily announcement of internal & export order dashboard to BoD and top management\nWeekly pricing growth reporting by channel and product group for YoY / MtD periods\nWeekly order amount & profitability analysis and reporting to top management by channel and price list\nWeekly export channel order trend analysis and reporting\nPublishing monthly pre-closing results to BoD\nPre and final announcement of sales and profitability results by channel and product group\nKey player of company monthly financial report preparation (not include IFRS reporting)\nMonthly export channel financial report preparation by channel, customer and product group (direct communication with sales team)\nMonthly pocket margin booklet announcement to top management\nKey leader with SL, Business controller of Odito System Management with third parties and sales team (sales team effectiveness-customer visit management)\nMonthly reporting of customer visit analytics to top management\nCompany sell-out sales & profitability reporting by channel, customer and product group\nPricing and Cogs Dashboard monthly reporting\nSales return follow up and monthly announcement\nTrade spend (discount, campaing) controlling vs budgetProfileBachelor or Masters degree in Economics, Business Administration or Finance preferred.\n1-3 years experience within business controlling, financial planning & analysis, corporate planning or equivalent. Commercial controlling (sales & marketing) or business controlling experince in manufacturing companies preferred.\nStrong analytical and process analysis skills\nStrong communication and interpersonal skills\nUpper-intermediate English\nSkilled in Excel must, while experience from BI systems preferred (Qliksense, etc).\nTeam player, strong communication and analytical & process analysis skillsJob OfferA great career opportunity in an international company.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}