{"Job ID": "69866756", "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,900 companies and have detected 100 Million threats/day. We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.Our Corporate Social Responsibility (CSR) strategy is to help enable economies and communities to prosper. We seek someone who wants to join us in creating a positive impact for the environment, people, and society at large. The role will experience first-hand how Zscaler applies its CSR strategy to the most relevant local concerns which vary across our network of # markets in the region and has a possibility over time to extend their support to strategize, plan and enable execution in regions across the globe.Key ResponsibilitiesIn this role, the CSR Lead will be supporting CSR in India with a clear focus on India. This role will report to the Sr. Engagement Program Manager, India and has accountability to India Leadership, VP HR, India & APJ. Responsibilities cover all relevant activities within CSR in the region and in India, including support for strategic and governance work as well as tactical day-to-day activities.NGO Management:\nThe assessments/reviews of NGO proposals to support CSR India Leadership on NGO management.\nThe search for new NGO partners that meet our strategic pillar focused on the environment, sustainability, and passion projects.\nPartner with the CSR Chairpersons to ensure that the reviews of NGOs are taking place. \nVolunteer Management:\nResponsible for supporting the coordination of volunteer events including the end-to-end coordination between NGOs, CSR Committees, Admin team  and employee volunteers on logistics in each city where we operate and encouraging employees across the various branches and entities to volunteer their time and skills to Zscaler NGO partners/programmes in India.\nPartnering with People & Culture and Finance teams for logistics, execution, payments, etc.\nMonitoring feedback from volunteers and the engagement to support better participation\nUsage and maintenance of organizational tools and platforms:\nZscaler Giving Back portal for volunteer event planning and reporting\nFinance tools to raise and process payments \nCommunication channels such as the intranet or Slack to socialize and engage\nProcess legitimacy of NGOs through background validation and compliance agencies prior to pursuing and partnering with NGOs\nStakeholder Management:\nCalendaring key accounting and governing meetings\nOverall program management of the program and budget \nProviding communication support and reporting back to key stakeholders\nProvide feedback into any asks and compliance\nPartner with HQ ESG team to share initiatives and learnings\nLegal Compliance and Documentation Support:\nAudit: Liaise with the finance team, internal audit & SOX team and the statutory auditor to support documentation  asks such as utilization certificates on each CSR project\nPayments: Coordinating with Legal and other teams to ensure MoUs are in place and receipts are received for each payment\nMaintain offline and online records for each NGO\nTo meet the regulations stipulated by the CSR Act in India, carry out post-funding follow-up with NGOs on various forms and utilization certificates to be submitted to Finance, Tax, Regulators.\nKeep up to speed with the regulatory framework corresponding to the CSR provisions in the Companies Act and other related.Individual contributor with 5-7 years of robust experience in CSR roles with IT services/product companies.\nStrong administrative, organizational, project, processing, and time management skills; attention to detail, accuracy\nStrong written and spoken English.\nAbility to work independently and with initiative and a team player.\nAbility to multitask (comfortable switching back and forth between several tasks)\nStrong proficiency in MS Office (especially MS Excel) and online systems#LI-NT1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}