{
    "Job ID": "69866198",
    "Description": "What you'll do:This is a role within Cisco's Cloud Networking Group. You will work on developing functional and system test plans, test tools, complex test automation code which ensures functionality, reliability, robustness and high availability of NxOS for Nexus 9000 deployment in data center and cloud networking environment. The deployment of Nexus 9000 enables the network infrastructure flexible and agile for dynamic response to application needs and virtual machine workload mobility. The automation should be highly modular and re-usable for future class of products as well as high in class for use in customer deployment validation as well.Who you'll work with:You will work with a diverse group of some of the brightest problem solvers and thinkers in the Data Center Switching Team that work on next generation of Data Center & Cloud switches.Who you are:You are someone who thrives in a dynamic start-up like environment. You have at least 7+ years of software test engineering experience with manual test and strong automation development skill and are looking for an opportunity to shine, in a team where you can thrive, one that recognizes your capabilities and rewards you accordingly.Minimum Qualifications:BS with 5+ years of experience in Software QA engineering\nExperience in understanding software system specifications and developing functional and system test plans\nStrong programming knowledge (Python/C/C++), architect and develop automation to meet functional and solution requirement\nCI/CD, Jenkins’s exposure. Test driven development approach, Test as a service approach with flexible and modular automation\nExperience in TCP/IP, VLAN, STP, Routing protocols, QoS, VxLAN, Data Center Technologies, openconfig, Netconf, YANG, network automation\nBachelor's Degree in Computer Science or related field (MS preferred).Desirable Skills:Experience with high availability related to switch/router products \nExperience in Data Center fabrics and corresponding technologies like VxLAN\nUnderstanding of cloud architecture and services in multiple public clouds like AWS, GCP, Microsoft Azure.\nYou are a standout teammate, catalyst with a can-do attitude, one that takes initiative.\nYou are able to work independently as well as in a team.\nYou have good interpersonal skills and ability to adopt and take on any project.#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters - with people like you!\n\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world - whether through 5G, or otherwise.\n\nWe tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another - from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCiscoJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}