{
    "Job ID": "69867117",
    "Description": "We are looking for an exceptional program manager who is passionate about Customer Experience, who thinks/acts globally, and who has the ability to contribute major new innovations in the industry to join us within the Workforce Program Manager team.\nThe ideal candidate will possess both technical background that enables him/her to work with technology and a demonstrated ability to think broadly and strategically about global initiatives. He/she will experience a wide range of problem solving situations, strategic to real-time, requiring understanding of technical infrastructure and stakeholder expectations.\n· Clearly defines In-Scope and Out-Scope projects, managing various tools or technology launches and support configuration for the product team.\n· Working with cross-disciplinary and cross functional teams like Operations, Training, TASA, Data Engineering, SRCM and Tech Teams.\n· Becomes the \"subject matter expert\" on the projects they are leading advising their peers, managers and SMT.\n· Collaborate with the Engineering and Ops Analytics team and drive automation solutions for queue monitoring, alert mechanisms, report out communication and driving operational responses to threshold breaches.\n· Creating standardization and guidelines/playbooks for assessing multiple variables in making trade off decisions with a view to make the decision making more efficient and accurate.\n· Monitor overall program’s progress, the execution and ensure the delivery is to an appropriate level of quality, ensuring the overall integrity of the program. At the same time anticipate risks, resolve issues and initiate corrective action as appropriate.\n· Collaborates with Capacity Planning and Forecasting to determine location requirements by analyzing forecasting planning factors, including service levels, contact volume, contact patterns, staffing capacity, staffing, staff productivity, workforce management systems, workflow, etc.\n· Working with wider Workforce Management Team define, prioritize and plan the projects that need to be implemented to execute. Provide guidance by investigating trends, hypothesis and gaps using data and other forensic evidences and build transformation plan in agile fashion.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- 2+ years of program or project management experience\n- Experience with ExcelJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}