{
    "Job ID": "69867315",
    "Description": "Key Deliverables\n- You will be creating adequate automation process and implement technical edge in the Airtel Digital Portfolio.\n- Responsible for end to end app deliverables, which includes requirement phase, design phase, app release process and customer issues debugging.\n- Should posses strong technical skills in functional/Non functional Testing of backend APIs through Automation ,debugging , monitoring and setup and end to end ownership for delivery and quality of the deliverables.\n- Proficient in automation & developing test strategies for non-functional aspects of mobile apps\n- Continuously improve QA methodology, process and practices\n- Should possess strong ownership of the team's deliverables & play role of a good mentor.\n- Collaborate with outsourced testing team and ensure proper planning & execution of manual & automation tests.Skills Required\n• Experience in designing automation framework using any language to target backend APIs\n• Expertise in object-oriented programming languages and coding skills in any language preferably Java/Python/JS\n• Strong knowledge of Rest APIs. Rest Assured with Java preferred\nShould be able to debug backend/front-end issues.\nGood knowledge of CI/CD Pipeline and Monitoring tools like Jenkins, Kibana, Grafana.\nExposure to Code Coverage analysis tool like Sonarqube, Jacoco is preferred.\nGood knowledge of Performance Testing tool.\n• Strong knowledge of Mobile Operating Systems and experience in Non Functional testing of Mobile Apps\n• Exposure to DevOps and Security Testing is a huge plus.\n• Good knowledge of SQL or any NoSql DBMS worked upon like MongoDB, AeroSpike.Educational Qualifications\nBachelor's degree in computer science, Computers Engineering or comparable experienceWork Experience\n2-6+ years of hands on experience in software development. (edited basis level of hire)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}