{
    "Job ID": "69868530",
    "Description": "Missions : Contribuer aux activités de l’équipe en y apportant une expertise technique sur l’ensemble des services/domaines techniques.\nDécliner, appliquer et s’assurer de la bonne application et de la conformité par rapport à la politique de sécurité définie\nAssurer le maintien en condition opérationnelle des solutions sécurité du périmètre (Administration, sauvegarde, gestion de l’obsolescence, mise en œuvre et gestion des moyens nécessaires pour assurer la disponibilité/performances des équipements gérés)\nParticiper à la définition des architectures d’infrastructure et aux déploiements des solutions sécurité dans le cadre de différents projets (fiabilisation, évolution et métiers)\nGérer les mesures de sécurité des données en termes de confidentialité, Intégrité, Disponibilité et Traçabilité.\nAssurer l'administration fonctionnelle et technique des solutions de sécurité du périmètre\nRédiger et élaborer les documents techniques type HLD, LLD et rapports de Benchmark\nAccompagner et conseiller les projets SI en matière de sécurité\nCollaborer et travailler avec les autres équipes de l’entité (Réseaux, Telecom et Systèmes) pour appliquer les exigences de sécurité au niveau de toutes les composantes de l'infrastructure SI et notamment la sécurité dans les environnements de production.\nAssurer la gestion des vulnérabilités sur le périmètre de responsabilité\nContribuer à la veille sécurité et à la définition des roadmaps du service\nContribuer à la production des indicateurs opérationnels de son équipe\nParticiper aux travaux autour de l’automatisation et orchestration des solutions/services de sécurité.\nGérer les incidents de production.\nGérer les demandes utilisateurs via l’outil de ticketing\nAssurer l’astreinte et les opérations en HNOProfil recherché:De formation bac+5 Ingénieur informatique avec un minimum 5 ans d’expérience dans la fonction en tant qu’ingénieur Réseaux & SécuritéCompétences techniques :Une bonne maitrise des environnements de Routing, Switching et Firewalling. Avec des connaissances approfondies souhaitées en:Solutions F5 (ASM, LTM, DNS)\nTechnologies de Firewalling : Fortigate, Cisco ASA\nSolutions de proxy : McAfee\nSolutions IPS/IDS\nAdministration Linux (appréciée)Scripting et développement (appréciée)--Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}