{"Job ID": "69869988", "Description": "Job Description and QualificationsJob Title :  Grade - 112Senior Engineer - ExpeditingJob Description and Qualifications :I. POSITION SUMMARY\nGraduate engineer having 15 to 18 years of experience in Oil & Gas industry. The Sr Expeditor will be responsible for timely receipt of purchased equipment, materials & services. Serve as a liaison between vendors, engineering and client group. He will lead the team of expeditors and develop a project expediting strategy.\nII,  NATURE, AND SCOPE\nHe will control and monitor the team of expeditors. He will need to work closely with projects, engineering & procurement teams to meet the project timelines & objectives.\nIII. PRINCIPAL ACCOUNTABILITIESMust have the knowledge and practical experience of manufacturing processes for Heat Exchangers, large vessels, tanks, electrical equipment, static & rotating equipment, and structural steel etc.\nManage suppliers as well as interface with cross-function teams\nIn-depth knowledge of materials, manufacturing processes, packing, shipping requirements etc \nEnsure the on-time delivery of materials/equipment/services in term of project timing, key milestones and quality control gates.\nAble to read & understand life cycle of purchase orders, the drawings requirements, product schedules and shipping documentation.\nVery good supplier relationships and proactively work for anticipated delays.\nEnsure reporting to project/clients.\nWork closely with projects, engineering & procurement teams to meet the project time lines & objectives\nWilling to travel as per business on short / long term basis. \nEffectively participate in Continuous Improvement activitiesIV.  MINIMUM REQUIREMENTS AND QUALIFICATIONS\nQualificationsDiploma / Bachelor’s Degree in Mechanical or welding Engineering\nKnowledge of materials, equipment, project schedule etc and other applicable manufacturing codes & standards\nExcellent English language proficiency is required (oral and written).\nShould be able to manage supplier’s claims.ExperienceAt least 15-18 years of working experience with min. of 10 years in project management or expediting function with multinational company, preferably within the Industrial equipment, Oil and Gas Industries.\nFamiliar with fabrication equipment design / manufacturing process is preferred.\nKnowledge of Quality System, ISO9001, Lean Six Sigma· Skills\n-   Self-starter and proactive\n-   Good business communication and interpersonal skills\n-   Excellent problem solving skills\n-   Team player\n-   High ethical conduct\n-   Familiar with procurement and supplier chain management processes\n-   Project management skills\n-   Professional proficiency in Word, Excel and PowerPointJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}