{
    "Job ID": "69868094",
    "Description": "General information:The success candidate will be the part of HUB APMEA PT Tendering Team specialized in Power Transformers design. Preparation of General Arrangement, Bill of materials and submission to customer as per project schedule. Responsibilities:Responsible for development of Power Transformer mechanical order and tender designs in coordination with the Market and Sales Strategy to meet the market needs. Responsible for development of various application transformers designs in coordination with global Hitachi ABB factory based on the purchase order requirements, ordering specification in different areas of transformer Mechanical design Responsible for development of transformer mechanical designs based on tender specifications Preparation of tender GA & other drawings as per customer specification Optimization of MS & Oil quantities for targeted tenders Support for retrofitting designs i.e. matching existing dimensions, terminations, foundation etc. Support to TRES designer Influence specification at the tender and pre-tender stage, through conceptual discussions. Visiting customers, sites for technical discussions, taking measurements of existing transformers Exploring & implementing new transformer accessories Participation in internal design concept reviews.Your background:Bachelor's degree of Mechanical Engineering. 2-7 years' experience working in Mechanical design for Power Transformers. Further experience in other products such as Shunt Reactors, Special transformers would be advantageous. Understanding of Power Transformer Mechanical Design, Thermal, Short circuit and Sound performance and transformer mechanics Experience in Customer drawings Knowledge on CAD software, 3D Modeling software - Creo is considered an advantage Experience in Simulation or software development would be advantageous. Experience on Microsoft office and tools. Good communication skills in English Language in oral and written form. Ability to speak with and work together with the technical teams in different parts of the world. Demonstrated team building skills, would be a preference.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Vadodara, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}