{"Job ID": "69866614", "Description": "Job Title: CMRP LeadJob Location: Bengaluru / MumbaiAbout Unilever:Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us. We promote innovation, big and small, to make our business win and grow; and we believe in business as a force for good. Unleash your curiosity, challenge ideas and disrupt processes; use your energy to make this happen. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best. Every day, nine out of ten Indian households use our products to feel good, look good and get more out of life – giving us a unique opportunity to build a brighter future.Every individual here can bring their purpose to life through their work. Join us and you’ll be surrounded by inspiring leaders and supportive peers. Among them, you’ll channel your purpose, bring fresh ideas to the table, and simply be you. As you work to make a real impact on the business and the world, we’ll work to help you become a better you.About UniOps:Unilever Operations (UniOps) is the global technology and operations engine of Unilever offering business services, technology, and enterprise solutions. UniOps serves over 190 locations and through a network of specialized service lines and partners delivers insights and innovations, user experiences and end-to-end seamless delivery making Unilever Purpose Led and Future Fit.Business Context:Unilever is a business founded in 1890s with a strong belief in social purpose, and our unique heritage still shapes the way we do business today.We are one of the world's leading consumer goods companies, making and selling around 400 brands in more than 190 countries, €51B in revenues and a global presence across Europe, Americas and Asia/AMET/RUB. Over 2.5 billion people use our products to feel good, stay healthy and make their lives easier. That's about a third of the global population choosing from household names such as Lipton, Knorr, Dove and Hellmann's, and local brands like Bango in Indonesia and Suave in the US.Unilever’s Purpose is to make sustainable living commonplace, and this is underpinned by The Unilever Compass: Purpose-Led, Future-Fit is our new, single growth strategy based on three beliefs; Brands with purpose grow, Companies with purpose last, People with purpose thrive. Our vision is to be the global leader in sustainable business. We will demonstrate how our purpose-led, future-fit business model drives superior performance, consistently delivering financial results in the top third of our industry.Our sustainable living brands are inspiring people because they do good for society, environment, and contribute to the UN Sustainable Development Goals. Our sustainable living brands grew 46% faster than our other brands and accounted for 70% of total growth.Unilever is focused on delivering to the 5 fundamentals of growth as outlined below:Business Operations is a global organization focused on simplifying and digitizing Unilever’s operations for unlocking growth and creating value by making our processes and systems simpler, integrated, and easier to work with. We are redesigning and digitally rewiring our operations to enable Unilever to grow profitably and sustainably in the future. We also want to transform the experience of working at and doing business with Unilever – making it easy, user friendly and more like the one click world. We are fully digitizing to transform the way information and insights flow across the business and functions.This means freeing our people’s time and talents to focus on growth; thus, uunlocking capacity and delivering Fuel for growth by increasing people’s ability to focus on customers and consumers through’ delivering a truly Future Fit Operations across our multi stakeholder model.Within UniOps, the Commercial Experience [ComEx] team has always been a pioneering organization - providing financial services across Unilever such as Record to Report (R2R), Source to Pay (P2P), Global Control Service Centre (GCSC), Supply Chain Finance Services (SCFS), Fuel for Growth (F4G), Treasury, and Parent & Holding Controls (TRC). ComEx is now expanding its scope to cover Unilever’s acquired businesses. These businesses are fast growing with varied business models under diverse technology landscape and having different level of process maturity. Plan is to establish a team that will become the One stop shop for e2e finance shared service operations across Record to Report (R2R), Purchase to Pay (P2P), Bill to Cash (B2C) and Supply Chain Finance (SCF) for Acquired Businesses with the objective of driving simplification in run operations as well as step change controls compliance thereby releasing business bandwidth to focus on growth agenda.Main Accountabilities:Central Material Requirement Planning (CMRP) is a process which encompasses a tool in SAP and systems to generate RPM Purchase requisitions for every factory-material-supplier combination as per net requirements generated on the basis IPM based scientific stock norms and total cycle times, on a weekly basis, production plans are released by supply planners for the next 19 weeks. The factories then convert these PRs into POs on the suppliers and agree delivery schedules basis the weekly production plans to ensure RPM stock availability to service the production plan OTIF. Various MIS reports viz. GRR, MSTN, Stock aging, Inventory Norms, DOH, business waste etc. are generated to aid buyers and factories to manage service levels and RPM inventory in an optimum manner. The role specifically includes the following:Job Purpose:Lead E2E CMRP process for HUL - Collaboration with factories for NTPO. Discussing reason for Noncompliance, Master correction, System Hygiene correction (Open PO, PR, incorrect stock, Booking)\n\nCollaboration with Supply planner on plan compliance, plan variation, Actual production V/s future plans & Month end week plans\n\nReduce RPM Business waste by proactively connecting with supply planner\n\nMonthly RPM IPM refresh exercise with buyers\n\nLong term RPM planning basis FG plan\n\nDaily RPM Inventory Tracking & driving Efficiency\n\nSupport Vendor MDM & Vendor related process of SNC\n\nCollaboration with Buyer for ensuring availability of contract, FSI & CMRP Masters\n\nLead CG team (5 team member) for MIS & rule basis activities for procurement\n\nDrive CMRP Excellence projectsKey Accountabilities:Inventory reduction\n\nSupporting CMRP Projects for driving efficiency Cost, Cash & Service\n\nDOH and Business Waste reduction, NTPO compliance, Frozen period plan complianceProfessional Skills:  Graduate + MBA DegreeExperience Required: At least 5 years of work experience (if not a SCT)Essential:Positive Attitude and High Bias for Action\n\nProficient in usage of MS-Excel, SAP R/3, BIW, APO\n\nAbility to adapt emerging technology usage in driving Procurement deliverables\n\nGood networking, communication & Stakeholder management\n\nTeam handlingSkills Preferred:Understanding of Demand & supply planning\n\nUnderstanding of Factory RPM planning ecosystemTravel: 10% of factory travel, hybrid working pattern Key Interfaces:Internal: Factory SCM / FMs, Procurement (local), supply planners, R&D, SC Finance, Planning Excellence teamExternal: Suppliers, CG, excellence project teams, service providers, CG, MDMJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}