{
    "Job ID": "69866772",
    "Description": "Job Purpose:Marketing Executives supports marketing activities for exhibitions and/or special events e.g. awards, conferences and works under the supervision of the Head of Marketing.The Marketing Executive will be responsible for assisting in developing effective marketing strategies and executing campaign plans to grow the website visitors, social media following and engagement. It will also support to execute sales campaigns.The Marketing Executive will also put forward ideas, develop new initiatives, take on new tasks as required by the marketing manager and apply their digital marketing experience.Key Accountabilities:Working on special projects as required by the division, i.e. research, internal project, small scale special event.\nEvaluate performance of media, association, industry partners and social media influencers and provide feedback/recommendations to marketing manager.\nBuild, maintain and optimise websites and work with internal support teams to make advancements and maximise conversion from the sites.\nCopywriting input and checking / proofing of all marketing materials in conjunction with relevant Marketing Manager.\nContributing to the database growth for the shows by researching competitor events; following industry leaders.\nAssist with development of content marketing calendar for show.\nWork in conjunction with Marketing Manager to ensure all social media channels are active in line with market expectations, monitor engagement and maximise conversion.\nReport on social media engagement and suggest improvements where necessary.\nManage the photographer and videographer onsite\nCollect customer insight onsite such as exhibitor and visitor testimonials.\nAssist in the delivery of all planned campaigns.\nCreate tracking links and maintain tracking master files per show.\nAssist in testing and monitoring active marketing programs with developing ways to improve those campaigns.\nProof-read all marketing materials in conjunction with Marketing &amp; Exhibition Managers to ensure accuracy.\nAct as point of contact with all show exhibitors including sending the welcome email, marketing requests, product image requests, PR information, etc.\nCreate exhibitor marketing collaterals.\nEnsure the marketing side of the exhibitor manual is updated and managed for the next edition.\nOnsite management of exhibitor requests.\nEnsure all sponsorship marketing deliverables are actioned and in a timely manner.\nResearching new external media for use on shows and updating media files accordingly.\nAssisting with the setting up of media deals with external organizations to ensure maximum exposure at lowest cost to show budget.\nCoordinate requirements with Media Partners ensuring adherence to timelines and plans.\nUpdate and manage the media partner log ensuring media partner marketing deliverables are actioned and in a timely manner.\nLiaise with external suppliers and assist in the coordination of design and production of marketing collaterals including sales brochures, visitor tickets, print advertisements, web banners/emails etc.\nDrop in copy to new websites and update the website with new content and images, given by&nbsp;the marketing manager, including the creation of campaign trackers.\nAct as point of contact with the operations department for issues such as travel agency, media racks, etc.\nSetting up emails on ESP.\nCarry out other administrative and other duties as required by show team.\nProvide reporting information as required by show team.\nOn-site support at shows involving ad-hoc work as required, this can involve extra hours.\nPerform any other duties that are commensurate with the grade and areas of responsibility.Qualifications and experience:Experience in the use of databases in both mass and targeted direct marketing campaigns.\nStrong knowledge of MS Office Suite, including MS Word, Outlook, and Excel.\nSocial media and digital channels savvy\nExcellent interpersonal skills and the ability to effectively communicate with and relate to all levels both within and outside the organisation.\nGood negotiation and relationship building skills.\nStrong attention to detail, while being a great multi-tasker with ability to meet deadlines and handle different campaigns at the same time.\nCopy writing. Excellent verbal and written English\nHTML proficient\nExperience using any of the following will be an advantage but not necessary: Salesforce or similar database systems; tracking or analytical tools such as google analytics; Photoshop, InDesign; eCRM tools or Hubspot, Dotmailer, Adestra; website content management systems or Wordpress; dreamweaver or HTML coding experiencedmg events is an equal opportunity employer. Should you not hear back from us within 14 days, please consider your application as unsuccessful for this round.&nbsp;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}