{"Job ID": "69869096", "Description": "The Accounts Payable Officer role is instrumental in helping the finance team establish and maintain internal and financial controls and procedures for the company in AP process.\n While supporting the AP Supervisor (ANZ) , some of the key responsibilities include:Payments are processed as per the internal controls with all the proper supporting and authority matrix.\nTimely booking and processing of the payment.\nAccounting of expense properly in the corresponding GLs.\nWorking with the business team and closing all escalations.\nMonth-end/Quarter End closure and provision of the expense.\nAnalysis of creditors outstanding.\nAdherence to defined SLA/TAT towards deliverables.\nValidating, booking, and processing of the salary, F&Fs and business reimbursements.\nClosure of daily BRS and monthly/quarterly BS Reconciliations assigned.\nClosing of the internal audit, statutory audit, and due diligence.\nRelated AP and operational Compliance like GST etc.\nAssisting with filing the GST return.\nContinuously work to improve AP processes through technology or quality improvements.\nPreparation of SOPs for various sub processes within for AP function and maintenance for updates.Education:College degree, M.Com /MBA or CA-Intermediate - 5-8 years of relevant Experience or equivalent designation required:Experience:Minimum of 5-8 years of experience in an Accounts Payable roleEffectively working with teams in different locations mostly in remote environmentKnowledge and Skills:Strong audit management experienceExcellent verbal and written communication skillsStrong skills in Microsoft OfficeAbility to manage numerous deadlines and prioritize workload accordinglyStrong problem-solving skills to analyze the data, search for inconsistencies, reconcile inconsistencies and devise solutions to errorsExposure to accounting processes, reconciliation, and client servicingExperience in BFSIExperience with ERP systems (Oracle preferred)Experience in project managementAdvanced Microsoft Excel skillsAny posted pay range considers a wide range of compensation factors, including candidate background, experience, and work location, while also allowing for salary growth within the position.Helping People Thrive in a Connected WorldConnect with us. Bring us your best work and your brightest ideas. And we’ll bring you a place where you can thrive. Learn more at jobs.assurant.com.For U.S. benefit information, visit myassurantbenefits.com. For benefit information outside the U.S., please speak with your recruiter.What’s the culture like at Assurant?Our unique culture is a big reason why talented people choose Assurant. Named a Best/Great Place to Work in 13 countries and awarded the Fortune America’s Most Innovative Companies recognition in 2023, we bring together top talent around the world. Although we have a wide variety of skills and experiences, we share common characteristics that are uniquely Assurant. A passion for service. An ability to innovate in practical ways. And a willingness to take chances. We call our culture The Assurant Way.Company OverviewAssurant is a leading global business services company that supports, protects, and connects major consumer purchases. A Fortune 500 company with a presence in 21 countries, Assurant supports the advancement of the connected world by partnering with the world’s leading brands to develop innovative solutions and deliver an enhanced customer experience through mobile device solutions, extended service contracts, vehicle protection services, renters insurance, lender-placed insurance products, and other specialty products.Equal Opportunity Statement\nAssurant is an Equal Employment Opportunity employer and does not use or consider race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by federal, state, or local law in employment decisions.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}