{
    "Job ID": "69866744",
    "Description": "At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you. With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.As a member of our Solution Consulting team, you will have a major impact on our future success by supporting  Customer Workflows  Solution Sales. You will guide revenue for one of our  products with the support and partnership of Sales, Product Management, and the executive team. This is a hands-on technical consultant who can go wide and deep on solution delivery and solution positioning during sales cycles.What you get to do in this role:  The Solution Consultant is a technical consultant with the advanced ability to develop, position and provide product-specific solutions during sales cycles while achieving quarterly and annual sales goals for an assigned territory.Support product sales as a technical and domain expert of a client-facing sales team that pursues customers and prospects across multiple industry markets\nLead discovery workshops to determine customers' challenges and give product demonstrations to align our solution with customer needs\nDevelop client partner relationships\nGuide strategic programs in top accounts such as customer journey sessions for roadmap and outcome agreement\nProvide feedback to product management about product enhancements that can address customer needs and provide additional value\nShare and learn best practices and re-usable assets with other Solution Consultants to enhance the quality and efficiency of the team\nStay current on competitive analysis and market differentiation\nSupport marketing events including executive briefings, conferences, user groups, and trade showsTo be successful in this role you have:10+ years of pre-sales solution consulting or sales engineering experience in customer experience, customer service, field service or SaaS solution\nProficiency with the ServiceNow platform or technical expertise with cloud software solutions\nExperience working collaboratively with product management, product marketing, partners, and professional services\nTerritory management skills, including pipeline building and working with Sales counterpart to promote execution excellence\nTravel, as necessaryServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.At ServiceNow, we lead with flexibility and trust in our distributed world of work. Click here to learn about our work personas: flexible, remote and required-in-office.If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at [email protected] for assistance.For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.Please Note: Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}