{"Job ID": "69868397", "Description": "Job TitleThe Creation Platform is at the core of the Amadeus growth strategy, by powering the next generation travel ecosystem: it connects partners, suppliers, customers, and travelers, with solutions, capabilities, intelligence, and content; these will combine to power the traveler centric journeys of tomorrow.We are looking for a QA engineer to join our Creation Platform - Fast Data team. This platform touches all segments of our business such as reservations, ticketing, departure control, inventory or even airlines proprietary systems. It allows airlines to react in real-time to their operations, creating and running key use cases in a modern and highly serviceable environment. The key focus of this team is on the openness of our Fast Data capabilities – imagine giving a customer full self-serviceability over enhancing their products both at the core and the edge using developer Studios.Key Accountabilities:You will:1-) Implement test planDefine test cases from customer’s requirements and ensure traceability with specifications.\nWrite test plan (functional and/or non-functional and/or non-regression).\nEnsure improvement of non-regression test repository in the Change Request plan.2-) Design and perform testsDesign/Write test cases.\nDevelop automation scripts (API).\nPrepare test environment, test data, and execute test cases.\nPrepare test execution report.\nGive go/no-go for the customer’s test campaign.\nBe responsible for the project, product or release quality control.3-) Problem Tracking RecordsProvide information to developers in order to fix defects.\nCheck defect fix and give go/no-go for the load of bug fixes to prod and test phases.\nRecord and track software defects.4-) Share your knowledgeParticipate in specification reviews to give input on testing requirements.\nReport and communicate on test activities to the line organization, software developers and product definitions analysts.5-) Internal Policies and ProceduresEnsure the internal process and procedures are executed properly.\nStrong sense of responsibility for company assets, be proactive against security vulnerabilities and breaches.Professional Skills:2+ year experience in testing software applications (API, UI).\nHaving knowledge of black box testing techniques.\nHaving knowledge in web and API technologies (Rest API, HTML, Javascript).\nHands on experience in scripting with proven automation frameworks (e.g. robot framework, selenium, playwright is a plus).\nExperience in API testing (Rest, SOAP) with proven tools (e.g. SoapUI, Postman).\nUsing and maintaining testware (test cases, test scripts, test reports, test plans, etc) to measure and improve the quality of the software being tested. Testing embraces the planning, design, management, execution and reporting of tests, using appropriate testing tools and techniques and conforming to agreed standards to ensure that new and amended systems, configurations, packages, or services, together with any interfaces, perform as specified.\nISTQB certification (Foundation or Advanced Level) is a plus.\nStrong written and verbal communications, teamwork, and problem-solving skills.\nAbility to interact and communicate successfully with business partners and technology teams.Diversity & InclusionWe are an Equal Opportunity Employer and seek to hire the best candidate regardless of age, beliefs, disability, ethnicity, gender or sexual orientation.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}