{
    "Job ID": "69866687",
    "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Work Location: Mumbai / BangalorePosition OverviewThe Professional Services Resident Consultant will be part of Global Professional Services (Go to Market) organization spread across Americas, Europe, India and Australia.You will be part of our India ‘Global Delivery Center’ that comprises of Zscaler experts who provide world-class Zscaler product deployment services to our customers.The Professional Services Resident Consultant will be a dedicated resource** to one of our strategic customers and will be engaged with the account for long duration (6 months, 1 year, 1 year+). You will be required to act as a trusted champion - deep dive in the customer environment and their unique requirements, create a design plan, configure, and integrate ZS solutions to enable their best usage of the Zscaler zero trust platform.In this role, you will be front ending customers while working closely with sales, externalpartners and various customers teams to provide consultancy and product deploymentservices. Your objective will be to ensure that our customers accomplish their objectives with respect to the products and services they have bought and help them successfully deploy our Zero trust solutions within the agreed timeframes.** The Resident Consultant may be required to service more than 1 customer depending on the nature of project/contract and depending on the demand for Residency Services.ResponsibilitiesServe as the customer’s ‘Go-To’ resource for all matters related to their ZS deployment\nDeliver best practices guidance for managing ZS deployment.\nAssist in customer specific requirements and provide solutions.\nAnswer questions about the product capabilities, features and configuration.\nAssist customer team with the design and planning/configuration\nEvaluate deployment scenarios\nPlan migration tasks\nAnalyze existing rules and objects\nCoordinate and execute cutover to production\nWork with customer to request new features & troubleshoot any product issues\nAnalyzing ZS configurations\nTesting product’s features and functionality\nProviding regular updates on work in progress and current issues\nProviding informal technical and product workshops\nTroubleshooting the cloud and supporting customer operations\nEvaluating technical specifications for interoperability\n Requirements  Must have strong verbal and written communication skills (English)\n  8+ years’ experience for this role in similar positions (Professional service consultant, Network/Security specialist, Technical Account Manager, Support/Escalation Engineer or a SOC Engineer). Experienced in Network and Security solutions and customer facing/field role\nExperience deploying, maintaining or troubleshooting networking, firewall and security solutions in enterprise environments is important. Experience with Zscaler solutions – ZIA, ZPA\n Working knowledge of networking and security products from various vendors and enterprise network infrastructure\nAbility to navigate technical and architectural discussions with customers, partners including audience from business and technical fraternity\nExcellent communication and follow-up skills across internal and external organizations. A proactive approach to ensure the job gets done !\n Effectively handle multiple projects and work calmly under pressure\nWorking knowledge of authentication systems such as SAML, LDAP and MS Active Directory\n Knowledge of solutions built on Microsoft Azure, Amazon Web Services and other leading cloud platforms\n Good knowledge of Hypervisors: VMware, Hyper-V, and KVM\nGood knowledge on HTTP, HTTPS, SSL Inspection, DNS\n  Experience with Proxy and SSL\nGood knowledge of IPSEC, GRE, HTTP/HTTPS, DNS protocols\nIndustry certifications such as ZCCP–IA and PA, Cisco, Juniper, Palo preferred.\n Hands-on knowledge with network troubleshooting using tools such as Wireshark, tcpdump, Traceroute, and MTRWhat You Can Expect from UsA great learning environment where you will be working on cutting edge technologies and architectures\nFront end role to work with global customers and sales teams\nLong term opportunity to become a customer advocate\nCross functional expertise to closely work with various roles from Sales, Services, Engineering\nBe part of a Global organization (that also includes delivery, service sales, practice, PMO, portfolio, enablement functions) and work/learn from senior consultants, architects on Zscaler solutions and advancements\nAccess to latest trainings, modules to become a ZS expert\nA long term and meritorious career\nA great leadership team willing to help and open-door culture\nA fun, passionate and collaborative workplace\nThe fast pace and excitement of working for a Silicon Valley Unicorn and leader in Cloud Security !#LI-VV3Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}