{
    "Job ID": "69865572",
    "Description": "Marketing Content Executive The Iconic Rixos Gulf Hotel Doha introduces a unique lifestyle and luxurious Services and products, Rixos warm hospitality, the vibrant Entertainment programs, and the trendy and distinguished ALL INCLUSIVE Food and Beverage concepts with 378 beautifully appointed guest Rooms, dream bedding and luxurious atmosphere. Join our motivated and vibrant Team as Marketing Content Executive and build your career with us.The RoleAs a Marketing Content Specialist at Rixos Gulf Hotel Doha, you’ll lead, produce, and create videos and pictures that tell our story, promote our restaurants, spa, entertainment activities and enhance our brand. There is more than one way to tell a story, and we are looking for a Content Specialist who can take one video and create many different stories from that video. You’ll be interested and/or experienced in marketing, digital media, and social media. You are a storyteller, with a passion for sharing and creating these stories through videos.The content creator will update existing material, generate creative commercials, videos and photos that will reach consumers through Rixos Gulf Doha social media platforms, websites, and printed material.To be a successful content creator, you should focus on appealing to consumers' interests by creating engaging material. Ultimately, an exceptional content creator will promote collaboration between internal stakeholders to ensure consistency in Rixos Gulf Hotel Doha as a brand.You will play a fundamental role in helping us reach our target audience by delivering trendy content which will raise awareness on the uniqueness of our products and services and eventually boost sales.Responsibilities·Research the latest trends in videos published via social media·Prepare well-structured drafts and briefs on videography/ photography sessions with mood boards that will serve as a guide to all internal stakeholders involved in the shooting·Create monthly social media calendars for the hotel and F&B outlets·Create and use marketing copy to advertise the hotel and F&B outlets·Edit and post production of videos and photos before publishing·Use a variety of technical skills and software to complete production, including Final Cut Pro X, Adobe Premiere, and Adobe After Effects to name a few·Identify customers’ needs and recommend new topics·Work in a team environment, with stakeholders from a wide variety of departments, including F&B outlets, spa and recreation team.·Previous agency experience a plusRequirements and skills·Proven work experience as a Content Creator, video or similar role·Be creative and able to work with subject matter experts to turn ideas into compelling scripts that are shared through video·Portfolio of videos/ images·Hands-on experience with Content Creation Systems·Excellent writing in English and Arabic·Ability to work under pressure and be flexible with working hours·Time-management skills·BSc in Production of Audiovisual and Digital ContentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}