{
    "Job ID": "69866291",
    "Description": "Job Description Summary:Function Overview:\nCiti’s Treasury and Trade Solutions group is built on the power of our network. Citi Treasury and Trade Solutions (TTS), provides integrated cash management and trade finance services to multinational corporations, financial institutions and public sector organizations across the globe. With a full range of digital and mobile enabled platforms, tools and analytics, TTS continues to lead the way in delivering innovative and tailored solutions to its clients. TTS offers the industry’s most comprehensive suite of treasury and trade solutions including cash management, payments, receivables, liquidity management and investment services, working capital solutions, commercial card programs, trade finance and services.\nvTTS counts 80% of Global Fortune 500, over 1,100 public sector entities and thousands of financial institutions amongst its diverse client base\nv Doing business In 160 countries and jurisdictions, and transacting in over 140 currencies, TTS processes some USD 4.0 trillion of client payments everyday\nv Collaborates with clients to deliver next-generation financial solutions using TTS Innovation LabsApplication / Team Overview:From Shared Services team we handle all ECS related activities for a variety of middleware technologies. We also provide development support for hundreds of applications. This particular role is created for ECS- OpenShift Administrative, configuration and development support. Our primary function is to engineer and implement technology solutions that will help application teams avoid production outages and produce quality software. We are also assisting several applications with their cloud transition. Our services include below.\n• Engineering\n• Onboarding\n• Reusable Tools\n• Environment Automation\n• License Management\n• SME support along with advanced troubleshooting\n• Design and Code Reviews\n• Initiatives that improve productivity and result in efficiencies\n• POCs and adoption of new products\n• Interact with SA, dba, developers and product and send requests to ArchitectureJob Description:All Shared Services listed in Summary\nDesign and Develop tools to standardize and automate monitoring, application support activities.\nTechnical support to applications on trouble shooting Environment, software and application-level issues\nWrite, test programs using Unix Shell scripting, Dockers, OpenShift deployment related configuration files, CICD, Monitoring tools.\nPartner with cross functional teams across Development, Validation/QC, Production.\nServer builds\nAdministration and development support involving trouble shooting\nProviding design inputs and code reviews\nSupport Global teams across all of TTS supporting cloud solutions.\nExpertise in ITRS monitoring\nExpertise in automation with AutoSys\nExpertise in Perl/ Shell scripting.\nExpertise in Kibana and AppDynamics\nManaging support services and change management using ServiceNow application\nTechnical / Functional Proficiency:\nKnowledge/Experience: 5+ years of experience with Cloud Operations (On Premise, Internal or External Cloud).\nStrong working experience on software Containerization platforms like Docker and container orchestration tools like Kubernetes, OpenShift and Docker Swarm.\nGood Hands-on experience in containerizing applications of various technology stack like Java, Spring boot, .Net, Tomcat etc.\n3+ years of experience with either of the scripting technologies Ansible, Shell (preferred) however exposure to either, Jenkins, Kubernetes/Docker Orchestration is good.\nLevel 3 support troubleshooting expertise.\nExperience in AMQ setups.\nExperience with equivalent configuration management and monitoring, auto-scaling services, application deployment, and performance testing services.\nExperience in Continuous integration/continuous delivery tools/concepts (CICD concepts).\nResponsible for incident/ query resolution, application analysis, enhancements and reliability based on documented SLA's.\nProvides quick resolutions to app issues, driving stability, efficiency and effectiveness improvements to help business succeed.\nIssue tracking and reporting using tools, Knowledge/ experience of problem Management Tools.\nStrong communication skills.\nStrong ability to plan and organize workload, effectively share information with other support team members and with other technology teams.\nDevelop and maintain technical support documentation.\nAbility to communicate appropriately to relevant stakeholders.\nOpen to learn and Easy to grasp new technologies quickly.\nMaintain and support enterprise applications deployed in Open Shift containers. Responsible for coordinating with multiple teams and groups for successful instantiation of OSE Containers, all integrations such as Single Sign On, Job Schedulers, Password Management utilities etc.\nIdentify gaps in automation, processes and identify system inefficiencies. Work with partner teams to put together the remediation plans.\nStrong problem-solving skills, decision making ability and be able to display the sense of urgency and complete ownership.\nAbility to handle a high-pressure environment and be prepared to jump right in to address any production outages.\nLeadership Skills:Puts clients first by anticipating, understanding, and exceeding their expectations and needs\nActs as a trusted partner to clients by delivering superior advice, products and services\nDrives innovation, competitive differentiation and speed to market by actively learning from others\nExemplifies global leadership by embracing unique perspectives from across the organization\nChallenge’s self and colleagues to higher levels of performance by actively listening and engaging in constructive dialogue\nTreats people with respect and assumes the intentions of others are based on common goals and shared purpose\nExhibits confidence and agility in challenging times\nSets the standard for the highest integrity in every decision\nHas the courage to always do what’s right and the humility to learn from mistakes\nSets goals and measures progress to ensure the organization is focused on ethics, execution, and results\nExpects self to consistently meet/exceed expectations-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}