{"Job ID": "69866399", "Description": "Apply now Job no: 4069801\nLocation: Central Province\nAlshaya Food Factory Riyadh SudhirCPFAlshaya’s Central Production Facility (CPF) in Kuwait currently employs more than 150 people and manufactures food products for brands such as Starbucks. Now is an exciting time to join CPF as they embark on plan to improve, innovate and build additional revenue streams.Role Profile:Responsible for a shift within Distribution Centre operations which include Omni-channel fulfilment and Last Mile deliveries as well as 3rd Party Logistics Providers. Develop Employees to achieve company targets and goals. Drive performance, ensure customer satisfaction and identify ways of improvement Focus Areas: Support (i.e. Administration & Procurement, Helpdesk, System, Health and Safety) Operation (i.e. Warehouse Ops, Fleet, Ecom)The below Key Performance Areas include but are not limited to:Work closely with Warehouse Manager to ensure stock flow from DC whilst improving productivity and managing operating costs.✓ Plan and co-ordinate weekly and daily work processes with DC Supervisors.✓ Co-ordinate new launches and necessary allocations with Merchandisers.✓ Ensure workload is completed as planned.✓ Ensure agreed SLA’s and KPI’s are achieved.✓ Create, develop, and maintain good working relationships and networks both internally and externally. Execute all inventory activities, contribute to controlling shrinkage and take corrective action where necessary.✓ Plan for stock take and cycle counts.✓ Ensure that stock take is conducted as laid down. Control Shrinkage in line company targets. Analyze results and advise corrective actions. Ensure all housekeeping and health and safety standards are consistent with company policy✓ Ensure that housekeeping and safety standards are maintained, appropriate to changing requirements/work practices✓ Lead by example regarding compliance. Provide accurate reports and support to internal and external contacts.✓ Provide accurate information and support to the team. Where required Liaise with outside service departments, third party providers and government agencies. Continuously explore opportunities to affect additional cost savings and improve service standards.✓ Ensure cost efficiency and service efficiency for all DC activity Approved Job Description (All markets) Internal use only✓ Assist in Budgeting process People Management and Team Development:✓ Manage manpower resource effectively to support customer delivery requirements.✓ Manage staff attendance and annual leave plan. ✓ Carry out incident / accident investigations and action closure as per company procedure.✓ Conduct periodic staff briefing. Communicate KPIs from the strategic annual plan so that each employee is aware.✓ Develop, motivate, appraise, and train Employees. Reward/Recognize high performers.✓ Drive performance by removing obstacles, improving processes, and recommend solutions.✓ Ensure transparent communication. Create a pleasant working environment that inspires the team with an open communication culture. Perform other duties as directed by Line Manager. Identify ways to drive improvement. Develop internal and external relationships. Stand-in Warehouse Manager during line manager’s absence.Knowledge:✓ College Degree or Diploma desirable. (Business Administration, Logistics, or relevant fields)✓ Supply Chain Management✓ Retail Operations including Home Deliveries, Omni-channel logistics, Shipping and Customs✓ Distribution Centre ManagementExperience:✓ Minimum 5 years’ experience at a Management / Supervisory level in a Medium to large distribution centers with 24/7 operations.✓ Strong Omni-channel DC operations experience.Skills:✓ Strong communication skills – both written and verbal (English/Arabic).✓ Strong leadership skills and organizational skills.✓ Computer literate with good numeric skills.✓ Strong internal/external customer service.✓ Strong planning skills. Ability to meet targets and deadlines✓ Strong interpersonal and attention to detail skills✓ Strong analytical and problem-solving skills, able to establish logical practical solutionsAbout Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arab Standard Time\nApplication close: 13 Oct 2023 Arab Standard TimeBack to search results Apply now Refer a friendJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Central Province, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}