{
    "Job ID": "69867877",
    "Description": "The global leader in public transport infrastructure, SYSTRA has specialized in the mass transit and rail market since 1957. The main shareholders of SYSTRA are SNCF and RATP. Its ambition is to serve emerging needs for collective and sustainable mobility throughout the world. With a presence in 80 countries, SYSTRA manages over 3,000 projects for high-speed systems, traditional rail lines, metros and tramways throughout the world.In India, SYSTRA is an international consulting and engineering company operating in the fields of Metros, High Speed Rail, Railways, Roads, Buildings, Urban planning, and Water & Environment for public and private organizations.Our engineers work with passion to deliver the most reliable, cost-effective and made-to measures solutions allowing end users to move seamlessly.SYSTRA’s unique expertise is backed with a reputation built through technical excellence delivered on projects. Thanks to our know-how of our employees spread across India, we are present at all stages from upstream studies to operation and maintenance. We provide a comprehensive solution to manage all kinds of missions: Detailed Design Consultant, Project Management, Independent checking services.SYSTRA has built a reputation of technical  excellence by delivering successful highways projects, both in Design and Construction Supervision,  across the world. In India, we have been providing design and construction supervision services for various National highways, State Highways/PWD and other road projects for various government institutions and private organizations since 1982.Our design teams are have experience of designing in accordance with various international codes as the design centre in India has delivered projects across the world. We are also conversant with BIM (Building Information Modelling) which enhances all stages of the infrastructure life cycle, from design to construction and maintenance, which is why we integrate it into our projects and offer it to our clients. Our design and supervision teams have extensive exposure to both domestic and international markets, contracts, codes and specification.Job Title    :  Lead Engineer - Bridge DesignJob ProfileCollection and review of data related to Bridge and CD works.\nGuiding Junior for various bridges and CD works inventory, inspection etc.\nArrangement and supervision of bridge and CD works field surveys.\nField Data compilation and analysis.\nHydraulic analysis of CD works, minor and Major bridges.\nStructural Design CD works, minor and major bridges including ROBs, Flyover etc.\nPreparation of detailed design reports.\nOverseeing the generation of drawings.\nAdhering to the project budgets.\nAdhering to time schedules for project delivery.\nIdentify scope change items.\nAny other task assigned by the management.\nMentoring/Guiding/Providing the training to the Junior/Senior design Engineers\nDiscussing with client AE/IE/Railways for getting the Approvals.\nManage resources at a project level to ensure utilization and productivity is maintained.\nEnsure compliance of the Systra Group policies, particularly on ethics, safety and adherence to Company ISO Standards.Minimum QualificationBE-Civil + M.Tech in Structural EngineeringKey Qualities and experience10 to 18  years of expérience in to relevant Fields.\nExperience on Software requirement STAAD Pro/ Midas or another analysis software, Oasys and MS Office.\nActively working towards Professional qualification.\nAbility to work in a collaborative multi-discipline design team.\nAbility to complete assigned tasks with minimal supervision and provide support and mentoring to others.\nExperience at working both independently and in a team-oriented, collaborative environment is essential\nStrong team player\nBasic knowledge of Geotech\nAwareness of latest codes / Standard (Aware of International guideline will have added advantage\nAbility to travel to client sites and other SYSTRA offices will be required.We commit to put people who join us at the heart of improving transportation and urban infrastructure efficiency. As we are growing, this is time to be a part of this challenging adventure.It’s not a job - it’s a career!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}