{"Job ID": "69867323", "Description": "Are you a seasoned consultative sales professional who loves to enable clients make smarter decisions?Are you motivated to achieve consistent targets and goals?About our TeamCirium provides actionable intel to global market leading aviation, aerospace, and traveller services companies. Our data powers the aviation industry and supports seamless travel for millions worldwide.About the RoleAchieve revenue targets through new business attainment and support upsell opportunities within existing client portfolio.Establishes relationships with key senior-level decision makers and influencers in target businesses across segments throughout the assigned geography.Responsibilities1.Sales Activity Identify new business opportunities to increase market share and penetration of Cirium solutions.\nAchieve new business and renewal targets for accounts in assigned markets.\nPlan and execute sales campaigns and account plans to deliver against target and maximise revenue growth.\nAbility to learn Cirium products and solutions quickly and explain them to clients and prospects.2. Relationship ManagementRegular contact with prospects and existing customers to understand their business objectives.\nDeliver a high level of customer satisfaction through a consultative sale approach.\nEstablish strong working relationships with all internal stakeholders within Cirium in order to develop and deliver bespoke customer solutions.\nShare best practices across the sales team.3.Market KnowledgeKeep abreast of industry updates and competitor activities and derive the impact this would have on Cirium’s solutions.Requirements4+ years of sales experience & strong tenacity for prospecting.\nA demonstrated history of successful closing\nAbility to engage customers with a value-based negotiation approach.\nAbility to pivot to take advantage of market opportunities.\nAbility to evaluate and justify trade-offs between short-term and long-term gains.\nAbility to exercise judgment based on the analysis of multiple sources of information.Work in a way that works for youWe promote a healthy work/life balance across the organisation. With an average length of service of 9 years, we are confident that we offer an appealing working prospect for our people. With numerous wellbeing initiatives, family leave and tuition reimbursement, we will help you meet your immediate responsibilities and long-term goals.·        Working remotely from home and at our office in a hybrid working style.·        Working flexible hours - flexing the times you work in the day in discussion with your manager.Working with usWe are an equal opportunity employer with a commitment to help you succeed. Here, you will find an inclusive, agile, collaborative, innovative and fun environment, where everyone has a part to play. Regardless of the team you join, we promote a diverse environment with co-workers who are passionate about what they do, and how they do it.At Elsevier, we know that your wellbeing and happiness are key to a long and successful career. These are some of the benefits we are delighted to offer:·        Group Health Insurance Policy (covering self and family)·        Group Life insurance/accident policy·        Generous long-service awards·        New Baby gift·        Subsidised food provided (applies to India- Chennai)·        Casual Leave, Sick Leave, Privilege Leave, Compassionate Leave, Special Sick Leave, Gazetted Public Holiday and Maternity/Paternity Leave·        Free Transport provided to and from the office (applies to India-Chennai)Working for youAbout UsA global leader in information and analytics, we help researchers and healthcare professionals advance science and improve health outcomes for the benefit of society. Building on our publishing heritage, we combine quality information and vast data sets with analytics to support visionary science and research, health education and interactive learning, as well as exceptional healthcare and clinical practice. At Elsevier, your work contributes to the world’s grand challenges and a more sustainable future. We harness innovative technologies to support science and healthcare to partner for a better world.Join UsPURPOSEFUL WORK\nWhen you work with us, your work matters. You are part of an organization that nurtures your curiosity to stimulate innovation for the communities that we serve.\nGROWING EVERY DAY\nLike the communities we serve, you are on a constant path of discovery to shape your career and personal development.\nCOLLEAGUES WHO CARE\nYou will be part of the Elsevier family. We will support your well-being and provide the flexibility you need to thrive at work and home.\nTogether, we create possibilities.\nJoin us-----------------------------------------------------------------------Elsevier is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. We are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our Applicant Request Support Form: https://forms.office.com/r/eVgFxjLmAK .Please read our Candidate Privacy Policy.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}