{
    "Job ID": "69866991",
    "Description": "Minimum Education Level: Diploma in Architecture / Interior DesignWill work closely with Senior Design staff to produce drawings for various international projects.Primary ResponsibilitiesLayout drawings to show wall/floor/ceiling finishes, furniture layouts, joinery key plans, lighting layouts. Follow marked-up drawings produced by the Interior Designers.\nFull room interior elevations to show finishes, details, features, joinery intent, location of fixtures and fittings.\nBathroom elevations to show design intent of wall and floor tiles.\nTypical Door drawings to show the design intent, door handles, frames, etc.\nDesign intent for Power/data and Home Automation.\nDesign intent drawings for Custom joinery items (plan/elevation/section/details).\nTypical Detail drawings for ceilings, walls, floors, joints, features, etc.\nCoordinating the lighting layouts, ceiling finishes, Home Automation drawings and MEP drawings to produce a coordinated RCP.\nInitially checking the drawings produced by external parties (i.e. MEP consultant and Home Automation supplier) and overlaying them/coordinating them with the Interior Design intent and reporting any discrepancies or issues. Prepare the drawings for the Interior Designers review.\nPreparing drawings ready for issue to external suppliers.\nPreparing documents and drawings in various formats for issuing to site.\nSometimes it will be necessary to update Specification Schedules (Excel format) when required.\nUpdate the drawing/document register when information is issued.\nAssisting with the Document Control of a project. Must be diligent with the naming and saving of soft copy files on the serverRequired skills:Architectural or interior design related background\nSoftware skills: MS Office and design related programmes (AutoCAD, sketchup, Revit, Photoshop, Illustrator, ect.)The Draftsman will be working alongside the Interior Designers, and will play an active part in preparing the documentation for submissions.Constant communication with the Interior Designers is required. Must be able to follow multiple instructions or tasks.The Draftsman will be an essential link between the Design Team and the Site Team during construction phase. Must be able to take information from the site team when required, and will be required to pass design information onto the site team when required by the Interior Designer (verbal or written communication). Experience of working in a site situation is essential. Excellent knowledge of construction detailing is essential.APPLY NOWJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Delhi, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}