{
    "Job ID": "69867863",
    "Description": "Jamjoom Pharma has in a very short span of time emerged, as one of the leading pharmaceutical companies in the Afrasia region. The geographical focus of the company is on countries in the Middle East, Africa, and CIS regions. Strategic focus on selected therapeutic categories has contributed to the rapid growth, market acceptance, and overall success of the company.Job Profile\nTo ensure consistent sales growth and achievement of goals and targets of our Pharmaceutical business in the assigned regions, while collaborating with other team members, exchanging knowledge, and increasing efforts towards aligned sales plans to create new opportunities, improve & enhance our ways of working and adopt the best practices in the market to sustain and grow our business.We have Vacancies for the below locations:Cairo (Nasr City & Heliopolis) \nGiza (Dokki, Mohandseen, Haram, October)\nDelta (Monofia or Shebin)\nUpper Egypt (Assuit) Qualifications:BSc of Pharmacy or equivalent.\n0-2 years of experience in the same position.\nCommunication, presentation & negotiation skills.\nTeam player.\nCustomer focus.\nResults oriented.Jamjoom Benefits:Financial:Very Competitive salary.\nAnnual Incentive.\nMonthly Expenses.\nCar Benefits (Fuel, Maintenance, Battery, Tires, Insurance, License renewal). \nFacility for car or personal loans.\nFamily Medical and life Insurance.\nParents Medical discount (Optional).\nPaid policies for Creativity ideas and Employees Referral.\nMobile Bundle.\nPremium Cards.Non- Financial:A new world class factory for long term investment in Egypt with a new factory in Obour City.\nTalent management and talent development strategic plans for clear career pathway.\nTop 5 Best Places to Work Certification Program across the Egypt and the Middle East.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}