{"Job ID": "69865544", "Description": "Position Title*: Sr. Local Trial Manager - Mumbai\n(*Title may vary based on Region or Country requirements)Position Summary:\nThe Sr. Local Trial Manager is responsible for local management of a clinical trial (or Medical Affairs\ndata generation activity) in a country or countries. The Sr. LTM is the primary point of contact at a country\nlevel for assigned studies and has operational oversight of assigned protocol(s) from start-up through to\ndatabase lock and closeout activities as described in GCO procedural documents. The Sr. LTM is responsible\nfor coordinating and leading the local trial team to deliver quality data and trial documents/records that are\ncompliant with the assigned clinical trial protocol, company Standard Operating Procedures (SOPs), Good\nClinical Practice (GCP), and regulatory requirements.The LTM role actively leads or contributes to process improvement; training and mentoring of other LTM s\nand Site Managers (SM).Compared to LTM I and LTM II roles, an Sr. LTM is often assigned to more complex protocols and can work\nacross Phase 1 – 3 studies in multiple therapeutic areas as needed to drive business needs.The Sr. LTM may also perform the role of Clinical Trial Manager (CTM)/Global Trial Lead (GTL) for single\ncountry as described in GCO procedural documents.Principal Responsibilities:\n1. Collaborate with Functional Manager (FM)/Clinical Research Manager (CRM) for country protocol\nfeasibility (if applicable) and site feasibility assessment in conjunction with CTA (if applicable), SM and\nCTM/GTL. Implements any local criteria for site selection. Ensure consistent conduct of pre-trial\nassessment visits and instruct teams on appropriate follow-up of pre-trial visit report and country\nfeasibility report. Recommends suitable sites for selection to participate in trial.\n2. Collaborates with the Global Product Lead (GPL), CTM/GTL, local management/Country Head and other\nstudy team member to select final site list.\n3. Contributes input to the study management documents at a country level or initiates development of\nthese documents for a single country trial, as per SOPs\n4. Leads and coordinates local trial team activities in compliance with SOPs, other procedural documents\nand applicable regulations. Leads local project planning activities to meet recruitment targets and to\ndeliver high quality data on time and within study budget. Including but not limited to: development of\nlocal trial specific procedures and tools, recruitment planning, contingency and risk management, and\nbudget forecasting.\n5. Ensures that all Adverse Events (AE) /Serious Adverse Events (SAEs)/Product Quality Complaints (PQCs)\nare reported within the required reporting timelines and documented as appropriate.\n6. Maintains and updates trial management systems. Uses study tools and management reports available\nto analyse trial progress\n7. Monitors country progress and initiates corrective and preventive actions (CAPA) when the trial deviates\nfrom plans and communicates study progress and issues to study management teams.\n8. May submit requests for vendor services and may support vendor selection.\n9. In certain situations, may assist in negotiation of trial site contracts and budgets. Forecasts and manages\ncountry/local trial budget to ensure accurate finance reporting and trial delivered –within budget.\nAdheres to finance reporting deliverables and timelines.\n10. Attends/participates in Investigator Meetings as needed. May schedule and conduct a local/country\ninvestigator meeting\n11. Conducts local trial team meetings and provides or facilitates SM training when needed (i.e.\nimplementation of study amendment-and changes in study related processes).\n12. Reviews and approves Monitoring Visit Reports submitted by SM; identifies issues and/or trends across a\ntrial project and escalates deviation issues to the CTM/GTL and FM as needed\n13. Reviews and approves site and local vendor invoices as required. Manages local study supply, as required.\n14. Prepares country specific informed consent in accordance with procedural document/templates.\nReviews and manages site specific informed consent forms in accordance with SOPs, other procedural\ndocuments and applicable regulations.\n15. Organizes and ensures IEC/HA approvals, if applicable, and ensure that the trial is in compliance with\nlocal regulatory requirements.\n16. Works with SM to ensure CAPA is implemented for audits and inspection or any quality related visits\n17. Complies with relevant training requirements.\n18. Acts as subject matter expert for assigned protocols. Develops strong therapeutic knowledge to support\nroles and responsibilities. May represent GCO on cross functional teams.\n19. Acts as primary local/country contact for a trial. Establishes and maintains excellent working relationships\nwith external stakeholders, in particular investigators, study trial coordinators and other site staff; and\ninternal stakeholders, including Medical Affairs and Marketing for Medical Affairs trials.\n20. Actively leads or contributes to process improvement, training and mentoring of CTAs, SM and other\nLTMs.\n21. Conducts accompanied site visits with SM as delegated by FM.\n22. Assumes additional responsibilities or special initiatives such as “Champion” or “Subject Matter\nExpert”.\n23. Represents functional area in process initiatives as required\nThis is not an exhaustive, comprehensive listing of job functions. May perform other duties as assigned.Principal Relationships:\nPrimary Reporting Structure: Reports to a Functional Manager\nPrimary interfaces: Functional Manager/CRM, CTAs, SMs, CTM/GTLs, Study Responsible Physicians (SRP),\nQuality & Compliance Managers/Specialists, Local Safety Officer\nOther Internal Interfaces: R&D Country Head, Regional Therapeutic Area Experts (RTAEs), Contracts &\nGrants, CTM/GTL, R&D study team (e.g., SRP), data management and Medical Affairs (when applicable)\nExternal Interfaces: Trial Site Personnel, external vendor representatives, Ethics Committee and others as\nrequiredJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}