{
    "Job ID": "69867920",
    "Description": "Job descriptionOur globally coordinated tax professionals offer connected services across all tax disciplines to help our clients thrive in an era of rapid change. We combine our exceptional knowledge and experience with the people and technology platforms that make us an ideal partner for all their tax-related needs. In Tax, we equip clients to make better business decisions by bringing insights to the forefront. We help companies understand the tax policies and tax laws of governments around the world to plan and comply accordingly.Our teams leverage transformative technologies to deliver strategy and execution, from tax and regulatory obligations to operations and workforce management, to reduce risk and drive sustainable value. Tax has six sub-service lines which cover a wide range of issues: Business Tax Services, Global Compliance and Reporting, Global Law, Indirect Tax, International Tax and Transaction Services and People Advisory Services.The opportunityThis is an excellent opportunity for an experienced Tax professional to join a growing team in an emerging market. As an International Tax Manager, your primary focus will be advising global companies on the various regional and international tax implications of their operations. With so many offerings, you have the opportunity to develop your career through a broad scope of engagements, mentoring and formal learning. Our Tax service line in MENA is experiencing a period of significant growth so now is an excellent time to join. Sound interesting?Your key responsibilitiesYou will be managing and participating in the successful delivery of international tax engagements and assisting senior managers or above with identifying and pursuing new business opportunities and building client networks and relationships. You will contribute to building and maintaining key client relationships by delivering exceptional client service and collaborate with a team of International Tax professionals across the MENA region and globally to combine diverse cross-border experience with local tax knowledge across a broad spectrum of industries.You will work as part of a multi-jurisdictional / disciplinary team within tax and across other service lines (including working with colleagues from Transfer Pricing, Transaction Tax, Indirect Tax, People Advisory Services etc.) in terms of pursuing, managing and delivering engagements and assist in managing engagement economics by organizing staffing, tracking fees and communicating issues to project leaders.You will build strong internal relationships within international tax team and across other service lines and counsel and develop more junior staff through delegation and on the job trainingSkills and attributes for successIf you are a client driven and strategically and commercially aware, excellent communicator in a range of situations both written and oral, enthusiastic with flexible attitude to work and a strong motivator, you will be perfect for the role.To qualify for the role you must haveBachelor's Degree in Tax, Economics, Accounting or Finance and an approved professional qualification or equivalent (e.g. ADIT / ATT / ACCA / CPA / ACA / CA / LLB or MBA, or MA, MSc or PhD in the fields listed above)\n5 – 7 years of relevant Tax experience, in either business or industry\nBroad exposure to international taxation with focus on inbound and outbound investments\nStrong managerial, organisational, project management, analytical and verbal/written communication skills\nProven track record with a leading professional services firm\nExperience of Managing a team and/or mentoring and developing more junior team membersIdeally, you’ll also haveProficiency in Arabic languageWhat we look forYou’ll proactively maintain your technical knowledge by keeping abreast of global developments in international tax landscape so that you can better advise our clients. In return we’ll provide investment in the right sort of training and offer you the opportunities on projects and assignments that will develop and challenge you so that you’re in the best place to develop your tax career.The types of project you’ll contribute towards may include:Expansion into new markets\nGroup structure reorganization and / or rationalisation\nReview of operating model including permanent establishment risk, withholding taxes, transfer pricing etc.\nReview of holding structure, capital structure and financing arrangements\nReview of IP structure\nBEPS risk assessmentsWhatever the projects and assignments you work on you can be confident that you’re contributing towards helping our clients to develop and execute their international tax strategy ensuring technical excellence and providing the highest levels of client service.What we look forHighly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you’ll be a confident team player that collaborates with people from various teams while looking to develop your career in a dynamic organization.What we offerWe offer a competitive compensation package where you’ll be rewarded based on performance and recognized for the value you bring to our business. Plus, we offer:Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.\nSuccess as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\nTransformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.\nDiverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.If you can demonstrate that you meet the criteria above, please contact us as soon as possible.The exceptional EY experience. It’s yours to build.EY | Building a better working worldEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.For further information, and to apply, please visit our website via the “Apply” button below.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}