{
    "Job ID": "69866271",
    "Description": "(oPurposeTo support the Group’s M&A transactions, Finance needs to implement changes to its systems and processes.  The 'Manager, Finance Projects M&A' will lead work for Finance scope for a particular deal (acquisition or divestment). They will work with Finance and Technology teams to assess the impact of the deal and deliver the changes needed, and with Operations teams to identify and handle any dependencies (e.g. Billing-to-Cash and Procure-to-Pay processes).The role will also cover other work on Finance projects as needed, using Finance process knowledge to provide subject matter expertise on changes.This role will report into the Senior Manager, Finance Projects M&A.Key Responsibilities and AccountabilitiesAct as the single point of contact for Finance for an acquisition / divestment\nConnect with both the M&A programme team and Finance partners\nChair meetings to align on status, project risks / issues, and set clear expectations of upcoming work and timelines\nCommunicate clearly and with precision, ensuring that key points can be easily understood\nAgree scope, plan and milestones for Finance process scope\nHandle inter-dependencies with other processes (e.g. billing to cash and procure to pay), to both ensure no scope creep into Finance and interlock for end-to-end testing\nProduce all typical project documentation - e.g. detailed project plans, resource plans and status reports\nDocument business requirements to enable both technology to design and implement system changes, and business teams to understand impact to processes and resource needed to support ongoing work\nIdentify, assess and mitigate risks to the success of the project, particularly where there is an impact to deal timelines\nUse experience to anticipate customer needs and solve problems\nUse Finance SME knowledge to support Finance projects, including review of new demand, benefit cases and business outcomes, capturing requirements, reviewing proposed solutions, and performing business analysisQualifications and ExperienceDegree (or equivalent) and relevant professional qualification\nExtensive knowledge and skills gained through experience in Finance integrations\nDeep knowledge of a Finance function and complex financial systems infrastructuresSkills and CompetenciesNote:  Level 1 (awareness), level 2 (skilled), level 3 (advanced), level 4 (expert)Accounting principles: Applies knowledge of accounting practices and procedures to complete accounting assignments (Level 2)\nAttention to detail: Demonstrates a concern for accuracy and thoroughness so that sufficiently detailed information is logged accurately (Level 2)\nCommunication: Communicates with clarity and precision, presenting complex information in a concise format that is audience appropriate (Level 3)\nData analysis: Collects, analyses and interprets data to reach conclusions and/or present insights and findings (Level 3)\nKnowledge of financial systems: Understands how to use and operate within the organization's financial systems and related technologies. (Level 3)\nProblem solving: Defines a problem, generates solutions, and evaluates and identifies the best solution to overcome the problem (Level 2)\nProcess improvement: Seeks new ways of working continuously to make processes run smoother and faster (Level 2)\nProject planning and delivery: Demonstrates a structured approach to the discipline of planning, organising and handling resources and activities to achieve specified outcomes \nwithin a clearly defined timeframe and standards. (Level 2)\nRelationship building: Interacts well with others, quickly establishing rapport building positive relationships and networks (Level 2)\nStakeholder management: Builds positive relationships with internal and external partners including understanding their drivers (Level 3)At LSEG, we believe that creating a diverse and inclusive organisation is fundamental to the way we deliver on our promise of creating essential partnerships and open opportunities. Our open culture is central to how we deliver our purpose – driving financial stability, empowering economies and enabling customers to create sustainable growth – in everything we do.Working with us means that you will be part of a dynamic organisation of 25,000 people across 70 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.LSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.We are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.Please take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.If you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}