{"Job ID": "69867445", "Description": "Team Leader- personal Banking-(2300017362)Job:Retail BankingPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 9:53:26 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleIn charge of day to day management of team and accountable for their results.\nSet targets, review results, deal with individual performance and manage delivery of KPIs.\nEnsure that team meets required Targets.\nManage, motivate and train team to ensure that performance is optimized.\nEnsure that team is not providing any incorrect information or mis-selling to customers.\nRegular review with the team on the performance.\nAssist in job performance evaluations.\nAssist teams in improving Productivity.\nHandle escalation.\nIdentify and report training needs.\nScheduling, if applicable.\nIdentify pain areas. Process improvement to be initiated.\nFind solutions / ensure outcomes / result orientation.\nMonthly review and reporting on KRI / KPIs.\nTo reduce the attrition rates and maintain it within the limits prescribed by the organization.\nEnsure self and team compliance with all applicable rules / regulations and group policies.StrategyAwareness and understanding of the Group’s business strategy and model appropriate to the role.BusinessAwareness and understanding of the client care centre inbound role and the impact of  economic and market environment in which the Group operates.ProcessesResponsible for executing and supervising the Service Levels, identifying the business opportunities, challenges, constraints which needs to get highlighted and bring in controls.People and TalentLead through example and build the appropriate culture and values. Set appropriate tone and expectations from their team and work in collaboration with risk and control partners.Risk ManagementThe ability to interpret the Call drivers, identify key issues based on this information and put in place appropriate controls and measures.GovernanceResponsible for assessing the effectiveness and deliver effective governance, oversight, if necessary, oversee changes in these areas.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the Client care Centre operations to achieve the outcomes set out in the Bank’s Conduct Principles: Fair Outcomes for Clients; The Right Environment.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Key StakeholdersClient experience teamsOur Ideal CandidateGraduate.\nBasic computer skills.\nMinimum 1 - 5 years of experience in service / Sales / Collection (as per the job role).\nShould have thorough product / process knowledge.Role Specific Technical CompetenciesFlexible to stretch and work across different calendar days and time zones in a week / month\nUncompromising approach to customer service and problem resolution\nStrong communication skills including good grammar and articulation\nLeadership, Analytical and Interpersonal skills\nPositive, polite, cheerful and courteous\nEnthusiastic, empathetic, yet firm when needed\nPatient, Non-Confrontational, Resilient\nAbility to work under pressure and multitask\nManage conflicts and solve problems\nGood listening skills­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we doJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}