{"Job ID": "69869510", "Description": "Position at ISP IndiaIndia Tax ManagerAbout ISPThe International Schools Partnership (ISP) is a growing group of committed colleagues, in ﬁnancially responsible schools around the world, all of which aim to be the school of choice in their local area. Learning is at the heart of everything we do for our students, colleagues, and parents. We are committed to getting better, all the time. Located in Hyderabad India, reporting to the Regional Finance Director India and with a dotted line to the Global Head of Tax in London, the India Tax Manager will be accountable for managing the tax function (Direct/Indirect/Transfer Pricing) and providing taxation services across our schools and businesses within India.Reports toRegional Finance Director India and a dotted line to the Global Head of TaxISP PrinciplesBegin with our children and students. Our children and students are at the heart of what we do. Simply, their success is our success. Wellbeing and safety are both essential for learners and learning. Therefore, we are consistent in identifying potential safeguarding issues and acting and following up on all concerns appropriately.Treat everyone with care and respect. We look after one another, embrace similarities and differences and promote the well-being of self and others.Operate effectively. We focus relentlessly on the things that are most important and will make the most difference. We apply school policies and procedures and embody the shared ideas of our community.Learn continuously. Getting better is what drives us. We positively engage with personal and professional development and school improvement.Key ResponsibilitiesTax Strategies:Technically sound and experienced in framing tax strategies for the organization having multiple legal entities that bring tax efficiencies and protect from tax litigations.\nTake lead on the tax integration for the new acquisitions.\nAble to provide expert opinion from a tax perspective on current or new projects.\nReview the current recharge process across the India and Divisional entities, identify the gaps and take corrective actions. Tax Compliances:Hands-on experience in managing regular compliances related to Direct/Indirect Tax, should coordinate with school finance managers to collect reports, review and timely filings. Ensure monthly tax payments are done before due dates, quarterly / annual returns are filed before due dates.\nEnsure that all school entities and regional entities are doing correct tax accounting as required by applicable law.\nManage transfer pricing documentation in collaboration with external advisors and annual filing as required for transfer pricing.\nManage tax audits, ensure annual tax returns are being reviewed and required information is provided to tax consultants.\nSupport with the annual corporate income tax reporting under IFRS including calculation of current and deferred tax positions.\nReview GST returns prepared by the School Finance team and supporting documentation and ensure timely filing is done.\nBuild and maintain a tax risk register, prioritize tax risk mitigation projects.Other:Experienced in coordinating and managing external tax (direct/indirect) consulting relationships.\nIdentify the compliances that need to be done in-house and make a smooth process of review and monitoring.\nMonitor other applicable compliances to the organizations that are being done by external consultants.Qualificaions and ExperienceExcellent interpersonal skills including ability to effectively interact at all levels and collaborate with cross-functional colleagues to establish trust, respect, and confidence.\nA self-starter who can work by themselves or as part of a team.\nExpand strategic partnerships with the stakeholders\nHigh levels of personal integrity.\nConscientious and able to focus on completing work to a consistently high standard.\nFlexible and positive approach to work.\nExcellent organizational and time-management skills; high attention to detail.\nAble to identify issues and raise them in an appropriately timeframe.\nWork collaboratively with the local finance team and well as the Group Tax Team.\n8+ years’ experience in service industry with CA certification.\nExperience of working in a multi-national organization and dealing with international tax matters would be an advantage.ISP Commitment to Safeguarding PrinciplesISP is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment. All post holders are subject to appropriate vetting procedures and satisfactory Criminal Background Checks or equivalent covering the previous 10 years’ employment historyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}