{
    "Job ID": "69866110",
    "Description": "Who we are:&nbsp;Motive builds technology to improve the safety, productivity, and profitability of businesses that power the physical economy. Motive combines IoT hardware with AI-powered applications to connect and automate physical operations. Motive is one of the fastest-growing software companies in the world, serving more than 120,000 businesses, across a wide range of industries including trucking and logistics, construction, oil and gas, food and beverage, field service, agriculture, passenger transit, and delivery.Motive is built on four foundational attributes; Own It, Less but Better, Build Trust, and Unlock Potential. This has taken our company to great heights, including being recognized by Fortune for Best Workplaces, Forbes Best Startup Employers, and Comparably for our Best Global Culture, Sales Team, Leadership Team, Career Growth, and CEO for Diversity. We’re proud to receive an employee net promoter score of 63 (according to Comparably) which places Motive in the top 5% of companies with 4,000 employees or more.&nbsp;Today, our team is made up of more than 3,000 employees, located across the world, providing support to a wide range of customers. While most of our employees are remote, many have the opportunity to work on-site at any of our 8 global office locations. Visit our careers website to learn more about opportunities at Motive.&nbsp;About the Role:&nbsp;As a Site Reliability Engineer (SRE) on the Platform team, your role will be crucial in helping us design, scale, and manage our growing Kubernetes / AWS-backed infrastructure. Your expertise will contribute to scaling our architecture and building a highly available system with an enthusiastic team. We are looking for candidates who have production experience with AWS-based platforms, expertise in automating distributed systems, scaling a fast-growing platform, maintaining high availability, and a forward-thinking mindset ready to take on tomorrow's challenges.What You’ll Do:&nbsp;Automate the provisioning, scaling, and management of our infrastructure using Configuration As Code and Configuration Management\nWork with other engineering and product teams to design and build the infrastructure required to deliver new features to customers\nIdentify and remove bottlenecks from systems in production\nEnsure 99.99% customer-facing uptime\nContinuously improve the monitoring and alerting capabilities of our platform, enabling us to be proactive instead of reactiveWhat We’re Looking For:&nbsp;3+ years of professional SRE/DevOps experience, and a demonstrated ability working on high volume production systems\nHands on experience on Kubernetes based environments\nWorking knowledge of AWS services and technologies (Redshift, DynamoDB, Kinesis, RDS, ELB, AutoScaling, Lambda, etc)\nExperience with infrastructure as code and configuration management (Terraform, Nix, Ansible, CloudFormation, Chef, etc...)\nKnowledge of Python, Ruby, or Go, and an understanding of relational and NoSQL databases (PostgreSQL a plus)Creating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives.&nbsp;Please review our Candidate Privacy Notice&nbsp;here.The applicant must be authorized to receive and access those commodities and technologies controlled under U.S. Export Administration Regulations. It is Motive's policy to require that employees be authorized to receive access to Motive products and technology.&nbsp;#LI-RemoteJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}