{"Job ID": "69867201", "Description": "We are Asia’s fastest-growing skill-based gaming company and partner brand of Flutter which is a multi-billion dollar global gaming organisation. We are focused on providing our customers with the most innovative and exciting gaming experience possible. Our success has been driven by our commitment to excellence, our passion for gaming, and our ability to continuously innovate. We are driven by our strong value system, which encompasses an obsession with data, a hustler’s attitude, an owner's mindset, leading with love, and embracing change.As our Associate Director- Employee Experience (Reward) you will play a strategic leadership role responsible for creating and enhancing a positive and productive work environment for employees while also driving the learning and development initiatives across the organisation.Must Haves:Workday experiencePayroll, Audit Compliance exposureAppraisals/Bonus/RewardsKey Responsibilities:Employee Experience Enhancement: Develop and implement strategies to enhance overall employee experience, engagement, and satisfaction. Collaborate with cross-functional teams to identify areas for improvement and implement initiatives to address employee feedback and concerns. Champion diversity, equity, and inclusion efforts to ensure a supportive and inclusive workplace for all employees.Learning and Development Strategy: Design, implement, and oversee a comprehensive learning and development strategy aligned with the organisation's objectives. Identify skill gaps and development needs across different levels and departments and design relevant training programs. Leverage a mix of learning methods, including workshops, e-learning, coaching, and mentoring, to ensure a well-rounded development approach.Talent Development: Partner with HR and department heads to identify high-potential employees and create tailored development plans for their growth within the organisation. Provide guidance on career paths, job rotations, and advancement opportunities to help employees achieve their professional goals.Leadership Development: Create and deliver leadership development programs for managers and leaders at all levels, focusing on leadership skills, effective communication, and team management. Provide coaching and mentorship to emerging leaders, guiding them in their career progression.Performance Management: Collaborate with HR to enhance the performance management process, ensuring that it aligns with the learning and development initiatives. Develop tools and resources to help managers provide regular feedback and coaching to their team members.Learning Technology and Tools: Evaluate and implement learning technologies and platforms to support a seamless and efficient learning experience for employees. Stay updated on industry trends and best practices in learning technology to continuously enhance the organisation's learning ecosystem.Measurement and Reporting: Establish metrics and key performance indicators to measure the effectiveness of learning and development programs. Generate regular reports on the impact of learning initiatives, making data-driven recommendations for improvements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}