{
    "Job ID": "69866749",
    "Description": "Main responsibilitiesOverall ResponsibilitiesResponsible for Transversal activities that support Regulatory Africa Zone Organization.\nPoint of contact for GRA performance, quality, operations, and transversal activities to assure Africa Zones are well trained and equipped to perform their activities and deliver commitments to Business Units and external stakeholders.\nMain interface with the RA team of the distributor between the distributor and Global GHU team\nResponsible to interact with the distributor to collect any new regulatory publications, requirements and ensure data base update.\nResponsible to monitor with the distributor the timely submission and approval of the dossiers. \nResponsible for transversal activities that support Regulatory GHU Zone Organization.\nResponsible to interact with all the appropriate stakeholders to ensure compliance of the GHU products and timely update of the Sanofi data base according to regulatory requirements and Sanofi policies.Regulatory Transversal Project Lead AFRICA Zone will be responsible:Ensure adherence to applicable procedures and policies in relevant Regulatory Affairs Function in Africa check of local legislation and regulatory base, internal departments SOPs in cooperation with RA Head.\nPlan and control country Regulatory Affairs functions SOPs: monitor, keep all the internal base up-dated; ensure all RA SOPs are followed by the RA team, implementation of New SOPs.\nVeeva super Users: support Africa team to be data ready, developing job aid and training.\nPlai GRA super users\nPart of international transversal network\nManage activities such as shortages, DHPC, B/R reevaluation, etc across Africa.\nSurvey coordination across Africa to ensure answer timely manner.\nTrain/coach Regulatory Associates regarding all performance activities: KPI, audit preparation, Renewal plan, discontinuation, veeva QC, monitor the planned approval date etc…\nCoordination of the dormant license within Africa /Follow up POP execution and RAP execution with supply chainResponsibilities include:Responsible for monitoring quality topics at country level (trainings, local QDs, CAPAs, JD)\nSupports Africa Zone Head in preparing and reviewing KPI and management reportsABOUT YOUQualifications/Education & work experienceEducation: Physician, Pharmacist, Chemist, Biologist or Business School\nRelated Experience: Minimum of 5 years experiences in Regulatory Affairs\nProject management experience in the pharmaceutical industry or in a regulatory environment. Recognized expert in managing matrix teams.\nExcel expert\nStrong Digital mindsetAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}