{
    "Job ID": "69865858",
    "Description": "Overview PepsiCo operates in an environment undergoing immense and rapid change. Big-data and digital technologies are driving business transformation that is unlocking new capabilities and business innovations in areas like eCommerce, mobile experiences and IoT. The key to winning in these areas is being able to leverage enterprise data foundations built on PepsiCo’s global business scale to enable business insights, advanced analytics, and new product development. PepsiCo’s Data Management and Operations team is tasked with the responsibility of developing quality data collection processes, maintaining the integrity of our data foundations, and enabling business leaders and data scientists across the company to have rapid access to the data they need for decision-making and innovation. Responsibilities Level 1 contact for SKU/KU/EU from business and GBS for any queries related to MDM requests. Data approver (first and final approval) for all master data requests through all MDM tools (SAP WF, SN, MDG and other tools) to make sure the information is accurate and aligned with all controls and compliance procedures for below processes: Master data maintenance creation/modification/blocking/archiving for: OTC Provide 1st line support on data quality issues. Execution of Master Data Quality reports and involving business stakeholders on error correction Data extraction & maintain regular MDM reports through common tools (SharePoint, Teams or other) Conduct regular MDM training programs for end users and GBS teams. Drive resolution of issues with data standards or conflicting requirements, working closely with business stakeholders, DMO Customer Champion & DMO Customer Lead Support business users on troubleshooting data errors and/or clean up data based on data quality reports. Communicate status of open workflow requests to stakeholders & DMO leads and note follow-ups or issues encountered. Basic knowledge of formal data governance practices and ability to conduct root cause analysis and see connections between data and processes. Ensure Global and local DQ requirements for the Customer domain are being followed in the WF and other type of requests. Build relationship with sectors thru SLAs, governance, and escalation. Identify opportunities for future efficiency/standardization. Qualifications Bachelor’s degree or equivalent international qualification 0-1 year of experience in Master data management or related experience, especially in Customer master data System implementation, testing & baseline support experience (as a plus) Experience in service center (preferred) Experience in Fast Moving Consumer Goods Companies (preferred) Detail oriented, thorough with documentation/communication Working knowledge of Business Processes in Customer Master Data Domain Strong technical experience in SAP ECC, SAP S/4 or other legacy system and across master data domains, especially in Customer master data Strong experience in MDM workflow tools (SAP MDG or other) Proficiency in basic Microsoft applications (Excel, Word, PowerPoint, Visio, Outlook and other) Good oral and written communication skills Strong english communication skills, both verbal and written Experience with mass update tools (eg: Winshuttle, LSMW, other) as a plusJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}