{
    "Job ID": "69866970",
    "Description": "Job Brief:We are seeking a highly skilled and experienced Corporate Lawyer to join our dynamic team at Agility KSA. As a Corporate Lawyer, you will play a pivotal role in providing legal guidance and support across our operations in the MEA region. Your expertise in corporate law, coupled with your bilingual proficiency in Arabic and English, will be essential in ensuring compliance with local laws, regulations, and corporate governance requirements.Your Responsibilities:Legal Advise:Provide legal advice and support to the company in various corporate matters, ensuring compliance with local laws, regulations, and corporate governance requirements.\nDraft, review, and negotiate a wide range of legal agreements, including but not limited to contracts and joint ventures.\nConduct legal research and analysis on complex legal issues, providing accurate and timely advice to internal stakeholders\nManage and oversee legal documentation, ensuring proper record-keeping and documentation of corporate transactions.\nCollaborate with cross-functional teams, including finance, HR, and operations, to provide legal support and guidance on various business initiatives.\nAssist with guiding the business on legal matters and address queries on transactions including on jurisdiction clauses, indemnity clauses and wider concerns regards to potential disputes\nDeal with complex matters with multiple stakeholders and be the legal voice for the organization to highlight business risks and recommend alternate options to mitigate themRepresentation:Communicate and negotiate with external parties (regulators, external counsel, public authority, etc.), creating relations of trust\nwork closely with the company’s in-house litigation team and with external legal counsels\nDeal with regulatory enquiriesGovernance:Stay up-to-date with changes in laws and regulations that may impact the company's operations, and proactively advise management on potential legal risks and implications\nResearch and evaluate different risk factors regarding business decisions and operations\nMaintain and continuously upgrade internal governance policies and regularly monitor compliance\nApply effective risk management techniques and offer proactive advise on possible legal issues\nDraft and review agreements, contracts and other legal documents\nAssist the business on handling client complaints / disputes to avoid litigationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}