{"Job ID": "69867511", "Description": "Associate Manager-(2300017360)Job:Governance, Risk Management & CompliancePrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 11:46:07 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleThe primary responsibility of this role is delivery of CCIB credit risk reporting and MI, working directly with and supporting the CCIB credit risk team. The risk reports are used by risk managers, committees and senior management, and regulators.The role will suit candidates with wholesale credit experience, an ability to interact with a vast array of stakeholders effectively and excellent communication skills (written and verbal), including report writing.The role suits someone who is detail oriented, with curiosity for insights and confidence to challenge. The role holder will be able to develop a broad view of the risks and issues and develop vital soft skills, while seeking opportunities for adoption of best practice, innovation and individual growth.StrategyTo understand reporting requirements from Credit Risk Officers and translate them into effective and efficient risk reports.\nTo improve efficiency in BAU activities, through automation or collaboration with other risk reporting teams and across borders.\nSupport projects and initiatives by building compelling use cases and requirements for change.BusinessTo deliver quality reports in a timely manner with analytical insights for both internal and external stakeholders.\nBuild stronger relationship with all stakeholders.\nProvide subject matter expertise and address ad-hoc reporting requirements.\nContinuously work towards improving risk data quality with infrastructure and other risk teams.\nWork with project, change, technology, credit risk and monitoring teams on changes impacting our reporting and credit risk systems framework. User testing for project releases / migration projects / BAU enhancements. Establishing material impact of the systemic issues, following through on closure.ProcessesSupport or drive opportunities to improve efficiency.\nHelp to ensure that regulatory requirements, Group and Business policies are effectively embedded.\nHelp to standardise, simplify, consolidate related processes; retire obsolete, legacy streams and perform horizon scanning on upcoming trends to integrate with ways of working. Risk ManagementTo continuously work towards improving the control environment in credit risk reporting.\nEnsure completeness, accuracy and timeliness in all Regulatory Reporting.\nEscalate or engage appropriate stakeholders to ensure timely remedial actions and escalation of situations that pose significant risk.GovernanceUnderstand the credit risk policy and standards, risk reporting and data quality management standards, and application of the operational risk policy and standards across team activities.\nEnsure the end to end reporting process has no loopholes. Identify gaps and find ways to address.\nParticipate in internal and external audits, as directed.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key StakeholdersInternalGroup Risk Framework Owners\nGroup Risk Teams\nCountry Risk Teams\nEnterprise Risk Management\nRisk Infrastructure and Change Management\nTechnology\nData Governance\nGroup Internal AuditExternalBank of England and Prudential Regulation Authority\nOther regulators, as directed\nExternal Auditors\nRatings agenciesOther ResponsibilitiesEmbed Here for good and Group’s brand and values in the Risk Reporting and MI team; Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures.Our Ideal CandidateSignature Strength - Strong CCIB product knowledge and understanding of risk management with familiarity of PRA issued regulations. CFA or FRM desirable.\nAnalytical mindset - Able to detect outliers by observing movements and trends in data. Be able to investigate issues and identify the drivers.\nHands-on Tooling - Programming skills in Python, VBA, API, Microsoft (Access, Powerpoint), Visualisation Tools (Tableau, PowerBI), Workflow Automation Tools (RPA, Sharepoint Designer), Devops (JIRA, Git, Genkins, CICD), knowledge of AI / ML will be an added advantage.Soft SkillsWorks well individually as well as part of a team, especially across borders.\nAble to meet tight deadlines with minimal direction.\nInquisitive, with attention to detail. Proactive attitude towards work.\nDemonstrates understanding of and commitment to the Group’s core values.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}