{
    "Job ID": "69866508",
    "Description": "Responsibilities:Schedules working hours of all Kitchen staff with the approval of Sous Chef taking into consideration the volume of expected business. Arranges extra staff during a high volume of business if warranted by an unexpected business or dismiss them earlier if the business is slow.\nTrains regularly cook and make sure that they fulfill their given tasks at all times.\nAccepts flexible working hours according to business demand.\nAttends meetings and training required by the Executive Chef.\nAssigns in detail, specific duties to Unit Chef or subordinates and instructs them in their work. \nCarries out full stock-taking at the end of each month in collaboration with the Cost Control Department.\nInsists on personal cleanliness and proper discipline of all employees under his direct supervision.\nTo be responsible for the quality of all food prepared in Lebanese Restaurant. Checks constantly all dishes for their taste, temperature, and visual appearance. Makes sure that all dishes are uniform and that established portion sizes are adhered to.\nReports to Executive Chef all staff matters, recommends promotions, transfers, and all staff-related points together with the Sous Chef.\nChecks with maintenance that all kitchen equipment is functioning properly. Makes an attempt to prevent damage or loss of equipment.  (Instruct staff on how to use kitchen equipment properly).\nPrevents the use of spoiled or contaminated products in any place of food preparation and prevents employees who are ill or suffering from an infection from taking part in the preparation or handling of food. \nTo be aware of all hotel policies & procedures.\nMaintains a friendly and pleasant attitude at all times toward his co-workers. Always wears a clean and tidy uniform, name badge, and safety shoes.\nTo be familiar with the emergency procedure of the hotel.\nTo be responsible for the daily order of food products and all internal kitchen transfers.\nManages time effectively by meeting deadlines on time.\nIdentifies and solves problems in a professional manner.\nCompletes the daily log book after duty and mentions all relevant information about the operation including complaints.\nAdministers personnel action on leaves & overtime requests, disciplinary actions, and commendations.Skills & Qualifications:Minimum 3 years experience as Chef De Partie or current role as Junior Sous Chef in a high-end Lebanese Restaurant or within a luxury hotel environment\nPostgraduate and/or Hotel Management School / Apprenticeship\nMust have full knowledge of sanitation requirements in food handling\nA high level of creativity and quality standards.\nStrong leadership qualities, training techniques, proper communication, and organizational skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}