{"Job ID": "69866848", "Description": "With over 70 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith.\nCome join our 33,000+ staff working in nearly 100 countries and share the joy of transforming vulnerable children’s life stories!Employee Contract Type:Job Description:Job PurposeThe purpose of the position is to provide overall coordination to the project and to ensure project deliverables are met and that interventions are implemented based on World Vision’s standards and donor requirements.Major Responsibilities50%Plan and coordinate the project’s field activitiesEnsure that all aspects of the project’s daily management are met, including logistics, administration, security, visibility, community and beneficiary’s liaison, evidence generation, coordination and risk management.\nDevelop and guide the project team on the usage of project management tools (including but not limited to reports, DIP, Logframe, ITT, SOPs, financial tracking, programmatic process flows)\nHandle project’s procurement needs according to the developed procurement plan.\nEnsure that project activities are implemented in good quality based on the project/s outcomes and taking into consideration the local context\nFollow-up and coordinate with the MEAL and technical teams to ensure that all needed tools are in place, developed and analyzed according to the project needs\nReview project level analysis and highlight trends to area manager. Implement the recommended operational measures to address gaps and challenges.\nContribute in the development of ToRs for external consultants if needed\nResponsible of the production of high quality narrative reports in a timely manner and based on the agreed template and processes.\nEnsure the quality of implementation in reference to the donor’s guidelines, national SOPs, best practices while also generating evidence to show contribution to WVL national strategic objectives.\nEnsure that lessons learned, risks and innovation are well documented and shared with the program team\nSupport the identification and escalation of advocacy   issues to Area Manager.\nParticipate in periodic evaluations of the impact of the project on the beneficiaries with support from the MEAL unit.\nConduct feasibility Study for Anticipatory Action in Akkar\nFacilitate community engagement and validation workshops\nConduct stakeholder mapping analysis (on the different NGOs operating in the sector and areas, in order to understand the functions various stakeholders fulfil, power dynamics, and to identify potential local partners ).\nIn coordination with the Area manager, manage the simulation activity\nClosely Supervise the interventions on site\nContribute in developing the Anticipatory Action Protocol25%Build relationships & capacities of the hosting and beneficiary communityEstablish and maintain contact and productive working relationships with community representatives, local partner and international organizations, at the field level.\nConduct meetings with key stakeholders to engage them in the project interventions and agree on their contributions in order to ensure sustainability.\nEnsure partners’ capacity assessment is conducted and capacity building plans are in place and implemented.\nSupport the Area Manager in engaging and pre-positioning WV with NGOs and local partners to scale up the Disaster Risk Reduction sector portfolio in the area.\nActively attend and participate in sector working groups\nIn collaboration with the DRR (Disaster Risk Reduction) focal point contribute to technical evaluation of activities and take initiative to propose adjustment of activities depending on needs and circumstances.20%Handle output level reporting, safeguarding and accountability incidents reportingEnsure that output level reporting is done as per the established guidelines\nComplete the required information in Activity info as per the set deadlines\nFill project targets as per the set guidelines\nEnsure timely reporting for information disseminated to communities/partners/donors and Support Offices.\nEnsure compliance with donor and World Vision’s policies and technical tools set in place\nDevelop project-specific material such as Q and A’s\nConduct activities that enable partners to be properly informed about WVL, its Complaint mechanism, the project activities and WVL Safeguarding policy and other policies\nEnsure beneficiary feedback is addressed in a timely manner and refer the complaints raised to the Accountability unit as per the set guidelines.\nFill the Referral Tracking sheet on a monthly basis and send it to the relevant focal person\nReport any child and adult safeguarding incident as per the established guidelines and ensure that safeguarding incidents are being reported by project staff as required\nReport on the Indicator Tracking Table (ITT) ensure that MoVs are validated\nReport on the activities in a timely and quality manner that would help submission of accurate reports internally and externally.5%Perform other duties as requiredAttend and participate in WVL’s spiritual nurture and other organizational events\nResponsible of own security and actively contribute to a positive security culture\nReport CP incidents as per the safeguarding policy guidelines.\nAbide by the security policies and procedures and report any incidents or breaches to line manager and / or security manager\nPerform other duties as assigned by Line ManagerKnowledge/Qualifications for the roleRequired Professional ExperienceMore than 7 years of experience in community engagement projects\nStrong understanding of best practices and strategies in Disaster Risk Reduction\nProven experience in community mobilization in Sahel Akkar\nProven experience in facilitating Community engagement workshops\nProven experience in data gathering and analysis, and compiling inputs from the communities’ engagement   \nStrong understanding of project Cycle Management and tools \nExperience in implementing community engagement projects in coordination with local stakeholders\nExcellent Communication and interpersonal skills with ability to network and negotiate with local stakeholders and government bodies.\nExperience in conducting feasibility studies related to Disaster Risk management\nAbility to work in and contribute to dynamic team operating in a fragile environment\nStrong Written reporting skills\nVery Good understanding of the context in Sahel AkkarRequired Education, training, license, registration, and certificationUniversity degree in civil engineering\nGood computer literacy in Microsoft Office package (incl. Excel)\nHolder of a valid driver’s license, dated of a least one year\nExperience in Disaster Risk Reduction and disaster ManagementPreferred Knowledge and QualificationsStrong experience in facilitating workshops.\nHas strong knowledge of core principles of Children Rights, Participation, Do No Harm, as well as children in Emergencies minimum standards.Travel and/or Work Environment RequirementField and Office based\nPosition requires availability and willingness to work outside regular office hours occasionally.\nPosition requires willingness and ability to continue to function during a crisis situation, including during a World Vision response to a manmade or natural disaster.\nJob holder is required to be living in Akkar.Language RequirementsVery Good written and spoken English and Arabic languages.Applicant Types Accepted:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Lebanon", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}