{
    "Job ID": "69869673",
    "Description": "Who are Inchcape?At Inchcape, our vision is to have a connected world, in which our customers trade successfully and make better decisions in every port, everywhere. We use technology and our global network to help our partners connect to a smoother, smarter ocean.Inchcape combines its worldwide infrastructure with local expertise through our global network of over 250 proprietary offices, across 70 countries and a team of more than 3,000 committed professionals. Our diverse global customer base includes owners and charterers in the oil, cruise, container, and bulk commodity sectors as well as naval, government and intergovernmental organisations.We have an ambitious growth model and a career here is certainly going to be a rewarding one that will allow you to bring your skills & experience. We embrace change and are open to new thinking and pushing for positive change in our industry.Role & responsibilitiesEnsuring that the data provided by the clients is entered in the appropriate online systems as per defined KPIs with accuracy.\nLiaising with the clients, Master of vessel and Agents for any missing / additional information required to complete manifest submission formalities.\nInforming all relevant parties on completion of defined milestones.\nLiaise and attend to any queries from the Owners / Operators, Master, Customs and performing offices\nFlexible and willing to work in shifts in a 24/7 set up in order to cover and manage daily work volumes.\nKeeping operational files updated with required information.\nBring innovative ideas in developing the processes handled\nAlerting the Team Leader / Sr. Executive when any issue arises in filing of manifest in the online systems.\nPreparing reports as requiredPreferred candidate profileCustomer Focus\nDecision Making\nFlexibility\nTeamwork\nInitiative\nInterpersonal Skills\nThoroughness\nVerbal & Written Communication#LI-MB1Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}