{"Job ID": "69866100", "Description": "Principal Duties and Responsibilities:Review, Research, Modify, Perform Adjustments, Documentation & Verification of Consumer and Business Banking Account Information\nValidation of various regulatory documents submitted by the Customers\nPerform Monetary, Non-monetary and Regulatory ‘Maintenances’, ‘Reclamations’ and ‘Account Closing’ services\nSupports Retail products such as Checking, Savings, Safe Deposit Boxes, Loans, Mortgages, Cards and Certificate of Deposits\nReview and validate that all Guardianship accounts are opened accurately, the sworn document is completed and the appropriate holds are placed according to the court order.  Also add or release Guardianship holds on request from Bankers post review of documents\nClose accounts that have been restricted by other areas of the bank including Fraud, Kite, AML, Legal and Compliance, Deposit Review/Risk team, etc., transfers the funds and issues checks.\nProcess customer initiated account closure requests, transfers the funds and issues checks.\nValidate of various regulatory documents and keys corresponding information into the I-vault system for future legal references.\nProcess customers’ Privacy Opt Out notices for Do Not Share / Mail / Call / E-mail cautiously and ensure bank is in compliance with Fair Credit Reporting Act (FCRA) and Gramm-Leach-Bliley Act (GLBA).\nReturn monetary benefits to U.S government agency upon request in the event of the death of an account holder who received government benefits via ACH.\nSend letters, update the activities on the accounts and return unclaimed properties owned by Chase customers to state governments as per U.S unclaimed property programs in case could not reach the customer within timeline set. \nAuthenticate and sets the limit for ACH and ODL for both individual and business customers. Orders checks, ATM/Debit cards and reverse the funds & fees post extensive research.\nEstablishing and cancelling Overdraft Protection, Debit card coverage and Pre-authorized transfers. Performs ownership changes, statement/fee linking, customers’ CIP & KYC information update, place/release holds, pay code changes and stop payments.\nMonitors the customers’ withdrawals on savings accounts in line with Regulation D and send necessary notices and convert the product to checking post violations.\nPerforms changes on term and interest rate, partial/early withdrawal, waiving withdrawal penalties, and disbursing the funds on maturity.\nMeet all the Productivity ,Accuracy and SLA targets defined for the process\nRequires highest level of vigilance in processing customer requests to ensure the business is in compliance with various U.S regulations such as Telephone Consumer Protection Act (TCPA), Regulation E, Fair and Accurate Credit Transactions Act, Regulation CC and AML/KYC (Bank Secrecy Act).\nEnsure all exceptions, involving deviation from Standard Operating Procedures or inability to process the work within turnaround time is escalated to supervisor/Manager\nEnsure that all work assigned is processed as per Standard operating procedures and within the Timeframe Stipulated\nFollow all the Audit/Compliance policies applicable to process\nReports suspicious activities on the accounts proactively\nAct as first line of defense and ensure the business is line with various U.S retail banking regulations\nAvoid Financial Loss, Privacy Breach or adverse Customer or Regulatory Impact in the process\nEmerge as a Subject Matter Expert in multiple Retail Customer Fulfillment process\nComfortable working independently and within a team environment in a dynamic and challenging environment \nTraining, Coaching of peer team members\nPerform User Acceptance Test, Procedure/Process maps Reviews, Incident Management and monitor SLA/cutoff’s\nPerform approvals MIT’s / KES when asked by Lead\nPerform Quality Control to ensure Processing Accuracy.\nHandle Banker/LOB Escalation and EO Complaints\nKnowledge of 2 or more Retail Customer Fulfillment functions/process is MandatoryEssential Qualification, Skills & ExperienceGraduates, preferably in Commerce - Preferably having first class pass percentage \n1-3+ years of overall experience with a strong background in Retail Banking Operations\nExcellent verbal and written English communication skills\nKnowledge of risk and controls is required\nStrong critical thinking and analytical skills\nFlexible to work in various shifts (including Night) according to business requirementDemonstrated strengths in:Research and analysis\nCustomer Service/Support\nTime management, work organization, and follow up\nAttention to detail and a focus on work accuracyVerbal and written communication\nFlexibility to adapt to changing priorities and business needs, and able to work well in a fast-paced environment\nDemonstrated initiative and accountability\nProficiency in Microsoft Office Suite\nKnowledge of U.S Regulatory guidelines relevant for Retail/Consumer Banking\nAbility to collaborate, partner and work in a team environmentPerformance MetricsService Level results\nQuality Control measurements\nProductivity or Efficiency metrics\nOther specific performance requirements as determined by Operations ManagerJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}