{
    "Job ID": "69866540",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Job Title: Senior Software EngineerReporting To: ManagerWork Location: BangaloreRoles and responsibilitiesResponsible for designing and implementing the responsive and user-friendly interface of our web application;Collaborate with cross-functional teams, including UX/UI designers and back-end developers, to bring design concepts to life;Unit Testing of new features and developments;Propose ideas of improvements of the software and technologies we use;Review and consolidate the technical documentation;Help on the support for the software by solving users' issues;Embrace Agile practices;And generally, be able to switch task depending on the business needs.Experience and skillsMinimum 5 years of experience in software development: design, implement, test, integrate, deploy and monitor….Bachelor’s degree in computer science, or related field.Expertise in Angular, jQuery, Bootstrap, Material Design and C#, ASP.NET MVC and Web API technologies.Proficiency in HTML5, CSS3, and JavaScript and jQueryExperience with version control systems such as Git or TFS Azure.Familiarity with back-end development and RESTful APIs.Excellent communication and teamwork abilities. Fluent in English.Strong problem-solving skills and attention to detail.Experience with Agile SCRUM methodology and have an object-oriented mindset.Able to work in a co-located environment with diverse team.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}