{"Job ID": "69865898", "Description": "Location: Riyadh, Saudi ArabiaIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.We have been present in Saudi Arabia for 40 years and with over 600 employees to date, we are growing rapidly. Together we are delivering our signalling, control and train protection systems for the North –South Railway (NSR), the longest system of it’s kind in the world. Together we are key suppliers of In-flight entertainment and connectivity systems as well as air traffic management solutions in Saudi. We are making Saudi Arabia a safer place by securing the country’s critical infrastructure and e-security solutions that secure the country’s electronic payment systems. Thales has been selected to supply major electronic systems for air defence and the Group also supplied communication and optronic systems for the Army, the Saudi Arabia National Guards and the Air Force.Job ObjectiveIn order to further accelerate its growth in key development regions, Thales is looking for a regional Sales Director to manage its security activities covering all Middle-East (Saudi Arabia, UAE, Qatar, Irak, Kuwait, Lebanon, Jordan, Oman, Bahrein), among the fastest growing regions, based in Riyadh.This typically includes the following:Define and implement business and sales strategy in cooperation with Domain leader, BL, countries and sales directorate (SIX).\nEnsures implementation of BL business strategy in the region (target vertical markets, partnerships, business models)\nOrganize and manage regional sales team, leading transformation towards new digital business model (focus on Thales Security Digital Platform business development) and ensuring meeting business targets.\nFull accountability for PRS SEC order intake in the overall region.\nAct as direct sales interface to countries organization (DGDI) under scope of responsibilityThe person should have extensive management skills and experience as well as strong business background and track record in the region, preferably in security domain.Master’s Degree in engineering and or sales discipline is mandatory.Roles & ResponsibilitiesCUSTOMER-ORIENTED BUSINESS:Define and implement sales strategy and transformation towards new business models in-line with PRS Business Line priorities (focus on target vertical markets and Thales offers).Contribute to building and executing the account plans (Strategic & Key in the region).Coordinate with all involved functions to address to an opportunity, in order to deliver high-level value propositions and winning bids.\n Establish and develop high level trust-based relationships with his/her key customers to improve the capture rate.Anticipate complex negotiation closing including partnerships.Ensure promotion and closing of offers in synergies with other Business Lines.Ensure efficient, transparent and regular reporting to global Sales Director in-line with Thales sales processes.Ensure leadership in ensuring exhaustive application of Thales sales processes (gates, ethical rules, MYB, SBP,…)SALES PEOPLE ENGAGEMENTManage performance with established guiding sales organizational principles.\nCoordinate team efficiency and involvement of sales teams to ensure quality deliveries and result achievement.\nProvide managerial leadership to ensure initiatives and foster relevant practices (Value proposition, Black Hat, Price to Win…).\nPush digital, disruptive or innovative offers, especially around Security Digital Platform\nEngage and develop people through regular feedback, coaching attitude\nAct as a role model for coaching teams, helping team members find their way.\nPromote diversity and create an inclusive environment.\nSelect, recruit sales team members, propose allocation of resources.\nProvide focus and priorities, set up objectives.\nOrganize the periodic team meeting addressing actual & forecast OI, revenue, opportunities, …ACCOUNTABLE KPIsYearly Order Intake (Year N)\nYear N+1 forecast and growth scenario\nGross Margin on Order Intake\nVolume of OI on new digital solutions\nVolume of OI in synergy with other Business LinesWork Experience Requirements10 years’ in sales management in GCC, preferably in security domain with digital business acumen, for complex and highly demanding customers, experience in selling end-to-end systems and solutions including partners.Qualification, Certification & Educational RequirementsMaster in Engineering and Sales.Preferred SkillsStrong business background in security and selling end-to-end integrated solutions\nDeep knowledge and experience in Middle-East region, especially Saudi Arabia but all GCC is preferred\nStrong experience in working in large industrial companies\nImportant track record in selling complex solutions to highly demanding customers\nExperience in managing sales teams and driving them to success, building and implementing clear growth strategy\nStrong communication skills, business drive, transparency and trust\nCapabilities to adapt into complex environment and organizationsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}