{
    "Job ID": "69866283",
    "Description": "Job Description:Job Title - Trade and/or Transaction Analyst, NCTLocation – Pune, IndiaRole DescriptionEnsure continued service delivery and offer a robust and stable operating environment to support the Global Trade Services (GTS) functions.Contribute to the overall operational strategy of GTS function and responsible for its effective implementation. Improve service delivery and productivity to maximize service quality and operational efficiency and minimizing operational risk through the effective implementation of appropriate controls.Demonstrate commitment to continuous process improvement along with good People management skills.This role is part of the Middle office which requires the trade/risk to be captured and trade life cycling to be managed on T0 basis. Critical function which involves engagement with the Trading Desk and Risk and PnL teams, Docs / Setts teams to ensure all the trades blottered by the desk are taken into risk and back office workflows.What we’ll offer youPlease be aware there are regional differences to DB benefits and you will need to check the correct package per advert. As part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy.\nGender neutral parental leaves.\n100% reimbursement under child care assistance benefit (gender neutral).\nFlexible working arrangements.\nSponsorship for Industry relevant certifications and education.\nEmployee Assistance Program for you and your family members.\nComprehensive Hospitalization Insurance for you and your dependents.\nAccident and Term life Insurance.\nComplementary Health screening for 35 yrs. and above.Your key responsibilitiesMiddle Office Trade Capture function involving trade life cycling of trades on T0 basis for Flow and Exotics products.\nFollowing up with Traders, Sales, Brokers, and clients to ensure accurate capturing of the risk and to ensure remediation of control breaks and reconciliation breaks.\nLiaising with Front Office / Docs / Settlements and ensuring exceptions are resolved in a timely manner.\nManaging periodic coupons, amortization schedule and rate reset for derivative trades in Middle Office systems manually.\nResolving all inter-company breaks / system Reconciliation (FOBO) to ensure there are no outstanding exceptions and subsequent financial impact.\nSupporting change management, automation and continuous improvement projects.\nWork with T+1 P&L teams to resolve any P&L errors or differences resulting from trade bookings.\nUnderstanding F2B system / process flow, streamlining and engineering processes to bring efficiencies.\nProduce and Manage MIS and control reports for processes and projects.\nComplete adhoc requests and projects for Operations and the Business.\nMonitor and escalate any trade capture issues that could potentially result in regulatory escalations for the bank.\nResponsible for the middle office process deliverables and management of the daily trade capture activities in a timely manner, ensuring daily reconciliation and query resolution as required.\nAdherence to STARC standards and procedures and ensuring that there are no lapses or gaps in control.\nEnsure compliance to Limits Of Authority.\nEnsure EOD controls are adhered to daily.\nDemonstrate a proactive approach to all activities and create the environment for others to emulate this behavior.Your skills and experienceMinimum of 2-4 years’ experience in derivatives or related products.\nMust have strong knowledge on derivative products.\nMust have complete understanding of how trade life cycle works.\nNeeds to be up to date on regulatory requirements & market changes..\nShould own & resolve complex breaks independently and guide the team in resolving the same.\nShould be able to independently deliver on all organization mandates\nMust have strong analytical skills, must be detail oriented.\nMust be a team player who is willing to work in groups across multiple locations.\nNeeds to be good in Communication and have a good command over English language.\nMust have the ability to effectively manage, coordinate and prioritize multiple tasks and projects.\nMust be prepared to work in a shift supporting US/UK business hours.\nShould be able to lead teams across time zones.\nSelf-starter with ability to take things to their logical end.How we’ll support you Training and development to help you excel in your career.\n Flexible working to assist you balance your personal priorities.\n Coaching and support from experts in your team.\n A culture of continuous learning to aid progression.\nA range of flexible benefits that you can tailor to suit your needs.About us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}