{"Job ID": "69869715", "Description": "Abercrombie & Fitch Co. (NYSE: ANF) is a leading, global specialty retailer of apparel and accessories for men, women and kids through five renowned brands. The iconic Abercrombie & Fitch brand was born in 1892 and aims to make every day feel as exceptional as the start of a long weekend. abercrombie kids sees the world through kids’ eyes, where play is life and every day is an opportunity to be anything and better anything. The Hollister brand believes in liberating the spirit of an endless summer inside everyone and making teens feel celebrated and comfortable in their own skin. Gilly Hicks, offering intimates, loungewear and sleepwear, is designed to invite everyone to embrace who they are underneath it all. Social Tourist, the creative vision of Hollister and social media personalities, Dixie and Charli D’Amelio, offers trend forward apparel that allows teens to experiment with their style, while exploring the duality of who they are both on social media and in real life.  The brands share a commitment to offering products of enduring quality and exceptional comfort that allow consumers around the world to express their own individuality and style. Abercrombie & Fitch Co. operates approximately 730 stores under these brands across North America, Europe, Asia and the Middle East, as well as the e-commerce sites www.abercrombie.com, www.abercrombiekids.com, www.hollisterco.com, www.gillyhicks.com, and www.socialtourist.com.A Full-Time Key Holder helps drive the business through leadership and is actively involved in ensuring a differentiated customer experience. Key Holders should be assertive, analytical and trustworthy as a leader of a multi-million dollar business. They utilize applied learning to evolve as a business leader and improve store results. The Key Holder leads a team of associates to ensure operational tasks and procedures are successful as well as opening and closing routines being completed, all while keeping the customer at the center of everything we do.What You’ll DoTraining and Development\nCustomer Experience\nCommunication\nStore Presentation and Sales Floor Supervision\nAsset Protection\nPolicies and Procedures AdherenceRequirementsEmirati national\nMinimum 1 year experience as Supervisor or Manager What it TakesWork Ethic\nAssertiveness\nApplied Learning\nAttention to Detail\nAnalytical Skills\nAdaptability / Flexibility\nMulti-Tasking\nStress ToleranceWhat You’ll Get   As an Abercrombie & Fitch Co. (A&F Co.) associate, you’ll be eligible to participate in a variety of benefit programs designed to fit you and your lifestyle. A&F is committed to providing simple, competitive, and comprehensive benefits that align with our Company’s culture and values, but most importantly – with you! We also provide competitive incentives to reward the commitment our associates have for moving our global business forward. FIND A STORE IN YOUR AREA AND BRING YOUR CV TO APPLY & LEARN MORE! SEE WHAT IT’S LIKE TO #WORKATANF - FOLLOW US ON INSTAGRAM @LIFEATANFAbercrombie & Fitch Co. is an Equal Opportunity/Affirmative Action employerJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}