{"Job ID": "69869555", "Description": "Majid Al Futtaim Holding is the leading shopping mall, retail, communities, entertainment developer and operator in the Middle East, North Africa, and Central Asia regions. With over 48,000 people, revenues of over US$ 11 Billion, and operations in 18 countries. Some of the iconic brands we carry include Mall of the Emirates, Carrefour, All Saints, Lego, City Center, Abercrombie & Fitch, & Vox Cinemas. We believe in making Great Moments for Everyone, Every day.\n ROLE SUMMARY\nThe 3D Designer / 3D Modeler will work directly with Director of Design and Senior Design Manager on the production of high-quality 3D images and illustrations; collaborating with the design team to achieve evocative style visualizations to a presentation standard whilst working to fixed deadlines. Producing Visualizations is the main element of the role.\n\nROLE PROFILEUtilize 3D Max, AutoCAD, and Lumion to develop captivating and functional 3D designs for new projects, ensuring they adhere to project requirements and specifications.\nLead and manage a team of designers, providing guidance, feedback, and mentorship to ensure the delivery of high-quality designs.\nPrioritize and delegate design requests from the team, ensuring timely delivery of designs that meet the highest standards of quality and creativity\nReview and enhance existing 3D designs, implementing improvements that optimize product performance and aesthetic appeal\nMaintain comprehensive and well-organized documentation of all new and revised 3D designs, ensuring easy accessibility for team members and stakeholders\nCollaborate effectively with cross-functional teams, including architects, engineers, and project managers, to understand project requirements and incorporate feedback into design refinements\nMake informed decisions in selecting appropriate materials, engineering standards, and generic parts, ensuring the feasibility and manufacturability of 3D product designs.\nFoster a collaborative and creative work environment, encouraging open communication and idea sharing among team membersREQUIREMENTSAt least 7+ years of experience in a similar role in a creative environment; preferably with a graduate-level qualification or equivalent\nA portfolio of high-quality graphical work produced in a professional environment\nExperience within architectural practice and advantage.\nAn interest in art/architecture and an understanding of design principles are critical\nExperience in photography, illustration, or hand drawing is beneficial and Experience in creating imagery with a pictorial sensibility is beneficial.\nDemonstrate a keen eye for detail, composition, and visual narrative and Possess and communicate strong technical knowledge on the production of images and Illustrations.WHAT WE OFFERAt Majid Al Futtaim, we’re on a mission to create great moments, to spread happiness, to build, experiences that stay in our memories for a lifetime. We’re proud to say that over the past 27 years, we have built a reputation as a regional market leader in what we do. Join us!\nWork from any country in the world for 30 days a year.\nWork in a friendly environment, where everyone shares positive vibes and excited about our future.\nWork with over 50,000 diverse and talented colleagues, all guided by our Leadership Model.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}