{"Job ID": "69869743", "Description": "Job DescriptionTo prepare bidding documents, evaluate bids, carryout clarifications, conduct meetings,  review designs, engineering drawings, supervise the installation and commissioning activities related to electrical engineering works (but not limited to) of future and ongoing projectsThe Senior Electrical Engineer shall:-Monitor daily Company’s production facilities and operational ream activity to establish improvement plan.\nSurvey existing facilities and collect any data to assess existing facilities risks against the continuous operation.Inspection & Mitigation:Monitor the operating and maintenance conditions of equipment and auxiliaries including chemical\ntreatment/injection rates by analyzing readings and conducting inspections of instruments to ensure that all facilities are operating within set standards. Report abnormal conditions to the PI Manager.\nInspect and analyse equipment threats & hazards and ensure implementation of standard operating procedures\nin order to maintain the integrity of all equipment and assure adherence to safety standards.Operational Accountabilities:Prepare Tender document, evaluate bids, carry out technical clarifications, and arrange kickoff meetings related\nto the electrical engineering works.\nReview electrical engineering drawings, wiring diagrams specification etc.\nMonitor checks on electrical equipment; provide technicians with relevant documentation, support material, tools and guidance to ensure the installation/calibration/commissioning activities are carried out as per directions while attending to all non-conformances raised by team to ensure timely provision of solutions.\nSupervise and execution of assigned project work site, adhering to company’s set standards, policies and procedures.\nPlan work with Head of Project Group, analyze priority of activities and ensure timely completion of tasks as per-defined procedures & standards.\nManage, monitor and interpret the contract and design documents.\nMonitor and review the progress of each ongoing jobs related to electrical engineering discipline (but not limited to), schedules, daily/weekly/monthly plans and liaise with foremen, contractor staff and other relevant authorities providing support and advice in the proper project execution within the set procedures, specifications and-allocated budget. Material Management:Assist the timely procurement of equipment and material for new projects and material transportation between\nAbu Dhabi & various sites in order to support the implementation.\nMonitor stock and usage levels of materials, consumables and spare parts to ensure that items are available to meet requirements and that usage is consistent with budgeted assumptionsJob Specific Skills:Strong knowledge and experience for power generation systems, transmission line systems, substation\nsystems and renewable systems\nStrong knowledge and experience in the application of process operation systems and technology in Oil & Gas sector.\nExcellent understanding of the whole system of gas turbine generator packages\nUnderstanding of any discipline engineering incl. mechanical, piping and instruments.\nDrafting skills for EPC tender and Contract Conditions\nAnalytical thinking, knowledge for risk assessment, and presentation for improvement plan\nTime management, multi-tasking skills, Problem solving skillsRequirements Qualification:\n\nBachelor’s Degree in Electrical Engineering with knowledge and working experience of process stimulation software.\n\nExperience:\n\n\n\n10 Years relevant experience of which at least 5 years in operations with the oil & gas industry at supervisory level.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}