{"Job ID": "69865736", "Description": "Roller Waiter/WaitressRixos Hotel Marina Abu Dhabi is currently seeking enthusiastic and dynamic individuals to join our 5 Star Luxury team as Roller Waiters/Waitresses. As a Roller Waiter/Waitress, you will not only provide exceptional dining service but also add a unique and delightful element to our guests' experience by skillfully delivering their meals on roller skates.\nWhat is in it for you?·Employee benefit card offering discounted rates in Accor worldwide·Learning programs through our Academies·Opportunity to develop your talent and grow within your property and across the world!·Ability to make a difference through our Corporate Social Responsibility activities, like Planet 21What you will be doing:·Greet and escort guests to their tables.·Present menu and provide detailed information about specials and menu items.·Assist guests in making food and beverage choices.·Take and serve orders promptly.·Operate roller skates smoothly and safely.·Ensure guests have a positive and memorable dining experience.·Address guest concerns or complaints with professionalism.·Collaborate with kitchen and bar staff to ensure prompt and accurate service.·Maintain a clean and organized dining area.Your experience and skills include:·Previous experience as a waiter/waitress preferred.·Proficient in using roller skates.·Excellent communication and interpersonal skills.·Ability to work in a fast-paced environment.·Knowledge of food safety and sanitation regulations.·Exceptional multitasking abilities.·Neat and professional appearance.·Must be able to work flexible hours, including evenings, weekends, and holidays.Your team and working environment:Rixos Marina Abu Dhabi is an iconic architectural landmark that unites the very best of Arabic and Turkish culture, dining and hospitality. Located in the heart of Abu Dhabi's retail, entertainment and residential hub, Rixos Marina Abu Dhabi is a multifaceted resort presiding over sparkling waters and a sandy shoreline. Rixos Marina Abu Dhabi reflects the versatility of Abu Dhabi as both a cosmopolitan city abounding with enriching experiences and an archipelago with a rich natural and aquatic heritage. Rixos Marina Abu Dhabi seamlessly fuses sophisticated aquatic and arabesque design to tell the story of Abu Dhabi from its ancient seafaring origins to a thriving cosmopolitan city that takes pride in its heritage and ultimate luxury experiences. As a destination, Rixos Marina Abu Dhabi dares to be different, elevating guest experience through incredible design, amenities, ambience, gastronomy, entertainment, and leisure.Our commitment to Diversity & Inclusion:We are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Why work for Accor?We are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/Do what you love, care for the world; dare to challenge the status quo! #BELIMITLESSJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}