{
    "Job ID": "69866810",
    "Description": "VAM Systems is currently looking for Sr. Business Analyst for our Bahrain operations with the following skillsets & terms and conditions:Skills & QualificationsArabic speaker\nBachelor Degree preferably Engineering background\n5+ years of experience in similar projects\nExperience in government sector\nExcellent communications skills both written and verbal\nUX designing\nHands on with any of the popular wireframing tools like – wire framesketcher, Balsamiq, Mockingbird, pencil or similar tool\nAble to define the lifecycle, deliverables, tasks and templates that should be included in business analysis process.\nAble to select the right tools for each phase of the business analysis processes (brainstorming, benchmarking, data flow diagram, process modelling, and prototyping ….etc.).\nExcellent ability to elicit the stakeholder actual needs not simply their expressed desires.Roles & Responsibility:To analyze and synthesize information provided by customer who will interact with the business.\nTo develop and document a detailed understanding of user workflow and elicit business requirements.\nTo recommend appropriate technical or business solutions to the project team to ensure a high level of satisfaction.\nTo conduct demo sessions for users, generate user guides and training manuals, and deliver training sessions as required.\nTo validate that the solution has met the customer needs.\nTo Work on problems of diverse scope where analysis of data requires evaluation of multiple factors.\nTo own and maintain the user stories and requirements log in JIRA or any other tool.\nTo work with project manager, development and QA to help plan and define sprints to deliver the prioritized requirements\nGather requirements for process or system improvement.\nPlan how the requirement will be approached, traced and prioritized.\nDetermine which steps can and should be automated or improved for maximum benefit.\nDocument the requirements of the system, both at a high level and a more detail.\nPrepare the system use cases and design screens.\nProvide inputs to development to scope and build prototype/proof of concept solutions and involve the users to obtain feedback\nAct as a contact point, or “translator” between technical teams and business users to ensure process/system changes will integrate effectively into the overall business process.\nAssistance with testing, implementation and training.Terms and conditionsJoining time frame: (15 - 30 days)The selected candidates shall join VAM Systems - Bahrain and shall be deputed to one of the Organizations in Bahrain.Terms and conditions: Joining time frame:   maximum 4 weeksJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}