{"Job ID": "69865847", "Description": "Wood is recruiting for a Senior Instrument & Controls Engineer to join our team in Qatar on a long term basis. This is a key role within the Wood Doha office delivering across study, FEED, EPC and PMC scopes of work. In this role, you will be responsible for the execution of project work in accordance with the project execution plan, including Wood and/or Project Procedures on Safety and Quality Control within the man-hour, cost and project schedule targets.Reflecting the market focus for the office in both brownfield and green field opportunities, multi-skilled personnel are sought, in particular those with experience in:Onshore Oil and Gas\nOffshore Oil and GasResponsibilitiesEnsures Wood and Client Health, Safety, Environmental and Quality procedures are followed and that a high standard of safety is achieved in all associated work\nProduces and reviews C&I deliverables with little input or guidance from the Lead Engineer, ensuring accuracy and alignment with the scope of work prior to issue. Such deliverables including but not limited to the following:\nThe design basis, instrument schedules/index, sizing calculations and instrument datasheets (control valve, relief valves, flow / pressure / level instruments, cable, etc), Control & Shutdown System Philosophies, etc.\nPreparation and development of enquiry packages including Specifications, Datasheets, Request for Quotation and Technical Bid Evaluation.  \nProvides direction and guidance to designers in the production of I&C drawings such as field instrument & LER layouts, routing & layout drawings (cable, tray, MCT, etc), wiring & termination & loop diagrams,\nDevelop specification and prepare material requisitions for control systems, instruments, control valves and all other instruments\nSupports development and provides instrumentation and control input for P&IDs and Cause & Effects\nReview Vendors’ quotations prepare technical quotation evaluation and recommend the final technically acceptable Vendor, in conjunction with Materials Management Department commercial quotation evaluation. Technically approve Order Variation Summaries\nHolds co-ordination meetings and engineering review meetings with Vendors of major equipment as required\nPrepares and develops material take off for the I&C discipline\nAssist in performing managerial tasks as requested, such as assigning tasks to engineers; planning and coordinating portions of the engineering work; preparing scopes, schedules, and budgets; attending project meetings; and developing lesser-experienced technical professionals\nMay serve as the Lead Engineer and/or discipline technical authority when required on small to medium complexity projects. In such capacity will take responsibility and ownership for cost, schedule, resource allocation and risk.\nProvide piping input to tenders and project estimates in the development of method statements, deliverable lists, manhours, CTRs and risk\nMay supervise a small work group consisting of engineers and designers with some coaching from Lead Engineer, or may provide advice and guidance in area of specialisation to others\nTakes responsibility and ownership for challenging I&C engineering tasks and capable of delivering scope for an area on large and/or complex projects\nParticipates in project reviews, design reviews, audits and other workshops as required\nCompletion of site surveys and data gathering for brownfield scope of work, taking responsibility for development of the site survey report\nAssess progress and procedure associated reports and input to the progress measurement system. Derive and suggest plans to recover slippage, correct inefficiency and to take any resulting agreed actions\nRemain up to date with the latest technical developments in your fields of expertise\nTakes a proactive approach to personal & professional developmentEngineering Degree in Instrumentation & Control, Electrical & Electronics Engineering or similar with a minimum of 10 years of relevant experience\nEnrolled on the Register of Engineers in the State of Qatar, Grade A or B Category as a mandatory requirement\nIf not enrolled on the Register of Engineers in the State of Qatar, then candidates must be a Chartered Engineer\nTÜV Function Safety Certification is desirable\nFurther education and experience with Cyber Security Systems is desirable\nProven core Instrument & Control Engineering skills, including design experience in the Oil & Gas sector\nExperience of working in a variety of projects and phases, including greenfield and brownfield, on and offshore, Pre-FEED through to EPC, with a focus on offshore upstream.\nFamiliar with third party control system architecture and design including Honeywell, Yokogawa, Emerson, Invensys, Siemens and ABB for example\nFamiliar with and competent with PAS, DCS, SCADA and PLC control system design including fieldbus technologies and the various communication protocols\nExperience with ESD, F&G and Condition Monitoring Systems design\nExperienced with completing SIL assessments, SIL verification, and SIS architecture design\nExperience and knowledge of Telecoms engineering and design is desirable, including an awareness of relevant international design codes and standards such as IA/TIA and ETSI\nExperience with Telecoms systems such as LAN, CCTV, PA/GA, UHF/VHF Radio, Microwave and Access Control for example is desirable \nStrong understanding of plant design and field instrumentation / control room layout\nUnderstanding and use of SPI (INTOOLS)\nExperienced and well versed with HAZOP / SIL / LOPA, capable of representing the discipline as the technical authority in such studies\nFamiliar with and experience in the application of international design codes and standards such as ISA, NFPA, BS, API, IEC, NACE, NEMA, ANSI, etc\nIdeally has experience with Qatar O&G customer design standards including Shell DEPs\nExperience with management of vendors, able to complete Technical Bid Evaluations and oversee development of vendor scope\nExperience completing factory acceptance tests for a range of instrumentation and control systems is desirable\nConstruction and site experience is desirable, with exposure to loop checking, installation and problem solving of transmitters, pressure switches, level switches, control valves, F&G detectors, flow meters and MOVs\nA self-motivated, proactive individual with high achievement drive and initiative, excellent verbal and written communication skills and good organisational awareness\nAbility to impact and influence fellow workers\nDisplay analytical and innovation skills to manage new technology Applicants are required to:Be available for work in Doha, Qatar from May 2022\nBe a self-motivated, proactive individual with high achievement drive and initiative, excellent verbal and written communication skills and good organisational awareness\nConfidently deliver assigned scopes of work independently / remotely from technical leadership personnel, with minimal guidance and direction\nTake accountability for own targets and supervise engineering and design resource as required to meet project expectations\nHave demonstrable experience of working within a small project office, supporting cross discipline activities beyond their core discipline\nBe willing and able to represent Wood in both onshore and offshore surveys, holding relevant certification or willing to undertake suitable training such as BOSIET and H2S Awareness.\nDemonstrate a competent level of written and spoken communication skills in the English languageWood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}