{"Job ID": "69868103", "Description": "The Demi Chef de Partie will carry out and partially supervise operational tasks and duties in the kitchen under the guidance of the respective Senior Chefs, with the overall objective to prepare food in a timely manner as per quality and food safety standard.\nResponsibilities :Assist the Chef de Partie in his daily duties and oversee his responsibilities during absence.\nWashes and peels ingredients in order for them to be used in the production of dishes.\nEnsure that all mise en place is prepared to the highest quality as per standards set by the superiors.\nEnsure that all plating guides are followed according to set dish description, cooking method and presentation image.\nEnsure the pickup of requisition is in time and organized properly in its corresponding storage area.\nCheck the inventory of the daily ingredients before each shift to assure correct amounts are stocked up to avoid running out of stock during service periods.\nStore ingredients in dedicated containers, making sure that they are best preserved and labelled according to standard.\nEnsure that working surfaces, tools, utensils and working area are cleaned and sanitized before and after usage as per food safety standard.\nAdhere to strict personal hygiene standards at all times.\nEffectively support, control cleanliness and maintenance of the kitchens and stewarding area at all times and support daily checks done by supervisors.\nEnsure to follow through the food safety safe and sound standard set by Mandarin Oriental Hotel and in accordance’s the UAE’s Municipality rules and regulation.\nEnsure customer satisfaction in accordance to the MOHG Legendary Quality Experiences (LQEs), the MOHG Pillars and the respective service standards of MOQA.\nWork as part of the team and assist other colleagues if required.\nSupport other outlets and banquet if requested by superiors.\nAttend and participate in all required meetings and trainings as scheduled.\nPerform any other reasonable duties as required by the superiors.\nSolid experience in preparing, holding and cooking of food.\nAbility to work long hours with a strong focus on operational excellence.\nAbility to move, lift, carry, push, pull, and place objects weighing less than or equal to 15 kg without assistance.\nProven ability to successfully support the management to motivate and lead a diverse team.\nKnowledge of the kitchen tools and utensils in order to perform the specific tasks.\nAbility to handle multiple tasks effectively.\nKnowledge of food hygiene.\nAbility to understand effective approaches of communication with different individuals.\nAble to communicate clearly with peers and superiors.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}