{
    "Job ID": "69866490",
    "Description": "Job Title: HC, Nutrition & IC Customer Service Assistant Manager and KSA CS LeadLocation: Jeddah, KSACompany Profile:At Unilever you are more than your job title, you are part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us.We produce world-leading brands including Knorr, Dove, Axe, Hellmann’s and Omo, alongside trusted local names and innovative-forward thinking brands like Ben & Jerry’s, The Dollar Shave Club and Surf.Be part of the most successful purpose-led business in the world. Have the opportunity to see the true impact that you’re having in the work you do - every small thing counts.Job Scope:Key purpose of this role is to enables #1Supplier, through Primary Shipment Planning forward forecasting (Vol & GSV) based on Norms (SPS) and ensure timely stock availability at DCs capturing short term risks and opportunities from IMS.Roles & Responsibilities:Dynamic shipment forecasting for FY in line with Market Target Norms.\n\nEnsure market stock norms are maintained in line with IPM model (confirmed and aligned with business).\n\nValidate weekly market Allocation : Constrain SPS Unconstrained based on Supply confirmation, capped by SPS unconstrained, to cover IMS GAPs and Norms, created by CS Planners;\n\nMonitor plan vs delivery of total Arabia plan: weekly, monthly, quarterly and yearly.\n\nValidate Market Allocation generation for promo requirement by CS Planners.\n\nAccountable on Financial planning vol submission by the deadline: S&OP and Opening.\n\nLeading DSR for Supply risks mitigations on both Primary and secondary, that should make Pri Cons & IMS cons for S&OP volume submission.\n\nCo-Lead WORM meetings with DFM to monitor IMS & Shipment progress.\n\nPOC for any extra requests and liquidations and update SPS/Can do accordingly.\n\nCoordinate with Deploy to support on execution risks mitigations: logistics, MDM, Finance, stock availability, co-packing etc.\n\nSupervise and manage E2E Reporting prepared by direct reports and share visibility with stakeholders.\n\nResponsible on LV/weekly market allocation vs monthly forecast.Key Competencies & Skills:Stakeholder management\n\nAnalytical skills\n\nCommunication skills\n\nTechnical System skills\n\nECC and BW\n\nPower BI\n\nPPT\n\nExcelUnilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}