{
    "Job ID": "69866145",
    "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleManager, Software DevelopmentWhat does a Manager, Software Development do at Fiserv?As an experienced member of our Core banking Base Development Group, you will be responsible end to end delivery, guiding and providing technical help to team and accountable for deliverable quality, timeline project.The Manager, Software Development role is embedded in the fabric of the Fiserv business and technology. The purpose of the Technical Project Manager’s job is to ensure predictable, consistent, and successful project delivery. This role will plan, coordinate, and monitor large scale scope and budget projects with a high degree of complexity and risk, and will partner with key business stakeholders and technologists to ensure a successful start and completion of a project. Projects can span multiple business units or functional areas. The Technical Project Manager is expected to work under minimal supervision with oversight provided by the overall Project Delivery Leader and also able to guide team technicallyThe role is required to be performed from Fiserv India offices for all 5 working days in a week.What You Will Do:Plan, organize, and control resources/processes to achieve project/program objectives within scope, time, quality, and budget constraints.\nOversee projects from planning stage through implementation.\nDetermine and define clear deliverables, roles and responsibilities for project team members.\nDefine project governance, outlining roles, responsibilities, decision rights, and clearly defined escalation path.\nEnsure project results meet requirements regarding quality, reliability, schedule, and cost.\nProvide a holistic view of the overall project to the organization and all stakeholders.\nEnsure success criteria defined upfront to promote alignment and actively manage to expect project outcomes.\nKeep all stakeholders (internal & external) engaged in the project, aligned on expected outcomes, and informed about what is occurring throughout project.\nProactively communicate the project’s progress on an on-going basis, ensuring transparency throughout project lifecycle\nProvide leadership and key stakeholders with the information and venues to make effective, timely decisions.\nEstablish and implement training processes for all technical personnel.\nExhibit proactive behavior by engaging in project planning activities, including but not limited to:\nDefine the overall scope of the project.\nCreate and maintain a consolidated timeline/schedule highlighting the major milestones and associated dates for project activities.\nIdentify and communicate project dependencies and impacts.\nPut mechanisms in place to ensure on-going control of the project (e.g., kick-off meeting, overall project management approach, communication plan, risk management, issues management, change control, etc)  What You Will Need to Have:A successful Technical Project Manager will possess the following key skills/behaviors:Stakeholder Partnership:\nStrong influencing and stakeholder management skills, ability to develop and maintain strong working relationships and strategic partnerships with key stakeholders/customers across Fiserv to maximize program effectiveness and influence.\nPoised and composed interaction with all levels of the organization (within Division), including senior level audience.\nJudgment:\nAbility to practically apply project management concepts to facilitate the achievement of business objectives ensuring predictable, consistent, and successful program delivery.\nAbility to adapt to and work effectively within a variety of situations and with various individuals.\nTeam Leadership:\nProven ability to quickly earn the trust of sponsors and key stakeholders, mobilize and motivate project team, set direction and approach, resolve conflict, deliver tough messages with grace.\nAbility to lead and influence with minimal direction from sponsor or manager.\nTechnical hands on:\nIn depth knowledge of .Net technical stack, must be able to provide technical guidance and support to team\nAccountability & Commitment:\nAbility to achieve project outcomes and stakeholder satisfaction.\nAbility to identify project obstacles and proactively mitigate risks. Escalates and resolves complex issues effectively.\nLearning Agility:\nAbility to quickly grasp complex concepts and conveys concepts in a way that is easily understood by others.\nAbility to incorporate feedback and adjust plans or approach.\nBusiness Acumen:\nAbility to provide a holistic view by coordinating with and monitoring all impacted business processes from initiation to delivery.\nAbility to explain the business rationale and benefits of change to client, including impacts to project.\nProblem Solving:\nAbility to identify, analyze and solve problems.\nAbility to solve complex problems rather than symptoms effectively and quickly.\nProcess Adherence:\nAbility to engage in project initiating activities such as identifying stakeholders, identifying project management approach, defining roles and responsibilities, etc\nAbility to use proven project management methods and practices to facilitate the achievement of project outcomes.\nAbility to provide a complete view of the overall project to the organization and all stakeholders.12+ years of previous program, project management, and/or relevant consulting and leadership experience\nKnowledge of and demonstrated experience in project management processes and methodologies and project lifecycle.\nProject portfolio management experience including Clarity and/or equivalent.\nMethodologies including SDLC, Waterfall, Scrum fall/Agile.\nExpertise .Net technology\nExcellent verbal and written communication skillsWhat Would Be Great to Have:Experience in banking domainThank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}