{
    "Job ID": "69867068",
    "Description": "For a leading financial institution, committed to innovation and digital transformation. As a dynamic and forward-thinking organization, we are looking for an exceptional individual to join as the Director of IT Operations. This pivotal role reports directly to the Group's Chief Digital and Information Officer.Responsibilities:As the Director of IT Operations, you will lead and manage a diverse team of 60-70 full-time employees and approximately 100 contractors/vendors, totaling around 150-180 individuals. Your responsibilities will span across four crucial divisions:1. Service Operations:Oversee service desk operationsManage incident managementSupport VIP clienteleLead desktop engineers and support teams2. Service Reliability:Ensure system reliability through Soft and Hardware Reset Engineers (SSRE)3. Infrastructure & Application Operations:Support infrastructure and application operations teams4. Service Management:Implement effective problem and change management practicesQualifications:Extensive experience in the banking industry, preferably with significant exposure to large financial institutions.\n\nProven leadership in managing sizeable teams of diverse professionals.\n\nStrong understanding of IT service operations, including service desk and incident management.\n\nExpertise in infrastructure and application support.\n\nExcellent communication and interpersonal skills.\n\nAbility to collaborate effectively with senior executives and peer-level colleagues.\n\nBachelor's degree in a relevant field (MBA or equivalent is a plus).Please send an application today to be considered.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}