{"Job ID": "69865513", "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"The Hygiene Agent oversees and administers all aspects of health and safety compliance. With a focused dedication to maintaining the highest standards, the Hygiene Coordinator is responsible for ensuring that our guests and colleagues enjoy an environment that prioritizes their well-being. This position is pivotal in upholding the hotel's reputation for excellence by implementing and monitoring stringent hygiene practices throughout the property. Through meticulous record-keeping, continuous training, and close collaboration with departments, the Hygiene Coordinator ensures that our commitment to luxury and safety remains unwavering, providing guests with the utmost peace of mind during their stay.Your team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}