{
    "Job ID": "69866230",
    "Description": "Job Description:Job ResponsibilitiesThe Corporate Affairs Director for Mars Pet Nutrition India will be responsible for leading the Corporate Affairs & Corporate Communication function supporting the business and is a key member of the Mars Pet Nutrition India Leadership teamThe functional priorities include to raise the reputation of Mars in India across both Mars Pet Nutrition India and through the One Mars reputation council. At the same time, the CA Director will need to deliver quality growth by navigating the dynamics of the Indian political and regulatory framework through public affairs and advocacy strategies. These include navigating critical challenges in the areas of sustainability (including plastic waste, health and well being, deforestation and human rights), ingredient safety, labour, trade, manufacturing and state legislation/regulation. This role will include leading issues and crisis management for Mars Pet Nutrition India, including managing media and government stakeholders. In addition, the role will lead internal communications, which is a critical enabler for engaging the Associate population. Finally, the role will also be responsible for leading the One Mars Corporate Affairs Council across other segments of MarsMars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}