{"Job ID": "69867194", "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.About the role:As part of the Data engineering team, the candidate will be working within an agile team that iterates quickly on delivering new features for the Zscaler Digital Experience (ZDX) SaaS-based product. Candidate will contribute to the design and development of backend microservices to expand the solution offering to collect and analyze telemetry/health data, and use this data to help detect performance problems with customer applications such as SaaS applications, UCaaS (Unified-Communication as a Service) apps, and Enterprise apps.What you will do:You will be responsible for product features related to data transformations, enrichment, and analytics\nYou will discuss with product managers, UX designers, and other backend teams to understand requirements and translate the same into functional specifications \nYou will seize every opportunity to refactor code in the interests of maintainability and reusability\nLead and provide technical direction and mentorship to junior engineers and bring out the best in them.\nThe ideal candidate has a proven track record of building large scale enterprise products, and is a creative thinker, problem solver, learner, and a fantastic manager of people, and is motivated with engineering excellence.Requirements:Education: BS Computer Science or Equivalent\nMinimum 10 years of software development experience\nExperience in Core Java, Concurrency, and Distributed Computing\nExperience in building high performance, scalable web services\nExperience using batch and stream processing frameworks like Spark/Kafka Streaming, Spring batch or equivalent\nExperience developing microservices and API's\nProficiency with Tomcat installation and configuration.\nProficiency with Maven (preferred) or Gradle builds and dependency management systems.\n5+ years of experience writing unit test, stubs, mocks in a TDD environment using JUnit, REST Assured, or TestNG\nExperience with CI & CD systems such as Jenkins or Bamboo\nMetrics-driven development experience and experience using metrics systems like Grafana, Prometheus, etcDesired skills:Ability to write code that can perform efficiently in a big data setup\nExperience with big-data technologies like Spark, Redshift, etc.\nStrong knowledge of various DBMS systems including NoSQL architectures and design principles\nExperience tuning JVM for optimal application performance\nSuccessfully delivered software products from ideation through to implementation and support\nExperience with any Graph Database like AWS Neptune, Neo4j, Spark Graphx, etc.\nUnderstanding of statistics and machine learning.Why Zscaler?People who excel at Zscaler are smart, motivated, and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team.Learn more at zscaler.com or follow us on Twitter @zscaler. Additional information about Zscaler (NASDAQ: ZS ) is available athttp://www.zscaler.com.  All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.#LI-SK3Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}