{
    "Job ID": "69869745",
    "Description": "Company:Job Area:General Summary:Job Summary:This position reports to the Global IT Operations center lead of Qualcomm and will be responsible for IT Service Management & Analytics for Global OneIT Team.Responsible for providing technical support and guidance in a complex IT environment. You will be required to have expertise in ServiceNow and ITIL processes, as well as the ability to corelate data, identify trends and patterns, create & manage data visualizations to provide insights, customer, and stakeholder management. You will be part of OneIT team which is responsible for maximizing business value by delivering differentiated IT solutions and services for Qualcomm’s dynamic business with an innovative and inclusive workforce.Principal Duties and Responsibilities:Lead the ITSM activities and tools configurations for Qualcomm Device Cloud (QDC) offerings from ITOC perspective.\nEstablish effective communication channel with both External and internal stakeholders for addressing QDC related activities.\nProvide technical support to IT Teams for ServiceNow and other ITSM tools, including troubleshooting and resolving technical issues.\nClosely working with Tools and Monitoring team and focusing on event correlation and anomaly detection, providing, and maintaining valuable insights in real time through creative data visualization dashboards\nEngage with stakeholders (both internal and external) on various operations support requirements within ITOC.\nActively participate in handling major outages (Major Incident Management Process).\nContribute aggressively to various IT Governance boards.\nParticipate in the development and maintenance of ITIL processes, policies, and procedures.\nCollaborate with cross-functional teams, including IT operations, service desk, and development teams, to identify and resolve issues.\nProvide guidance to team members on ITIL processes, Project Management and ServiceNow best practices.\nMonitor ServiceNow and other ITSM tools to ensure compliance with established service level agreements (SLAs).\nIdentify opportunities for automation, continuous improvement and implement the solutions.\nDevelop and maintain documentation of ITIL processes and ServiceNow workflows.\nProvides insight and supports the evolution of applications, systems, and/or processes to a desired future state by maintaining a comprehensive understanding of how current processes impact business operations across multiple domains.Collaborates with other teams to develop solutions for complex systems and processes within assigned business domain(s) by interfacing with stakeholders and appropriate IT teams.\nDevelop, train, coach and mentor members of the team and provides development assignments.\n Preferred Experience & Qualifications:15+ years of IT-related work experience with a bachelor’s degree in computer science/IT Engineering or equivalent.Strong Experience in IT service management with expertise in ITIL processes.\nExperience in Project Management tools such as MS Projects, Boardwalk, Tempus etc.\nExperience with ServiceNow or other ITSM tools, including configuration and customization.\nStrong knowledge in ITSM Analytics and Experience with data visualization tools, such as Power BI, Tableau, ServiceNow, QlikView\nKnowledge of IT Infrastructure, including servers, networks, and applications.\nStrong analytical and problem-solving skills, with the ability to work with large teams.\nExperience in fixing, analyzing logs, building metrics and operational dashboards.\nAbility to work independently and in a team-oriented, collaborative environment.\nExcellent communication skills, with the ability to communicate technical concepts to non-technical stakeholders.\nGood knowledge of programming language such as Python, Go, API integration.\nCertified in ITIL4 Expert, PMP/Prince2 and SAFe Agilist/Scrum Master.Level of Responsibility: \n•    Working independently with little supervision.\n•    Providing guidance to junior members of the team.Person should have a strong focus towards continual service improvement and focus towards improving efficiency by striving for automating standard tasks and applying lean principles.\nServing as liaison between technical and non-technical teams, in internal organizations as well as in client and vendor/subcontractor organizations, to ensure all project targets and requirements are met.\nStrong analytical/problem solving skills, ability to provide alternatives, root cause analysis, testing skills and ability to make thoughtful proposals are also among the skills required.\nManage shift schedules and provide ongoing feedback as part of the Infrastructure Management team.\nStrong understanding of ITIL and project management standards \nStakeholder Management\nAnalyses and reviews Service Performance against the SLAs and OLAs.\nDisplays extensive working knowledge of industry standards and practices, including technical details and company services offered.Minimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}