{
    "Job ID": "69866248",
    "Description": "Certified as a Top Employer for UAE, Qatar, KSA, and Oman; KONE is dedicated to a better world of work and exhibits this through excellent people practices.We are committed to fostering a great work culture and inspiring the highest standards of quality and efficiency from the team putting our people first and creating a workplace that nurtures collaboration, diversity, growth, and well-being.KONE Middle East & Africa (KMEA) is embarking upon an exciting growth phase through a direct presence in 12 countries and more than 60 distributor markets within the region.We have an exciting opportunity for an experienced Safety and Quality Inspector to be based in Abu Dhabi. Quality Inspector inspects products, measures process performance, checks compliance against documented procedures, records data and prepares formal reports. They work with the global/area/unit teams to implement, maintain and continually improve KONE Way for Safety and Quality.Responsibilities:•    Performs and documents test procedures on products or product components, including First article inspections, according to quality policies and procedures\n•    Perform product and process inspections as directed\n•    Write reports regarding quality measurements, inspections. Record inspection results\n•    Identify and communicate with Quality Manager/Engineer and Production/Installation/Service Supervisor on non-conformities\n•    Ensure calibration of test equipmentSafety policy and objectives\n•    Support the implementation, maintenance and improvement of KONE safety management system (operating model) including worker, user and third-party safety\n•    Cultivate an understanding and actively caring culture for safety. Act as a role model  \n•    Compile, maintain and improve safety documentation together with the unit safety team\n•    Actively participate in and contribute to unit safety committee and other safety forums\n•    Provide professional advice and support to the unit on matters affecting safety\n•    Plan, participate in and implement projects and activities to improve safety\n•    Work closely with customers and partners, including KONE subcontractors \n•    Support the development, review and exercise of crisis and emergency response plans   \nSafety risk management\n•    Monitor and develop safety risk management processes, tools and practices\n•    Support safety related change management projects and initiativesSafety assurance\n•    Collect, measure and ensure accuracy of leading and lagging safety data. Report performance  \n•    Monitor legal and business environment development in safety, identify and propose actions\n•    Perform safety audits regularly to verify compliance, identify uncontrolled risks and deviations \n•    Assist line management in safety audits/visits and support the audit process improvement\n•    Analyse and investigate incidents. Support the investigation process improvement.\n•    Manage corrective and preventive actions for continual improvement\nSafety promotion\n•    Develop own competences as a safety specialist in co-operation with the manager\n•    Support the training and development of others’ safety competences in the unit \n•    Proactively communicate safety information including investigation outcomes and best practices Requirements:Diploma in Electrical or Electronics Engineering\n7 years of working experience in safety, in Elevators & Escalators industry.\nNEBOSH or OSHA Certificate is a MUST\nGood communication skills and willingness to learn.\nAble to work in a fast-paced environment.\nStrong people and interpersonal skillsAt KONE, we are focused on creating an innovative and collaborative working culture where we value the contribution of each individual. Employee engagement is a key focus area for us and we encourage participation and the sharing of information and ideas. Sustainability is an integral part of our culture and the daily practice. We follow ethical business practices and we seek to develop a culture of working together where co-workers trust and respect each other and good performance is recognized. In being a great place to work, we are proud to offer a range of experiences and opportunities that will help you to achieve your career and personal goals and enable you to live a healthy and balanced life.Read more on www.kone.com/careersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}