{
    "Job ID": "69866124",
    "Description": "Our solutions are a key part of most industries - electronics, medical research, renewable energy, food production, infrastructure and many more. Working with us means working with the latest technologies and groundbreaking, sustainable innovations.Join us on our journey for a better tomorrow. The RoleEstablishing strategies for its region and setting targets\nFollow-up of the financial objectives and results of the region and realize\nTo follow the sales activities, offers and results of the region in line with the targets and to make corrections in line with the regional strategy where necessary\nTo ensure customer satisfaction in the region; by driving required coordination as sales&marketing&project and service is carried on\nCollect competitor and customer information  of the region -  analyse and create pricing strategy accordingly\nSupport sales engineers for all regional sales activities\nBe updated of running or upcoming projects in the region. In case of any conflict, be responsible for coordinationg rest of regional team\nTo ensure that the sales engineer is competent enough to perform the daily sales activities alone. Create and implement necessary action plans in this direction\nDetermination and implementation of the strategy for important KA customers by obtaining BLM approval\nDeliver reports containing Business Forecast, Lost Orders, Pending Orders, Market Outlook and Activities on time and with high quality information through Salesforce and other means. Actively use Salesforce for 1-1 meetings and ensure your team using Salesforce effectively with true data timely\nTo prepare and implement a three-year strategic plan to achieve projected sales and market share growth for his/her responsible region and key customers. In this context, decide on the regional distribution of the sales team with BLM approval in order to reach customers in the most effective way and identify the activities that will improve the sales success rate by identifying the products, solutions and service packages corresponding to the needs of the customers\nTo plan, coordinate and implement the sales activities such as Demo, Line Trial, Seminars, Walk the Line (WTL) in order to reach the annual targets\nDeveloping strong and productive relationships with decision-makers and influencers at all levels, conducting studies to increase customer loyalty through a customer-centric approach, providing complete and accurate contact names, and evaluating the results and supporting corrective actions to support the NPS process\nTo make SWOT analysis by shedding light on the following issues related to the market in which he/she is responsible,Defining the business objectives and needs of customers and analyzing the trends in the market,\nTo gather information about the organizational structures, strengths and weaknesses of the competitors, the products, solutions and services they offer, the strategies they implement, and to analyze the reasons that make our customers who prefer to buy from our competitors,\nAnalysis of the market by revealing  the impact of current market shares, possible future investments and projects to be realized, opportunities for technological transformation, potential size of the market, new products, solutions and services to be presented in the marketPerforming annual performance evaluations of his/her team, defining individual development areas. Supporting the individual development of employees by offering training / action plans in order to create a team with all the competencies and skills needed to achieve high level of successWhat you can expect from us? We’re TOPFLIGHT people. By this we mean people with passion and commitment who are collaborative,open minded,resourceful,entrepreneurial and create lasting resultsWe respect the diversity and inclusion of our employees and we provide an equal opportunity to all qualified applicantsKeep commitment to customer\nStrong interpersonal and communication skill, good teamwork spirit, self-motive, goal-oriented and energetic.\nHigh ability to work in teams\nAnalytical approach to problem solving capability, ownership, never give-up attitude\nAbility to plan & prioritize own work efficiently and work under pressure\nDrive better customer satisfactionWhat we expect of you? QUALIFICATIONS\n1.    University degree in engineering\n2.    PC skills (MS Office)\n3.    Good command of Turkish and English both in speaking & writing\n4.    B Driving Licence\n5.    No military obligation for male employeesCOMPETENCIES\n1.    Customer focused and able to create customer centric solutions\n2.    Topflight with passion and commitment to create lasting results\n3.    Collaborative\n4.    Open Minded\n5.    Resourceful\n6.    Entrepreneurial\n7.    Know How in pneumatic, mechanical, electric and electronic components\n8.    Strong communication and presentation skills\n9.    Negotiation skill\n10.   Exceptional technical knowledge of Atlas Copco products is preferred\n11.   Leadership and coaching skills\n12.   Strategical thinking and long term planning\n13.   Ability to make prompt and clear  decisionsBEHAVIOURS\n1.    Support and act together with cross functions in customer communication\n2.    Take necessary actions with other parties and respond to customer with a sense of urgency when recevied a request from customer directly.\n3.    Respond customer request within 24 hours and making sure customer have a feeling that great care and focus is given. \n4.    Sharing information and raising red flags to be proactiveCity\nBursaJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}