{
    "Job ID": "69868535",
    "Description": "About the companyAnaxee is India's REACH Engine! We help Brands/OEMs and Social organizations scale across India by providing Outreach, especially in the remote parts of India, on demand. We focus on Tier-2, 3 & 4 towns & villages, covering 11000 pin codes (60%) of India through a vast network of last-mile (tech-enabled) feet-on-street (FOS) network of 40,000 Digital Runners.Job role:We are looking for a tech-savvy Sales Representative with the ability to make hands-on Sales. You will seek new business opportunities by contacting and developing relationships with potential customers. You will be speaking to the Who's Who of the fintech world.It is an added advantage if you have experience in developing leads from marketing campaigns and meeting sales quotas. You will be responsible for the entire sales cycle from establishing customer contact to signing a deal. You will also ensure proper after-sales service.Job Location: Indore | Full Time | Work from OfficeSalary Range: 2 LPA- 3.6 LPAExperience: Fresher or 1+ Year experiencePreferred Requirement: Experience in B2B Sales.Responsibilities:Find customers for Products & Services provided by the company\nContact potential clients via phone, email, and LinkedIn\nIdentify client needs and suggest appropriate products/services\nCustomize product solutions to increase customer satisfaction\nBuild long-term trusting relationships with clients\nProactively seek new business opportunities in the market\nDirectly report to the CEO\nStay up-to-date with new products/services and new pricing/payment plans\nKeep an eye on the competition.Requirements:A bachelor's or master's degree in business, marketing or a related field is required, with a preference for a master's degree.\nProven work experience as a Business Development Representative, Sales Account Executive or similar role.\nHands-on experience with multiple sales techniques.\nExperience with CRM software, Online tools for effective sales.\nUnderstanding of sales performance metrics.\nExcellent communication and negotiation skills.\nGood Email writing skills.\nAbility to deliver engaging presentations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Indore, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}