{
    "Job ID": "69866438",
    "Description": "Company DescriptionAt AECOM, we’re delivering a better world.We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – 47,000 strong – driven by a common purpose to deliver a better world.Here, you will have freedom to grow in a world of opportunity.We will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.Job DescriptionAECOM is seeking a Reliability Availability Maintainability (RAM) Engineer.This role will work very closely on projects to ensure reliability, availability and maintainability of systems and will perform routine work requiring application of standard techniques, procedures and criteria in completing a sequence of related engineering tasks. The role will work in accordance with AECOM’s values and demonstrate commitment, active involvement and leadership regarding zero harm, client, people and financial accountabilities. When undertaking tasks on rail related projects, the role will comply with requirements as defined by Rail Safety National Law National Regulations 2012 and the project specific requirements regarding “rail safety work”.Note: you may be required to undertake a formal Competency Assessment and further Rail Safety Training if required under the Contract Conditions.Responsibilities of this role may include:Review RAM related contract requirements and prepare suitable strategy and approach to achieve those requirements.\n\nPrepare RAM Assurance Reports\n\nProvide RAM including Accessibility advise, guidance and/or assurance to Designers or Project Stakeholders\n\nFacilitate reliability workshops with project stakeholders.\n\nConduct RAM modelling during design development.\n\nActively participate in achieving engineering and project milestones within the project schedule\n\nUndertake RAM related Verification and Validation activities.\n\nContributing to design reviews, workshops, integration, test and site installation activities\n\nActively participate in Type Approval as required.\n\nDevelop RAM Management Plans\n\nEnsuring that RAM related activities follow the appropriate methodologies defined in project RAM Management Plans\n\nWorking as part of a project or bid team for and of delivery mission-critical capability.\n\nLiaising with customers, end-users, subcontractors and suppliersQualificationsMaster of Engineering degree (or equivalent education) in an appropriate engineering discipline from an accredited college or university.\n\nChartered Engineer (CEng), or Professional Engineer (PE) license or equivalent in the relevant field from any global organization (e.g., Institution of Civil Engineers, UK) or equivalent experience in RAM Related functional area\n\n8+ years of experience\n\nA strong background in RAM Engineering\n\nPractical experience in all phases of the EN50126 life cycle.\n\nPractical experience in RAM Management and the use of relevant tools.\n\nExperience of integration, verification, validation, qualification engineering\n\nA high level of interpersonal and communication skills, as well as the ability to work as part of a multidisciplinary team.Preferred Qualifications:Experience in RAM modeling, test design techniques, design for reliability techniques, predictions, reliability growth management, requirements generation, software and specification inputs.\n\nExperience in the use of RAM calculation tool suites like Windchill or Item ToolkitOur ideal candidate will have the following personal attributes:Initiative, motivated & self-driven.\n\nRelationship builder who can communicate at all levels.\n\nTeam Focused.\n\nCommunicates honestly, openly and consistently\n\nAble to evaluate information quickly, identifying key issues and formulate conclusions based on sound, practical judgement, experience and common sense.Additional InformationAbout AECOMAECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.Freedom to Grow in a World of OpportunityYou will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.All your information will be kept confidential according to EEO guidelines.ReqID: J10087258Business Line: TransportationBusiness Group: DCSStrategic Business Unit: Enterprise CapabilitiesCareer Area: EngineeringWork Location Model: HybridJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}