{"Job ID": "69869999", "Description": "Bosch Global Software Technologies (BGSW), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.\n\nWith over 19,500 associates, BGSW is the largest software development center of Bosch outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence in US, Europe and the Asia Pacific region. BGSW is ISO 9001:2008 certified (2012), appraised at CMMI-L5 as per version 1.3 (2011), ASPICE - level3 based on version 2.5 and ISO 15504- 5 and 7, and also ISO 27001 with seven state-of-the-art facilities spread across Bangalore, Coimbatore, Pune and Hyderabad in India, Ho Chi Minh City in Vietnam and Guadalajara in Mexico, ISO/IEC 20000-1:2011 certified (2014).\n\nWe nurture, build and sustain enduring customer relationships to enable direct operational and strategic benefits to our customers. We make it happen through qualified, motivated and flexible professional associates, who uphold the heritage and values of Bosch - time-tested over 125 years of a successful journey; a journey marked by quality, reliability and innovation of service to enhance the interest of our customers and the community we live in.\n\nWe provide solutions for businesses in primarily three areas:\n•Engineering Services\n•IT services\n•Business services\n\nOur focal industries:\n•Automotive industry\n•Industrial Technology\n•Consumer Goods and Building Technology.Generally responsible for assigned Cyber Security SW control for Occupant Safety System – Airbags ECU project. Application software development in compliance with Security Engineering Process and customer requirements.Responsibilities include:General Definition of architecture of assigned SW components (including architectural design decisions and component documentation) in a way to achieve high re-use\nMaintenance of assigned SW component\nPlanning of SW component extensions\nRequirements Development (RD) for the assigned components. SW-FR has typically the Role of ReqDev: Requirements Developer for SW-ProjectsSW component modelDecomposition of SW components/functionalities into sub-components\nDefinition of variation points in core asset SW concerning the assigned SW component (e.g. for customer specific extensions)\nContact person for allocating functionalities to the assigned SW component Interface management Contact person for interfaces concerning the assigned component Miscellaneous Internal trainings/presentations for assigned SW components\nContact person for SW mentor concerning integration issues\nTracking of component-specific defects and tasks to closure \nSupport analysis of Requirements based verification tracking results (SW)Knowledge and skills SW system knowledge\nSW Architecture knowledge \nAutosar Architecture & crypto components\nUsage of crypto libraries, hardware security module and PKI\nMust be able to learn, understand, apply and work in new technologies / abstract concepts\nSelf-motivated individuals who can manage shifting priorities and be flexible\nAbility to work Independent as well as a good Team Player\nStrong written and oral Communication skills\nStrong Interpersonal skills\nCustomer Interaction & stakeholder managementTools Knowledge DOORS (Requirement Management Tool)\nALM-CCM/CQ (Change Management Tool)\nALM-SCM/MKS (Software Configuration Management Tool)\nRhapsody/AMEOS (Software Design Tool)\niSTAr\nCompiler, linker and debugger\nQAC\nVectorCast\npure::variantsB.E / B.Tech in Electronics & Communication / Electrical & Electronics / Computer Science  / Automotive Electronics•Strong communication skills\n•Experience on Problem and Change request Management\n•Strong commitment and desire to learn and grow\n•Strong knowledge in requirements engineering and be able to deep dive into topics\n•Good knowledge in Agile methodologies\n•Good knowledge of Embedded System\n•Experience: 5-10 yearsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}