{
    "Job ID": "69867988",
    "Description": "At Turner & Townsend we’re passionate about making the difference. That means delivering better outcomes for our clients, helping our people to realize their potential, and doing our part to create a prosperous society.Every day we help our major global clients deliver ambitious and highly technical projects, in over 110 offices worldwide. #LI-HT1Principal AccountabilitiesBe responsible for the entire contract procedures cycle for assigned work packages from initiation including:Identifying right clauses to be included in the contract based on the project procurement and design risk in particular\nReview and provide inputsOverviewing the post contract administration cost and contract management function\nLiaising with group support functions such as finance, legal and insurance.\nLiaise with functional specialists in engineering, construction, HSE.\nDevelopment of appropriate incentive schemes for individual Contract scopes\nThe provision of advice and counsel on contractual, commercial, taxation, insurance and legal issues\nEnsure appropriate approvals for spend are obtained prior to commitment\nKnowledge of and compliance with appropriate Shell C&P, business, and ethic processesExperienceProven civil construction contract development experience is essential, as is the ability to work effectively in a multi-cultural diverse environment. The ability to demonstrate knowledge, capability and competence in the following commercial, technical and interpersonal aspects is required:Knowledge of the commercial and legal management of the issues and risks arising from the performance of civil construction contracts\nDevelopment and Implementation of Contract processes to deliver best value to the Project.Key Success Factors:Deliver awarded contract within agreed project timelines\nSpecification / review of scopes of work and contract documents and management of contracts to minimize claims and variation requests\nProven record of involvement with multi-national and multi-cultural teams. #LI-HT1Adherence to procurement rules and approval processes.Your knowledge, skills & Qualifications will include:Contract development tendering and management of high value multi $100+ million civil construction contracts.\nExperienced in negotiating and awarding major engineering and construction contracts\nFluent in English – written and spokenAnd ideally:Business or technical degree or equivalent qualified\n15 years professional experience with minimum 5 years Project Contracts experience with large $100+million offshore civil construction contracts formation, award, administration and management.\nExperience in construction contracts within the oil and gas industry.\nExperience in contract formulation activities, systems and processes coupled with a working knowledge of engineering, fabrication and construction practices.\nExperience of working in similar environments\nKnowledge of business and contracting environmentEducation - B.E/B.Tech (Civil)You should have relevant experience of working preferably for a construction consultancy in India/abroad, hold a graduate degree preferably in Cost Management and possesses good technical skills.A fair understanding of the total project life cycle, procurement and through understanding on types of Contracts and FIDIC in particular, Commercial management,15+ years work experience with demonstrated career growth graph.Experience in multiple sub sectors within the property projects will be added advantage. #LI-HT1Who is Turner & Townsend?All over the world people are using buildings, infrastructure, and assets we helped to deliver. It could be the hospital they work in, the railway they travel on every day, the fuel that powers their car or the data centre they depend on at work. For more than 75 years we’ve been helping to deliver transformational programmes across the real estate, infrastructure and natural resources sectors, making a difference to people’s lives and ensuring a return on investment for our clients and their investors.Our purpose:Transforming performance for a green, inclusive, and productive world.The world is changing and we have a responsibility to support that change, helping drive it and be part of it. Through the commitment, capability and care our team brings, we build trust between clients, suppliers, governments and society. Delivering better outcomes that have a positive impact on the world around us. We work smarter to face the challenges of the future; bringing the clarity that helps teams realise their full potential across the real estate, infrastructure and natural resources sectors. It’s how we’ve made the difference for more than 75 years.Our values:Love a challenge: We love a challenge and we work hard to make change happen and see things through. We don’t stand still, challenging ourselves and others to do better every day. And we are trusted to do the right thing, raising standards all the time.Stronger together: We’re stronger together by connecting people in diverse teams, so that we can all collaborate to deliver our best work. We focus on what matters and use our influence to build a better world for everyone.Bring out the best in everyone: We bring out the best in everyone. We help each other to make the most of our potential, always learning from our experience. We treat each other with care and respect and make time to give everyone a voice #LI-HT1Join our social media conversations for more information about Turner & Townsend and our exciting future projects: TwitterInstagramLinkedInIt is strictly against Turner & Townsend policy for candidates to pay any fee in relation to our recruitment process. No recruitment agency working with Turner & Townsend will ask candidates to pay a fee at any time. Any unsolicited resumes/CVs submitted through our website or to Turner & Townsend personal e-mail accounts, are considered property of Turner & Townsend and are not subject to payment of agency fees. In order to be an authorised Recruitment Agency/Search Firm for Turner & Townsend, there must be a formal written agreement in place and the agency must be invited, by the Recruitment Team, to submit candidates for review. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Delhi, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}