{"Job ID": "69866993", "Description": "About Freshworks\n\nFreshworks makes it fast and easy for businesses to delight their customers and employees. We do this by taking a fresh approach to building and delivering software that is affordable, quick to implement, and designed for the end user. More than 50,000 companies -- from startups to public companies -- around the world use Freshworks software-as-a-service to enable a better customer experience (CRM) and employee experience (ITSM, HRSM).\nHeadquartered in San Mateo, California, Freshworks has a dedicated team operating from 13 global locations to serve 50,000+ customers including Bridgestone, Chargebee, DeliveryHero, ITV, Klarna, Multichoice, OfficeMax, TaylorMade and Vice Media.\n\nFreshworks transforms the way world-class organizations collaborate with customers and co-workers. The suite includes Freshdesk (omni-channel customer support), Freshsales (sales automation), Freshmarketer (marketing automation), Freshservice (IT service desk), Freshteam (HR management system).\nFreshworks has received numerous accolades including 2019 Startup of the Year form Economic Times, #16 ranking on the Forbes’ Cloud 100 list and #22 on the Battery Ventures/Glassdoor Best Places to Work in 2020. Our suite of products has also been recognized by analysts including the Gartner Magic Quadrants for CRM Customer Engagement, IT Service Management and Sales Force Automation.\n\nWhile Freshworks has had incredible organic growth over the last few years, the company also has made targeted acquisitions that add critical capabilities to the portfolio including Natural Language Processing, Chatbots, Machine Learning, Social and Messaging Transformation.\nFreshworks has raised over $400 million in capital and is funded by Accel, CapitalG, Sequoia Capital and Tiger Global Management. More information is available at www.Freshworks.com.\n\nAt Freshworks, we are creating a global workplace that enables everyone to find their true potential, purpose and passion, irrespective of their background, gender, race, sexual orientation, religion or ethnicity. We are committed to providing equal opportunity for all and believe that diversity in the workplace creates a more vibrant, richer work environment that advances the goals of our employees, our communities and our business.The Sales Compensation Analyst will report into the Manager of Sales Finance and will be responsible for deriving the commissions for direct, indirect and overlay sales roles on a global level; including channel partner.\n\nKey DeliverablesBe part of the team which provides support for all sales segments, regions and channels i.e. both direct and indirect\nCalculate monthly, quarterly, and annual commissions through Sales Commission software tools for multiple business units according to compensation plans and internal policies, ensuring commission and bonus calculations are done accurately and in a timely manner\nPartner with cross functional teams to onboard sales new hires, manage role changes, quota, and build and route compensation plans via Sales Commission software tools\nResearch and resolve attainment and commission questions, including calculating and processing adjustments for commissions\nWork with sales management, Finance and revenue operations on design and implementation of new sales plans\nPartner with accounts receivable team on clawback process and effectively communicate the process to the sales rep\nWork with payroll for timely inputs for payroll processing for GTM organization\nResearch and resolve any discrepancy or issues raised by Sales Teams\nManage partnership, Channel and ISV partnership programs\nPerform analyses, reconciliations, and ad hoc reporting as directed\nEnsure compliance across the process and provide support for audit requirements1-3 years of proven work experience in sales commission & incentive process in software/ITES organizations\nStrong MS Excel and Google docs skills and experience\nExperience with sales compensation tools/software\nExcellent analytical skills along with the ability to create and present detailed reports\nAbility to accurately process numerical data\nExperience interpreting data analytics to derive business insight and drive business value.\nHigh level of integrity where personal and professional values are aligned with the company’s mission, vision and leadership framework.\nBachelor’s degree in Finance or Operations\nSaaS experience is a plusAt Freshworks, we are creating a global workplace that enables everyone to find their true potential, purpose, and passion irrespective of their background, gender, race, sexual orientation, religion and ethnicity. We are committed to providing equal opportunity for all and believe that diversity in the workplace creates a more vibrant, richer work environment that advances the goals of our employees, communities and the business.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}