{"Job ID": "69865831", "Description": "The digital support manager will be in charge of the below tasks on a regular basis –Suggest ideas for the digital and e-commerce strategy while also contribute towards the creation of the strategy document(s)\nFollow up with various teams and stakeholders on strategic initiatives to ensure they conclude on time while achieving the expected qualitative output\nExtract data and analyze it with the support of the line manager. Suggests analysis worth conducting.\nTimely and qualitative execution of website content and conversion optimization projects. With the help of the line manager, identify areas of improvement in the website performance, using gathered data\nRegularly perform benchmark of other digital channels and highlight key insights to the management\nWith the help of the line manager, create insights from digital data, to help the department better understand digital channel visitors\nProduce accurate and timely reporting. Maintain existing tools and build new tools on demand. Suggest new reporting.\nExecute data collection projects and perform checks when required\nIdentify technology gaps and assess technology needs with the help of the line manager\nReport and summarize technology trends benchmarked on request\nUnderstand overall technology environment and how it impacts the digital channels and end customers\nUnderstand our audience and actively participate in UX and UI projects\nParticipate and report back on internal testing of digital releases\nOrganize and report on end customer testing of digital releases\nGive clear and precise requirements to IT to deliver projects and manage delivery\nDevelop win-win partnerships with both internal and external stakeholders that support the delivery of projects\nEngage with e-commerce teams of other assets on Yas Island, when required by line manager to deliver a project\nChallenge content provided to ensure it is compelling. Deliver content updates and edits within the timelines provided\nProactively perform assessment to recommend fixes\nGive clear directions on expected content for the web pages\nExecute digital marketing campaigns actions as instructed and alert on gaps between the acquisition strategies and the content and experience available on digital channel \nExecute CRM actions as per instructions and ensure quality of the CRM execution\nExecute SEO/SEM configuration as per instructions and alert on any identified gaps\nMaintain existing tools and coordinate implementation of new ones in autonomy\nRaise purchase requests on-time, with all required information and track in autonomy procurement process for procurement to be delivered in a timely manner\nAdopt a positive attitude and embrace department cultureMINIMUM QUALIFICATIONS, EXPERIENCE AND SKILLS REQUIREMENTSQualificationsEssential:Minimum Bachelor's degree in marketing or digital marketing\nDemonstrable experience leading and managing initiatives related to ux/ui, development, SEO/SEM, CRM, email, social media, digital strategy and analytics\nWorking knowledge of enterprise CMS’ and GA4\nKnowledge of the latest SEO strategies and techniquesDesirable:Experience with basic coding / code analysis is an advantage\nExperience in using Invision, Adobe XD or Figma or Sketch is an advantage\nExperience in Adobe Creative Cloud apps is an advantage\nFluency in English is a must and Arabic is an advantage but not mandatoryYears of ExperienceEssential:3-5 years of experience of digital marketing ideally in travel and leisure industry (on the agency or client side)SkillsEssential: Ability to simplify and share technical discussions to business teams and vice versa\nAbility to foster professional relations across various brands and functional teams within the destination\nAbility to craft and present impactful presentations\nAbility to craft UX / UI / Dev agency briefs\nAbility to work in a multi-cultural, multi-geography environmentDesirable: Avid leisure traveler & digital consumerBEHAVIORAL COMPETENCIESCreate Smiles\nShare What You Know\nDeliver Excellence\nWork as One\nLeads With a Shared Vision\nBuild Proactive PartnershipsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}