{"Job ID": "69869821", "Description": "About PayUPayU, a leading payment and Fintech company in 50+ high-growth markets throughout Asia, Central and Eastern Europe, Latin America, the Middle East and Africa, part of Prosus group, one of the largest technology investors in the world is redefining the way people buy and sell online for our+ merchants and millions of consumers. As a leading online payment service provider, we deploy more than 400 payment methods and PCI-certified platforms to process approximately 6 million payments every single day. Thinking of becoming a PayUneer and you are curious to know more about us? Read more about the life in PayU here We are seeking a Manager / Sr. Manager – Consolidation and Financial Reporting for the India Business. The Group Financial Controller will lead the Control, Compliance, Audit and Tax agenda.This responsibility of this role would also scale-up with growth in the Business.Accounting, Reporting and AuditsAccounting and Reporting: Assist in review of Quarterly/annual Consolidated financial statement and Standalone Financial statement of Group Companies to meet global and statutory requirements as per IFRS and Indian GAAP.\nEnsure timely and correct financial reporting and seamless statutory audit thereof.\nAccounting for new transactions including preparation of accounting memos and provide guidance on accounting & reporting matters across Group.\nRevamping of Financial Statements for IPO readiness.\nStatutory, Tax, Statutory & Internal audits: Liasoning with auditors and internal teams to ensure compliances within expected timelinesSoX / IFC implementation and ongoing CompliancePreparation / Review of process documentation and Risk Control Matrix (RCM) of all the Group Companies for IFC / ICFR Compliance.\nMonitor IFC / ICFR compliance ongoing basisESG implementation and BRSR readiness & ReportingImplementation of ESG framework for PayU India group companies.\nReadiness for BRSR preparation & reportingGovernance / Compliances / Secretarial:Statutory: Ensuring compliance to all other statutory requirements including FEMA/RBI, MSME, Company Law etc\nInternal financial & other SOPs and board guidelines: Ensuring Adherence to corporate/group financial policies and board requirements\nUpdate Audit Committee on critical Accounting, Financial Reporting and Controls Matters\n Designing Process and Automation: Develop and document business processes and accounting policies to maintain and strengthen internal controls\nSecretarial compliances: including but not limited to collaborate with CS team for conducting Board Meetings, Annual General Meetings, MCA forms and filings, etcOther responsibilities:Involve in projects related to business development and improvement of finance processes.\nDrive Strategic projects around Legal entity structure changes etc.Education QualificationCA with 7-10 years of experience into Financial Accounting & Reporting, SOX Compliance Implementation.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}