{
    "Job ID": "69866849",
    "Description": "Come help us create a better everyday life for the many people. That’s the IKEA vision. We do that by offering a wide range of home furnishings with good design and function at prices so low that as many people will be able to afford themPurposeAs the Insights and Analytics Manager at IKEA Saudi and Bahrain, you will play a crucial role in driving data-driven decision making, enabling effective marketing strategies, and maximizing business performance. You will lead a team responsible for collecting, analyzing, and interpreting data, providing actionable insights across customer, consumer, brand and market to support the growth of IKEA in the Saudi and Bahrain markets. This position demands a combination of exceptional analytical skills, strategic thinking, and the ability to effectively communicate insights to key stakeholders.AccountabilitiesLead and manage a team of Specialists to ensure the delivery of accurate and valuable insights to support business objectives.\nDevelop and implement a comprehensive analytics strategy aligned with the overall marketing and business objectives.\nCollaborate with cross-functional teams (Marketing, Sales, Finance, etc.) to understand their data needs and ensure that insights provided address key business challenges.\n Promote a data-driven mindset within the organization by educating stakeholders on the value and benefits of using data and insights to drive decision making.\nConduct advanced analysis of internal and external data sources to identify trends, opportunities, and insights that can inform marketing strategies and initiatives.\nMonitor and analyze market trends, customer behavior, and competitor activity to identify growth opportunities and potential risks.\nDevelop and maintain key performance indicators (KPIs) and performance dashboards to track the effectiveness of marketing initiatives and measure return on investment (ROI).\nDrive the implementation of analytics tools and technologies to enhance data collection, analysis, and reporting capabilities.\nStay updated on industry best practices, emerging trends, and technological advancements in the field of analytics and data management.\nPresent findings, insights, and recommendations to senior management and other key stakeholders, effectively communicating complex information in a clear and concise manner.Bachelor's degree in Business, Marketing, Statistics, Analytics, or a related field. Master's degree preferred.ExperienceMinimum of 8 years of experience in a similar role, preferably in a retail or consumer goods industry.\nProven experience in leading and managing a team of analysts, guiding their development and ensuring high-quality output.\nStrong analytical and problem-solving skills, with the ability to derive insights from complex data sets.\nProficiency in statistical and data analysis tools such as Excel, SQL, and statistical software (R or Python).\nIn-depth knowledge of data management, data visualization, and reporting tools (e.g., Tableau, Power BI); along with practical experience with Customer Data Platforms.\nFamiliarity with digital marketing analytics, including online customer behavior tracking and web analytics tools (e.g., Google Analytics).\nPreviously led and conducted customer segmentation, consumer and market research studies is a plus.\nExcellent communication skills, with the ability to effectively present and articulate insights to stakeholders at all levels of the organization.\n Strong business acumen and understanding of market dynamics, customer trends, and competition.\n Ability to thrive in a fast-paced, dynamic environment, managing multiple projects and deadlines with attention to detail.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}