{
    "Job ID": "69866296",
    "Description": "Field Sales - AgadirWould you like to be part of the most international company in the world? A company operating in more than 220 countries worldwide and has been pioneering cross-border express shipping since 1969.  Would you like to be part of a business that connects people across the globe and want to make a difference? Then waste no time and join our amazing team at Deutsche Post DHL (DPDHL). DHL Global Forwarding, Freight (DGFF) is the Group's air, ocean, and road freight specialist. We offer standardized transport as well as highly specialized end-to-end solutions to customers in a wide range of industries globally.DHL Global Forwarding has an opening for Field Sales in  Agadir. In this specific position you will have the primary duty to achieve personal target according to budget and to achieve high KPI score necessary for payout. Under supervision support field sales plans and processes to achieve revenue growth, enhance customer retention and acquisition, and increase lead conversion for a defined geographic region, product line or market segment in line with business strategy, financial objectives, Group guidelines and policiesJoin us in connecting people and improving lives!In this Field Sales - Agadir positionYou will have to develop and maintain strong existing customer relations and loyalty through ensuring customers satisfaction.\nYou will interface with customers to respond to questions, requirements and expectations.\nYou will have to identify/Work/Close Key Target customers together with local TLM & Vertical Managers.\nYou will have to coordinate with internal marketing colleagues to bring opportunities to deal closure.\nYou will have to maintain close cooperation with Operations & Products.\nYou will have to make sure he/she is actively selling all services under the umbrella of the organization\nYou will have to develop relationship with external Stakeholders (Industrial Development Agencies) and other regulatory agencies that stimulate economic development\nYou will have to monitor the competition, obtain competitive information and share with other DHL stakeholders.\nYou will have to build rapport and credibility with management, sales and operations departments.\nYou will have to make sure he/she are very knowledgeable with product details.\nYou will have to support Sales Support through aggressive “Sales Lead” Programs.\nYou will have to develop key tools needed to support customer capture of new opportunities.\nYou will have to identify/develop Market new products & services.\nYou will have to provide administration support .Now, here’s what we need from youMinimum 2 years’ experience in Sales \nSales ability and demonstrable full knowledge of the sales process.\nConfidence in presenting technical and marketing data to clients and colleagues.\nExcellent organizational and time management skills.\nKnowledge of business, services, practices and company policies and procedures.\nConfident negotiator and ability to close the deal.\nGeneral understanding and use of word processing, spreadsheets/databases, presentation software and internet.We offer:Opportunities in a global company where you can contribute your ideas and skills to move towards our shared goals.\nPossible further career development\nCompetitive salaryWhy join DHL Global Forwarding?We are part of Deutsche Post DHL, the world’s leading logistics provider with operations in over 220 countries. Visit our career site on the web at https://www.logistics.dhl/us-en/home/careers.htmlOur TOP EMPLOYER prestigious certification attests to our best-in-class efforts to attract and retain talent by fostering a positive work environment and encouraging personal and professional development among employees. The development of talented women in our organization will be a focus for us and an important part of our DGF Strategy 2025. We aspire to become the undisputed leader in our industry, when people think of forwarding; we want them to think DGF because we have:The largest global network with more than 30,000 passionate employees\nThe most efficient processes and fastest response times\nThe best solutions and best customer serviceOur Vision: The Logistics Company for the World.Our Mission: Excellence. Simply Delivered.\nOur Purpose: Connecting People, improving lives.\nOur Values: Respect & Results\nOur Goals: Employer, Provider, and Investment of Choice, Living ResponsibilityDHL Global Forwarding is an equal opportunity employer.  We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}