{"Job ID": "69866969", "Description": "Location: Aden, YemenContract type: Full time, fixed term contract – 1 year renewable (project currently funded until 2027)Reports to: Chief of PartyDirect Reports: Programme Coordinators, Grants Officers and Gender and Inclusion SpecialistClosing date: 29th September 2023ARK is a social enterprise, empowering local communities through the provision of agile and sustainable interventions to create greater stability, opportunity and hope for the future.We believe that strong, resilient communities are the foundation of local, national, regional and international development and stability – and ultimately a safer, peaceful and more prosperous world. At ARK, we have delivered research and programmatic interventions validating this approach in over twenty countries since 2008. As a social enterprise we work in partnership with communities, our donors, and other implementers to build local capacities, generate opportunity and bring about sustainable change.Learn more about our impact here: https://www.ark.international/impactWho are we looking for?ARK is recruiting a Deputy Chief of Party to demonstrate strong leadership, offering clear guidance, and showcasing a steadfast commitment to advancing peacebuilding and fostering community resilience in Yemen.We are currently executing two programs funded by USAID in the governorates of Abyan, Aden, Al-Dhali’, Hadramout, and Lahj in Southern Yemen.The USAID “Building Peace in Yemen” program partners with communities in rural Yemen to address root causes of land and water conflict, especially water scarcity, by promoting water conservation, particularly in agriculture, and facilitating community-led climate change resilience planning. The program will promote dialogue, mediation, and resolution of existing land and water conflicts, with an important focus on those between groups in conflict.The USAID “Yemen Community Resilience” program also partners with local civil society and community-based organisations, especially those led by women, to strengthen community cohesion and child protection through direct support as well as through health and social service referrals.As Deputy Chief of the Party (DCoP), you will support the Chief of Party (CoP) in the strategic and operational management of these two programs. You'll play an integral part in ensuring that community awareness, prevention mechanisms, reconciliation, and economic empowerment initiatives are executed effectively. As the primary focal point for the program implementation, you'll oversee the day-to-day execution of work plans and ensure all activities align with ARK's mission and USAID's objectives.What you'll be doingProgram ImplementationCollaborating with the COP to manage resources and technical implementation\nLeading work plan preparation and overseeing its execution, reporting challenges to the CoP\nManaging program deadlines, milestones, and progress reports.\nEnsuring program delivery quality and supporting “budget versus actual” reviews.\nCoordinating with program teams for accurate measurement, monitoring, and evaluation.\nWorking with a Third Party Monitoring team on monitoring activities, including field visits at Data Quality Assessments.Partnerships ManagementAssisting the CoP in maintaining strong relationships with stakeholders.\nOverseeing the selection and due diligence, and subsequent monitoring and capacity building of subrecipients.\nSupporting in subaward close-outs and lesson documentation.Capacity Building and SupportProviding mentorship and training to implementation staff to enhance programs’ performance in delivering field activities.\nBuilding capacity of formal and informal local community leaders, organisations, and networks to meet program objectives, including the people-to-people program principles, child protection, and community-led conflict mitigation.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Aden, Yemen", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}