{"Job ID": "69866593", "Description": "Role PurposeHandling the team of Reconciliation Analyst and Specialist and ensure all reconciliation are prepared with in stipulated timeline and as per IHG guidelines. Ensure that the integrity of all work and interactions with customers are completed in accordance with IHG policy and procedures and compliant with Sarbanes Oxley legislation. Mentoring and coaching of Analyst, Senior Analyst and Specialists. Providing them operational support as and when required.Key AccountabilitiesCompletion of Bank Reconciliation as per the agreed timelines and accuracy\nCoordinating with Group Treasury, preparation of Cash flow, accurate processing or Wire payments\nOversees the month-end close processes to ensure timely and accurate completion.\nTo give value to the organization in terms of better utilization of manpower/better quality of output.\nTakes logical decision quickly, change priority to meet expectation & always accommodative to new responsibility. Ready to take proactive action when required\nAssessing training needs for team & organizing the same and ensuring all members are cross trained & Back-up plan is in place.\nResponsible for coordinating & providing the entire infrastructure related requirements for the team including IT accesses.Key Skills & ExperiencesEducation & Experience -CA/CWA/MBA (F) with 2 years of experience or M. Com/CA(I)/CWA (I) with more than 3 yrs. experience or B. Com with more than 5 years of Finance & Accounting experience.Technical Skills and KnowledgeAccounting Knowledge: Good Knowledge of Accounting Principles and concepts and the ability to apply them to the company's Accounting practices.\nSystem Knowledge: Good knowledge of the relevant IHG systems like People soft, Essbase etc.Other SkillsCommunication - Possess good communication skills.Flexibility -Flexible to work in multiple shiftsAbility to work in cross functional teamsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}