{"Job ID": "69865855", "Description": "Join our JourneyPetrofac is currently looking to recruit a Senior Designer-Telecom to be based in ChennaiWhat we doPetrofac is a leading international service provider to the energy industry, with a diverse client portfolio including many of the world’s leading energy companies.We design, build, manage and maintain infrastructure for the energy industries. Our comprehensive and tailored service offering covers each stage of the project life cycle and a variety of commercial models, giving our clients the flexibility, they need.Equal OpportunitiesWe recruit, reward, and develop our people based on merit regardless of race, nationality, religion, gender, age, sexual orientation, marital status, or disability. We value our people and treat everyone who works for or with Petrofac fairly and without discrimination.Petrofac is striving to develop a diverse and inclusive culture where everyone can contribute. We encourage everyone to apply, especially those individuals who form part of underrepresented groups. Applications are also welcome from candidates who want to discuss flexible working or job-sharing requests.ScopeGuide and lead the overall design, modeling and drafting activities for projects depending upon the complexity and size, carry out FEED and /or Proposal work estimates, procurement support activities , support for fabrication and construction requirements.Minimum requirement8+ years of Industry experienceJob ResponsibilitiesShall perform as Lead Designer with block building and fabrication yard experience.\nShould be able to read and understand the specification and European regulations and shall be able to implement those regulations during the project execution.\nExtensive layout and 3D modeling experience, able to coordinate complete inputs for layout Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}