{
    "Job ID": "69866582",
    "Description": "If you need assistance during the recruiting process due to a disability, please reach out to our Recruiting Accommodations Team through the Accommodation Request form. This form is used only by individuals with disabilities who require assistance or adjustments in applying and interviewing for a job. This form is not for inquiring about a position or the status of an application.Software Development Engineer III (Frontend)Do you want to transform the experience of millions of travelers the world over? Do you love working with a creative engineering team in building an intelligent, scalable, and personalized travel assistance platform? Do you want to create a world-class React web application with a rich and intuitive user interface that will be used by business partners in the travel industry? Our goal is to build the best portal experience for the conversational bot platform that can allow easy management for our business partners.As a Front-end Software Development Engineer, you will prototype, design, and implement various portal capabilities in collaboration with teammates. You would have experience building and supporting public-facing web applications which are interactive, performant, and at scale.Key technologies we use:Required: React, Redux, Javascript, Node.js, HTML, CSS\n\nPreferred: AWS, Git, Splunk, Jenkins(modern build systems), ExpressWhat you'll do:Participate in the design, development, and deployment efforts of multiple enterprise application projects to solve complex business problems\n\nOwn and deliver tested and optimized high-performance code for public-facing, enterprise web portals applications\n\nParticipate in the resolution of production issues and develop solutions to prevent future issues from happening again\n\nCollaborate with Team Developers, Program Managers, Testers, and Production Support Engineers in an agile development environment\n\nTeach and mentor junior developers in project implementation methodologyWho you are:Bachelor’s or Master's in a related technical field; or equivalent related professional experience\n\n5+ years of experience in software development\n\nApplies software design principles, data structures and/or design patterns, and computer science fundamentals to write code that is clean, maintainable, optimized, and modular with good naming conventions\n\nA self-starter who delivers/owns software end to end with little oversight\n\nIs good at documentation, whether code or technical docs\n\nUnderstands the Importance of collaboration and proactively reaches out intra/inter teams to solve problems\n\nHave an eye for monitoring and testing\n\nStrong verbal and written communication skills\n\nContributions to open-source projects would be a plusAbout Expedia GroupExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.© 2021 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50Employment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals to whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.Expedia iscommittedto creating an inclusive workenvironmentwith a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, gender, sexual orientation, national origin, disability or age.About Expedia GroupExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.© 2021 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50Employment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals to whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}