{
    "Job ID": "69868511",
    "Description": "Relationship Manager, Private BankingSome careers shine brighter than others.    If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you furtherWealth and Personal Banking is our new global business combining Retail Banking and Wealth Management; and Global Private Banking, to become one of the world’s largest global wealth managers with USD1.4 trillion in assets.  Our dedicated colleagues serve millions of customers worldwide across the entire spectrum of private wealth, ranging from personal banking for individuals and families, through to business owners, investors and ultra-high-net-worth individuals.  We provide products and services such as bank accounts, credit cards, personal loans and mortgages, as well as asset management, insurance, wealth management and private banking, that best suit our customers’ needs.We are currently seeking an ambitious individual to join our Wealth and Personal Banking team, working together with colleagues to define, manage and achieve divisional business targets.In this role, you will:•    The Relationship Manager (RM) is in charge of managing and developing a client’s portfolio, participating in the Team’s organization and ensuring appropriate administrative support•    Provides full-service banking and all transactions to high-net-worth individual clients through the marketing of all appropriate company services•    Establishes new relationships and manages existing relationship in order to generate new AUM, Revenue and enhance ROTCP (return on total client position) and ROA (return on assets)•    Co-operates with platform manager to clear pending items, improve quality and resolve problems•    In addition to establishing new client relationships, also manages the migration of clients from Premier Wealth into GPB HBME and ensures smooth transition to increase client retention and profitability.•    Effectively delivers the firm to the client by cross selling products such as mortgages, car loans etc.•    Grow revenue, increase AUM of portfolio and increase inflows of net new money (NNM), achieving growth by leveraging brand, channels and RM network•    Has regular contact and meetings with clients•    Ensures client’s objectives are met through an appropriate selection of products within the client portfolio•    Ensures clients are aware of their level of risk•    Researches account and transaction records to resolve basic discrepancies, answer questions, or provide documentation on client activities•    The role is set in the new HBME GPB business, therefore operating in line with global GPB standards, products and proposition, in addition to the Central Bank regulations. •    Business vision, understanding of priorities, respect of procedures and regulatory and legal environment•    Compliance and risk awareness, Networking power•    Efficient partnership with senior management as well as other join-up business groupsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}