{"Job ID": "69869834", "Description": "Seamedu - School of Pro Expressionism is a full fledge media school based in Pune, founded in 2008 to produce world class talent in Media & Entertainment (M & E) fields of Digital Film making, Animation, Game Design, Visual Effects, Sound Design, Broadcast Media, and Broadcast Journalism. Seamedu is the type of institute that nurtures the creativity of the students. Seamedu has been awarded by the Government of Maharashtra in IT & IT related Fields-Multi - media/ Entertainment/ Gaming. Seamedu also has campuses in Bangalore, & Delhi. To know more about us, please visit – www.seamedu.comIndustry: EducationFunctional Area : Visual Effects and Game ArtJob Description:The candidate must be a very strong in Fine art, Concept Art and 2D Animation skills. Candidate with 3-5 years of Industry or teaching experience is eligible to apply for this post. Will be responsible to handle all Art related and 2D animation subjects for B.Sc Visual Effects & Animation / B.Sc Game Art & Design. Must be interested in creating professional student projects and portfolios.Specific Skill Set:-         Should have good experience in teaching Fine Art & Concept Art.-         Should have good experience in teaching 2D Animation (Adobe Animate CC).-         Should have knowledge of different Art styles.-         Initiate Art projects which can be integrated with Game & VFX.-         Good communicator (both oral and written) in English.-         Should demonstrate positive attitude, high motivation, and interpersonal skills.-         Should have worked on pre-production for commercial company / freelance projects.Any other skill set:Experience in working / teaching designing software like Photoshop / Illustrator.\n Knowledge of 3D software (Maya, Z-Brush) beneficial.\n Knowledge of Photography.Minimum/ Work Experience Required:3-5yearsAnnual CTC: Not a Constraint for right personLocation(s) of Job:Pune (ADYPU DY Patil Knowledge City Road Via Lohgaon, Airport Rd, Charholi Budruk, Pune, Maharashtra 412105)Minimum Education Requirements: Bachelor’s degree in Fine Art / Animation or equivalent education with relevant experience.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}