{
    "Job ID": "69866153",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Assistant Finance ManagerWork DynamicsWhat this job involves:The AFM will be responsible for managing the client finance activities for PAN India local accounts. Includes month end closing, communications, accruals, reconciliations etc. He / she is also responsible for program managing and administrating any system changes and access management.  MAJOR RESPONSIBILITIESEnsure all the month end related activities are completed in time and companies are rolled over without any issues\nEnsure timely communications to the account team related to month end and other process\nOversee the NDC collection status, reconciliations\nFirst level reviewer for the CAAPS and JDE KPIs including open PO, GRNV, UMLV etc\nFirst point of escalation related to any client finance process\nApprover for any system access requests and invoice deviations like deletion, void payment etc\nAccountable for data management of JDE BUs and PS code mapping\nAccountable for preparing KPI dashboards from the APAC health dashboard for PAN IND\nManage the client billing team and ensure client invoicing are happening without any delays\nSupport for audit queries and provide the supporting documents if anySound like you? To apply you need to have:Smart and experiencedYou have a degree in finance, accounting certification preferred with at least 7-10 years of experience. You are able to think strategically, solve problems, make decisions and manage your key stakeholders. You will have a real passion and interest for the industry, coupled with excellent business partnering & commercial finance experience.CapableYou pay strong attention to detail and possess excellent problem-solving skills. You have good work ethic and a positive attitude with a “can do” mind-set and will follow through on issues. You are also a self-starter with the ability to prioritise and meet tight deadlines.Team playerYou are team player who promotes open, constructive and collaborative relations with superiors, subordinates and peers, regularly contributes to team discussions and problem solving/ brainstorming sessions. You are also an effective listener and communicator.InitiativeYou are initiative and self-motivated. You seek innovation and actively source for opportunities to achieve best results.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:Job Tags:If this job description resonates with you, we encourage you to apply, even if you don’t meet all the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}