{"Job ID": "69866004", "Description": "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level. Job SummaryAs a Software Engineer III at JPMorgan Chase with in Employee Experience and Customer Technology Group you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.Job responsibilitiesWe are looking for an Oracle HCM Cloud Technical expert. \nWorking with the stakeholders to understand and review the requirements on Integrations, reporting and the fast formula.\nGathering business requirements, developing technical requirement documents.\nBuilding Interfaces, custom reports on Oracle HCM using the available framework.\nBuild proficiency with the HCM modules Core HR, ORC, Payroll, Time, Absence Management and other areas as required by the project.\nUnit testing, quality reviews, issue identification and resolution.\nAble to utilize JIRA and other project management tools used for tracking purposesRequired qualifications, capabilities, and skillsMinimum 4 years of experience on Oracle HCM Cloud and atleast 7 years of experience on HCM\nPL/SQL and SQL development experience\nOracle BI Publisher\nOracle HCM Fast Formula\nOracle HCM Extracts\nOracle HDL, PBL, Spreadsheet loader and Inbound Integrations using Fast Formula\nB.Tech degree in computer science/information technology or equivalent experience.Preferred qualifications, capabilities, and skillsDetail-oriented, team player and who could thrive in a collaborative environment.\nGood communication and presentation skills.\nAbility to multi-task and shift priorities as needed.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}