{"Job ID": "69867232", "Description": "Principal Accountabilities:Provide Validation and verification of test inputs, functional specifications, requirements, Acceptance criteria etc. for testability, ambiguity and completeness\nTranslate business and technical requirements into comprehensive automatable scenarios.\nLead test automation teams and formulate test automation plans to ensure the tools, skills and processes deployed in test automation meet the needs of the project teams and are aligned with the overall Civica standards.\nTaking lead for all test automation activities from initial planning and estimating, through to the delivery of the solution, providing expert testing input to the overall planning, estimating, monitoring and control of the delivery.\nEnsure test deliverables are delivered as per planned\nDevelop, execute and maintain automated test scripts(medium as well as complex) using Civica Test Automation Framework (Selenium+C#+Specflow).\nAccountable to integrate the Automated scripts to be executed using integrated CI/CD pipeline.\nAble to debug and fix complex issues in scripts created by others and help maintain existing automation suite for the project to keep it up and running.\nReviews automation code and enforce best practices in team.\nMentor team members and resolve their technical challenges if they need guidance.\nEnhancing existing features and/or help add new capabilities, features in Civica test automation framework.\nEvaluate existing manual test cases and identify opportunities for automation.\nRun investigations into root-cause analysis of failures, hardware or software, using the appropriate tools and recommend solutions to the relevant teams for resolution.\nManage the production, quality and accuracy of all relevant test artefacts and ensure that these adhere to the Civica Test Policy.\nDrive and measure return on investment of automation.\nProduce test deliverables, test plans and test execution reports.\nAssess and document any risks(With Mitigation plan) or issues that threaten the achievement of the testing deliverables.\nActively seek process improvements and efficiencies\nDeputise for the Test Manager\nBuild collaborative relationships within the Civica Group both internally and externally to the testing team and with partners\nEnsure that effective communication is maintained with team members on the same or related projects / product teams to build common goals and avoid misunderstandings\nChampion the testing professionEssential Competencies:Experience of managing test automation project/Modules from planning to delivery.\nSolid experience of estimating, developing, and maintaining robust automated test scripts for multiple application platforms like web, mobile and desktop, using Selenium.\nStrong knowledge of Object Oriented Programming concepts and should be able to apply them in test automation script development or framework design.\nProven experience of creating and maintaining automation frameworks(Preferably supporting BDD approach)\nStrong analytical and troubleshooting skills and able to come up with an alternative solution to a technically challenging problem.\nExperience of applying test automation across a range of technologies, both new and legacy.\nUnderstanding of the waterfall and agile development methodologies\nKnowledge of DevOps practices.\nDemonstrate initiative in developing solutions to problems encountered during testing\nGood in oral and written communication skills and able to take part in meetings and discussions.\nProactive personality and able to work autonomously.\nAbility to work at detailed and abstract levels.\nAbility to guide junior team members.\nTrack record of delivering commitments on time and quality.\nGood leadership quality\nKnowledge of Functional Testing(Manual Testing)\nTime management\nOut of box thinking and problem-solving skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Vadodara, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}