{
    "Job ID": "69869931",
    "Description": "Who we areTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds. Working here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.How will you spend your DayDevelop training strategy for Teva India team including full time employees, contractors, and vendors\n\nDevelop and document Compliance & Integrity training processes\n\nGather compliance training program requirements quarterly, and as needed prepare and deliver bespoke training\n\nLead the design & development of instructor-led Compliance training\n\nWork closely with the compliance team to own the testing of Compliance procedures\n\nDevelop new ways of communication reminders of integrity and compliance messages\n\nMaintain training completion reports\n\nDeliver new hire training (ongoing)\n\nDevelop Compliance communications strategy\n\nCollaborate with India and Global Communications to execute communications strategy\n\nFind innovative strategies for communications content\n\nSupport all India leaders for day-to-day queries messages\n\nRegularly work with India leaders to build and validate staff required to be trained\n\nBuild and deliver new hire trainings\n\nTrack and report training completion\n\nSupport Internal Audit teams\n\nMaintain accurate records, document storage systems and disposal as per policies including setting up systems and determining appropriate document formatsYour experience and qualificationsMinimum of 5 years of professional experience with, or exposure to training in business functions such as Compliance or Audit\n\nWork experience in a manufacturing set-up preferred\n\nAbility to work independently and professionally\n\nAbility to maintain confidentiality of sensitive areas\n\nExcellent verbal and written communication skills in EnglishJob GradeReports ToAssoc Dir ComplianceTeva’s Equal Employment Opportunity CommitmentTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Navi Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}