{"Job ID": "69866183", "Description": "Purpose of the Job:To contribute to the business success through the development and the implementation of an actionable Oncology marketing strategy leading to a profitable and competitively positioned brand.\nMaximize the success of Oncology brands & contribute actively to the development of a disease area vision and strategy.\nTo achieve financial objectives, leveraging available resources in the most effective mannerKey Areas of Responsibility:Mapping the key KOLs in his/her areas and developing the tactical operation plan in agreement with his/her manager\nDeep understanding for Health care system of Baghdad and Middle area including decision making process, influencers, funding map and stakeholders.\nInitiates and follows up on implementation of accounts access solutions in collaboration with other functions to expand and sustain access to eligible patients.\nAchieving the marketing strategy and sales target\nExecuting all sales and marketing plans and regularly report the ROI in a well-structured and calculated manner and come up proactively with clear required actions on accounts’ level, KOLs’ level, or areas’ level.\nComplying with all regulations regarding interactions with healthcare professionals, distribution of samples, etc.Minimum Criteria and CompetenciesExperience in pharmaceutical industry with successful achievement and Sustained Performance track record.\nExperience in Oncology area is an asset\nPharmaceutical Education degree is a must.\nTeam Player and proven high leadership capabilities according to his colleagues’ and managers’ opinions.\nStrong leadership skills specifically emotional intelligence, public relation, and negotiation skills.\nAbility to interact and manage a range of stakeholders both internally and externally.\nknowledge of presentation, negotiation, and leadership techniques.\nSkill in interpersonal network relationship with internal and external customers.\nDemonstrate excellent oral and written communication skills.\nAvailability for business trips.\nEnglish fluency.Date PostedClosing DateAstraZeneca embraces diversity and equality of opportunity.  We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills.  We believe that the more inclusive we are, the better our work will be.  We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics.  We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}