{
    "Job ID": "69866216",
    "Description": "Company Overview:If a culture of excellence, innovation and ownership is what you’re searching for, consider putting your experience in motion at Flowserve. As an individual contributor, or as a leader of people, your enterprise mindset will ensure Flowserve’s position as the global standard in comprehensive flow control solutions. Here, your opportunity for professional development and industry leading rewards will be supported by our foundational commitments to the values of people first, integrity and safety. Thinking beyond opportunity and reward, at Flowserve, we are inspired by working together to create extraordinary flow control solutions to make the world better for everyone!Role Summary:Plans, directs, and coordinates manufacturing processes involving machining, assembly, and testing. Develops, evaluates, and improves manufacturing methods, utilizing knowledge of product design, materials and parts, fabrication processes, tooling, and production. Analyzes and improves quality, cost, and delivery by using Lean and Six Sigma tools. Provides engineering support in production departments by trouble shooting and resolving technical issues.Responsibilities & Requirements:Investigates project/capital equipment proposals, develops justification, prepares requests for expenditure, acquires equipment, installs equipment, and ensures that justification goals are achieved.\n\nPartners with Manufacturing Supervisors to achieve Flowserve goals and objectives.\n\nSpecifies and acquires factory supplies that reduce costs and improve effectiveness.\n\nEnsures availability of CNC programs to support new products and customer requirements.\n\nAssists with training, instructing, and maintaining a flexible operator CNC programming and tooling skill base.\n\nEnsures tooling and fixtures are available to support customer demand.\n\nTroubleshoots processed and equipment minimizing delays in production schedules.\n\nAssists with development of the profit plan and the manufacturing strategic plan. Track assigned capital projects and expenditures status to ensure timely completion and within budget.\n\nKeeps abreast of new developments in the field of machine tool equipment, tooling, and methods. Recommend innovative solutions when applications are feasible to improve throughput and quality.\n\nUnderstands and supports all Company objectives and performs duties delegated by management.\n\nEnforces safety rules by ensuring that tooling, fixtures, and process meet all applicable OSHA regulations.\n\nEnforces Flowserve's environmental policies by ensuring that processes meet all applicable environmental regulations. Subcontractors are made aware of Flowserve's applicable environmental policies and are managed to these policies.\n\nDemonstrates the ability and willingness to be a team player.\n\nTreats all customers and fellow employees with respect.\n\nBS or BA Degree in relevant field and 3-5 years relevant experience\n\nOther duties as assigned.Preferred Experience / Skills:Proven track record of leading and driving cost reductions in a manufacturing environment utilizing Continuous Improvement Methodologies.\n\nExperience in a manufacturing environment.\n\nAbility to read and interpret documents such as safety rules, engineering drawings, operating and maintenance instructions, and procedures.\n\nAbility to write routine and technical correspondence.\n\nAbility to speak effectively before groups of customers or employees of the organization.\n\nAbility to comprehend and apply principles of advanced geometry, trigonometry, modern algebra, and advanced statistical theory.\n\nAbility to define problems, collect data, establish facts, and draw valid conclusions.\n\nExperience interpreting a variety of technical instructions in mathematical or diagram form and dealing with several abstract and concrete variables.Req ID : R-7210Job Family Group : EngineeringJob Family : EN EngineeringEOE including Disability/Protected Veterans. Flowserve will also not discriminate against an applicant or employee for inquiring about, discussing or disclosing their pay or, in certain circumstances, the pay of their co-workers. Pay Transparency Nondiscrimination ProvisionIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access flowservecareers.com as result of your disability. You can request a reasonable accommodation by sending an email to employment@flowserve.com. In order to quickly respond to your request, please use the words \"Accommodation Request\" as your subject line of your email. For more information, read the Accessibility Process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}