{"Job ID": "69867173", "Description": "Data Centre Operations Tech\n\nData Center Operations designs, installs & maintains the world’s largest Cloud Computing Infrastructure. We are looking for skilled Data Centre Operations Tech at Amazon Data Services India Private Limited (“ADSIPL”) with a passion for technology to help us expand AWS Cloud offerings to the next level.\n\n\nADSIPL offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining AWS computing environments in a secure, scalable, and cost-effective manner.\n\nMid 2012, AWS S3 web service accepted its 1 trillionth object, currently accepting more than 40,000 objects uploaded every second on a daily basis. To keep up with this demand on both disk and network capacity, we continue to expand our Data Centers in India. Also, our content delivery AWS service, CloudFront, has expanded its Data Centers presence by over 50% worldwide in the last 12 months and are expecting to increase by a similar number over the next 12 months. This requires talented people to build & manage. We hope it is you!\n\nAt ADSIPL, career progression is part of our environment. We want you to progress. If your career path is in Systems, Network or Database Engineering, Software Development or maybe AWS Support, Technical Operations or perhaps Project Management, we will create a development plan to enable you to succeed reaching those goals. This begins on Day One!\n\nCome and work for the world’s most Customer Centric Company. The location for this job to be discussed, as there may be opportunities in several India locations.\n\nThe Opportunity: Data Centre Operations Tech\n\nThis role is a unique opportunity to work in some of the most cutting edge data centers in the world. ADSIPL’s data centers are large-scale high-density centers where you will be working on changing the face of Cloud technology in India.\n\nA Data Centre Operations Tech at ADSIPL may be the primary point of contact for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Database Engineers, Technical Operations) and external customers (Hardware Vendors, Contractors, Service Providers among others).\n\nThere is never a dull moment as each day presents itself with different challenges. Some of the key responsibilities you will undertake are:\n\nProblem Solving: Maintain a high level of system reliability by prioritizing and resolving trouble tickets efficiently, these include:\n\n\n· Escalation point and technical troubleshooter for all Systems and Network hardware problems\n· Deep diving into Linux server issues\n· XEN service virtualization troubleshooting\n\nTechnical: Troubleshoot technical issues on various platforms ranging from Systems through Networking to Power/Mechanical\n\n\n· Remediation of physical layer outages, both Systems & Network\n· Remediation or recovery of physical power issues on racks\n· Participate in Data Center power & cooling events\n\nOperations: Meet 24x7 On-Call requirements and response during shift rotations.\n\n\n· Install & configure racks of hosts in line with internal SLAs\n· Triage & resolve trouble tickets for all devices in your region\n· Data Center point of contact for all High Severity issues\n· Physical replacement of server and network device parts\n· Ensure correct rotation of parts & spares\n· Help define metrics to increase our customer uptime\n· Enforcing Security Best Practices at ADSIPL\n· Interact with third party vendors & contractors\n· Contribute ideas to improve operational efficiency\n·\nProject Management:\n\n\n· Participate in and deliver on a number of high impact small to mid-scale projects\n· Participate in internal team meetings at ADSIPL for metric analysis and project status updates\n· Help build the world’s largest Cloud infrastructure in India\n\nMentoring: Share knowledge and help educate less technical staff on the best practices related to all service owner issues\nHiring: Contribute towards building a great team by getting involved in the ADSIPL’s hiring process/candidate interviews\n\nWe are open to hiring candidates to work out of one of the following locations:\nMumbai, MH, IND\nBasic Qualifications\n\n· Solid Understanding of Linux/Unix Administration\n· Server Hardware Troubleshooting experience\n· Server Booting: POST, BIOS, PXE, Kickstart, GRUB/LILO, RAID\n· Some Experience with Network Protocols: TCP/IP, Ethernet, L2/L3 technologies\n· Network Hardware: Copper and Optical Fiber Cabling, Switches, Routers\n· Strong Communication Skills\n· Passionate about IT infrastructure and hardware!\n\n* This position also has a physical component requiring the ability to lift & rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health & safety guidelines.\n* This role involves covering 24x7 shift rotation\n\n· Remote Access: Console routers, IPMI, BMC\n· Network Equipment Installation and Configuration\n· Cisco IOS, NX-OS, JunOS\n· Redundancy: Power feeds, ATS, Server Hardware, RAID, Network Connectivity\n· Data Center Operations: Inventory Management, Hot/Cold Aisles, Security\n· Participated in Project Management\n· Experience or Knowledge of AWS products: EC2, EBS, S3 etc.\n· Scripting: Bash, Python, Perl, Ruby (or programming languages)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}