{"Job ID": "69867224", "Description": "JOB TITLE: Assistant Manager - Data VisualizationLOCATION: BangaloreABOUT UNILEVER:Unilever is one of the world’s leading suppliers of Beauty & Wellbeing, Personal Care, Home Care, Nutrition, and Ice Cream products, with sales in over 190 countries, our 400 brands are used by 3.4 billion people every day. Our vision is to be the global leader in sustainable business and to demonstrate how our purpose-led, future-fit business model drives superior performance. We have a long tradition of being a progressive, responsible business.About UniOps:To enable Unilever to benefit from its scale and global capabilities, our five Business Groups are supported by Unilever Business Operations, which provide the technology, systems, and processes to drive operational excellence across the business. Unilever Operations (UniOps) is part of Unilever Business Operations and is transforming the experience of working at and doing business with Unilever by simplifying and digitizing our operations. We bring together our technology and business services capabilities – including operations, technology, data, and analytics. We are the delivery engine that enables our Company to run every day making sure every employee has the tools and technology they need to deliver to do their roles. Through continuously reducing complexity, eliminating duplication, and maximizing impact, this enables the business to grow by allowing markets to increase their focus on developing and delivering brands and products that consumers love. It's a very exciting time to be part of UniOps, join and participate in the digitally enabled future-fit business operations.Objectives:Unilever's mission statement has the following important components: Increasing life's vitality Providing for daily nutritional, hygienic, and personal care requirements Assisting individuals in feeling better, looking better, and getting more out of life.About Data and Analytics:The Data and Analytics (D&A) team within UniOps plays a critical role in driving Unilever’s growth and fuel for growth, empowering our people to make smarter and faster decisions to unlock value. Digital technology is transforming business, creating huge amounts of data. Our belief is that those companies that can truly harness data and deploy analytics at scale, will be those that succeed in the future.Background: Primary responsibility will be to develop and maintain PowerBI reports and dashboards that enable data-driven decision-making.\nResponsible for collaborating with various business stakeholders to gather requirements, design prototypes, and ensure the successful delivery of impactful business intelligence solutions.\nDevelop wireframes for the build of the dashboard using Figma and actively engage with 3rd Party resources through the course of development.\nLead a development team of 10+ developers and deliver high quality reports.\nShould maintain high level functional and technical designs; sign off design of Change Request (CRs) from Power BI design perspective and oversight all the build and test activities based on that design.\nCreating user-centred designs by understanding business requirements, and user feedback\nBuild insightful Visualizations using right choice of visuals to convey the business insights.\nCreating user flows, wireframes, prototypes, and mock-ups\nDesigning UI elements such as input controls, navigational components, and informational components.\nEnd to end project delivery and managementRoles & Responsibilities:This role requires designing and delivering data visualization projects for the Data and Analytics – Information Factory Team. The role as visualization specialist includes understanding business requirement, wireframe/prototype creation, lead powerbi development & delivery.Accountable for the delivery of the projects ensuring timeliness and accuracy of information as per the agreed SLAs.Maintain relationships with global clientele through regular customer governance calls for project scrum; This includes review of customer scorecards, understand customer feedback and dial them back to the project milestones.The role must ensure adoption and application of Unilever design principles in all the dynamic front end solutions delivered.Figma and Power BI is Unilever’s preferred tool for designing and report building. The person should work with COE platform leads within D&A, UPM and other service lines to deliver best practice and value for money from the tool. In this role as a SME the key responsibilities include –Build insightful Visualizations using right choice of visuals to convey the business insights.\nLanding latest Power BI features to drive business value.\nActing as a tool gatekeeper for resilience. Closely work with D&A tech team to get the tool limitation addressed.\nPartner with global practice teams and stakeholders to review design and define best solutions. Align with the development team on the feasibility/compatibility of designs being created.Adopt industry standards & best PracticesSkill Set:PowerBI Development:Develop and maintain PowerBI reports and dashboards that provide meaningful insights into business data.\nUtilize Power Query, DAX, Data Flows, Paginated reports, and M query to transform and model data for optimal visualization.\nImplement best practices for data modelling, performance optimization, and security within PowerBI.\nSound knowledge in data warehousing concepts.Prototyping and Design:Collaborate closely with business stakeholders to understand their data needs and requirements.\nCreate prototypes and mock-ups to visualize potential solutions and gather feedback for refinement.\nDesign user-friendly and visually appealing dashboards and reports that align with organizational goals.Stakeholder Management:Establish and maintain strong relationships with business users, data analysts, and other relevant stakeholders.Act as a bridge between technical and non-technical teams, ensuring clear communication and understanding of project objectives.Data Integration:Integrate data from various sources (databases, APIs, Excel files, etc.) into PowerBI for comprehensive analysis.\nEnsure data accuracy, consistency, and timeliness by implementing data validation and quality checks.Performance Optimization:Monitor and optimize the performance of PowerBI reports and dashboards.\nIdentify and address bottlenecks to ensure smooth and responsive user experiences.Documentation and Training:Create documentation for reports, data sources, and best practices to facilitate knowledge sharing.\nProvide training and support to end-users to enable self-service reporting.Quality Assurance:Conduct thorough testing and validation of reports to ensure data accuracy and report functionality.\nTroubleshoot and resolve any issues promptly.Project Management:Excellent communication skills and can clearly articulate your ideas, designs, and suggestions.\nStrong team player who can collaborate effectively with different stakeholders.\nTeam lead with managing team of 10+ people with different skill sets across globe\nExperience in showing Proof of Concepts (PoC) and understanding business requirements.\nExposure of Agile project management and DevOps team culture\nExperience of working in Global environment and managing global teamsEducational Qualification:Preferably From Engineering (BE/B.Tech) backgroundExperience Required:6+ years of relevant* experience\nExpertise hands-on using PowerBI, other BI tools and strong knowledge on data warehousing.\nExperience as team lead managing team of 10+ developers\nKnowledge on other designing tools like Figma or Adobe xd is an added advantage.From our foundation, Unilever has been a purpose-driven company. Today, our purpose is to make sustainable living commonplace. We are working to create a brighter future every day with brands and services that help people feel good, look good and get more out of life. That includes us – the people who work for Unilever, as well as the world around us. Unilever’s flexible rewards and benefits are designed to help us all have sustainable households, for whatever life stage you are at now and in the future.These include:Great work environment\n\nFlexible work environment built on trust and autonomy\n\nPension scheme\n\nEmployee Assistance Program for you and your family\n\nWell-being hub with access to benefits such as Healthcare, eye tests, health checks, occupational physioWe are a key advocate of well-being and offer a variety of support for our people including hubs, programmes, and development opportunities. We strive to achieve a family-friendly and inclusive workplace and to, above all, create possibilities for all. And last but certainly not least - the chance to be a part of a dynamic team with the backing of the globally renowned Unilever brand.Diversity at Unilever is about inclusion, embracing differences, creating possibilities, and growing together for better business performance. We embrace diversity in our workforce. This means giving full and fair consideration to all applicants and continuing the development of all employees regardless of age, disability, gender reassignment, race, religion or belief, sex, sexual orientation, marriage and civil partnership, and pregnancy and maternity.Reasonable AdjustmentsUnilever embraces diversity and encourages applications from people with a disability. We are committed to making reasonable adjustments to provide a positive, barrier-free recruitment journey. Candidates will be asked at the time of their application if any support or reasonable adjustments to complete their application and any subsequent recruitment journey with us at Unilever. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}