{
    "Job ID": "69866963",
    "Description": "Visual and Branding Graphic DesignerAre you a highly skilled Visual Graphic Designer with expertise in Illustrator, Photoshop, and InDesign? Do you have a passion for creating stunning visuals that leave a lasting impression? If so, we want you to join our team as our Visual Graphic Designer!About Us:INK is a leading advertising company known for its commitment to creativity and innovation. We take pride in delivering exceptional design solutions that exceed client expectations and captivate audiences.Position Overview:As a Visual Graphic Designer at INK, you will play a pivotal role in translating ideas into eye-catching visual assets. You'll collaborate with our dynamic team to produce compelling graphics, layouts, and designs that elevate our brand and client projects.Key Responsibilities:Create visually stunning graphics, illustrations, and layouts for a wide range of marketing materials, including brochures, websites, social media content, advertisements, and more.\nExpert level in inDesign, master page, and annual report design\nUtilize your expert skills in Adobe Illustrator, Photoshop, aftereffects, and InDesign to develop captivating visuals that tell compelling stories.\nSable to handle logo brand guidelines and logo concepts from A-Z\nManage multiple projects simultaneously while meeting deadlines and maintaining the highest standards of quality.\nWorking in aftereffects for motion projects and 2D chacter animationTo apply, please submit your resume, portfolio, and a cover letter highlighting your relevant experience and explaining why you're the ideal candidate for our Visual Graphic Designer position.Email to: communication@inkadvertising.netJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}