{
    "Job ID": "69869735",
    "Description": "Company:Job Area:General Summary:As a member of Qualcomm’s Talent Development HR Community of Practice, the Instructional Designer role will be responsible for the assisting in the design of learning and development courses. This role will be responsible for enabling the learning and development strategies through the design of the course content, learning plans and modules to ensure Qualcomm attracts, retains, and advances our greatest asset – our people.S/He will collaborate with the Instructional Design Team Lead and other design team members to understand the needs of leadership and specific populations and implementing the strategy into the design of the continuous adult learning modules. The Instructional Designer role will report to the Instructional Design Team Lead.Principal Duties And Responsibilities Work collaboratively with the learning design team and instructional design team manager to understand stakeholder development needs including course objectives, course features.\n Gather and understand existing material and content that will serve as an input into new course designs & learning solutions.\n Design course content for continuous adult learning, learning plans, and modules that align with the learning and development strategies and considered the user’s experience perspective.\n Create and design an effective and memorable learning experience for learners.\n Support development team members in course review and course editing.\nReview course materials and ensure the course design adheres to Qualcomm’s established standards and course objectives.Minimum Qualifications:Preferred Qualifications:Bachelors - Business, Bachelors - Human Resources, Bachelors - Organizational Development, Bachelors – Psychology\n5+ years of Talent Development-related work experience.\nProven experience of using e learning design tools to create engaging learning solutions-  Articulate 360, Adobe Illustrator, Adobe Captivate, Gen AI Tools for but not limited to Design, Video Editing , Voice over etc.\nVisual design skills including ability to storyboard the course development. Solid knowledge of MS Powerpoint, Word and SharePoint.\nWorking knowledge of Workday LMS and at least one Learning Experience Platform.Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}