{
    "Job ID": "69866436",
    "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.TITLE:  QA Test Engineer (C#, Selenium, API)REPORTING TO: QA ManagerWORKING LOCATION: BangaloreResponsibilities                                                                                                                                                  To be described.Translate test cases to automation script using C# for GUI / API tests.\nAdhere to coding standard and guidelines defined for automation.\n2 - 4 Years of experience in Automation Testing\nReview code and fix any issue identified in scheduled automation runs.\nPerform root cause analysis of script failures.\nSubmit and track automation identified defects.\nIdentify automatable test cases in existing test suite and help in planning for automation.\nUnderstand the requirements, transform those into Automation test cases.\nEnsure that activities are coordinated with all stakeholders according to schedule, while ensuring that testing activities are thoroughly documented in support of lifecycle system engineering activities.\nTest data setup & Test execution of the automated Test cases\nProvide effective communication to QA Manager/Lead regarding issues, objectives, initiatives and performance to plan\nContribute to delivery in accordance with project scope/delivery dates.Technical knowledge:Solid knowledge in automation testing.\nGood experience in C#\nExperience in testing API/web services\nGood knowledge in Database & SQL. Ability to create & mine data using SQL queries.\nExperience in any automation tools: Selenium, Coded UI, Ranorex etc.\nExposure to create Automation framework like Modular, BDD, POM etc.\nKnowledge and experience in TFS/MTM.\nUnderstanding of Agile/Scrum methodology and working experience in agile environment.\nExperience in Test data setup across multiple modules & ability to understand the data dependencies.\nShould have good knowledge of Defect Management process.\nKnowledge in testing web services is desirable.Personal Qualities:     Excellent analytical and problem solving skills\nExcellent verbal and written communication skills\nSuccessful teamwork experience and demonstrated leadership abilities are required\nProven ability to transfer knowledge and stay aware of current trends and technical advancements\nAbility to articulate and present different points-of-views on various technologiesPREFERED CANDIDATE :BE/MCA or any other equivalent degreeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}