{"Job ID": "69865925", "Description": "The People & Culture Business Partner (P&CBP) partners with leaders across the cluster, offering support on Business Partnering topics that need immediate (on-demand, ad-hoc support), short-term and/or long-term guidance and value creation. With a good understanding of business needs and context, and an excellent ability to apply key P&C concepts, policies and processes, this position provides coaching, guidance and support to leaders to help them diagnose and translate their business needs into immediate P&C approaches and ensures effective implementation of solutions.Your ResponsibilitiesBusiness AcumenProvide immediate, short-term and/or long-term strategic guidance to leaders on strategic P&C needs such as succession and talent management, performance management, goal setting, development planning, reward & compensation management and organizational set-up. When necessary, leverage subject-matter experts within the P&C community to develop high quality solutions in a timely manner.\n\nUse knowledge of business and P&C insights, metrics, expertise, and decision principles to effectively deliver support on topics with a wide range of complexity.\n\nParticipate in regional squads for deployment of key P&C initiatives or new system launches.\n\nLeverage a strong understanding of global P&C processes to consult, advice and train both business leaders on system and process related topics. Deliver first-class support, advice and coaching to leaders specifically when new processes or projects (e.g. global grading) are rolled out.\n\nEnsure alignment and execution of established policies, procedures and global P&C initiatives. Ensure compliance of all P&C practices within legislative requirements and established standards and guidelines by building a broad knowledge base on regional approaches and connecting with regional P&C colleagues.LeadershipBe a trusted sparring partner and sounding board for leaders in all aspects of P&C generalist areas. Grasp a broad range of generalist P&C topics and be able to thoughtfully diagnose, evaluate and propose fit-for-purpose approaches including weighing risks and benefits of options.\n\nBe a trusted partner and lead others through complex generalist P&C topics by understanding the philosophies, approaches and systems-relevant configurations of topics such as succession and talent management (people discussions), access to relevant data, performance and compensation (performance management, benefits and other compensation elements), transformations (change management and redundancies), employee wellbeing (may include reintegration processes and time management), career paths, resolution of conflicts, employee representation topics and relocation, depending on the scope of the request.\n\nEnsure full ownership and leadership of incoming requests, prioritization and solution implementation to provide P&C consultation to leaders with a connected and caring approach.\n\nWhen possible, Partner with other P&C Chapters to create value for the organization. Onboard leaders where needed and connect them to other P&C colleagues when appropriate.Strategic P&C Insights & InnovationGathers and analyzes data and P&C or business metrics to make critical decisions; shares insights with leaders and recommends innovative solutions based on the P&C decision principles that support the culture, strategic direction and resources.\n\nDrive the People Agenda by applying broad P&C skills in the areas of organization design and development, change management, workforce planning, coaching/consultation, program/project management, facilitation and communication. Plan and implement people/ organization solutions aligned to the business & Group P&C strategy and goals.\n\nUtilize data sources to review key metrics such as turnover, talent review-related information, on- and off-boarding needs to sense and address organizational needs proactively.\n\nEnsure compliance of all P&C practices with legislative and regulatory requirements, standards and other known relevant policies and guidelines within the cluster.Who You AreYou hold a BSc degree in Human Resources, Business Administration, Psychology, Communication or related\n\nYou built a minimum of 5 years of work experience as HR Business Partner in matrix multinational organization. Ideal candidate is exposed to  Distributor setup \n\nYou bring deep understanding of business drivers, products, local market, competition, and employee workforce\n\nYou are passionate and knowledgeable P&C professional with ability to work in a fast paced global and virtual environment. Demonstrated ability to navigate the P&C system, and participate in flexible squads to deliver on business and P&C strategies\n\nDemonstrated customer-centricity through day-to-day interactions, anticipating needs and showing cultural awareness and business understanding. Demonstrated end-to-end ownership, engaging with leaders to ensure a successful outcome\n\nYou built experience working with diverse senior leaders and are able to builds trustful and effective relationships\n\nYou built advanced communication, coaching and influencing skills at all levels.\n\nDemonstrated ability and experience in effectively diagnosing short-term and long-term P&C needs, and offering fit for purpose solutions to address them. You are courageous and able to push back and challenge the status quo with senior leaders\n\nDemonstrated negotiation skills and the ability to cope with time pressure in demanding situations. Demonstrated ability to influence with courageous authenticity and build trust with individuals at all levels within the organization\n\nDemonstrated excellent situational assessment and objective evaluation skills, with an ability to comprehend and translate complex topics into manageable pieces\n\nYou are able to leverage data, technology and insights to find root causes, troubleshoot and inform innovative and compliant solutions\n\nYou built knowledge about local labor laws and regulations within the cluster\n\nYou have experience on navigating complexity, dynamic workforce context and labor laws environment\n\nYou are willing to navigate strategy and operational challengesAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}