{"Job ID": "69866973", "Description": "AlGooru is hunting for the next generation of CX talents!This opportunity will be a six-month internship opportunity.Based on exemplary performance and dedication, there is potential for this role to transition into a full-time opportunity.🪄 A bit about usAlGooru is a Saudi-based edtech startup that uses AI to connect students with on-demand private tutors over 20+ subjects.🎯 Main responsibilitiesMonitoring client chats to ensure a seamless and positive user experience.\nIdentifying and escalating any issues or concerns raised by clients, ensuring a quick and efficient resolution.\nAnalyzing chat interactions comprehensively to detect recurring issues, concerns, or trends.\nAccurately recording the frequency of specific issues, enabling the company to prioritize and address them effectively.👣 A day in your lifeChat MonitoringMonitor client chats to ensure that all interactions are of the highest quality and in line with the company's service standards.Issue Identification and TicketingIdentify issues or concerns raised by clients during chat interactions.\nCreate detailed tickets for each identified issue, ensuring all relevant information is captured for further action by the relevant departments.Arabic Communication ProficiencyUse excellent Arabic reading and writing skills to understand client needs, concerns, and feedback. This includes accurately interpreting the nuances and sentiments expressed by clients.Chat AnalysisAnalyze chat transcripts to understand common issues, concerns, or trends.\nRecord the frequency of recurring issues to help the company prioritize solutions and improvements.\nCollaborate with the customer support team to discuss findings and suggest potential improvements or solutions.ReportingRegularly report findings, trends, and analytics to the Customer Support Manager or other relevant stakeholders. This includes both quantitative and qualitative insights.Continuous LearningStay updated with the company's products, services, and policies to provide accurate information to clients and to better understand their feedback.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Beirut, Lebanon", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}