{"Job ID": "69867242", "Description": "Responsible for the diagnosis and treatment of medical diseases and conditions, as well as the provision of medical care in the field of Orthopedic Surgery, in accordance with the current medical staff bylaws, rules and regulations and the Hospital’s policies and procedures.Clinical Responsibilities:Provides high quality patient care in all aspects of General Orthopaedic Surgery according to his/her approved clinical privileges.\nProvides consultation (inpatient, and emergency room) upon request and responds in a timely manner within the prescribed timeframe as outlined in Hospital policy.\nResponsible for the timely completion, competencies, accuracy and eligibility of the medical record.\nProvides on-call service and ensures availability and response time within the prescribed timeframe in accordance with Hospital policy.\nConducts daily morning rounds to identify patients ready for discharge.Ensures that discharge orders are written 24 hours prior to discharge.\nPerforms any other clinical responsibilities related to the speciality, as assigned.Academic Responsibilities:Provides orientation, bedside training and supervision to interns, residents and fellows as assigned.\nParticipates in educational activities and training programs of the department. Partakes in national and international medical conferences.\nMaintains and enhances professional knowledge and continuing education requirements.Research Responsibilities:Participates in clinical, basic and translational research projects in accordance with Research Advisory Council Policy in order to advance knowledge, improve the quality of postgraduate education and contribute to the national and international recognition of KFSH&RC.Graduation from an accredited medical school, completion of required period of training in specialty and/or subspecialty, with Arab or American Board certification, membership and/or fellowship status in the United Kingdom and/or Canada or their equivalent.Seven (7) years of training in specialty or subspecialty plus postgraduate training experience must be equal to or exceed seven (7) years’ experience in the subspecialty.N/A.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Medina, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}