{"Job ID": "69867724", "Description": "Posting Date: 14/09/2023\nRef: E9456\nPosition: Export Manager\nLocation: Egypt\nCity: Cairo\nSector: Contracting and Construction\nYears of Experience 15+ Years\nQualification: Bachelor's degree in Engineering, Business, or a related field\nSalary: Undisclosed\nDescription: We are a leading manufacturer and distributor of high-quality construction and building chemicals. With a strong commitment to innovation, quality, and customer satisfaction, we have established a strong presence in the construction industry both domestically and internationally. We are seeking a dynamic and experienced Export Manager to lead our global expansion efforts and drive the growth of our export business.\nAs an Export Manager , you will play a pivotal role in expanding our market reach and increasing our presence in international markets. You will be responsible for developing and implementing strategic plans for exporting our construction and building chemical products. You will work closely with cross-functional teams, distributors, and partners to ensure successful market penetration and growth.\nKey Responsibilities:\n1. Market Analysis: Conduct market research to identify new international markets and assess their potential for our products. Analyze market trends, competitors, and regulatory requirements.\n2. Export Strategy: Develop and implement a comprehensive export strategy to achieve sales and growth targets. Identify key export markets and create market-entry plans.\n3. Distributor Management: Build and maintain relationships with distributors and partners in target markets. Provide them with necessary support, training, and resources to promote our products effectively.\n4. Sales and Business Development: Drive sales activities by identifying and pursuing business opportunities. Develop pricing strategies and negotiate contracts with international clients.\n5. Logistics and Supply Chain: Oversee logistics and supply chain operations to ensure timely delivery of products to international customers while optimizing costs.\n6. Compliance and Documentation: Ensure compliance with export regulations and manage all export-related documentation, including export permits, licenses, and customs documentation.\n7. Customer Relations: Maintain strong relationships with international customers, addressing their inquiries, concerns, and feedback promptly.\n8. Reporting: Prepare and present regular reports on export sales, market trends, and performance to the executive team.\n9. Team Collaboration: Collaborate with internal teams, including production, quality control, marketing, and finance, to support the export process effectively.\nQualifications:\n- Bachelor's degree in Engineering, Business, or a related field.\n- 15+ Years of experience.\n- Proven experience as an Export Manager or in a similar international sales role within the construction or chemical industry.\n- In-depth knowledge of export regulations, customs procedures, and international trade practices.\n- Strong understanding of construction and building chemical products.\n- Exceptional negotiation and communication skills.\n- Ability to travel internationally as needed.\n- Proficiency in relevant software applications (e.g., ERP systems, MS Office).\nMoreJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}