{
    "Job ID": "69866148",
    "Description": "Experienced Desktop Hardware ArchitectCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, Model-Based Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.  With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.Position Overview:Boeing India Engineering is seeking an Experienced Desktop Hardware Architect to join the Client Computing team. As a member of this team, you will work closely with Business Success Leaders to ensure seamless delivery of desktop services and provide a stable desktop environment to the enterprise. This will include collecting and analyzing business requirements, recommending improvements, participating in design and architecture discussions and serve as third level support for Desktop related technical issues.  The successful candidate will have a strong knowledge of software/hardware design and have the ability to work across IT solutions in a multi-platform environment. This position will be located in the Boeing India Engineering and Technology Center, Bangalore, India.Position Responsibilities:Consult with the business on desktop computer hardware configurations and issues\nPerform as a technical advisor to the organizational Business Liaisons and Business Success leaders on desktop computer hardware topics\nCoordinate with suppliers to complete hardware evaluations, address technical and delivery concerns\nReview and assess non-standard deviation requests, i.e. waivers, for desktop productivity software and desktop computer hardware\nMaintain desktop hardware architecture artifacts (requirements, standards, catalog, etc.)\nShared/Group mailbox management, contribute to team InSite pageEMPLOYER WILL NOT SPONSOR APPLICANTS FOR EMPLOYMENT VISA STATUS.Basic Qualifications (Required Skills/Experience):Bachelor’s Degree in Information Technology or related work experience\n7+ years of experience supporting Operating Systems (e.g. Windows 7, Windows 10, or Linux/Unix) and User Productivity systems (e.g. Microsoft Office 365)\n7+ years of experience with desktop hardware architecture and solutions (e.g. Mac Hardware, Thin Client hardware, Factory/Industrial PCs)\n7+ years of experience implementing/managing complex End-User solutions IT\n7+ years of experience with Scripting languages (i.e. VB, C, Powershell), Identity Directory Services, Network ServicesPreferred Qualifications (Desired Skills/Experience):Bachelor’s Degree in Information Technology or related work experience\nKnowledge of Scaled Agile Framework (SAFe) principlesTypical Education & Experience:Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 8 years' related work experience or an equivalent combination of education and experience (e.g. Master + 7 years' related work experience.)Relocation:This position does offer relocation based on candidate eligibility within INDIA.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}