{
    "Job ID": "69866329",
    "Description": "What's your passion? Whether you're into legal laws, interest in human capital or chess, at At Crowne Plaza® Hotels & Resorts we're interested in you. We love people who apply the same amount of passion and precision to their jobs as they do to their hobbies. Imagine working for a company that gives you Room to be yourself. Our commitment to our people is to deliver room to have a great start, to learn and grow, to perform, to be recognized and rewarded, to be involved and to take the initiative and lead. The Crowne Plaza Dubai Marina is the perfect location that completely understands Modern business travelers. Located in the cosmopolitan Dubai Marina area, the 3,037 square-metre hotel is next to Dubai Marina Mall and within walking distance of the picturesque pedestrian promenade, which borders the waterway lined with vibrant cafes and restaurants.With 273 stylish rooms and a convenient, prestigious location, you will find Crowne Plaza Dubai Marina an ideal hotel for productive business and enjoyable leisure time; and will definitely enjoy a new hotel that has mastered the balance between modernism of the business world and traditions of the Arabian hospitality.We are currently recruiting for a full time Demi Chef de Partie- Pastry to join our enthusiastic team at Crowne Plaza Dubai Marina.  As a Demi Chef de Partie- Pastry you are responsible to take care of the daily food preparation and duties assigned to meet the set standard and qualities whereby your role will include key responsibilities such as:Support the Chef de Partie or Sous Chef in the daily operation and work\nWork according to the menu specifications by the Chef de Partie or Sous Chef\nKeep work area at all times in hygienic conditions according to the rules set by the hotel\nControl food stock and food cost in his section\nPrepare the daily mis-en-place and food production in pastry & bakery section\nFollow the instructions and recommendations from the immediate superiors to complete the daily tasks\nEnsure the highest standards and consistent quality in the daily preparation and keep up to date with the new products, recipes and preparation techniques\nInstruct and lead subordinates through their daily requirements in food preparation and actively take part in set up of buffets and special functions\nCoordinate and participate with other sections of requirements, cleanliness, wastage and cost controlIdeally, you'll have a minimum of 2 years’ experience in the similar role in a four or five-star hotel or comparable industry, ability to demonstrate working with and engaging teams from different cultures, strong verbal and written communication skills along with being quality oriented with focus on details, high performance standards, able to multi-task & meet deadlines and technical proficiency in related software preferable.IHG is more than just a great place to stay; we are also one of UAE’s best employers. We are looking for exceptional people like you to greet the world and be the spark that makes us even better.We passionately believe that it’s our people who have brought us to where we are today and our people that will help us grow. We celebrate diversity every day. We welcome guests from every background and corner of the world, so we want individuals who can bring true hospitality to life for everyone.We will give you every opportunity to grow vertically, functionally, geographically, and personally. As part of the IHG family with more than 5,300 hotels in over 100 countries, the world is your oyster.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}