{
    "Job ID": "69865523",
    "Description": "Define and lead all required inputs from the business lines that facilitate business excellence management processes to prioritize resources, maximize the contribution and capture optimization opportunities within the Downstream Directorate. This includes business process management; business procedure management, corporate procedure management, data management, quality management; change management; benchmarking; reporting audit finding, knowledge management, and digitalization landscape architecture management.\nPlan and execute all initiatives related to Downstream Business Continuity Management “BCM” and Enterprise Risk Management “ERM” and ensure effectiveness of resources, processes, procedures and tools.\nDevelop and implement business excellence initiatives, framework and approach for ADNOC Downstream Directorate and associated group companies. Support the creation of a corporate culture where excellence is achieved, fostered and sustained through building innovation capabilities, ensuring organizational change and quality are well-managed using various methods such as enhanced internal communication, quality tools, innovation tools and change management practices.\nPlan and execute all initiatives under innovation and improvement, corporate quality, internal communications and change management portfolios. This includes the ADNOC Integrated Management System to maintain ISO standards and Audit & Management Action Plans.Business Excellence & Improvement\n•    Support the development of an overall strategy and management model for downstream excellence and improvements at all levels in the Directorate and its reporting Group Companies. Plan and lead implementation, assessment, refinement and enhancement of the model and the innovation activities throughout the Directorate. Promote an innovation culture within the Directorate, leading to operational excellence through process improvement exercises.\n•    Develop business excellence corporate procedures (Customer Satisfaction, Change Management, Document Control Information Management, etc.) policies and unified value project processes across the Downstream Units/Departments and associated Group Companies.\n•    Plan and implement change management, technical standards & portfolio management procedure and internal controls. \n•    Support the development of the Business Excellence governance and related metrics to ensure optimization initiatives are results obtained.\n•    Plan and lead business excellence research and coordination with ADNOC and the BLOCs to collate the required information to analyse existing and future business excellence needs. \n•    Plan and execute highly dynamic digitalized business engagement / association to drive IT business engagement, and define Downstream business digitalization application landscape and architecture. Deliver and govern digitalization projects in partnership with cross-functional and delivery teams; mainly with PMO, GIT and TEO. \n•    Develop insights to create new ways of delivering services, improving processes, identifying and realizing automation opportunities etc. working with digital operations delivery.\nBusiness Process Management\n•    Establish and support governance of ADNOC Downstream Directorate’s business process management, outlining and managing the Petroleum Downstream Framework (PCF-APQC) toward business process management & business procedure management.  \n•    Plan and lead initiatives for business process developments, business process mapping, and business procedure development, establishing and managing tools to support the governance process. This includes various activities, e.g. communication, to administer the governing process. \n•    Ensure relevant manage tools are in place and optimally utilized to support the governance process. \n•    Support in determining and organizing the structural composition of business processes. Execute the design, establishment, and administration of the framework. \n•    Identify cross-functional business processes that are mandatory for achieving business excellence.\n•    Identify, analyze, and improve business processes in order to meet the goals and objectives of DSD strategic action, such as increasing profits and performance, reducing costs, and accelerating schedules. Downstream Quality Management\n•    Support the establishment of an overall quality culture throughout the Directorate by adopting the latest developments in the excellence model, adopting the most suitable downstream processes while ensuring adherence to the corporate Quality Management directives and programs. \n•    Actively scout for best practices by networking with global quality experts and based on applicability implement within Downstream Directorate in alignment with ANDOC corporate standards. \n•    Implement the APQC Framework and ADNOC Quality Integrated Management System (IMS) throughout the Downstream business process deliverables.\n•    Lead essential activities, processes, and attributes for securing Directorate’s quality of output. Determine the Directorate’s quality requirement and evaluate the correspondence between the quality performance and requirements. Outline critical characteristics, activities encouraging the preservation of quality and define quality controls while confirming capabilities in accordance with quality requirements. \n•    Support the development of a Self-Assessment Culture and single view of repository for Auditing purpose with Downstream. \n•    Support the resolution of any non-conformance activities within Downstream Directorate ensuring prompt assessment of potential impact of the nonconformity. Lead the analysis and identification of the root causes. Define corrective or preventive action and ensure future conformance.\n•    Define the process steps for quality controls and the sampling plan and the competencies required. Ensure the efficient tools and methods are in place to measure quality.\n•    Identify and choose improvement opportunities. Create and manage improvement projects. Perform the improvement activities continuously and routinely.\nDigitalization Landscape Management\n•    Analyse and outlining the DSD IT application landscape architecture. Establish current & future Downstream Digitalization Landscape Architecture definition, framework, and roadmap.\n•    Assess interrelationships of the business process architecture, information architecture, components and services architectures, and the infrastructure architectures to ensure their continued relevance.\nDownstream Communications\n•    Support the development and execute Downstream Directorate’s internal communication strategies, targets and initiatives.\n•    Develop an understanding and awareness of the internal communication needs within the Directorate. Lead the coordination with all relevant stakeholders and Downstream teams to understand changes and potential implications for internal communications.\n•    Execute the Directorate’s internal communication process delivering timely and effective communications throughout the Directorate and its reporting Group Companies. This involves liaison with managers and developing and delivering a coordinated process in order to provide effective, joined up communications.•    Develop communication channels for promoting an excellence, improvement and innovation oriented organization culture.\n•    Plan and conduct regular feedback initiatives – Director’s communication sessions, divisional team brief sessions - to promote cross communication within Downstream Directorate and its reporting Group Companies and ensure that communications are being delivered in a consistent and timely manner. Monitor the results of the feedback to ensure continuous improvement in communications.\nDownstream Change Management Initiatives\n•    Support the development of change strategies to ensure that processes of management of change are embedded in the day-to-day management of each Downstream function and project. \n•    Play a pro-active role in evaluating the implementation status of change initiatives, facilitating regular reviews with the management team to accord value-based priorities to such initiatives and providing the necessary resource support to ensure that initiatives are implemented in a timely manner and expected benefits realised.Supervision\n•    Plan, supervise and coordinate all activities in the assigned area to meet functional objectives.\n•    Train and develop the assigned staff on relevant skills to enable them to become proficient on the job and deliver the respective section objectives.\nBudgets\n•    Provide input for preparation of the Section / Department budgets and assist in the implementation of the approved Budget and work plans to deliver Section objectives. \n•    Investigate and highlight any significant variances to support effective performance and cost control.\nPolicies, Systems, Processes & Procedures\n•    Implement approved Section / Department policies, processes, systems, standards and procedures in order to support execution of the Section’s / Department work programs in line with Company and International standards.\nPerformance Management\n•    Contribute to the achievement of the approved Performance Objectives for the Section / Department in line with the Company Performance framework.\nInnovation and Continuous Improvement\n•    Design and implement new tools and techniques to improve the quality and efficiency of operational processes.\n•    Identify improvements in internal processes against best practices in pursuit of greater efficiency in line with ISO standards in order to define intelligent solutions for issues confronting the function.\nHealth, Safety, Environment (HSE) and Sustainability\n•    Comply with relevant HSE policies, procedures & controls and applicable legislation and sustainability guidelines in line with international standards, best practices and ADNOC Code of Practices.\nReports\n•    Provide inputs to prepare Section MIS and progress reports for Company Management. Bachelor’s Degree in Business Management/Engineering/Economics or equivalent. 10 years of relevant experience preferably in an oil and gas industry.Physical Effort\n•    Minimal – regular walking, standing and keyboard use, as required.  Work Environment•    Mostly air-conditioned office environment.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}