{"Job ID": "69866781", "Description": "DescriptionTyphoon Mechanical Senior SupervisorSalary: CompetitiveLocation: Taif, Saudi ArabiaJOB PURPOSEBAE Systems is the UK Government’s nominated Prime Contractor under the Government-to-Government arrangements that are in place to provide equipment, support and training to Saudi Arabia. We provide maintenance of Royal Saudi Air Force (RSAF) aircraft and train RSAF and Royal Saudi Naval Force personnel safely in a training environment in how to use their aircraft, equipment and weapons.BAE Systems Saudi Arabia is committed to supporting the Saudi Arabian National Agenda including Saudisation and the training and development of Saudi National capability through the growth of the Saudi National Partner Companies thereby reinforcing Industrialisation and Partnerships.The role is responsible for leading the development, effectiveness and the consolidation (OJT) of RSAF and BAE Systems Mechanical aircraft supervisors and tradesmen employed in Forward Maintenance, KFdAB, Taif. To manage the engineering activities and ensure effective supervision of Mechanical Aircraft technicians and supervisors in order to ensure that continuing airworthiness and maintenance activities on Typhoon aircraft are carried out in accordance with BAE Systems Saudi Arabia SALAM Maintenance Organisation Exposition and associated Quality Management System.The job holder will supervise BAE Systems staff and Royal Saudi Air Force (RSAF) personnel as well as lead the mentoring and consolidation development of these tradesmen in the Forward Maintenance environment.JOB ACCOUNTABILITIESDeputising for the Production Lead in their absence. (Ensuring all aurthorisations are held to be able to deputise, F700 Co-ord, Reconcile etc)\nManaging their available manpower by co-ordinating with their Specialist Supervisors to ensure aircraft generation and flying requirements are achieved this includes:Leave, shift allocation, support to flight line (launch and recovery), EOR duty and Hit Team duty.\nManaging their manpower to ensure adherence to the use of approved data.\nSubmission of Technical Publication Review Forms (TPRF) against approved data and Technical Requests (TRs) for any aircraft related anomalies.\nSpares demands are accurate and review of FDDs to meet aircraft operations.\nEnsure shift handovers are carried out without ambiguity.\nAdherence to tool control procedures and carry out random checks of the assigned specialist tool kits (10% checks, damaged tools etc).\nAdherence to good husbandry practices by carrying out random post maintenance reviews of the work area.\nReview of engineering authorisations and ensure that personnel are re-trained/re-authorised to maintain efficient support to the operation.\nObtain the appropriate licence and authorisations to operate, support and task vehicles of various types, and tow aircraft and support equipment. Act as fleet vehicle custodian if directed by maintenance management.\nCarry out independent checks of ESS for consistency and accuracy.\nCarry out PMDS downloads and assess arisings including SHM and EHM analysis.\nCarry out independent Inspections on specified systems as stated in the Reg Framework.\nSupport the Forward Maintenance Managers in addressing any QA or higher HQ reports including investigations.\nSupport and promote the ‘spot it report it’ and FOD prevention programmes.\nLiaise with the training department and co-ordinate RSAF consolidation training within their trade.\nProviding coaching and mentoring for assigned BAE SA and RSAF personnel including annual ePDRs.\nEnsuring personal standards are maintained and adherence to the Code of Conduct (CoC) and Responsible Business Conduct (RBC) by their assigned manpower.\nCarry out aircrew debriefings.\nMonitor aircraft for repeat or recurring defects and previous maintenance actions already taken.\nMonitor negative trends in manpower or maintenance that could impact the safety of the operation.\nProvide assistance as the SME for their trade in troubleshooting/fault finding as necessary.\nProvide support to any aircraft deployments or detachments by allocating manpower and coordinating AGE/Tool/Spares requirements.\nMonitoring DLF availability and identifying new candidates.\nSupport the Forward Training and Support Manager in the management of the facilities by reporting any defects.\nRaising deficiency paperwork for items received from supply that are damaged or considered not fit for purpose.\nWelfare and discipline of all assigned BAE Systems staff under their control in conjunction with other Management and Supervisory staff.\nCompleting any other reasonable duties or requests that are made by your line management.\nCounterpart development of assigned RSAF personnel to achieve 2nd and 3rd Signature levels (Certifying Staff).\nDemonstrating certain behaviours in all the work undertaken and in interactions with other maintenance personnel in line with M&CA People Behaviours BAESKSA-ENG-MCA-GOV-005.\nSupport and participate in the reporting of ALL Product Safety & Environmental occurrences, promoting a Just Culture. This provides for a working environment of trust where all employees, all of whom are professionals, each have a clear understanding of what standard of behaviour is considered acceptable or unacceptable.\nPromote and support the Salam Operations Quality Management System by understanding the requirements of AS9110. Promotion of customer focus throughout the organisation whilst recognising and highlighting opportunities for continuous improvement (CI).RECRUITMENT SPECIFICATIONEssentialMust have proven extensive post qualification practical maintenance experience within operational flying aircraft environment supported by formal recorded workplace applied related training OR extensive experience on same aircraft type\nMust have extensive proven experience in a relevant management role.\nTyphoon Q Course and equipment specific training if required.\nMust have experience working knowledge of EASA Part 145\nLeadership skills and proven ability to supervise all levels of engineering personnel.\nQualified to HNC / HND (with military add on training applicable to trade) or national civilian / military equivalent and successful completion of a recognised national aircraft maintenance traineeship / apprenticeship\nNational Aircraft Maintenance Qualifications as agreed by the Directorate. This includes, but is not limited to:\nRoyal Saudi Air Force Aircraft Maintenance Qualifications (Skill Level 7)\nUK Royal Air Force Aircraft Maintenance Qualifications\nOther Military Aircraft Maintenance Qualifications as agreed by the directorate\nEASA (Part 66) Aircraft Maintenance Qualifications (Cat A,B, or C) or GACA equivalent.\nBAE Systems Saudi Arabia Trained Aircraft Maintenance Personnel (SNTTP/ TSNTTP/FLMP).\nApplicants holding other nationally awarded Aircraft Maintenance Qualifications should consult the Directorate·For non-native English speakers, English Language proficiency equivalent to (IELTS 4.5).DesirableFormal training in analysing EHM.\nThorough understanding of company processes and procedures\nBroad aerospace and defence company / industry knowledge.\nProven supervisory experience within the area of definition.RECRUITMENTCurrently working in an aircraft maintenance organisation conducting or supporting Line (Forward) Maintenance of military fast-jets (Typhoon preferred).\nProven track record supervising Mechanical aircraft maintenance supervisors and technicians and associated resources at ‘shift manager’ level, maintaining military fast jet aircraft (Typhoon preferred).\nExcellent man management and people development competencies. Management experience with proven ability to manage junior engineering personnel.\nHigh level of interpersonal skill to co-ordinate a large number of diverse and complex activities and the ability to communicate, influence and direct the decision making process at all levels. Experience of multi–tasking to manage a diverse range of engineering and management activities.\nDemonstrable experience working as a Mechanical certifying supervisor and technician conducting Line (Forward) Maintenance on a busy, military operational flying unit.\nFully conversant with European Aviation Safety Agency aircraft maintenance regulations or military equivalents such as UK MoD Defence Standard 05-130.\nExperience working in a NATO air force maintaining Mechanical systems on military aircraft.\nExperience as a mentor, coach or instructor in an aircraft maintenance environment.\nExperience conducting Line Maintenance of aircraft in a Gulf Coast Country.EXPATRIATE EMPLOYEE BENEFITSIn return for the required high levels of commitment and hard work you will receive a competitive salary, rent free accommodation and access to free recreation facilities, all available within Company secured accommodation. In addition, a generous leave and travel allowance makes this an opportunity not to be missed.On successfully securing a role your appointment to Saudi Arabia will initially be on single status. On commencement of employment in Saudi Arabia you will have the opportunity to apply to have your family join you in the future. A full health care scheme is provided within Saudi Arabia.SAUDI NATIONAL EMPLOYEE BENEFITSIn return for the required high levels of commitment and hard work you will receive a competitive salary and benefits package, including a generous leave and travel allowance, a full health care scheme and access to subsidised recreational facilitiesBAE SystemsAt BAE Systems, we provide some of the world's most advanced, technology-led defence, aerospace and security solutions. We employ a skilled workforce of 89,600 people in more than 40 countries. Working with customers and local partners, we develop, engineer, manufacture, and support products and systems to deliver military capability, protect national security and people, and keep critical information and infrastructure secure.All appointments in Saudi Arabia are subject to receipt of all necessary Government and/or Customer approvals.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Management Consulting", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}