{"Job ID": "69866603", "Description": "Eurofins is the world leading Food Testing laboratory group, deploying a comprehensive range of state-of-the-art analytical techniques in order to support its clients' increasingly stringent quality and safety standards. We are present in India as Eurofins Analytical Services India Pvt Ltd and provide a comprehensive and one-stop testing service to businesses and organizations involved in food and feed processing, Agro products, Export, Hospitality and Retail chains.Responsible for microbiological testing in accordance with standard procedures\nResponsible for the management and supervision of the assigned production line(s).\nLead corrective action/preventive action (CAPA) for microbiological non-conformities.\nDevelop, implement and monitor laboratory methods and document reviews.\nResponsible for incoming testing of ingredients.\nLead corrective action/preventive action (CAPA) for microbiological and incoming quality non-conformities.\nRepresent the incoming quality assurance function for all external quality and regulatory audits.\nAssess and implement continuous improvement of laboratory efficiency and productivity.\nManage the department budget. Assess and implement applicable cost improvement plans related to the lab and microbial testing.\nTechnical resource for the plant and technical liaison for other business units.\nRepresent the microbiology function for all external quality and regulatory audits.\nManage the site internal microbiology audit program.\nConduct applicable internal audits annually.\nMaintenance of reference culture.\nResponsible to maintain high quality levels on all products while achieving high efficiency.\nHire and retain a diverse, highly qualified staff and provides ongoing performance feedback. Set goals which align to department plans and manages the execution of goals through coaching and mentoring. Maintain a safe and professional work environment.\nComply with regulatory requirements, Company policies, operating procedures, processes, and task assignments. Maintain positive and cooperative communications and collaboration with all levels of employees, customers, contractors, and vendors.Graduate /Post Graduate in Microbiology5- 7 years of experience in  Food Testing Microbiology dept Good interpersonal and communication skills.\nEnergetic, flexible and innovative.\nAble to work independently and to coordinate several activities simultaneously.\nGood in communication, read and write in English and local language.\nActs quickly and decisively.\nKnowledge in Microsoft Office (such as: Microsoft Word, Excel, Power Point, & etc.),Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}