{"Job ID": "69866184", "Description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.We welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!Job DescriptionDesign, define and implement medium to complex system requirements for customers and/or prepare study and analyze existing systems. Determine system specifications, input/output processes and working parameters for hardware/software compatibility.\nCoordinate design of subsystems and integration of total system.\nIdentify, analyze, and resolve program support deficiencies. Develop and recommend corrective actions.\nComplete Project task based on work assignment.\nDeliver & execute the assigned projects on time with good quality/ cost effectiveness and customer satisfaction\nKeep improving self-engineering capabilities and exchange best practice with other team members to improve team’s capabilities.\nSupport Team Leader / Lead Engineer on technical issues.\nWork closely with Team Leader / Lead Engineer to guarantee customer acceptance.\nEnsure project implementation follows the engineering delivery standard.\nMaximize reusable standard product and engineering in project delivery.\nTechnical implementation in whole life cycle of project / work package delivery.\nWork with Team Leader/Sr. Project Engineers to manage technical risk in project / work package execution.\nWork with Team Leader/Lead Engineer/Project Engineers to clarify technical issues.\nCoach and develop Project Engineers.\nCost reduction through process & manufacturing improvement, and through development of reusable engineering or engineering standard.Work closely with Team Leader to achieve customer acceptance. Demonstrate application & technical expertise to achieve repeat order and retain customer satisfaction.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}