{
    "Job ID": "69866211",
    "Description": "Associate Java Full Stack DeveloperCompany:Job ID:Date Posted:Location:Job Description Qualifications:At Boeing, we are all innovators on a mission to connect, protect, explore and inspire. From the seabed to outer space, you’ll learn and grow, contributing to work that shapes the world. Find your future with us.Boeing Global Services Digital Solutions team is currently looking to hire Associate Full Stack Developer (Angular and Java Experience) for Boeing India Engineering (BIE) Software to join their team in Bengaluru, India. As a Software Engineer, you will be part of the Boeing Global Services Digital Solutions team, which develops software applications and products that create direct value to its customers. We provide re-vamped work environments focused on delivering data-driven solutions at a rapidly increased pace over traditional development. Be a part of our passionate and motivated team who are excited to use the latest in software technologies for modern web and mobile application development. Through our products we deliver innovative solutions to our global customer base at an accelerated pace.We are looking for full stack developer who are very proficient in Angular Front end and Java backend tech stack, 3+ years of experience in Angular based development projects.Position Responsibilities:Estimate user stories/features (story point estimation) and tasks in hours with the required level of accuracy and commit them as part of Sprint Planning.\nContributes to the Backlog refinement meetings by promptly asking relevant questions to ensure requirements achieve the right level of DOR.\nWorks with the Product Owner to confirm that the code and acceptance tests reflect the desired functionality.\nRaise any impediments/risks (technical/operational/personal) they come across and approaches Scrum Master/Technical Architect/PO accordingly to arrive at a solution.\nUpdate the status and the remaining efforts for their tasks on a daily basis\nEnsures change requests are treated correctly and tracked in the system, impact analysis done and risks/timelines are appropriately communicated.\nDevelops working software towards committed Team PI Objectives and Iteration plans.\nDelivers working software in accordance with expected quality standards.\nDesigns for testability: Design and evolve the system to support testability and test automation.Works on prototyping and evaluates technical feasibilityEmployer will not sponsor applicants for employment visa status.Basic Qualifications (Required Skills/Experience):  (5-8 years)- Demonstrated ability to create positive impact on customer by developing polished, cohesive, effective, and   user friendly web applications for large and complex aviation related systems.- Hands on knowledge in the Architecting, Designing and Developing full stack modules and components for web applications. This position is for a full stack developer who has excellent programming skills in the latest tools & technology frameworks like, AngularJS, NodeJS, Bootstrap, HTML5, CSS3,  JavaScript, JQuery, Java8/J2EE etc. Experience in automated test environments/TDD/JUNIT is essential.- Must have experience with Spring Framework, REST & SOAP based Web Services and SOA, MySQL and  any other relational databases. Experience with Micro services based architecture.- Experience in Object Oriented Analysis and Design using Java and UML. Must have experience using  Software Design Patterns, Standards and Best Practices within the industry. Experience with Frameworks such as TOGAF, Enterprise Information Architecture, Enterprise Architecture Frameworks is preferable.- Experience with Azure Cloud is must, preferred any Azure certification- Experience in database modelling (MySQL/NoSQL databases such as Mongo DB)- Desire to learn and conduct hands-on experimentation, product evaluations and proof of concepts in various diverse array of technologies.- Hands-on experience with Build and Deployment tools and languages. Experience in best practices and  Tools around CI/CD.- Knowledge of integrating with Ant, Maven, GIT and Shell scripting.- Strong backend experience to develop Data Layer using at least one of the ORM frameworks like Hibernate,  JPA etc.- Good knowledge of database concepts with knowledge on writing SQL Queries and Stored Procedures.- Experience in understanding and interacting with multiple data formats- Ability to rapidly learn and understand software from source code.- Must have experience working with cross-functional teams spread across multiple products and locations.- Must be flexible, with a high tolerance for organizational complexity and ability to work with partners from within Boeing and outside, across different cultures and time-zones.- Extensive experience in collaborating within an Agile team setting, working as a group to drive Epic/Feature/  Story creation as well as solution design and architecture.- Should have excellent interpersonal and communication skills to earn trust, persuade, motivate and mentor other team members. To be effective, this person must earn the respect of the Scrum teams, Scrum   Masters, Technical Architect, and Release Train Manager, Business teams, customers and all other different stakeholders.- Candidate must be a self-starter with a positive attitude, high ethics, and strong analytical and creative problem Solving skills and a track record of working successfully under pressure in a time-constrained environment.- Ability to independently execute & deliver on the backlog without dependency or hand-holding.- Should be an excellent team player.- Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of education and experience (e.g. Master +4 years' related work experience.Preferred Qualifications (Desired Skills/Experience):Certification in Azure cloudTypical Education & Experience:Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of education and experience (e.g. Master +4 years' related work experience.At the highest level, diversity and inclusion are part of Boeing's values.  Having diverse employees, business partners and community relationships is vital to creating advanced aerospace and defense products and services for our diverse customers around the world. The company's commitment to diversity means providing a work environment for all employees that is welcoming, respectful and engaging, with opportunities for personal and professional development.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}