{"Job ID": "69865764", "Description": "\"Why work for Accor?We are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"We are Heartists®“Heartist®” describes both our culture and who we are. Everything we do comes from the heart, and we’re experts in what we do. Generous, attentive, and free, we ensure that everyone can come as they are, and feel like they belong. As one big team, we know that only together can we do amazing things!We believe that the world is more welcoming when we’re connected. So that we see what we have in common, instead of what sets us apart.Life in MovenpickThe Place to Savour Life- We believe true hospitality is about turning small gestures into heartwarming moments.We enable our guests to Savour the flavor of life, balancing small indulgence with what’s good for them- and good for the world.Hotel:Movenpick Hotel & Apartments BUR DUBAI Movenpick Hotel Apartments AL MAMZAR DUBAI The RoleTo supervise the assigned station / section, produce a consistent, high quality product, ensure a courteous, professional, efficient and flexible service consistent with Mövenpick Hotels & Resorts Standards Policies & Procedures in order to maximize guest satisfaction.Key Deliverables and ResponsibilitiesPlanning & organizing:The ability to make requisitions of all items needed for the next day, with the assistance of the chef de partie or senior chef on duty.\nThe ability to prioritise, plan and organise your daily tasks in order to ensure on time delivery as required.Operations:The ability to follow instruction and work closely with the senior chef, executive sous chef and executive chef.\nThe ability to work closely with the Chef de Partie or senior chef in preparing mise en place.\nThe ability to work as directed on station of assignment under the appropriate Chef De Partie or senior chef.\nTo report in the kitchen at your station at scheduled times regardless of beginning off shift or returning from meal break.\nTo wear uniforms according to Mövenpick standards.\nThe ability to work closely with standard recipes, photos and plate presentations in order to maintain quality standards and presentation in accordance with  Mövenpick established guidelines and standards\nThe ability to work neatly and clean; keeping all work areas and refrigerators organized and in accordance with sanitary requirements. “first in first out” & “if you make the mess, you clean it up”\nThe ability to follow HACCP guidelines and municipality regulations at all times.\nThe ability to follow clean as you go policy and keep work area clean at all times.\nThe ability to taste and season the food appropriately and to ensure it is well presented and of the standard and quality required before serving it to the guest.\nThe ability and desire to proactively learn, test and sample (eat) all world cuisines by whatever means possible whether through hotel programs and training or self-taught research and development.\nThe ability to keep waste to a minimum and work in a proactive manner to assist in meeting budgeted food cost levels\nThe ability to maintain a cooperative working relationship with fellow employees\nThe ability to perform other tasks or projects as assigned by hotel management and staff\nThe ability to leave enough mise en place for the next shift and utilize formalized production lists and following a shift-handover sop\nThe ability to accommodate all food server's requests when possible regarding guest's dietary requirements, personal preference and requests\nThe ability to handle and rotate food according to established procedures.\nThe ability to maintain the work area and equipment in a safe and sanitary manner.\nThe ability to maintain a positive attitude and a professional disposition.\nThe ability to maintain a full line of communication with supervisors and fellow workers and all hotel associates.\nThe ability to prepare and plate items (food orders) received from F&B staff regardless of hand-written or computer printed media in a timely and accurate manner.\nThe ability to check and complete mise en place pars in setting up the station.\nThe ability to turn off all equipment ensuring no safety hazard has been left behind\nThe ability to set up station properly and on time for each service period.\nThe ability to make sure all food is prepared by recipes designated by the chef de cuisine or senior chef.\nThe ability to make sure quality and quantity meets our standard.\nThe ability to notify chef de cuisine or senior chef of any problems or complaints as when they arise.\nThe ability to not leave your section without doing the final check.\nThe ability to be able to work in another area when needed and take part in cross training when directed.\nThe ability to be able to assist in same day preparation and advance preparation for another station as instructed by the supervisor\nThe ability to all food items for storage must be covered, dated and labelled according established guidelines, standards and checklists.\nThe ability to be able to work unsupervised.\nThe ability to be able to be flexible to the business demands and working hours.\nThe ability to; throughout the working day switch off and clean oven tops, kitchen equipment and work areas as well as all work surfaces.\nThe ability to be able to assist and direct the stewards with the daily cleaning tasks.\nBreaks and meals, as laid down in the LSOP. 2 x 15 min. And 1 x 30 min. For lunch and dinner, depending on hours of work\nFollow all kitchen regulations as outlined and directed\nSwipe in and out has to be done in uniform, not before getting changed.Administration:The ability to display an interest in all kitchen and hotel activities and help colleagues when and where ever possible\nThe ability to respond properly in any hotel emergency or safety situation.\nThe ability to be able to come to any and all kitchen meetings whilst on duty or otherwise.\nThe ability to sign acceptance for tools, knives, uniforms etc. And will pay back to the company for any loss or damage of said equipment.\nFill out the appropriate log sheets according our standard on a daily base\nBe aware of accident prevention and help enforce safe work habits – zero accidents is our goal.\nNo employee to be on the property after working hours without signed authorisation from a manager except for meals in the staff cafeteria\nOvertime will be approved on business demands by the chef de cuisine or executive chef\nAny violation of the above mentioned rules will be subject to disciplinary action.Generic Aspects on Hygiene / Personal Safety / Environment/Confidentiality:Ensure proper care of all equipment and furniture entrusted for Heartists use.\nBe well-familiar with the hotel's policies and procedures, well-acquainted with the physical layout of the hotel and its premises and knowledgeable of the hotel's emergency procedures in regard to fire, medical, bomb threat, black-out and evacuation.\nKnows the safety regulations and ensures their application & ensures the safety of people and property in the hotel.\nRespects and ensures respect of the hotel's commitments to the \"Environment Charter\" of Planet 21 program (saving energy, recycling, sorting waste etc).\nUnderstands and strictly adhere to the Rules & Regulations established in the Heartists Handbook and the Hotel’s policy on Fire, Hygiene, Health and Safety.\nEnsure that confidential records and other confidential information are properly safeguarded and are not removed from the office.\nDoes not disclose any financial information or any other information of the Accor Hotels.Our ValuesOur values are our common language, they drive us every day. Embodied in and flowing through our Heartist program, a symbol of our identity and culture, these values are the bedrock that binds us to the Group. They perpetuate and spread -beyond professions, persons, countries and cultures- the sense of hospitality and service, our strength and nourishment of the Group’s success worldwide.Guest PassionWe obsess over our customers. Our guests are the driver of our decisions and our actions. We put them first, we care for them. We go the extra mile for them. We enjoy doing it.Sustainable PerformanceWe believe that hospitality has the power to unlock a better tomorrow. We act for good to support & empower the communities in which we live and protect the planet that you visit.RespectWe are connected with the world, and to others. We enjoy the mix of cultures. We are proud of our differences. We put you first and we value you, whoever you are. We care for the planet.Spirit of ConquestOur guests are globetrotters, and so are we. We want to be where they want to be. We explore, we initiate, and we develop. We are ambitious for our guests. We make the impossible possible, we have fun doing it.TrustHospitality is a team sport, and we’re stronger when we trust and support each other. We believe in natural kindness, respect our differences and value all voices. We work as one team, to say what we do, and do what we say.InnovationWe dare to challenge the status quo. We embrace innovation and challenge ourselves to do things better and faster. We take risks, dream the impossible and make it possible.Diploma in Culinary Arts Diploma in Hotel ManagementStrong interpersonal and problem solving abilities\nFluency in English , additional languages are a plusJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}