{
    "Job ID": "69868182",
    "Description": "Manufacturing Quality Assurance work includes: Defining and specifying activities, processes, and standards to fulfill the quality requirements for a manufactured material, component, or product. Building and maintaining the infrastructure and systems necessary to consistently ensure the timely delivery of quality products. Auditing, monitoring, and determining the quality of manufacturing processes and/or outputs against defined internal and regulatory standards. Reporting and troubleshooting manufacturing process deviations and defects in finished goods An Experienced Professional (P2) applies practical knowledge of job area typically obtained through advanced education and work experience. May require the following proficiency: Works independently with general supervision. Problems faced are difficult but typically not complex. May influence others within the job area through explanation of facts, policies and practices. Roles and Responsibilities Being responsible for in incoming & in-process quality function of the breaker assembly line , have to interact with colleagues of various functions. Monitoring of the assembly process with respect to work instructions and other technical provisions. Capturing and analyzing the quality issues faced during assembly and testing of the product on regular basis and their resolution through CAPA and  DMAIC analysis. Knowledge of Casting, Machining processes. Manufacturing Processes of Switchgear Components. Analyzing customer complaints through CCRP, their resolution using quality tools and implementation of the improvements. Monitoring and maintenance of quality records ( i.e. traceability, calibration etc.). Preparation of NCR, RGA , their record maintenance and interaction with the suppliers for improvements. Final product certification using check sheets. Preparing and display monthly product quality data on the display board. Conducting process audit periodically. Coordinating the activities during internal and external audit. Performing routine testing as per Plant standards and IEC. Customer handling, inspection of breakers and erection/ commissioning breakers at site. Quality clearance for all tested products in SAP/ERP. Coordinating with Production for assembled breakers, inspection and organizing ready for testing. Labor Handling. Living core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your background A Diploma / BE in Mechanical  Engineering. Minimum 5 to max 10  yrs  on experience in Incoming , In process assembly quality and perform routine quality inspection and documentation /testing as per Plant standards and IEC. Familiar with all measuring and testing instruments / test equipment’s. Knowledge of Manufacturing  processes and  SAP/ERP systems is required. Experience in Switchgear , Automobile , Electrical equipment manufacturing will be added advantage.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Vadodara, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}