{
    "Job ID": "69866999",
    "Description": "Responsible for the diagnosis and treatment of medical diseases and conditions, as well as the provision of medical care in the field of Nephrology in accordance with the current medical staff bylaws, rules and regulations and the hospital’s policies and procedures*Clinical Responsibilities-Provides high quality patient care in all aspects of Nephrology according to his/her approved clinical privileges.-Provides consultation (inpatient, and emergency room) upon request and responds in a timely manner within the prescribed timeframe as outlined in KFSH&RC (Gen. Org.) policy.-Responsible for the timely completion, competencies, accuracy and eligibility of the medical record.-Provides on-call service and ensures availability and response time within the prescribed timeframe in accordance with hospital policy.-Conducts daily morning rounds to identify patients ready for discharge. Ensures that discharge orders are written 24 hours prior to discharge.-Performs any other clinical responsibilities related to Nephrology, as assigned.*Academic Responsibilities-Provides orientation, bedside training and supervision to interns, residents and fellows as assigned.-Participates in Department’s educational activities and training programs. Partakes in national and international medical conferences.-Maintains and enhances professional knowledge and continuing education requirements.*Research Responsibilities-Participates in clinical, basic and translational research projects in accordance with Research Advisory Council Policy in order to advance knowledge, improve the quality of post graduate education and contribute to the national and international recognition of KFSH&RC (Gen. Org.).*Administrative Responsibilities-Undertakes the administrative duties assigned by Head of Section or Chairman.-Participates in all mandatory departmental activities and serves on departmental and hospital committees and other administrative functions, as required.-Assists the department in the development and implementation of techniques and practices that help maximize the utilization of all resources within the department and across the KFSH&RC (Gen. Org.).-Abides by the current hospital and medical staff bylaws, all relevant rules, regulations and policies and keeps updated of any changes that might occur.-Follows all hospital-related policies and procedures.-Participates in self-and others’ education, training and development as applicable.Graduation from an accredited medical school, completion of required period of training in specialty and/or subspecialty, with Arab or American Board certification, membership and/or fellowship status in the United Kingdom and/or Canada or their equivalent.Seven (7) Years of training in specialty or subspecialty plus postgraduate training experience must be equal to or exceed seven (7) years’ experience in the subspecialty.N/AJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}