{
    "Job ID": "69866445",
    "Description": "Archirodon, having earned its reputation as a reliable and respected international contractor for more than a half century in the Engineering, Procurement and Construction (EPC) market, continues to create value to its stakeholders by executing complex EPC projects worldwide, in recognition of its superior standards of performance.  We have an outstanding record in completing major Energy, Marine, Infrastructure and Defense & Security projects around the globe and we pride ourselves on delivering over the years the kind of reliability and trust that the client has the right to expect from a major EPC contractor.We are constantly growing and are currently looking for QC Manager to join a top qualified and knowledgeable quality controls team in one of prospect project operations in NEOM, KSA.Would you like to be part of a dynamic EPC leader with global presence? We’d like to meet you.Join our worldwide journey. Build on something that matters!What you will need to do:Reports to the Project Manager, while maintaining dedicated line of communication with the Quality Director on overall project quality related matters, and the Corporate Material Manager if exists, on all matters concerning civil works materials.\nManages and coordinates all quality activities on site, including assignment of quality personnel (QC Engineers, QC Inspectors, Document Controllers, and 3rd Party Testing/Inspection Company) to particular activities / work areas on site.\n§  Reviews and monitors the application of Company IMS Policies and Procedures applicable to the Quality Department at Project level.  \nReviews Contract requirements to determine whether Company IMS documents (plans, procedures, and the like) can be implemented as-is in their entirety, or whether project specific versions are required, and advises the Quality Director and Project Manager accordingly.\nIn conjunction with the corporate department develops the Project Quality Plan, and monitors its implementation through audit, management review, document reconciliation, inspection, test, other verification activities and discussion with the Project Management Team.\nReporting the status of implementation of the Company Integrated Management System (IMS) at Project level to the Quality Director and advise of improvements / changes needed to improve the effectiveness of the Company Integrated Management System (IMS) at Project level.\nWhere needed, provides guidance, induction and training to site staff with respect to Quality Dept. aspects of the Integrated Management System (IMS).\nAssisting Project personnel to identify problems and potential or actual non conformances and monitor the effectiveness of the correction, corrective and preventive actions undertaken.\nIn conjunction with the Quality Director and Project Manager, developing the Project Quality Dept. staffing and resource plan to ensure the timely provision of adequate resources and ensuring all aspects of the works are provided adequate coverage in terms of QC Engineers and QC Inspectors, and to advise of deficiencies immediately to the Project Manager.\nEnsuring that all measuring and testing equipment under the control of the Quality Department are maintained in a good state of calibration and such records are available.\nEnsuring the preparation of quality documentation, including the review of construction documents for compliance with project quality requirements and the preparation of Inspection & Test Plans (ITPs) for inclusion in Method Statements.\nEstablishes the Daily Program of Inspection and Testing detailing the required inspections, tests and other verification activities.\nMaintains the site facility for filing quality records, and, maintains document registers in connection with quality records.\nDevelops and keeps up-to-date, the Project Quality Audit Schedule, and undertakes periodic audits of the Project Integrated Management System, including project disciplines, suppliers and subcontractors, and report findings to the Project Manager and the Quality Director\nPrepares Monthly Project Quality Reports for submission to the Corporate Quality Dept. and any other Project Quality Report required by the Contract to be submitted to the Employer via the Project Manager.\nLiaises, attends meeting and maintains close contact with the Employer’s quality representative regarding quality matters on site and/or as affecting the work.\nIn conjunction with other members of the Project Management Team, determination, assemble and preparation of final document dossiers and record packages for submission as part of the final handover Project documentation.What you will need to have:Bachelor’s degree in Civil Engineering from a recognized/ reputed University.\nCertified as Lead auditor ISO 9001:2015\nMinimum 7-12 years of working experience as a project quality control manager.\nExperience in managing large-scale capital projects by performing regular reviews and critical inspections as and when required.\nMarine/Civil Projects experience.We are someone who:Strong Leadership and communication skills\nIs able to work both independently and as team leader, exercising professional judgment and coordination skills\nHas excellent organizational skillsWhat's in it for you: Expat package is on the shelf, yet the real joy comes from being a member of smart and passionate teams, within an international leading EPC Group on a mission that matters. We create mega construction projects - literally around the globe - with meaningful impact on the local communities for the years to come. At Archirodon, you will find a proud, productive and human-centric culture, caring for and building on our people and their development! Please note that you will be contacted only in case you are shortlisted for an interview. In the meantime, do not hesitate to stay in touch and keep monitoring our open vacancies and our LinkedIn page!  Rest assured that your application will be treated with strict confidentiality and under all applicable data privacy regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}