{
    "Job ID": "69866233",
    "Description": "Reports ToCountry Print Marketing lead.Job OverviewLead content / product development, of worksheet based  learning platform for school going children of the age 3-12 years old. Lead by printable content , the philosophy of this platform is that in younger age we need to teach children not what to learn but how to learn. And paper pencil tasks help strengthen the muscle for better learning outcomes in the future. This role will be responsible for designing content / product that will drive content monetization and secure partnerships to scale subscribersResponsibilities and DutiesContent DevelopmentIdentify unmet customer needs , conceptualise new products that users / consumers are willing to pay value for .\nIdentify and drive partnership with new age , progressive education content creators\nContent creation and costs optimisation.\nHosting & Discovery with Other partners\nEnsuring business result.Marketing Alliance PartnershipPartners identification in ed etch and other areas as per the marketing strategy for Print & PC business\nDigital content distribution Via OTT, Educations and other identified platforms and explore Partnership opportunity\nTrack Performance / corrective measure & Improvement action.\nPlan and align Business object with EdTech the partner.\nRegular engagement/Feedback from EdTech partnershipTech and analytics implementationTech based tracking and in sighting basis tech dataDevelop a self-sustainable business model that builds this platform to become a hub for content syndication – a marketplace for education content creators, source of traffic for EdTech content creators to drive traffic and a platform for children to showcase their abilities.Develop a self-sustainable business model that builds this platform to become a hub for content syndication – a marketplace for education content creators, source of traffic for EdTech content creators to drive traffic and a platform for children to showcase their abilities.QualificationsExperience: 7 – 12 years’ experience in content management and community management, experience in current ed tech companies  or working with education content creators and forging partnerships will be an add on.Self-driven and motivated individual interested in setting up new product business model and takes pride in driving results.#LI-PostAbout HPYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.Our history: HP’s commitment to diversity, equity and inclusion – it's just who we are.From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}