{"Job ID": "69867764", "Description": "Position Title: Territory ManagerDepartment: Commercial - SalesLocation: Karachi&nbsp;We’re looking for a highly-driven and motivated “Territory Manager” for our team in Karachi. If you are looking for a place where you can gain hands-on exposure and have a direct impact, then this may be the place for you! The ideal candidate will have a track record as a significant individual contributor – comfortable working independently, whilst working closely with the management team. This role will be based in Karachi and will report to Senior Area Sales Manager.&nbsp;Responsibilities:Conduct external face-to-face meetings with vendors, including furnishing the onboarding training manual tailored-fit for a specific partner, supporting vendor issues, and being in contact with them.\nResponsible for onboarding various restaurants/shops/marts at different locations in the country.\nWork closely and proactively with the Supply, Live Operations, Sales, Account Management, and Content Teams in ensuring all tasks and requirements are both accurate and conducted in a timely\nway.\nResearch accounts, identify stakeholders/decision makers, and generate interest about foodpanda.\nOversee vendors that are newly onboarded to the platform and drive operational excellence\nwithin the platform on metrics including commercial performance, internal tools, systems, and any other special projects.\nResponsible for the development of vendors after acquisition and maximizing their potential, including but not limited to supporting the onboarding and incubation process for restaurants/shops.\nManage and resolve vendor-related inquiries, issues, and escalations.\nAbility to work with different teams (inter and intra-department) to ensure a smooth vendor journey and high-quality of vendor experience within the platform.\nVisiting field on daily basis to make all targeted shops are being onboarded properly.\nResponsible to bring remaining strategic brands on foodpanda portal and no category is missed from available restaurants/shops in assigned region.\nMaintaining the log and updating records of inventory on salesforce.\nProvide all relevant training and support required during the initial first month of onboarding.&nbsp;Requirements:Bachelor’s/Master’s degree in Sales/Marketing or business-related field.\n1 years field sales and key account management experience.\nMust have strong work ethic, self-starter approach, integrity and demonstrated ability to lead and develop him/herself &amp;amp; a high performing team.\nCapacity to understand all sales functional areas i.e. Channel &amp;amp; Category Sales.\nPrior experience in managing field sales team&nbsp;A little About Us:We are fast, like mind boggling fast! So if you’re someone who loves ever changing goals and loves optimization, you’re the right fit for us!&nbsp;\nWe love people who can develop things from scratch, own them and then work on improving them.&nbsp;\nWe love what we do, and we don’t rest until we’ve achieved our targets. So if you’re also someone who is driven until the dream is achieved, come join us!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}