{
    "Job ID": "69866281",
    "Description": "Job Description:Job Title – Asst Vice President – Central Risk & Control (Corporate Bank & Branch Operations)Location – Bangalore, IndiaRole DescriptionThe Risk Team is responsible for supporting operations with first line operational risk management across Corporate & Investment bank and supports risk assessment for payment gold standards across DB group. This role will require to execute day-to-day operational risk & control testing work related to various DB group operations sub functions and contributes to the delivery of the risk assessment reviews.The candidate will play key role in the delivery of reviews & control quality assurance testing in line with payment gold standard policy.In this role as Assistant Vice President, the candidate is required to work closely with the various ERTs (embedded risk teams), Operations, IT and Business Managers as well as the 2nd and 3rd Line of Defence to ensure effective management of Operational Risk.This is a high visibility role requiring ability to work independently with limited oversight, learn complex concepts quickly, build strong relationships, working collaboratively with business & technology teams globally. Independent in judgment and with unquestionable personal integrity and ethic. Able to challenge and be challenged whilst maintaining the highest levels of professionalism.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilities:Advising and educating embedded risk team on risk management. Perform independent risk assessment / QA Reviews / internal audits along with strong communication skills\nSelected candidate will manage payment gold standard QA reviews across various business divisions of the Bank.\nEnsure that the quality of work stands up against key stakeholders’ scrutiny and challenge, e.g. an independent person can re-perform reviews and arrive at the same conclusion / can understand issue write-up covering root cause of control gap, residual risks and its impact\nWork collaboratively with key stakeholders to challenge and agree a sound and practical remediation plan\nTo work as dedicated relationship manager for key business/products and work closely on payment gold standard reviews\nShould be able to support management reporting on review progress & escalations.Your skills and experienceWith 10-12 years of operational Risk & Control Experience with investment/corporate banking & core banking, Understanding on regulations and typologies. Strong Risk, process, and control validation/testing and/or assessment skills.\nPrior experience in coordinating with global team & stakeholder management\nStrong familiarity with risk management framework and different risk stipes mainly focused on payment related risks\nStrong technical understanding of the financial services’ regulatory environment, with a focus on JST/ECB, FRB requirements.\nStrong project management skills and ability to provide oversight across regions\nDemonstrate very strong understanding of Payment Gold Standard Policy in the Bank. Prior exposure to Payment applications in the bank will be an added advantage.\nExcellent verbal and written communication in English.How we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}