{"Job ID": "69869944", "Description": "Job title:\nIntegration Consultant\n Your role:Designs, develops, tests, implements, and maintains interfaces.\n\nParticipates in support and on-call activities.\n\nParticipate and lead integration projects by analyzing vendor specs, developing interfaces, and troubleshoot any issues.\n\nPerforms source code/versioning management function adhering to technical management guidelines.\n\nDevelop HL7 Real Time interfaces in alignment to the business and technical requirements.\n\nCollaborates with application and project team(s) to define design and unit testing scenarios and scripts in alignment with business and system requirements.\n\nContribute to and maintain a thorough understanding of application and integration standards, policies, and procedures.\n\nEnsures integration development deliverables are completed on a time, budget, and quality.\n\nResearches and recommends appropriate integration development best practices, and toolsYou're the right fit if: (4 x bullets max)Have 4- 8 years of experience working with Orion/Lyniate Rhapsody integration engine\n\nHave 3+ years of experience with JavaScripts\n\nHave working knowledge of integration standards like HL7 V2.x, FHIR, DICOM, IHE\n\nDesigns, develops, tests, implements, and maintains interfaces\n\nParticipates in support and on-call activities.\n\nParticipate and lead integration projects by analyzing vendor specs, developing interfaces, and troubleshoot any issues\n\nKnowledge and a general understanding of CCD, CCDA, C#,\n\n5+ years of hands-on experience with programming such as CoreJava, Javascript, etc\n\nGood experience with healthcare EDI/HIE, HL7 and FHIR interoperability standards and clinical workflows\n\nKnowledge of TCP/IP, FTP, SFTP, HTTP and HTTPS protocols\n\nWork experience with XML, SOAP, JSON and REST technologies\n\nExperience working with SQL database\n\nWork experience with integration of systems such as Hospital EMR, PACS, Modalities\n\nPerforms source code/versioning management function adhering to technical management guidelines\n\nExperience working directly with engineers to design and iterate on highly complex, technical solutions\n\nDevelop HL7 Real Time interfaces in alignment to the business and technical requirements\n\nCollaborates with application and project team(s) to define design and unit testing scenarios and scripts in alignment with business and system requirements\n\nResearches and recommends appropriate integration development best practices, and tools\n\nKnowledge of Computer Networks in Windows/Cloud environment]About Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.#LI-EU\n#LI-Hybrid\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}