{"Job ID": "69861016", "Description": "Position at Star TwarSecondary Islamic Teacher Role ProfilePurpose of RoleStar International School, Al Qusais is looking to recruit a strong, resilient and innovative Secondary Islamic Teacher to join our growing school in October 2023.Star International School Al Twar and Al Qusais is a part of the International Schools Partnership (ISP). The International Schools Partnership (ISP) is a growing group of committed colleagues in financially responsible schools around the world, all of which aim to be the school of choice in their local area. Learning is at the heart of everything we do for our pupils, colleagues and parents. We are committed to getting better, all the time. Star International School is a bespoke English Curriculum school catering to students from FS1 to Year 13 and is located in the heart of Dubai. Star currently has 625 students.ISP PrinciplesBegin with our children and students. Our children and students are at the heart of what we do. Simply, their success is our success. Wellbeing and safety are both essential for learners and learning. Therefore, we are consistent in identifying potential safeguarding issues and acting and following up on all concerns appropriately.Treat everyone with care and respect. We look after one another, embrace similarities and differences and promote the well-being of self and others.Operate effectively. We focus relentlessly on the things that are most important and will make the most difference. We apply school policies and procedures and embody the shared ideas of our community.Learn continuously. Getting better is what drives us. We positively engage with personal and professional development and school improvement.SecondaryIslamic TeacherKey ResponsibilitiesReporting to: Head of SecondaryResponsible for: Year 7 - 13We are seeking to appoint an outstanding secondary school Islamic teacher to join our supportive, efficient and successful team. The successful candidate will be required to teach Year 7 – Year 13 classes, working as part of a team to deliver the secondary Islamic A curriculum with additional pastoral care responsibilities.The successful candidate will need to be positive, enthusiastic and creative in their approach to our school vision: ‘To develop Star members in the local and global community, who are able to lead themselves and others; through their love of independent learning and their compassion for humanity’.Skills, Qualifications and ExperienceRelevant British teaching qualification: to teach Secondary School Islamic A (a Bachelor’s degree and a recognised teaching qualification)\nA minimum of 2 years recent teaching experience in KS3,KS4 and KS5 [Arabic A and Islamic A]\nA good working knowledge of the latest UK practice from either the UK or a British Curriculum school overseas\nA good knowledge MOE curricula.\nExcellent communication skills to lead by example, as well as collaborate with Key Stage leaders, Senior Management and parents\nBe flexible and adaptable to the ever changing world of education\nBe reflective and passionate about self-development whilst contributing to the high standards of the school\nHave the ability to research new initiatives and implement them whilst evaluating current processes\nHave the ability to confidently utilise assessment for learning strategies and a variety of tasks to enhance learning\nBe proficient in ICT and learning technologies.\nDemonstrate leadership qualities and the willingness to support colleague development.ISP Leadership CompetenciesYou consistently demonstrate and role-model the ISP Leadership Competencies in all that you do.Collaboration. Takes an active part in leading their school or region;is cooperative and a genuine team player, developing positive, supportive relationships with colleagues to solve problems and maximise opportunities.Learning & Getting Better. Continually demonstrates personal commitment and passion for learning and getting betterusing evidence and feedback; supporting others in their continual learning, development and growth.InnovationLeadership.Is good at creating an environment where ideas for learning initiatives and services are generated and is able to motivate and inspire others through the process of creation through to completion.Outcome driven. Can be counted on to find solutions. Is consistently looking to exceed goals and is focused on KPIs.Resilience. Can deal with setbacks and challenges calmly and effectively.Community Focus.Is committed to meeting and exceeding the needs and expectations of our students and their families.Integrity & Ethical Management.Has the ability to work ethically and with integrity; helps others feel valued; upholds and models the ISP Vision, Purpose and Principles.Leading & Inspiring Others.Supports, encourages and inspires students, colleagues and teams so that they give their best.Understanding People.Is a very good judge of talent, can objectively articulate the strengths and motivations of people inside or outside the organisationJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}