{"Job ID": "69866818", "Description": "Job Requisition ID: 155590 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the role\nThe Procurement Analyst will provide analytical support to Research and Analytics (R&A) vertical within the Group Procurement Department (GPD) for departments reporting requirements.What you will doCollect comprehensive projects & savings data\nConsolidate collected savings data\nSpend Analysis: Conduct spend analysis by extracting, cleaning, transforming/enriching the spend data & presentation for management review\nEnsure Operational efficiency\nEffective internal customer relationship management\nReporting & PresentationsRequired skills to be successfulMinimum 2 years’ experience in data spend and analytics with understanding of customer and market dynamics.\nPrevious hands on experience in dealing with raw data handling and reporting tools.\nProficiency in Microsoft Excel and Data PowerPoint Presentations are must.\nData collection, cleaning and preparation skills\nBudget planning and management\nStatistical knowledge and time management\nWriting and communication\nProblem solving skills\nReporting and visual presentation skillsAbout the team\nThe role will report to the Procurement Manager and will be based in Dubai Festival City.What equips you for the roleFull time Bachelor’s Degree in Business Management, Commerce/Finance or equivalent\nAny Procurement, Data Analytics Tool skill is an added value\nStrong verbal and written English communication\nArabic or other languages such as Hindi/ Urdu are an added valueWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}