{"Job ID": "69867092", "Description": "Responsible for verifying medication orders, preparing, compounding, dispensing medications, and counselling patients in accordance with accepted standards and established pharmacy policies and procedures.Reviews,evaluates, processes, and medication orders for demographic data (e.g., gender,age, and weight), appropriateness of therapy, dose, frequency, route, dosageform, interactions, allergies, related laboratory values, and possible druginteractions.\nAdvises/counsels patients and answers questions aboutmedications (including indication, possible side effects, interactions amongdifferent drugs as applicable to the area of practice.\nDocumentsinterventions and recommendations/ clarifications in the electronic HealthInformation System as applicable.\nMaintains control and security of all medications includingcontrolled, narcotic substances and supplies. Maintains dispensing and recordkeeping as per laws and regulations.\nProvides druginformation including but not limited to drug selection, dosage, interactions,monitoring, and side effects, etc to all health care providers.\nSupervises, precepts,checks, and monitors medication related acties/performance of lower/ junior pharmacists,residents, trainees/students.\nAssists andguides health care providers with issues related to the medication managementand use system.\nParticipates/assists in conducting performance/qualityimprovement projects.\n Follows all Hospital’s related Policies andProcedures.\nParticipates in self andothers' education, training and development, as applicable.Master’s or Pharm.D./Bachelor’sDegree in Pharmacy is required.Two (2) years of relatedexperience with Master’s, or four (4) years withPharm.D./ Bachelor’s Degree is required.      N/A.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}