{"Job ID": "69866170", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Transport CoordinatorWork DynamicsWhat this job involves:Ensuring end-to-end transport coverageAre you a stickler for getting things done in their proper order? If so, then you might just be what we’re looking for.Reporting to the facility manager, you’ll provide efficient and cost effective transport service to the client. You’ll also see to it that each vehicle leaves at the exact appointed time, and that the start time and kilometre readings are constantly logged for documentation.Likewise, you’ll ensure that our staff log their boarding and initial pick up time—and that only those listed on our roster sheet are picked up. Should the need arise, you’ll also make sure that approval is on hand for staff in need of pick up.You’ll also help maintain a 24/7 transport helpdesk, which will provide call logging services and handle queries and concerns. On top of these, you’ll also monitor and report cases of speeding and other incidents to the Transport Helpdesk, and communicate with them over the radio when needed.Furthermore, you’ll be in charge of filling our log books upon arrival to the client’s site, but leaving out any excess mileage.Serving as a go-between among teamsBeing a part of the JLL family, you’ll be constantly collaborating with teams across the board—especially in this role. As the person in charge, you’ll be central in supporting the transport team at the client’s facility.  You’ll also be responsible for keeping in touch with our vendor supervisors.In addition, you’ll keep a record of important transport-related phone numbers. Also part of your scope is to prepare work orders and assign a unique reference number for each transport request. Your superior analytical skills will also prove handy, as you’ll look into and prepare daily, weekly and monthly transport reports.Sound like you? To apply you need to have:A strong drive toward excellenceWorking at JLL, you’ll see yourself working with many of the industry’s premier talents and innovators. That is why you must have a laser beam focus on excellence.To land this job, you must be a graduate of any discipline with three to five years’ experience in transport management in a BPO setting. You must also demonstrate an aptitude in working with a team. Furthermore, you must have a solid background in developing and monitoring improvement programs.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Location:Job Tags:If this job description resonates with you, we encourage you to apply, even if you don’t meet all the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}