{
    "Job ID": "69865952",
    "Description": "Overview Assist the Finance Director in providing the analytical and planning support to the Commercial team to help in delivering financial excellence across Commercial teams. The FP&A Commercial manager is responsible for setting up annual budgets, control and track the set plan, and providing the diagnosis and resolution of key issues, improve understanding of MU economics, and facilitate the development of performance targets for functional business partners. The FP&A Commercial manager provides insights to the Commercial business partners and department managers regarding cost reduction opportunities and assist in delivering on the productivity targets. Coordinate the preparation of Commercial strategic plans and providing scenario planning and analysis. The FP&A Commercial manager maintains a strong collaboration with Commercial organization and is accountable for driving a strong control environment. Responsibilities Leading on Core activities in the planning team. Lead on developing annual, quarterly and monthly forecast cycles with Sales and Marketing teams for BU revenue, volume and mix. Evaluate pricing plans with their impact on Volume and P&L. Own (D&A) planning and actual reporting and analysis. Daily, Weekly and Monthly monitor of actual revenue and trends vs latest forecast and report deviations to management on a timely basis. Month-end closing detailed analysis of BU performance Vs Plan. Preparing Business cases for Sales and Marketing initiatives highlighting any potential risks and opportunities vs actual and plan. Insure timely reporting of BU DAPLR and number accuracy. Own BU Innovations Planning, reporting and analysis. Own A&M budgeting, spend control and spending evaluation both before and after commercial activities. Ensure BU meets it’s annual operating plan targets on: Volume Revenue Mix Innovations Maintaining D&A Spend within AOP Timely issuance of DAPLR reports Qualifications Knowledge: Solid Finance and Accounting Experience, Planning & Analysis Background, good knowledge of PepsiCo P&L components and Business case development. Education: Finance / Economics degree from an accredited school Preferably CPA/CMA/MBA Holder Prior Work Experience: Min 10-12 years of experience in multinational FMCG SAP / HFM knowledge is a plus Language Proficiency: Fluency in both spoken & written English & Arabic language is required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}