{"Job ID": "69867702", "Description": "As an engineer in the Product Led Growth team, you will play a pivotal role in driving the growth of our company by re-architecting and building the Packaging and Pricing code base, enabling self-serve purchase options, and optimizing cost options. You will not only contribute to the technical aspects but also play a key role in optimizing user acquisition, activation, retention, and revenue generation through data-driven experimentation and innovative marketing strategies.&nbsp;Technical StackOur applications are written in TypeScript and Javascript on Angular, with a Ruby-on-Rails backend storing data in Postgres\nOur services are written in Java and Golang\nOur proprietary data engine Helix caches, manages and queries customer data\nOur infrastructure is ECS Fargate containers on AWS, managed with TerraformWhat you'll doDevelop our core web applications for data analysts and business users\nDefine and maintain development practices that let us move fast with quality\nWork with a wide range of tools and technologies (from SQL to Ruby, Ruby on Rails) and be able to evaluate technologies for what we are building\nCollaborate with a small cross-functional team of Engineers, Product Managers, and Designers to build, test, and ship new user facing code\nLearn from others and teach those around youWhat we look for3-5 years of experience in relevant tech stack\nYou’ve worked with Ruby on Rails or have good aptitude with programming languages like Go, Java, Django on Python, Elixir.\nYou have built and shipped web applications\nExperience with testing, continuous integration, and continuous deployment#LI-AD1&nbsp;What makes ThoughtSpot a great place to work?ThoughtSpot is the experience layer of the modern data stack, leading the industry with our AI-Powered Analytics and natural language search. We hire people with unique identities, backgrounds, and perspectives—this balance-for-the-better philosophy is key to our success. When paired with our culture of Selfless Excellence and our drive for continuous improvement (2% done), ThoughtSpot cultivates a respectful culture that pushes norms to create world-class products. If you’re excited by the opportunity to work with some of the brightest minds in the business and make your mark on a truly innovative company, we invite you to read more about our mission, and apply to the role that’s right for you.ThoughtSpot for AllBuilding a diverse and inclusive team isn't just the right thing to do for our people, it's the right thing to do for our business. We know we can’t solve complex data problems with a single perspective. It takes many voices, experiences, and areas of expertise to deliver the innovative solutions our customers need. At ThoughtSpot, we continually celebrate the diverse communities that individuals cultivate to empower every Spotter to bring their whole authentic self to work.We’re committed to being real and continuously learning when it comes to equality, equity, and creating space for underrepresented groups to thrive.&nbsp;Research shows that in order to apply for a job, women feel they need to meet 100% of the criteria while men usually apply after meeting 60%. Regardless of how you identify, if you believe you can do the job and are a good match, we encourage you to apply.&nbsp;About ThoughtSpotThe world’s most innovative companies use&nbsp;AI-Powered Analytics&nbsp;from&nbsp;ThoughtSpot&nbsp;to empower every person in their organization, from C-suite executive to frontline employee, with the ability to&nbsp;ask and answer data questions, create and interact with data-driven insights, and use these insights to make informed decisions and take action.&nbsp;ThoughtSpot is simple enough for any business person to use, yet built to handle even the largest, most complex data, wherever it may reside. That’s why customers like T-Mobile, BT, Snowflake, HubSpot, Exxon, Daimler, Medtronic, Hulu, Nasdaq, OpenTable, Huel, and Nationwide Building Society have turned to ThoughtSpot to transform their data driven decision-making cultures.You have read and understood the Candidate Privacy Notice (“Notice”) and acknowledge the collection, processing, use and disclosure of your personal information as set out in the Notice.\nYou are not required to provide any requested information to us, but failure to do so may result in not being able to continue your candidacy for a job with us.\nThe information you give us is true and correct to the best of your knowledge and belief, and you have not knowingly omitted any related unfavorable information. Providing any inaccurate or misleading information may make you ineligible for employment.To all recruitment agencies: ThoughtSpot does not accept agency resumes. Please do not forward resumes to our jobs alias, ThoughtSpot employees, or any other organization location. ThoughtSpot nor its employees are not responsible for any fees related to unsolicited resumes.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}