{
    "Job ID": "69869524",
    "Description": "GM is in the midst of a generational shift. Our consumers and our industry demand products that deliver beyond the vehicle, and technological readiness is critical to long-term adaptability and success.Even more, we aim for a higher vision at GM: a future of Zero Crashes, Zero Emissions and Zero Congestion.Our product portfolio, its composition and transition over the next decade, is a core component to how we reach this future, and do so profitably, competitively, and always with the voice of our customers at the center.With this approach, AMEO will have the right Product, with the right Content, at the right Price to move and connect people to what matters for decades to come.The Product Planning & Definition Manager is the ambitious advocate for these programs. They lead on guiding local and regional leadership through each early development gate: what we are trying to achieve, how we will win against competitors what must this look like to succeed.The Manager develops a robust product strategy, including:Ensure launching the right product for the right customer\nProduct Strategy\nBusiness Case Development\nCompetitive benchmarking\nPrice development with Segmentation and Customer-Perceived Value\nTrack product marketing launch plans from framing the product till runout\nAreas of opportunity & lifecycle development\n And presents this strategy and represents the market at:Egypt PRM reviews and AMEO Regional Product Boards\nGM International Operations (GMIO) Product forums\nProgram / ECE forums (as required)This advocacy is core to how we engage and influence our product adoption and readiness with the GM Homeroom or Joint Venture teams.Insight must be done with our customers’ perspective and ensure continuity through arrival in market, which the Product Planning & Definition Manager secures through constant cross-functional relationships with:AMEO & GMIO Planning\nMarket Research\nProduct Marketing\nFinance\nSales & Distribution\nQualityInnovation is at the core of Product Planning, and the Manager is entrusted to bring questions/ideas to Egypt, AMEO and GMIO forums to develop:Approval for Studies / Change Requests through Notice of Decision to grow, streamline and clarify our portfolio\nSupport and include Program Change Requests for customer and market-beneficial content/features\nMarket insight for future portfolio and untapped opportunities with our Advanced Portfolio team\n BackgroundKnowledge of mobility landscape, electric vehicles including competition and customer trends\nCross functional experience\nUndergraduate degree in Engineering, Manufacturing, Business, Marketing, Finance, or similar\nUnderstand the Automotive market In Egypt as well as the competition\nInternational experience (ability to negotiate and work effectively with people from other cultures)\nUnderstanding of GM product & brand positioning within the regionSkills & CompetenciesStrong facilitator/negotiator based on sound interpersonal and communication skills\nAbility to prioritize and handle many tasks\nAbility to use knowledge in a manner that is easily understood and compelling\nAbility to have affected parties move in a similar direction\nExcellent presentation skills\nAbility to set high impact objectives and hold people accountable\nData Judgement\n\nRelationship Management\n\nResults-Focused\n\nLearning Agility\n\nCustomer Orientation\n\nAnalytical Thinking\n\nNegotiation\n\nStakeholder OrientationOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.We aspire to be the most inclusive company in the world. We believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Our Work Appropriately philosophy supports our foundation of inclusion and provides employees the flexibility to work where they can have the greatest impact on achieving our goals, dependent on role needs. Every day, we want every employee, no matter their background, ethnicity, preferences, or location, to feel they belong to one General Motors team.General Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers.   We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteeropportunities. We encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}