{
    "Job ID": "69868167",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC, and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organizations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an experienced professional to join our team in the role of Senior Consultant SpecialistIn this role, you will: Perform effective threat and control assessments of services within our internal, external and cloud estate.\nLiaise with Developers, Architects, and other Technical Leads to understand the end-to-end service and identify where there are any control gaps.\nUnderstand the Business requirements, evaluate potential products / solutions and provide technical recommendations.\nBe \"hands on\" with technology and contribute to the design, development, and the support of projects with security recommendations.\nIdentify threats across the IT estate; including applications, databases, network and other infrastructure components.\nEngage with other Cybersecurity teams, senior management and members of the Business when confronted with potential security issues.\nContribute to process, procedures, and tool identification/development.\nStrong stakeholder management and communications skills\nStay up to date with industry new trends and best practices\nAbility to complete tasks independently to a high-quality standardJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}