{"Job ID": "69867365", "Description": "BackgroundDiversity, Equity and Inclusion are core principles at UNDP:  we value diversity as an expression of the multiplicity of nations and cultures where we operate, we foster inclusion as a way of ensuring all personnel are empowered to contribute to our mission, and we ensure equity and fairness in all our actions. Taking a ‘leave no one behind’ approach to our diversity efforts means increasing representation of underserved populations. People who identify as belonging to marginalized or excluded populations are strongly encouraged to apply. Learn more about working at UNDP including our values andinspiring stories.UNDP does not tolerate sexual exploitation and abuse, any kind of harassment, including sexual harassment, and discrimination. All selected candidates will, therefore, undergo rigorous reference and background checks.The United Nations Development Programme (UNDP) is the UN’s global development network, advocating for change and connecting countries to knowledge, experience, and resources to help people build a better life. We are on the ground in 170 countries and territories, working with governments and people on their own solutions to global and national development challenges to help empower lives and build resilient nations.UNDPhas an important role in supporting health outcomes by supporting countries to address the social, cultural, and economic determinants of HIV and health, in partnership with UN entities and other organizations. This is done through UNDP’s core work in reducing inequalities and social exclusion that drive HIV and poor health, promoting effective and inclusive governance for health, and building resilient and sustainable systems for health. UNDP also contributes through its coordinating and convening role in bringing together multiple partners and resources at national and local levels.As a trusted, long-term partner of The Global Fund to Fight AIDS, Tuberculosis, and Malaria (Global Fund, GF), UNDP’s value proposition lies in providing an integrated package of development solutions to strengthen institutions to deliver health services. Through its contributions as interim Principal Recipient (PR) and provider of technical assistance in over 53 countries since 2003, UNDP’s provision of integrated policy, implementation, and capacity development support to countries has yielded significant health and development results in challenging operating environments. Proactive risk management and investing in sustainability are the cornerstones of UNDP’s portfolio management approach and providing technical assistance to national counterparts during all phases of implementation, strengthening legislation, policies, and regulatory frameworks, and building capacities across key functional areas, including financial management, health information systems, procurement, and supply chain management. The Global Fund – Health Implementation Support Team, HIV, Health and Development Group,=The Bureau of Programme and Policy Support, Global Policy Network(GF/HIST) is a dedicated team providing support to UNDP Country Offices implementing health and development programmes.UNDP has been identified by the GF as the interim PR for the Pakistan HIV grant for the implementation period of 1 July 2021 to 31 December 2023. For effective implementation of the Global Fund resources, UNDP Pakistan has established a Program Management Unit (PMU), which is responsible for the day-to-day overall programme management, risk management, policy guidance, financial accountability, procurement of goods, including health products and services, strengthening of the national systems. The GF resources are implemented in accordance with UNDP rules, policies, and procedures, the grant confirmation, corporate agreements with the GF and in close coordination with the national and provincial stakeholders, Common Management Unit, Sub-recipients (SRs), NGOs, CSOs, communities, technical partners, UN entities and the Global Fund (Local Fund Agent) and Country Coordinating Mechanism.Under the direct supervision of the Procurement and Supply Management Specialist and in close coordination and collaboration with the Procurement and Supply Chain Specialist, the Procurement Officer works to ensure the proper execution of procurement activities and services for the HIV grant in Pakistan. This will be done in accordance with UNDP rules, policies and procedures, the grant agreement, and corporate agreements with the GF, and working in partnership with national and provincial stakeholders, Sub-recipients (SRs) and Sub-sub-Recipients (SSRs) and close coordination with the GF (including Local Fund Agent), CCM, technical partners, and UN entities, and the GF/HIST\n Duties and ResponsibilitiesElaboration and implementation of project procurement activities with the following key responsibilities:Ensure full compliance of procurement activities with UNDP rules, regulations, policies, and strategies; implementation of effective internal control, and proper functioning of a client-oriented procurement management system.\nPrepare and draft the procurement documentation of the project including RFQ, RFP as well as micro purchasing and other direct sourcing when applicable.\nAdvise on projectprocurement activities and sourcing strategies that meet UNDP procurement principles and liaise with relevant corporate procurement entities for advice and follow-up in coordination with CO.\nPreparation of reports as requested on the status of procurement activities.\nMake presentations to national counterparts and other stakeholders on UNDP procurement process and the status of specific procurement processes if needed.\nElaboration and implementation of cost-saving and reduction strategies in project procurement.\nImplement contract strategy for the project including tendering processes and evaluation,contractor appraisal, evaluation and negotiation of offers, management of the contract and contractor, legal considerations and payment conditions, and risk assessment.\nConceptualize, elaborate, and implement strategic procurement in the project including sourcing strategy,supplier selection and evaluation, qualitymanagement, customer relationship management, e-procurement introduction and promotion, and performance measurement.\nRespond in a timely manner to any queries and provide any clarification or progress/statusreports relevantto project procurement that may be requested by the project management team;andConsult with the Procurement and Supply Management Specialist and PSM Specialist in the preparation of monthlyprogress reports for project procurement activities.Efficient management of procurement processes for the project with the following key responsibilities:Prepares procurement plans and monitors timely initiation of planned activities.\nOrganizes procurement processes including preparation and conduct of RFQs, ITBs or RFPs, receipt of quotations, bids, or proposals, their evaluation, and negotiation of certain conditions of contracts in full compliance with UNDPrules and regulations.\nPrepares Purchase Orders (POs) and contracts in and outsideQuantum, preparation of Recurring POs for Contracting of services, and vendors Creation in Quantum.\nEnsure POs are duly preparedand dispatched in a timely manner and take timely corrective actions on POs with budget check errors and other problems.\nMonitors proactively the processing of the POs until delivery and documents any changes of timelines for enabling informed logistic and programmatic decisions.\nPrepares submissions to the Contract, Asset, and Procurement Committee (CAP) and Advisory Committeeon Procurement (ACP).\nSupport undertaking marketresearch to identifyavailability and potentiallocal sourcing of planned procurement activities.\nIdentify risks and undertake mitigating actions in closecooperation with the project team;\nDevelop and/or implementan internal control system that guarantees that the purchaseorders (POs) are duly prepared and processed.\nManage the implementation of the monitoring system of procurement processes and mechanisms to eliminate anomalies in procurement; and\nPrepare and submit procurement cases to the Contract, Asset, and Procurement Committee (CAP) and Advisory Committee on Procurement (ACP), as required.Ensure elaboration and implementation of sourcing strategy and e-procurement tools with the following key responsibilities:Develop and manage rosters of suppliers, elaboration of supplier selection and evaluation, quality and performance measurement mechanisms.\nImplementation of sourcing strategy and e-procurement tools for international tendersfocusing on achievement of smooth implementation of e-procurement processesand knowledge transfer to the office/project staff as well as pro-active work with supplier communityfor developing e-tendering knowledge usage/application skills.\nEstablish and promote quality assurance standards for maintenance and inclusion to the rosters.\nCreate various databases and key files necessary for contracting all selected experts; and\nSupport the National AIDS Control Program (NACP)/Common Management Unit (CMU) for the validation of orders in collaboration with the supervisor.Ensures the organization of logistical services focusing on the achievement of the following results:Supports in managing all logistics operations required to ensure delivery of goods and services.\nSupports logistic management for health supplies e.g. green light procedure, shipping documents, packagingrequirements, temperature requirement, delivery requirement, handlingof goods, loading/offloading, etc;\nSupports in establishing and implementing supplychain optimization projects.\nMonitors and tracks all shipments with regular follow-ups with the freight forwarders and suppliers on the timeliness of delivery; and\nAdvises the supervisor about any delays and possible deviations from the logistic plan and advise on possible corrective action.Ensures facilitation of capacity building and knowledge building and sharing, focusing on the achievement of the following results:Engages with the implementing partners, NGOs, CSOs, UN entities, and technical partners to strengthen national systems and health institutions, across functional areas of procurement and asset management.\nSupports the PSM Specialist in the development of capacity development and transition strategies to support nationalentities to implement and assume the PR role,ensuring access to appropriate tools and resources.\nIdentifies and supports the development of communications (print, video) highlighting keyprocurement achievements; and\nActively participates in UNDP and other relevant external networks to promote the program.The incumbent of the position will uphold the non-discriminatory behavior and ensure that:Human rights and gender equality is prioritized as ethical principle within all actions.\nActivities are designedand implemented in accordance with the “social and environmental standards of UNDP’.\nAnykindofdiversitiesbased on ethnicity, age, sexual orientation, disability, religion, class, or gender are respected within all implementations including data production.\nDifferentiatedneeds of womenand men are considered.\nInclusive approach is reflected within all actions and implementations, in that sense anenabling and accessible setup in various senses such as disability and gender language barrier is created.\nNecessary arrangements to provide gender parity within all committees, meetings, training, etc.Any other task requested by the PSM Specialist.\n CompetenciesAchieve Results: LEVEL 1: Plans and monitors own work, pays attention to details, delivers quality\nwork by deadline\nThink Innovatively: LEVEL 1: Open to creative ideas/known risks, is pragmatic problem solver, makes\nimprovements\nLearn Continuously: LEVEL 1: Open minded and curious, shares knowledge, learns from mistakes, asks for feedback\nAdapt with Agility: LEVEL 1: Adapts to change, constructively handles ambiguity/uncertainty, is flexible\nAct with Determination: LEVEL 1: Shows drive and motivation, able to deliver calmly in face of adversity,\nconfident\nEngage and Partner: LEVEL 1: Demonstrates compassion/understanding towards others, forms positive relationships\nEnable Diversity and Inclusion:  LEVEL 1: Appreciate/respect differences, aware of unconscious bias, confront discriminationCross-Functional & Technical competencies:2030 Agenda: People -  Health Global Fund to Fight AIDS, Tuberculosis, and Malaria (GFATM)\nGender  - Gender Mainstreaming                       Business Direction and Strategy  System Thinking: Ability to use objective problem analysis and judgement to understand how interrelated elements coexist within an overall process or system, and to consider how altering one element can impact on other parts of the system               Procurement      Contract Management: Knowledge of contract management concepts, principles and methods, and ability to apply to strategic and/or practical situations Business Management    Project Management: Ability to plan, organize and control resources, procedures and protocols and to achieve specific goals          \nPartnerships Management: Ability to build and maintain partnerships with wide networks of stakeholders, Governments, civil society and private sector partners, experts and others in line with  UNDP strategy and policies.          \nRisk Management: Ability to identify and organize action around mitigating and proactively managing risks.          Required Skills and ExperienceAdvanced university degree (master’s degree or equivalent) in business administration, Public Administration, Finance,  Economics, or a related field is required.\nA first-level university degree (bachelor’s degree) in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree. \nCIPS level 3 is mandatory.Minimum 2 years of experience (with a master’s degree) or minimum 4 years of experience (with a bachelor’s degree) in procurement management in national or international organizations.\nKnowledge and experience working in the UN or UNDP rules, regulations, policies, and procedures is an asset.\nExperience in the usage of sourcing strategy and e-procurement tools, computers, and office software packages(MS Word, Excel, etc.) and advanced knowledge of web-based management systems.\nExperience in managing partnerships and capacity development of other agencies, donors, and other development stakeholders is an asset.\nExperience in logistics operations required to ensure delivery of goods and services especially for health goods is an asset.Required Languages:Proficient in verbal and written English and a local languageProfessional Certificates: Procurement/CIPS Certification is an assetDisclaimerJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Islamabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}