{"Job ID": "69866261", "Description": "Job Description:Job Title:                     Investment Bank and Cross Product F2B Business Architecture – Data Architect – Assistant Vice PresidentCorporate Title:            Vice President/Assistant Vice PresidentDivision:                      Business Architecture, part of CBIB CentralLocation:                     India (Bangalore, Mumbai and Pune)Overview:Deutsche Bank is going through a significant transformation of its front-to-back operations marked as one of the banks top 3 transformation agendas.F2B Business Architecture is a small central global team in Corporate Bank (CB) and Investment Bank (IB) to support the delivery of this key front-to-back (F2B) transformation priorities of the management board. The Data Architecture team will play the central role of defining the data model that will align the business processes and ensure data lineage, effective controls and implement efficient client strategy and reporting solutions. This will require building strong relationships with key stakeholders and help delivering tangible valueThe role will report to the India Head of Investment Bank and Cross Product F2B Operations.Key Responsibilities:Be part of the Data Architecture team to define and manage Data models used to implement solutions to automate F2B business processes and controls\nEnsure the models follows bank’s data modelling standards and principles and influence them as necessary\nActively partner with various functional leads & teams to socialize the data models towards adoption and execution of front-to-back solutionsSkills and Experience:10+ year in financial services, preferably Strategy and solutions in Corporate and Investment Banking domain\nStrong Knowledge of transaction banking domain process and controls for banking & trading business to drive conversation with business SMEs. Experience in developing models for transacting banking products are preferable.\nKnowledge of Loans or Cash/Deposits lifecycle and/or Customer lifecycle and related business data required to manage operations and analytics are desirable.\nWell-developed business requirements analysis skills, including good communication abilities (both speaking and listening), influencing and stakeholder management (all levels up to managing director)\nCan partner with Technology and business to understand current issues and articulate recommendations and solutions\nExperience with working in enterprise agile environment in a matrix organization              \nCritical problem-solving skills, able to think tactically and strategically\nStrong design experience and defining solutions.\nKnowledge of banking industry data models/best practices a plus\nConsolidates process and data and existing architecture to drive recommendations and solutions.\nStrong Data analysis skills, SQL experience, ability to build data models are desirableWhat we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}