{
    "Job ID": "69867027",
    "Description": "Avoma was founded with the belief that all of us have a love-and-hate relationship with meetings. When meetings are run effectively, people collaborate on great ideas, achieve alignment and ultimately make faster progress on their desired goals. But when meetings are run poorly, valuable time is wasted, information discussed is lost and scattered across multiple tools, desired goals are not achieved, and in the end, people blame each other.The reality is, a majority of meetings are still run very poorly today. We believe that with the right blend of Human Intelligence and advancements in Artificial Intelligence, we can make meetings more productive and get more value from the information discussed in every conversation.Join us in revolutionizing meetings through AI!As a Customer Success Manager, you will lead customer success initiatives, keep the company focused on customer outcomes and play a central role in directing the future of the product.You will understand customer outcomes through ongoing collection and analysis of data and feedback and turn this into onboarding and retention strategies as well as feed into the product roadmap. You will be involved in all aspects of account management, demonstrating the product, educating customers and more.We are still a small team and looking for people that not only love building customer relationships but that can also roll up their sleeves and help to build out our process and playbooks. You will have many opportunities to add impact to the business and will join a collaborative team who is ready to change the way the world runs meetings.You will be a core part of the founding team and report directly to the VP of Customer Success.The Scheduled Shift for this role will be 4pm-1am IST to ensure crossover working hours with the US.Understand customer outcomes by communicating with customers, analyze customer health metrics, run NPS and gather other feedback via Intercom and Vitally.\nRepresent the voice of the customer to provide input into every core product, marketing and sales process.\nEngage with customers to drive renewal and expansion opportunities.\nServe as the primary contact for the onboarding of new customers, the training of platform end users, as well as post go-live adoption and value creation.\nCollaborate with the engineering and development team to set up or configure our software platform as per customers’ requirements and troubleshoot technical issues raised by customers.\nGauge customers’ levels of engagement with the company and provide feedback to the other teams regarding product and service improvements.\nRun QBR’s to provide insights and best practices to customers to ensure that they get the most value out of the platform.\nBeing the main point of contact between the company and a number of named enterprise accounts.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}