{
    "Job ID": "69866841",
    "Description": "The Amazon Devices team designs and engineers high-profile consumer electronics, including the best-selling Kindle family of products. We have also produced groundbreaking devices like Fire tablets, Fire TV, Amazon Dash, and Amazon Echo.\nWhat will you help us create?\nThe Team: How often have you had an opportunity to be a founding member of a team that is solving a significant problem through innovative technology? Would you like to know more about how we are creating transactional workflow systems, SaaS solutions, and optimization engines to solve these problems? If this sounds intriguing, then we’d like to talk to you about a role on a new Amazon team that's tackling a set of problems requiring significant innovation and scaling.\nAs a Principal Engineer, you will define the software architecture and influence the solution and business strategy to create world class supply chain solutions for producing new Amazon devices. You will be involved from the concept stage of the product and required to dive deep into understanding the problems and opportunities that can be solved from a highly automated and optimized supply chain including Warehouse management, Logistics, and Sustainability. You will be responsible for defining a software architecture that brings the solution to customers both internal and external to Amazon Devices, including hundreds of partners all over the globe. From a strategic perspective, you will be part of a senior leadership team that will help drive the technical direction for the org.\nKey job responsibilities\nAs a Principal Engineer you will be expected to:\n· Serve as a technical lead on our most demanding, cross-functional projects.\n· Functionally decompose complex problems into simple, straight-forward solutions.\n· Fully understand system inter-dependencies and limitations.\n· Own the road-map and solution architecture across multiple technology teams working on building the next generation of intelligent greenfield supply chain solutions.\nThe ideal candidate will be able to balance technical leadership and savvy with strong business judgment to make the right decisions about technology choices. You’ll strive for simplicity and demonstrate significant creativity and incisive judgment.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- 10+ years of non-internship professional software development experience\n- Knowledge of object-oriented design, data structures, and algorithms\n- Experience in full-stack mobile development- android /iOS or modern web browsers and services mainly in Java in a Linux or Unix environment\n- Experience designing and building large-scale systems in a multi-tiered, distributed environment (Service Oriented Architecture)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}