{"Job ID": "69867316", "Description": "Do you ever wonder what happens inside the cloud?DigitalOcean (NYSE: DOCN) simplifies cloud computing so builders can spend more time creating software that changes the world. With our mission-critical infrastructure and fully managed offerings, DigitalOcean enables startups and small and medium-sized businesses (SMBs) to rapidly deploy and scale modern applications. As a remote-first organization, our employees, like our customers, are based around the world.As a shift manager, you will oversee daily operations, act as the liaison between staff and upper management, and work closely with your team to maximize customer satisfaction. Primary responsibilities of the Shift Manager’s role include the oversight and hands-on management of a team of highly skilled Engineers in their daily operational and support activities during shifts hours.&nbsp; This role entails managing performance at both a team and individual level as well as mentoring and coaching each team member in their overall growth.What You’ll Be Doing:Take ownership of the Customer Experience KPIs and most importantly Customer Centric Culture. Ensure operational efficiency and consistency (KPIs and SLA) with aim to bring in an operational excellence perspective. knows how to get things done.\nClosely coordinate with Customer Success and cross functional teams.\nForecast the future- load (headcount) based on growth and plan accordingly to ensure consistent service levels. Motivate staff and foster a positive learning environment.&nbsp;\nImprove and scale several (People, Technology, Support) Processes/SOPs to ensure Customer satisfaction, smooth and efficient operations, and Happy/Caring Engineers.&nbsp;\nDevelop Direct Reports, being adept at identifying the potential of others and assuming a role in harvesting it.&nbsp;\nCreates an enjoyable work environment to maximize retention of staff.&nbsp; Recognizes and rewards the accomplishments of individuals and the team.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nManage team leads &amp; team schedules ensuring 24/7 shift coverage\nTakes appropriate action with problem performers in a timely way.\nManage, instruct, and guide team of Engineers in their day-to-day activities surrounding customer support via Live chat and tickets\nResponsible for key performance metrics ensuring customer satisfaction.\nMeet aggressive system and application availability objectives while providing hands-on leadership during customer-impacting events (outages and incidents)\nProvide immediate response/remediation/ and escalation for incidents during the shift\nManage resources to performance expectations via tracking and maintaining individual performance metrics, including incident management, chats &amp; ticket performance, and process/procedure adherence as well as constant reinforcement to ensure SLA’s are met\nEstablishes and drives clear accountability for all team members, creates an environment that enables effective team performance and excellent communication\nConduct regular team meetings as well as one-on-one sessions with staff members\nOnboard, and train new hires in process and procedure adherence as well as use of tools and understanding of production platform interdependencies\nMaintain employee shift schedules ensuring adequate resource coverage at all times\nMaintain daily shift stats compilation, shift logs, analysis of “not at all well” customer ratings, response on cross departmental queries during the shift&nbsp;\nDevelop, document, maintain, and disseminate new processes and procedures for platform monitoring, incident validation, remediation, and escalation\n24 x 7 availability to work with the team in addressing incidents/outages where managerial guidance is required\nProblem analysis of platform and environmental issues, ensuring strict SLA compliance in issue response, resolution, escalation, and incident communication.&nbsp;&nbsp;What You’ll Add to Cloudways - A DigitalOcean Company:8-10 years minimum of job related experience along with Bachelor’s degree in Engineering, Computer Science preferred\nExperience of managing and scaling technical support or managed services team of at least 40 people. So been there, done that\nA good understanding of the IT industry and Hosting\nDecent Linux (Apache, Nginx, MySQL) and Development (PHP, Wordpress, Magento, Open Source Application) skills are plus\nStrong Verbal and written communication skills\nCustomer-focused with strong customer service skills\nCompatible with 24/7 environment and resilient to pressure and multitasking\nA positive attitude is a must. Available for a flexible 24/7 schedule\nGreat Interpersonal, mentoring/coaching and Leadership skills. Adept at assessing situations and making decisions\nAnalytical (problem solving) mindset, attention to detail, process oriented and Abstract thinking (be able to create resolution paths for high level problems) skills\nExperience with various Support Communication Systems is plus, such as; Live Chat, Zendesk, Intercom as well as large scale Phone and Chat support systems.Why You’ll Like Working for Cloudways - A DigitalOcean CompanyWe reward our employees. The salary range for this position is based on relevant years of experience and skills. Employees may qualify for a bonus in addition to base salary; bonus amounts are determined based on company and individual performance. We also provide equity compensation to eligible employees including grants of equity upon hire and the option to participate in our Employee Stock Purchase Program.\n&nbsp; We value development. You will work with some of the smartest and most interesting people in the industry. We are a high-performance organization that is always challenging our teams and employees to continuously grow. We maintain a growth mindset in everything we do and invest deeply in employee development through formalized mentorship and other internal programs. We provide all employees with reimbursement for relevant conferences, training, and education.\n&nbsp; &nbsp; We care about your well-being. In addition to cash and equity compensation, we also offer employees a competitive array of benefits. In the United States, these include health insurance, unlimited vacation, retirement benefits, a generous parental leave program, and additional resources to support employees' overall well-being. While the philosophy around our benefits is the same worldwide, specific benefits may vary in other countries due to local regulations and preferences.\n&nbsp; &nbsp; We value diversity and inclusivity. We are an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*This is a remote role#LI-RemoteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}