{"Job ID": "69866442", "Description": "About Eurofins – the global leader in bio-analysisEurofins is Testing for Life. The Eurofins network of companies believes that it is the global leader in food, environment, pharmaceutical and cosmetic product testing and in discovery pharmacology, forensics, advanced material sciences and agroscience contract research services. It is also one of the market leaders in certain testing and laboratory services for genomics, and in the support of clinical studies, as well as in biopharma contract development and manufacturing. It also has a rapidly developing presence in highly specialised and molecular clinical diagnostic testing and in-vitro diagnostic products.With over 62,000 staff across a decentralised and entrepreneurial network of ca. 900 laboratories in 61 countries, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of a wide range of products, as well as providing innovative clinical diagnostic testing services and in-vitro diagnostic products.Eurofins companies’ broad range of services are important for the health and safety of people and our planet. The ongoing investment to become fully digital and maintain the best network of state-of-the-art laboratories and equipment supports our objective to provide our customers with high-quality services, innovative solutions and accurate results in the best possible turnaround time (TAT). Eurofins companies are well positioned to support clients’ increasingly stringent quality and safety standards and the increasing demands of regulatory authorities as well as the evolving requirements of healthcare practitioners around the world.Eurofins has grown very strongly since its inception and its strategy is to continue expanding its technology portfolio and its geographic reach. Through R&D and acquisitions, the Group draws on the latest developments in the field of biotechnology and analytical chemistry to offer its clients unique analytical solutions.Shares in Eurofins Scientific are listed on the Euronext Paris Stock Exchange (ISIN FR0014000MR3, Reuters EUFI.PA, Bloomberg ERF FP).POSITION & OBJECTIVES:\nAspiring to be an part of the Release Deployment and Environments team that is tasked to develop cloud native solutions and on Premises solution effectively , Configure and maintian SQL databases  servers by leveraging automation practice to provide value to the Program/Organization.Need to be a firm beliver that both a high-quality team and high-quality scripting are critical to deliver positive results consistently.Job description:The Data Base Administrator (DBA) is responsible for providing technical support for the database environment including overseeing the development and organization databases\nResponsible for Database support, troubleshooting, planning, and migration.\nImplement daily reports to highlight Backup failures, Disk space issues and Job failures.\nRebuilding the indexes on regular intervals and placing table/non-clustered index\nTroubleshooting of SQL Server performance issues using SQL Server Profiler, Trace, Index tuning wizard\nDesign and implement comprehensive Backup plan and disaster recovery strategies.\nCreate, deploy, configure and monitor complex SSIS, SSRS and CDC\nAutomate task which been historically done manually using PowerShell, T-sql or Command line utilities.\nKnowledge Azure Cloud, NO SQL, MongoDB\nProven experience in SQL Server Database Administration Activities\nStrong Experience Installing and Managing SQL Server all the version, configuration and applied hotfix and service pack\nImplement and maintain database security\nStrong Experience in Database backup and restoration in standalone and cluster environments\nPerform all database and server integrity check\nRegular Check Database performance and performance statistics using the profiler research and resolve issues.\nConfigure Mail server , configure jobs to check  database integrity and fragmentation s.  \nStrong familiarity with each layer in MS SQL architecture for quick RCA\nExperience SQL Server cluster environments. Experienced in setting up SQL Server Always on Availability group\nEvery month check database and maintain database growth.\nHands on experience on database \\ Windows issues monitoring and troubleshooting.\nGood exposure in Database and SQL Performance Tuning.\nGood knowledge in T-SQL scripting, table insert and update join statements\nHands on experience ITIL process , experience in at least one ticketing tool  handling service, incident , problem or change tickets\nPossess excellent English communication skills, both verbal and writing skills.Added advantage skills:Good to have knowledge developing and maintaining ETL tools and platforms such as SSIS,  SSRS\nAdded advantage writing power shell script s to automate DBA routine task\nKnowledge on Azure Cloud , NO SQL, MongoDB , Good to have experience Migrating SQL Server from On-Premises to Azure Cloud.\nAdded advantage knowledge Agile/Scrum process by attending daily stand-ups and Sprint Planning sessions.\nknowledge, monitoring tools like SOLARWINDS\nPossession of either MS SQL DBA Certification or Microsoft Azure Solutions Certification would be a plusDesired Technical Stack:Scripting : TSQL, PowerShell\nPlatforms : Windows.\nDatabase : MS SQL SERVER, MongoDB\nTicketing Tools: JIRA, Service now\nOperating System: Windows\nCloud Environment :  MS Azure\nVersion Control Tool : Azure Devops , TFS•PROBLEM-SOLVING SKILLS – Must be able to perform troubleshooting and problem-solving across SQL server and database domains. Manage project effectively through open, standards-based platforms. Increase project visibility thought traceability.•TECHNICAL EXPERTISE – Strong scripting language aptitudes and a team approach providing Database Administrator candidate the ability to problem solve and partner with developers to ensure reliable and scalable services on Premises or on cloud.•CUSTOMER SERVICE – Must be the one who configure SQL servers and relieves bottlenecks, which is done by talking to people. Aligning Dev and Ops goals for the customer's sake. As a dba pro must be able to assess and streamline the goals of Dev and Ops teams towards the common goal to ensure a flawless end user experience• ATTENTION TO DETAIL –  Must have the ability with good attention to details. Excellent organisational and time management skills, and the ability to work on multiple projects at the same time. awareness of SQL server and TSQLWhat we offer:A launch pad into various senior management opportunities – within the many business lines of Eurofins globally – or into the management hierarchy in our different corporate functions.\nThe opportunity to grow your project management skills in a demanding, fast growing organization.\nA chance to become part of a highly motivated international team of professionals.In a fast growing group, successful leaders are frequently being offered increased areas of responsibility (subject to geographic mobility).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}