{
    "Job ID": "69867018",
    "Description": "About the companySinch brings businesses and people together through tools enabling personal engagement. We partner with leading global enterprises and local startups, enriching their engagement with customers through our communications platform. If you get us talking about the old days, we'll tell you what it was like to be the early pioneers of cloud communications. But lately, what we're buzzing about is the fact that we're trusted to carry 25 billion API calls a year, and we get excited about the value that brings to so many people's everyday lives.We provide scalable cloud communications for mobile messaging, voice, video and email for the world's most exciting and demanding enterprises, including 8 of the 10 largest global tech companies. Sinch is listed on Nasdaq Stockholm with proforma revenue of approximately 20 billion SEK. Largest shareholders include Softbank, Capital Group and the company founders. 2022 Sinch will have more than 4000 employees in more than 50 countries. We have an active M&A agenda, with 19 acquisitions to date with 4 acquisitions in 2021 in USA, Germany and Australia for close to 40 billion SEK.About the jobJoin a globally leading tech brand and be part of our exciting journey forward! Sinch has emerged as a global leader in the rapidly growing market for CPaaS and mobile customer engagement.The Finance Specialist COGS role description below lists the primary responsibilities and this role reports to the Finance Manager.Expectations and ResponsibilitiesThe Finance Specialist COGS is responsible for ensuring that accounting of Revenues and COGS “Cost of goods sold”, its processes and documentation in accordance with applicable contracts, guidelines and in the relevant systems. Key responsibilities include:Support timely recording of Customer (Revenues) and Supplier (COGS) Invoices on a real-time basis and in accordance with the accounting guidelines and industry practices.\nSupport timely and accurate reconciliation of accrual general ledgers and support customer and vendor account reconciliation.\nMaintain and improve the processes for collecting, analysing, verifying, and reporting financial information.\nWork with the internal or external stakeholders to ensure a clean and timely year end audit.Location: Bangalore, IndiaIdeal Candidate ProfileIf you are newly graduated or in the beginning of your career, with 3-5 years of work experience, and looking for an exciting role that is business-oriented, hands-on and a great opportunity to learn and grow with a company - This is a great opportunity for you!\nPreference will be provided to candidates having Telecommunication company related accounting background and/or exposure to ERP (SAP ByD & Microsoft Dynamics GP “Great plains”)\nBachelor’s degree in accounting is a must,\nStrong depth and understanding of basic financial skills,\nAbility to think strategically while focusing on execution challenges, structured problem-solving skills,\nGood communication skills (business writing) to interact with regional accounting shared services and stakeholders.\nWork from Office/HybridJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}