{"Job ID": "69866274", "Description": "The Cash and Trade Proc Rep 5 is an entry level role responsible for processing basic to relatively complex transfers in coordination with the Transaction Services team. The overall objective is to perform moderately complex cash & trade operation tasks, by providing processing assistance for assigned projects.\nResponsibilities:Perform cash management operations, such as cash handling, check processing, return items and lock-box operations\nProvide processing assistance for firm payments, receivables, trade transactions, liquidity flows and wholesale card activity\nAid with processing firm payments, receivables, trade transactions, liquidity flows and wholesale card activity\nServe as a subject matter expert for User Acceptance Training (UAT) and training initiatives; train new team members and lower level personnel\nParticipate in compliance related activities to minimize losses\nAssist with cash & trade operational project needs\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:2-4 years of relevant experience\nDemonstrated basic experience in cash management processing and transaction services\nProficiency with Microsoft Office tools and data entry skillsEducation:High School diploma or equivalentThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}