{"Job ID": "69866746", "Description": "Senior Manager – Reinsurance Underwriting ServicesGurgaon, Haryana, IndiaWe invent the new to help the world move forward. Combining powerful analytics and deeper insights with bigger ideas and innovative solutions, we free up our clients’ potential, thereby fulfilling our own. Take it seriously. Make it fun. Know it matters.As Senior Manager, you will work as the Underwriting Lead of the team based out of India and would shoulder responsibilities closely with other Leads in managing the Reinsurance Portfolio. You will have to lead the Underwriting Support and Strategy, Governance & CI.You will be managing, coaching, developing, and motivating the team through training, query resolution, and quality control practices. You will play a key role in maintaining the team’s SLA and KPIs. You will also support your team with administration duties following a pre-defined process assuring the accuracy and integrity of the Underwriting activities. The ability to take ownership of team deliverables and the timely and appropriate escalation of issues arising is essential for this role.As an organization, we are identifying opportunities to automate manual activities. So that more value-added activities can be added and performed in the shared services. The expertise would be utilized to implement various Process Improvement ideas and CI projects. The role would require performing complex Underwriting activities/validation of tasks and data analytics.For the right person, this is a fantastic opportunity to progress and grow in the reinsurance Underwriting world within a very fast-growing company.DISCOVER your opportunityWhat will your essential responsibilities include?This role primarily focuses on execution within defined parameters.·Coordinating with cross-functional leads on business-level projects & discussions.·Ownership & accountability of tasks.·Active participant in management-level discussions and planning.·Set up effective & robust governance in place on KPI management for the shared services team.·End-to-end ownership of Process & Efficiency improvement of the Underwriting team.·Leading projects like RCR improvement, CI, Innovation & Overall business performance.·Accountable for motivating, coaching, developing, and providing your expertise for process improvements.·To provide instrumental support during the time of Quarter & Year-end close.·Setting up governance with stakeholders to keep track of business performance & enhancing customer experience.·Will advocate and liaise with regional stakeholders as a critical point of contact for any issues/queries and work based on business requirements.·Responsible for gathering and understanding information related to changes in processes and controls, and for appropriately cascading information to colleagues.·Deliver on set KPIs and put robust process mechanisms in place & ensure that data is collated and available for management reporting, as required.·Colleagues exhibit robust execution capabilities and are taking on more responsibility at this level.·Responsible for documenting and assisting with control processes and Internal Audit/ External Audits.·Cooperating closely with Underwriting Support and Cross-functional leaders and ensuring that the teams work collaboratively.·Working on special projects as and when required.·Ensuring Continuous Improvement initiatives are tracked and supported where necessary.·Being a point of escalation about underwriting services. You will report to the Delivery Lead - ReinsuranceSHARE your talentWe’re looking for someone who has these abilities and skills:Required Skills and Abilities:·Graduate/Postgraduate with experience within Insurance/Reinsurance industry·Experienced people manager currently at manager’s role.·Experience in managing both Band A & B level individuals. ·Excellent communication skills.·Focused on BI / CI & process efficiency.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}