{
    "Job ID": "69867497",
    "Description": "OSTTRA IndiaThe Role: Technology Procurement SpecialistThe Team: The OSTTRA Technology team is composed of Capital Markets Technology professionals, who build, support and protect the applications that operate our network.  The technology landscape includes high-performance, high-volume applications as well as compute intensive applications, leveraging contemporary microservices, cloud-based architecturesThe Impact: Together, we build, support, protect and manage high-performance, resilient platforms that process more than 100 million messages a day. Our services are vital to automated trade processing around the globe, managing peak volumes and working with our customers and regulators to ensure the efficient settlement of trades and effective operation of global capital marketsWhat’s in it for you: Responsible for Global Procurement – Sourcing, Purchasing, Vendor, Supply & Contracts management, primarily focusing on, but not restricted to IT & Technology.Strategically, the key goals are to ensure – Supply Assurance, Quality & Alternatives, Services & Warranty, Cost optimization, Vendor collaboration & innovations, Environment social governance, Stakeholder & Vendor relationship, Contracts life cycle management & performance, Third party Risk management, and above all secure and improve organization’s bottom-line  while enabling all other functions deliver their business plans.This is an excellent opportunity to be part of a team based out of Gurgaon and to work with colleagues across multiple regions globally.Responsibilities:Work as a part of Global Procurement team connecting with stakeholders and requisitions across the world, especially focussing on Technology PR/PO/Payments, but also non-tech experience (HR, Admin, Marketing, Travel etc) shall be added advantage.Will have to work on drafting Purchasing processes, and implementing across globe. Must have deep experience of procurement suites like Ariba, GEP, Zycus etc, and ERPs like SAP, Oracle for Procurement/Finance. Will need to roll out some of these suites for Osttra group.Should also have experience in formulating policies for Procurement. Will need strong relationship internally with all user-groups, parent company’s procurement team, finance, management. And Externally with Vendors.A good understanding of Ariba, SAP/Oracle is must, preferably from implementation viewpoint. Hence must have deep knowledge of Procurement processes (both Purchasing & Sourcing) and Policies. Purchasing Operations will also be under purview of this position.What We’re Looking For:Expert in global Procurement Process\nKnowledge of procurement suites & s/w – Ariba, GEP, Zycus etc. ERPs like SAP, Oracle etc\nExperience in implementation of above tools\nProcurement processes and policies drafting and approvals\nExperience in Program management for roll out of Polices, Process & Ariba\nTraining to engagement owners & users on raising PRs/ GRNs/ Payment requests\nSpend analytics  &  Reporting on Spend, Pending Purchasing – PR/PO/GRN etc\nRepository for Contracts & Expiry tracker.\nExcellent communication and presentation skills – global interfacing & trackers maintenance\nStrategic Sourcing & negotiations experience\nGood understanding of Financial process\nExperience of various other categories besides Technology – HR, Admin, Travel, Real estate, MarketingThe Location: Gurgaon, IndiaAbout Company Statement:OSTTRA is a market leader in derivatives post-trade processing, bringing innovation, expertise, processes and networks together to solve the post-trade challenges of global financial markets.  OSTTRA operates cross-asset post-trade processing networks, providing a proven suite of Credit Risk, Trade Workflow and Optimisation services. Together these solutions streamline post-trade workflows, enabling firms to connect to counterparties and utilities, manage credit risk, reduce operational risk and optimise processing to drive post-trade efficiencies.   \nOSTTRA was formed in 2021 through the combination of four businesses that have been at the heart of post trade evolution and innovation for the last 20+ years:  MarkitServ, Traiana, TriOptima and Reset.  These businesses have an exemplary track record of developing and supporting critical market infrastructure and bring together an established community of market participants comprising all trading relationships and paradigms, connected using powerful integration and transformation capabilities.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}