{"Job ID": "69869992", "Description": "The Bosch Group is a leading global supplier of technology and services, in the areas of Automotive Technology, Industrial Technology, Consumer Goods, Energy and Building Technology.\nIn India, the Group operates through nine companies with a combined strength of over 30,000 associates which includes around 14,000 research and development associates.\nBosch Chassis Systems India Ltd is a 100 % Bosch owned company in India. The company design and develops world-class Hydraulic Brake System Parts which includes Boosters, Tandem master Cylinders and Proportionating valves. The Control Division develops innovative components, systems and functions in the field of vehicle safety, vehicle dynamics and driver assistance like ABS and ESP. RBIC would soon be expanding its portfolio in passive safety and other Driver assistance products.\nWe invite promising and dynamic professionals for a long-term and\nrewarding career with Bosch.1. Responsible for Quality and process related topics for purchased parts in stamping and plastic commodity in series\n2. Single point of contact for technical communication for supplier\n3. Lead the troubleshooting and root cause analysis of all technical issues using the principle of “on-site, on-the-spot” to ensure that products manufactured with pre-set quality standards.\n4. Various Q-tool implementations at the supplier for improvement. (14Q, 99PPM, 4M etc.) in order to improve and sustain QMS at supplier\n5. Close interaction with Supplier, PPC, PQA & PDxy team to maximize profit potential and ensure efficiency.\n6. Co-ordinate Customer Audits and Bosch audits at Supplier and closure of OPLs\n7. Problem solving skills and willing to take ownership of issues till its closure\n8. Co-operative, team spirit and result orineted\n9. Proficiency in handling softwares MS-Office, data analysis etcB.E., in Mechanical/Automobile Engineering/Production Engg etc\nMin 5-7 years' experience in supplier Quality Management\nStamping commodity exposure is mandatory.Stamping commodity exposure is mandatory.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}