{"Job ID": "69866326", "Description": "Job Title: HR Business Partner – BUL FactoryFunction: HRScope: KSALocation: Saudi, JeddahCompany Profile:Would you like to work in a place where you can bring your purpose to life through the work that you do?You can create a better business and better world by working on brands that are loved and improve the lives of millions while you learn from brilliant business leaders!We have an opportunity for the role of Human Resources Business Partner – BUL Factory, see more information below.Is this position made for you?You will business partner the BUL Factory Manager in HR operations and Employee relations matters. You will be part of the PC HR MET team and will contribute/lead PC Arabia-wide HR initiatives You will report to the PC HR Lead Arabia and Head of HR Gulf.Your key responsibilities will include:Partner with the Factory manager to facilitate, provide HR support towards Blue-Collar (shopfloor) and White-Collar Factory teams, including but not limited to workforce planning, recruitment, organizational development and talent management, culture building etc.\n\nSupport organization development to build capabilities, improve organizational effectiveness and enhance speed and agility.\n\nDevelop a high-performance organizational culture with collaborative ambiance and ensure the efficiency.\n\nProvide daily HR support to the business and work together with key stakeholders to ensure employee engagement as well as proper handling of employee relations.\n\nCoach and support line managers to be great leaders everyday by partnering with them and providing them with excellent guidance.Ensure that employee policies, practices, and programs are consistently applied across the business.\n\nInvolved in organizing and implementing workshops, HR (organizational) changes, health, wellbeing & development activities for employees, enabling them to thrive.\n\nCollaborate with the People Experience team in recruitment and Employer Branding initiatives.\n\nSupport/drive the Implementation of Global HR practices & projects into the Plant for both Shop floor and Office Workers.\n\nIn charge of problem solving and decision making in terms of factory related activities and all employee grievances\n\nProactively connect with Factory leadership team to initiate and lead resource management, new work patterns and systems, manning rationalizations projects at site.\n\nInitiate and lead all change management process at site including productivity and other improvements.\n\nFormulate strategies for restructuring/transformation and lead timely closure and implementation. \n\nFill all workforce recruitment requirements on time in full (Permanent and Casuals).\n\nStrategize, lead, and implement all external & internal engagement activities for the site.Critical success Factors for the JobUniversity Degree.\n\n3+ years of HR experience (Factory HR experience is an advantage).\n\nStrong hands-on experience in talent attraction, retention, workforce planning, employee engagement.\n\nGood communication skills and influencing skills.\n\nAbility to handle multiple priorities and solve problems.\n\nFluency in English.Unilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}