{"Job ID": "69862472", "Description": "Temporary English-speaking Nanny required for G3 & Newborn located in Bratislava, Slovakia. Salary from £1200 – £1400 per week. Live out. 3 – 4 month contract, start ASAP.\nA lovely family in Bratislava, Slovakia is seeking an experienced and friendly English-speaking Nanny to provide full care to their young daughter.\nAs a Nanny, you will need to provide daily care to the young girl including; bathing, meals, cleanliness, feeding, play, escorting the child to and from playdates, education, general upbringing, language development and promoting good behaviour and manners. In addition to this, you will be required to support the mother with the newborn and offer assistance where possible.\nThe ideal candidate will be a European passport holder with childcare qualifications. Previous experience of working in private households is essential along with working in sole care roles. The candidate should be engaging, friendly, calm, experienced, confident, friendly and hard-working.\nThe working schedule is 5/2 days per week working from 8 am to 8 pm per day. The family will require some assistance on Saturdays from time to time, and prior notice will be given.\nPosition to commence immediately\nThe family travel often and the nanny will be required to travel with them.\nThis is a live-out position with a private apartment close to the family’s home.\nPackage:\nSalary £1200 – £1400 per week\nLive out (Private apartment provided)\n5/2 working schedule\n3 – 4 month contract\nRequirements:\nExperienced English-speaking Nanny\nChildcare qualifications\nFriendly, flexible, calm and hard-working\nEuropean Nanny\nAble to start immediatelyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}