{"Job ID": "69866199", "Description": "Who we areWith Citi’s Analytics & Information Management (AIM) group, you will do meaningful work from Day 1. Our collaborative and respectful culture lets people grow and make a difference in one of the world’s leading Financial Services Organizations. The purpose of the group is to use Citi’s data assets to analyze information and create actionable intelligence for our business leaders. We value what makes you unique so that you have opportunity to shine. You also get the opportunity to work with the best minds and top leaders in the analytics space.What the role isWe are hiring for the position of Assistant Vice President, to lead the CGW BI team based out of Bangalore, India.In this role, you will lead a team of analysts and developers with diverse skills, building data and visualization solutions to identify key business initiatives, measure their success and support the organization’s business goals.You will be responsible for the day to day running, upkeep and optimization of BI assets as well as cater to emerging business needs in a responsive manner.You will guide, support and mentor the team on technical solutioning and should be ready to roll up your sleeves when needed.Who you areData Driven. A proven track record of enabling decision making and problem solving with data. Conceptual thinking skills must be complemented by a strong quantitative orientation and data driven approach.Passionate Leader. You are passionate about mentoring and growing a high caliber BI team by hiring and leveraging diverse capabilities. You have an empathetic and decisive people leadership attitude with experience being a strong technical mentor and a champion cultivating individual growth.Strong Partner. You effectively collaborate and seek to build trusted relationships with partners and stakeholders and work in tandem with them on all aspects from prioritization to delivery of results.Strong Communicator. You can communicate verbally and through written communication with clarity, and can structure and present your work to senior leadership.Clear Results Orientation. You display a keen focus on achieving both short- and long-term goals and have experience driving and executing an agenda in a demanding and fast-paced environment, with an eye on risks & controls.Innovative. You are always challenging yourself and your team to find better and faster ways of doing things.What you doData Exploration. Understand underlying data sources by dwelling into multiple platforms scattered across the organization. You do what it takes to gather information by connecting with people across business teams and technology.Build Data Assets. You have a strong data design background and are capable of developing and building multi-dimensional data assets that captures abundant information about various line of business.Process & Controls Orientation. You develop strong processes, and indestructible controls to address risk and seek to propagate that culture to become the core value of your team.Dashboarding and Visualization. You develop insightful, visually compelling and engaging dashboards that supports decision making and drive adoption.Flawless Execution. You manage and sequence delivery of reporting and data needs by actively managing requests against available bandwidth and identify opportunities for improved productivity.Be an Enabler. You support your team and help them accomplish their goals with empathy. You act as a facilitator and remove blockers and create a positive atmosphere for then to be innovative and productive at work.Qualifications10+ years of work experience largely in the Business Intelligence & Data Management space\nMinimum of 2 years of experience in a role that managed or mentored team members\nStrong understanding of Data modelling concepts, and excellent SQL skills\nExposure to SAS, Python, PySpark/Scala/Spark is a plus\nHands-on experience in one or more big data technologies is a plus\nWorking experience on BI Visualization tools like Tableau, Power BI, Looker is a plus\nPrior experience working in banking industry is a plus-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}