{
    "Job ID": "69866374",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. \nAbout the team:It is a Team of 40, comprising of Developers, Testers, Scrum Masters & Product Owners. We maintain the FIS Flagship Transaction Debit Processing Switch: Connex on HP from offshore. What you will be doing:The role we are looking for is HP Nonstop Developer/Lead, who will be enhancing our FIS Inhouse connex on HP software for US banks, international banks & also adhere compliance with Card Network mandates.What you bring:- HP NONSTOP/TANDEM Development experience with skills in doing Requirement Analysis/Design/Coding expertise in 1 of either switch: CONNEX (or) BASE24- Card Payments/Transaction processing Domain Knowledge- Superior programming skills in HP TAL/PTAL, COBOL/SCOBOL, Enscribe, NSQL, FUP, Pathway programming- Skills for Comprehension of Requirements & planning well-thought of solutions- Diligence in Coding & every task done-  Curiosity & Loads of Enthusiasm/Motivation to Learn- Analytical Skills, Logical Reasoning, & Problem-Solving skills- Collaboration with peers- Able to do Production Support on Releases, Stretch and work as required- Experience working in AGILE/SAFE environment- Perseverance to Stretch extra hours if needed (on late night calls for any Production priorities)Education Requirements:  Bachelor’s degree or the equivalent combination of education, training, or work experience.What we offer you:  A multifaceted job with a high degree of responsibility and a broad spectrum of opportunitiesA broad range of professional education and personal development possibilities – FIS is your final career step! A competitive salary and benefits A variety of career development tools, resources, and opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}