{
    "Job ID": "69869120",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.JOB PURPOSE:To check complex design drawings for completeness, accuracy, and conformance to established Engineering Standards and practices.JOB DUTIES:This position provides Engineering checking for Caterpillar design groups. TheEngineering Checker will review design layouts/3D models that graphically show how the product is to form, fit and function. The Engineering Checker verifies drawing and engineering notice for the required information as defined in Caterpillar Product and Process Standards (CPPS).The incumbent assures the completeness and accuracy of the information with respect to material, process standards, engineering specifications and the engineering design guides. This position assures that newly designed parts will function properly when assembled, checks the accuracy and placement of dimensions and assures the proper use of Geometric Dimensional and tolerances (GD&T). Also, establish the datum and datum references, perform interference, clearance checks, and suitable heat treatment based on product design and manufacturing process requirements.Some of the other responsibility includes collaboration with internal and external clients, coaching and mentoring of other checking engineers on engineering practices and standards. Developing standard work instructions and implementing the best practice process documents & templates for complex drawings. The incumbent evaluates drawings for possible manufacturing, assembly problems, ease of serviceability and identify opportunities for cost avoidance of the parts.This position drives improvements towards Product Quality by leveraging information from the existing platforms. Requires verification of the design output with respect to build issues, Manufacturing, 2 MIS and 12 MIS, field & warranty related to product quality, The incumbent need to ensure future proof drawings with respect to DFA, DFM, DFS etc., and provide valuable recommendations to the engineering team, impacting the product quality.BACKGROUND/EXPERIENCE:Required Qualification: Bachelor’s degree (or equivalent) in an accredited Engineering in Mechanical. 5+ Years of experience in Product Design & Development / Assembly andManufacturing / Metrology. Thorough knowledge in GD&T, engineering practices and standards. Familiarity in CREO / other 3D modelling and detailing tools and PDM tools -Teamcenter Engineering (TCE). Strong communication and analytical skills.Team Specific: Ex. (Strong competency in Sheet metal design / Casting Design andmanufacturing processes).Desired Qualifications: Master’s degree (or equivalent) in an accredited Engineering in Mechanical. Competency in stack-up tolerancing. ASME (Y14.5-2018) GDTP Senior Certified Professional.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}