{"Job ID": "69867336", "Description": "VP Basel 3.1 Business Impacts Management Delivery-(2300017357)Job:Audit, Accounting & FinancePrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 9:16:11 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleThe role holder will have the following key responsibilitiesProvide support to the Basel 3.1 Business Impacts Management (“BIM”) Programme Manager on key deliverables with particular focus on the management of Basel 3.1 Impact Analysis working closely with wider QIS (“Quantitative Impact Studies”) team based in Poland.\nEngage with QIS (“Quantitative Impact Studies”) team and FRTB Programmes on business impact data requests and support any analysis required to provide key business impacts metrics.\nSupport programme team and CCIB, CPBB and Treasury Markets businesses, to assess and manage impacts of Basel 3.1 well in advance of implementation date, identifying key optimisation and mitigation strategies and tracking those to implementation / conclusion with business SMEs.\nSupport provision of  business impacts on RWA and CET1 metrics for CCIB, CPBB and TM at Group level and Solo level on a monthly and quarterly basis respectively.In addition, this role holder willSupport the Programme with driving definition of business requirements with SMEs to support key changes in processes, people, policies and systems and technology enhancements that will support embedding Basel 3.1 changes into BAU with specific focus on Corporate Planning, Forecasting, provision of MI for ongoing performance management and Group / Country consistency.\nProvide assistance with business analysis tasks in respect of data sourcing and implementation activities that ensure capital calculations are optimised for businesses and support investigations to ensure solutions are fit for purpose for both Group and Countries.\nWork closely with GCFO Change and FRTB Programmes on implementation activities required to support business impacts optimisation and mitigation, output floor implementation and data sourcing consistency for Group and Countries.StrategyAwareness and understanding of the Group business strategy appropriate to the role.BusinessAwareness and understanding of the wider business, economic and market environment in which the Group or country operates.ProcessesBe a lead in a Basel 3.1 (Basel 4) expert team, ensuring team focus, well-being and development\nServe as a SME in credit and counterparty credit risk capital requirements calc: in a technical (SAS, Excel) or a regulatory field.\nCoordinate and prioritize team effort for quality and timely delivery of key requests (recurring and ad-hoc) including\nBusiness Impact analysis and investigations supporting internal stakeholders\nIndustry data requests \nBasel QIS requests\nPRA queries\nEnsuring adherence to the relevant sections of the Prudential Compliance Framework (Group Compliance) and Operational Risk Framework (Group Operational Risk)\nDevelop and implement new Management Information, collaborating closely with internal and external stakeholders\nSupport development of the tactical capital requirements solution (in SAS) to enhance scope of reporting and scenario analysis, improve calculation accuracy and solve incoming issues\nInterpretation and guidance to global stakeholders and Head Office on PRA rules impacts under Basel III / CRD IV, as well as EBA and local rules impacts for other countries in the Group e.g. Hong Kong\nContribute to the development and implementation of other regulatory projects\nContribute to the development and implementation of the new strategic capital solution (SQL)\nSupporting initiatives including process and business efficiency and improvement of the control environmentPeople and TalentManaging excellent relationship through an established engagement model with all stakeholders with ‘Think Client’ Approach.\nAlways have an eye for Process Improvements and Innovations with an objective to ‘Simplify’, while still maintaining the value delivered.\nHave an attitude to create a Collaborative Team Environment with ‘Human’ element to build the function for the long-term.Risk ManagementThe ability to interpret the Group or country capital reporting information, identify key issues based on this information and put in place appropriate controls and measures.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Key StakeholdersOther Basel 4 implementing teams, in particular SG / ASA subteam\nSIM/BCRS Operations team in Financial Services Support Centres in Chennai and Poland\nGroup Financial Reporting\nBusiness Finance and Country Finance teams in country\nFinancial Planning and Analytics\nBusiness lines including CCPB, Treasury Markets, CCIB\nFront Office\nInvestor Relations / Group Corporate Affairs\nGlobal Risk Functions including Credit Risk, Market Risk, Operational Risk\nGroup Treasury\nGrouJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}