{
    "Job ID": "69869872",
    "Description": "LOCATION:                 Amishi, AhmedabadREPORTS TO:               Country HR Manager, IndiaDIRECT REPORTS:        2WORKPLACE TYPE:      On-siteCompany Background:Ingredion is a global Fortune 500 provider of ingredient solutions that touch millions of lives, every day. With over 19,000 customers in 120 countries, we create solutions that help nourish, comfort, and delight people all over the world. We are proud to source our strength from nature.  That’s why we’re growing sustainably, with an industry-leading product portfolio that includes plant-based proteins, sugar alternatives and clean and simple ingredients that deliver on changing consumer needs while protecting our planet. Although we are best known for our food ingredients, we are much more than a food business. We co-create bespoke solutions with our customers; from cosmetics and beauty, to paper and textiles, to pharmaceuticals, driven by relentless curiosity. We make it our business to anticipate industry trends, and to bring together the potential of people, nature and technology to make life better.We don’t just make ingredients. We create possibilities. Be What’s Next® with us.The Plant Human Resources Specialist coordinates and implements local administrative HR tasks and provides front-line support to deliver necessary local HR activities, including associate hiring, contingent worker management, learning, time & attendance, and employee & labour relations.Core Responsibilities:Manage and coordinate local HR service delivery to ensure risk, compliance, and operational excellence\nDeploy services that are required to be executed at a local level\nProvide input on HR policies, processes and programs to CoEs\nSupport end-to-end associate recruitment process including sourcing, candidate pool management, recruitment, and onboarding of associate level employees\nRecruit, onboard, and manage contingent workers\nSupport local learning initiatives including conducting learning needs analysis, developing learning content, delivering training, and managing local logistics\nManage in-person time and attendance activities, including reviewing, resolving, and approving timecards\nManage return to work, alternative duty and modification requests\nManage or lead investigations into employee claims of unfair treatment or management charges of misconduct or non-compliance, and communicate findings to manager, HR Business Partner, and/or Legal as appropriate\nMonitor and resolve discipline issues, if appropriate, and, refer to  disciplinary process\nManage appeals process, conducting meetings, and determinations\nManage documentation of all materials and decisions related to employee and labor relations investigations\nManage local community relations, as needed\nProvide documentation for audit purposes\nManage performance management for the associates\nAct as single point of contact for payroll deliverables\nDrive employee engagement activities, as needed\nSupport and collaborate with other function within the plant to ensure smooth operationQualified candidates will have:Mandatory requirements:University Degree or equivalent experience in a related field\nWork experience as HR Generalist in food and beverage/Pharma/ FMCG industry.\nExperience within the manufacturing / plants HR role is preferred.\nWorking knowledge of HR policies, practices, and procedures and Labour laws\nFluent in spoken and written EnglishDesirable requirements:Experience and familiar working with HR system e.g., Workday is an added advantageRequired behaviors and skills:Establishes good collaboration and exchange with HR Business Partners, HR Operations, Communities of expertise and Shared Services team\nDetail-oriented execution of routine and complex processes (HR functional / operational knowledge)\nAbility to deliver high quality HR support consistently in a professional manner e.g., adaptable to different audience and situations\nAbility to work independently with minimal supervision and multi-tasking whenever required\nAbility to quickly comprehend requirements and carry out transactions in accordance with set standards\nService mindset with strong communication and interpersonal skills and a collaborative team spirit\nAdaptable to quickly changing requirements and able to manage conflicting demands\nStrong work ethic, integrity and personal accountabilityRelocation available: NoRelocation Available:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}