{"Job ID": "69867176", "Description": "What Data Management and Governance contributes to Cardinal Health\nThe Data & Analytics Function oversees the analytics life-cycle in order to identify, analyze and present relevant insights that drive business decisions and anticipate opportunities to achieve a competitive advantage. This function manages analytic data platforms, the access, design and implementation of reporting/business intelligence solutions, and the application of advanced quantitative modeling.\nData Management and Governance provides direction of data assets and is responsible for data strategy, quality, standards and service levels. Data management acquires, validates, standardizes, enriches, protects and publishes structured, third party and unstructured data for use by the business. Governance defines and implements policies, standards and metrics that ensure the effective and efficient use of trusted data and statistical models to support regulatory and business goals.\nQualifications0-2 years of experience\nHigh School Diploma, GED or equivalent work experienceWhat is expected of you and others at this levelApplies acquired job skills and company policies and procedures to complete standard tasks\nWorks on routine assignments that require basic problem resolution\nRefers to policies and past practices for guidance\nReceives general direction on standard work; receives detailed instruction on new assignments\nConsults with supervisor or senior peers on complex and unusual problemsCandidates who are back-to-work, people with disabilities, without a college degree, and Veterans are encouraged to apply.Cardinal Health supports an inclusive workplace that values diversity of thought, experience and background. We celebrate the power of our differences to create better solutions for our customers by ensuring employees can be their authentic selves each day. Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law.To read and review this privacy notice click hereJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}