{
    "Job ID": "69867291",
    "Description": "Who are we looking for?\nWe are looking for a reliable Marketing Associate to join the Strategy team to support the business and marketing team by executing marketing campaigns & in strategizing campaigns that will drive more conversions for the business verticals. Mainly handles campaign planning execution, content creation, plus reporting and analysis.Strategy team within talabat is a small, multicultural team of ex-consultants and industry veterans. As a Marketing Associate, you will support day-to-day marketing operations, reporting & analysis, coordinating with relevant stakeholders across marketing, sales & customer support teams to ensure smooth functioning of the business programs. Working with stakeholders from different parts of the business, you can expect exposure to different aspects of talabat.What’s on your plate?Manage daily marketing operations to support the overall marketing function\n\nWork closely with relevant departments across the organization to ensure smooth operations and delivery of ongoing marketing initiatives\n\nHandling, planning & liaising with internal teams to activate campaigns\n\nMaintain and update relevant documentation and trackers including reporting of marketing expenses\n\nTracking all campaign communication & creating post-campaign result documents with corrective or next steps for new campaigns\n\nWorking with the manager to plan campaigns, which are aligned with the annual regional and local marketing calendars;\n\nConduct market research including competitive analysis on a regular basis, flag new trends and come up with marketing campaign ideas;\n\nCoordinate with customer support teams to close tickets by tracking complaints and sharing required information \n\nSupporting content creation for different requirements including campaign planning, briefs, translations, etc.\n\nManaging CMS tools for a variety of tasks like updating content, customer compensations, etc.  \n\nExtending support on a need basis for adhoc operational requirements.\n What did we order?You have at least 2 years of relevant working experience, preferably in e-commerce\n\nStrong project management skill set\n\nYou have strong stakeholder management & communication skills\n\nYou are comfortable working in a dynamic, fast-changing environment\n\nBasic knowledge of business processes and marketing know-how\n\nAttention to detail and results-driven personalityFluency in English. Arabic is an added advantageJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}