{
    "Job ID": "69866268",
    "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleJob Description:Design large and complex Data Migration, Data Warehousing, and Business Intelligence Solutions.\nUnder general supervision, analyze conversion requirements and write Conversion Programs.\nInterpret client’s existing systems, workflows, and processing parameters.\nMust take complete ownership of the technical delivery the assigned conversion/implementation.\nManages multiple clients and adhere to project timelines.\nMonitors project progress by tracking activity, resolving problems, publishing progress reports, recommending actions in accordance with stated procedure.\nAssists management with the planning and design of improvements to business processes.\nUses sound judgment and experience to solve moderately complex problems based on precedent, example and experience that is commiserate with that of Business Analyst.\nUtilizes system and data to resolve business issues in the most effective manner.\nAnalyzes and identifies root cause; providing input to solutions that lead to success of the project.\nCommunicate progress and any potential problems to Project Manager for awareness and/or resolution.\nMaintain the tools used to ensure the efficiency and effectiveness of the conversion process (system studies, timelines, and questionnaires).\nWork in late night shift to provide overlap with US working hours.Required Qualifications:Education:B. Tech/MCAJob Related Experience –Essential10 to 12 years of experience in IT Industry.\nExcellent Programming skills on IBM Mainframe Programming, COBOL, TSO, JCL.\nGood understanding of mainframe files\nShould have good understanding of activities performed in conversion/implementation of core Banking application.\nGood knowledge in identifying valid business scenarios, business workflows and business process.\nKnowledge of Banking domain.\nExperience of estimating data migration projects.\nExperienced problem solving and debugging skills.\nGood verbal and written communication and interpersonal skillsDesirableExperience supporting Banking Core Conversions.\nExperience on Account Processing core is a plus.\nExposure to Banking and Financial Services industry with a good understanding of Banking Products, Services & Procedures. Additional Skills/Knowledge:Strong analytical skills, good verbal and written communication skills and the ability to interact professionally with a diverse group.\nLeadership and mentoring skills.\nProficiency with Excel.Thank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}