{"Job ID": "69866202", "Description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We are looking for people who are determined to make life better for people around the globe.Research LRL Tech@Lilly unites science with technology to accelerate LRL pipeline and to deliver therapeutic innovations. Our work helps researchers follow the science to understand the disease as well as to identify potential therapies.  We achieve this by leveraging technology and platforms to streamline scientific experimentation. We organize and manage high-quality data to drive analysis. We build advanced analytics platforms for scientists to rapidly analyze and visualize data in a scalable and reproducible way.As a software engineer, you will be part of the team in LCCI designing, developing, and deploying machine learning models and systems. They work closely with data scientists, software engineers, and other stakeholders to implement machine learning solutions that address complex business problems. This position requires a strong background in machine learning algorithms, programming skills, and data manipulation techniques. Most importantly, you will have the opportunity to work in a highly technical, high pace, team focused, and scientifically challenging areas to accommodate ever-changing research environment.Responsibilities:Develop and implement machine learning models and algorithms to solve specific business problems, such as predictive analytics, recommendation systems, or natural language processing. \nCollect, clean, and pre-process large datasets to extract relevant features and prepare them for machine learning tasks. \nCollaborate with data scientists and domain experts to understand business requirements and translate them into machine learning solutions. \nExperiment with different machine learning techniques and algorithms to optimize model performance and accuracy. \nTrain and fine-tune machine learning models using a variety of methods, such as supervised learning, unsupervised learning, or reinforcement learning. \nEvaluate and validate the performance of machine learning models using appropriate metrics and statistical analysis. \nDeploy machine learning models into production environments, ensuring scalability, reliability, and performance. \nCollaborate with software engineers to integrate machine learning models into existing systems or develop new applications. \nMonitor and maintain deployed models, performing regular performance checks, debugging, and optimization as necessary. \nStay updated with the latest advancements in machine learning and related fields, and apply them to improve existing models and processes. \nDocument and communicate machine learning solutions, including code, methodologies, and results, to technical and non-technical stakeholders. Essential Skills:Bachelor's or Master's degree in Computer Science, Data Science, Machine Learning, or a related field. \nStrong knowledge of machine learning algorithms and techniques, such as regression, classification, clustering, deep learning, and reinforcement learning. \nProficiency in programming languages commonly used in machine learning, such as Python, R, or Java. \nExperience with machine learning libraries and frameworks, such as TensorFlow, PyTorch, scikit-learn, or Keras. \nSolid understanding of data manipulation and pre-processing techniques, including feature extraction, dimensionality reduction, and data normalization. \nFamiliarity with big data processing tools and frameworks, such as Hadoop, Spark, or Apache Flink. \nExperience with cloud platforms and services, such as AWS, Azure, or Google Cloud, for scalable machine learning deployments. \nProficient in using version control systems (e.g., Git) and collaborative software development practices. \nStrong analytical and problem-solving skills, with the ability to analyse complex datasets and derive actionable insights. \nExcellent communication skills to effectively collaborate with cross-functional teams and present technical concepts to non-technical stakeholders. \nAbility to work independently and manage multiple projects with competing deadlinesDesired Skills:Knowledge of distributed computing and parallel processing frameworks, such as MapReduce or Apache Spark. \nFamiliarity with data visualization tools, such as Tableau, matplotlib, or ggplot. \nUnderstanding of natural language processing (NLP) techniques and frameworks, such as NLTK, SpaCy, or BERT. \nExperience with containerization technologies like Docker and orchestration tools like Kubernetes. \nKnowledge of software engineering principles and practices, including software design patterns and testing frameworks.Eli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.Lilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.#WeAreLillyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}