{"Job ID": "69866805", "Description": "About Amazon.com\nAmazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\n\nAbout the Role\nCategory Management\nCategory Managers at Amazon have end to end responsibility of the customer experience and growth of the category they have been assigned to. Amazon strives to present its customers with the widest selection of products at the best prices – The Category manager’s role is to bring in the relevant assortment, design targeted promotions, manage partners including sellers and brands\nCategory managers anticipate customer needs and incorporate them into the functional roadmap and will drive a major change or enhancement for customer experience influencing category needs based on their knowledge of competitive trends in the marketplace and other macro environment data.\n\nResponsibilities Include\nThe successful candidate will be the business owner, with responsibility for signing the right mix of selection in partnership with sellers, adding unique local selection, driving traffic conversion and margin improvements while delivering top notch customer experience. He/she must be an effective leader and communicator working with our most important partners, as well as with internal colleagues and groups. He or she will have strong business judgment with a track record of strong ownership values and relationship management skills. This position offers an exciting opportunity to work on a start-up business team.\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\nBasic qualifications\nAn understanding of and passion for e-commerce.\n· Work experience is preferred (5 - 10 years).\n· Experience in Business, category management, buying, Selling or finance\n· Excellent written and verbal communication skills\n· Proven negotiation skills, influencing abilities\n· Strong numerical and analytical aptitude\n· Proven experience leading cross-functional projects\n· Ability to think and react in a high-energy, fast-paced environment\n· Good organizational skills including prioritizing, scheduling, time management, and meeting deadlines\n· Detail-oriented\n· Technical aptitude and agility to learn web-based tools\n· Smart, enthusiastic, hard-working, and creative.\n· Innovative, team oriented, and have a desire to participate in change and appreciate a dynamic environment with rapidly changing priorities.\n· Experience in project ownership and using customer data to identify and prioritize opportunities.\nThe position will be based in Amazon’s office in Bangalore.\nPreferred qualifications\nMaster's degree is preferred\n[Experience in Consumer-facing sectors such as Ecommerce, Retail, FMCG, Strategy Consulting is preferredJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Project & Construction Planning", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}