{"Job ID": "69866373", "Description": "Basic Function:Hostess position in the food and beverage serviceRole and ResponsibilitiesAnswer telephones according to Four Seasons standards and take guest reservations or provide information regarding the restaurant or any other hotel service.\nAnticipate the needs of guests, respond accordingly to guest inquiries or problems, and recognize regular guests by name and utilize the guest’s name consistently.\nInspect and maintain daily menus to ensure quality, condition and appearance while developing a complete working knowledge of all menu items and daily specials.\nSet up host/hostess stand, review guest reservation book, and make recommendations as to the set-up of the room, maintain a station chart and cover count for the restaurant while recognizing the maximum workload capacity of each server in order to meet Four Seasons Service standards.\nSeat guests promptly at a table pre-set for the number in the party and according to guest preference\nDisplays warmth, care, and genuine enthusiasm when dealing with guests and internal customers, Lives the golden ruleDepartmentalEnsures the host desk is ready with required equipment.\nTakes responsibility of maintaining the guest profile, contact details and their preferences\nIs familiar with beverage and food menu menu\nProvides genuine hospitality and recognition\nEngage in guest interaction in a sensitive and appropriate manner; anticipates guest needs and takes ownership of guests simple requestsSpecific responsibilities and taskGeneralAdheres to the hotel’s code of conduct and grooming standards\nActively participates in briefing and meetings\nMaintains a clean and orderly work area and promotes a safe working environmentDepartmentalShould have the complete details of guests dinning in the restaurant like resident or walk in, celebrating any occasion, etc\nShould have a proper floor plan with awareness of tables available\nShould ensure to have the tables ready as per the reservation of the day\nShould inform the server about the dietary restrictions if known during the time of reservation\nBid farewell the guests while they are leaving\nShould help the fellow servers with misen place and restaurant setup after the operation hours or whenever necessaryAppropriate manual/policy and procedure:     Four seasons service culture standards\nFour seasons core standardsGeneralFront and lobby areasProblem resolutionHeart of the house/employee dinningStaff locker roomsCompliance policies1.Confidential, privacy and proprietary data statement2.Policy against harassment3.Electronic system policyExperience:                                                          Has to have6-12 months of relevant experience in a 5-star hotel/resort\nPossesses excellent English,math and psychometric abilities\nPossesses guest PR skills and personal flair\nHas undergone basic training in food and beverage knowledgeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}