{"Job ID": "69865987", "Description": "Requisition ID: 271827 Relocation Authorized: National - Family \nTelework Type: Full-Time Office/Project \nWork Location: New Delhi POSITION SUMMARY:Located at the Gurugram office, provides project supplier quality supervision support on a project including capability surveys, audits and area or shop quality surveillance in accordance with Bechtel Supplier Quality & Expediting Inc. (BSQE) and Project ProceduresJOB DIMENSIONS:Supervision ReceivedReceives operational direction and guidance for Supplier Quality activities from Project Procurement Manager\nReceives functional guidance from the Regional Project Supplier Quality ManagerSupervision ExercisedProvides project-related direction and guidance to Project SQ Representatives and Area SQ SpecialistsRESPONSIBILITIES:Plan, prepare and administer Quality Surveillance Assignments (QSAs) for source surveillance, surveys and audits as required for project\nCoordinate with home office PSQS and SQ Regional Managers for allocation of resources for intended QSA’s.\nReview material requisitions including technical specifications with respect to quality requirements. Participates with Engineering in determining surveillance levels required and establishing witness and hold points\nAssist in the development of the final bid list and the selection of a recommended bidder\nParticipate in pre and post-award meetings with suppliers to review Area Supplier Quality’s right of access, release for shipment authority, and notification on witness and hold points during quality surveillance activities\nPrepare quality surveillance and capability survey assignments for execution by the assigned Area SQ Specialists\nInvestigate quality issues reported to the GBU SQ Manager on equipment/materials where quality surveillance has been performed\nReview, edit, accept, and distribute reports in accordance with this Manual and Project Procedures. Ensure survey and audit reports are approved and posted into supplier database. Regularly check anomaly code information and assignment information which has been siphoned from Quality Surveillance Reports into SQEAS is accurate and make any necessary corrections\nCoordinate review, obtain and resolve Project Quality Assurance and Engineering comments on quality surveillance plans when required by Project Procedures and Engineering Department Procedure Instructions\nMonitor and report quality metrics established by the functional Project SQ Manager\nNotify the PPM and responsible project personnel of any significant problems and initiate timely follow-up\nMonitor and manage job hour and monetary budgets and initiate trends when any overrun is foreseen or experienced\nCoordinate review of Quarterly Supplier Status Reports for lessons learned on suppliers\nFacilitate communication between on and off project personnel across disciplines; provide project direction to assigned SQ Specialists and coordinate communication between SQ Specialists and project personnel to assist in resolving technical and quality issues arising from area/shop SQ activities\nRepresent SQ in project meetings, project reviews and in the resolution of issues relating to supplier quality\nResearch and summarize data and populate established project and procedural performance metrics. Develop project specific metric for implementation as deemed useful by the project team\nLead development of SQ automation, data analysis & Power BI dashboards\nContact with Customers at the operational level during external audits, project bid clarification meetings, and meetings to discuss supplier quality topicsJOB KNOWLEDGE: Experience with major commodities typically procured for Energy / Manufacturing and Technology (Semiconductors, Data Centers, and EV value chain), recognized codes and standards, manufacturing methods\nPerform project SQ functions having some degree of complexity, e.g., preparation of detailed inspection plans for use on complete or uniquely designed systems; preparation of full scope man-hour and budget estimates for proposed projects; review of complex technical specifications; or establishment of project corrective action(s) to resolve nonconformances that have a significant impact on project cost/schedule\nRequisite certification as an ANSI/ASME Level II (further to Level I competencies) and performs the following:Conduct capability surveys of a prospective supplier\nParticipate as an audit team member or technical resource for quality program audits\nMonitor the administrative and technical performance of Third-Party Agency quality surveillance personnel to assure that Corporate SQ Manual and Procedures and quality surveillance assignment instructions are implementedQUALIFICATIONS AND SKILLS:BASIC QUALIFICATIONS:A Bachelor’s degree, preferably in Engineering, from a reputed University. Minimum 15 years of relevant industry experience in inspection and testing activitiesADDITIONAL QUALIFICATIONS:A minimum of 4,000 hours of in-shop quality surveillance or related work. Must be an Indian Citizen\nMust have performed a lead role in supplier quality/ quality management on at least two large EPC projects involving global suppliers. Must have experience of coordinating with and reporting to Customer on all SQ matters independently\nPrior experience in leadership roles, deft in writing technical procedures and problem solving.\nWilling to travel globally based on business needs#LI-AP1Shaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}