{"Job ID": "69868539", "Description": "MicroStrategy Consultant\n The BI Developer uses operational (OLTP) and warehouse data to solve organizational problems through reports, analysis and data visualization. The BI Developer will provide enterprise wide data warehouse expertise with emphasis on data design, access, usage, security and quality of information assets. Using the MicroStrategy and ETL technologies the BI Developer will design and develop solutions that provide insights to our business needs.\n Essential skills and experience\n•5+year’s hands-on development experience with MicroStrategy Platform.\n•Strong experience building reports and dashboards using MicroStrategy\n•Strong Experience on Microstrategy Transaction Services\n•Strong experience building mobile applications (for IPhone/iPad) using MicroStrategy\n•Strong Reporting and data structure and SQL development experience\n•Have a good understanding of data management systems and processes within the ecosystem (source systems, data feeds, reference data management, ETL, Data Warehouses and Marts, data cube design, etc.)\n•Experience in developing and tuning queries for ad hoc, canned reporting, and dashboard use, with back end system such as Web Service(XQuery) and RDBMS\n•Experience working with end-user to identify their BI needs and directly applying technology as a solution for both tactical and strategic problems.\n•Microstrategy Server Administration: Install, configure, manage and execute upgrades of MicroStrategy environment.\n•Work with MicroStrategy support to resolve issues requiring vendor assistance\n•User Management\n•Minor Bug fixes and Enhancements of Microstrategy Reports and Dashboards\n•Govern the MicroStrategy environment\n•Production Migration of the code from Development to Production Environments\n•Microstrategy SDK Code Development and Deployment\n•Strong hands on in MicroStrategy Write Back feature to support the OLTP system built in this tool\n•Excellent analytical, logical and problem-solving skills\n•Excellent spoken and written communication skills\n•Ability to thrive in a fast-paced and changing environment\n•Strong Knowledge of the SDLC(Software Development Life Cycle) process is required\n•Hand on Experience in Power BI and SSAS (preferred)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}