{
    "Job ID": "69869554",
    "Description": "Vacancy Overview Process Engineer Airswift is an international workforce solutions provider within the energy, process, and infrastructure industries. Airswift serves as a strategic partner to our clients, offering a turnkey workforce solution to capture and deliver the top talent needed to complete successful projects by aligning with the unique needs of our clients. With over 800 employees and 6,000 contractors operating in over 50 countries, our geographical reach and pool of talent available is unmatched in the industry. Airswift is seeking for Process Engineer to work in Qatar with a major Oil & Gas Company. QUALIFICATIONS Engineering Degree in Chemical DUTIES AND RESPONSIBILITIES Undertake independent process engineering studies, analysis, interpret and make conclusions on studies and tasks. Undertake process optimization related initiatives and studies and have capability to identify optimization opportunities. Provide Technical support to all company Assets to ensure Asset Integrity Design review of PFD, P&ID, Heat & Mass Balance, Specifications. Perform all necessary process calculations and assessments. Support HAZOP, HAZID, Risk Assessment, Cold Eye Review, What-if-Analysis. Attend all design meetings and technical workshops. Ensuring that the designs and project drawings meet the local regulations and international standards, and safety codes. Perform economic/financial evaluation for feasibility studies for different facilities. Review and Develop strategies to ensure continuity of service and optimum performance of systems. Perform site activities such as supervision & inspection. Meeting the requirements of the company’s business plan and objectives. Monitoring and supervising activities related to Process Engineering and recommend projects / suggestions to ensure efficient and reliable operations. Ensuring the consultants / contractors are delivering detailed designs according to the Company’s standards Requirements. Support the department in ensuring that all drawings, standards, specifications, manuals and data books are kept up-to-date and “as-built” Carries out various duties related to conducting feasibility studies, developing cost estimates in conjunction with the Cost & Contracts Engineer, personally preparing conceptual or detailed designs or reviewing vendor’s final design drawings for approved projects, preparing capital authorization requests for approval, preparing bills of materials, participating in preparing purchase orders, following up on quotations, conducting technical bid analyses, answering queries from vendors and recommending suppliers or contractors. Supervises the implementation of minor modification and improvement projects carried out in-house to ensure execution and completion of established Company standards and specifications. Acts as the focal point for process engineering matters and provides expert technical advice to Management and other departments/divisions as required. Also troubleshoots complex or recurring instrument or control system problems and recommends sound and cost effective solutions as the problems arise. Responsible for the support of Company Safety, environment and Quality policies and programs, and carrying out specific duties and responsibilities related to his job as spelled out in Management system documentation, policies, procedures, local documentation, Management System Manual, Safety Manual and other related documents. EXPERIENCE: Minimum 10 years’ experience in Process Engineering with at least 5 years in the Oil and Gas or similar industry such as LNG and Refinery. Very good written and spoken English. High computer literacy in both office and technical / engineering applications Exhibits good knowledge on Plant & Facilities, Real Time Information Systems and Process Engineering Concepts. Exhibits good knowledge on Process Engineering simulations like Aspen Hysys and Flarenet. Understands standards and codes applicable for Process Engineering. Very strong team working skills, with the ability to interact effectively with a wide range of stakeholdersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}