{
    "Job ID": "69866419",
    "Description": "We are looking to hire a dynamic IT Coordinator to join our company. In this role, you'll be responsible for installations and upgrades on our company's computers, tablets, and smartphones. You will also provide our staff with training on using hardware, software, and cloud-based services.To ensure success as an IT Coordinator, you should display the strong technical aptitude needed to help staff solve their technical issues as quickly as possible. Ultimately, an outstanding IT Coordinator should be able to thrive in the rapidly changing industry of information technology.YOUR DAY-TO-DAY:Managing and maintaining a company's technological equipment, such as computers, tablets, and smartphones.\nEnsuring that company devices interconnect with file servers, email servers, and financial systems seamlessly.\nInstalling, upgrading, and managing software and hardware on company devices.\nManaging all software licensing.\nKeeping an inventory of all company electronic assets.\nProviding staff with training on how to use hardware, software, and cloud-based services.\nCreating instructions for program installation sequences.\nPerforming backups and restoring lost data as needed.\nEvaluating and recommending software purchases to the IT manager.WHAT WE REQUIRE FROM YOU:Bachelor's degree in information technology, computer technology, or a similar field.\nAt least two years experience as an IT coordinator or related role.\nExpertise in IT tools and concepts, such as operating systems and internet protocol suites.\nSolid knowledge of LAN/WAN configurations.\nExpertise in configuring and managing Apple iOS and Android devices.\nStrong troubleshooting, analytical, and problem-solving skills.\nGood interpersonal skills and the ability to work with technical and non-technical personnel.WHAT YOU CAN EXPECT FROM US:We give our people everything they need to succeed. From a competitive salary that rewards all your hard work to a wide range of benefits designed to help you live your best work-life – including a full uniform, impressive room discounts, and some of the best training in the business.Our mission is to welcome everyone and create inclusive teams where we celebrate differences and encourage colleagues to bring their whole selves to work. IHG Hotels & Resorts provides equal employment opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. We promote a culture of trust, support, and acceptance. Always welcoming different backgrounds, experiences, and perspectives.IHG gives every member of the team the room they need to belong, grow and make a difference in a collaborative environment. We know that to work well, we need to feel well – both inside and outside of work – and through our well-being framework, we are committed to supporting well-being in your health, lifestyle, and workplace.So, join us and you’ll become part of our ever-growing global family.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}