{"Job ID": "69866414", "Description": "Apply now Job no: 4083970\nLocation: UAE\nThe BeachP.F. Chang'sP.F. Chang's, an American restaurant chain serving American-Chinese cuisine, is committed to providing you with an exceptional dining experience every time you walk through our doors. Each dish on the menu is prepared using the freshest and highest quality ingredients and the dining experience is stylish, upbeat and comfortable. Joining PF Changs means becoming part of, and adding value to, a team that is committed to doing everything possible to providing an optimal dining experience for our guests.The Role:The role of the Restaurant Supervisor is to oversee junior team members in their service delivery, ensuring guest satisfaction is always the main focus, whilst building good customer relations and ensuring company standards are delivered.Qualifications & Requirements:You will have/be:- 3 years' proven experience in leading a team of junior staff.- A relevant hospitality qualification or relevant experience.- An effective communicator who has a passion for hospitality.- Strong, proven problem solving skills.About Us:Alshaya Group is a dynamic family-owned enterprise which was first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering customers an unparalleled choice of well-loved international brands, including: Starbucks, H&M, Mothercare, Debenhams, Cos, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Vavavoom, Pottery Barn and KidZania.\nAlshaya Group’s portfolio extends across MENA, Russia, Turkey, and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to delivering great customer service and brand experiences.\nFresh, modern, and relevant, Alshaya’s constantly evolving retail portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be.Advertised: 14 Sep 2023 Arabian Standard Time\nApplication close: 13 Oct 2023 Arabian Standard TimeBack to search results Apply now Refer a friendJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}