{"Job ID": "69861734", "Description": "Superpedestrian is engineering the future of micromobility. The Superpedestrian team is composed of some of the most talented operations specialists, policy managers, designers and engineers, all focused on transforming the future urban mobility. Our scooters, called LINK,  were designed to prioritize safety from the inside out, and our Superpedestrian team is dedicated to building meaningful local and city partnerships across the world. Join us!Superpedestrian is seeking a Turkey-based Parking Infraction Advisor to join our growing Customer Support team.  This person will assist in Superpedestrian’s mission to ensure every ride from beginning to end is a good one.  The ideal candidate will be able to quickly learn new processes and systems.  Candidates should be able to perform functions with a high degree of accuracy and productivity.  The ideal candidate is a digital native  comfortable in a fast paced startup environment. Having a passion for micro-mobility solutions and its future is a plus! We are looking to hire immediately in all shifts.  This role requires availability to work weekends and flexibility in shift start time. What you'll do:Respond to and complete all tasks assigned in a timely and accurate manner\nWork within multiple systems to validate reports of violations\nCommunicate violations as required through appropriate channels\nEnsure all records are updated and maintained\nFollow procedural guidelines \nOther duties as assigned What we’re looking for:Strong attention to detail\nSkilled in both written and verbal communication\nExcellent time management skills \nTask oriented and goal focused\nComfortable with learning new systems and technical environments quicklyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}