{"Job ID": "69868173", "Description": "Ensures product quality specifications are in compliance with corporate/customers' standards and requirements. Establishes QA/QC policies and standards for product assessment, technical service, vendors evaluations, and off-shore QA/QC; oversees QA/QC team and vendors to implement and enforce corporate QA/QC policies. An Entry Professional (P1) applies broad theoretical job knowledge typically obtained through advanced education. May require the following proficiency: Work is closely supervised. Problems faced are not typically difficult or complex. Explains facts, policies and practices related to job area. Responsibilities: Being responsible for in incoming & in-process quality function of the HV line , have to interact with colleagues of various functions. Monitoring of the assembly process with respect to work instructions and other technical provisions. Capturing and analyzing the quality issues faced during assembly and testing of the product on regular basis and their resolution through CAPA and  DMAIC analysis. Basic Knowledge of Casting, Machining processes. Manufacturing Processes of Switchgear Components. Monitoring and maintenance of quality records ( i.e. traceability, calibration etc.). Preparation of NCR, RGA , their record maintenance and interaction with the suppliers for improvements. Final product certification using check sheets. Preparing and display monthly product quality data on the display board. Conducting process audit periodically. Coordinating the activities during internal and external audit. Quality clearance for all tested products in SAP/ERP. Coordinating with cross functional for issue resolution Live core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues, and the business. Qualification: Preferred Bachelor’s degree in engineering (preferably Mechanical, industrial or management) or Mechanical Diploma experienced professional; At least 1-3 years of experience through Quality in Engineering to Order or switchgear business companies; Nice to have previous experience with S/4 Hana SAP and related Quality Module; Nice to have ISO basic knowledge; Proficiency in MS Office tools especially Excel and Power Point; Collaborative approach and willingness to learn;Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}