{"Job ID": "69869753", "Description": "Company:Job Area:General Summary:Job Overview:Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.Work Experience :3+ years working with operating budgets, resources, and/or project financials.\n\n4+ years of Program Management experience or related work experience.Responsibilities include:Responsible for IP/Core Subsystem Program execution of complex DSP Subsystem in terms of schedule, performance, power and cost\n\nManage a DSP subsystem Portfolio end to end from conception, product requirements to silicon validation, ensuring end to end Solutions\n\nConsistently assess and determine risks, develop mitigation strategies and communication to internal and external key stakeholders\n\nCo-ordination multi-site and multi-discipline teams to successful project completion\n\nRoll-up and reporting regularly to Senior Management on Key Product Development Milestones, Metrics, Risks/ Mitigation plans etc\n\nAllocation of Project staffing across projects in alignment with Resource Managers\n\nWorks closely with ASIC design implementation teams, Systems & Software teams to ensure successful and timely delivery of a Quality product.Certifications:Project Management Professional (PMP) - Project Management Institute (PMI)Minimum Qualifications:Preferred Qualifications:•    Master's degree in Engineering, Computer Science, or related field.•    PMP Certification.•    10+ years of Program Management or related work experience.•    5+ years of work experience in a role requiring interaction with senior leadership (e.g., Director level and above).•    3+ years of experience working in a large matrixed organization.•    2+ years of experience with program management tools such as dashboards, Gantt charts, etc.Principal Duties and Responsibilities:\n•    Collaborates with key stakeholders and program sponsors to develop program goals, set the prioritization of deliverables, discuss involvement of business processes (e.g., program change management, communication) and drives decisions necessary for on time delivery.\n•    Manages and takes responsibility for multiple medium sized programs/technology with moderate complexity by applying up-to-date program management knowledge to meet deadlines.\n•    Develops and manages the execution of the program Plan of Record (e.g., on time, on budget, within scope) for multiple medium sized programs which include schedule and resource forecasting, stakeholders identification, method and frequency of communication, scope, and prioritization.\n•    Establishes key program metrics and manages team to take action outside their comfort zone to ensure program success when metrics deviate from Plan of Record.\n•    Identifies and secures resources to ensure alignment of team with program/technology demand for multiple medium sized programs with moderate complexity.\n•    Drives teams to identify program issues/risks, and create a risk mitigation plan for multiple medium sized or a single complex program(s). Maintains and updates the risk tracker.\n•    Promotes program vision and objectives within the team, ensures program objectives are met or exceeded, presents program vision to management, and gains buy-in from stakeholders.\n•    Promotes adoption of processes by applying best practices and identifying and executing process improvement initiatives across the Program Management team.Level of Responsibility:\n•    Working independently with little supervision.\n•    Making decisions that are significant in impact; errors are not readily apparent due to the complexity of work process/product or time between decisions and results; errors typically result in significant expenditure of time, resources, and funds to correct.\n•    Using verbal and written communication skills to convey complex and/or detailed information to multiple individuals/audiences with differing knowledge levels. May require strong negotiation and influence, communication to large groups or high-level constituents.\n•    Having a moderate amount of influence over key organizational decisions (e.g., is consulted by senior leadership to provide input on key decisions).\n•    Completing tasks that require multiple steps that can be performed in various orders; tasks require simultaneously executing multiple cognitive abilities and maintaining information in short- or long-term memory.\n•    Exercising exceptional creativity to innovate new ideas and develop innovative products/processes without established objectives or known parameters.\n•    Using deductive and inductive problem solving; multiple approaches may be taken/necessary to solve the problem; often information is missing or conflicting; advanced data analysis and interpretation skills are required.\n•    Occasionally participates in strategic planning within own area affecting immediate operations. The responsibilities of this role do not include:\n•    Financial accountability (e.g., does not involve budgeting responsibility).Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}