{"Job ID": "69866095", "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.The candidate will work as part of the CRM team to build and support applications to improve the effectiveness and efficiency of the CRM business function. This role will participate in design, development, testing and support of CRM applications and ensure successful delivery of business capabilities. The ideal candidate will bring strong experience in developing technical solutions in Dot Net and CRM area.This is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Job Description\nAs a Software Engineer you will contribute to a team that develops and manages end-to-end technology solutions for Visa's core business (credit and debit transactions) and key stakeholders as well as new solutions that promote the growth of digital commerce and mobilization. The candidate will work as part of the CRM team to build and support applications to improve the effectiveness and efficiency of the CRM business function. This role will participate in design, development, testing and support of CRM applications and ensure successful delivery of business capabilities. The ideal candidate will bring strong experience in developing technical solutions in Dot Net and CRM area.\nQualifications\nOne year of work experience in ASP Dot Net,HTML,CSS, Java Script and a Bachelors degree,\n\nPreferred Qualifications\n\n• Between 1 to 1.5 years of work experience with a Bachelor’s Degree\n• Proficiency in at least one programming language or technology including, but not limited, to Java, C/C++, C#, .NET, python, Javascript, HTML, CSS and Objective-C\n• Very Strong .Net , code, HTML and JavaScript skills.\n• Experience with C# or Visual Basic, Visual Studio, Web Services, and the\n• Strong interpersonal, facilitation skills along with effective communication\n(both written and verbal) skills.\n• Demonstrated ability to solve complex software development issues.\n• Demonstrated ability to work in a complex organization to determine\nbusiness and customer needs, providing the best solution to meet those\nneeds.\n• Proactive thinking with a ‘can do’ attitude.\n• Bachelor's degree in a Computer Science or Engineering discipline.\n. Good to have Power Portal Liquid\n• Highly driven and resourceful\n• Strong ability to collaborateVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}