{
    "Job ID": "69866421",
    "Description": "The Ops Support Specialist 5 is an entry-level position responsible for providing operations support services, including but not limited to; record/documentation maintenance, storage & retrieval of records, account maintenance, imaging and the opening of accounts in coordination with the Operations - Core Team. Additionally, the Ops Support Specialist 5 serves as the liaison between operations staff, relationship managers, project managers, custodians and clients. The overall objective of this role is to provide day-to-day operations support in alignment with Citi operations support infrastructure and processes.\nResponsibilities:Resolve customer inquiries and supervise escalated issues, providing efficient and effective customer service to Citi’s clients\nIdentify opportunities to offer value added products and services while adhering to strict laws and regulation governing Telesales\nCommunicate daily with management on productivity, quality, availability, Management Information System (MIS) indicators, as well as providing written and oral communications to supported business areas for approval of correct financial entries and resolution of incorrect entries\nFacilitate training based on needs of staff within the department and assist with answering staff questions within Disputes, as needed\nSupport expansive and diverse array of products and services\nAssist with ongoing Lean and process improvement projects\nResolve complex problems based on best practice/precedence, escalating as needed\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:2-4 years of relevant experience\nProficient in Microsoft Office\nComprehensive knowledge of Dispute process\nAbility to work unsupervised and apply problem solve capabilities\nAbility to work occasional weekends to support Pega releases and COB testing\nWorking knowledge of Pega and/or G36 functionality, Continuity of Business (CoB) testing, and creating and resolving Trust Receipts (TR’s)\nDemonstrated analytical skills and mathematical knowledge\nConsistently demonstrates clear and concise written and verbal communication skillsEducation:High School diploma or equivalentThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}