{"Job ID": "69866704", "Description": "The Amazon India Payments Team’s vision is to delight our customers with the best payment experience in the world! To achieve this vision, we are in search of a talented technical leader and craftsman who builds robust software at scale as well as client-facing features which are intuitive and simple to use.\nOur team builds convenient and seamless payment experiences and financial services for Amazon India customers. This focus on customer requires working on different technologies and back-end platform systems in order to meet the needs of our customers. Our back-end systems are always available and guarantee that our customer’s orders are never lost and always processed even when downstream services are down. You will have a chance to understand and influence Amazon's India Stack across business.\nOur team is requiring a Senior Technical Program Manager (Sr. TPM) to work on org-wide programs, to define and drive execution of key initiatives. You will provide technical direction for global teams focused on providing Amazon customers with payment experiences to world-class Excellence. You will be responsible for driving large-scale initiatives to continuously improve customer experience.\nAs a Sr. TPM you will be responsible to (1) drive large scale customer impacting programs (2) innovate, pitch and refine ideas to engineering leaders and executives and (3) develop roadmaps for large and complicated scalable architectural changes and drive them to delivery. You will work with several business and core technical teams to understand specific business needs, assist in the technical design of processes and technical solutions, innovate new features, and then work with engineering teams to deliver them on an aggressive schedule. As part of program management, you will also assess risk, develop risk mitigation plans, anticipate and resolve bottlenecks, manage issue escalation, and make tradeoffs balancing the business needs versus technical concerns and compliance requirements.\nKey Responsibilities:\n* Program management of large scale complex initiatives through the entire development life cycle; planning, execution, status reporting and coordination against project plans and delivery commitments\n* Able to dive deep, understand, communicate and mitigate technical bottlenecks. Represent the team in leadership or stakeholder reviews.\n* Provide leadership and support for multiple engineering teams operating. Engage the engineering teams and TPMs of various organizations to ensure that their iterations on design and development enable delivery by needed deadlines.\n* Work closely with business engineering teams to ensure business needs are met without compromising long term platform health and evolution.\n* Facilitate roadmap development across the multiple engineering teams and help shape the overall vision to build cost effective solutions software solutions that suitable for Amazon scale.\n* Facilitate launch planning across multiple teams to bring the project end points along multiple work streams into a single timeline to meet compliance readiness dates\n* Coordinate with TPMs/PMs from tech work streams to ensure that technical and non-technical plans and initiatives are coordinated and achieve the goals of business needs without impacting the performance of the business teams.\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- 7+ years of working directly with engineering teams experience\n- 5+ years of technical product or program management experience\n- 3+ years of software development experience\n- 5+ years of technical program management working directly with software engineering teams experience\n- Experience managing programs across cross functional teams, building processes and coordinating release schedules\n- Experience owning/driving roadmap strategy and definition\n- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\n- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\n- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadershipJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}