{
    "Job ID": "69866693",
    "Description": "IntroductionYour Role and ResponsibilitiesProfessionals with this specialty act as interpreters between the worlds of IT and business. They work with clients to gather requirements utilizing a variety of techniques including agile principles and methodologies, document those requirements, interface between the client and development team to ensure the requirements are being translated into the solution accurately, track the progress of the solution through development, manage the user acceptance testing, as well as communicate and educate the client and user community on the solution through training materials and technical documentation. Skills required for this role include the application of basic financial concepts, knowledge of business plans, impact analysis, problem solving, and communication as well as application architecture and database management.Professionals with this specialty act as interpreters between the worlds of IT and business. They work with clients to gather requirements utilizing a variety of techniques including agile principles and methodologies, document those requirements, interface between the client and development team to ensure the requirements are being translated into the solution accurately, track the progress of the solution through development, manage the user acceptance testing, as well as communicate and educate the client and user community on the solution through training materials and technical documentation. Skills required for this role include the application of basic financial concepts, knowledge of business plans, impact analysis, problem solving, and communication as well as application architecture and database management.Required Technical and Professional ExpertiseProfessionals with this specialty act as interpreters between the worlds of IT and business. They work with clients to gather requirements utilizing a variety of techniques including agile principles and methodologies, document those requirements, interface between the client and development team to ensure the requirements are being translated into the solution accurately, track the progress of the solution through development, manage the user acceptance testing, as well as communicate and educate the client and user community on the solution through training materials and technical documentation. Skills required for this role include the application of basic financial concepts, knowledge of business plans, impact analysis, problem solving, and communication as well as application architecture and database management.Preferred Technical and Professional Expertise\nN/AJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Islamabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}