{
    "Job ID": "69865732",
    "Description": "This position within GCD is accountable end to end from CSI (Commit to Study Initiation) until study archiving for planning and leading the delivery of interventional, studies to time, quality, budget, company standards and scientific requirements as outlined in the clinical study proposal.  This involves generating robust and accelerated delivery plans (with a focus on upper quartile performance) and delivering these to target or stretch thresholds.\n\nKey responsibilities :\n\nKey responsibilities include, but are not limited to:\n\naccountability for the operational delivery of clinical study to time, quality, and budget (e.g., country selection, diversity, patient engagement strategy, recruitment plan, etc), driving decision-making at pace and leading study team to achieve overall study deliverables. \nSupport assessment and selection of FSO vendors,\nAccountable for holistic oversight of FSO vendors according to the FSO handbook\nAccountable for assessment and selection of other study vendors under GCD responsibility. \nEnsure compliance with ICH/GCP guidelines, all applicable laws and regulations, and GSK SOPs for assigned studies. understand study contribution to program/submission\nAccountable for translating asset requirements to the study and appropriate communication with the Asset Lead\nBalance risk/benefit to make decisions based on clear understanding of impact on the study and project.\nProactively and effectively identify, oversee and mitigate study risks. \nEnsure appropriate stakeholder communication, including study status, expectations, risks and issues\nPreparation of materials for governance and / or financial review cycles.\nAccountable for the study budget\nEffectively build and lead empowered matrix teams;\nImplement innovative approaches to study delivery through external facing advances in technology and sciences and encourage others within matrix and line teams to seek innovative perspectives and develop solutions. Decision maker for the innovative solutions (eg DCT,…) to be used at study level\nResponsible for operational input into protocol and informed consent form development, and other key study documents.\nLead and conduct investigator meetings and other study related meetings; participate in governance meetings as required. \nLead quality efforts to ensure study compliance and continual inspection readiness for assigned studies.\nIdentify and communicate resource gaps for assigned studies.\nLead / contribute to ways of working and process improvement initiatives.\nJob Related Experience :\n\nExperience in clinical research: study management, monitoring, data management\n\nStrong skills and experience in project management and tools In depth knowledge of GCPs and ICH guidelines\n\nGrade 6: Extensive clinical development experience and proven experience in driving operational study delivery to time, cost, and quality within the pharmaceutical industry or CRO environment.\n\nOther Job-Related Skills:\n\n·Experience in clinical research: study management, monitoring, data management\n\n·Strong skills and experience in project management and tools In depth knowledge of GCPs and ICH guidelines\n\n·Solid experience working in teams with a broad range of cultures, including team leadership\n\n·Excellent leadership skills, promoting motivation and empowerment of others in order to accomplish individual, team and organizational objectives\n\n·Excellent understanding of the clinical study, drug development, sample management and other associated process and quality requirements, including ICH/GCP guidelines and SOPs\n\n·Good project management skills (including scope, budget, timeline, and resource planning and management, and use of associated tools and support where available)\n\n·Able to lead and work within teams and networks across functional and geographical boundaries; leads by example and promotes collaboration, effective communication and leadership in others\n\n·Able to set and manage priorities, performance targets and project initiatives in a global environment\n\n·Operational expertise in risk management and contingency planning\n\n·Applies industry best practices to the design and execution of clinical studies to improve time and cost efficiency\n\n·Demonstrates conceptual, analytical and strategic thinking\n\n·Effective at problem solving and conflict resolution\n\n·Ability to manage change and uncertainty\n\n·Ability to delegate tasks\n\nEducation Requirements :\n\nBachelor’s degree: life sciences or related discipline\n\nThe role will require a good understanding of complex clinical development and regulatory processes.\n\n\n\n\n\nAdditional Job DescriptionAdditional Job Description\n\nThis position within GCD is accountable end to end from CSI (Commit to Study Initiation) until study archiving for planning and leading the delivery of interventional, studies to time, quality, budget, company standards and scientific requirements as outlined in the clinical study proposal.  This involves generating robust and accelerated delivery plans (with a focus on upper quartile performance) and delivering these to target or stretch thresholds.\n\nKey responsibilities :\n\nKey responsibilities include, but are not limited to:\n\naccountability for the operational delivery of clinical study to time, quality, and budget (e.g., country selection, diversity, patient engagement strategy, recruitment plan, etc), driving decision-making at pace and leading study team to achieve overall study deliverables. \nSupport assessment and selection of FSO vendors,\nAccountable for holistic oversight of FSO vendors according to the FSO handbook\nAccountable for assessment and selection of other study vendors under GCD responsibility. \nEnsure compliance with ICH/GCP guidelines, all applicable laws and regulations, and GSK SOPs for assigned studies. understand study contribution to program/submission\nAccountable for translating asset requirements to the study and appropriate communication with the Asset Lead\nBalance risk/benefit to make decisions based on clear understanding of impact on the study and project.\nProactively and effectively identify, oversee and mitigate study risks. \nEnsure appropriate stakeholder communication, including study status, expectations, risks and issues\nPreparation of materials for governance and / or financial review cycles.\nAccountable for the study budget\nEffectively build and lead empowered matrix teams;\nImplement innovative approaches to study delivery through external facing advances in technology and sciences and encourage others within matrix and line teams to seek innovative perspectives and develop solutions. Decision maker for the innovative solutions (eg DCT,…) to be used at study level\nResponsible for operational input into protocol and informed consent form development, and other key study documents.\nLead and conduct investigator meetings and other study related meetings; participate in governance meetings as required. \nLead quality efforts to ensure study compliance and continual inspection readiness for assigned studies.\nIdentify and communicate resource gaps for assigned studies.\nLead / contribute to ways of working and process improvement initiatives.\nJob Related Experience :\n\nExperience in clinical research: study management, monitoring, data management\n\nStrong skills and experience in project management and tools In depth knowledge of GCPs and ICH guidelines\n\nGrade 6: Extensive clinical development experience and proven experience in driving operational study delivery to time, cost, and quality within the pharmaceutical industry or CRO environment.\n\nOther Job-Related Skills:\n\n·Experience in clinical research: study management, monitoring, data management\n\n·Strong skills and experience in project management and tools In depth knowledge of GCPs and ICH guidelines\n\n·Solid experience working in teams with a broad range of cultures, including team leadership\n\n·Excellent leadership skills, promoting motivation and empowerment of others in order to accomplish individual, team and organizational objectives\n\n·Excellent understanding of the clinical study, drug development, sample management and other associated process and quality requirements, including ICH/GCP guidelines and SOPs\n\n·Good project management skills (including scope, budget, timeline, and resource planning and management, and use of associated tools and support where available)\n\n·Able to lead and work within teams and networks across functional and geographical boundaries; leads by example and promotes collaboration, effective communication and leadership in others\n\n·Able to set and manage priorities, performance targets and project initiatives in a global environment\n\n·Operational expertise in risk management and contingency planning\n\n·Applies industry best practices to the design and execution of clinical studies to improve time and cost efficiency\n\n·Demonstrates conceptual, analytical and strategic thinking\n\n·Effective at problem solving and conflict resolution\n\n·Ability to manage change and uncertainty\n\n·Ability to delegate tasks\n\nEducation Requirements :\n\nBachelor’s degree: life sciences or related discipline\n\nThe role will require a good understanding of complex clinical development and regulatory processes.Why Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.  \nImportant notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.It has come to our attention that the names of GlaxoSmithKline or GSK or our group companies are being used in connection with bogus job advertisements or through unsolicited emails asking candidates to make some payments for recruitment opportunities and interview. Please be advised that such advertisements and emails are not connected with the GlaxoSmithKline group in any way.GlaxoSmithKline does not charge any fee whatsoever for recruitment process. Please do not make payments to any individuals / entities in connection with recruitment with any GlaxoSmithKline (or GSK) group company at any worldwide location. Even if they claim that the money is refundable.If you come across unsolicited email from email addresses not ending in gsk.com or job advertisements which state that you should contact an email address that does not end in “gsk.com”, you should disregard the same and inform us by emailing askus@gsk.com, so that we can confirm to you if the job is genuine.         Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}