{"Job ID": "69865861", "Description": "51,000 people. 49 countries. Over 120 office locations.We’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.Whatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.comHSE Assurance Lead (National)KEY Accountabilities Of Position:1.Lead, plan and develop the local Safety Management System through bridging processes and procedure development and review.2.Assist with and ensure compliance with local legislative and contractual requirements and the bp Health and Safety Management System requirements.3.Actively stay up to date with the latest industry standards through ongoing research (IOGP, OPAL).4.Produce HSE management system explanatory documentation to support stakeholder understanding.5.Produce self-verification reports through actively auditing and reviewing the local Project HSE Management Systems, Standards, Plans and Procedures.6.Actively support the HSE Manager in the development of an annual project HSE Improvement Vision, supporting media & documentation, and produce a HSE Vision improvement plan.7.Effectively review contractor and subcontractor documentation and be produce specialist comments on areas for improvement.8.Monitor the effectiveness of the control of work system and apply continuous improvement to it.9.Actively monitor site work location and raise findings based on observations.10.Effectively communicate with and provide coaching to contractor personnel to engage them in HSE improvement initiatives.11.Provide active oversight towards the workforce compliance with life-saving rules.12.Conduct incident investigations and apply root cause analysis techniques to maximise learning.13.Produce engaging workforce HSE communication media.14.Actively collaborate with other members of the HSE team to drive improved HSE performance.15.Escalate known HSE non-compliance issues to the HSE Manager and support with recommendations.ESSENTIAL SKILLS / COMPETENCIES REQUIRED:Job Specific:·Thorough understanding of current OHS legislation and a proven ability to pragmatically apply this knowledge in an engineering/project management environment. Remain fully aware of current, and fully support: Applicable Legislation, Statutory Authority requirements, Relevant Training and Competency requirements, Leading industry practices and significant corporate updates.·Develop high quality HSE management plans, facilitate HSE Risk Assessments, undertake Root Cause Analysis, lead HSE audits, undertake HSE observations.·Highly competent in MS Office suiteExperience:Required:·High level working understanding of relevant legislation, codes, etc. and including:oOman HSE LegislationoOPAL book of working standardsoIOGP life-saving rulesoHIS Markit associated ISO standards (ISO 45001: safety management system, safe use of machinery, personal protective equipment standards etc).oSources of health and safety approved codes of practice, guidance documents etc.oExperience of pipeline construction methodologiesoExperience of civil construction methodologiesoExperience of safe working in a live gas facility.Guide:·8 Years HSE in construction·5 years in a HSE assurance roleQualifications, Accreditation, Training:Required:·University Degree, or equivalent, in related field or applicable discipline, or relevant experience.·NEBOSH certificate or recognised equivalent·Lead auditor training certified·Root cause analysis training·Construction hazard awareness trainingHSE Capability:·Remain abreast of relevant legislation and legislative updates through research.·Foster effective and coordinated Project HSE Teams through affective mentoring, direction and support.·Develop and provide improvements to HSE system tools and templates.·Comprehensively review HSE contracts and complete gap analysis.·Relieve and provide support to project HSE professionals as required (< three (3) months)·Develop HSE documentation (HSE Plan, Bridging Document) to client and industry standards.·Conduct planning, development, execution, audit and review of Project HSE Plans and Procedures·Review Project HSE Risk Management Processes·Drive sound 'best practice' HSE principles and values·Evaluate and drive sound Behavioural safety practices.·Identify unsafe conditions and unsafe acts and provide pragmatic prevention recommendations.·Enable effective and valued Consultation processes.·Advising and assisting Bid, Proposal and Tender Preparation,·Identify, evaluate and recommend recognition and rewards based on verifiable positive factors.General Accountabilities:·Proficient in English and Arabic speaking and writing.·Preferred fluency in Hindi and Urdu.·MS Windows XP and later·High level Google Search Skills - Legislative Web Sites, Statutory Authority Sites, etc.·MS Office Suite:oWord (High Level)oExcel (Moderate Level)oPowerPoint (Moderate Level)oFlowcharting Programs (Preferred)oAbility to think 'outside the square'oAbility to listen to and consider the points of view of othersoStrong Customer Focus,Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Muscat, Oman", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}