{
    "Job ID": "69867313",
    "Description": "About Jumeirah & the Hotel:At Jumeirah, we are committed to encouraging and developing our colleagues in world class environments. We value diversity and provide equal opportunities, employing over 14,000 colleagues from over 140 different countries including locations in Asia Pacific, CIS, Central Asia, Western and Eastern Europe, South America, Africa and the Middle East.We want you to do well from the beginning, so we’ll give you every chance to impress during the recruitment process. We promise our colleagues a warm welcome and will help you feel part of our Jumeirah family from day one. You can rely on us to support you as you settle into your journey with us and make Jumeirah ‘Your Place to Shine’.Jumeirah Creekside Hotel is a contemporary lifestyle hotel located 2km from Dubai International Airport in the heart of old Dubai. Set in landscaped grounds overlooking Dubai Creek, the hotel offers 292 rooms and suites, 21 meeting rooms, four restaurants, an award-winning spa and access to sports and leisure complex, The Aviation Club. Designed from the outset to connect the hotel to the region’s vibrant arts and cultural heritage, Jumeirah Creekside Hotel houses one of Dubai’s largest art collections – a specially commissioned collection of 482 pieces by 52 artists with roots from the Middle East. Rooted in the cultural and cosmopolitan essence of Dubai, the property combines comfort and unrivalled connectivity with true Arabian hospitality for the ultimate business and leisure experience.  About the Job:Responsible for co-ordinating the daily operations of the engineering department.\nTo ensure that the property and assets are maintained in the highest order through the implementation of the Jumeirah Engineering Management System” and the appointment of suitable competent personnel\nCandidate should Electrical certified and must have all round knowledge of handling engineering issues like ac, plumbing, carpentry, guest room complaintsYour main duties will include:Supervision of technical personnel on shift.\nAllocation of work orders, PPM’s to relevant personnel.\nMonitor general quality of work.\nTo select correct materials from engineering stores.\nTo organise work in a skilled and professional manner.\nTo advise senior colleagues promptly of any problems or failures.\nTo ensure safe working conditions for yourself and your colleagues and report to senior colleagues of any unsafe working conditions.\nTo ensure that work areas are left in a safe and tidy condition.\nRead and understand basic drawings\nTo use mechanical/electrical test equipment and instruments.\nWork on own initiative without full detailed supervision or direction.\nRequest support and direction as needed.\nBe familiar with and comply with all relevant Engineering Department policies, processes and procedures.\nAny other duties as may reasonably be requested by the management team including assistance for large events or hotel functions.About you:• 1-year certificate of competency in electrical or mechanical engineeringMin 3 years senior technician experience preferably in a 5-star hotel.\n• 5 years experience in hotel field.• Good command of English Language – spoken and written, Computer literate – MS OfficeAbility to work and lead the technical personnel independently.• Capability to organize and execute preventive maintenance schedules.\n• Ability to work on shift duty.\n• Positive attitude.       About Benefits:We offer an attractive tax-free salary, paid in Dirhams (AED), the local currency of the UAE. In addition, we offer reduced hotel rates across our properties globally, excellent care package, flights home, accommodation allowance, health insurance, up to 50% discount off Jumeirah F&B Outlets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}