{
    "Job ID": "69866757",
    "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Location :Bangalore , Hyderabad, Mohali\n\nOperational duties for our cloud based products - deployments, on-call, incident management.\nDesign and deploy various customer facing Linux and BSD based systems.\nManagement of container-based architecture (AWS ECS and Kubernetes).\nCreate and deploy scalable monitoring systems.\nArchitect and implement various cloud management automations. \nContribute to OS and software packaging and distribution. \nWrite and maintain Ops documentation.\nResolve escalations and help prevent reiteration of incidents with process, monitoring and reliability improvements.\nContribute and implement DevOps best practices within the group.\nWork as a member of a cross-functional project team contributing to the technology-based solutions and consult on concept feasibility.Minimum of 3 years of relevant experience in designing, analyzing, and troubleshooting large-scale distributed systems\nHands-on experience with infrastructure as code\nGood exp in Terraform, ansible, familiar with automation in Python,  well understand network basics, Kubernetes, and AWS cloud.\nShould have worked in a production environment\nKnowledge of Virtualization, Cloud Architecture, and Services, Automated Deployments\nUnderstanding of web security and protocols HTTP, SSL/TLS, DNS, SQL, and networking fundamentals\nRich DevOps skills across CI/CD, SCM, Builds and Releases, Continuous Integration Tools and frameworks#LI-MS6Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}