{
    "Job ID": "69867553",
    "Description": "The Future Is What We Make It.When you join Honeywell, you become a member of our Global team of thinkers, innovators, dreamers and doers who make the things that make the future.By changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars.Make the Best You.Working at Honeywell is not just about developing cool things. All our employees enjoy access to dynamic career opportunities across different fields and industries.Join us and Make an Impact.We have an opportunity for Field Service Supervisor to join Honeywell Building Technologies Team in Riyadh, KSA to to be the lead of a team of service technicians, typically for Facilities Management Contracts or large service sites and to ensure that Honeywell meets contractual requirements and exceeds customer expectations, while also being an individual contributor (100% job chargeable). Duties include developing skills, information and management discipline necessary to deliver services in a timely manner at planned gross margins, leveraging HBS tools, processes and best practices. Role responsibilities include the Field Service Supervisor performing work on contracts and service projects to meet team’s financial and productivity metrics.Field Service Supervisor ResponsibilitiesTake ownership and be responsible to deliver and achieve both service & financial metrics.\nReach objectives in terms of contract performance, billable hours, productivity, and process compliance.\nEnsure the team’s delivery of agreed services on time, within scope, and within budget.\nLead team of direct reports in a common direction. Organizing and leading frequent meetings with the direct reports focusing on performance metrics, customer satisfaction and process compliance.\nMaintains customer’s satisfaction at acceptable levels and resolves customer satisfaction issues.\nReviews VOC feedback and takes appropriate proactive actions.\nEnhance customer satisfaction and comfort by identifying customer implicit requirements, individually and with his/her assigned team.\nEnsures the availability of tools, equipment, and materials required while maintaining and controlling inventory levels.\nActively supports the implementation and compliance of productivity enhancing processes related to service delivery, taking ownership to implant these in his or her own scope of responsibility.\nSet and implement standards (quality processes, service manuals, hour reporting) and ensure that the service team delivers to performance expectations.\nParticipate in estimate review process prior to jobs or contracts being achievable from a technical perspective. Participate in risk review (per Honeywell policy).\nEnsures service contracts, additional works and small service projects are resourced properly.\nManage the performance management process, reviews, and providing coaching, training, career planning, development, salary administration and reward and recognition for service team personnel.\nBuild effect teams committed to organizational goals, foster collaboration among team members and between teams.\nActively discourage silo mentalities and attitudes.\nBe the change management leader for team and aggressively implement agreed to initiatives.\nEnsure safe and healthy work environment through effective communication, training, equipment/vehicle maintenance and facilities improvement\nWhere applicable, ensure fire and security industry codes and standards are upheld.\nEnsure local statutory requirements are upheld.\nFollow the Honeywell SOPs and ensure the team adheres to these emphasizing every service technician utilizes the service hand held tool and all work orders and dispatching is delivered through the Service Management System and GCCC.\nAssist / participate in company Service growth initiatives / projects.\nSeek business opportunities through promoting Honeywell solutions and third-party systems\nEmpower the new software transformation solutions/offerings “ connected services portfolio, cyber security,…etc “.QualificationsBachelor’s degree in Electrical, Electronic Engineering with 8-10 years’ experience\n5 plus years of related support services experience in Honeywell or a related industry. Experienced and having profile of Security Systems (Access controls, CCTV, DVR/DVM solutions), FAS, Lighting, Connected Service, Cloud Base solutions) additionally having fair knowledge of Building Management system.\n5 pulse years supervisory knowledge with demonstrated ability to lead a team.\nThorough knowledge of service field operations and financial processes.\nExpertise in communicating, negotiation and implementing process.\nFinancial Skills - The ability to understand financial data at contract level and identify appropriate actions indicated by variances to ensure key metrics are achieved.\nOperational Analysis – The ability to obtain relevant information on operational issues from multiple sources, think broadly about those issues and recognize trends/possible cause-effect relationships.\nDecision Making - The ability to make considered and effective decisions and take clear action to address issues.\nExecution - The ability to mobilize resources and develop and implement action plans / control mechanisms to achieve desired results and deliver on commitments.\nRisk Management - The ability to understand the implications and assess the appropriate degree of acceptable risk and take actions to minimize risk.\nCustomer Relationship Management - The ability to build and maintain effective relationships with customers based on trust and mutual understanding.\nChange Leader - The ability to embrace change and guide the team through periods of change in a positive and proactive way.\nDelegation - The ability to achieve results through the transfer of decision-making authority and task accountability to appropriate direct reports setting clear time scales and deliverables and providing ongoing appropriate support and feedback.\nCoaching and Developing Others - The ability to enhance the performance of individuals and teams through setting challenging performance standards, providing constructive feedback on performance and collaboratively discussing improvement strategies.\nInfluencing/Persuasion - The ability to gain other people’s buy in to a course of action by communicating ideas with conviction, selling the benefits of the proposal and using compelling logic.\nCommunication - The ability to engage employees by providing relevant information in a timely manner using clear and compelling messages and by listening to and valuing input from employees.\nDrive for Results - The ability to demonstrate energy and determination to achieve results and improvement by overcoming obstacles, remaining effective despite setbacks and challenging current thinkingWe ValueSignificant experience in Maintenance/ project Management related field.\nExcellent communication skills\nAbility to influence at varying levels across the organization.\nAbility to handle multiple priorities.We offerThe opportunity to work on the world’s most exciting projects, transforming the cities we live in, the buildings where we work, and the vehicles that move us.\nGroup medical insurance plan life.\nPaid annual leave and time off work.\nA culture that fosters inclusion, diversity, and innovation.\nMarket specific training and on-going personal development.If this is your dream role, then we'd love to hear from you.We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.JOB ID: HRD207989\nCategory: Customer Experience\nLocation: 3rd Floor, Olaya Tower A,Riyadh,AL RIYADH,Saudi Arabia\nExemptJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}