{"Job ID": "69869982", "Description": "#LIJob TitleResearch Scientist – AI for Speech and Natural Language ProcessingJob DescriptionPhilips is a global leader in health technology, committed to improving billions of lives worldwide and striving to make the world healthier and more sustainable through innovation. Driven by the vision of a better tomorrow.But it’s not just what we do, it’s who we are. We are 80,000, wonderfully unique individuals, with two things in common. An unwavering sense of purpose and a relentless determination to deliver on our customers’ needs. It’s what inspires us to create meaningful solutions – the kind that make a real difference – when it matters most.The world and our customers’ needs are changing faster than ever before and while we are proud of what we do already, we know we can do more. That’s why we need you, to help us tackle increasingly complex challenges posed by ever evolving health and well-being needs.You are responsible forExploring and developing Artificial Intelligence (AI) algorithms for healthcare applications \n\nInterpreting and analyzing data using exploratory mathematical and statistical methods to identify trends, patterns, and insights on data (images, timeseries, etc)\n\nBuilding Speech Processing / Natural Language Processing applications using features developed by transformation of natural language data\n\nCollaborating with clinical partners to understand and support clinical studies, and work on raw data processing\n\nCollaborating with research engineers at other R&D locations to translate algorithms into commercially viable products and services. \n\nBuilding models and putting your work in a production environment \n\nCommunicating and presenting various proposals, concepts, and results to collaborators and key stakeholders/customers\n\nInnovating and protecting intellectual property on novel project ideas through invention disclosures\n\nPublishing research work in top conference and/or journalYou are a part ofIntellectual Property & Standards, a Philips business that optimizes IP assets and provides counselling to support innovation and new business opportunities – for Philips and others.You will join the “Digital Standardization & Licensing Research” department with presence in The Netherlands, India, China and the US. We provide technology options for innovations in the area of health and well-being, as well as new developments for consumer applications. Positioned at the front-end of the innovation process, we are actively contributing to the creation of healthcare, consumer and industry standards, and we further mature ideas and technologies in close collaboration with internal and external partners.With this vacancy, we intend to strengthen our team in Bangalore, India.For more insights you can visit: www.ip.philips.comTo succeed in this role, you’ll need a customer-first attitude and the followingExperience in developing/using deep learning architectures like CNNs, Autoencoders, Transformer, etc as applied to healthcare applications\n\nExcellent understanding of classical machine learning techniques and algorithms like kNN, SVM, Random Forest, XGBoost, etc. \n\nExperience in developing speech and NLP algorithms, preferably in healthcare domain\n\nUnderstanding exploratory data processing techniques such as cleaning and verifying the integrity of data used for analysis\n\nGood applied statistics skills, such as distributions, statistical testing, regression, etc. \n\nExperience in building and optimizing reactive and predictive models with Machine Learning techniques  \n\nExperience with deep learning frameworks, like Tensorflow/Keras and/or PyTorch and other Python ML libraries\n\nBackground in healthcare with some understanding of clinical workflows, human physiology and medical data\n\nStrong analytical, problem solving and communication skills\n\nPreferably publications in top international conferences/journalsEducational / Professional QualificationPhD, or MSc degree with at least 4 years of experience, in machine learning R&D, Computer Science, Engineering (Computer, Electrical, Electronics/Communications, Biomedical, etc.), Mathematics/Statistics In return, we offer you\nA chance to serve a bigger purpose. At Philips, our mission to improve the lives of 2 billion people per year by 2025, and everyday we move closer to achieving our goal by creating cutting-edge solutions that lead to confident diagnosis, improved care, and increased quality of life for patients drive us. We enable our employees to create a legacy in life through their work and support their development through people-centric learning, total rewards and personalized development planning programs.  Our business provides unique opportunities to develop cutting edge enterprise software solutions and deliver meaningful solutions in the healthcare space and this new position is a unique opportunity to shape the next generation solutions we are developing.How we work at Philips\nOur newly-adopted hybrid work concept fuses flexibility with collaboration to deliver great outcomes for our people and our customers. We are embracing an approach wherein we spend more time together than apart – which for full-time employees translates to an average of at least 3 days working from the office and up to 2 days from home – for our hybrid roles.\nHybrid work flexibility means people can meet the changing demands of work and home in the most balanced, productive, and healthy way.Our hybrid working model is defined in 3 ways:\nWe believe in the importance of impactful collaboration: There's a certain energy when everyone’s in the same room that can heighten idea generation and creative friction needed for problem-solving.\nWe embrace flexibility: Choosing where, when and how to work can vary according to task and team schedules. Flexibility isn’t office or online, it means choosing the space that works best for you, your teams and our customers on a case-by-case basis.\nWe want to be at our best: The way we work and our workspaces are designed to support our well-being, offer career advancement opportunities, and enable us to be at our best.Why should you join Philips?Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on innovative, customer-first health technology solutions. Help us improve the health and well-being of billions of people, every year. Ultimately creating a career that no one could have planned for. Even you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}