{
    "Job ID": "69867251",
    "Description": "The Logistics Specialist is responsible for planning and executing logistics operations and managing the supply chain within the organization. Their role aims to ensure a smooth and efficient flow of materials and products from sources to customers or intended destinations. The work involves coordinating and improving logistics processes while achieving a balance between cost and efficiency.Job Duties:Develop and implement logistics strategies that support the organization's business goals.\nPlan and execute logistics strategies that meet the organization's goals and objectives.\nManage the movements of all procured goods and services required by the organization.\nConduct market research to identify new shipping routes and carriers.\nDevelop and implement logistics procedures and policies\nSupport and optimize the supply chain operations to reduce costs and improve efficiency.\nDevelop and manage relationships with suppliers and transportation providers.\nManage inventory levels and ensure that goods are delivered on time and in good condition.\nStay up-to-date with logistics regulations and ensure their practical implementation within our organization.\nResponsible to complete all procurement team requests on time and make sure that all the payments are supported with needed documents.\nEnsure to have a freight comprehension to give door to door freight fees estimation.\nCreate a database of imported items for storage MT standards planning.\nCoordinate the warehousing and storage of inventory.\nCompile and analyze logistics data to identify trends and opportunities for improvement.\nPrepare and process import/export documentation.\nCoordinate and manage forwarder billings.\nReview and record required documentations.\nCoordinate with customs brokers to ensure timely and accurate clearance of shipments.\nManage the risk of international shipments.\nStay up-to-date on international trade regulations.\nProvide support to other departments as needed.\nPreform other duties if required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Baghdad, Iraq",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}