{
    "Job ID": "69866793",
    "Description": "Data Impact by NielsenIQ is unleashing the power of data in the e-commerce universe.Are you excited by the surge of e-commerce data and the opportunity to shape strategies that lead to meaningful impact ? At Data Impact by NielsenIQ, we empower our clients to do just that ! With a collection of over 60 billion data pieces daily, we transform raw data into innovative monitoring tools designed for industry professionals.Data Impact by NielsenIQ is a rapidly growing startup at the forefront of e-retail and omnichannel analytics. We have a global presence in more than 40 countries, and our team - a vibrant mix of 40+ nationalities - is looking for new colleagues to contribute to our mission.Cybersecurity Specialist (Red Team, Python) - Pune,India\n\nWith us, you can look forward to :Working in a dynamic start-up atmosphere with a team that is both young and experienced.\nDeveloping your career in a diverse and international environment.\nEnjoying a friendly, relaxed work atmosphere that fosters autonomy, trust, and challenges.The role :As a vital part of our Security Team, you will work closely with our Scraping Team to address anti-bot countermeasures implemented by retailers or third parties. Your tasks will span across :Overall years of experience : 5 to 12 years \n\nWe are seeking a highly analytical and structured individual, who is ready to bring at least 5 years will be coherent will the overall years of experience)Key competencies include :Advanced proficiency in C++ and Python.\nInstrumenting Android applications.\nFamiliarity with Web Application Firewalls (WAF) and client-side web security.\nDeep understanding of networking, particularly STACK, HTTP/HTTPS/TLS.\nAbility to think outside the box and approach problems creatively.\nSignificant experience in hacking/security.\nCompetence in Javascript (5/10 is enough to understand client-side security)\nCode source de-obfuscation skills.\nGeneral knowledge about browsers and web drivers.\nProficiency in Linux.Preferred tools of the trade :Burpsuite for intercepting mobile or web traffic (or any HTTP proxy such as mitmproxy or Wireshark)\nFrida for bypassing mobile network security or spoofing location\nPostman for API communicationCapture the Flag (CTF) Experience:Having participated in CTF security events is a plus for us. If you've ever joined this thrilling race against the clock, your skills in identifying vulnerabilities, devising solutions, and working as part of a team would make you an invaluable asset to our team.Data Impact by NielsenIQ is not just a place to work – it's a place where your work will be making a substantial difference. We offer real opportunities to grow and challenges to overcome, which makes every day an achievement. Join us, bring your expertise, and let's revolutionize the e-commerce industry together !Enjoy a flexible and rewarding work environment with peer-to-peer recognition platforms. \nRecharge and revitalize with help of wellness plans made for you and your family. \nPlan your future with financial wellness tools. \nStay relevant and upskill yourself with career development opportunities. About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}