{"Job ID": "69869680", "Description": "Hello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands including Sensodyne, Panadol, Advil, Voltaren, Theraflu, Otrivin, and Centrum through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.With category leading brands such as Sensodyne, Voltaren and Centrum, built on trusted science and human understanding, and combined with our passion, knowledge and expertise, we’re uniquely placed to do this and to grow a strong, successful business.This is an exciting time to join us and help shape the future. It’s an opportunity to be part of something special.Role OverviewAs a Senior Procurement Manager, for Sustainability Innovation and Search, you will support the identification of innovative initiatives, development, and implementation of these high value cross-functional projects to support the delivery of Haleon’s sustainability ambitions.Key ResponsibilitiesProvide expertise and recommendations on alternative sustainable products and services, with a particular focus on raw materials and other services such as logistics, to support our carbon net zero and wider sustainability goals.\nWork with central sustainability and the functions to identify innovation needs for sustainability and create briefs to go out to suppliers and the market.\nBenchmarking against peers on end to end sustainability initiatives.\nPartner closely with global sustainability team and local business units to ground innovation initiatives and external trends.\nEstablish a close relationship with, R&D, Technical, Commerical and Supply Chain to prioritise projects, align resources and deliver against our sustainability ambition.\nWork closely with R&D to support the usage and future builds of the ‘sustainability impact assessment tool' (SIAT) eco-design' tool for helping to create more sustainable products.\nSupport the communication of new ideas and proposals to all areas and levels of the business.\nSupport the design of the end to end process and ways of working to ensure innovation and sustainability is embedded into our sourcing processes and supplier management.\nProject manage sustainability projects until transition to BU Category Teams for final implementation.\nHelp to shape the procurement category strategy of key high impacting sustainability materials. Supporting procurement category managers to identify alternative materials, suppliers and embed as part of longer term purchasing strategy.\nOnce embedded into procurement category strategies, use this to help to share the commerical strategy to form winning ideas through the procurement lens and applying a base understanding of other business priorities such as cost, security of supply and supplier capabilities.\nManage & develop effective standard project tracking and reporting process suitable for reporting at various management levels (Time / KPIs / Benefit / Quality).\nSupport the wider sustainability team on supplier performance management, linking innovation and sustainabulity into sourcing criteria as required.Qualifications & Skills: University degree (or equivalent) in a relative field (Science or Technical).\n10-12 years of total procurement experience.\nAt-least 4 years in procurement experience managing categories like, Packaging, Ingredients/Raw Materials & Logistics.\nWork experience in sustainability related topics.\nManaging global projects would be an added advantage.\nDemonstrated experience in navigating through organizational complexity, collaborating simultaneously with multiple teams, influencing without authority, handling escalations and associated business impact.\nGood understanding of market drivers effecting category; strong commitment to keeping abreast of trends.\nExcellent written and verbal communication skills – fluent English.\nFMCG experience preferable.Diversity, Equity and InclusionAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.We’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.Care to join us. Find out what life at Haleon is really like www.haleon.com/careers/\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}