{
    "Job ID": "69865997",
    "Description": "As part of the AWM Core Analytics team, you will be responsible for both delivering analytics insights to business problems and driving the adoption of analytics culture and best practice in AWM Ops.In this role you will have the opportunity to be a key part of defining the ecosystem and capability set and shaping the journey for this transformation team more broadly. Given the ambitious nature of this change program, this role will provide you the access and visibility to senior firm leadership and broad exposure across the full spectrum of AWM globally.Job Responsibilities:Work on automating of new and existing processes using data transformation tools like Alteryx, SQL etc\nBuild, maintain and enhance Alteryx data transformation workflows. Deploy them to Alteryx Server\nCreate, manage and enhance analytics dashboards in Tableau / Qlik\nManage and deploy dashboards to the firm-wide server\nSupport ongoing development of Data Analytics framework by partnering with business to identify requirements, bring in new datasets, support new users and train new team members in using the toolsetRequired Qualifications, skills and capabilities:0-2 years of experience in program management leading strategic or transformational change, preferably with experience in wealth management, asset management, digital banking, or a closely related business \nExperience in data transformation tools, such as Alteryx and data visualization tools, e.g., Tableau, QlikView/QlikSense and enhanced data mining skills using SQL, SAS, Python or other equivalent tools\nExtensive experience in project delivery across multiple streams with varying timelines, priorities and complexities\nDemonstrated ability to manage tight delivery timelines, and ensure our organization is on track to execute and deliver strategic change that meets our goals\nProven ability to execute via successful internal partnerships with other organizations – with the ability to influence people at all levels across a broad variety of job functions\nStructured thinker, effective communicator with excellent written communication skills. Ability to crisply articulate complex technical concepts to senior audiences with poise and confidence\nStrong understanding of different technological development methodologies (e.g., Agile, Waterfall) and design techniques with ability to successfully lead regardless of approach\nUnderstand and mitigate risks, bottlenecks, and inefficiencies in product development lifecycleJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}