{"Job ID": "69867142", "Description": "Senior Specialist- Internal & External CommunicationLocus is a technology platform that uses machine learning and proprietary algorithms to automate complex supply chain decisions. We are building The World's Best Dispatch Management Platform in Final Mile. Our smart supply chain solutions provide end-to-end visibility and enable enterprises to enhance their operational efficiency by reining costs, streamlining the customer experience, and reducing environmental impact.Headquartered at Bangalore, India, we have offices present across, North America, South East Asia, EU. We are a 150+ strong team and growing rapidly. With a strong base of investors, GIC, Singapore’s sovereign wealth fund, Qualcomm Ventures LLC, Tiger Global, Falcon Edge, Blume Ventures, pi Ventures, and others., Locus has raised around $80 million across multiple rounds. Locus’ scalable solutions include route optimization, real-time tracking and analytics, sales beat optimization, territory planning, vehicle allocation, and network design. Our future-ready platform has resulted in $150 million+ savings in logistics costs, 70 million+ kilometer reductions in distance traveled, and 17 million+ kilograms reduction in GHG emissions across clients like Nestle, Mondelez, Unilever, BigBasket, Bluedart, Bukalapak, The Tata Group, and many others. The company powers deliveries across North America, Europe, Southeast Asia, Middle East, ANZ, and the Indian Subcontinent. Backstory:Locus’ journey is quite an interesting story. What began as a women’s safety application is now a global last-mile logistics optimization platform. Back in 2015, Nishith Rastogi and Geet Garg developed RideShare, a geo-tracking application to improve women’s safety in cabs by tracking deviations from predefined routes. They soon noticed it was adopted by many new-age food delivery companies to manage their delivery personnel. After some research, they identified a significant opportunity to automate and improve decision-making in last-mile logistics. And in July 2015, Locus was born in a 2 BHK studio apartment in Bangalore. Today Locus is a global organization bringing real-world growth through last-mile excellence for enterprises across industries and use cases. Some of our milestones have been:2016: Raised Series A round funding from Exfinity Ventures and GrowX Ventures and launched our first two offerings: Route Planning and Control Tower (formerly Dispatch IQ and TrackIQ). \n\n2018: Achieved a landmark of 10 million successful customer orders.\n\n2020: Raised series B funding led by Falcon Edge and Tiger Global. Opened our first offices in North America and South East Asia.\n\n2021: Raised Series C funding of $50 million led by GIC and Qualcomm Ventures and got recognized twice in a row as the Representative Vendor in various Gartner® Market Guides.\n\n2022: Unveiled our real-world ready dispatch management platform, moving from product-based to platform-based offerings. Expanded our footprint to Mexico.Job description:As the Senior Specialist - Marketing and Communications, you will play a pivotal role in amplifying Locus' brand identity, scaling our social media presence, and leading our PR, external, and internal communications efforts. You will be entrusted with growing our audience, preserving the brand's integrity, and disseminating content effectively across various channels.Key Responsibilities:Brand Custodianship: Uphold, enhance, and consistently represent the Locus brand across all digital & media channels ensuring a cohesive brand experience.\n\nSocial Media Management & Growth: Develop, execute, and refine strategies to scale our social media channels. Regularly track and analyze growth metrics, adjusting strategies as needed.\n\nContent Distribution: Work closely with the content, performance marketing, sales and product teams team to distribute creations effectively, ensuring they resonate with our target audience and drive meaningful engagements.\n\nEngagement Strategies: Conceptualize and execute innovative campaigns, contests, and initiatives that foster deeper audience engagement and loyalty by staying updated with the latest in industry, social media and media trends. Position Locus as a thought leader by sharing insights, innovations, and trends in logistics technology on social media and in media.\n\nPR & Communications: Develop and execute strategic PR campaigns to enhance visibility and influence. Manage and collaborate with our PR agencies to build strong media and stakeholder relationships. Craft & edit compelling content, including press releases, thought leadership pieces, and internal-facing announcements.\n\nAnalytics and Reporting: Monitor, analyze, and report on performance metrics for social media and PR, drawing insights and iterating for continuous improvement.Qualifications:Minimum of 5-7 years experience in brand, PR and social media management, preferably in tech, logistics or B2B sector. Agency experience is a plus.\n\nDemonstrable track record of growing and scaling social media channels and successful PR campaigns.\n\nProficient in social media & PR analytics tools and platforms.\n\nStrong understanding of the digital marketing landscape and branding principles.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}