{
    "Job ID": "69866217",
    "Description": "About Builder.ai\nWe’re on a mission to make app building so easy everyone can do it – regardless of their background, tech knowledge or budget. We’ve already helped thousands of entrepreneurs, small businesses and even global brands, like the BBC, Makro and Pepsi achieve their software goals and we’ve only just started.Builder.ai was voted as one of 2023’s ‘Most Innovative Companies in AI’ by Fast Company, and won Europas 2022 ‘Scaleup of the Year’. Our team has grown to over 800 people across the world and our recent announcement of $250m Series D funding (and partnership with Microsoft) means there’s never been a more exciting time to become a Builder.Life at Builder.ai\nAt Builder.ai we encourage you to experiment! Each role at Builder has unlimited opportunities to learn, progress and challenge the status quo. We want you to help us become even better at supporting our customers and take AI app building to new heights.\nOur global team is diverse, collaborative and exceptionally talented. We hire people for their differences but all unite with our shared belief in Builder’s HEARTT values: (Heart, Entrepreneurship, Accountability, Respect, Trust and Transparency) and a let’s-get-stuff-done attitude.\nIn return for your skills and commitment, we offer range of great perks, from hybrid working and a variable annual bonus, to employee stock options, generous paid leave, and trips abroad #WhatWillYouBuild\nWhat are we looking for ?\nWe are looking for a seasoned professional Corporate Travel Manager to join and lead our Travel Desk team. Our corporate travel manager doesn’t just handle travel arrangements; they should be strategic thinkers and be able to create travel policies according to the company’s needs.The responsibilities of the Corporate Travel Manager include optimising our travel operations, managing all related travel expense responsibilities (preparing budget reports and staying with a budget), taking ownership of visa management, making and providing guidance on travel arrangements, keeping our Policies and Procedures up to date, and managing travel authorization processes.A successful Corporate Travel Manager should have a strong working knowledge of travel management processes, visa processing guidelines across various geographies and has in depth knowledge of utilising points systems to gain the best fares and quality of travel. Ultimately, a top-notch Corporate Travel Manager is skilled at maintaining positive relationships with embassies, airlines, and hotels and at providing a smooth travel experience for our travellers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}