{
    "Job ID": "69866193",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Assistant Manager- Finance & AccountsProperty and Asset managementWhat this Job Involves?You will be the face of JLL at the client’s site and will be responsible for interacting and addressing the needs of guests / tenants by maintaining strong public relations, taking feedback / suggestions. You will also be responsible for:Understand business and ensures there is integration between business and technology.\nWork closely with the operations and technical teams and is a major contributor to the requirements specification deliverable\nProvides analytic support by coordinating data extraction from various databases and data interpretation.\nCreate report templates and data gathering tools to meet desired future standard\nData custodian & controller\nTrend analysis and aligning with account management team\nTechnology Tools incl Helpdesk – Trending and Analytics\nDeliver output files for reports and dashboards\nSign off on data roadworthiness\nFacilitate Reporting on compliances \nSeek and collate data for analytics\nGenerate MIS and reports as management requirement\nPredictive reporting\nWork with finance on budget targets\nCross verification of data as per agreed TOR time to time\nGenerate Daily reports, Weekly reports, MMR, QBR, ABR etc. and own the reports.\nCustodian of all Site team statutory compliances , their documentation and records\nWould be responsible for all Audits related to compliance and will upload the OGS Compliance tool with all requisite documents\nBuilding statutory compliances are to be tracked for expiration and renewals\nAll documentation recording to be ensured on shared folders related to complianceSite details:You will be working at commercial site which is located at Gurgaon.Site dynamics:Work Schedule: Site team:  e.g.: Property Manager +2 Other details if anySound like you? Here is what we’re looking for:Being Analytical and MeticulousYour role will involve coordination with various teams. You will be paying attention to detail and have excellent problem-solving skills. You will be using logic to trouble shoot problems; and assign and monitor maintenance projects. You should have a good knowledge of the working procedures.QualificationsYou will have a Degree / Diploma in Electrical/Mechanical OR any equivalent, with min 3-5 years of work experience in Real Estate/ Hotel or Construction Industry. For residential sites candidates with residential experience will be preferred.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}