{
    "Job ID": "69866449",
    "Description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.\nYou’ll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you’ll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nYour Role and Responsibilities\nAs a Consultant you will serve as a client-facing practitioner who sells, leads and implements expert services utilizing the breadth of IBM’s offerings and technologies. A successful Consultant is regarded by clients as a trusted business advisor who collaborates to provide innovative solutions used to solve the most challenging business problems.\nYou will work developing solutions that excel at user experience, style, performance, reliability, and scalability to reduce costs and improve profit and shareholder value.Your primary responsibilities include:Shape solutions within Oracle Cloud based on key client requirements following Agile methodology.\nConfigure and test applications to check that it meets business requirements.\nWork under a continued improvement culture, challenging ideas and finding solutions to problems.\nDesign and development of process management in planning.\nYears of Experience must be between 4 to 8 Years.\nGood and Effective Communication skill to understand the requirement and articulate the solution.Required Technical and Professional ExpertiseMust have functional knowledge of planning modelling like Workforce, Capex and Financials\nConfiguration of EPBCS Financials, Workforce and Projects modules as per business requirements and design\nGood experience with Metadata builds and update members.\nMust have experience in solution Design of FCCS process flow.\nStrong knowledge on consolidation methods includes cost method, equity, and subsidiary.Preferred Technical and Professional ExpertiseExcellent written and verbal interpersonal skills for coordinating across teams.\nShould have at least 2 end to end implementation experience.\nAbility to write and update the rules of historical overrides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kolkata, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}