{
    "Job ID": "69865989",
    "Description": "You will work on multiple Credit Card Pricing strategic initiatives and support various key pricing processes ensuring accuracy and integrity of the Core Pricing system through conducting first line of defense process reviews via sample methodology and validations. Additionally, you will lead a team of analyst who does 6 Month Review, Change in Terms, and Behavioral Pricing, Control monitoring for critical functions such as Fees, interest, product trade, SCRA and provide oversight and peruse responsibility of reviewing, analyzing and dispositioning control monitoring report exceptions.The Pricing Execution Business Associate will deliver actions to triage, fix, and correct customer impact caused by a business process or operational break. This role will also support Analytics, Execution and Testing end to end for Customer Corrections & remediation's process efficiently managing multiple cases at a time ensuring deliverables are completed. You are expected to be, analytical, detail oriented, and an exceptional problem solver who takes pride in owning issues from the beginning to end delivering great Stakeholder/Customer experiences.You will be responsible for developing and maintaining test scenarios, test plan, test cases used for various projects like CIT, Remediation and Data pull for adhoc requests, within Pricing Execution team. Job responsibilitiesLead a team of 4 members that works on adhoc data validation and perform QC on pricing strategy execution projects\nPossess strong relationship skills and ability to communicate across all levels of the organization, building consensus across cross-functional teams collaborating to solve customer facing issues & remediation's and answer business stakeholders pricing related inquiries. \nExcellent project management & problem-solving skills and the desire to help continually improve operations & processes. \nPricing and/or data analytics experience a plus (Teradata, Oracle, SAS, etc.). \nAbility to resolve complex assignments with little supervision and ensure projects are completed according to established timelines.\nAbility to present complex information in an understandable and compelling manner ensuring & providing clear communication to process owners. \nKnowledge of mainframe systems such as TSYS.  Excellent verbal, written communication, presentation, and facilitation skills. Required qualifications, capabilities, and skills7+  years of work experience in managing critical execution projects with high quality \n2+ years of leading a team that performs Quality control on Pricing Change in terms, and supporting adhoc analytic requests using various tools like SAS/SQL \n4+ years of experience in pricing execution and implementing pricing strategies\nAttention to detail while working on all the deliverables. Ability to train and build the team for success in pricing execution\nAbility to work in a fast-paced, results-oriented, highly dynamic environment with a strong desire & aptitude to learn and adapt to new technologies. . Ability to effectively manage multiple priorities and deliverables with flexibility that does not compromise results. \nHigh level of proficiency in MS Office applications: Advanced in Excel. Basic in Word and PowerPoint\nBachelor’s or Master’s Degree requiredJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}