{"Job ID": "69865746", "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"As a banquet supervisor, your primary role is to ensure exceptional guest service and adherence to the high standards set by the hotel. Your specific duties include:Ensuring the quality of guest service: it is your responsibility to consistently provide excellent service to our guests. This includes promptly satisfying their needs, solving any problems, ensuring their overall satisfaction.\nCapital improvement expense management: you will be responsible for overseeing the budget allocated for capital improvements within the banquet department. This involves making informed decisions to strengthen the facilities and equipment of the Department.\nHelp guests with the banquet menu: you will play a crucial role in explaining the banquet menu to our guests. This includes providing detailed information about the dishes and accommodating any special dietary requirements or preferences they may have. In addition, she will give appropriate recommendations for drinks to complement their meal.\nPreparation of function areas: you will be responsible for the arrangement and preparation of rooms and function areas within the hotel for banquets and events. This entails making sure that the layout, decorations and equipment are all properly organized and in place.\nClearing and resetting tables: after each banquet or event, you will be responsible for clearing and resetting tables. This includes competently removing used dishes, cutlery and glassware, making sure that the tables are clean and ready for the next guests.\nMaintain hygiene standards: you will strictly adhere to the highest hygiene standards when handling and serving food. This includes following proper food safety protocols, maintaining cleanliness in service areas, and making sure all foods are prepared and served in a safe and healthy manner.\nBy fulfilling these responsibilities, you will contribute to the overall success of our banquet department and help create unforgettable experiences for our guests.Your team and working environment:\nIn 1-2 sentences, introduce the team, property or office environment in a way that reflects the culture\nNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}