{"Job ID": "69865536", "Description": "“A passion for perfection”Swissôtel Hotels & Resorts is a distinctive group of deluxe hotels where we put the emphasis on our people. We strive to provide a motivating and rewarding environment that attracts inspired and talented people who are willing to bring news ideas, use & develop their knowledge to reinvent their career path. Swissotel Makkah description:Swissotel Makkah is Swissotel’s first hotel to open in Saudi Arabia. The hotel offers 1487 elegant rooms and suites with modern design, complementing the values of today’s Arab culture. As part of the prestigious Abraj Al Bait complex, the deluxe Swissotel Makkah is a contemporary five-star hotel located in close proximity to the holy Masjid Al Haraam, overlooking the Ka’aba and the Grand Mosque.Swissotel Makkah is part of a new urban development, including two restaurants, one executive lounge, two meeting rooms and a business centre. It has private entrances that make it easier for pilgrims to reach Al Masjid Al Haram. Requirements:Responsibilities\nApproach all encounters with guests and employees in a friendly, service-oriented manner.\nMaintain regular attendance in compliance with Accor Standards, as required by scheduling which will vary according to the needs of the hotel.\nMaintain high standards of personal appearance and grooming, which include wearing the proper uniform and name tag while working.\nComply at all times with Accor standards and regulations to encourage safe and efficient hotel operations.\nHandle and store meats, fish, and poultry in a sanitary fashion\nRecognize quality standards in meats, fish, and poultry.\nUnderstand receiving and requisition of like items.\nBe able to maintain personal hand cutlery\nHave a strong knowledge of quality and grading standards as described by the meat buyers guide\nDemonstrate proficiency in the following cooking techniques: sauté, frying, poaching, pan frying, broiling, grilling, roasting, braising, and understand which cuts of meat are best suited for all these various techniques.\nCommunicate to purchasing and receiving any discrepancies in quality, weight, or specifications of items being received.\nOther duties as required.\nMaintain refrigerator and kitchen in clean, organized manner to facilitate the high volume production necessary to achieve company goals.\nMaintain an effective training program for all employees so that all their time can be productive.\nKeep production of food at an adequate level which does not result in excessive leftovers and waste.\nSupervise all phases of food production and service directly related to all catering functions.\nResponsible for all quantity and quality control of food production and appropriate staffing of entire Butcher shop.\nEnsure equipment and kitchen cleanliness.\nSupervise and schedule butchery staff\nAssure that all cooks have all food items prepared to proper specifications in a timely manner.\nMaintain refrigerator and kitchen in clean, organized manner to facilitate the high volume production necessary to achieve company goals.\nMaintain an effective training program for all employees so that all their time can be productive.\nAdhering all safety and sanitation policies when handling food.\nPerform other duties as requiredRequirements:Proficient in the English language (verbal & written), second language is an asset.\nMinimum of 3 years of progressive management experience in a luxury hotel butchery \nKnowledge of Excel, word, and Outlook.\nCulinary Degree/Diploma \nMust be completed HACCP Level-3 Food Safety Management procedures & guidelines.\nMust be flexible in terms of working hours.\nMust be physically fit in order to lift items up to 35 Kilograms.\nMust have great leadership and communication skills.\nMust effective at listening to, understanding, and clarifying the concerns and issues raised by co-workers and guests.\nMust maintain composure and objectivity under pressure.\nMust be able to handle a multitude of tasks in an intense, ever-changing environment.\nMust be effective at handling problems in the workplace, including anticipating, preventing, identifying, and solving problems as necessary.\nMust possess outstanding guest services skills, professional presentation and sophisticated communication skills\nMust be able to work in all areas of food productionProficient in the English language (verbal & written), second language is an asset.\nMinimum of 3 years of progressive management experience in a luxury hotel butchery \nKnowledge of Excel, word, and Outlook.\nCulinary Degree/Diploma \nMust be completed HACCP Level-3 Food Safety Management procedures & guidelines.\nMust be flexible in terms of working hours.\nMust be physically fit in order to lift items up to 35 Kilograms.\nMust have great leadership and communication skills.\nMust effective at listening to, understanding, and clarifying the concerns and issues raised by co-workers and guests.\nMust maintain composure and objectivity under pressure.\nMust be able to handle a multitude of tasks in an intense, ever-changing environment.\nMust be effective at handling problems in the workplace, including anticipating, preventing, identifying, and solving problems as necessary.\nMust possess outstanding guest services skills, professional presentation and sophisticated communication skills\nMust be able to work in all areas of food productionJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mecca, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}