{
    "Job ID": "69867188",
    "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Adhesive Technologies help to transform entire industries and provide our customers with a competitive advantage through adhesives, sealants and functional coatings. With our trusted brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Responsible for product recommendations, customized products applications, new product demonstrations and troubleshooting for customers.\nRecommends solutions and performs technical visits (meetings, audits, demonstrations, troubleshooting, etc.) for customers with documentation.\nReport quality issues / customers claims to relevant parts of the organization (incl. CCMS/ACE)\nWorks with application equipment to provide solutions to enhance customer adhesive related processes.\nReports technical results and contributes to customer presentations and works effectively on SBU and/or Regional specific projects.\nContributes to project plans and helps the team to deliver project goals and may supervise the laboratory work (incl. prioritization) for samples coming from customers, and report technical results to customers.\nQuantifies, documents and reports Henkel solution’s value to customers.\nResponsible for products application / technical training of field sales forces and customers.B.Sc. in Chemistry or Diploma in Surface Coating Technology or BE Chemical Minimum\nMinimum 3 years of relevant experience in application engineering.\nExpertise into laboratory technology and troubleshooting\nAnalytical thinking and knowledge of scientific method application methodsHenkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}