{
    "Job ID": "69867653",
    "Description": "Who are we and what do we do?BrowserStack is the world's leading software testing platform powering over two million tests every day across 19 global data centers. BrowserStack's products help developers build bug-free software for the 5 billion internet users accessing websites and mobile applications through millions of combinations of digital environments—devices, browsers, operating systems, and versions. We help Tesco, Shell, NVIDIA, Discovery, Wells Fargo, and over 50,000 customers deliver quality software at speed by moving testing to our Cloud. With BrowserStack, Dev and QA teams can move fast while delivering an amazing experience for every customer.BrowserStack was founded by Ritesh Arora and Nakul Aggarwal in 2011 with the vision of becoming the testing infrastructure for the internet. We recently secured $200 million in Series B funding at a $4 billion valuation in June 2021.At BrowserStack we solve real problems—each day is a unique challenge and an opportunity to make a difference. We strive to be open, transparent, and collaborative, so no feat is too big to achieve. BrowserStack is an extension of its people and a place where they can grow both professionally and personally. To that effect, we’re humbled to be recognized  by leading organizations around the world:BrowserStack is Great Place to Work-Certified™ 2020-21\n\nNamed “SaaS Startup of the Year” in 2022 by SaaSBOOMi\n\nRanked in Forbes Cloud 100 in 2021 - for the second time\n\nFeatured in LinkedIn Top Startups India 2018Role in nutshell:As a Principal Product Manager/ Senior Principal Product Manager, you'll work with a squad solving challenging problems faced by engineering teams across the globe. You will own and be accountable for critical engagement and business metrics of our products. You'll focus on understanding our customers and market and help us ship features that our users love. Your tasks will include implementing new features, growing product adoption and helping prioritize and solve support requests. This role will report to the Director of Product/ Senior Director of Product and will be remote first Desired experience:8+ years of overall experience in Product Management or Engineering \n\nPassionate or hands-on about programming, software quality and DevOps \n\nAble to understand and write code. Have prior experience building or using developer products \n\nStrong grasp of basic tech concepts. Willingness to learn advanced ones. \n\nExperience in web development, app development or automated testing is a plusWhat will you do?Implement new features to solve critical problems that our users face in their development workflows OR working towards architecting a whole new products\n\nTalk to our users constantly and have a deeper understanding of the customer personas \n\nDefine what success means for every feature. Track and improve the defined metrics \n\nWork closely with our engineering and design teams to simplify testing for our users \n\nWork with the GTM team and execute successful product launchesBenefits:In addition to your total compensation, you will be eligible for following benefits, which will be governed by the Company policy:Medical insurance for self, spouse, upto 2 dependent children and Parents or Parents-in-law up to INR 5,00,000\n\nGratuity as per payment of Gratuity Act, 1972\n\nUnlimited Time Off to ensure our people invest in their wellbeing, to rest and rejuvenate, spend quality time with family and friends\n\nRemote-First work environment that allows our people to work from anywhere in India\n\nRemote-First Benefit for home office setup, connectivity, accessories, co-working spaces, wellbeing to ensure an amazing remote work experienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}