{
    "Job ID": "69869738",
    "Description": "Before you apply to a job, select your language preference from the options available at the top right of this page.Explore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.Job Description:Job Summary\nThis position demonstrates advanced knowledge of entry writing. He/She classifies according to the Harmonized Tariff Schedules (HTS), participates in government agencies clearances (PGA), Code of Regulations, and Customs regulations.\nResponsibilities:Prepares customs entries and forwards freight to designated locations including interface with international and domestic carriers, overseas offices, and importers.\nPrepares customs entries and follows-up with the clearance process on all entries prepared.\nCommunicates documentation discrepancies to client and supervisor.\nCoordinates freight delivery to designated locations.\nResolves finance and accounting reconciliation exchange issues.\nScans entries into the imaging system meeting allotted and sensitive time requirements.\nPrepares reports/presentations and analysis using various software packages and databases.\nFollows up on documentation discrepancy issues which requires the ability to troubleshoot and communicate effectively, both verbally and in writing with customers and foreign origins.\nEstablishes and maintains client relationships.\nRequires a weekend work schedule on a department rotation basis and holiday schedule based on the needs of the operation and account requirements.Qualifications:High school diploma, GED, or International equivalent\nMinimum of 2 years' experience working for a Customs Broker\nBasic knowledge of customs operations, laws and regulations, and other government departments\nProficiency in Microsoft Office\nCustomers Broker License - Preferred\nAccurate and rapid data entry\nExcellent verbal and written communications skillsEmployee Type:\n UPS is committed to providing a workplace free of discrimination, harassment, and retaliation.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}