{"Job ID": "69869707", "Description": "Job DescriptionThe Air Combat Maneuvering Instrumentation (ACMI) Technician will assist the Lead Technician in daily performance and maintenance of the training system. This will include but not be limited to the repair, rework, test, troubleshooting and maintaining equipment of the ACMI training system, comprising both air and ground system components.The duties and requirements of this position includes but are not limited to the following:·Conduct operations and maintenance support of ACMI system. Ensures required assets, availability of pods and test equipment are in accordance with contractual obligations and expectations.·Assists Lead Technician with rework, repair, test, troubleshooting operations, and maintaining equipment of the ACMI system. Assists set-up of project equipment when required.·Assists with daily analysis of pod performance, and recommends corrective actions to Lead Technician in order to meet Key Process Indicators.·Conducts inventories and maintains accountability records for all ACMI systems including ancillary and support equipment.·Assists with use, control, accountability, and maintenance of tools, support equipment, supplies, and TMDE management and calibration. Conducts routine inventory of supply accounts (e.g., inventory management, cataloging, and property utilization).·Assists with ACMI logistics tasks to include equipment status reporting, maintenance data collection and job documentation. Ensures items requiring depot maintenance are processed in accordance with local and depot procedures. Ensures items are processed correctly and in a timely manner. Work closely with Lead Technician in support of repair process cycle management.·Qualified on all aspects of operation, maintenance, training actions, and participate as needed. Assist with pod transportation, and loading operations as required.·Ensures mission support is timely and provided for all daily and exercise operations. Works with other company contractors to ensure successful ACMI operations.Advises Lead Technician regarding any problem areas encounteredRequirements·5 year’s minimum experience working in an ACMI operation. College or military education with specialization in computer science/aircraft weapons or avionics may be substituted for a portion of this required experience up to a maximum of two years.·Basic knowledge of ACMI System which includes preventative maintenance and repair for P5 pods.·Previous experience working in an aircraft repair environment.·Basic electronic knowledge or experience in digital/analog signal processing, communications (VHF, UHF data link), AC/DC power supplies and converters, GPS systems and test equipment.·Technician qualifications gained either from Civilian/Military institution or training courses associated with any other ACMI systems·Proficient in Microsoft (MS) operating systems. Proficient in all (MS) Office productivity programs with a focus in Access and ExcelJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}