{
    "Job ID": "69869596",
    "Description": "Group overview:Headquartered in Riyadh, Saudi Arabia, we operate construction and manufacturing businesses, design & development centers and a host of facilities in the Middle East and other countries.alfanar is involved in:Electrical, Electromechanical and Civil Engineering Construction\nManufacturing and Marketing Electrical Construction Products\nAllied Engineering ServicesOur Main Divisions:alfanar electric\nalfanar Construction\nalfanar Building Systemsalfanar electricalfanar electric is the industrial arm of alfanar, manufacturing a variety of low, medium and high voltage electrical construction products.alfanar electric operates industries in:Riyadh and Jubail, Saudi Arabia\nDubai, UAE\nLondon, UKalfanar has a development and engineering center in Chennai, India.Industrial Complex, RiyadhThe center of alfanar’s industrial activities is alfanar Industrial Complex situated in the Third Industrial Zone on Al-Kharj Road, Riyadh.Spread across 700,000 square meters, the Complex houses alfanar’s facilities.The Complex has a comprehensive infrastructure including a data and communication center as well as a commercial zone.This position exist to take full responsibility of overall management of Maintenance section. include Plan, develop ,execute and monitor its activities and related systems by optimum resources at efficient cost. Deliver as per company quality standards. Manage the risks and opportunities to bring the section to a further step.Established system and procedure for all machine maintenance.\nSchedule, train, supervise and motivate employees for the maintenance department.\nDevelop maintenance procedures and ensure implementation.\nCarry out inspections of the facilities to identify and resolve issues.\nPlan and oversee all repair and installation activities.\nMonitor expenses and control the budget for maintenance.\nManage relationships with contractors and service providers.\nFinding new suppliers for our m/c spare parts and consumable parts with low prices than the local agents.\nResponsible for keeping our maintenance KPI’s in the target level.\nControlling maintenance tools, stores, and equipment.\nMonitoring and controlling maintenance costs dealing with emergencies, unplanned problems, and repairs.\nResponsible for SAP M/C MASTER DATA.\nResponsible for SAP PR & PO release strategy.\nEnsure health and safety policies are compliance\nApply all safety procedures.HR Proficiency:Ability to recruit, recognize and cultivate high performers and expose them in order to create a robust second line of management.\nAbility to recognize low performers and guide them to improve or release them.\nAbility to treat subordinates equally without any discrimination.\nAssessment criteria of subordinates is performance that leads to planned results.\nEnsure availability of delegation of authority matrix to have sufficient delegations as per company policy.Responsibility:Must take full responsibility for his operation as per the job description and the required deliverables from this position, taking into consideration the general company guidelines.\nAble to anticipate problems and make the necessary proactive steps to prevent them\nAbility to take necessary and proper timely decisions.Delivery:Deliver the required results in timely manner with required quality and cost.\nMaking a Tangible Difference:\nMust make a tangible difference to his area of operation. and exceed business expectations.Business Planning and Performance:Able to transform the corporate goals into business plans.\nAble to Plan, follow-up and execute those plans, whether they are annual or development plans.\nMonitor the plan performance and initiate action to strengthen results and take the corrective action accordingly.\nProvide periodic work progress reports.\nResponsible for monitoring and controlling budgets and expenses to achieve the optimum cost efficiency.Organizational Development:Develop the organizational structure according to the current requirements taking into consideration future and development plans.\nEnsure availability of job descriptions for all job roles and deployment.Business Process Improvements:Develop, coordinate well-defined written systems, policies, procedures, and seek automations opportunities as much as possible.\nShould be conversant and able to navigate through IT solutions especially those relevant to his job and business.\nPromote the automated systems and using them fully, to spread its culture.Quality:Quality is considered as alfanar’s prime competitive advantage as such, managers are expected to act accordingly.Adaptation:Adapt to new and alternative techniques, technologies, management structures, and business models.Health, Safety and Environment:Ensure a safe, secure, and legal work environment as per the standard regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}