{"Job ID": "69866644", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! What you'll do:As a Developer in Business Network you will be responsible for the following activities:Software Development focusing on design, coding, testing, quality assurance of specific product features in a development Scrum Team.\nResolve complex issues within your area of expertise.\nParticipate in each stage of the Software Development Lifecycle (analyze, design, implement, test, deploy and maintain)\nWrite clean and maintainable code using best engineering practices (unit testing, automation, source control, design patterns etc.)\nDemonstrate full responsibility for accepted tasks with high level of quality, speed, reliability and efficiency.\nBuild domain expertise in the areas of Procurement and Commerce Automation.\nParticipate in agile development methodology such as scrum methodology\nWork closely with other team members to ensure the team success.What you bring:Around 4 to 8 years of experience in software development.\nBachelor’s degree in Computer Science Engineering or Equivalent\nA solid foundation in computer science, with strong competencies in algorithms, data structures, object-oriented programming and software design principles.\nGood Programming skills and flexible to work on any technology.\nExcellent Object oriented programming skills.\nGood knowledge of XSLT, REST API, SOAP interface, scripting languages and Integration technologies.\nCurious to learn, Highly Result Oriented and Agile.Meet your team:As SAP Business Network Product Team, our mission is to provide the world’s leading cloud-based spend management solution. The team is spread across multiple locations around the world and brings together a diverse team of talent.We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 380662  | Work Area: Software-Design and Development  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}