{
    "Job ID": "69865763",
    "Description": "“A passion for perfection”Swissôtel Hotels & Resorts is a distinctive group of deluxe hotels where we put the emphasis on our people. We strive to provide a motivating and rewarding environment that attracts inspired and talented people who are willing to bring news ideas, use & develop their knowledge to reinvent their career path. Swissotel Makkah description:Swissotel Makkah is Swissotel’s first hotel to open in Saudi Arabia. The hotel offers 1487 elegant rooms and suites with modern design, complementing the values of today’s Arab culture. As part of the prestigious Abraj Al Bait complex, the deluxe Swissotel Makkah is a contemporary five-star hotel located in close proximity to the holy Masjid Al Haraam, overlooking the Ka’aba and the Grand Mosque.Swissotel Makkah is part of a new urban development, including two restaurants, one executive lounge, two meeting rooms and a business centre. It has private entrances that make it easier for pilgrims to reach Al Masjid Al Haram. Approach all encounters with guests and employees in a friendly, service-oriented manner.\nMaintain regular attendance in compliance with Accor Standards, as required by scheduling which will vary according to the needs of the hotel.\nMaintain high standards of personal appearance and grooming, which include wearing the proper uniform and name tag while working.\nComply at all times with Accor standards and regulations to encourage safe and efficient hotel operations.\nPromote a Professional and Disciplined work environment\nSupport/Coach/Lead & Motivate kitchen colleagues\nActively share ideas, opinions & suggestions in daily shift briefings\nEnsure storeroom requisitions are accurate to minimize repeat visits\nEnsure all kitchen colleagues are aware of standards & expectations\nPromote Health and Safety at all times\nEnsure proper hygiene as per Makkah Municipality and HCCAP\nEnsure all grooming, spot check and temperature control sheets are filled as required\nMaintain cleanliness and proper rotation of product in all chillers\nMinimize wastage/ spoilage\nMaintain consistent on the job training sessions for culinary colleagues\nLiaison daily with Outlet Chefs to keep open lines of communication & guest feedback\nStrives to maintain & improve all food preparations & presentations\nAct as an extension of kitchen managers to communicate food consistency & quality\nDaily preparation and check of all mise - en - place to ensure freshness & quality standards\nStrive to develop as a leader by attending Accor Managerial Courses\nAssign and follow – up tasks as dictated by business volumes\nUnderstand formal requisition process\nRecognize available food garnished and utilize same\nAdhering all safety and sanitation policies when handling food.\nFollow directions of Se. CDP and sous chef in daily tasks.\nOther duties as required.\nRecognize quality standards in meats, fish, and poultry.\nDemonstrate proficiency in the following cooking techniques: sauté, frying, poaching, pan frying, broiling, grilling, roasting, braising, and understand which cuts of meat are best suited for all these various techniques.Proficient in the English language (verbal & written), second language is an asset.\nMinimum of 6 years of progressive kitchen experience in a luxury hotel kitchen or a related field. \nMust have held same position in a luxury hotel kitchen or a related field.  \nHigh School diploma and/ or experience in a hotel or a related field.\nMust be flexible in terms of working hours.\nMust be physically fit in order to lift items up to 35 Kilograms.\nMust have leadership and communication skills.\nMust effective at listening to, understanding, and clarifying the concerns and issues raised by co-workers and guests.\nMust maintain composure and objectivity under pressure.\nMust be able to handle a multitude of tasks in an intense, ever-changing environment.\nMust be effective at handling problems in the workplace, including anticipating, preventing, identifying, and solving problems as necessary.\nMust possess outstanding guest services skills, professional presentation and sophisticated communication skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mecca, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}