{
    "Job ID": "69867167",
    "Description": "Job Brief:The ERP Techno-Functional Senior Officer plays a pivotal role in the successful implementation, configuration, and ongoing maintenance of Umniah ERP system. This role requires a strong understanding of both the technical aspects of the ERP platform and the functional requirements of various business units. The specialist will collaborate with cross-functional teams to ensure the ERP system meets Umniah operational needs while maintaining optimal performance and data integrity.Key Responsibilities:Collaborate with cross-functional teams to plan and execute ERP system implementations, ensuring a smooth transition from legacy systems.\nConfigure and customize ERP software to align with specific business requirements and processes. Develop and maintain custom reports and workflows.\nManage data migration, cleansing, and integration efforts to maintain data accuracy and consistency within the ERP system.\nProvide technical support and troubleshooting for ERP system issues, collaborating with IT teams to resolve technical issues.\nAnalyze and understand business processes and translate them into ERP system configurations and improvements.\nTrain end-users and stakeholders on how to use the ERP system effectively, ensuring maximum utilization and adoption.\nConduct testing and quality assurance activities to identify and resolve system defects or issues before deployment.\nMaintain comprehensive documentation of ERP configurations, customizations, and processes.\nIdentify opportunities for optimizing ERP system functionality and performance, suggesting enhancements and improvements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Amman, Jordan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}