{"Job ID": "69867012", "Description": "You are responsible for ensuring that you have properly trained people and that their needs are addressed so they can focus on their jobs. You will ensure Amazon policies – including attendance tracking – are implemented and administered fairly and consistently. This includes motivating, coaching, reporting, and providing feedback of associates’ performance – including productivity, quality, and safety - as a means for achieving or exceeding Amazon expectations. The Team lead will address discipline and/or performance issues for FC Associates including up to termination. In addition, you will work in partnership with third party delivery providers to ensure Amazon standards are being met in accordance to service contracts. We're seeking a Team lead for our FC operations. In this role, you will be responsible for: - Managing, on a daily basis, end to end operations for either one large site. Executing inbound and outbound operations, coordinate physical and virtual workflows, or flow of orders and materials to ensure products are shipped on time to meet customer delivery promise - Driving performance management of your team members. Preparing and implementing training and development plans for associates. - Continuously improve the delivery process and attain a sustained level of delivery performance improvement. - Conducting 4M and 5S audits for the delivery station on a daily basis. - Stand-in for Area Manager. - Ability to manage day and night shifts. - Consolidate information from different sources to determine daily load plan requirements for the facility, then adjusting and executing accordingly. - Monitor system generated routing solutions and provide viable routing solutions and make decisions on deliveries outside of the normal routing matrix. - Lead the order batching strategy to ensure efficiency while protecting customer experience - Allocate labor from various sources, lead meetings, direct and assign job duties for FC Associates - Perform in depth problem solving in all areas to ensure successful and continuous operations - Train, audit, and support FC Associates to perform Amazon standard operating procedures and utilizing equipment and software - Ensure FC associates have proper tools to perform the job and coordinate repair or replacement when needed - Communicate with internal and external suppliers using all communication channels available - Report and escalate systemic issues to management as necessary and in a timely manner - Participate in initiatives to ensure Safety and Operational Excellence. Identify,\naddress and resolve safety hazards within the Fulfillment Center - Fully understand processes and daily goals, and make recommendations to improve performance - Perform administrative duties, and additional functions, as needed and determined by management - Support and work in all areas of the Fulfillment Center as required and as determined by site management - Support other spokes/ fulfillment centers as required and as determined by city leadership At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our GSF FC operations team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers.\nWe are open to hiring candidates to work out of one of the following locations:\nGurgaon, HR, IND\n- Bachelor's degree\n- Speak, write, and read fluently in English\n- Experience with Microsoft Office products and applications\n- 1+ years of manufacturing or customer-facing environment experienceJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Gurgaon, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}