{
    "Job ID": "69860769",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:You as a Senior Sales Manager - Network Control - MEA will be part of Hitachi Energy business based in Dubai, UAE. You will be responsible for market development and sales of large SCADA projects utilizing the company’s SCADA and Network Manager SCADA or EMS or GMS or DMS or OMS and related systems and services within the Middle East and Africa market.Your responsibilitiesSelling Network Control systems and services to customers, focusing on assigned volume and profitability targets for the Business Units.\nEstablishing and maintaining effective customer relationships to understand customer needs.  Promoting customer understanding of full systems and services offering and align to providing a solution. Ensuring a positive customer experience throughout the sales process.\nPreparing sales and closing out plans and performing regular status reviews and proposing recovery plan in cases of potential order shortfalls.\nCreating added value to customer by following up and supporting in resolving potential issued to ensuring the successful outcome of transactions, contracts, and proposals, and supporting project execution team if needed.\nEnsuring efficient marketing activities and valuing proposition to customers.\nIdentifying a winning strategy, present to and collaborating with all stakeholders within GA and country Sales and Account management teams in driving the strategy forward and leading execution of Sales strategy, goals and plans in the assigned region in accordance with the defined guidelines and targets.\nIdentifying and driving the development of new market opportunities in the designated Southern African market and ensuring know-how sharing and cross-collaboration.\nManaging administrative procedures in sales processes, ensuring timely preparation and submission of offers in coordination with the bid and proposal department and/or the Marketing Manager. Ensuring appropriate technical, commercial, and financial aspects of offers.\nManaging and maintaining the sales reporting tools, opportunities and accounts and reporting the sales and business performance in different countries in the assigned territories\nLiving Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.Your backgroundA bachelor’s degree in electrical engineering.\n10+ years of experience in the similar field.\nProficiency in both spoken & written English language is required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}