{"Job ID": "69866717", "Description": "Amazon Music is an immersive audio entertainment service that deepens connections between fans, artists, and creators. From personalized music playlists to exclusive podcasts, concert livestreams to artist merch, Amazon Music is innovating at some of the most exciting intersections of music and culture. We offer experiences that serve all listeners with our different tiers of service: Prime members get access to all the music in shuffle mode, and top ad-free podcasts, included with their membership; customers can upgrade to Amazon Music Unlimited for unlimited, on-demand access to 100 million songs, including millions in HD, Ultra HD, and spatial audio; and anyone can listen for free by downloading the Amazon Music app or via Alexa-enabled devices. Join us for the opportunity to influence how Amazon Music engages fans, artists, and creators on a global scale.\nOur team is focused on building a personalized, curated, and seamless music experience. We want to help our customers discover up-and-coming artists, while also having access to their favorite established musicians. We build systems that are distributed on a large scale, spanning our music apps, web player, and voice-forward audio engagement on mobile and Amazon Echo devices, powered by Alexa to support our customer base. Amazon Music offerings are available in countries around the world, and our applications support our mission of delivering music to customers in new and exciting ways that enhance their day-to-day lives.\n\nPosition Overview -\n• Debugging, troubleshoot and maintain automation scripts by fixing the stability issues.\n• Writing test cases (not test plans) that are high quality, high value and maintainable.\n• Able to reproduce product defects & script failures to assist developers or other testers and identify, track, and accurately report defects found.\n• You create automation scripts for low complexity test cases based on feasibility analysis done by the QA / DEV teams.\n• You acquire knowledge of the features and detailed functional requirements of the work to execute your assigned tests, and find gaps in the test plan/test coverage.\n• Good knowledge in language, vocabulary & grammar & contextual information\n• Ability to deep dive on applications & comparing features between various versions & identifying changes made within versions\nKey job responsibilities\n• Black Box testing\n• Write test cases for the new feature, modifying and maintaining the existing test cases.\n• Understand and ramp up on QA procedures, guidelines and policies for newly launched feature and apply them\n• Use software tools for QA, fix up and data capture on a daily basis\n• Be proactive in identify issues, deep dive, troubleshoot, communicate to stake holders and escalation of issue and providing status reports\n• Be part of a highly charged work environment\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- B.Tech with Computer Science and IT background\n- Experience of 1+ year in manual testing\n- Experience of 1+ year in automation testing\n- Bachelor’s Degree in Computer Science or related field\n- Good Analytical skills\n- Knowledge on QA Methodology\n- B.Tech with Computer Science Background\n- App testing experience would be preferredJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}