{"Job ID": "69866675", "Description": "Job Description\n4^4 The number of projects that you would lead or support across multiple therapeutic areas.\nWe are looking for an experienced professional with robust programming competencies (SAS, SQL, Python, R, etc.) & strong communication skills for our Clinical Database Development Reporting & Analytics function. As a member of this function, you would be primarily responsible for seamless end to end data flow of Clinical & Operational Data from Data Collection, Transformation, Reporting & Analytics & provisioning of data to downstream applications & teams.\nYour responsibilities include, but are not limited to:\n• Serves as the primary program/therapeutic area lead ensuring timely and quality deliverables\no Leads the effective and timely development and implementation of clinical systems\no Uses advanced database programming techniques to solve study specific complex validation or custom development needs\no Understand and manages study metadata to compliment data provisioning in compliance with global standards.\no Coordinates database development and conducts database testing\no Develops data models to support data review and acquisition standards to adapt for study/project level needs and specificities.\n• Establishes and maintains strong working relationships with study teams, and functional lines\n• Acts as a technical consultant ensuring appropriate development, maintenance, and use of all system capabilities such as electronic data capture, database programming, edit check programming, report programming, electronic data load, interactive response technology, electronic patient reported outcomes, metadata management and other clinical database development activities\n• Ensures that systems meet regulatory requirements, internal standards and are deployed with quality.\n• Lead independently or participate in improvement initiatives and/or non-clinical projects\n• Communicate and ensure that project objectives and priorities are met according to agreed timelines, strategies, quality and scientific standards.\n• Responsible for Database development activities for multiple studies in parallel across TAs .Coordinates resources to ensure project objectives are met\n• Contributes to the development/updates of Clinical Systems processes and supports training on systems and processes to ensure compliance. Recruit, train, mentor, supervise and/or coach junior staff.\nDiversity & Inclusion / EEO\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\nWhat You’ll bring to the role:\n• At least 7 years of experience in setup of clinical databases/Data Warehouse using RAVE or OC-RDC or LSH.\n• Excellent interpersonal and written and oral communication skills, with the ability to effectively communicate cross-functionally\n• Advanced technical skills:\no Expert knowledge of EDC - Medidata RAVE preferred\no Excellent understanding of relational databases\no Microsoft Office Suite\no Knowledge of other programming languages such as SQL, PL/SQL, VBscript, SAS, C# or Java preferred\no Experience in Custom Functions is an added advantage.\n• Demonstrated ability to consistently produce detailed, high quality deliverables in a team environment .Excellent problem-solving, project management negotiation and conflict resolution skills.Excellent understanding of Drug Development Process, ICH-GCP and Health Authority Guidelines & Regulations.\n• Excellent planning, resource and project management skills.Ability to mentor within Clinical Sytems and cross functionally, and coordinate internal and external training.\n• Ability to effectively lead and contribute to initiatives requiring Clinical Database acquisition tools and design expertise. Working knowledge of relevant industry standards including CDASH and SDTM is preferred\n• Subject Matter Expert in functional, technical process and provide technical expertise in the establishment of data standards for new study specific CRF pages.\nWhy Novartis?\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\nImagine what you could do here at Novartis!\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/networkJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}