{"Job ID": "69866629", "Description": "Job Number 23138519 Job Category Sales & Marketing Location The St. Regis Al Mouj Muscat, Muscat, Oman, Oman VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY At least 3 years’ Luxury hotel experience in Muscat is a must Omani Nationality Dynamic & Presentable Sharp & Passionate Well-connected within the local market The position is accountable for proactively soliciting and handling sales opportunities. Ensures business is turned over properly and in a timely fashion for proper service delivery. Assists in leading all day-to-day activities related to sales with a focus on building long-term, value-based customer relationships that enable achievement of sales objectives. Achieves personal sales goals. CANDIDATE PROFILE Education and Experience • 2-year degree from an accredited university in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 3 years experience in the sales and marketing or related professional area. OR • 4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 1 year experience in the sales and marketing or related professional area. CORE WORK ACTIVITIES Building Successful Relationships that Generate Sales Opportunities • Works collaboratively with off-property sales channels to ensure sales efforts are coordinated, complementary and not duplicative. • Builds and strengthens relationships with existing and new customers to enable future bookings. Activities include sales calls, entertainment, FAM trips, trade shows, etc. • Develops relationships within community to strengthen and expand customer base for sales opportunities. • Manages and develops relationships with key internal and external stakeholders. • Provides accurate, complete and effective turnover to Event Management. Managing Sales Activities • Participates in sales calls with members of sales team to acquire new business and/or close on business. • Executes and supports the operational aspects of business booked (e.g., generating proposal, writing contract, customer correspondence). Using Knowledge of Market Trends and Target Customer Information to Maximize Revenue • Identifies new business to achieve personal and location revenue goals. • Understands the overall market - competitors’ strengths and weaknesses, economic trends, supply and demand etc. and knows how to sell against them. • Closes the best opportunities for the location based on market conditions and location needs. • Gains understanding of the location’s primary target customer and service expectations; serves the customer by understanding their business, business issues and concerns, to offer better business solution. Providing Exceptional Customer Service • Supports the company’s service and relationship strategy, driving customer loyalty by delivering service excellence throughout each customer experience. • Services our customers in order to grow share of the account. • Executes and supports the company’s customer service standards. • Provides excellent customer service consistent with the daily service basics of the company. • Sets a positive example for guest relations. • Interacts with guests to obtain feedback on product quality and service levels. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Combining timeless glamour with a vanguard spirit, St. Regis Hotels & Resorts is committed to delivering exquisite experiences at more than 50 luxury hotels and resorts in the best addresses around the world. Beginning with the debut of The St. Regis hotel in New York by John Jacob Astor IV at the dawn of the twentieth century, the brand has remained committed to an uncompromising level of bespoke and anticipatory service for all of its guests, delivered flawlessly by a team of gracious hosts that combine classic sophistication and modern sensibility, as well as our signature Butler Service. We invite you to explore careers at St. Regis. In joining St. Regis, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Muscat, Oman", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}