{
    "Job ID": "69866465",
    "Description": "Job description:Primary Responsibilities:You are fit for the role of a Business System Analyst role if you have:Basic qualifications:Candidates should have 3 to 5 years years as a Business System Analyst.This role will be responsible for tracking sales performance activity across Thomson Reuters. This will require close interaction with global partners from several functions.\nThe data will be compiled for reporting each month. The data will be evaluated in several categories and made into user friendly reports. This analysis will be provided to senior leadership on a regular basis. The role will be expected to identify trends that can support decisions that drive improvement in sales performance. The role will receive regular requests for additional information from senior leaders and will be expected to partner across the organization to provide information as needed.\nAd hoc requests will include business and team specific performance reporting at the request of the executive team.\nKey Skills for the role\nMust have strong Microsoft Office skills, with a focus on Excel. Should know how to create Tableau reports.\nAbility to use Alteryx and build and modify workflows.\nAbility to gather, organize, and analyze large quantities of data.\nAbility to analyze, present and describe data and themes.\nA desire to gain detailed understanding of sales performance metrics.\nAbility to multi-task across multiple stakeholders and deliver accurate results within tight deadlines.\nExperience and Qualification\n4-year college degree\n3 to 5 years’ experience in working with Sales Data preferably from Salesforce as BI Developer, data analyst or data scientist roles with exceptional project management skills and attention to detail.What's in it For You?\nYou will join our inclusive culture of world-class talent, where we are committed to your personal and professional growth through:Hybrid Work Model: We've adopted a flexible hybrid working environment for our office-based roles while delivering a seamless experience that is digitally and physically connected.Wellbeing: Comprehensive benefit plans; flexible and supportive benefits for work-life balance: flexible vacation, two company-wide Mental Health Days Off; work from another location for up to a total of 8 weeks in a year, 4 of those weeks can be out of the country and the remaining in the country, Headspace app subscription; retirement, savings, tuition reimbursement, and employee incentive programs; resources for mental, physical, and financial wellbeing.Culture: Globally recognized and award-winning reputation for equality, diversity and inclusion, flexibility, work-life balance, and more.Learning & Development: LinkedIn Learning access; internal Talent Marketplace with opportunities to work on projects cross-company; Ten Thousand Coffees Thomson Reuters café networking.Social Impact: Eight employee-driven Business Resource Groups; two paid volunteer days annually; Environmental, Social and Governance (ESG) initiatives for local and global impact.Purpose Driven Work: We have a superpower that we’ve never talked about with as much pride as we should – we are one of the only companies on the planet that helps its customers pursue justice, truth and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.#LI-SS5Do you want to be part of a team helping re-invent the way knowledge professionals work? How about a team that works every day to create a more transparent, just and inclusive future? At Thomson Reuters, we’ve been doing just that for almost 160 years. Our industry-leading products and services include highly specialized information-enabled software and tools for legal, tax, accounting and compliance professionals combined with the world’s most global news services – Reuters. We help these professionals do their jobs better, creating more time for them to focus on the things that matter most: advising, advocating, negotiating, governing and informing.We are powered by the talents of 25,000 employees across more than 75 countries, where everyone has a chance to contribute and grow professionally in flexible work environments that celebrate diversity and inclusion. At a time when objectivity, accuracy, fairness and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward. Accessibility As a global business, we rely on diversity of culture and thought to deliver on our goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity/Affirmative Action Employer providing a drug-free workplace.We also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law.Protect yourself from fraudulent job postings click here to know more.More information about Thomson Reuters can be found on https://thomsonreuters.com.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}