{"Job ID": "69866456", "Description": "At Four Seasons, we consider life and work to be richer when we truly connect with the people and the environment around us.Our family members are masters at their crafts – a gardener can become an artist, a manager a conductor, a chef an inventor. We look for employees who share the Golden Rule: people who, by nature, believe in treating others as we would have them treat us. We look for our people to characterize a shared passion for excellence and to infuse that enthusiasm into everything they do.About Four SeasonsFounded in 1960, Four Seasons continues to define the future of luxury hospitality with extraordinary imagination, unwavering commitment to the highest standards of quality, and the most genuine and customized service. Currently operating 180 + Hotels and Private Residences in major city centers and resort destination in 47 countries, and with many more projects in development stage, Four Seasons consistently ranks among the world’s best hotels and most prestigious brands in reader polls, traveler reviews and industry awards.Main Duties & ResponsibilitiesAssist in the planning and development of menus for the hotel; ensure the correct preparation and presentation of a consistent level for all food items prepared\n\nControl labor and operating expenses through effective organization, purchasing decisions, and inventory control\n\nEnsure that sanitation standards as set forth by Four Seasons, local, state, and federal regulations are in compliance as well as the cleanliness and organization of the kitchen\n\nCommunicate with employees and managers to ensure operational needs are met as well as attend regular operational meetings to ensure effective coordination and cooperation between departments\n\nWork harmoniously and professionally with co-workers and supervisors\n\nAble to type, cost recipes, make pick up charts and any spreadsheet needed to make work efficient.\n\nEnsure food quality is up to standards by inspecting and conducting frequent quality checks\n\nInspire and motivate the Team members and conduct any Team building activities.\n\nFloor presence to demonstrate and develop the pastry Team in order to contribute in the success of the operation\n\nAble to work in different shifts and areas of the pastry kitchen to fulfill business needs and to acquire the knowledge needed to successfully meet the expectations for this role and be able to grow within the organizationWhat You Will BringThe Four Seasons Hotel Kuwait is looking for Chef de Partie for the Candidates with passion for excellence, expertise in hospitality operations and proven leadership. As the member of the Kitchen, the Chef de Partie works across disciplines to deliver an exceptional experience and provide leadership, ability to priorities and adapt to the changing needs of the operation.\n\nThe ideal candidate brings forward creativity and innovative ideas. The candidates must have a great cooking, organizational skills, a strong work ethic and people-management.  \n\nIdeally have a culinary diploma / degree.\n\nMinimum of two years’ experience working in a similar position in five star luxury hotels.\n\nPreferred Asian nationalThe benefits offered by Four Seasons Hotel Kuwait:Complimentary accommodation on full board basis in a high quality, well-resourced compound with Wi-Fi internet \n\nComplimentary nights at other FS Hotels worldwide \n\nOpportunities to learn and grow with online and offline trainings \n\nRegular social and sports events \n\nPaid home leave with flight tickets \n\nComplimentary employee meals and Uniforms \n\nHealth medical and insurance benefits \n\nFree transportation to and from work with Wi-Fi internet access Work AuthorizationHotel will apply for the work authorization for the successful candidateWe look forward to receiving your application!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kuwait", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}