{"Job ID": "69866224", "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleJob Description:Development and documentation of data platform classes/tables, methods/functions and REST APIs that support the application on Cache data platform.\nCreation of new workflow using Cache and debugging of existing workflows.\nDevelopment of new interfaces in Cache which includes Business Process and Operations.\nDevelop features across multiple modules within our application, including collaboration in requirements definition, prototyping, design, coding, testing and deployment.\nEstimate development efforts including design, code and unit testing.\nWork in late night shift to provide overlap with US working hours.Required Qualifications:B. Tech/MCA4 to 8 years’ experience Cache and MUMPS.\n4 to 8 years of application development experience using .Net technologies.\nGood knowledge of object-oriented code with a web programming language ASP.NET WPF\nExperience and exposure to Relational and NoSQL database solution\nExperience in object oriented -oriented programming, SQL for application data access.\nExperience of deconversion of Account Processing core.\nBasic knowledge of TFS.Experience on Account Processing Core\nExposure to Banking and Financial Services industry with a good understanding of Banking Products, Services & Procedures. Strong analytical skills, good verbal and written communication skills and the ability to interact professionally with a diverse group.\nLeadership and mentoring skills.Thank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}