{"Job ID": "69867029", "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,500 companies and 12M employees. We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.   Position: Technical Account Manager - EMEA\n\nLocation: Bangalore/ Mohali /Pune, IndiaThe Technical Account Manager - EMEA will report to the Manager, Technical Account Managers.  You will provide world-class post-sales engineering and professional services support to enterprises and service providers.  You will interact with customers using a variety of mediums (phone, email, on-site) in a professional and efficient manner. All TAMs are held to the highest industry standards for responsiveness and services provided. The TAM manages the Premium Support relationship and ensures that Zscaler is and continues to be considered a key technology partner within the account.  The TAM will work closely with the Field Sales Team to ensure that all Zscaler products and services are deployed in a manageable and supportable way, and the customer gets the most out of their investment for the life of the contract. The TAM will work toward establishing an excellent working relationship with other members of the Zscaler Team that are active within his/her accounts. As the Zscaler platform integrates with many aspects of the Internet and customer infrastructure, a thorough understanding of Internet protocols and networking beyond HTTP and SMTP is required.\n\nThe mission of Zscaler's Customer Success department is to transform the way our customers work, to lead them through their digital transformation, and support their business outcomes. Improve Experience for our customers, and their users, to get the best user experience while maximizing security in a global environment. Through world-class technical engagement, and ensuring our customers get the best out of the technology.\nEngagement, a partner with our customers and partners, be their trusted advisors and turn them into raving fans of ZscalerResponsibilities/What You’ll Do:Manage, escalate, and drive satisfactory resolution of customers' technical support, service and infrastructure issues based on Zscaler products and technologies.\nManage implementation and consulting projects, where you would be expected to plan, schedule and implement Zscaler web and email solutions for customers or service providers.\nExpected to take support escalations from the region and help the Support team from time to time.\nExpected to be available to be on call when contacted by premium support customers for P0/P1 customer-impacting issues during non-operational hours.\nCreate and facilitate communication channels between the gold/platinum customer and the product management and engineering teams in Zscaler.\nProactively update customers about cloud updates, upgrade and ensure necessary action to maintain availability and customer satisfaction.\nProvide on-site and virtual product training to Premium Support customers.\nProactively develop and deliver notifications of new Zscaler products and technologies to Premium Support customers\nProactively monitor reporting information and policy configurations of Zscaler technologies at customer sites and make ongoing recommendations\nHelp develop and maintain best practices for implementing and supporting Zscaler products in both internal and customer-facing Knowledge Bases\nMaintain intimate knowledge of all Zscaler products and services\nProvide clear and constructive product feedback to Zscaler Product Management based on customer requirements4-5 years of account management experience (either pre- or post-sales)\nExperience in implementing/ supporting web security and email security solutions.\nExperience in high-tech networking and information security industry.\nCommitted desire to provide customer satisfaction\nStrong written and verbal communication skills\nIn-depth understanding of enterprise networks and infrastructur\nFundamental understanding of application networking.\nAdept in TCP/IP stack and practical knowledge of the protocol workflow\nUnderstanding of basic protocols like : HTTP, DNS, TCP, UDP, SSL/TLS, ICMP, FTP\nHands-on experience in working with network troubleshooting tools like Wireshark, WinMTR, Fiddler, etc\nAdded advantages : experience in l2/l3 protocols and devices, advanced security concepts like IPS/IDS/DLP, authentication protocols like SAML/LDAP.\nStrong Troubleshooting and customer management skills is a must.\nAn in-depth understanding of TCP/IP, including reading packet, captures and general diagnostics is required.\nUnderstanding of Microsoft Active directory is required.\nPractical understanding of open-source system administration: Windows, Linux, FreeBSD is required.\nExperience with FreeBSD and Linux is desired.\nPractical understanding of Internet protocols: HTTP, SMTP, DNS, LDAP, and FTP is required.\nBasic Shell Scripting/Programming Experience (bash, Perl etc.) is an added advantage.\nSQL experience is an added advantage.\nUnderstanding of Various routing and switching architectures (Cisco, Juniper, etc.) is an added advantage.#LI-SU1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}