{
    "Job ID": "69866272",
    "Description": "The IT Quality Analyst 2 is a developing professional role. Applies specialty area knowledge in monitoring, assessing, analyzing and/or evaluating processes and data. Identifies policy gaps and formulates policies. Interprets data and makes recommendations. Researches and interprets factual information. Identifies inconsistencies in data or results, defines business issues and formulates recommendations on policies, procedures or practices. Integrates established disciplinary knowledge within own specialty area with basic understanding of related industry practices. Good understanding of how the team interacts with others in accomplishing the objectives of the area. Develops working knowledge of industry practices and standards. Limited but direct impact on the business through the quality of the tasks/services provided. Impact of the job holder is restricted to own team.\nResponsibilities:Supports initiatives related to User Acceptance Testing (UAT) process and product rollout into production. Testing specialists who work with technology project managers, UAT professionals and users to design and implement appropriate scripts/plans for an application testing strategy/approach.\nConducts a variety of process monitoring, product evaluation and audit assignments.\nDocuments findings and prepares nonconformance reports.\nTracks nonconformance items and ensures items are resolved before project moves to production.\nCreates and maintains testing verification matrices.\nGathers, maintains and reports on quality metrics.\nVerifies traceability in project work products.\nExhibits good understanding of procedures and concepts within own technical area and a basic knowledge of these elements in other areas.\nMakes evaluative judgments based on the analysis of factual information; resolves problems by identifying and selecting solutions through the application of acquired technical experience and guided by precedents.\nHas limited but direct impact on the team and closely related teams through the quality of the tasks services provided.\nExchanges ideas and information in a concise and logical way; recognizes audience diversity.\nPerform other duties and functions as assigned.\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:0-2 years Quality Assurance experience preferred\nUnderstanding of QA within Software Development environment\nLogical analysis skills and problem solving Proven ability to work to deadlines.\nConsistently demonstrates clear and concise written and verbal communication skills\nAbility to work under own initiative or as part of a team.\nExperience in Designing & Executing test casesEducation:Bachelor’s/University degree or equivalent experience-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}