{"Job ID": "69866535", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.POSITION TITLE: ITISC FET Europe IT Monitoring Engineer (Only Male)REPORTING TO: ITISC FET Europe IT Monitoring ManagerWORKING LOCATION: B5, IndiaOBJECTIVE:The main objective of this position is to deliver high quality infrastructure support under 24X7 monitoring of all the infrastructure components.REQUIRED EXPERIENCE AND SKILLS:Experience:Basic experience required as Windows administrator monitoring, Azure monitoring, FortiGate devices and managing business critical applications.\nBackground as IT System administrator (Windows operating systems, VMware, FortiGate and NetApp) beneficial.\nBasic understanding and experience in IIS, ASP.NET, along with any other type of application monitoring and troubleshooting knowledge.\nEffectively collaborate with Server, Network, Database, Application support teams during Incident troubleshooting and Incident bridges.\nBasic understanding of Cloud Infrastructure services & its concepts\nMust have the technical aptitude to learn, apply and solve technological solutions and/or challenges;\nPrior experience in monitoring and managing events coming from the SQL and other Database servers.\nStrong organizational skills;\nAbility to listen, gather and understand information about people and situations, quickly;\nExcellent attention to detail and quality;\nAt ease with distant & international communications through a wide array of technologies (ticketing tool, documents and forums, phone, chat, e-mail).\nCertification ITIL Foundation V4 highly appreciated, but not mandatory.\nEnglish (fluent) required;\nExpertise in Microsoft Office: Outlook, Word, Excel, PowerPoint.Technology skills:MandatoryBasic Networking skills – routers, firewalls, switches, LAN, WAN monitoring.\nIntermediate Server monitoring and troubleshooting. Windows, Linux platforms.\nIntermediate understanding on Application monitoring and troubleshooting.\nOptional Certifications or trainings in Windows Server platform (MCP) , Azure Cloud Administration\nExperience using monitoring tools like Site24x7, HP OpenView, Business availability center, FortiManager, FortiAnalyzer or similar.\nBasic knowledge of Windows server 2012/2016/2019 administration, Azure Infrastructure and troubleshooting.OptionalBasic understanding in Data Base monitoring and administration. MS SQL Server up to 2019.\nBasic understanding on Virtualization technologies.\nKnowledge on Scripting & Automation\nKnowledge on Cloud TechnologiesPersonal Skills:Team Player\nSmart worker\nQuick learner\nWillingness to work in 24x7 shifts.Qualification: Bachelor's degree or comparable educationExperience – 3 to 6 years into IT infra supportPREFERED CANDIDATES:The successful candidate will have a self-motivated, get-it-done attitude; the ability to think critically; enjoy working with teams spread globally and across cultures; a desire to learn in new areas; and the discipline to pay attention to deadlines, details and quality.\nGood communication and interpersonal skills to interact with team in Europe\nBE Computer Science/MCA or any other Bachelor’s degree with the right experience\nWill be an added advantage if worked on Laboratory related applicationsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}