{
    "Job ID": "69866333",
    "Description": "Main DutiesAdministrationAssists with the development and maintenance of a detailed Department Operations Manual that reflects policies and procedures, work processes and standards of performance within the Division. Ensures annual review to accurately reflect any changes.\nAssists with the preparation of the annual Finance Business Plan ensuring Divisional Objectives fully address business objectives of the hotel and needs of employees.\nAssists with the preparation and regular update of the Finance Departmental Budget, in close cooperation with the Director of Human Resources ensuring targets are met and costs are effectively controlled.\nEnsures that an efficient and accurate filing system, both manually as well as electronically is maintained at all times.\nKeeps and safeguards all contracts and financial documents.\nAdministers and monitors the billings and utilisation of sponsorship fund.\nAdministers and monitors the billings and claims for staff incentive for Food and Beverage promotion.\nPrepares schedules for musicians' and guest chefs' salaries in accordance to the Musician Contracts for payment and submission to the local tax authority.\nVerifies Furniture, Fixtures and Equipment (FF and E) movements and check the historical cost for all items to be written off.\nChecks and records all purchase requests on FF and E against the budget.\nPrepares and submits the monthly FF and E schedule, together with the support details, to the Owning Company.\nVerifies all Operating Equipment (OE) breakage and condemned linen.\nChecks and records all purchase requests on OE against the budget.\nPrepares and submits the monthly OE schedule, together with the support details, to the Owning Company.\nOrganises the semi-annual OE inventory taking and to prepare the OE Report and Comparison accurately and on time.\nPrepares Special Projects and Major R and M schedules and ensure all entries and adjustments are properly done.Administration (continued)Verifies and inputs all approved Direct Credit Authorization Form from vendors and check Vendor Audit Report daily.\nRelieves the General Cashier duties, as and when required.Customer ServiceProvides the appropriate level of professional, courteous and caring service to other employees (internal customers) and other visitors to the division.Ensures all employees provide a courteous and professional service at all times.\nHandles guest and employee enquiries in a courteous and efficient manner, reporting complaints or problems if no immediate solution can be found, whilst feeding back a prompt follow up.\nMaintains positive guest and colleague interactions with good working relationships.FinancialEnsures all disbursements and claims are supported by all necessary documents, processed and certified for receipt of merchandises or services in quality, quantity and prices.\nMaintains and records all general ledger accounts.\nEnsures that all sub-ledgers agree with general ledger.\nChecks and verifies all monthly journals prepared by Accounts Clerks.\nPrepares monthly journal entries as assigned.\nPosts all monthly-approved journal entries.\nPrepares and maintains schedules and analyses for all accounts.\nPrepares bank reconciliation statements for all banks.\nAssists the Director of Finance/Assistant Director of Finance in all stages leading to the preparation and distribution of all monthly financial reports and analysis.\nAssists in the preparation of Statutory Surveys and special statistical reports as assigned by the Director of Finance/Assistant Director of Finance.\nEnsures all journals and related financial reports are properly filed for future reference.\nAssists in implementing and streamlining the internal control procedures covering all activities of the hotel.\nResponds to the queries and provide support details regarding financial statements to Head of Divisions and Departments.\nMaximises employee productivity through the use of multi-skilling, multi-tasking and flexible scheduling to meet the financial goals of the business as well as the expectations of the guests.Financial (continued)Directs employees to ensure productivity meets standards given in accordance with Hyatt Design Standards and Criteria and the Hyatt International Finance Operations Manual.\nFocuses attention on improving productivity levels and the need to prudently manage utility/payroll costs within acceptable guidelines ensuring optimum deployment and energy efficiency of all equipment.\nEnsures new technology and equipment are embraced, improving productivity whilst taking work out of the system.\nEnsures that all hotel, company and local rules, policies and regulations relating to financial record keeping, money handling and licensing are adhered to, including the timely and accurate reporting of financial information.PersonnelDevelops Accounting employees to work following the operational, financial, administrative philosophies.\nThrough hands-on management, supervises closely all Accounting employees in the performance of their duties in accordance with policies and procedures and applicable laws.\nDelegates appropriately, duties and responsibilities to equipped and resourced employees, nurturing and developing them whilst ensuring standards of operation and safety are maintained.\nInstils the Training philosophies of the company and work closely with the Training Manager developing Departmental Trainers, ensuring that all Managers and Supervisors take an active role in the training and development of employees.\nDevelops and assists with training activities focused on improving skills and knowledge.\nEnsures employees have a complete understanding of rules and regulations, and that behaviour complies.\nMonitors employee morale and provides mechanisms for performance feedback and development.\nConducts annual Performance Development Discussions with employees, supports them in their professional development goals.\nEffectively communicates guiding principles and core values to all levels of employees.Other DutiesEnsures high standards of personal presentation and grooming.\nExercises responsible behaviour at all times and positively representing the hotel and Hyatt International.\nReads the hotel's Employee Handbook and have an understanding of and adhere to the hotel's rules and regulations and in particular, the policies and procedures relating to fire, hygiene, health and safety.Attends training sessions and meetings as and when required.Carries out any other reasonable duties and responsibilities as assignedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}