{"Job ID": "69866637", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.POSITION TITLE:  Senior Software EngineerREPORTING TO:  ManagerREPORTING LOCATION:  Noida                 WORKING LOCATION:  NoidaSUMMARY OF POSITION AND OBJECTIVES:Eurofins Genomics Blue Heron is looking to hire an experienced senior software engineer to maintain and upgrade all existing software and assist in developing new software to power our GeneMaker® multi-technology informatics platform. The senior software engineer’s responsibilities include recommending adjustments to resolve software issues, improving the functionality of existing software, and ensuring that the design, application, and maintenance of software meets the quality standards of the company. They should also be able to mentor, guide, and train other engineers.This position requires: A five-day work week that includes Saturday and Sunday to respond to informatics problems encountered by the manufacturing staff; participation in the software development team for Blue Heron; contributing to the designing, development, deployment activities of this team; working closely with customers and co-workers at a local level.  We expect this individual to contribute significantly to the development of the GeneMaker informatics platform by fulfilling the business requirements and utilizing past experience and platform expertise to help Blue Heron staff develop a class-leading solution for the business.POSITION & OBJECTIVES:Participate in software, bioinformatics, and robotics development, testing, maintenance and documentation with Java, JSP, JDBC, Perl, and Oracle\nProblem response\nDevelopment of database reports and tools\nParticipate in mentoring, guiding, and training other engineers\nCollaboration with other team members to ensure high quality of delivered solutions\nUse of best practices and high quality standards\nPerformance of other related duties as assignedEXPERIENCE REQUIRED:4+ years’ experience in hands-on software development\nExperience in the development and support of internal product-level software systems\nExperience building software products using in a multiplatform, multi-language, networked environment; Windows and Linux/Unix operating systems and shells\nExperience with Oracle SQL development\nExperience with version control system such as CVS or Subversion\nProven experience in software development methodologies\nProven ability to multi-taskRESPONSIBILITIES:Interacting with users and other BHB staff to define requirements and design parameters\nDesigning, coding, testing, and debugging software\nInvestigating software-related problem-reports and making necessary adjustments to ensure optimal software behavior\nImproving the performance of existing software\nProviding training to other engineers\nImplementing software development best practices\nInteracting with local staff to define and execute projects\nSupervising software engineersSKILLS REQUIRED:Strong skills coding, debugging, and testing Java applications, servlets, Webapps\nStrong skills coding, debugging, and testing JSP/HTML, SQL, shell scripts, Perl\nProficiency in using Linux shells, both command-line and scripts\nAbility to interact with users to extract meaningful guidance for software development, testing, and debugging projects\nStrong analytical skills\nExcellent organizational and leadership skills\nExcellent communication, and interpersonal skills\nUnderstanding of Product Development Lifecycle and software development methodologiesPROFICIENCY IN USE OF TOOLS / IDE:Eclipse IDE\nOracle SQL Developer or equivalent\nConcurrent Version System (CVS) or Subversion source code controlBachelor’s degree in computer engineering, computer science or related fieldJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Noida, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}