{
    "Job ID": "69866767",
    "Description": "FireTV Chennai is looking for passionate, hard-working, and talented software engineers who has experience in building innovative, mission critical, high volume cloud systems that powers our world-class content forward experience for millions of customers. As a software engineer in this team, you are expected to design and implement micro cloud services and APIs serving ultra-high volume transactions. Your cloud services and API’s have direct impact to customer experience, be a base for building varied features for FireTV. You identify betterment's to current design, propose improvements, identify impact to dependent systems, implement and rollout changes successfully. You continuously look for improvements that excite our customers, show bias for action and get it done.\nKey job responsibilities\nAs a Software Engineer, you own micro services and components, adopt to latest technologies, build quality guard rails, alarms and monitors. You should be able to take short term and long term trade-off by working backwards on customer experience. You will be the operational experience champion for your team, identify areas to reduce operational overhead, optimize the cost, build best practices for the team. You raises the quality bar for the team with your every code and design artifact. You will help onboard new engineers and mentor them in the role.\nAbout the team\nAmazon FireTV products are revolutionary consumer devices that have become the #1 best-selling Amazon products. They are among the most innovative and fastest growing businesses at both Amazon and the entire consumer electronics industry. We are looking for talented software engineers to build a new website based on cutting edge technologies such as React, GraphQL and AWS backend stack. The website you build is the foundation for FireTV's operational businesses. It generates critical data to power FireTV's video catalog and discovery experiences. You will work with product and other technology teams to explore solutions to improve FireTV's key business metrics.\nWe are open to hiring candidates to work out of one of the following locations:\nChennai, TN, IND\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}