{
    "Job ID": "69860418",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organizations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an experienced professional to join our team in the role of Delivery HeadIn this role, you will:Coordinate with Product Management, UX and architects to come up with high level design for the features, estimates, plan, and timelines for the delivery.\nThis is a hands-on role that involves understanding the product at a detailed level and contributing to design discussions and code reviews.\nAccountable to formulate the technology roadmap for product, technology strategy, target operating model & change lifecycle.\nDefine release scope in conjunction with product management, own end-to-end delivery of new features and service releases, often in parallel.\nHelp with ongoing escalations as required Establish lean engineering practices such as CI/CD, TDD,\nEffective code reviews, etc.\nManage transformation of project management activities Monitoring and reporting of key project deliverables/risk/issues building Dashboard and program level metrics for Senior management.\nDefining the team structure and hiring and strengthening the team to support product road map and company vision.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}