{
    "Job ID": "69862002",
    "Description": "Here at SmallWorld Financial Services, we know how important it is to be able to support friends and family from abroad. Put simply, we believe that the more people we can help transfer money to overseas family, friends and businesses, the smaller the world becomes.Our employees are as diverse as our customer base and we value the sharing of skillsets and cultures that come with a truly international company present in several countries.SmallWorld is one of the largest money transfer companies in the world. We have a network of over 360,000 pick-up locations and a global team of over 1000 people who are responsible for over 15 million worldwide transactions each year.Are you passionate about working for a global company that celebrates differences? Do you want to empower people and families to support each other regardless of distance?Then join us! Let’s make this big world into SmallWorld.RDM - Release Deployment Manager\n● Experienced RDM Engineer to work in a high level infrastructure and delivery automation environment and\nin a product-oriented organization.\nWhat you will be doing:\n● Coordinate and communicate the release planification and support the deployment team on the\nRDM process\n● Optimize the process by implementing new automation solutions\n● Plan, coordinate and control the ordinary, weekly, and emergency software deployments into\nproduction and infrastructure changes minimizing the impact to the business operations ensuring\navailability and performance.\n● Evangelize the teams in the RDM methodology and processes\n● Provide support to stakeholder in the path to production\n● Working closely with the stakeholders and developers to understand risk, impact and benefits of\npromoting a new version into production.What we expect from you:\n● +2 years of experience in RDM positions\n● Experience working with ITIL Foundations and best practices from Change & Release\nManagement aligned.\n● +2 year of experience in automation in some of the following technologies: Java, JavaScript,\nPython, C#, REST-Assured, Jenkins, CircleCI, GitHub Actions, similars\n● Experience working with APIs, Network, Firewall and cloud services\n● Experience with CVS mainly GIT/GITHUB\n● Experience with Task management/Tracking tools: Jira\n● Experience with Google Suite and Confluence\n● Excellent English communication skills, speaking, and writing\n● Self-taught and highly perfectionistProfile:\n● Passionate, persistent, creative, you find solutions to difficult problems and clever ways to work\naround them when necessary\n● A progressive, willing to challenge the status quo when it is appropriate to do so\n● Strong interest in taking the initiative to show others how to do things, skill at coaching, teaching,\nadvising, and helping others in developing their skills and abilities\n● A learner, curious and driven to expand your expertise\n● Self-motivated in order to achieve assigned objectives with minimal supervision\n● Honest, direct, responsible, and transparent\n● Communication abilities to work with co-workers remotelyIt will also be highly valued if:\n● You have relevant certifications like ITIL\n● You have DevOps background\n● You have courses and certifications on any programming language\n● You have experience using Cloud services like AWS services: CloudWatch, EC2, S3 and others\n● Experience Monitoring Security and Performance of the platformsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}