{"Job ID": "69867135", "Description": "The Last Mile Analytics & Quality Team in Hyderabad is looking for Transportation Quality Specialist who will act as first level support for driver and delivery related programs\nYour solutions will impact our customers directly! This job requires you to constantly hit the ground running and your ability to learn quickly and work on disparate and overlapping tasks will define your success. High Impact production issues often require coordination between multiple Development, Operations and IT Support groups, so you get to experience a breadth of impact with various groups.\n\n\nThe ideal candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, able to juggle multiple tasks at once, able to work independently and can maintain professionalism under pressure. Must be able to identify problems before they happen and implement solutions that detect and prevent outages. You must be able to make sound judgments, work to improve the customer experience, and get the right things done.\n\nMajor Responsibilities:\n\n- Fluency in German. Required B2.2 proficiency.\n- Analyze basic case level inputs and identify predictors / causes of business related problems and improve delivery / customer experience by case-level corrections\n\n- Identify and uncover areas of opportunity and highlight the same to managers.\n\n- Collaborate with intra-space multiple resources as per need and carry out basic needed analyses to help ensure efficiency and effectiveness of programs.\n\n- Do root-cause analyses (when needed) within the space subject to availability of data\n\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- Bachelor’s degree\n- Fluency in German\n- 10-24 months of work experience.\n- Good communication skills - Trans Ops Specialist will be facilitating flow of information between external parties\n- Proficiency in Advanced Excel (pivot tables, vlookups)\n- Demonstrated ability to work in a team in a very dynamic environment\n*Logistics background and lean/six sigma training is a plus\n* Proficient in SQLJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}