{"Job ID": "69866714", "Description": "Work from home with Amazon Customer Service!Role: Shipping and Delivery Support Associate\nJob Type: Insert contract details, i.e. full-time/part-time + length of contract\nLocation: Work from home in Kolkata, IndiaOur mission at Amazon is to be Earth’s most customer-centric company, and our award-winning Shipping and Delivery Support (SDS) team is a key part of achieving that goal. Doing our best for our customers is where we get our energy, and that’s why you’ll find we approach things differently here. We won’t ask you to read from a script or learn dialogue by heart. Instead we’ll provide you with the training you need to problem solve for our customers. You’ll bring your unique personality to every conversation to provide the exceptional support experience our customers love.What will you do as an SDS Associate?As an Amazon SDS Associate, you have a very clear purpose: to ensure successful deliveries by supporting customers, drivers, shippers, and Delivery Service Partners. You’ll be the first point of contact for our customers by answering their requests through phone, chat, and/or email, and use a variety of tools to navigate and review solutions in real-time, facilitate the flow of information between delivery stakeholders, and communicate effectively with our customers. You will also be responsible for gathering intelligence to prevent any potential issues that may impact customer experience and delivery performance.What qualifications do we need from you?Minimum age: 18 years old\nHave the right to work in India\nStrong communication skills in English & Hindi or English & Bengali (both written and oral fluency)\nExperience working with a computer\nWillingness and ability to work in rotating shifts (i.e. early, late, overnight, weekend, and overtime as required)\nYou'll need a quiet, distraction free work space (dedicated office space with a desk and chair)\nFrom a technical perspective, a minimum broadband connection of 20MB download speed and 8MP upload speed using a hard-wire ethernet internet connection (no WIFI).What strengths will you bring?Hard-working, articulate, and detail-oriented\nFriendly and customer-focused in every situation\nAbility to learn quickly and embrace change\nComfortable multi-tasking in a high-energy environment.If this role sounds like it’s for you, then click on the link below to start the application process!You’ll need to allow 3 – 4 hours to complete the full application, including assessments which will evaluate your suitability for the role. You will have the option to save your application during the process and return to it if necessary. We recommend using a laptop/desktop computer in order to get the best experience.If successful, we will contact you about next steps!Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}