{
    "Job ID": "69865567",
    "Description": "AtkinsRealis business is one of the largest multidisciplinary, multi sector engineering design consultancies in the world.As one of the world’s most respected design, engineering and project management consultancies with a leading track record in the defence sector, Atkins are ideally placed to respond to this market. We have a broad establishment and proud, 50 year history throughout the Middle East region.We provide a full range of design, engineering and project management services for buildings, transportation and other infrastructure programmes.We also have an extensive depth of geographic exposure across 50 countries and breadth of 53,000 experts. As one of the largest engineering consultants, we have access to 17,000 staff in the Middle East making us one of the largest multidisciplinary consultancies in the regionSustainability Engineer –Qualifications:To be successful in this dynamic opportunity, we envision that your career journey to date will include 10 years' experience partnered with a B.Eng/B.Tech Degree in relevant field.ESTIDAMA PQP (PBRS & PCRS) & LEED AP are mandatory requirements - WELL AP (either obtained or in process) would also be highly desirable.Potential candidates will have the below job specific competencies:PQP & LEED AP with previous proven experience delivering Construction stage of projects within Dubai & Abu Dhabi.\nFull & in depth knowledge of LEED, Estidama certification process and required documentation. Have worked on projects and been responsible for obtainng Estidama and LEED Certification at multiple levels.\nHave specific knowledge of other green building certification programs such as MOSTADAM, GSAS, CEEQUAL etc..\nHave awareness of WELL Certification in terms of requirements, processes and submission would be a distinct advantage.\nExcellent skills in narrative writing for supporting highly rated sustainability projects.\nPossess the ability to address challenges and devise effective solutions in a timely manner.Key ResponsibilitiesEffectively communicate sustainability certification program and Client’s sustainability requirements and progress to project teams.\nReview necessary design drawings, materials requirement, specifications, and contractual sustainability documents of the project.\nPrepare the necessary documentation required to maintain the sustainability KPIs.\nReview and comment on subcontractor’s pre qualifications and specialist credentials.\nReview Sustainability plans, procedures, reporting and monitoring trackers & relevant reports submitted by contractor to confirm Contractor’s understanding to sustainability specifications and KPIs.\nCoordinate with & support contractors including MEP/Civil engineers;\nReview technical material submittals, shop drawings, calculations and reports submitted by the Contractor ensuring compliance to Sustainability requirements.\nLiaise with the contractor’s Sustainability Manager/Engineer for day-to-day sustainability issues.\nConduct and co-ordinate dedicated site sustainability meetings in conjunction with RE relevant team members and prepare MOM.\nReview Contractor’s Monthly sustainability progress reports.\nReport sustainability and environmental performance to clients.\nReview and comment on alternate sustainability proposals submitted by contractors.\nLiaise with and review green rating system submission with authorities and prepare all required documentation.\nSchedule and conduct timely Audits mandated by the regulatory bodies and prepare audit reports for authority’s review and approval.\nConduct regular Site visit and Sustainability inspection and audit on contractors, subcontractors, and suppliers.\nPreparation of Monthly reports in coordination with all disciplines.\nAdhere to QA/QC system implemented on site and ensure the compliance with Quality manual.\nProvide oversight to the Contractor’s CEMP and together with undertaking site audits, reporting non-compliance incidents (NCI).\nEnsure the contractor performing sustainability inspections, sampling, and testing of materials in accordance with the specified standards, guideline and requirements as required by the project.Raise non-conformance notices (NCNs)/reports; site inspection notices (SINs) identify deficiencies in conjunction with the RE.\nReview the corrective / preventative actions proposed by the contractor, respond/follow ups and close out procedure.Inspect the on-site and off-site materials to be used in the project, organize/witness field and laboratory Tests, conducted by third parties on construction materials to ascertain their compliance with the specification (as required).\nDevelop technical and non-technical reports as per scopes of assigned projects and ensure high quality of deliverables.\nSupport the company in potential business growth by promoting Atkins services and networking with new potential clients and contacts.\nCoaching of junior staff and support sustainability training and awareness across all disciplines.\nConduct product and technology research related to sustainability.The above job description is a general outline of the responsibilities and qualifications typically associated with this role. Actual responsibilities and qualifications may vary based on the specific project and the evolving needs of the company.Equal Opportunities StatementAtkinsRealis is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}