{
    "Job ID": "69866340",
    "Description": "Dentsu Media is the largest area of specialism within the dentsu network. It is brought to markets globally, through three award-winning agency brands: Carat, iProspect and dentsu X. All three are underpinned by a scaled network offering of talent, capabilities, and services to support, grow and transform the world’s leading advertisers. Operating across more than 145 countries, dentsu Media is trusted by leading brands across a broad range of sectors, from pioneering technology to cutting-edge fashion. Dentsu leverages technology, creativity, and in-depth data analytics to drive superior results that amplify its clients' brands. Dentsu Media is transforming advertising as a force forgrowth, a force for good and has become the destination for employees to cultivate meaningful careers and for brands to accelerate previously unseen, sustainable growth.Roles & Responsibilities• 5+ years of experience in developing and managing dashboard in BI Platforms (Tableau, Power BI, Datorama, Data Studio) as per the requirement.• Responsible for maximum utilization of BI to provide actionable insights.• Understanding on Digital marketing KIP’s and business objectives.• Implement Data analysis methodologies.• Monitor analytics and metrics results.• Creating/maintaining/optimizing client data warehouse.• Running complex reports.• Adopt to new technologies and implementing those techniquesMust have Skills:• Advanced knowledge of Power BI/Tableau/Datorama, RStudio (At least Strong in one tool)• Expertise in Project Management, Data modelling, Data cleaning and Data preparation and data warehousing concepts.• Experience in Python, R or any Big data or cloud technology/Platform.• Must have been on a client facing role with regular meetings & catchups.• Should have worked with multiple cross functional external & internal groups.• Strong interpersonal and communication skills and ability to communicate with cross-functional stakeholders• Ability to learn and respond quickly to the fast-changing business environment.• Ability to multitask and excellent interpersonal skills• Ability to interpret and explain model predictions and insights to varied audiences.Good to have Skills:• Design and create data visualizations (reports and dashboards) as required to support business needs .Directly communicates with clients and gather project requirement.• Analyze, define requirements, develop and create documentation for dashboards• Champion dashboard quality, consistency, usability and reliability by documenting and applying best practices to design and development• Communicate project status updates and recommendations• Define, execute and interpret SQL queries• Establish standards and best practices for requesting, prioritizing and developing dashboarding.Education & Training: Any Degree with Excellent communication skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}