{"Job ID": "69867063", "Description": "Job DescriptionAre You Ready to Make It Happen at Mondelēz International?Join our Mission to Lead the Future of Snacking. Make It With Pride.Together with analytics team leaders you will support our business with excellent data models to uncover trends that can drive long-term business results.How you will contributeYou will: Work in close partnership with the business leadership team to execute the analytics agenda\nIdentify and incubate best-in-class external partners to drive delivery on strategic projects\nDevelop custom models/algorithms to uncover signals/patterns and trends to drive long-term business performance\nExecute the business analytics program agenda using a methodical approach that conveys to stakeholders what business analytics will deliverWhat you will bringA desire to drive your future and accelerate your career and the following experience and knowledge:Using data analysis to make recommendations to senior leaders\nTechnical experience in roles in best-in-class analytics practices\nExperience deploying new analytical approaches in a complex and highly matrixed organization\nSavvy in usage of the analytics techniques to create business impactsMore about this roleAs a Product Analyst, you will play a vital role in supporting the data and analytics initiatives within the Research and Development (R&D) function of our company.This position offers an exciting opportunity to work in a dynamic environment and drive innovation through data analysis.What you need to know about this position:Your primary responsibility will be to leverage your analytical skills and technical expertise to extract valuable insights from our data, ultimately contributing to the development and enhancement of our products.You will collaborate closely with cross-functional teams, including R&D, marketing, supply chain, and finance, to gather and analyze data, identify trends, translate findings into actionable strategies and ensure data-driven decision-makingWhat extra ingredients you will bring:Understands the business process area, business needs and challenges within existing solutions.\nCreate user-oriented data and analytics requirements and specifications and as required, the testing of products designed to meet those requirements\nChampions the use of Agile practices throughout a solution lifecycle (from proof of concept to pilot) as well as project management practices to scale solutions\nOwn the relationship with the external partners. Enabling vendors to interpret & translate requirements during design, delivering the product solutions ensuring that solutions comply to Mondelēz standards and ensuring successful transition of solution for business-as-usual supportEducation / Certifications:Bachelor’s degree: IT or related field. Certification in data analysis or related fields (e.g., Certified Analytics Professional) is a plusJob specific requirements:7+ years relevant experience ideally in CPG Industry\nExcellent communication skills to convey complex technical concepts clearly and concisely to both technical and non-technical stakeholders.\nStrong Stakeholder management and ability to influence positively in decision making\nBusiness acumen / Team Leadership skills (Inclusion)\nProven experience applying business understanding and acumen to deliver digital capabilities or solutions\nDrive for Results/ Problem Solving\nConceptual and analytic skills\nExperience in Agile techniques & frameworks\nDemonstrated expertise in both Google Cloud Platform (GCP) and Microsoft Azure\nExperience & Knowledge of big data solutions like Google BigQuery, Azure Databricks\nProficiency in data analysis tools and programming languages such as Python, or SQL\nProficiency in data visualization tools i.e., Tableau, Power BI to analyze data, create visualizations, and generate actionable insights\nStay up to date with the latest developments and services in both GCP and Azure related to data and analytics\nFamiliarity with version control systems (e.g., Git) and DevOps practices in the context of cloud-based data projects\nThe Data & Analytics R&D Product Analysts is a member of the Mondelez Digital Services (MDS) D&A team supporting R&D to deliver business value.\nData Collection and Analysis:\nCollect, clean, and analyze product-related data from various sources, such as research studies, consumer feedback, market trends, and internal databases.\nIdentify Data availability & challenge. Determine approach to data ingestion, transformation, and modeling for analytical products.\nInterpret data analysis results and present actionable insights to stakeholders\nCross-functional Collaboration:\nCollaborate with R&D, Marketing, Sales, and other teams to gather requirements and support product development initiatives with data-driven insights.\nData Management and Visualization:\nDevelop and maintain data repositories, databases, and dashboards to store, organize, and present product-related data.\nCreate visually appealing reports, charts, and presentations to effectively communicate insights to stakeholders.\nData Governance and Quality Assurance:\nEnsure data integrity, accuracy, and consistency by implementing data governance practices and performing quality assurance checks on data sets.\nCollaborate with IT and data teams to identify and resolve data-related issues, streamline data processes, and enhance data accessibility for analytical purposesBusiness Unit SummaryOreobelVitaLUCadbury Dairy MilkMilkaTobleroneSour Patch KidsTridentthan 80 countriesover 150 countriesMondelēz International is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation or preference, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.Job TypeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}