{
    "Job ID": "69867239",
    "Description": "A luxury hospitality brand for modern travellers, Anantara connects guests to genuine places, people and stories through personal experiences and providing heartfelt hospitality in the world’s most exciting destinations. From pristine islands and tropical beaches to cosmopolitan cities, tranquil deserts and lush jungles, Anantara welcomes guests for journeys rich in discovery.As Junior Sous Chef you will be second in command and report directly to the Executive Chef. As such you must be intimately familiar with all the activities involved in kitchen operations and be prepared to step in and cover all eventualities if called upon. You will need to be able to prepare and cook a wide range of international dishes, including French, Italian, Asian and fusion cooking. The Sous Chef is also responsible for overseeing the kitchen team members, which will involve preparing, scheduling and delivering training, managing team member performance, ensuring that the kitchen safety standards are up to date and that team members are complying with health, safety and sanitation rules. Additionally you will help with menu planning, inventory control, and supply management.• College degree in Hotel Management or related culinary degree\n• At least 3 years of industry and culinary management experience & Banquets\n• Previous experience training team members in large quantity food preparation.\n• Excellent knowledge of quality food operations.\n• Passion for leadership and teamwork\n• Eye for detail to achieve operational excellence\n• Excellent guest service skillsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}