{
    "Job ID": "69867674",
    "Description": "Responsibilities/Competencies\nExperience in the design of process units, pipelines, utilities and offsite facilities at the conceptual, FEED, or detailed design stage of medium to large size projects.\nKnowledge of process engineering practices, economics principles, calculation methods, international standards, codes, specifications, and procedures.\nSound knowledge of basic engineering principles, P&ID/PFD development, hydraulic calculations, equipment sizing, safety devices\nUnderstanding of Process simulation methods (e.g. HYSYS, Pipenet)\nFamiliarity with key SA engineering standards and procedures\nAbility to handle responsibility and complete projects within schedule\nExperience with firewater demand calculations and equipment requirements, industrial drainage design and equipment, familiarity with the associated Saudi Aramco standards and NFPA requirements are desirableExperience/Education\nBachelor of Science in Chemical Engineering or related field\nMinimum 15 years of experience in Engineering companies for design of upstream Oil and Gas Plant facilities\nExpert knowledge of HYSYS simulation\nMay be required to lead a team of up to 3 Process Engineers and related discipline engineers and designers on specific projects\nPerform process engineering calculations, including heat and material balances, equipment sizing, relief devices calculations, hydraulics calculations, etc\nScoping of projects, including process deliverables\nDevelop process deliverables (PFDs, P&IDs, Design Basis, Process Narratives, Process Calculations, Equipment Specification documents, etc)\nDevelop process engineering work plans\nDevelop basis of design documents\nEstimate work-hours\nParticipate in technical presentations to Clients and their representatives as required\nParticipate in technical reviews, and HAZOPsPetroplan is the trusted, specialist global Talent Solutions partner of choice for employers and professionals in the Energy sector. Since 1976, Petroplan has been here to help people like you make the most of the opportunities available and find the best fit for you as an individual.Over 10,000 placements in more than 55 countries for over 550 clients across 65 disciplines.In an industry where skilled and experienced professionals are increasingly sought after resource, we appreciate the true value of what you have to offer. What's more, we understand that different things are important to different people in today's world of work - it's about making exactly the right connections for you as an individual.Our reputation for contractor and candidate care, understanding what makes you tick, and finding you the best match is second-to-none. We understand the industry inside-out and seek to understand YOU and your motivations in the same way. We take the time to evaluate your individual strengths, understand the most important things to you, and establish exactly what you're looking for from your next role.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Khobar, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}