{
    "Job ID": "69867187",
    "Description": "Who We Are: At Huda Beauty, our Vision is to lead in creating a democratized beauty industry where power is given back to people to define, create, and enjoy beauty for themselves! Launched by award-winning beauty powerhouse Huda Kattan in 2013, Huda Beauty is one of the world’s fastest growing beauty brands. As a company, we are fueled by purpose which allows us to approach things differently so that we can create products, content, and a community like no other. A lot has changed since our launch in 2013, but something that will forever remain at the core of Huda Beauty is our focus on business excellence and our unwavering passion for kindness!Summary: Huda Beauty is seeking an analytical and results-driven Product Marketing Manager for Kayali to join our team. This role will drive and support the overall brand product marketing strategy for Kayali in collaboration with the Brand Director, he/she will support the overall product marketing positioning and communications strategy, driving forward strategic objectives and business performance. This role is a key liaison between all departments to ensure a cohesive and aligned Kayali product marketing strategy.Essential Duties and Responsibilities:Pricing & Competition - ownership of the global competitor pricing analysis, ensuring we are positioned suitably and sustainably for all new launches. Working closely with commercial teams to ensure full alignment with the global pricing strategy and all retail pricing documents are up to date.New Product Development (NPD) COGS & Margin – manage and own the Product Development Dashboards. Work collaboratively with Supply Chain and Product Development team to ensure all Product Development Dashboards are always up to date with the latest COGS and ensure that the new products that are launching have a healthy margin and meet targets.Kits Strategy – Lead the global kit strategy, workings, and SRP’s. Manage Kits Product Development Dashboards in collaboration with Supply Chain to ensure COGs and margins are healthy.Shop Exclusive & Merchandise Strategy – Competitor pricing analysis, ensuring we are positioned correctly for all Shop Exclusives and Merchandising. Working with the Product Development and E-commerce team to establish SRPs and ensure COGS and margins are healthy.New launch fact sheet & Toolkit / claims management – Ownership of the Product Marketing section of the new launch fact sheets and tool kits, and full claims management of newness.Reporting - Consolidate post-launch analysis for all key launches, core repromoted product (Quantify Size of Prize), and overall kits success and cascade to the teams, with learnings for optimization.Forecasting & Processing – ensure forecast accuracy for demand for heroes and sub-heroes by pulling together suggested forecast quantities based on competitor analysis and NPD (new product development) insights for all new products.Remain relentlessly up to date on emerging and future trends - across all relevant industries to identify and grow business opportunities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}