{
    "Job ID": "69868155",
    "Description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (COVID-19), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have.Some careers open more doors than others.If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.We are currently seeking an experienced professional to join the Mail Receiving Unit in Channel Services: Operations team.Principal ResponsibilitiesSupport all operational related activities pertaining to Liability and credit card statements by physical and emailing mode. This comprises, liaising with Print as well as Delivery Partners for E2E tracking of the deliverables.\nManage query resolutions and other requests received from business for the said deliverables.\nSupport control testing activities (Helios) which comprises of monthly reporting, evidencing basis the submission and activities done by the vendor. Moreover, conduct BCP testing annually as part of Business Continuity Plan.\nMaintain & monitor inventories for Liability and Credit Card Statements related stationery and see to the procurement of the required the stationery in a  timely manner to avoid any stock-shortage situation.\nExtend support to multiple LoB’s (WPB / WSP) for various ad-hoc request (i.e., may be due regulatory, re-engineering or new product launch).\nManage vendor invoices for the activities listed above.\nManage MRV desk as required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}