{"Job ID": "69869930", "Description": "Job DescriptionLiaise with healthcare professionals and work strategically and operationally to increase the awareness and use of a company’s pharmaceutical and medical products in settings such as Hospitals and theatres with HCPs.\nWork in the settings of private and government hospitals.\nCall on specialists and other core functions that add value and service to the entire medical account.This position will be required to adhere to all relevant requirements, policies, procedures and legal regulations pertaining to health, safety, environment and quality, as well as finance, human resources, and any other regulations as required by the company and relevant to the level of the role and responsibilities of the function.\nCore Responsibilities:\n• Arranging appointments with doctors, pharmacists, hospitals and theatre medical teams; \n• Making presentations to doctors ,medical personal within the specific target reach for this portfolio; \n• Organizing continued medical education (CME) for doctors and other medical staff;\n• Building and maintaining positive working relationships with medical staff and supporting administration staff\n• Align with the marketing strategy and work closely with the SM, peers and all company staff.\n• Responsible for achieving direct sales of products in order to meet individual/team targets and the organization's business objectives; \n• Working the area sales team and discussing future targets with the sales manager. \n• Regularly attending company meetings, technical data presentations and briefings; \n• Working with team members to plan how to approach contacts and creating effective business plans for achieving sales in a particular area.Qualifications:Minimum of 3 years of professional medical representative experience\nDiabetes, Endocrine therapy area background (Preferable)\nDiverse experience government and private sector preferred\nExcellent communication skills\nStrong business acumen and result orientation\nExcellent teamwork ability\nVery Good command of English languageWho we are … We are known as Merck & Co., Inc., Rahway, New Jersey, USA in the United States and Canada and MSD everywhere else. For more than a century, we have been inventing for life, bringing forward medicines and vaccines for many of the world's most challenging diseases. Today, our company continues to be at the forefront of research to deliver innovative health solutions and advance the prevention and treatment of diseases that threaten people and animals around the world.What we look for … Imagine getting up in the morning for a job as important as helping to save and improve lives around the world. Here, you have that opportunity. You can put your empathy, creativity, digital mastery, or scientific genius to work in collaboration with a diverse group of colleagues who pursue and bring hope to countless people who are battling some of the most challenging diseases of our time. Our team is constantly evolving, so if you are among the intellectually curious, join us—and start making your impact today.Current Employees apply HERECurrent Contingent Workers apply HERESearch Firm Representatives Please Read Carefully \nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company.  No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails. Employee Status:Relocation:VISA Sponsorship:Travel Requirements:Flexible Work Arrangements:Shift:Valid Driving License:Hazardous Material(s):Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kuwait", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}