{"Job ID": "69867258", "Description": "About Us:We are a luxury jewelry global powerhouse, with over 120 years of legacy and 3 design studios catering to retailers globally, along with building human-centric brands Her Story and Unsaid for consumers. Our aim is to make jewelry more relevant to the evolving new customer, with superior craftsmanship and stories told in design. We do this with a deep knowledge of our consumers, centering everything we do, from in-sighting to creation, around them. Helping create new desires in the world of jewelry.At Walking Tree, we are a team of inspired professionals who mine insights and build on unique and innovative ideas together, to form a disruptive and forward-thinking jewelry powerhouse.For us, our people come first. We are sensitive to the needs of those who make us who we are. We aspire to create simply joyful workspaces that inspire creativity and collaboration. Pooling from our years of expertise and a core value system in place, we ensure that every Walking Tree workspace is infused with infectious energy, resulting in a buzzing creative flow.Browse through below website link to know more about us:https://walkingtree.co/https://herstoryjewels.com/https://unsaid.com/Designation: Export-Import AssociateReporting:Company: Walking Tree Ventures Pvt LtdYears of Experience Required: 4+ yearsRole Summary:We are seeking a dedicated and detail-oriented Export-Import Associate to join our team at our jewelry company located in SEEPZ, Mumbai. The successful candidate will be responsible for various aspects of export and import operations, ensuring the smooth flow of materials and products in compliance with relevant regulations. If you have a strong understanding of export-import documentation and processes, we would like to hear from you.\nKey Responsibilities:\n1. Preparation of Export Documentation: Prepare and maintain all necessary export documentation in compliance with applicable laws and regulations.\n2. Raw Material Custom Matching in Gati: Coordinate and facilitate custom matching of raw materials through Gati, ensuring timely and accurate customs clearance.\n3. NSDL Entry: Handle NSDL (National Securities Depository Limited) entries for export-import transactions.\n4. Export Parcel Deposit in DGDC: Manage the deposit of export parcels in DGDC (Diamond and Gem Development Corporation) as required.\n5. Job Work Related Documentation: Ensure all documentation related to job work, including outsourcing and subcontracting, is accurately prepared and maintained.\n6. Inter-Unit Documentation: Collaborate with internal units to facilitate the smooth transfer of materials and products, maintaining proper documentation throughout the process.\n7. DTA Procurements: Oversee the documentation and logistics for procurement of materials for Domestic Tariff Area (DTA) use.\n8. Paperwork for In & Out through NSDL: Prepare necessary paperwork for all incoming and outgoing shipments processed through NSDL, considering the customs regulations specific to SEEPZ.\n9. LG Diamonds Examination and Clearance: Handle the examination and clearance of LG (Low-Value Goods) diamonds in compliance with customs and regulatory requirements.\n10. Consignment Re-Import: Manage the documentation and processes related to the re-import of consigned goods.\n11. Maintaining Records: Maintain meticulous records for all types of transactions, ensuring compliance and accuracy in record-keeping.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}