{
    "Job ID": "69866488",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Summary:\nWithin the Product Engineering (PE) division, the Enterprise Cloud Services (ECS) Delivery Technical Operations team runs the HANA Enterprise Cloud (HEC) and is responsible for OS, DB & SAP Apps (such as S/4 HANA) operations and support for our customers across multiple infrastructures - SAP DCs, AWS, Azure & GCP. We are looking for an IT Technology Associate Consultant who will be responsible for Database support and services along with running SAP’s backend technology including operations of state-of-the-art datacenters as well as client technology around the globe.The Role:\nAs an IT Technology Consultant, you will be responsible for:\n•    Handling Incidents, Alerts, and Service Requests\n•    Delivery and maintenance of complex SAP Landscapes by providing technical expertise and support.\n•    Planning, setup, implementation, and operation of SAP technologies, achieving ambitious SLAs\n•    Conceptual design, configuration, and administration of server landscapes with a focus on Linux Operating systems\n•    Troubleshooting and resolving any Database relevant issues that impact the customer’s business\n•    Managing daily operations ensuring high availability\n•    Proper documentation, definition of technical operational concepts and guidelines for the implemented SAP landscapes and roll out of this information/knowledge to the rest of the team\n•    Coordination with international teams in global projects/crisis handling/de-escalation initiatives\n•    While cross-trained in all topic areas (Basis/application, OS and Database), you’ll specialize in one of these areas and own incidents and service requests closure end-to-endRoles and Responsibilities:\n•    BE / BTech / MCA from a reputable institute\n•    3 to 5 years of work experience as Database Administrator in Global Operations team primarily on SAP HANA and ASE Database Platforms.\n•    3 to 5 years of work experience as a Database Administrator in a Global Operations team primarily on any of the most commercial RDBMS (Oracle, MS SQL Server, DB2 etc.)\n•    Exposure to the automation tools /scripting or processes.\n•    DB installations and upgrades, Planning, setup and implementation.\n•    DB Concept on Security, Backup and recovery strategies, System Copies, high availability and disaster recovery strategy, export-import and replication is a must.\n•    Organize / Structure day2day documentation.\n•    Willingness to take on-call duty/Weekend tasks.\n•    Basic knowledge of any Public Cloud Domains like Microsoft Azure, AWS and GCP\n•    Experience working in an international environment, being able to work effectively with international and virtual teams.\n•    Capable in technical documentation and creation of knowledge-based assets (KBAs).\n•    Ability to continuously acquire new knowledge proactively and independently.\n•    Analytical and solution-oriented thinking.\n•    Exposure to the ITIL framework\nPreferred:•    Working knowledge in UNIX/Linux environment, HANA DB and Sybase ASE databases\n•    Scripting experience - Any of Shell, Perl, Python, Go, or similar\n•    Working experience in Virtualization (XEN, VMware) \n•    Experience with OS monitoring\n•    Experience with at least one of the public cloud service providers (Microsoft Azure, Amazon Web Services, Google Cloud Platform)#SAPECSCareers #SAPInternalT2\n We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 378534  | Work Area: Information Technology  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}