{
    "Job ID": "69865741",
    "Description": "Aramco energizes the world economy.Aramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer. With our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.Headquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.We are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.We are seeking an experienced Mechanical Engineer to join the Sea Water Engineering Division of Sea Water Injection Department.The Sea Water Engineering Division is responsible for providing technical engineering support to achieve the mission of Sea Water Injection Department which to treat, transport and inject sea water into the oil reservoir for pressure maintenance and enhanced oil recovery.The mechanical engineer primary role is to provide technical engineering expertise to maintain and enhance the performance of the operating systems at Sea Water Treatment and Injection Plants including the fixed and rotating equipment. You will be required to perform the following:Provide day-to-day technical support to Operations and Maintenance to troubleshoot equipment related issues.\nDevelop and review the engineering design packages for any modifications for new or upgrade projects.\nUpdate and maintain engineering documentation and drawings.\nProvide analysis, evaluation and interpretation to support projects, processes and financial evaluations related to Saudi Aramco Capital Investment decisions.\nReview Scoping, Project Proposal, and detailed design packages for capital projects.        \nPerform technology deployment assessments and support implementations.      \nSupport startups and commissioning activities of new projects.As the successful candidate you will hold a Bachelor’s degree in Mechanical Engineering from a recognized and approved program. An advanced degree is preferred.You will have at least ten (10) years of experience as mechanical engineer in industrial facilities preferably in oil and gas, sea water treatment and desalination facilities.•     Detailed knowledge of industry standards and codes is a requirement to support the design reviews, and plant modifications.•     Experience in troubleshooting plant mechanical issues and rotating equipment failures including pumps, compressors, dehydration systems is required.•     Experienced with conducting risk assessments, PHAs and HAZOPs is required.•     Experience in preparing equipment specifications and datasheets is required.Working environmentOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.At Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.We have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}