{"Job ID": "69868568", "Description": "Assistant Branch Manager, HBME Oman - Omani NationalIf you’re looking for a role where you can continue to make an impression, take the next step at HSBC where your contributions will always be valued.Global Trade and Receivables Finance comprises over 4,500 people across more than 60 countries, helping suppliers and buyers with their export and import finance needs. Trade is where HSBC began in 1865, when we financed commerce between Europe, North America and AsiaWe are currently seeking ambitious individuals to join a new wholly owned branch of HSBC Bank Middle East Ltd. (HBME) which HSBC intends to establish in Oman, working together with other colleagues to define, manage and achieve business targets. The establishment of this Branch is subject to regulatory approvals and the issuance of a banking license.Role overview:To provide quality service to Customers for any queries relating to Trade transactions, general queries and any other support to enhance the overall customer experience as and when they visit the GTRF counters.To identify potential revenue opportunities for existing relationships by identifying cross-selling opportunities.Principal responsibilities:·Handle customers’ general and transaction-specific enquiries (e.g. status enquiries, document delivery status, etc.) when receiving/delivering documents/applications at the counters.·Instigate outbound calls to customers to provide as and when required. to assist with processing.·Identify opportunities to cross sell sending quality referrals to Sales teams·Take ownership of all enquiries following through to resolution ensuring that customers are kept updated at all times.·Adopt a proactive, flexible and quality-conscious approach to dealing with customer enquiries·Provide customers with information related to Trade products.·Receive Trade instructions from customers, once settled release documents to customer after checking the collection authority as per system.·Send the original requests and documents to Services team for processing.·Release Export DCs to customers as per laid down procedure.·Follow up with customers for collection of Export DCs and return docs and report the uncollected items to Services.·Carry out monthly balancing of physical import documents held at branch counter, with in the stipulated time.·Carry out scanning process in the branch where scanners are installed·Support the development of a cohesive team.·Complete transaction vetting/scanning in accordance with established procedures and standards escalating when necessary to the appropriate escalation points·Meet/exceed the objective targets on service quality, accuracy and productivityJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}