{
    "Job ID": "69869713",
    "Description": "Cyient is a global engineering and technology solutions company. As a Design, Build, and Maintain partner for leading organizations worldwide, we take solution ownership across the value chain to help clients focus on their core, innovate, and stay ahead of the curve. We leverage digital technologies, advanced analytics capabilities, and our domain knowledge and technical expertise, to solve complex business problems.With over 15,000 employees globally, we partner with clients to operate as part of their extended team in ways that best suit their organization’s culture and requirements. Our industry focus includes aerospace and defence, healthcare, telecommunications, rail transportation, semiconductor, geospatial, industrial, and energy.Job DescriptionResponsible for Hardware design in Analog/ Digital, Schematics design, Circuit design /analysis\nStrong Knowledge on power - DC- DC\nStrong knowledge in Communication Protocols - I2C, UART, SPI\nKnowledge in Circuit Design - Capture tool(Orcad)\nGood to have experience in Bluetooth, GSM, WIFi\nStrong analog circuit simulation skills using SPICE\nHands on Experience in Hardware Board design (Electrical/Electronic schematics Design)\nTo work on the Electronics board design and analysis having microcontroller, touch, analog, relay drive, LED drive, UART/SPI ports.\nGood knowledge of electronic circuit design using discrete semiconductors (BJT, MOSFET, Diodes)\nGood knowledge of electronic circuit design using signal chain building blocks like Op-AmpsSkills & ExperienceCyient is an Equal Opportunity Employer.Cyient recruits, employs, trains, compensates, and promotes regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, veteran status, and other protected status as required by applicable law. We are proud to be a diverse and inclusive company where our people can focus their whole self on solving problems that matter.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}