{
    "Job ID": "69869100",
    "Description": "Job DescriptionAbout Thermo Fisher ScientificThermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with revenues of $17 billion and 50,000 employees in 50 countries. Our mission is to enable our customers to make the world healthier, cleaner and safer. We help our customers accelerate life sciences research, solve complex analytical challenges, improve patient diagnostics and increase laboratory productivity. Our four premier brands - Life Technologies, Thermo Scientific, Fisher Scientific and Unity Lab Services - offer an unmatched combination of innovative technologies, purchasing convenience and comprehensive support.All of our employees share a common set of values - Integrity, Intensity, Innovation and Involvement. Our ability to grow year after year is driven by our ability to attract, develop and retain world-class people who will thrive in our environment and share in our desire to improve people by enabling our customers to make the world healthier, cleaner and safer.\nIf you share in our values and if you're looking for an employer who is strongly committed to developing talent and exciting achievement, come grow with us at Thermo Fisher Scientific.\nThermo Fisher Scientific is an Equal Employment Opportunity/ Affirmative Action employer and a VEVRAA Federal Contractor.ResponsibilitiesPosition Summary \n \nThe SAP ABAP Developer analyzes user requirements, procedures, and problems to automate processes or to improve existing systems. Provides technical knowledge, system design techniques, methodologies, tools, and standards used in the IT and business environment. As a key member of the SAP Core team, provide support to the business community for SAP in the ABAP Technical Development area.  This includes all new projects as well as production support across all functional areas within SAP. \nKey Duties and Responsibilities Provide programming knowledge in the analysis, design, and development of SAP reports, interfaces, conversions, business forms, and user exits\nDevelop and support interfaces to numerous legacy and third-party systems using a variety of techniques such as LSMW, BAPI, IDOC, RFC calls, BDC, and call transaction update methods\nFollow the IT SDLC process\nUtilization of debugging techniques\nWrite detailed user documentation of program functions\nCross team communication and collaboration\nParticipate in off-hours meetings\nEngage with other project personnel to ensure business application systems are developed in a way that aligns with architectural standards and established methodologies and practicesRequirements (Must Have)Bachelor’s Degree in Computer Science\nGood interpersonal and excellent documentation skills are a must\nDemonstrable ability to be flexible and work hard, both independently and in a team environment, in a high stress environment with changing priorities\nPro-active, helpful, ‘can-do’ attitude\nAbility to explain and champion technical concepts  \nExcellent customer service skills required\nStrong analytical skills required\nExcellent verbal and written communication skills in English and the ability to communicate optimally professionally with a diverse group, executives, managers, and domain experts\nSelf-managing and self-motivatingSoftware requirements SAP ECC 4.7 and 6.0\n0 to 4 years SAP ABAP development experience \nDemonstrated knowledge in the use of ABAP  \nDemonstrated knowledge of BADI’s, BAPI’s, LSMW, ALE, RFC calls, IDOC, BDC, business objects, classes and methods, Adobe Forms, Smartforms, SAPScripts, Data Dictionary, ALV\nDemonstrated knowledge of implicit and explicit enhancements, screen exits, and menu exits\nABAP debugging knowledge\nUnderstanding of several of the following modules: SD/SM, FI/CO, MM/PP, QMRequirements (Desired)Knowledge of Workflow is beneficial\nKnowledge of NetWeaver 7.0 experience is beneficial\nKnowledge of BI is beneficial\nExperience with other programming languages, such as Java, XML, is beneficial Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}