{"Job ID": "69866407", "Description": "About the teamThis role is a part of our Instructional Designing Team.  What you bring:Must have 4+ years of experience as a Instructional Designer.\nKnowledge of Instructional Design models and learning theories\nExperience in course development tools such as Articulate 360 (Storyline and RISE), Camtasia, Audacity, etc.\nVisual design skills and ability to storyboard/script writing.\nAbility to navigate Learning Management Systems.\nExcellent verbal and written communication skills.\nUnderstanding of LMS.What you will be doing:Conducts and analyzes training needs assessments following conventional instructional design methodologies.\nInterviews business owners, business analysts, system developers and other functional and technical personnel as part of the needs assessment.\nDevelops a solid understanding of FIS products to complete task analysis and determine training requirements.\nDetermines and documents appropriate instructional strategy and project scope based on a completed needs assessment.\nReviews and accurately interprets technical documentation including use case scenarios, functional specifications, system specifications and technical specifications as they pertain to course development.\nDesigns effective instructional materials, interactions, simulations and assessments to support the required instructional strategy.\nInteracts with product managers, subject-matter experts, application development teams, business analysts, management and others as needed to determine scope of a project and to ensure accuracy and timely delivery of training programs.Added bonus if you have:Knowledge of FIS’ products and services.\nKnowledge of financial services industry.\nKnowledge of basic financial analysis principles and ratios.What we offer you An exciting opportunity be a part of World’s Leading FinTech Product MNC.\nTo be a part of vibrant team and to build up a career on core banking/payments domain.\nCompetitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents.\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}