{
    "Job ID": "69861217",
    "Description": "Job NameCountry:City:Function:Reporting Line:Job type:Lead recruiter:About the roleYour OpportunityAbout You ResponsibilitiesWith our Consumer at the heart, your key focus will be to:QA / QC – Raw Materials and Packing Materials \nMicrobiological analysis of Raw materials and Finished Goods\nShelf-Life analysis \nLaboratory management\nImplementation of SPC/ SQC & Quality Index in Site\nEnsuring that out of spec materials is put on Quality hold. \nAnalysis of trends on CTQs of PM & RM on a monthly basis \nMonthly report of Lab activitiesSkills and ExperienceThe Skills & Experience needed to create your legacyKnowledge of QA / QC Systems\nExperience in operation of laboratory Equipment’s like HPLC, Densitometer etc.\nExperience in conducting Microbiological analysis \nExcellent in communicating Quality issues and KPI’s to functional and line Managers\nExcellent knowledge of excel & PowerPoint\nShould possess problem solving skillsPersonal QualitiesGlobally minded and able to demonstrate cross-cultural understanding and sensitivity. \nCreative, Adaptable & willing to learn new things\nTime Management & Multitasking \nShould have the ability to prioritize activities Our cultureWe share the passion and entrepreneurial flair of our founder and are guided by our three culture pillars - Fearless, Family and Founders, they inspire our Primos to be the best they can be and drive us forward in all we do. But what does this mean?·Being Fearless; means adopting an agile mindset, being comfortable trying new things and taking risks. We are empowered to question, challenge and innovate.·Family; We treat each other, and our communities, like Family. Always.·Founders; The spirit of entrepreneurship is at the heart of everything we do. We see the business as if it’s our own. We do the right thing for the business and we all take accountability for our work.When you join Bacardi, you become part of our family and gain more than just a job.Disclaimer: Bacardi is an equal opportunity employer that values workforce diversity. Diversity is core to our business: by embedding diversity into all aspects of our culture, we maximize the opportunity to achieve sustainable business success and growth. The duties and responsibilities described in the role profile might not be a comprehensive list. U.S. applicants have rights under Federal Employment Laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Nashik, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}