{
    "Job ID": "69867756",
    "Description": "Customer Service Manager-(2300016439)Job:Retail BankingPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:14/Sep/2023, 1:08:33 AMUnposting Date:05/Oct/2023, 10:59:00 PMJob SummaryNeed to Manage Certain Affluent Clients. Deepening of their wallet share and acquire too on a monthly basis. Ensure New Sales Revenue basis the scorecard through Third Party Products. Strictly adhere tosales processes , Client data confidentiality and governanace. ResponsibilitiesMaximize sales performance to achieve given revenue targets (self and branch) through liability products [Current /Savings /Term deposits], wealth management products and asset related products  (secured, unsecured)\nGenerate new business via sales promotions, out-marketing calls and presentations and in-branch contacts\nEnsure high level of customer service in the Branch. Manage difficult customer situations\nTake responsibility for general reconciliation and control activities.\nFind ways to improve operational efficiency and control costs to meet cost budgets\nBe multi-skilled to handle all kinds of transactions and services in the bankStrategyTake responsibility for general reconciliation and control activities.\nFind ways to improve operational efficiency and control costs to meet cost budgets\nBe multi-skilled to handle all kinds of transactions and services in the bankBusinessMaximize sales performance to achieve given revenue targets (self and branch) through liability products [Current /Savings /Term deposits], wealth management products and asset related products  (secured, unsecured)\nGenerate new business via sales promotions, out-marketing calls and presentations and in-branch contacts\nEnsure high level of customer service in the Branch. Manage difficult customer situationsProcessesEnsure compliance with internal and external guidelines and ensure minimal comments in audits and other inspections\nEnsure transactions are processed with a high level of accuracy and commitment in order to satisfy customer needs\nEnsure validity and completeness of transactions processed and ensure concessions relative to exchange rate, fees, charges etc. are authorized/ overridden by appropriate authoritiesPeople & TalentServicing primarily walk-in customers to fulfill the specific transactional requirements of the customer through high quality customer service, while increasing product penetration through cross sell and achieving allocated portfolio and revenue targetsRisk ManagementEnsure he/ she is fully aware of all the policies and procedures issued in relation to ORMA, Group Code of \nConduct, KYC/CDD/EDD & Money laundering prevention. He/she must ensure compliance with these policies and procedures on an ongoing basis. Any suspicious transaction must immediately be reported to the supervising officer.GovernanceMonitor customer satisfaction survey ratings, net promoter score or any other survey/ feedback ratings taken from customers and ensure continuous improvement if below bench-mark, sustain and better quality service.Regulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead to achieve the outcomes set out in the Bank’s Conduct PrinciplesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}