{"Job ID": "69867252", "Description": "About Prysmian GroupPrysmian Group is the world leader in the energy and telecom cable systems industry. Each year, the Group manufacturers thousands of miles of underground and submarine cables and systems for power transmission and distribution, as well as medium low voltage cables for the construction and infrastructure sectors. We also produce a comprehensive range of optical fibers, copper cables and connectivity for voice, video and data transmission for the telecommunication sector.We are almost 29.000 employees, across 52 countries. Everyone at Prysmian Group has the potential to make their mark; because whatever you do, wherever you are based, you will be part of a company that is helping transform the world around usPlease see our video by this link: Make Your MarkTeam Overview and Job responsibilitiesWe believe that today’s talents are tomorrow’s global leaders and we are eager to brighten your future! We have an exciting opportunity to  join our Treasury team in Mudanya.The Ideal Candidate will be responsible for the following processes and tasks: Taking a role in the operational processes of the Compensation and Benefits function such as:Following compensation and benefits processes\nPreparing HR Budget files and reports\nFollowing monthly HR reporting and preparing related HR reports;headcount- labour cost-absenteeism-annual leave-HR KPI etc.\nMaking data entry for salary surveys\nFollowing documentation preparation of audit processes\nSupporting monthly payroll process and completing&analyzing time management data\nPreparing employment contracts and employee files\nFollowing YES company share processWho are we looking for?The Ideal Candidate should have the following skills:BS degree in Economics, Business Administration, Industrial Engineering etc.\nAnalytical skills to make right conclusions;\nPreferably Good English language skills, both written and spoken;\nPlanning and organizational skills,\nAdvanced MS Office apps knowledge;\nSAP knowledge is an asset;\nGood command of Labor Law and SSI legislation,\nWillingness to take an extra mile when needed;If you are passionate and eager to learn, come and join us!Prysmian Group, as an Equal Opportunity Employer, aims to attract and recruit individuals with diverse backgrounds, skills and abilities, who will enhance the quality of service and contribute to the Group’s success. Prysmian Group is committed to the development of an organization that prioritizes talent, where people feel respected, appreciated and free to fully express their human potential. Prysmian Group strongly believes that diversity drives meritocracy and brings significant value at all levels of the organization, increases the possibility of capturing market opportunities and maximizing value for our customers and shareholders. Prysmian Group bases its decisions on principles of equality, with evaluations based on the type of position and with a focus on best practices so individuals succeed based on their efforts and skills and their alignment with applicable job requirements.Line Mangers, Hiring Managers, HR Corporate and HR Local are responsible for ensuring that diversity and inclusion are respected during the recruiting process. Unconscious bias and stereotypes must not influence our selection processes. We look for the best candidates and for the real value they can bring into the organization. We value meritocracy. We value diversity. We turn off our bias. All persons shall have the opportunity to be considered for employment without regard to their race, color, religion, national origin, ancestry, alienage or citizenship status, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, disability, military service and veteran status, pregnancy, childbirth, and related medical conditions, or any other characteristic protected by applicable federal, state or local laws. Prysmian Group will endeavor to make a reasonable accommodation to the known physical or mental limitations of a qualified applicant with a disability unless the accommodation would impose an undue hardship on the operation of our business.Your application data will be treated according to our Data Protection Policy. If you believe you require assistance to complete this form or to participate in an interview, please let us know.Prysmian Group, as an Equal Opportunity Employer, aims to attract and recruit individuals with diverse backgrounds, skills, and abilities. We strongly believe that diversity brings significant value at all levels of the organization, increasing the possibility of capturing market opportunities and maximizing value for our customers and stakeholders. With Diversity, Equity, and Inclusion (DE&I) as part of our Social Ambition 2030 and a strategic pillar of our Company culture, Prysmian Group is committed to the development of an organization that prioritizes talent, where people feel respected, included, and free to fully express their potential just as they are.All Managers and HRs in Prysmian Group are responsible for ensuring DE&I policies are respected during the recruiting process, as well as recognizing and mitigating unconscious biases that must not influence our selection processes. All persons will be considered for employment without regard to their race, ethnicity, religion, nationality, origin, citizenship status, socio-economic status, age, sex, gender identity or expression, sexual orientation, marital status, disability, military service or veteran status, pregnancy, parental leave, medical conditions, or any other characteristic protected by applicable federal, state or local laws. Prysmian Group will endeavor to make a reasonable accommodation for any disclosed physical or neurological condition or disability of a qualified applicant unless the accommodation would impose an undue hardship on the operation of our business.Your application data will be treated according to our Data Protection Policy. If you believe you require assistance to complete this form or to participate in an interview, please let us know.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}