{
    "Job ID": "69869963",
    "Description": "The Bosch Group is a leading global supplier of technology and services, in the areas of Automotive Technology, Industrial Technology, Consumer Goods, Energy and Building Technology.\nIn India, the Group operates through nine companies with a combined strength of over 30,000 associates which includes around 14,000 research and development associates.\nBosch Automotive Electronics India Pvt. Ltd. (RBAI) is a 100% subsidiary of Robert Bosch GmbH. RBAI was established at the right time to cater to the demands of future Indian market. Established in 2009, started out with manufacturing Electronic Control Units. On an average adding one new product every year, Antenna and Immobilizer in 2011, wide range of BCM's since 2012, Electronic power steering control units from 2013, and Voltage regulator in 2014. Over the last 7 years of its existence, the company has grown over 44% CAGR, which is remarkable considering it was established during the peak of recession.\nThe product portfolio of Bosch Automotive Electronics Pvt. Ltd. is into both Automotive and Non-Automotive Business catering to local as well as global demands. The products from RBAI fulfils 94% of the local demand. Apart from this, 72% of our sales are towards exports covering most of the global market.\nWe invite promising and dynamic professionals for a long-term and\nrewarding career with Bosch.Planning and scheduling of Electronics raw materials\nCo-ordination with TF for material allocation\nInventory control Co-ordination to achieve plant targets\nMonitoring vendor performance\nNegotiation with supplier to meet customer schedules\nCo-ordination with fright forwarder ,CHA, Production planning teams and Inbound log teams\nECR Management\nPeriodic supplier Audit\nNew project Co-ordinationBE (Mechanical/Electronics) with 3-5 years of experienceProcurement and handling of distributor parts\nSAP MM Module\nSupply chain concepts ( Planning/forecasting and Inventory Mgmt)Knowledge of EMS industryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}