{
    "Job ID": "69866412",
    "Description": "Job Title: Assistant Manager, eSourcing – Supplier OperationsJob Location: BengaluruAbout Unilever:Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us. We promote innovation, big and small, to make our business win and grow; and we believe in business as a force for good. Unleash your curiosity, challenge ideas and disrupt processes; use your energy to make this happen. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best. Every day, nine out of ten Indian households use our products to feel good, look good and get more out of life – giving us a unique opportunity to build a brighter future.Every individual here can bring their purpose to life through their work. Join us and you’ll be surrounded by inspiring leaders and supportive peers. Among them, you’ll channel your purpose, bring fresh ideas to the table, and simply be you. As you work to make a real impact on the business and the world, we’ll work to help you become a better you.About UniOps:Unilever Operations (UniOps) is the global technology and operations engine of Unilever offering business services, technology, and enterprise solutions. UniOps serves over 190 locations and through a network of specialized service lines and partners delivers insights and innovations, user experiences and end-to-end seamless delivery making Unilever Purpose Led and Future Fit.Business Context and Main Purpose of the Job:Unilever Integrated Operations (UniOps) is a global business unit that manages the company’s shared business services, made up of HR Services, Finance Transactions, IT services, Information Management Services and Workplace Services.Mission: To provide excellent services globally which enable Unilever to win in the market byPutting the business’ goals at the heart of what we do\n\nLeveraging cost-effective, best practice, global solutions across Unilever to meet users’ needs.\n\nMaking continuous improvement in both cost and service an integral part of our way of working.\n\nBuilding a professional services organization that enables our people to give their best.\n\nDeveloping win-win relationships with selected providers to meet our current and future requirements.Key Benefits:Lower cost of delivery through standardization, simplification, process harmonization & scale leverage.\n\nBetter user experience by delivery of integrated service bundles to end-user.\n\nContinuous improvement through end-to-end process ownership.Within the service catalogue of UniOps, the Commercial Experience organization is responsible for the management and delivery of finance services globally, both through third-party outsourced providers (e.g. Accenture, IBM) and through in-sourced operations.The Supplier Operations Team, which is a part of the Commercial Experience Team, has the responsibility of managing operations across end-to-end Source-to-Pay domain.This role will be accountable for managing eRFX and eAuction operations across both PI and IP portfolio, driving process improvement and tool adoption and ensuring processes are compliant as per Unilever control requirement. The role will have global touch points with Procurement team, IT teams, Operations Excellence Teams, Delivery/Operations teams, and control team.Main Accountabilities:Manage existing and new transformation projects and initiatives within eSourcing also ensuring successful delivery.\n\nDeploy a programme management approach for sourcing automation to drive better effectiveness in eSourcing program.\n\nManage the third-party supplier team and provide out-of-the-box approaches to improve efficiency of eAuction events.\n\nBuild and launch capability development programs in eSourcing space.\n\nDefine target framework for procurement teams globally on eSourcing delivery; support procurement teams to achieve those targets through innovative use of multiple auction formats/types.\n\nStrong knowledge of vendor landscape on selecting the right technology platform for eSourcing tools; Understanding of features of different existing and emerging tools in the marketplace\n\nEvangelize eAuctions as way of working within sourcing through a thorough knowledge of different formats and types of eAuctions (English, Dutch, Japanese, Reverse, Forward & Sealed bid)\n\nPropose overall eAuction strategy based on competitive landscape; Design lot strategy and play an advisory role to enable procurement stakeholder to make the right decision in using auction.\n\nDrive spends and event throughput for eSourcing by collaborating with Network and market teams globally.\n\nAct as the single point of contact for all eSourcing requests across the globe and provide due guidance and seamless operational support for flawless execution of eSourcing events.\n\nUser support & training on Ariba Source, Coupa Sourcing Optimization, Jaggaer and Trade Extensions platforms\n\nCoordinate reporting of Savings entitlement for projects done through eSourcing. Manage pipeline and ensure due logging of events into the pipeline.\n\nWork within defined Procurement procedures (Ways of Working) and always adhere to the Code of Business Principles\n\nWork in an effective, cohesive team environment\n\nSupport the procurement organization to meet goals and objectives in support to the overall Unilever strategy.Direct Reports:Logistics Contract Operations teamKey Interfaces:Procurement team\n\nProcess excellence team\n\nControls Service Centre (CSC)\n\n3P Service Providers\n\nIT Teams\n\nPlan-Logistics teamKey Skills:Understanding/Experience in tactical/strategic sourcing process\n\nDeep written and verbal communication skills\n\nExcellent analytical skills\n\nProficiency with advanced Excel\n\nExpertise in using Ariba/Coupa/Jaggaer Sourcing module (incl. complex auction formats with 100s of line items and rules/formulae)\n\nHands on experience in using Trade Extensions platform (should be able to use custom formulae)\n\nStrong communication and interpersonal skills to build effective relationships with stakeholders.\n\nExperience and awareness of working in a global role.Relevant Experience:Minimum Education Background: Bachelor’s degree in Engineering, Certification in Supply Chain\n\nMinimum of 8 years of work experience in Procurement and/or Supply Chain\n\nPrior work experience managing e-tendering operations is an advantageJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}