{
    "Job ID": "69867210",
    "Description": "LogiNext is looking for a prolific and talented technical content creator to contribute to our vision of delivering the best information experience with great content. Your role will involve understanding the details of and around the product and articulate them in clear, concise and illustrated manner. This role requires a high level of creativity and attention to detail. You must be able to distil complex information into clear, concise text.You must have a sound experience with Enterprise SaaS products & knack and love for writing, a comprehensive understanding of the technical products, and experience in blogging to achieve business goals.Collaborate with developers, designers, product managers, marketers, subject matter experts and other influencers to obtain an in-depth understanding of the product and the documentation requirements\nDetermine the needs of end users of technical documentation and work closely with technology and business team to make products easier to use. This involves Feature Guides, FAQs, Onboarding Guides, Help Documentation, Troubleshooting Guides, Training Manuals, Release Notes and other documentation\nDesign infographics, develop feature walkthrough videos and other engaging content to impart product knowledge to various stakeholders\nAudit and update the content regularly to ensure relevance with incremental product feature releases, customer use cases, support issues and other internal developments\nExecute the Content Calendar by building and delivering on the roadmap set by the management\nWork closely with the creative teams to represent the content in the most suitable visual format\nSuggest ways to further improve the quality of the documentationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}