{
    "Job ID": "69866770",
    "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,900 companies and have detected 100 Million threats/day. We work in a fast-paced, dynamic, and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative, and humble people that want to make a difference. Location: Bangalore, Chandigarh, Pune Zscaler enables the world’s leading organizations to securely transform their networks and applications for a mobile and cloud-first world. Applications have moved from the data Center to the cloud and users are connecting to their workloads from everywhere, but security has remained anchored to the data Center. Zscaler is redefining security by moving it out of the data Center and into the cloud.The Zscaler Cloud Security Platform uses software-defined business policies, not appliances, to securely connect the right user to the right application, regardless of device, location, or network. Zscaler offers two service suites. Zscaler Internet Access™ scans every byte of traffic to ensure that nothing bad comes in and nothing good leaks out. Zscaler Private Access™ offers authorized users secure and fast access to internal applications hosted in the data Center or public clouds—without a VPN.Zscaler services are 100% cloud delivered and offer the simplicity, enhanced security, and improved user experience that traditional appliances or hybrid solutions are unable to match. Used in more than 185 countries, the Zscaler multi-tenant, distributed security cloud protects thousands of customers from cyberattacks and data loss, enabling customers to embrace the agility, speed, and cost containment of the cloud—securely.The Senior Analyst – BI & Analytics will report to the Sales Operations Manager. This role is part of our Sales BI & Analytics team which is responsible for reporting & business analytics for Sales and Sales related functions. This position will solve complex business problems using data for driving the growth of the organization. The candidate would be required to work on tools such as Tableau, CRMA, Google Spreadsheet and SQL.The Zscaler sales team is comprised of smart and tenacious people who are passionate about our vision of a secure, cloud-enabled digital future. By using their talent to share that vision, Zscaler sales teams are bringing the power and agility of cloud transformation to organizations around the world. Be a part of it!Responsibilities/What You’ll DoOwning Tableau & Tableau CRM dashboards for Sales/GTM Organization\nOwning some data models in Tableau Prep/SQLs which helps reporting.\nOwning ad-hoc analysis requests from field users and management either by tableau or SQLs\nCollaborate with internal stakeholders to understand business challenges and develop BI solutions to positively impact business performance\nSolve complex business problems using data and analytics techniques\nPresent complex information and data in an easy-to-understand way to drive action.4-7 years of experience in Business Insights and Analytics function\nKnowledge of Tableau, Tableau CRM, Salesforce.com, Google Spreadsheet, SQL and working knowledge of R/Python Ability to drive analytics solution in a multi-disciplinary environment and collaborate with diverse internal teams\nDrive to learn, iterate and innovate and passionate about applying data analytics to solve business problems\nExcellent communication skills, interpersonal skills and strong team player\nAbility to manage multiple concurrent projects and thrive in a fast-paced, constantly changing environment.What You Can Expect From UsAn environment where you will be working on cutting-edge technologies and architectures\nA fun, passionate and collaborative workplace\nCompetitive salary and benefits, including equity\nThe pace and excitement of working for a Silicon Valley Unicorn.#LI-SP4Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}