{
    "Job ID": "69869704",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:Manufacturing Production Workers focus on setting up, operating, maintaining, and troubleshooting manufacturing production (i.e., machining, processing, assembly, or packaging) equipment including: Operating machine tool, chemical processing, assembly, or packaging equipment to manufacture products according to production specifications, schedules, volume/cost/wastage targets, and quality standards. Moving, packing, and sorting raw materials or finished goods. Monitoring the quality of output to identify, discard, or re-manufacture faulty products. Maintaining accurate daily production records as input to manufacturing performance analysis A Senior Para-Professional (S3) requires broad knowledge of operational procedures and tools obtained through extensive work experience and may require vocational or technical education. May require the following proficiency: Works under limited supervision for routine situations. Provides assistance and training to lower-level employees. Problems typically are not routine and require analysis to understand.Your ResponsibilitiesTesting of product ensuring the highest quality to meet customer requirements and delivery.\nFinal & Shipping\nFollow established work instructions in a customized manufacturing environment. Very hands on process.\nUse computer to check schedules, update manufacturing status of jobs, etc.\nComplete and maintain all required paperwork, records, check sheets, etc.\nOperate various types of cranes and fork trucks to aid in material handling.\nContinually monitor quality of work, addressing and resolving inquiries and problems.\nParticipate in continuous improvements initiatives.\nParticipate actively in team meetings and group discussions.\nInterface with other departments to accurately communicate information.\nMust be willing to cross train in multiple skills.\nAssist in the training of other employees.\nMust be a team player but able to work independently.\nAvailable to work overtime as required including weekends.\nPerform other related duties, as assigned by management.Your backgroundDiploma in Electrical\nBasic computer skills.\nAbility to operate industrial equipment, including cranes and forklifts.\nAbility to read and understand blueprints and simple schematics.\nPrevious manufacturing, welding or electrical experience is desirable.\nExperience in lean manufacturing including 4Q, JIDOKA, 6S, etc.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}