{
    "Job ID": "69866205",
    "Description": "6-9 yrs. of experience with practical experience in calibration of Analytical and process instruments/equipmentKnowledge of the following is required:Operation and calibration of various analytical equipments like HPLC, GC, UPLC, LCMS/MS, GCMS/MS, ICPMS, Balances, pH meters, KF etc.,\nExpertise in Empower3 application\nCalibration procedures, tools and processes\nCalibration database systems like Blue Mountain and EAMS will be an added advantage\nExperience in establishing SOP’s\nKnowledge on metrological standards and investigations through Trackwise\nOperation and calibration of Standard instruments\nRegulatory Guidelines for GMP and documentation review skills\nEffective problem solving capabilities\nExcellent Interpersonal, written and communication skills\nExpertise in reviewing the chromatograms of HPLC,UPLC,GC &ICP-MS and calibration data.ResponsibilitiesTo lead the team of 2-3 members for managing the calibration of various analytical equipments typically used in the Pharmaceutical industry as per the SOP.\nPlan and coordinate with the external vendors performing calibration and maintenance activities onsite/offsite.\nReview, Archive and maintain the calibration records.\nInvestigate the out of tolerance results during the calibration through Trackwise.\nOrder and maintain the standard solutions and standard instruments required for the calibration.\nEnsure inspection readiness in calibration across the laboratories Publish metrics reports on calibration, on-time performance and alert on open issues.\nPrepare and maintain the calibration and maintenance schedules for instruments  and ensure the state of calibration is valid\nDevelop, implement and maintain calibration procedures for new equipment and Provide the support for OQ/PQ during qualifications\nProvide support to the site in reviewing the potential product impact due to an out of tolerance conditions during calibration\nProvides expert support for troubleshooting during calibration and maintenance\nProvide technical guidance and support of new projects in specifying new instruments and calibration methods for new instruments\nAs requested, present and support the calibration program during internal and external audits.\nPerform routine field inspections of calibration status labelling to ensure complianceQualifications:B.Pharm/MPharm/MSC chemistryBE (Electronics, instrumentaiton)Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}