{
    "Job ID": "69866957",
    "Description": "Who can Apply:Strong communication skills in English (sense of humor and wit is mandatory, not optional)\nData driven analytical mindset (No excel, no interview.), to analyze customers growth and helping with the same strategically implementing our application.\nLove learning about new technology and find ways to tweak what we have, to get the maximum juice out of it.\nDesire to learn new developments in technology and help customers strategically implement the same\nOrganized, multi-tasker, who loves working with short deadlines. Basically, trying to keep up with all the tasks assigned and taking on more.\nAvailable to work on weekends and okay working beyond the stereotypical office hours, to make sure work gets done.\nEducate customers on Kaleyra’s product, capabilities, and best practices to simplify adoption and align expectationsWhat they would be doing:Work directly with the Sales Team and Customer to get an understanding of the customers requirements, help resolve issues and ad-hoc queries that they may come up with regarding the application within the stipulated SLA for that issue or query.\nEnsure customer satisfaction is maintained with the application and provide feedback to the Product Manager whenever there is a scope of improvement, to improve the customer experience.\nAnalysis of customer feedbacks regarding the application on a monthly basis, to help in decision making process for application-level changes.\nKeep track of customers requests and queries, the progress of the same and provide realistic timelines for the same while coordinating with internal teams\nAnalyze Key Account trends and provide the suggestions to various teams to help overall growth of customers as well as Kaleyra business.\nAnalyze clients level applications and help them build successful integrations by working closely with the client's technical team.\nUnderstanding requirements provided by clients and helping them with application layer setup and fulfilling their requirements.\nRecord customer implementation needs, requests, and questions and discuss them with product stakeholders and have them addressed.\nEnsuring customers receive superior service by Collaborate with the sales, finance, and engineering teams\nDevelop a deep understanding of customers' business and operational objectivesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}