{
    "Job ID": "69869941",
    "Description": "Who we areTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds. Working here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.How you’ll spend your DayEnabling design and delivery of the pay and bonus review in accordance with Total Rewards Strategy and specific service line requirements\n\nBenchmark, analyze and interpret market data, develop pay ranges and salary/bonus modelling in accordance with the Total Rewards strategy and specific requirements of the business area. Making key contributions by drawing conclusions and sound recommendations through informed design\n\nSupport the annual compensation processes in collaboration with global counterparts\n\nManage aspects of the employee benefits program including health and welfare plans, life insurance, and any other employee benefit plans offered.\n\nReward market data analysis – experience of submitting data to salary surveys and analyzing outputs. Previous experience of the following surveys would be desirable; Mercer, Willis Towers Watson, Hewitt.\n\nEnsure the delivery of wider total rewards’ agenda projects and any ad hoc reward projects\n\nKeeping abreast of regulatory and reward trends, practices, and insights to inform the total reward agendaYour experience and qualificationsMinimum of 5 years of professional experience with, or exposure to training in business functions such as Compliance or Audit\n\nWork experience in a manufacturing set-up preferred\n\nA global mind-set and cultural flexibility, open to flexible work hours as per business demands    Teva’s Equal Employment Opportunity CommitmentTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws. We are committed to a diverse and inclusive workplace for all. If you are contacted for a job opportunity, please advise us of any accommodations needed to support you throughout the recruitment and selection process. All accommodation information provided will be treated as confidential and used only for the purpose of providing an accessible candidate experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}