{"Job ID": "69869685", "Description": "Company:Job Area:General Summary:Qualcomm is the innovation leader in the area of integrated chipsets that power advanced mobile devices, XR/IoT/Automotive & compute platforms. We are building on and expanding our reputation as the industry powerhouse for innovation in both wireless technologies and enabling advanced multimedia capabilities. We are seeking experienced system engineers for our cutting-edge efforts in the architecture and design of our video codec hardware. The video Systems group provides video solutions on all of Qualcomm’s Snapdragon mobile processors. The team’s scope includes video and image processing algorithms and IP architecture design for video and image  compression, visual signal processing and analytics, catering to unique requirements of Mobile/XR/IoT/Automotive markets, with power and performance optimization.The selected candidate, along with his/her colleagues and other team members, will have responsibilities in one or more of the following areas:Research and develop video and image algorithms for mobile, IoT surveillance, Automotive, gaming and VR/AR applications with performance and power efficiency\nDesigning and evaluating video and image algorithms to be implemented in hardware encoders and decoders\nDefine systems architecture for video solutions including data flow, task partition, interface and systems interoperation\nImplement models to accurately model the HW, and supporting HW verification & SW development via behavioral model vectors\nImage and video subjective and objective analysis\nCollaborate with systems, software, hardware teams at various stages of chipset life in design/validation/commercialization.Minimum QualificationsMaster's degree in Electrical or Computer Engineering or related field and having 4 to 12 years of experience\nKnowledge & Experience in video coding standards such as VVC, AV1, HEVC, H.264/AVC, VP9.\nGood working experience with C/C++\nHands on Knowledge & Experience in Video Codec Design and implementation with in-depth understanding of encoder algorithms such as motion estimation, mode decision and rate control.\nExperienced in visual quality trade-offs and assessments for video use-casesPreferred QualificationsRelevant experience of >4 years\nExperience with Video Pre & Post Processing Algorithms such as denoising, scaling is a plus\nExperience with Computer Vision and Deep Learning techniques as applied to Video is a plusKeywordsVideo codec, encoder, decoder, video processing, video architecture, image processing, HEVC, H264, VVC, AV1, VP9, JPEG, JPEG-LS, JPEG-XSMinimum Qualifications:Applicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email toaccommodationsupportAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found herefor assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.Qualcomm is an equal opportunity employer and supports workforce diversity.Qualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}