{
    "Job ID": "69866006",
    "Description": "The GFCC Alert Triage position is part of the firm’s India AML Alert Triage team within AML Investigations.  The Triage team dispositions alerts consistent with the Global AML Standards, provides an initial assessment of potential Money Laundering, Terrorist Financing as well as other nefarious activity and recommends alerts for escalation and further review or closure as false positivesResponsibilities: Collect and document data, including:  alerting activity, account information, transactional data, KYC information, politically exposed person (PEP) status, adverse media as well as counterparty and any other required information to assist in the investigation\nReview and analyze underlying data gathered opposite Anti-Money Laundering (AML), Terrorist Financing (TF), Human Trafficking and other red flags to assess whether the alert should be recommended for escalation or to be closed with no further action\nFully document all alerts, including supporting data, analysis as well as escalation or close recommendation rationale within the case management system in a timely manner and consistent with the firm’s quality standards\nBuild relationships with AML Investigations units and effectively communicate and transfer information for case investigations\nCollaborate with India and US colleagues to share processing and AML knowledge to enhance AML Investigation process flows\nProcess work items in the order of priority and aligned with SLA priorities. Escalate issues in a timely manner and demonstrate courage and integrity by doing the right thing all the time.\nIn conjunction with manager and consistent with overall department objectives, establish and execute on annual development goals. You would participate in special projects, quality improvement initiatives and other similar exercisesRequired qualifications, capabilities, and skills:Qualified graduate with 2 to 6 years’ of relevant experience in Global Financial Crime Compliance\nFamiliarity with the firm's internal systems and processes or similar processes at other institutions, and proficiency in MS Office (Outlook/Word/Excel/PowerPoint)\nYou are a self-starter, capable of working under minimum supervision, able to multi-task and meet deadlines in high-pressure environment\nYou are a result-oriented team player with strong problem solving ability.\nYou have exceptional research and analytical skills with the ability to analyze large amounts of data, decipher higher risk attributes (transactional, geographical, product, customer type, etc.) and develop well-reasoned recommendations and strong documentation skills to clearly articulate alert disposition\nYou are adaptable to change and demonstrate strong interpersonal and verbal/written communication skills. \nYou adhere to and standards, controls and policy.Preferred qualifications, capabilities, and skills:The following additional items will be considered but are not required for this roleCAMS CertificationJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}