{"Job ID": "69866294", "Description": "Cloud networking is an umbrella term that provides the connectivity to and between, applications and workloads distributed across all variations of clouds, cloud-based services, data centres and edge networks. It is vital to the performance, security and efficient management of hybrid and multicloud environments.Earlier, Cloud Networking was known as Data Centre Network and now it is the part of Distributed System Engineering (DSE), which comes under Cisco Networking group.This is a role within Cisco's ground-breaking Data Centre Networking team. You will participate in projects involved in the development of platform independent software for our next generation network operating systems for Cisco’s industry leading N9K series of switches.You will be associated with diverse group of some of the brightest problem solvers and reflect with the team that work on the next generation of Data Centre & Cloud switches.You are someone who thrives in a multi-layered start-up like environment.\nYou can write complete functional and design specs independently\nYou can craft & develop large portions of software independently.\nYou have an eye for details and are a person who loves to get to the depth of technology down to its bits and bytes.\nYou can learn a wide range of our technologies.We are looking for System Test Engineer with 2+ Years of experience in below Technologies:Strong C/C++ skills\nSound background in Data structures and Algorithms.\nHands on experience on switch/router embedded system software development using Linux or similar OS\nGood debugging and trouble shooting skillsExperience with high availability related to switch/router products\nPython/Go programming\nLinux kernel code/KLMs development.\nUnderstanding of Open Source software development, Dockers/LxC, RPMs, etc\nExposure to Open Source tools like Puppet/Chef/Ansible, etcWhy Cisco:#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!Nearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.So, you have colourful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Telecommunications", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}