{
    "Job ID": "69865930",
    "Description": "Job DescriptionOur client is a locally owned distributor of solar products – invertors, solar panels and solar batteries.We are recruiting a Middle East and Africa experienced mid-level head of business development from the solar and renewable energy sector to join their Dubai team.The successful candidate will be responsible for end-to-end B2B distributor and channel sales by increasing the distributor network to achieve revenue growth.This role will require extensive travel across the Middle East and Africa.Role SummaryWith a “hunter” mindset and approach, proactively identify profitable business opportunities, close deals and drive incremental market share growth and profit.\nBuild a strong and sustainable network of distributors in the MENA region to exceed annual volume and revenue sales targets.\nManage the entire sales process - lead generation, client prospecting, contract and price negotiation and winning business in the solar industry.\nRecruit and lead a sales team across the Middle East and Africa.\nDevelop a financially viable go-to-market strategy to identify and onboard distributors and channel partners across the Middle East and Africa.\nDevelop a healthy pipeline of prospects through lead generation to maximize sales conversions.\nPrepare commercially strong presentations for potential customers and partnerships.\nConduct market research and analysis to understand market trends and competition.\nNetwork at industry exhibitions and trade shows.Mandatory Skills & Experience5+ years mid-level UAE and Africa B2B business development and client acquisition leadership and experience in solar and renewables sector - solar photovoltaic (PV), PV inverters, energy storage products, EV chargers and smart energy management systems.\nStrong career progression – consistently achieving and exceeding sales targets to earn sales commission.\nStrong background in building profitable sales pipelines by identifying valuable potential customers and being able to influence their decision making.\nCommercially and financially astute with strong negotiating skills.\nUAE driving license is mandatory.EducationBachelor’s Degree in Electrical Engineering is a strong advantageCandidate ProfileCurrently living in the United Arab Emirates.\nFluency in English – must be able to read, write and speak fluent English.\nExcellent communication, interpersonal and presentation skills.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}