{"Job ID": "69866280", "Description": "Job Overview\nResearches and creates variety of more complex global reference data for use in global and national offerings in IQVIA worldwide. Quality assures global and local reference data.Essential Functions\n• Researches information for the creation of global data elements or information in variety of areas or in a complex area.\n• Analyses and interprets researched information in relation to agreed business rules.\n• Analyses changes in data or information and incorporates in data being maintained as needed.\n• Updates existing global data systems/stores correctly with new and changed information.\n• Ensures the information created is correctly transferred into relevant systems, databases and client offerings.\n• Quality assures a variety of global data elements or information, providing feedback to originators and answering their queries.\n• May assess  impact of data changes on regular client offerings.\n• May answer queries on global data (client and internal).\n• May assist in training of new data analysts.\n• May assist with scheduling and tracking creation of global reference data.Qualifications\n• Bachelor's Degree or equivalent, in biomedical subject Req\n• Four (4) years relevant experience in pharmaceutical information/data creation environment. Req\n• Strong knowledge of global pharmaceutical information.\n• Good understanding of how data being created is used in client offerings.IQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}