{"Job ID": "69866293", "Description": "We are looking for a Lead Emergency Preparedness Advisory Services in IRAQWork Status : Rotation (4 weeks ON – 4 weeks OFF).Start date: ASAPDuration: 1 year renewableQualifications/Experience required10 years experience in emergency responses and Crisis management. 5 years in oil and gas.\nExperience 4 years In IMS (Incident Management System) IMS300 qualified.\n5 years in Crisis Management and communication (CMC) with GEC training qualification.\nAbility to communicate and network in a complex and multicultural organization. Initiative, reactivity.\nTrained to lead investigations of significant accidents/incidents\nWritten and oral communication in English is essential/mandatoryActivitiesMaintain a high awareness of industry and professional best practices to ensure continued high level Emergency Repsonse Preparedeness.\nMaintenance and development of TEPRH Emergency Response Management System.\nAdvise, clarify and assist IMT in their roles during the mobilisation of IMT and CMC.\nFollow-up of Action Plan concerning Emergency Response: incorporation of lessons learned from real training, exercises, live responses and any other relevant sources into existing plans and procedures as appropriate\nAssistance and advice to assets, entities and projects on all relevant Emergency Response issues including the development of emergency and crisis procedures, plans, and contingency arrangements through regular Sites visits including project sites during civil works.\nUpdate the Emergency system in the offices and accommodation. Train Fire wardens in the accommodation.\nTraining, coaching of the Emergency Response team.\nOrganisation and coordination of appropriate training for the emergency response organisation: Crisis Management Cell, Incident Management Team, Advanced Command Post. Develop an annual training schedule.\nOrganisation, implementation, and debriefing of exercises defined in the yearly planning (Tabletop Exercises, Medium Scale Exercises, Full Scale Exercises).\nAudits Site exercises and implement Action Plan following the Exercises\nDevelopment and maintenance of emergency response Cells and response facilities. This includes, IST systems, Communications and practical tools, maps, forms based on IMS system.\nAssist with ensuring the COMPANY management system relating to fire safety is fully implemented on site\nAssist in preparation and communicating information relating to incidents (Rex+)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}