{
    "Job ID": "69869867",
    "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Looking for a skilled Techno Manager to lead the project for next gen MEMS Sensors, which in turn is driving whole IoT landscape, and is bridge between physical and digital world.    \nThe Techno Manager shall posses a creative mind and enthusiasm to work on future tech and shall lead the team in developing low level optimized firmware to efficiently using limited resource and enable the sensors for different use-cases.Working on this topic the developer shall experience a very interesting and challenging work flow with a wide spectrum from Requirements analysis, Software designing to Solution development and problem solving using simulation software as well as on actual hardware.Personality: You can provide excellent structured analytical skills and understanding of physical parameters and cross-system coherence. Self-starting with influencing and leadership skills.\nExperience & Know-How:  A very good experience in optimized embedded SW with modern C and C++. Ideally, having further experience on MEMS sensors, FPGA. Furthermore, a familiarity with ASICS, SystemC models and common software development tools like Enterprise Architect, Continuous Integration and Git.\nLanguages: We are cooperating with different worldwide locations. Therefore, we expect excellent English skills. \nEducation: Bachelor or Master degree in Computer Science, Electrical Engineering or in a related technical field\n8+  years of industry experience\nWorking exprience in AglieStrongly visualizing the bigger picture of the project and motivating the team to deliver the same on reaching the planned milestones\nOverview of both the development and testing activities\nInfluence technology strategies and decisions with a high-level of expertise and knowledge.\nProvide direction and support to ensure compliance with relevant legislative specifications and standards\nDomain knowledge on MEMS sensors.\nGood understanding of power measurement and management of embedded systems\nAdequate knowledge of reading schematics and data sheets for components\nStrong documentation and writing skills\nGood communication skills, interpersonal skills and ability to work independently on problems.\nAbility to adapt to fast changing requirements and provide solutions.\nBeing an effective team player and willing to accept challenges and responsibilities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Coimbatore, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}