{
    "Job ID": "69868566",
    "Description": "Do you dream of working in a company that is driven by a meaningful purpose? An inclusive company that empowers you to do your best and be innovative?We are looking for Consultant System Architect (f/m/d) Digital Power to make an impact!At Schneider Electric, we are seeking to push sustainability further -- faster. More than 80% of global CO2 emissions are due to the production and consumption of energyClimate change is, at the end of the day, an energy challenge that we can resolve. A more electric and digital world is key to building a sustainable and resilient future.Life Is On – what about you?Here is how you can contribute·You lead the technical part of commercial roadmap and action plan (such as architectures/ systems/ features qualification, prescription, specifications drafting) for specific segments and/or technologies.·You bring innovation and differentiation to our customers to address their energy efficiency and sustainability objectives with the most advanced digital solutions.·You convert customers’ needs identified at early stage of the sales process into the most cost-effective technical architecture & solutions leveraging your deep Digital Power's technology, cybersecurity, and architecture knowledge.·Promote Digital Power’s value proposition will be part of your responsibilities.To learn more about Electricity 4.0: https://www.youtube.com/watch?v=-0_qntE4TVEOur offer·You will be part of a growing company with a positive industry reputation, who is a recognized leader in a market where energy services are in demand.·You will be joining an entrepreneurial company with a positive corporate culture and strong team culture.·We offer a competitive salary and bonus opportunities with excellent benefits.·In this position you will be able to work from home.·You may develop different interests in the future? With Schneider Electric, you have all the development opportunities an international group can provide.Your profile·You have an engineering or commercial university degree·You bring solid experience in medium voltage & low voltage automation Solutions as technical, consultant or commercial expert·Your technical know-how you include experience with IEC 61850 standard, substation automation and architectural design as well as SCADA Systems·You are familiarized with CRM (Customer Relationship Management) and technical negotiation·You have a strong ability to understand technology trends and its impact on customer applications·You can communicate fluently in English (other European languages will be a plus)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gurgaon, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}