{"Job ID": "69867312", "Description": "The opportunityThis is an opportunity to grow your career with a market-leading multi-national project management consultancy.Our values are integrity, safety first, client focus, and creating opportunities for our people. These values underpin everything we do and are what provide our people with opportunities to grow, develop and progress within a world-class organisation.We are an employer of choice, seeking the best people in their field, who deserve the best employer to support their career.Project: More than 2 million square feet mass housing project in Mumbai.Your responsibilities will include:Examining the design consultants to maximise quality and value while minimising the risk profile for the project.\n\nManaging third-party and client technical and constructability reviews of deliverables.\n\nManaging designer procurement, contracts and performance.\n\nEngaging the technical resources required to challenge the designers to obtain the most beneficial balance of quality, value and risk for overall.\n\nProviding regular progress reports on all of the above to the project manager.\n\nChecking of all construction issue information.\n\nMonitoring the drawing production progress.\n\nManaging the information flow.\n\nManaging the incorporation of any comments.\n\nChecking the drawings and confirming approvals for the issue.\n\nLiaising with document controller for publication and down-loading of drawings.\n\nEnsuring the correct drawing procedure.\n\nProviding reports on planning and process.\n\nEnsuring correct specification as advised.\n\nLiaising with planning manager.\n\nProviding input into O and M manuals. \n\nAssisting in the provision of an effective and efficient, high quality engineering design.\n\nManaging and assisting in the management of the project involving the construction of special-to-type equipment.  \n\nEnsuring that all information relating to projects and assets is accurately recorded and stored appropriately.\n\nDrafting of procurement/technical submission programme.About youYou have a degree qualification in civil engineering and are a member of a professional body. You have experience of leading a project of a similar nature. You have experience in design coordination with multiple consultants.You are digitally savvy and can build lasting client relationships and provide support to strong, motivated teams. You have previous working experience on construction projects and be hungry to grow your career and enjoy the opportunities Mace has to offer.#LI-OnsiteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}