{
    "Job ID": "69869687",
    "Description": "Cyient is a global engineering and technology solutions company. As a Design, Build, and Maintain partner for leading organizations worldwide, we take solution ownership across the value chain to help clients focus on their core, innovate, and stay ahead of the curve. We leverage digital technologies, advanced analytics capabilities, and our domain knowledge and technical expertise, to solve complex business problems.With over 15,000 employees globally, we partner with clients to operate as part of their extended team in ways that best suit their organization’s culture and requirements. Our industry focus includes aerospace and defence, healthcare, telecommunications, rail transportation, semiconductor, geospatial, industrial, and energy.Job DescriptionStrong fundamental with Electronics/Computer Science\n• Ability to understand the system/Design specification and derive the test cases independently.\n• Understanding of automotive standard protocols like CAN, LIN, XCP, UDS is recommended.\n• Strong troubleshooting skills and root cause analysis skills\n• Preparation and Presentation of detailed analysis and bug report\n• Good to have exposure of Matlab, Simulink, Stateflow, Targetlink\n• Good to have exposure on HiL testing environments. (Preferred to have dSpace HiL)\n• Experience with Vehicle testing scenarios are an added advantage\n• Awareness with model fixed point conversion fundamentals\n• Know how on automotive cyber security will be added advantage\n• Should possess good communication and interpersonal skills.Skills & ExperienceCyient is an Equal Opportunity Employer.Cyient recruits, employs, trains, compensates, and promotes regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, veteran status, and other protected status as required by applicable law. We are proud to be a diverse and inclusive company where our people can focus their whole self on solving problems that matter.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}