{"Job ID": "69868298", "Description": "Company Profile:DMCC is a center of global trade. Headquartered in Dubai, DMCC is the world’s most interconnected Free Zone, home to over 22,000 member companies and the leading trade and enterprise hub for commodities. Whether developing vibrant neighborhoods with world-class property like Jumeirah Lakes Towers and the much anticipated Uptown Dubai, or delivering high performance business services, DMCC provides everything its dynamic community needs to live, work and thrive. Made for Trade, DMCC is proud to sustain and grow Dubai’s position as the place to be for global trade today and long into the future.Role Summary:Responsible for completing company registration and licensing (new, renewal and amendments) processes in addition to ensuring all applications are accurate and complete.Responsibilities:Organizes and prepares all documents and requirements related to client registration, including updates to Registration database.\nReceives and handles license requirements (including listed activities) by the newly registered companies, including updates to License database.\nProcesses requests/applications related to existing licenses (Renewal, Change of Address, Change of Manager, Activity Amendment, and Additional Licenses).\nReviews client applications, enters additional data, and liaises with the client or their representative to resolve of any errors, inconsistencies or gaps before approving.\nEnsures that digital notifications are appropriately activated for relevant processes, such as Change of Company Name and License Termination.\nFollows up on requirements to ensure that all members meet the DMCC rules and regulations. For example, 3rd party NOCs.\nHandles communication related to license renewal reminders and financial statements submission on a monthly basis as per the list provided by the Team Leader Registration and Licensing.Qualifications:Degree/Diploma in a related field\n2-3 years’ experience in registration and licensing with strong understanding of local rules and regulations\nKnowledge of different licensing and registration statutory regulations and applications procedures High level of computer literacy & power point skillsThe successful candidate will enjoy the following:Working at the world’s best Free Zone with highly motivated colleagues\nA very diverse workforce from all around the globe\nWell-being initiatives all over the year\nMarket competitive basic salary\nHousing allowance\nTransportation allowance\nNational Allowance\nAnnual flight allowance\nOther alternative family benefits\nPension Scheme\nDiscretionary bonus schemes\nGenerous annual leave\nMedical and life insurance cover\nFree covered parking\nRetail discounts with over 450 outlets across JLT.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}