{
    "Job ID": "69869833",
    "Description": "Job RoleIf you are seeking to join a successful organization where you can make a difference and you are capably of providing exceptional customer service experience, we are looking for CAREER-MINDED individuals for the position of Service Advisor position.As a Service Advisor notes down the complaints of the customer. He discusses the potential cost with the customer and seeks approval. If the estimate is accepted, he prepares the work order and asks the customer to sign. A completion time is agreed. He then passes the order on to the Team Leader/control room.Job ResponsibilitiesProvide advanced product/service information and respond to complex customer questions about the product/service\nMaintain and lead periodic check-ins with key customers to ensure they're receiving the most value from the product/service\nRecord and process custom/special customer orders, often dealing with ambiguous delivery expectations\nSchedule followup actions & enter relevant information into CRM system after each contact with a customer to create a call plan and to ensure that the organization has quality data to enable effective customer retention & business development activities\nDuring service interactions, look for opportunities to bridge customer needs to additional products/services offered by the organization\nInterview the customer, following a complex multi-level sales script, to clarify the customer's requirements. Or assist in conducting interviews with potential customers to collect client requirements making detailed notes\nCheck the quality of work undertaken by teams in accordance with well-defined quality standards, identifying appropriate rectification where necessary\nRespond to more advanced issue escalations promptly and appropriately; provide managerial approvals as requiredEducationRequired Qualifications & SkillsMinimum Experience: \nMinimum two years of experience.Job specific Skills:Selling skills\nExcellent Behaviour skills\nProblem solving skills\nNegotiation skills\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}