{
    "Job ID": "69866003",
    "Description": "We have an opportunity to impact your career and provide an adventure where you can push the limits of what's possible.Job SummaryAs a Lead Software Engineer at JPMorgan Chase with EMPLOYEE PLATFORMS under COLLABORATION & COMMUNICATION, you are an integral part of an agile team that works to enhance, build, and deliver trusted market-leading technology products in a secure, stable, and scalable way. As a core technical contributor, you are responsible for conducting critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.Job responsibilitiesWorks as a member of an Agile team developing products for Voice Infrastructure and solves technical issues and able to collaborate and contribute ideas\nAdvanced knowledge with system integration and SIP communications protocol software\nDevelop code in the media plane working directly with protocols such as RTP, SRTP, gRPC\nHandle more advanced technical problems and create products that solve business challenges\nIntegrate common enterprise tools and components (e.g., reference data, security, messaging) to build large systems\nFull DevOps to include design, develop, test, and analyzes problems to support the product \nCollaborate and Co-Design with multiple development teams to create and deliver new customer products into the firmwide ecosystemsRequired qualifications, capabilities, and skillsAdvanced experience in software developments working in large infrastructure environments across multiple data centers with a focus on Java, Spring Framework, and REST APIs\nOverall 10+ years of applied IT experience with 5+ years applied experience in developing communications software\nAdvanced experience developing applications in a VoIP infrastructure to include: SIP, WebRTC, SIPREC, SDP, RTP, SRTP/DTLS, gRPC \nAdvanced experience with distributed Operating System (Unix/Linux, Windows) and substantial knowledge of automated testing and deployment (Jules Jenkins/Bitbucket)\nSubstantial knowledge with application monitoring and instrumentation (SonarQube)\nExperience with unit testing frameworks (Junit and Mockito), software security and entitlements (SSO, windows, Kerberos, LDAP, Windows AD), virtualization and cloud AWS, Kubernetes, and Docker\nProficient in multiple business disciplines/functions strategic directions through technologyPreferred qualifications, capabilities, and skillsDevelops mindset for risk and control compliance to departmental and company- wide standards\nWorks within standards of financial control and budget management\nExecutes within a client centric environment when working with teams and contributorsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}