{
    "Job ID": "69866259",
    "Description": "Role Purpose\nSupports the team in the completion of key compliance controls.Reporting to the Index Rules Manager within in the Governance and Policy Team, the individual will be responsible for helping to maintain FTSE Russell’s methodology documents and Ground Rules.Help with creating new ground rule documentation for equity, fixed income and other asset clases in-line with the introduction of new products including Ground Rules, Methodology Document and Benchmark Statements.\nHelp with maintaining FTSE Russell’s existing equity and fixed income Ground Rules and Methodology Documents and other supporting documentation (for instance Benchmark Statements).\nHelp to prepare for governance meetings, including preparing agendas, taking minutes and following up on action points arising from meetings.Role ResponsibilitiesAttend Product Readiness meetings to establish which new products require Ground Rules/Methodology documents\nSupport the Product Readiness process in helping to answer any questions regarding related Ground Rules by liaising with Index Design, Index Management, Research and Index Review teams as required.\nEnsure all newly created Ground Rules/Methodology Documents are accurate and reflect the way in which the index is built.\nEnsure all Ground Rule changes are reviewed and approved in a timely manner through the appropriate governance forums.\nEnsure internal communication of Ground Rule changes via internal operational group meetings.Cover for the Index Rules Manager for holiday periods etc.Minimum RequirementsWorking experience & Education\nIt is expected that with limited supervision the individual will deliver each of the key objectives of the role identified above, working to strict deadlines and to the highest degree of accuracy.  It is therefore expected that the individual will have:\nExcellent organizational skills and attention to detail with the ability to prioritize effectively, handle multiple projects under tight deadlines, identify/ flag/resolve potential issues early on.\nAn understanding of financial markets would be of benefit.IT Skills\nTechnical Author/Writing skills\nMicrosoft OfficeSome knowledge of the following is desirable:Financial Compliance and RegulationSoft Skills\nEnthusiastic and responsive to change.\nAbility to work to tight deadlines and under pressure.\nLogical and structured approach.\nEffective written and spoken communication and presentation skills.\nTeam player\nHighly motivated\nStrong analytical and communication skills\nA self motivated, responsible and enthusiastic individual with excellent attention to detail.At LSEG, we believe that creating a diverse and inclusive organisation is fundamental to the way we deliver on our promise of creating essential partnerships and open opportunities. Our open culture is central to how we deliver our purpose – driving financial stability, empowering economies and enabling customers to create sustainable growth – in everything we do.Working with us means that you will be part of a dynamic organisation of 25,000 people across 70 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.LSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.We are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.Please take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.If you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}