{"Job ID": "69865766", "Description": "Your team and working environment:Make the most of now. If there is something, we are very proud of at Grand Plaza Mövenpick Media City is our story. We see ourselves as a place where people can best realize opportunity, because sometimes all you need to do is the ordinary in an extraordinary way. “What if” are two words with endless possibilities and we want to turn your wishes and ideas into moments – moments that are uncomplicated, personal and human.Our commitment to Diversity & Inclusion:We are an inclusive company, and our ambition is to attract, recruit and promote diverse talent.Why work for Accor?We are far more than a worldwide leader. We welcome you as you are, and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit  https://careers.accor.com/Do what you love, care for the world, dare to challenge the status quo! #BELIMITLESSF&B Hostess\nYou are the beginning of an exceptional guest experience. As an F&B Hostess, you will make our guests Feel Welcome from the moment they arrive!What you will be doing:\nConsistently offer a professional and friendly greeting, and provide engaging service\nAssist guests regarding food and beverage menu items in an informative and helpful way\nFollow outlet policies, procedures and service standards\nFollow all safety and sanitation policies when handling food and beverageYour experience and skills include:Ability to focus attention on guest needs, remaining calm and courteous at all times\nStrong interpersonal and problem solving abilities\nAbility to work well under pressure in a fast paced environment\nAbility to work cohesively and collaboratively as part of a teamWhat is in it for you:Employee benefit card offering discounted Accor rates worldwide\nLearning programs through our academies\nOpportunity to develop your talent and grow within your property and across the world\nAbility to make a difference through our corporate social responsibility activities like Planet 21Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}