{"Job ID": "69866187", "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleWhat does a successfulCI/CD Engineer, Advisory do at Fiserv?The CICD Engineer partners with internal product groups and development teams to develop technical design and processes for continuous integration and continuous deployment of top priority projects while advocating adherence to enterprise standards through collaboration with multiple development teams.What you will do:·This position requires a high degree of collaboration with Development, Product, Engineering, and Architecture teams to provide the right level of agility within a defined delivery process.·Ideal candidate will exhibit strong CI/CD skills, will be forward thinking, will be self-motivated, and will be able to work effectively in a diverse, highly talented team, continuously striving for excellence.What you will need to have: ·Bachelor’s Degree in Computer Science or related technical field and/or 5+ years of relevant work experience.·                  5+ years of relevant work experience delivering enterprise customer facing solutions.·6+ years of relevant work experience designing and developing enterprise class distributed systems.·4+ years of relevant work experience in the financial services industry or other highly regulated industries.·Experience interacting with customers to analyze, validate, specify, verify, document and manage solution requirements.·Experience with .NET/Java development/framework, public/private cloud environments (AWS/Azure/Google Cloud), and Automation/Continuous Integration (SonarQube, Salt, RunDeck, Jenkins, Harness, etc.)·Experience in SDLC including associated deployment methodologies, QA processes, and performance tuning efforts and Source Code Management w/ (GitHub and/or GitLab)·Previous Development/System Engineering experience in heterogeneous environments.·Working knowledge of automation and configuration management tools like Salt, Ansible etc.·Experience effectively managing multiple technology projects and teams simultaneously.·Excellent verbal and written communication skills.Thank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}