{
    "Job ID": "69861018",
    "Description": "Position at Al Jazeera Media NetworkKey Responsibilities:Record and post all financial transactions in accordance with Finance policies and procedures.\nReconcile and clear balance sheet accounts as per Finance procedures.\nComply with local laws in the Bureaus, ensure Filing of all required tax returns, declarations, statements and information to authorities as and when these become due, and Identify noncompliance issues for assigned bureaus.\nPrepare monthly expenses reimbursements for assigned bureaus and ensure adequate cash is maintained in bureaus.\nSubmit monthly budget request along with approvals for hubs and subsidiaries and ensure adequate cash is maintained in Hub.\nPrepare payroll payments for hubs and bureaus within the region.\nPost invoices and process vendor/staff payments accurately and on time after checking compliance as per AJMN P&P and TOFA as well as local laws.\nEnsure accounting policies and procedures are followed throughout the region and providing recommendations to improve financial controls.\nGuide and assist the Admin & Finance staffs in bureaus to perform their duties in all financial and tax compliance matters including liaising with external auditors, tax agents, corporate secretary and other financial consultants.\nReview supporting documents for assigned Bureaus and report noncompliance issues.\nKeep proper filing and tracking of financial and administrative subjects in shared folder such as; monthly cash journals, reconciliations, bank statements, petty cash count, registration documents, opening bank accounts letters, financial statements, tax filing documents, tax clearance certificate, tax advises and laws, payroll sheets, approvals and monthly supporting document.\nLiaise with the Bureau/Hub staffs in ensuring the team understand all finance policies and procedures and answer all the queries.\nPreparation and liaising with auditors for Annual statutory audit on financial statements (if applicable).\nPreparation and liaising with tax consultants for Corporate Tax annual submission and Transfer Pricing filing(if applicable).\nUpdate the PPE register (if applicable)\nSubmit monthly invoice for the services performed by Hubs(if applicable).Key Requirements:Bachelor's Degree in Accounting, Finance or related field is a must.\nMinimum of 3 years of professional experience is required in general accounting.\nKnowledge of financial contracts, audit techniques, AP processes and related financial processes, financial control cycles & Letters of Guarantee (LGs) and Letters of Credit (LCs)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}