{"Job ID": "69867175", "Description": "Want to be a part of start-up environment within Amazon to design and build a new Fintech Payments product right from the scratch?\n\nWant to enable hundreds of millions of Amazon customers to shop on Amazon using next generation credit products?\n\nWant to be a part of the team that will enable you to deliver products handling highly sensitive customer data, at high traffic and minimum latency while handling cross-region calls if required?\n\nWant to be a part of the team that will enable you to learn latest technologies and skills relevant in the software development industry?\n\nAmazon India Emerging Payments team is looking for software developers who are passionate to design and build the next generation Payments product from the ground up. Once built this highly reliable and scalable product will provide a new payment gateway to hundreds of millions of Amazon India customers.\n\nThe team will require learning and using latest AWS technologies including: AWS Dacia, AWS Kinesis, Lambda, SNS, SQS, Server side encryption on DynamoDB using client managed keys, API Gateways, AWS VPC, AWS NLB, Cloud trail, Elastic search, etc.\n\nAdditionally the team also provide opportunities to learn and work on Machine learning, interacting and influencing Amazon third party partners like Banks (SBI, HDFC, etc), and NBFCs like CapitalFloat, Bajaj Finance, etc.\n\nThe platform will be designed to support other emerging economies having similar requirements and the role provides a huge opportunity for the developers to build a strong portfolio of patents for Amazon.\n\nDevelopers in the team need to have a strong understanding of computer fundamentals and preferably experience in building large scale distributed systems.\n\nExperience with web-based applications and/or web services-based applications, especially at massive scale, would also be helpful.\n\nWe are open to hiring candidates to work out of one of the following locations:\nBengaluru, KA, IND\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalentJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}