{
    "Job ID": "69866821",
    "Description": "About the jobOur Team:Sanofi Global Hub (SGH) is an internal Sanofi resource organization based in India and is setup to centralize processes and activities to support Specialty Care, Vaccines, General Medicines, CHC, CMO, and R&D, Data & Digital functions. SGH strives to be a strategic and functional partner for tactical deliveries to Medical, HEVA, and Commercial organizations in Sanofi, Globally.Main responsibilities:The Manager, US Transparency Operations & Reporting is an internal and external customer facing role responsible for autonomously managing the manual and automated processes primarily associated with (but not limited to) external / third party transparency data sources including data collection, analysis, error remediation, certification, and training. This position possesses an intermediate understanding of US transparency regulations, Company transparency policies and assumptions, and applies this knowledge in an appropriate manner enabling Sanofi to submit complete, accurate and on-time transfer of value to the government as required by law.The overall purpose and main responsibilities are listed below:Leads source onboarding/training to ensure Sanofi US Transparency transfer of value requirements and due dates are clearly communicated to sources.                       \nManages the Transparency automated BOT process to ensure source data are received and validated; works with digital to resolve BOT issues.               \nPerforms quality review on received data and manages necessary remediation      .          \nResolves data discrepancies from Transparency Data Mart (TDM) to MediSpend.                 \nEvaluates outlier data and manages necessary remediation. Drill-down and follow-up with the stakeholders to get the necessary answers and data.                       \nRemediates Data Issue Resolution (DIR) cases in TDM.            \nResolves duplicate transactions .          \nPerforms trend and variance analyses.             \nIdentifies data gaps, takes action to drive improvement, and informs Director of potential Company risk.                   \nProduces analytics independently, in visually clear formats and automates where possible.\nEnsures appropriate process and system controls.        \nEnsures audit readiness by maintaining accurate and complete documentation .          \nHelps to identify and implement innovative and/or adaptive approaches to optimize transparency processes, eliminate data errors and reduce manual workload.                    \nApplies knowledge of US Transparency regulations, Sanofi US policies and US Transparency Assumptions to ensure transfer of value data captured from sources is complete, accurate and reported on-time to the government as required by law.                       \nMeets periodically (minimum semi-annually) with external sources during US business hours.\nFacilitates source certification.\nInteracts with US Transparency Team during US hours for knowledge transfer, problem solving, risk identification & mitigation, team building.           \nDemonstrates Company values and Play to Win behaviours.People:\nMaintain effective relationship with the end stakeholders within the allocated GBU and tasks – with an end objective to develop education and communication content as per requirement\nActively lead and develop SGH operations associates and ensure new technologies are leveraged\nInitiate the contracting process and related documents within defined timelines; and\nCollaborate with global stakeholders for project planning and setting up the timelines and maintaining budget\nPerformance:\nRefresh Existing Reports and identifies improvement opportunities in reporting and BI tools and as needed structure / functionality with the latest insights as they become available\nCreate dashboards to synthesize and visualize key information and enable business decisions\nWorks to develop deal tracking analytics and reporting capabilities\nCollaborates with Digital to enhance data access across various sources, develop tools, technology, and process to constantly improve quality and productivity\nProcess:\nSupport delivery of projects in terms of resourcing, coordination, quality, timeliness, efficiency, and high technical standards for deliveries made by the medical/ field writing group, including scientific documents and clinical/medical reports\nContribute to overall quality enhancement by ensuring high scientific standards for the output produced by the medical/ field writing group; and\nSecure adherence to compliance procedures and internal/operational risk controls in accordance with all applicable standards\nRefresh report on frequency/cycle basis (weekly/monthly/quarterly/annually), along with QC checks for each refresh\nStakeholder: Work closely with global teams and/ external vendors to ensure the end-to-end effective project delivery of the designated publication/medical education deliverablesAbout youExperience:\n7+ years of experience in pharmaceutical industry. In-depth knowledge of common databases like IQVIA, APLD, Veeva, Transparency Reporting tools  etc.\nSoft skills: Strong learning agility; Ability to manage ambiguous environments, and to adapt to changing needs of the business; Good interpersonal and communication skills; strong presentation skills a must; Team player who is curious, dynamic, result oriented and can work collaboratively; Ability to think strategically in an ambiguous environment; Ability to operate effectively in an international matrix environment, with ability to work across time zones; Demonstrated leadership and management in driving innovation and automation leveraging advanced statistical and analytical techniques\nTechnical skills:\nBachelor’s degree from an accredited four-year college or university.\nAt least 5+ years direct experience with pharmaceutical industry.\nKnowledge of pharmaceutical industry research & development processes involving collaboration with HCPs & HCOs\nFederal Open Payments transparency operations & reporting experience\nMS Excel Intermediate expertise\nMS Access expertise / SQL programming/ relational database management / logic mindset.\nInformation systems (IS) experience & proficiency in systems such as: QlikSense; SAP; Concur; CRM tools (e.g. Veeva); Aravo; Reltio (customer master); SharePoint; Transparency Reporting Systems (MediSpend/AggSpend360 etc.).\nAbility to produce relevant analytics from large datasets independently, in visually clear formats that are validated and quality checked before submitting to supervisor\nCommunicates clearly with leadership, US Transparency Team and source stakeholders.\nPrioritizes tasks by due date and mission criticality.\nDetail-oriented (demonstrates attention to detail) & organized with updating & saving work instructions and file version control.\nActively listens & follows direction as explained to meet expectations.\nPossesses confidence to ask questions & assess risk.\nAccepts constructive feedback & integrates feedback on an ongoing basis moving forward.\nAbility to solve complex issues that may involve several stakeholders.\nAbility to think outside-of-the-box (i.e. success and comfort working in the 'grey' vs 'black-&-white' tasks)\nProactively seeks new tasks & ensures regular touchpoints with task lead (take action), rather than wait for tasks to be assigned\nDemonstrates continuous improvement mindset.\nAutomation experience\nExperience with project accountability & management to ensure defined deliverables are achieved\nInfluence without authority\nAbility to identify risk and know when to escalate to leadership.\nSystem enhancement testing\nEducation: Advanced degree in areas such as Management/Statistics/Decision Sciences/Engineering/Life Sciences/ Business Analytics or related field (e.g., PhD / MBA / Masters)\nLanguages: Excellent knowledge in English and strong communication skills – written and spokenAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}