{"Job ID": "69865539", "Description": "JOB DIMENSIONSThe position reports to Head of HSE Operational Safety & Crisis Management, in this context She/He will work in close collaboration with the other departments.\nThe job holder will receive specific guidelines from the Head of HSE Operational Safety & Crisis Management to ensure safe implementation of both the Clients’ and regional emergency requirements on site.\nIs the focal point to prepare and coordinate safe emergency response (OSR included), as well as providing periodic reviews and controls of emergency response methodology and equipment support to site.\nAssist with managing and responding to HSE emergencies on site Key Contacts: Internal Communications: Field Operations, Drilling, Construction, RSES, RSES-D, Medics, Security team External Communications: External intervention teams, Occupational Health Consultancies, Peers in other organisations / Stakeholders.Maintain a high awareness of industry and professional best practices to ensure continued high level Emergency Response Preparedness.\nMaintenance and development of TEPRH Emergency Response Management System.\nAdvise, clarify and assist IMT in their roles during the mobilisation of IMT and CMC.\nFollow-up of Action Plan concerning Emergency Response: incorporation of lessons learned from real training, exercises, live responses and any other relevant sources into existing plans and procedures as appropriate.\nAssistance and advice to assets, entities and projects on all relevant Emergency Response issues including the development of emergency and crisis procedures, plans, and contingency arrangements through regular Sites visits including project sites during civil works.\nUpdate the Emergency system in the offices and accommodation. Train Fire wardens in the accommodation.\nTraining, coaching of the Emergency Response team.\nOrganisation and coordination of appropriate training for the emergency response organisation: Crisis Management Cell, Incident Management Team, Advanced Command Post. Develop an annual training schedule.\nOrganisation, implementation, and debriefing of exercises defined in the yearly planning (Tabletop Exercises, Medium Scale Exercises, Full Scale Exercises).\nAudits Site exercises and implement Action Plan following the Exercises.\nDevelopment and maintenance of emergency response Cells and response facilities. This includes, IST systems, Communications and practical tools, maps, forms based on IMS system.\nAssist with ensuring the Clients’ project management system relating to fire safety is fully implemented on site.\nAssist in preparation and communicating information relating to incidents (Rex+).Accountable for the development and issue of Emergency Response themes, producing lessons learned and REX+.\nAccountable for providing specialist direction in Emergency Response preparation organisation/management/ supply service.\nAccountable for providing Emergency Response expertise and best practice to the teams.\nEnsure ongoing interface and liaison is maintained with key stakeholders i.e. Internal and External Response teams.10 years’ experience in emergency responses and Crisis management. 5 years in oil and gas.\nExperience 4 years In IMS (Incident Management System) IMS300 qualified. 5 years in Crisis Management and communication (CMC) with GEC training qualification.\nAbility to communicate and network in a complex and multicultural organization. Initiative, reactivity.\nTrained to lead investigations of significant accidents/incidents.\nWritten and oral communication in English is essential/mandatory.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Basra, Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}