{"Job ID": "69869958", "Description": "The Bosch Group is a globally recognized provider of technology and services, excelling in Automotive Technology, Industrial Technology, Consumer Goods, Energy, and Building Technology. With a strong presence in India, the Group operates through nine companies and boasts an impressive workforce of over 400,000 associates, including approximately 20,000 dedicated to research and development. Among its subsidiaries, Bosch Rexroth AG stands out as a leading expert in drive and control technologies. Changing scenes on the theatre, production lines that automatically adapt to new products in the factory of the future, always sufficient power for moving slice gates that weigh several metric tons, and mobile machines conquering narrow forest trails or the largest construction sites in the world: Creating movement is our driving force.As a global partner, Bosch Rexroth stands by mechanical and plant engineering challenges worldwide, armed with cutting-edge technology and unparalleled industry expertise. With a dedicated workforce of over 32,300 employees, we strive to deliver safe, efficient, intelligent, and powerful solutions. Our team excels in enabling cost-effective production of small batch sizes and optimizing energy consumption while boosting productivity. Equipped with a diverse cross-technology portfolio, digital services, and comprehensive support, we are committed to being your ultimate partner for machines and plants. With us, movement is synonymous with success. WE MOVE. YOU WIN.As a subsidiary of Bosch Rexroth AG, Bosch Rexroth India is not just a leading provider of drive and control technologies; it is also a fantastic place to build a rewarding career. With its strong commitment to employee development and well-being, Bosch Rexroth India creates an environment that fosters growth, innovation, and collaboration with proven track record of  turnover of 1300cr+. The company values its talented workforce and provides ample opportunities for learning and advancement, with a focus on promoting a healthy work-life balance. As part of the Bosch Group, Bosch Rexroth India benefits from the global organization's resources and expertise, allowing employees to be a part of groundbreaking projects and cutting-edge technologies. Furthermore, the company's inclusive and diverse culture encourages creativity and teamwork, making it a great place for professionals seeking a dynamic and fulfilling work experience. At Bosch Rexroth India, employees are not only part of a renowned organization but also empowered to make a real impact in driving the future of technology and engineering. WE MOVE. YOU WIN.Project Purchasing:Manage NPD Purchase / Sourcing and Vendor Development activities for platform, application projects –  Fabrication , Casting , machined , Bought out Components and Sub-assemblies, includes target cost setting.\nResponsible for achievement of quality, cost and delivery targets.\nPrepare supplier selection - includes RFQ process, supplier evaluation, communication and participation in sourcing decisions.\nRepresentative in PEP Process.\nInterface with: Central Purchasing, material field related purchasing and quality department.\nEnsure preventive quality planning (VQP) for project specific new parts and coordination of their release.\nCoordinate RPP activities.\nChange management for procured parts.\nRequirement based travel - domestic and internationalDegree in Engineering / Bachelor's Degree -  Mechanical/Electrical/Production with 3 ~ 8 years relevant experiencePractical commercial and project management experience.\nAnalytical and structural approach.\nWork well independently, highly motivated, results oriented.\nExcellent communication skills, verbal and written and interpersonal skills, with the ability to communicate effectively with all levels of the organization, both internally and externally\nStrong organizational skills and prioritization skills with the ability to handle  multiple projects at one time, including following up on his/her actions\nAbility to develop network in very complex company culture.\nSAP, MS Office, SharePoint, Microsoft Team experience required.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}