{"Job ID": "69866162", "Description": "Institutional Credit Management’s (“ICM”) objective is to provide an integrated “end-to-end” credit underwriting, identification, measurement, management, monitoring and reporting for wholesale credit businesses across the enterprise.  Institutional Client Group (ICG) In-Business Quality Assurance is an integral part of the ICM organization. The ICG In-Business Quality Assurance function (QA) verifies that established standards and processes are followed and consistently applied. ICG Management uses the results of the quality assurance reviews to assess the quality of the group's policies, procedures, programs, and practices as relates to the management of wholesale credit risk. The results help management identify operational weaknesses, risks associated with the function, training needs, and process deficiencies.The ICM Head of In-Business Quality Assurance reports results of Quality Assurance Reviews (QARs) providing feedback, insight, and observations on any deficiency and areas of improvement, engaging with the management of the respective ICG business area, Independent Risk, and critical partner stakeholders and regulators.This role reports with the line of ICM In-Business QA, Function Head – Counterparty Credit RiskKey Responsibilities:Support the Head of CCR In-Business Quality Assurance on the discussions to define the Quality Assurance function and Reviews across ICG coverage universe\nProvide effective credible challenge during QARs to Business Region Heads and Portfolio Managers, as regards to memo and process quality to ensure that weaknesses in such processes are identified and escalated as appropriate\nSupport in the establishment of processes that enable wholesale credit risks within Citi are effectively identified, measured, monitored, and controlled, consistent with the bank’s risk appetite and all policies and processes established within the risk governance framework\nUnder the supervision of the ICM In-Business Quality Assurance – Financing and Securitisation QA Manager, support on the executing of the following:\nConsistent and objective assessments during QARs\nSubsequent follow-up on corrective actions that were raised during QARs            \nSustainability testing of corrective actions resulting from issues raised by Internal Audit or Regulators\nSynthesize and prepare quarterly Quality Assurance Scorecard Reports to ICG business management that communicate and measure results and identify negative trends and potential solutions\nSupport WCR IBQA function in the establishment of WCR IBQA policies, procedures, risk assessment and controls to drive effective QA coverage and standards\nSupport In-Business QA Head of Financing and Securitization to stay abreast of relevant changes to rules/regulations and other industry news including regulatory findings.\nSupport the Global Head of WCR IBQA on internal projects and initiatives\nSupport ICM Voice of the Employee (VOE) initiatives\nTravel (less than 10%)Knowledge/Experience:Credit / Counterparty Credit / Quality Assurance:Demonstratable quality control / quality assurance experience, including 5-7 years in banking, credit risk management, internal audit, loan review or quality assurance review function at an investment or large commercial bank\nSolid understanding of risk management and control frameworks related to Counterparty Credit Risk management or another Financial Risk discipline\nGood understanding of counterparty credit risk modelling (including PFE, Stress and SIM model) including calibration and backtesting and the limitations there of.  Understanding of best-in-class standards in modelling and model risk management.\nAbility to understand complex counterparty credit product structures including derivatives and well-versed in securitisation and credit financing products.\nInsights over key counterparty credit risk themes such as Stress testing, Early warning indicators, Wrong way risk, exposure modelling including PFE, collateral (full understanding of ISDA / CSA protocols and complexities) and margining processes including key regulations (uncleared margin rules and IMM) and CVA.\nStrong background on core credit analysis for large corporate and finance industries to properly evaluate process and quality breaks within the quality assurance function\nIdeally, credit officer or analyst or operational credit risk background, with experience on day-to-day credit functions associated with analysts and risk approval.\nGood grasp of counterparty credit risk covered process, to evaluate findings within the Quality Assurance process, determine materiality, and partnering with in-line makers and checkers for ongoing improvement, problem detection, and sustainable remediation\nHigh awareness and adherence to the control environment including Quality Assurance and Quality ControlLeadershipStrategic orientation to ensure the ICM organization continues to be positioned as a thoughtful and proactive partner on driving best practices to support safety and soundness within ICM and Citi\nAssists colleagues in identifying stretch opportunities to elevate individual and team performance and recognizes individuals based on performance\nCoach, mentor and lead team members to develop team strengths and build bench strength  \nProven culture carrier CompetenciesStrong organizational skills with ability and willingness to work under pressure and manages time and priorities effectively with little supervision\nDeveloped interpersonal skills, with the ability to build relationships and exert influence with and without direct authority\nSound written and verbal communication skills, with the ability to communicate clearly and concisely to audiences of varying levels of seniority\nSignificant experience in preparing presentations for seniorsTechnical: Intermediate Microsoft Office (Word, Excel, and PowerPoint) skillsQualifications:BA/BSc or higher degree in Business (MBA), or any other related subject-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}