{"Job ID": "69865537", "Description": "Job Requisition ID #Position OverviewYou will join a diverse group of finance professionals who are highly engaging, unique, and a lot of fun to work with. This is what you can expect: dynamic and challenging work, a flexible environment, and a collaborative team. Autodesk’s vision has evolved to “a better world designed and made for all”. Through this evolution, we are shifting from product to platform, complemented by world-class experiences that help customers achieve their goals for today and their aspirations for the future. To make this a reality, the Chief Operating Officer (COO) organization was created to effectively transform how customers experience Autodesk and how we do business with them, directly and through partners. The COO organization includes key go-to-market functions such as Worldwide Sales, Worldwide Marketing, and Customer Success. It also includes key enablement functions such as Global Revenue Operations, Digital Experience & Customer Empowerment, and Enterprise Systems & Experience. The combination of these pivotal functions together in the COO organization will bridge strategy and execution more effectively to accelerate revenue growth. At the same time, we are applying our technical capabilities to the employee experience so that the entire enterprise has the systems and tools to do their best work every day.This role is part of the COO Finance – Spend Portfolio Management (SPM) team which manages the overall spend portfolio for the COO organization. Our mission is to partner with stakeholders and deliver actionable insights to make ROI-driven decisions that optimizes Autodesk’s growth. Now more than ever, there is a critical need for us as the finance team to be the co-pilots and guide the way towards optimization and scalability. The goals for the COO Finance – SPM team are to establish unified standards and operations around spend management for the entire COO organization, while designing and implementing a new centrally-managed ROI framework where all key initiatives are prioritized consistently with proper success measures.This Senior Finance Manager is one of the key people who will make these goals a reality. We are looking for a trusted team member who has experience in managing a spend portfolio and leading cross-functional team members. This role will own overall spend management processes and analyses for the COO Finance organization, including budget planning, monthly forecasting, and quarter-end. This role will report to the Senior Director of COO Finance – Spend Portfolio Management (SPM) and will begin building out a team of analysts in India.ResponsibilitiesDevelop and build out a team of analysts in India to support the broader SPM team and different business functions\n\nPerform analyses and deliver data-backed insights in support of annual budget planning, monthly forecast cycles, and quarterly close processes for the COO organization\n\nEstablish clear service-level agreement and operating model for the SPM India team to manage spend management deliverables and engage with stakeholders across COO Finance team\n\nManage team that will own various quarter-end activities including preparing journal entries and reporting quarterly landing positions for the COO organization\n\nCollaborate with other SPM leaders to maintain an ongoing framework that drives successful measurement and tracking of spend across the COO organization\n\nInvolvement in COO-wide strategic spend initiatives through ad-hoc analyses, financial models, or presentations\n\nActively participate in SPM staff meetings and projects/initiative discussions to drive efficiencies and enhancing existing finance workflowsHow You Will Spend your DayPartner with impact: You will forge authentic, trusting relationships with stakeholders across COO Finance & SPM while empowering them to make decisions, navigate successfully through change, and optimize their spend portfolio\n\nDrive Financial Excellence: You will manage a team that drives spend budget/forecast accountability with all COO Finance stakeholders to maintain acceptable accuracy in monthly forecasts and compliance with accounting regulations You will help implement unified standards across the COO Finance teams in order to drive scalability\n\nDerive Insights from Data: You will identify trends and deliver actionable insights from data by leveraging technology and the COO Finance Business Architects team. You will craft focused narratives to actively communicate findings and perspectives backed by data in a simple, concise mannerMinimum Qualifications15+ years of relevant experience\n\nPrior experience in spend management, forecasting, and financial modeling\n\nPrior management experience\n\nAbility to collaborate and partner effectively with a variety of stakeholders\n\nHighly adaptable and independent thinker\n\nExcellent communicator and strong time management abilities\n\nStrong analytical/modeling skills\n\nAbility to flex from attention to detail to having a macro lens and driving scalable process improvements/solutionsPreferred QualificationsSuccessful candidates should have prior experience in spend management, a strong collaborative mindset, independence, and proven ability to flex between doing and guiding/developing strong teams\n\nStrong professionalism, clear articulation of stories beyond the data/numbers, and effective prioritization/time management skills are crucial#LI-AV1Learn MoreAbout Autodesk\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.We take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.When you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!Salary transparencySalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.Diversity & Belonging\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belongingAre you an existing contractor or consultant with Autodesk?Please search for open jobs and apply internally (not on this external site).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}