{
    "Job ID": "69866834",
    "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a  more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.In this role, you will be responsible for managing the program and operations in our Sales Operations team. Your primary role will be to work cross-functionally to help facilitate the conversations and bring projects/initiatives to completion.General (40%)Own production of agendas, meeting notes, scheduling key sessions, and collaborating and producing presentations\nOwn building of organizational charts, distribution lists, and calendars of key initiatives to manage and support the business\nWork with cross-functional teams to collaborate, arrive at decisions and plans of action, and execute for (add departments)\nCoordinate large internal and external meetings.\nPlan team offsites, business reviews, etc.\nBook multi-city travel for the senior leadership team as requested\nPrepare extensive travel expense reports for the senior leadership team as requested\nPrepare monthly expense reports for senior leaders Programs (30%)Support the execution of the strategy and program development; coordination includes cross-functionally partnering with the practice leaders and their teams to ensure each implementation has consistency across scope, definition, work product, plan management, and ensuring projects are delivered within scope, quality, time, and cost requirements.\nDrive accountability through the matrixed program and project plans and frequent status updates and communications; expect to drive alignment across all GTM functions.\nManage regularly scheduled, detailed, and accurate program and project plans with supporting metrics. \nCommunicate status updates on programmatic and project initiatives; understand the details to write these communications on behalf of management.  Operations (20%)Ensure management of all GTM business operations. Business Operations include business support, back-office operations, internal systems, and process improvement across customer success, channels, marketing, products, etc. \nResponsible for defining business processes, documenting and raising systems requirements, and deploying improvements, rollouts, and launches (globally and across theatres)  \nContinue to enhance and improve processes, methodology, governance, and tools within the business. \nPartner with back-office organizations (i.e., ecosystem, legal, IT, HR, sales operations, and finance) to resolve issues, drive improvements, and prioritize enhancements Reporting and Dashboard Creation/Management (10%)Own reporting to track the cross-functional operating metrics against key goals, weekly status reports as well as the creation of all dashboards\nWork with all functions (marketing, support, product engineering, business development, and finance) to deliver comprehensive dashboards and reports necessary to run the business.Strong Business Acumen in a high growth technology company\nExperienced in providing EA and Executive level support for programs, projects, and coordination\nBS, BA degree preferred#LI-EV1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}