{
    "Job ID": "69875350",
    "Description": "Relationship Manager, Corporate Banking (UAE nationals only) - 0000JFT8Some careers grow faster than others.If you’re looking for a career that will give you plenty of opportunities to develop, join HSBC and your future will be rich with potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC Commercial Banking (CMB) serves millions of businesses ranging from small, to large corporates, providing commercial customers with a full range of banking services including Global Trade and Receivables Finance, RMB solutions, multi-currency business accounts, payments and cash management, and wealth management and insurance, as well as a comprehensive range of financing solutions. With dedicated Relationship Managers and Product Specialists providing local support and advice in over 60 countries and territories, HSBC helps connect customers to opportunities.We are currently seeking an ambitious individual to join our Commercial Banking team, working together with colleagues to define, manage and achieve divisional business targets.In this role, you will:Act as Relationship Manager by offering value-added advice and guidance to customers and placing their needs at the forefront of all that we do, setting world class standards\nGrow sustainable revenues from existing* customer portfolio and through targeted acquisition of quality new* customers\nStructure credit facilities to ensure optimum balance between customer and HSBC interests within the bounds of prudent banking\nProactively develop effective strategies to manage relationships, both existing and new, by anticipating customer needs and providing superior quality services resulting in increased wallet share.\nKeep up-to-date on knowledge of HSBC’s international and domestic strategy, capabilities and policies.\nKeep abreast of external factors influencing international and domestic business e.g. economic, cultural, geographical, procedural and regulatory requirements.\nIncrease profitability, relationship depth while minimizing risk.\nGenerate cross country referrals facilitated via Global Links and local or overseas IBC, whichever appropriate.\nWork with product partners (such as Global Payment Solutions, Trade, Insurance) to assess needs of international and domestic customers and offer appropriate solutions.·Align to MTO and Area Operating Targets defined by the Group (Revenue, RWA, RoRWA).·Build a network of business introducers in the local professional and business communityJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}