{"Job ID": "69873347", "Description": "If you need assistance during the recruiting process due to a disability, please reach out to our Recruiting Accommodations Team through the Accommodation Request form. This form is used only by individuals with disabilities who require assistance or adjustments in applying and interviewing for a job. This form is not for inquiring about a position or the status of an application.Associate Manager, VR Technical SupportYou are passionate about Customer Experience and travel technology. You have implemented innovative ideas and built workflows to ensure customers consistently have a delightful experience each & every time they interact with your team. You have a strategic mindset but can roll up your sleeves to tactically execute. You possess a genuine desire to build career paths for your team, share your knowledge and industry best practices, and create an environment where people are energized, motivated, & want to grow their careers.The position is responsible for leading and developing a Technical Support team for Vacation Rentals. The Associate Manager is tasked with balancing the requirements of effective supervision of a high volume, action packed technical support team, with providing leadership and training for the team in a fast-changing environment.What you'll do:Build and maintain an effective local Technical Support team that is part of a global, collaborative team imbued with a culture of empowerment and resolution\n\nDevelop relationships with multiple internal teams to identify skills and develop knowledge needed to build a highly effective Technical Support team, adding value to our customers, product teams, and development organizations\n\nContribute to the overall success of the global team by providing feedback, sharing information, and collaborating on best practices\n\nInspire and gain commitment from others towards the vision, mission, values, and organizational goals\n\nEnsure team members meet performance and effectiveness expectations by setting clear expectations for operational performance, conducting one-on-one meetings, preparing weekly team meetings, reviewing individual and team goals, and providing construction coaching and feedback\n\nIdentify and resolve issues that may impair the team’s ability to meet team goals\n\nExercise critical thinking, problem-solving skills, and use sound judgement to address urgent issues efficiently and effectively\n\nAnalyze and leverage data to identify problem areas, make business decisions, and improve team processes\n\nIdentify opportunities for process improvement, engage with appropriate teams to create and deliver solutions to improve the effectiveness and efficiency impacting the Technical Support team\n\nDevelop a strong partnership with frontline teams through regular meetings, knowledge sharing, and addressing frontline concerns in a timely manner\n\nLead day-to-day processes and other duties as assigned\n\nDrive complex issues escalated from customers all over the world to resolutionWho you are:Diploma, University degree, or equivalent experience\n\nMinimum 2 years leadership experience leading a 2nd level technical support team in a tiered support structure\n\nTechnically savvy and efficient in troubleshooting end-to-end troubleshooting complex environments across multiple internal teams\n\nExperience supporting the Incident Management Process\n\nA strong team player able to work well with differing personalities\n\nStrong leadership skills including with effective performance management and coaching/feedback techniques\n\nHave strong organization and analytical skills, with attention to detail and accuracy\n\nExperience with data logging and monitoring tools such as Splunk, Kabana, New Relic, DataDog\n\nExperience with Business Intelligence tools and data analysis such as SQL, Querybook, Tableau, etc.\n\nDemonstrate a data-led approach, combining data, context, research, and expertise to make business decisions\n\nSolid written, oral skills with ability to communicate effectively with both technical and non-technical clients\n\nExcellent problem-solving skills, including issue tracking, triaging and crisis management\n\nKnowledge of Lodging distribution, aka OTAs\n\nExperience reviewing, creating, and modeling technical specifications\n\nITIL, Agile, or SDLC experience, including Kanban boards and roadmaps\n\nSoftware QA experienceAbout Expedia GroupExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.© 2021 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50Employment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals to whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}