{
    "Job ID": "69873474",
    "Description": "The CI Sales Enablement Team is setting up a team of Sales Admin Associates that will help unload the Commercial team of Finance/Revenue related admin work. This person will be part of a global team but assigned to specific markets within the Top 15 CI markets and will be reporting to the CI Sales Enablement Team.Key ResponsibilitiesNOTE: As this is a new role, the responsibility list may be modified along the way, depending on progress.GENERAL ROLE● Single point of contact for the Commercial and Finance teams, to liaise on Finance/Revenue related requests.● Go-to person from the Commercial side on all Finance related processes, platforms and documents so he/she can advise on actions accordingly.● Responsible for ensuring that all key cut-off dates based on the Monthly Closing Calendar are strictly adhered to.PIPELINE MANAGEMENT● Update MS Dynamics opportunity on CS behalf (i.e. stage, project dates, billing dates, other details)NOTE: CS will still be in charge of opportunity key-in.● Advise on opportunity set-up in MS Dynamics (e.g. GDF, syndicated studies, trackers, etc.)PROJECT COMMISSIONING● Finalize MS Dynamics opportunity and send for approval.○ New SAP account creation○ Billing instructions○ Final contract details○ EOA and/or PO● Raise WBS# request for exception cases (i.e. pending EOA) and follow up on WBS# after gatekeeper approval.CREDIT CHECK● Raise credit check request to Finance and follow up.PO CREATION IN SHOPPING CART/PO NUMBER REQUEST● Raise shopping cart request on CS behalfBILLING/INVOICING● Review and approve proforma invoices on CS behalf (details to come from CS)● Follow up with the Billing team on sending invoices to clients, if needed.● Review and follow up on unbilled items w/ Finance in the BCC calls.● Raise credit memo request for invoice revisions/ cancellations.REVENUE RECOGNITION● Follow up on FW start dates○ Check if projects to launch in next 2 weeks are on track; if not, raise an SAP change request○ Follow up with Ops on FW start confirmation, if needed● Follow up on EOD○ Check if projects to deliver in next 2 weeks are on track; if not, raise an SAP change request○ Follow up with CS team on pending EODs● Ensure changes in dates are reflected correctly in SAPOTHERS● Support on getting requirements for proposal bidding or new vendor accreditation● Other Finance/Revenue related ad hoc requestsAt least 1 year work experience related to Project Management/coordination w/ multiple stakeholders or Finance\nFluent in English\nSolid communication skills both written and verbal\nTechnologically capable - can work/learn to work with our Microsoft suite, MS Office, MS Dynamics and PowerBI\nFinance knowledge and/or Market Research industry knowledge is a plusAbout NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Sharjah, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}