{"Job ID": "69875548", "Description": "Job Requirements·        Extensive Experience of working in Agile, rapid test driven and prototyping development environment.·        4+ years of experience for Developer and 6+ Years for Sr. Developers on Java/J2EE technology stack and Adobe CQ5/AEM with building blocks including templates, components, dialogs widgets and bundles.·        Lead technology teams to build and maintain web applications using Adobe’s Experience Manager CMS to include site architecture, custom components, workflow development, and Digital Asset Management (DAM).·        Develop digital consumer experiences based on foundation of the Adobe CQ/AEM product suite, including CQ/AEM, CRX, CQ WCM.·        Design and improve internal development methodologies around Adobe AEM solution·        Experience in Web development frameworks and web services such as REST, JSON, SOAP, Spring, Structs. Exposure to modern JS frameworks such as BackboneJS, Angular.·        Integrate websites with web analytics tools and analyze/report on analytics data.·        Experience with related JAVA technologies HTML5, CSS3, Java Script, JQuery, and Java Content Repository (API) suite·        Propose technology solutions to enable the business to meet/exceed business goals. Deliver a robust self-service environment for the end user community.·        Design and code from specifications, analyze, evaluate, test, debug, documents and implement complex software apps.·        Create and integrate content-driven applications on top of AEMs core platform and integrate with E-commerce solutions and search engines.Keywords: AEM Developer, AEM Full Stack Developer, Full Stack AEM Developer, JavaScript, Java, React, HTML, CSS, Angular, web services, REST, SOAP, benefitsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}