{
    "Job ID": "69870012",
    "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Candidate Characteristics  ·        Formulate strategy/approach to guide Teams’ achievement of their target outcomes (Predictability, Quality, Efficiency) through application of agile methods ·        Flexibility in wearing different hats such as a Servant Leader, Team Coach, Facilitator, Mentor, and Change agent of the team  ·        Facilitate identification and removal of systemic impediments ·        Familiar with a wide-range of Lean-Agile methodologies, Scaling frameworks and practices ·        Ability to apply the most fitting methodologies to different challenges such as combined software and system development ·        Strong ability to work in a team (Empathetic, adaptive, and positive mind-set) ·        Performance-driven, results-oriented, conflict resolution skills Tactical/Operational: Understand the Project dynamics and challenges to build an Agile working model that is appropriate for the team \n\nTrain the team on Agile methodologies as necessary \n\nFacilitate Agile ceremonies as Agile master (Planning, Daily Stand ups, Backlog refinement, Review and Retrospective) \n\nDesign and configure agile project management tools (like ALM) to support the team in better organizing and executing their work Actively support the team and PO in identification and removal of impediments \n\nDiscuss with leadership/management of a team define the KPI and monitor the progress made and potential impediments that is blocking or slowing down the team \n\nFacilitate a collaborative workshop for a team pursuing solution to current problems or improvement opportunities \n\nObtain team’s feedback on a recent agile practice that was experimented \n\nExchange a strategic/tactical idea with a fellow agile coach/Scrum Master to improve the performance of a team Actively participate in agile communities and workshops and cascade the best practices within the organization Required: BE/B.Tech Electronics/Electrical/computer science/Mechanical \n\nMinimum of 5-10 years of professional work experience Agile Practitioner: Minimum of 3 years of experience working in project that was diligently applying Agile/Scrum practices as a Product Owner/Agile Master/Agile Team member \n\nKnowledge and/or experience with well documented Agile, Scrum tactics/techniques: Planning poker, Burndown/burn up, CFD, retrospective formats etc  Teaching & Mentoring: Ability to provide training in structured(classroom) and unstructured environments. Ability to share knowledge and skills that foster personal and professional growth of others. Coaching as scrum master: Ability to partner with teams in a thought-provoking and creative way that inspires them to maximize their potential. \n\nAbility discovers their needs, encourage self-discover and self-generated solutions. \n\nAbility to firmly hold them accountable for the committed improvements/action. Facilitation: Ability to function as a neutral facilitator who can guide teams through processes that help them come to solutions and make decisions. \n\nExcellent communication skills and ability to work with all levels of the organization.  Transformation: Ability to effect positive change in the teams/organization as a change catalyst Desired: Completion of Bosch Internal Agile training programs or external Agile/Scrum Coach or Scrum Master certifications \n\nKnowledge of tools like IBM ALM (jazz.net) or similar for Agile project management   \n\nKnowledge of Embedded software development and Braking systems is an added advantage Knowledge of technical practices like TDD, CI, pair programming, automated testing At least 3~8 year experience in Embedded software developmentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}