{"Job ID": "69876423", "Description": "Ready to get to know us?May the tech be with us.Can’t stop, won’t stop!A vision focused on positive impact.All team members are equal.About the TeamWho doesn’t love growth? The Growth Team connects people to many categories online with the most innovative marketing strategies. The team also analyzes data to make great decisions in the competitive marketplace through relevant and timely communication with our customers and sellers to maximize their experience.What will keep you super-motivated here?Your Main ResponsibilitiesBeing a part of a data driven culture and work to create advocates,\nWork closely with the entire Customer Experience team,\nProvide analytical support to the Customer Experience department,\nPerform analyses to come up with useful insights to help improve business processes,\nOwn all dashboards and build new tools to improve the visibility of metrics in the department,\nWork on exploratory data analysis so you can navigate a dataset and come out with broad conclusions based on initial appraisals,\nProven ability to relate and solve business problems through statistics,\nSynthesize methodology and data into actionable business strategy and communicate findings to management teams to drive business impact.Qualities We Are Looking ForBachelor’s degree in quantitative field (mathematics, computer science, engineering, statistics, MIS etc.)\n2-5 years of hands on experience in the field of data analytics,\nStrong data management skills (data preparation, data representation, data quality management etc.)\nStrong data analytical and problem-solving skills (analyze, interpret, model etc. )\nKnowledge of statistics concepts and methods\nExperience in SQL is a must, working knowledge in Python is preferred\nCapable of working across boundaries and functional areas\nFluency in EnglishJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}