{
    "Job ID": "69872876",
    "Description": "Job Responsibilities• Analyze, research, and resolve payroll queries received from employees/managers or any authorized personnel. Must be able to work in an efficient and effective manner and respond to the customer in a professional manner. This includes the ability to understand, interpret, and explain JPMC NA Payroll.• Manage cases, perform in-depth research, identify resources for providing information, follow through to obtain information, and resolve cases efficiently and thoroughly, meeting both volume and quality service measurement standards. • Process cases which will include all aspects of an employee's pay, either while the employee is active or on a Leave of Absence from the firm according to federal/state/local guidelines and regulations.• Understand and able to calculate various payments and Overpayments which may include leave pay and vacation.• Communicate with HR Business Partners, answer questions, and provide updates as needed.• Explain provisions of prior plans and impact of mergers/acquisitions, etc. on plans and benefits. • Coach and mentor new team members, answer questions, and provide assistance when needed.* Active participation in various test activities like, test scripts for UAT, provide input to project team on current pain areas and need for simplification.QUALIFICATIONS:• 2+ years experience in Payroll Services, Benefits Administration or Human Resources (preferred)• Four year college degree or equivalent experience• Exposure to ServiceNow, HRMS systems, Cloud based HRMS e.g. Oracle Cloud, WorkDay (preferred)• Ability to work a flexible schedule, which may include occasional weekends and extended shifts to meet business needsSKILL SETS:• Strong customer service ethic, communication skills (written and verbal), interpersonal skills, and telephone etiquette. • Strong organizational skills and ability to effectively prioritize.• Ability to multi-task in a fast paced environment.• Ability to quickly absorb product knowledge and process information and apply appropriately to customer’s needs.• Analytical skills are required to identify issues and trends and develop solutions and/or recommendations.• Interact with corporate Human Resources professionals and executives in a professional manner.• Excellent problem solving skills with the ability to make sound business decisions, along with perseverance in obtaining information needed to resolve questions or issues. Use multiple information resources to research problems and issues.• Handle situations that require adaptation of response or extensive research.• Calm and diffuse irate customers by following procedures and using interpersonal skills.• Advanced problem solving skills.• Make sound business decisions and exercise good judgment skills with the understanding of when to escalate issues.• Flexible and adaptable to changes in procedures, processes, systems, etc.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}