{"Job ID": "69873975", "Description": "American Express invites you to share your resume so you can be considered for future \"Assistant Relationship Manager\" opportunities in our Delhi based office.You Lead the Way. We’ve Got Your Back.With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.Roles & Responsibility :·    This is a front-line Sales position in the Consumer Cards Sales team, and is responsible for driving business, achieving monthly sales targets and acquiring new customers through consultative selling of our cards products via defined channels of acquisition [Retail, Corporate, Venue-sales]·    Prospecting for new customers through existing leads and cold calling and maximizing lead generation·    Timely execution of all sales activities – leads, campaigns, referrals & any self generated leads·    Tracking and reporting sales performance including pipeline, acquisition results and market conditions·    Set appointments, listen to customer needs and sell most appropriate product·    Researches and understands prospects before making the call·    Ensures all applications are fully and accurately completed, and submitted properly·    Be the interface between Amex and the customer to resolve any application processing issues·    Drive the on-boarding of new customers and initiates spend enablement activities·    Keep up-to-date on products and competition·    Attend and participate in regular staff meetings·    Engages in regular portfolio planning to determine areas of focus & project accurate full year forecasts·    Attend relevant industry and partner conferences, tradeshows and networking events·    Ensuring all performance standards are met viz. business targets, controls and compliance·    Engaging with premium customers to build relationships, and delivering a positive customer experience while acquiring new customers expansion of internal and external relationships, and drive sales resultsQualifications : Educational Background Required:·    MBA or GraduateExperience Required:·    Minimum 6 months of front line/field sales experience in financial services domain.  Candidates with more than 12 months of experience in B2C, IT sales, Ecommerce, Travel, Lifestyle, Healthcare, Real Estate can also apply.Skills Required:·    Consultative selling experience·    Proven track-record of meeting and exceeding sales goalsCompliance LanguageWe back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:Competitive base salaries \nBonus incentives \nSupport for financial-well-being and retirement \nComprehensive medical, dental, vision, life insurance, and disability benefits (depending on location) \nFlexible working model with hybrid, onsite or virtual arrangements depending on role and business need \nGenerous paid parental leave policies (depending on your location) \nFree access to global on-site wellness centers staffed with nurses and doctors (depending on location) \nFree and confidential counseling support through our Healthy Minds program \nCareer development and training opportunitiesAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.  Offer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Delhi, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}