{
    "Job ID": "69873835",
    "Description": "Honeywell Process Solutions (HPS) is a pioneer in automation control, instrumentation and services for the oil and gas; refining; energy; pulp and paper; industrial power generation; chemicals and petrochemicals; biofuels; life sciences, and metals, minerals, and mining industries. A leader in digitization, Honeywell delivers software and services that help customers overcome competitive pressures and uncertain market conditions to achieve game-changing business outcomes. Honeywell's comprehensive portfolio in process control, monitoring, and safety systems and instrumentation provides optimized operations and maintenance efficiencies to meet diverse automation needs.Purpose of the Job\n \nThe purpose of this role is to lead small size project team (3-5 engineers) that implements engineering solutions of Honeywell control systems (DCS -Experion PKS / ESD -Safety Manager / and other Honeywell control systems (HC-900 / HS-81 / XLS-3000 /), to successful completion and within budgeted time and cost constraints. And to be technically responsible for the overall technical design and technical scope of the systems and/or solutions in scope of the project, fully in line with Honeywell standards, design rules and guidelines. To support the implementation of projects in line with P&AS objectives including engineering, ordering, configuration, testing, and site activities to achieve margin improvement, customer satisfaction, schedule, working capital and safety performance.\n \nPrincipal ResponsibilitiesHoneywell DCS/ ESD system Engineering, Configuration, Ordering and Testing. \nLearn the end-to-end product/solution development and delivery/execution of Honeywell products and solutions.\nModifying and editing HMI Graphics.\nSupervise and implement site activities.\nActs as technical interface with customers, establishing professional relationships to ensure that the technical project requirements are fully defined, agreed, and delivered within schedule and cost constraints.\nActs as technical interface to 3rd party suppliers to assure correct functionality of the 3rd party deliverables including the correct integration of those deliverables in Honeywell systems or solutions.\nEnsures that required prerequisites (e.g., design inputs, tools, documentation, deliverables, schedule, budget) are in place prior to commencing work.\nProduces and/or approves functional and detailed design specifications and provides technical leadership, support and expertise for the project team.\nEnsures that the engineered solution meets project requirements, across all disciplines, in terms of functionality, Honeywell standard designs & design rules, quality, and supports documentation and implementation process at minimum cost by optimizing use of global productivity tools and other Standard Builds deliverables.\nMonitors and controls technical project scope against the Project Execution Plan and Functional & Detailed Design Specifications, ensures effective change control and identifies risks / opportunities.\nProactively recommends potential quality and efficiency improvements and shares technical knowledge back to and the project team.\nReports progress and technical problems and/or changes to project manager.Bachelor's Degree in in engineering from reputable university (The following department are preferred: Electronics and Communication, and Electrical Power.Skills and Work Experience Required Minimum 4 years of project experience.\nMinimum 4 years of experience with at least one of Honeywell control systems (DCS EPKS – SM – PLC s – XLS3000) \nFamiliar with international engineering standards.\nFamiliar with Networking. \nCustomer interfacing experiences.\nGood communication skills.\nGood Command of English; speaking and writing.\nTravel requirement is expected to be 25- 50% (domestic and internationally)JOB ID: HRD208030\nCategory: Engineering\nLocation: Taha Hussein St, Cairo Festival City-fifth settlement,,Building A2, Southern, level2,New Cairo,CAIRO,171-11835,Egypt\nExemptJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}