{
    "Job ID": "69873486",
    "Description": "IntroductionYour Role and ResponsibilitiesThe Managing Consultants will provide subject matter expertise in the form of workshops, and consulting engagements, which assess a client’s security capabilities, which could be in the policy, process, technology or organizational areas, identify gaps and recommend cost effective best practices to reduce client risk and increase their handle on security risk. Having hands on implementation experience is a requirement of this position as well at deep technical knowledge of Security Governance tools. The Managing Consultant will have delivery ownership and assist in pre-sales and sales.Description of SkillsSecurity Domain SkillsThis position requires knowledge across multiple platforms, processes or architectures. This position requires security consulting skills and the ability to act as a trusted client advisor and a trusted technical lead for the team. The Managing Consultant will need to have skills to be able to work with other IBM teams and:\n• Deliver strategic Cybersecurity Compliance advisory services\n• A proven record of security thought leadership and be recognized for business and technical acumen Cyber Strategy and Risk services\n• Depth of knowledge in one or more of the core security areas in Cyber Strategy and Risk such as Risk Management/Cloud Security/ OT Security/ SAP Security/e-GRC.\n• Understanding of compliance issues (ISO 27001, SSAE 16, COBIT, NIST, PCI DSS, GDPR etc) and Regulatory requirements.Core consulting skills\n• Strong communication and presentation skills\n• The ability to lead large groups and be a primary facilitator and lead.\n• Strong written skills\n• Comfortable working in a project based / client serving model\n• Ability to lead and shape client expectations\n• Help drive pursuits and engage in complex deals, matching outcomes to expectations\n• Ability to work easily with diverse and dynamic teams\n• Ability to work in a matrix management model\n\nRequired Technical and Professional Expertise\n• At least 5 years relevant consulting experience in Cybersecurity and regulatory compliance domain\n• Hands on solution design and deployment of Security Governance tools.\n• Experience in delivering IT, OT, Cloud security compliance audits and control frameworks.\n• Experience with industrial control systems (ICS/ OT) security\n• Experience with Cloud security solutions\n• Experience in defining and reporting key performance and key risk indicators\n• Experience in developing scope and sizing solutions for a project.\n• Experience in Security Governance, Security Process, and Security Policy and Standards design\n• Be responsible for executing consulting engagements in the areas of Risk Management and Compliance.\n• Ensure quality delivery as per IBM/client requirements.\n• Proactively identify project risks and escalate to project stakeholders\n• Actively establish & strengthen relationships with external and internal customers\n• Assist in developing knowledge assets such as methodologies, templates, white papers etc.\n• Work in a team and guide less experienced members in the team\n• Identify potential business opportunities on existing consulting engagements.\n• Suggest ideas on improving engagement productivity and identify opportunities for improving client service\n• Readiness to travel\n• Languages: English, Arabic\n\nPreferred Technical and Professional Expertise\n• +5 years in GRC Cybersecurity, Compliance Management, and related experience\n• Bachelor’s degree or master’s degree in technology or Cybersecurity\n• Experience working with offshore teams\n• Certified in CISSP, SSCP, CISA or CISM\n• Strong understanding of Information Technology, IT Security and CybersecurityJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}