{"Job ID": "69873273", "Description": "As the world’s largest family of luxury hotels, we all take great pride in being genuine ambassadors of the InterContinental® brand. Shaped by decades of international know-how and local insights, our passion for luxury travel spans cultures and customs. Inspiring us to create warm and sophisticated experiences for those seeking a richer perspective on the world.Each of our hotels cultivates a distinctive style and ambiance where we embrace every opportunity to give our guests a personal and enriching experience. If you’d like to embrace a wider world of experiences and opportunities, we’d like to welcome you to join InterContinental Dubai Marina as Housekeeping Pool Attendant.InterContinental Dubai Marina is a Five Star luxury hotel in the heart of Dubai Marina with 328 rooms and residence suites, flexible event space and restaurants & bars. With over 30 languages and countries represented by the staff, the hotel weaves together an international five star presence.Your role will be including but not limited to:Greet guests warmly and assist them with their needs while at the pool\nEnforce pool rules and safety guidelines to ensure a secure environment for all guests\nPerform regular checks of pool water quality and report any maintenance issues promptly\nDistribute towels, poolside amenities, and refreshments to guests as needed\nProvide information to guests regarding pool hours, services, and activities\nCollaborate with the lifeguard team to respond to any safety-related incidents\nCleaning of the pool deck and surrounding areas in line with brand standards Ideally, you'll have some or all the following qualifications and experience we're looking for:Proven experience of 2 years in hotels preferably \nExceptional customer service and communication skills\nAbility to work well in a dynamic environment & work cohesively with fellow colleagues as part of a multi-national team\nPhysical fitness for outdoor work and the ability to lift and move pool equipmentWe’ll reward all your hard work with a great salary and benefits and the chance to work with a fantastic team of people. In return we'll give you a competitive financial and benefits package and the chance to work with a great team of people. Most importantly, we'll give you Room to be yourself.So what's your passion? Please get in touch and tell us how you could bring your individual skills to IHG by clicking \"Apply Online\" now!We are an equal opportunities employer.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}