{
    "Job ID": "69873642",
    "Description": " Join Yazaki. Connect to the future. Country: Türkiye (TR) \nCity: Sakarya \nWorksite / Location: [[division_obj]] Job Function: [[department_obj]] \nJob Discipline: Quality Assurance Methods \nJob Family: Quality Assurance Methods Yazaki Corporation, a family-owned company, was founded in 1929 as the first Japanese manufacturer of automobile wiring harness systems. Within the automotive business our product range includes wiring harness systems, plug connection systems and electronic systems. More than 284,000 committed and highly motivated employees in 478 locations in 45 countries make us one of the most successful international automotive suppliers. To strengthen our team, we are looking for a Quality Engineer, Quality Assurance Methods. \"•     To create control plans of the incoming parts from Suppliers accordint to the YEL Incoming Incpection Procedure and to support to be modified.\n•    Monitoring and responsibility of the PPAP/PSW status of the parts used on the product.\n•    Providing technical support for the analysis of NOK materials in production\n•    Making decisions by analyzing 8D reports from suppliers.\n•    If necessary coordinating the sorting of suspicious parts with suppliers.\n•    Informing the supplier  and Yazaki logistics department in order to receive replacement instead of parts blocked due to quality problems.\n•    Ensuring that losses such as line stoppage and scrap cost caused by part quality problems are invoiced to the suppliers.  \n•    Reviewing supplier performance and asking action plans from suppliers for improvement,\n•    Fully authorized to stop the line in case of quality risk in production.\n•    Preparation of monthly supplier performance report  \n•    Supporting the Incoming Inspection personnel and providing support for the works that the Incoming inspection department is responsible for.\n\"        \n\"*Using measurement equipments.\n*Quality Problems management and system input  (entering the daily Incoming inspection records into the computer),\n*Ability to manage NOK product flow,\n*Ability to manage abnormal status report and flow.\"        \n\"* To comply with ISMS policies,\n* Comply with the privacy statement and disciplinary procedure\n* To accomplish its responsibilities in corrective and preventive activities of ISMS,\n*Reporting security incidents and violations to the relevant departments,\n* To have information about KVKK processes and to ensure that they are implemented within the department.\"        \n\"* Preparation of inspection plans for new parts according to the technical drawing in GBDP-Fastcheck.\n*Creating  request from TDC Tool for missing PPAP\n* Timely and detailed reporting of part quality problems to suppliers using GQRS-C\n*  Preparation of weekly and monthly reports requested by YEL Supplier Management via Power BI \"        \n\"* To follow up scrap separation practices within the department, to ensure the use of safety materials and to implement emergency instructions\n* To continuously monitor the occupational health and safety risks / environmental impacts of the department. Notifying HSE officials when there is a change,\n*To inform employees about HSE and to ensure that they act in accordance with HSE rules.\"        At Yazaki, we are committed to providing equal employment opportunities for everyone regardless of race, color, religion, sex, age, marital status, national origin, disability, handicap, veteran status, or other legally protected status or characteristic. Equal opportunity extends to all aspects of the employment relationship. We are looking forward to receive your application and to get to know you. Please apply by clicking the 'Apply Now' button. We wish you all the success in your application! Ps. Didn't found what you are looking for?\nTake a look at our careers page! Be carefull though, you might find your next dreamjob.. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}