{"Job ID": "69873586", "Description": "- Deliver water and waste water infrastructure project for new data centers in India.\n- Work with internal customers and vendors in India to deliver AWS water sustainability goal.\nAmazon Data Services India Private Limited (ADSIPL) is looking for a results-oriented individual to join the AWS water infrastructure team in India. In this role, you will provide engineering and due diligence support for ADSIPL’s new and existing India projects related to water-based cooling system infrastructure in India. For new projects, you will be responsible for executing multiple water projects across different geographies in India, conducting due diligence on water and wastewater infrastructure solutions, negotiating directly with water utilities, evaluating cost and schedule to deliver water, and ensuring smooth start-up of new water infrastructure. At existing sites, you will support AWS operations and engineering teams to operate and troubleshoot water treatment systems. You will develop metrics, communicate performance to technical teams and senior leadership, and be the subject matter expert for all issues pertaining to water infrastructure and risk analysis. You will deliver water sustainability projects for AWS Infrastructure in India. You will also be the central point of contact for all issues pertaining to water and waste water treatment and disinfection systems and for managing healthy relationships with utilities in India.\nYou will play a key role with due diligence and site selection efforts in existing and new regions in India by compiling and analyzing geographical location and specific prospective site information, including (i) permitting land use data, (ii) data on water and waste water availability and cost, (iii) reliable back up supplies and availability of alternate water sources.\nKey job responsibilities\nThe Water Resources Manager will be responsible for the following:\n•Work with internal engineering, operations, real estate and risk and resiliency teams to manage water and waste water service delivery at new and existing ADSIPL facilities in India.\n•Develop and execute comprehensive water infrastructure delivery for ADSIPL infrastructure expansion.\n•Recommend AWS water based cooling launch strategies for new regions in India based on in-market and desktop due diligence.\n•Ensure that all water systems at existing sites in India are operating effectively and will not adversely impact operations.\n•Identify and develop cost savings projects and initiatives related to water infrastructure and supply in India. Responsible for completing due diligence on in-market opportunities and developing those opportunities into cost saving for India business.\n•Track and manage reliability and maintenance of water systems, as well as the resiliency of sources of water supply required for data center cooling. Never constrain business growth.\n•Work with internal teams to trouble shoot problems and conduct Root Cause Analysis (RCA) and Corrective Action (CA) for design and fleet deployed water systems.\n•Deliver projects that directly support water sustainability goals\n•Work on concurrent projects in multiple regions in India. 20% regional travel for site review and conduct engineering evaluations, audits, and site launches.\n•This position is based in Mumbai\nWe are open to hiring candidates to work out of one of the following locations:\nMumbai, MH, IND\n•Bachelor’s Degree in Mechanical/Chemical/Civil Engineering/Economics/Business\n•7+ years’ work experience delivering water infrastructure and engineering solutions for capital-intensive projects across diversified industries.\n•5+ years of project-related experience working with local or state government agencies, utilities, site development due diligence and/or permitting entities.\n•Strong understanding of mechanical/plumbing related to data centers/buildings including but not limited to: chillers (air-cooled and water-cooled), pumps, cooling towers, heat exchangers, air handling units, air economizers.\n•Strong analytical and commercial skill set to review utility tariffs, water projects and contracts.\n•Knowledge or skills in excel macro/programing, python, SQL or data analytics tools such as Tableau\n•The ability to manage multiple simultaneous projects requiring frequent communication, organization, time management, and problem-solving skills and ability to recommend actionable decisions with limited data.\n•Proven record of accomplishment for cultivating strong relationships with external stakeholders in different geographies.\n•Strong Bias for Action with an ability to look around corners and deliver results for the business.\n•Candidate must be able to communicate in international language, this skill refers to an ability to speak, write, and read the language fluently.\n•10+ years of direct experience with the construction, operation, or maintenance of water infrastructure across different global regions.\n•Advanced degree in Mechanical/Chemical/Environmental/Civil Engineering/Economics\n•Experience with fast track design/build projects and or multiple significant upgrade projects and ability to work with multiple stakeholders with varied requirements.\n•Analytical mindset that can identify gaps in requirements during project development, predict performance, and have the ability to provide recommendations on a short notice and with limited information.\n•Experience with IT infrastructure, data centers, and cloud services.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}