{"Job ID": "69873779", "Description": "About Jumeirah & the Hotel:Jumeirah Group, a member of Dubai Holding, has been making a distinguished impact on the global hospitality market for more than two decades with its Stay Different™ brand promise. Its award winning destinations, such as the iconic Burj Al Arab Jumeirah, position service beyond expectations, elevated signature dining destinations and surprising architecture and design at the heart of every guest experience. Today, Jumeirah operates a world-class portfolio of 26 properties across the Middle East, Europe and Asia and employs over 8,000 colleagues, representing over 106 nationalities. As Jumeirah continues to expand its global portfolio and scales up its operations to the next level of growth, it remains fully committed to developing and empowering our colleagues to excel in world class environments. Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity. A sustainable hospitality leader in the capital, Jumeirah at Saadiyat Island Resort is a breadth of fresh air offering an eco-friendly stay amidst contemporary surroundings on the Abu Dhabi coastline. Surrounded by natural beauty and conceived to care for every aspect for guest wellbeing, the resort resembles a perennial summerhouse where visitors can experience Abu Dhabi Island life at its best. The luxury beachfront resort is home to seven world-class restaurants and bars, three swimming pools and the award-winning SPA featuring an extensive menu of specialized treatments and exclusive products from all around the world. In addition to this, guests can utilize wide range of leisure facilities including a mixed and ladies-only gym, a kids club and a tennis court. Boasting 400 meters of pristine private beach and sand dunes, the resort is anchored on one of the most desirable beach locations in the UAE and was conceived with the environment in mind having implemented eco-friendly strategies and initiatives since its launch in 2018. About the Job:An opportunity has arisen for a Lobby Ambassador to join our Front Office Department in Jumeirah at Saadiyat Island Resort. The main duties and responsibilities of this role: Be the live and soul of the lobby, creating a positive environment and maintaining an engaging, approachable, helpful and friendly demeanour to colleagues and guests alike \nAcknowledge, greet, welcome, engage & initiate genuine adaptive conversation with guests and visitors facilitating the smooth operation of the lobby, obtaining feedback and assisting in creating memorable guest experiences\nProvide historical and cultural facts of the destination and be a story teller for Jumeirah and the unique hotel differentiators / interesting facts\nProvide latest information on the Hotel’s outlets, amenities, services and facilities, actively upselling and making reservations\nMaintain the Insider’s Tablet fully updated with the latest Hotel, Jumeirah Group and Destination information including product, services, events and experiences for all guests’ profiles\nRespond to any guest requests for particular services (e.g., directions, transportation, reservations, dry cleaning, celebrations, other) by making arrangements with the relevant departments and following up to ensure satisfaction.\nEngage in adaptive communication with guests and visitors and ensure smooth flow at the lobby at all times\nRemain present at the lobby to exemplify brand image \nPromote, Upsell and cross sell hotel services and facilities\nRecognize all repeat and VIP guests and visitors\nEnsure complaints and feedbacks are logged, communicated and resolved according to the Jumeirah standards\nIs a constant source of information, help and assistance to all guests\nCo-ordinate house tours/site inspections with the relevant parties\nTake corrective action when required to improve safety of working areas\nHandle, record and respond to guest’ complaints and feedback according to Group standards, cooperating with all the required stakeholders for their effective resolution and management.\nRecord guests’ preferences and supervise the guests’ Profile Notes archive, spot checking both quality and usefulness of the information and preferences captured and addressing gaps in order to enable colleagues to enhance the guests’ Jumeirah Experience further. \nMust be able to perform any other duties as may reasonably be requested by the management.About you:The ideal candidate for this position will have the following experience and qualifications:1-2 years experience in guest relations environment \nLuxury hotel experience is a plusAbout Benefits:We offer an attractive tax-free salary, paid in Dirhams (AED), the local currency of the UAE. In addition, we offer generous F&B benefits, reduced hotel rates across our properties globally, excellent leave and health care package, flights home, life insurance, functional incentives and other employee benefits making the role attractive to high performers and any applicant looking for a career with one of the most luxurious brands in the hospitality industry.  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}