{
    "Job ID": "69873412",
    "Description": "About UsA little curiosity can take you anywhere. So, at Hotel Indigo ®, we do more than satisfy our guests' curiosity, we inspire them. Our passionate colleagues help create memorable and unique experiences for our guests; in a place truly connected to the local neighbourhood, infused with intriguing design and local flavours. Where every day brings new discoveries, fresh experiences, and unexpected ideas.And just like our hotels, no two colleagues are the same. So, we’re curious about YOU. How will you inspire the eclectic rhythm in our hotels? How will you bring the local neighbourhood story to life? At Hotel Indigo® hotels, we’re excited to meet spirited characters who can delight the most curious guests.The hotel boasts 269 tastefully decorated rooms, each thoughtfully designed to reflect the hotels neighbourhood story; the story of Dubai creek. Your Day to DayIn a nutshell, as Risk and Security Supervisor, you will be responsible for the safety of guests, employees and hotel property. You will coordinate and organise the day to day Hotel security operations and supervise Security Officers.You will assist with the implementation of departmental standards and ensure that all colleagues adhere to the Risk and Security procedures. You will also assist with preparing security plans for special events and assist with all Risk and Security trainings. What We Need From YouAs the first lifestyle branded hotel of IHG in the Middle East, this exciting chance really is something to be part of. This is a great opportunity for talented hospitality and Security professionals to step up in their career and experience a new challenge in a trendy lifestyle brand. You'll report to the Risk and Security Manager, and you will play a big role in supporting the overall success of the hotel.The right fit for this role is someone who has solid hotel background with a team player personality. You should be passionate about people and hospitality. Excellent communication and problem-solving skills are essential. You should be correct, secure and courteous when handling any disciplinary or criminal case. Ideally, you should have at least 3 years’ experience in Risk and Security Operations. If you are this person, we’d like to meet you.What We OfferJoin us and not only can you benefit from the world of variety and opportunity that comes with working for a global organization, you can also look forward to being part of a company that will appreciate you for being you. We’ll reward all your hard work with a great salary and benefit package.What’s more, because your career will be as unique as you are, we’ll give you all the tailored support you need to make a great start with IHG, be involved and grow. So, whoever you are, whatever you love doing, bring your passion to IHG and we’ll make sure you’ll have room to be yourself. Find out more about joining us today by going to careers.ihg.comJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}