{"Job ID": "69870352", "Description": "Temporary English-speaking Housekeeper required in Notting Hill, London, £3,750 gross per month, live-out, start 1st of September for 2 months.\nA returning client is seeking a temporary housekeeper to support the running of their 5-bedroom family home, located in Notting Hill.\nAs a Housekeeper, you will be responsible for the upkeep of the family home. You will undertake daily duties to maintain the home to a high standard including, cleaning, washing, ironing, shopping and running errands to ensure the smooth running of the household.\nIn addition to this, you will be required to deep clean, and maintain the outdoor spaces, light cooking may be required when the chef is off duty. Working with outside vendors, ensuring supplies for the family home is kept up to date, and assisting the principals with packing/unpacking before and after travelling.\nThe ideal candidate will be a hard-working experienced housekeeper. Being a fluent English speaker is essential for this role. Previous experience working in a fully staffed household is beneficial to your application along with being a team player. You must have an eye for detail with laundry and be willing to cook light meals when the chef is off duty.\nThe working schedule will be from Monday to Friday, working approximately 9 am until 6 pm daily. Flexibility is required\nThis is a live-out position with no accommodation provided. This position is only suitable for candidates located nearby\nThe position is to commence 1st of September for 2 months. The role may be offered as a full-time position for the right candidate.\nPackage:\n£3,750 gross per month\n5-day working schedule\nRequirements:\nEnglish-speaking Housekeeper\nExperience working in private households\nCommitted and hard-working\nAvailable to start September the 1st for 2 months.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}