{"Job ID": "69873047", "Description": "Applies developed knowledge of the job skills, company policies and procedures to complete a wide variety of difficult assignments/tasks. Thorough understanding of the general/technical aspects of the job. Works on assignments that are moderately complex in nature and require ordinary problem resolution and independent judgment. Works under limited supervision and normally receives no instruction on routine work and general instructions given for new assignments.Responsibilities:Maintain high level Customer satisfaction by clarifying Customer needs and ensuring that they are met.\nHandle Customer-relation problems promptly and appropriately, escalate issues according to established procedures.\nProvide software service, post- sales or service delivery support and solve applications problems for remote or local accounts, on standard and specialized systems.\nProvide direct post-sales systems technical support to end users and HP Authorized Service Providers.\nSolve technical problems on an assigned hardware and software platforms.\nUse proactive monitoring procedures/tools to identify problem prevention opportunities.Education and Experience Required:\nMinimum Vocational/Diploma/ Associate Degree (technical field) equivalent with 2-4 years of working experience in related fields or Degree holder with 1-2 years relevant working experience.Knowledge and Skills:Knowledge of corporate organization, job, and policies.\nAdvanced knowledge of operating systems and software.\nBasic skills in project management.\nStrong communication skills, problem analysis, and presentation skills.\nAbility to develop Customer relationships.\nAbility to perform while under high-pressure situations.\nAbility to work in a team environment.\nBasic networking, O/S, and troubleshooting knowledge.\nDetailed understanding of general/technical aspects of the onsite system repair job.About HPYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.Our history: HP’s commitment to diversity, equity and inclusion – it's just who we are.From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}