{"Job ID": "69873646", "Description": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. \nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!At Adobe, we understand that our customers sometimes face interruptions in their work, and that's where you come in. As a Technical Support Specialist, your primary role is to partner with our valued customers, providing efficient technical support to ensure they can resume their work promptly. We take pride in offering top-notch customer service, and we are looking for someone who shares our commitment to excellence.Key Responsibilities:Provide professional and proficient chat, phone, and online support to global customers using products such as Photoshop, Lightroom, Bridge, Camera Raw, and Substance3D.\nAdhere to established processes and policies in all customer interactions, ensuring a consistent and high-quality experience.\nStrive for First Call Resolution and maintain detailed documentation in English for all customer interactions.\nAssess customer sentiment and escalate issues when necessary to ensure a seamless resolution process.\nDevelop a deep understanding of our products, common issues, emerging trends, and escalation procedures.\nRecognize the business impact of issues and possess a general understanding of both Windows and Mac operating systems and application operations.\nIdentify and address top issues as detailed by our Support Product Managers.Requirements:Skills and Characteristics:Hold a technical degree with 1-2 years of proven experience in a technical role.\nPossess strong digital literacy and a strict adherence to company policies.\nDemonstrate excellent interpersonal and communication skills.\nExhibit a calm and flexible attitude with the ability to work independently.\nPrioritize tasks effectively and manage time efficiently.\nAdvocate for customer needs and champion them within the organization.\nBe available for flexible working hours on a rotational basis to provide 24x7 support coverage.Knowledge & Technical Skills Required:Have 1-2 years of demonstrated professional experience in a technical role.\nPossess superior account management and customer relationship skills.\nDeeply understand Windows operating systems, with knowledge of Mac OS being a plus.\nMaintain an intermediate understanding of packaging and deploying various Adobe products and versions.\nShow self-motivation and a commitment to staying current with emerging technologies.\nPossess excellent English written and oral communication skills.Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}