{"Job ID": "69874015", "Description": "Whats on your plate?Operations:Manage & plan the forecast for all stores to drive a seamless operational flow. \n\nDevelop a strategic approach to operational plans for the team members in store, managing the execution of these plans to drive impact and results.\n\nOptimize current space within stores by supporting the team in planning the requisitions effectively.\n\nEnsure menu availability is 95% & above for all stores. Determine and implement options to correct sales underperformance or to maximize sales opportunities.\n\nLead the key store operating metrics and drive them at an optimal level.COGS & Inventory Management:Responsible for managing COGS of individual stores. Address challenges, assist the team to fix them by deep diving and problem solving.\n\nOrdering, Receiving, and Transferring of stocks are accurately inbounded from suppliers & intra-stores.\n\nEnsure recipes and master supplier files are accurately set-up on POS leaving no room for discrepancies.\n\nEnsure compliance related activities are closely monitored and adhered to.Quality Standards:Ensure food & beverage quality is monitored for all stores\n\nFeedback/ Customer complaints are tracked frequently. Apply a customer recovery plan wherever needed.\n\nDrive hygiene & food safety practices within stores to ensure local regulations are met.Training & Development:Supporting new launch initiatives by training team members on products.\n\nManage overall development of the team by effective coaching.What did we order?5 years of operations management experience within the hospitality or food service industry.\n\nMulti-site management of a stores (Dark store or Cloud kitchen experience is a big plus)\n\nExperience in a complex fast-paced environment.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bahrain", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}