{
    "Job ID": "69875314",
    "Description": "Durée de la mission : 1 anMissions :Effectuer l’analyse, le design et le développement des nouvelles fonctionnalités en utilisant les librairies et Framework appropriés, au niveau backend.\nCollaborer avec les autres développeurs pour la mise en place et l’intégration des services backend.\nProduire les tests unitaires et d’intégration visant à valider la qualité des fonctionnalités développées et à s’assurer de leur non-régression dans le cadre de développement futurs.\nCollaborer avec l’équipe d’assurance qualité afin d’élaborer les scénarios de tests et de les accompagner dans l’automatisation des cas de tests.\nParticiper à la mise en place, au suivi et à l’amélioration continue des pratiques de développement de l’équipe.\nParticiper aux choix technologiques et aux choix d’évolution de l’architecture.\nCollaborer avec les autres membres de l’équipe de développement et de l’équipe QA afin d’atteindre les objectifs de l’équipe dans les temps impartis et avec un haut niveau de qualité.Profil recherché :Avoir 4 ans d'expérience pratique en développement logiciel sous Agile.\nAvoir une Expérience en bases de données relationnelles, MYSQL (MySQL Workbench), PostgreSQL (pgAdmin) ;\n Excellente compréhension et expérience sur les technologies :Backend: Java 11+, Spring Boot (web, data-jpa, test, security), maven, IntelliJ/Eclipse. \nFrontend: Angular 4+, React 16+, Typescript, Javascript ES6 2015+,VSCode/Webstorm, HtmI5, CSS3\nTransverse: Git, Git workflow, Gitlab (developer side: merge request, pipeline, code--Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}