{
    "Job ID": "69875544",
    "Description": "Duties & Responsibilities:Engage in selling of accounts including qualification, demonstration, clinical evaluation and closure.\nWork with appropriate sales staffs in selling and closing key account whole-house conversions.\nPosition Masimo SET as the new standard for pulse oximetry.  Participate in programs to build and maintain end-user awareness (e.g., trade show, regional symposium, competitive analysis, advertising, etc.), \nProvide marketing input to upper management including market trends and competitive activity. \nInterface with senior level managers to maintain mutual understanding of product design needs, regulatory, and production requirements. \nPrepare and maintain budgets for all activities.\nParticipate in sales efforts for IDN’s.\nMaintain thorough product knowledge including ability to demonstrate products, position products vs. competitive products and inservice end-users.\nCreate/maintain list of forecasted business for provision to V.P. Corporate Sales.Minimum & Preferred Qualifications and Experience: Minimum Qualifications:Minimum five years experience in a key account sales role within an organization. Must be a mature thinking and acting professional with good common sense and judgment, and a broad business perspective with outstanding administrative skills.\nVery high bandwidth individual dedicated to Masimo and chosen career. Highly intelligent, perceptive individual who possesses excellent conceptual, analytical, problem-solving and organizational skills.\nMust be results oriented with a positive \"can do\" attitude and a sense of urgency to get things done.\nExperience working in both large structured and small entrepreneurial organizations.  Must be sensitive to the constraints of a \"start-up\" operation and capable of working effectively in such an environment and possess the flexibility in reacting to new situations and adaptability for working in a new environment.\nDirect selling experience in competitive, strategy-intensive markets.\nExperience working with sales forces.\nExperience calling on administration and C-Level executives.\nComfortable in high visibility situations and exhibits strong self-confidence.\nMust be a self-starter; a \"hands-on\" individual who enjoys challenge and is dedicated to getting the job done with minimal support and direction.   Must be accustomed to a heavy travel schedule.\nMust be PC literate, have excellent organizational, communication, writing, and project management skills.ducation:Bachelor’s degree required.  Nursing degree desired.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Najran, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}