{
    "Job ID": "69875337",
    "Description": "THE CHALLENGEEventbrite is a people-first organization. Our goal of building the global platform for live experience relies on the foundation of top talent and strong company culture. Our team is focused on developer experience and architecture. Our ideal candidate is someone that is willing to work on deep problems and can also explain and help others learn and adopt solutions.THE TEAMWe work on foundational aspects key to making our Development teams successful. We are responsible for the efficiency of the software development lifecycle for our applications. This includes proposing and building new application architecture and building tooling to create a more pleasant developer experience while at the same time keeping our core systems up to date.THE ROLEWe are looking for a creative problem solver and communicative engineer that’s interested in Systems Engineering. This team is a newly formed team in 2023 whose mandate is to increase the speed, quality, and efficiency of the engineering organization. We are at a point wherein the number of services and infrastructure pieces we’re dealing with everyday has become unwieldy and we need highly skilled engineers on the devtools infrastructure team to scale our capabilities. As a Senior Software Engineer you will be responsible for defining, designing, and implementing the infrastructure and tooling that powers the software delivery pipeline.Eventbrite is one of the world’s largest Django-powered sites by request volume. Python, Django, and MySQL are the primary off-the-shelf technologies in our stack. We are hosted on AWS.PySOA, our services framework, builds on these core technologies. Because this team interfaces with many other teams, there’s potential to work with a variety of other backend technologies in our stack, including Redis, Kafka, ElasticSearch to name a few. On the frontend, we make extensive use of React and Redux.1+ years experience developing Docker containers\n1+ years experience working with cloud technologies (AWS preferred)1+ years experience working with software delivery pipelines\n2+ years experience as a software developer\nWillingness to work on a distributed team\nEfficient, practical programmer with a record of producing maintainable code\nGreat communication skills and ability to explain complex technical concepts to a varied audience\nStrong software engineering background and experience with cross-team collaborationExperience with Python or GO\nOpen source contributions\nExperience with defining software delivery pipelines\nExperience with Kubernetes (EKS preferred) \nPast experience as a Site Reliability Engineer (SRE)Experience defining SLOs/SLAs and implementing alerting, monitoring, and writing runbooks\nExperience with Kafka\nExperience with IaC: Terraform and CDK\nExperience with Hashicorp’s products: Nomad, Vault and Consul\nExperience with container securityWHAT WE OFFERWe are committed to providing competitive, valuable and meaningful benefits for our Britelings. We work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong. Employees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.  Read more about our Diversity and Inclusion work for our team, culture, and community.We offer comprehensive benefits and a wellness package above and beyond standard medical benefits to support our Britelings’ lifestyle.Eventbrite's global benefit programs are designed to meet you where you are by offering resources and support for your health, well-being, finances, and family. This includes support in a remote/hybrid environment, wellness allowance, Carrot family planning benefit, Origin Financial Planning service, and other offerings to ease the mind and body like Modern Health and BriteBreaks (generally the first Friday of every month off).ABOUT EVENTBRITEEventbrite is a global self-service ticketing, marketing, and experience technology platform that serves a consumers and event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. With over 280 million tickets distributed for over 5 million total events in 2022, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com.IS THIS ROLE NOT AN EXACT FIT?Sign up to keep in touch and we’ll let you know when we have new positions on our team.Eventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships. #LI-REMOTEApplicant Privacy NoticeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}