{
    "Job ID": "69872688",
    "Description": "Aramco energizes the world economy.Aramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer. With our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.Headquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.We are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.We are seeking a Business Development Specialist to join Origination & Portfolio Optimization Dept.Origination & Portfolio Optimization Dept is responsible for evaluating new business for feasibility, developing financial models and business cases.The Business Development Specialist primary role is to bring insights into various markets, not limited to any sector, to uncover business opportunities that would lead to one of several transaction types, namely, merger & acquisition, joint venture, partnership, divestitures, and / or third-party outsourcing projects.As the successful candidate you will hold a Bachelor degree in Engineering, Business Administration, Finance, Economics, Accounting, Banking or its equivalent from a recognized and approved program. MBA is preferred. Professional certification, such as Chartered Financial Analyst (CFA), Certified Management Accountant (CMA), or Project Management Professional (PMP) certification, is also preferred.You will have a minimum of 10-years relevant experience with exposure to multiple industries. If an MBA or a professional certification is not available, 15-years relevant experience is required. Broad industry experience including but not limited to oil and gas and the broader energy industry, technology, professional services, real estate and infrastructure.Other requirements:Industry expertise or knowledge of conducting techno-economic feasibility studiesKnowledge of venturing activities like commercialization, spin-offs or joint venturing, project developmentStrong finance background including experience of financial valuations and modeling.Background in facilities planning, strategy development or relevant experience.Experience with technology development and deployment.A strong analytical ability to convert raw data and information into intelligence.Education:A BS degree in Engineering, Business Administration, Finance, Economics, Accounting, Banking or its equivalent with an MBA or its equivalent; and with a professional certification, such as Chartered Financial Analyst (CFA), Certified Management Accountant (CMA), or Project Management Professional (PMP) certification.Experience:A minimum of 10-years relevant experience with exposure to multiple industries. If an MBA or a professional certification is not available, 15-years relevant experience is required.\nBroad industry experience including but not limited to oil and gas and the broader energy industry, technology, professional services, real estate and infrastructure.\nIndustry expertise or knowledge of conducting techno-economic feasibility studies\nKnowledge of venturing activities like commercialization, spin-offs or joint venturing, project development\nStrong finance background including experience of financial valuations and modeling.\nBackground in facilities planning, strategy development or relevant experience.\nExperience with technology development and deployment.\nA strong analytical ability to convert raw data and information into intelligence.\nExperience with using at least one popular subscription-based market intelligence tool.LanguageExcellent command of spoken and written EnglishSkillsExcellent writing skills to produce reports to senior management.\nExcellent presentation skills to produce presentation materials with experience presenting to senior management.\nA track record of providing insights into markets that resulted in successful transactions.\n Working environmentOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.At Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.We have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}