{"Job ID": "69873443", "Description": "At Toll, we do more than just logistics - we move the businesses that move the world. Our 20,000 team members can help solve any logistics, transport or supply chain challenge – big or small. We have been supporting our customers for more than 130 years. Today, we support more than 20,000 customers worldwide with 500 sites in 25 countries, and a forwarding network spanning 150 countries. We are proudly part of Japan Post — www.tollgroup.comGlobal Forwarding delivers cargo across our global network via road, rail, sea, and air. From loose cartons for consolidation and palletised cargo to moving dangerous goods and bulk commodities, we have the experience, the infrastructure, and the global network to get freight moving – across towns, across countries and across continents.At Toll Global Forwarding Bengaluru, we are looking for Assistant Manager, sales to join our team. The overall objective of this role is to identify sales leads of corporate accounts, opportunities, and market information. Meet company's sales target by exploring vertical and horizontal growth.As Assistant Manager Sales, your primary duties and responsibilities will include:Drive Revenue Growth of the Corporate / Regional Accounts by ensuring appropriate collaboration across all functions & Products.\nAchieve the Gross Profit Target on Monthly / Quarterly & Annual Basis\nFocus on selling end to end & Value-added solutions across all products according to the strategic priorities.\nDrive Revenue Growth of the Corporate / Regional Accounts by ensuring appropriate collaboration across all functions & Products.\nIncrease Market Penetration of TOLL. Focus on selling end to end & Value-added solutions across all products according to the strategic priorities.\nReview Pipeline, Performance, down trading, loss making and newly gained accounts and project revenue on quarterly basis and take corrective actions where applicable.\nTo achieve Revenue Growth & Margin Enhancement.About you:To be successful in this role, you will need:Bachelor’s degree, with strong Microsoft Excel, PowerPoint presentation and Word skills.\nMust have minimum 3-4+ years of business development experience in the freight forwarding industry.\nKnowledge of global freight forwarding operations and markets with strong selling & presentation skills and have solid experience in dealing with current/next customers. Proactively search for opportunities, able to clarify & solve problems, generate workable & profitable solutions for customers, taking practical and organizational strengthens / constraints into account. \nMust have Good communication skills with strong interpersonal skills and able to build respectful relationship with people from different background. Must be a team player.Be ConnectedWith a bold vision and innovative drive, join our 20,000 colleagues as we lead industry change and transform how customers best meet their global supply chain needs in a meaningful and sustainable way. There are countless opportunities to learn and make a real impact in shaping our industry’s future. Grow with diverse challenges amongst a friendly and inclusive global culture. Take pride in building relationships that matter, because being connected is at the centre of what makes Toll great – it’s what makes our possibilities endless.Toll embraces and celebrates a variety of cultures. We continue to build a business that reflects the values of equality, built on the knowledge and understanding that everyone is welcome including the First Nations Peoples and those of all ages, genders and abilities. If this sounds like the opportunity you are looking for, apply now.To find out more about us visit www.tollgroup.com/careersYou must be entitled to work in India and be prepared to undertake pre-employment checks including a criminal history check and medical. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}