{"Job ID": "69875751", "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob Description·       Üretim hat(lar)ıyla ilişkili KPI'ları yönetir.·       Üretim Departmanı içindeki düzeltici ve önleyici eylemler için karar alma sürecine katılır.·       İş sonuçlarını planlar, gözlemler ve değerlendirir; çalışanlara eğitim ve disiplin verir.·       Çalışanların işlerini yapacak eğitimleri almasını ve bu eğitimlerin belgelenmesini sağlar.·       Personeli bütün kontrol noktalarının, ekipmanların ve kaynakların kullanımı hakkında bilgilendirip yönlendirerek temiz ve güvenli bir çalışma ortamı sağlar.·       Kalite standartları ve prosedürlerine uyumu garanti eder.·       Bütün Kalite ve Yönetim Sistemelri için prosedür ve belgelerin geliştirilmesine, güncellenmesine ve korunmasına yardımcı olur.·       Hammadde ve nihai ürünlerin kalitesini gözlemler.·       Süreçleri ve malzeme akışlarını yönetir ve ekipman kullanımını üst düzeye çıkarmak için çalışır. Malzeme siparişlerini gözlemler.·       Kendi sektöründeki denetimlere refakat eder ve sapma durumlarında düzeltici eylemler uygular.·       Sağlık ve güvenlik yönergelerinin uygulanmasını ve Üretim içinde yönergelere uyulmasını sağlar.Desirable requirements·       Üniversitelerin Gıda Mühendisliği, Endüstri mühendisliği, Veterinerlik, Kimya Mühendisliği, Üretim Mühendisliği, Ziraat Mühendisliği ya da ilgili alanlardan mezun,·       İyi derecede ingilizce bilen,·       Tercihen Gıda endüstrisinde minimum 1 yıl deyime sahip,·       MS Office Programalarını iyi derecede kullanabilen,·       Takım çalışmasına yatkın,·       Planlama ve organizasyon yeteneği güçlü,·       Problem çözme ve analitik düşünme yeteneği güçlü,·       İletişim yeteneği güçlü,·       Vardiya ve alternatif üretim saatlerine uyumlu çalışabilen,·       Çok kültürlü bir çevrede planlı ve uyumlu bir şekilde çalışabilen,·       Bandırma’da yaşayan ya da yaşayabilecek olan.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}