{
    "Job ID": "69873097",
    "Description": " Key Responsibilities are:Partner Performance Management:Identify, onboard, and manage external refurbishment partners.\nSet clear performance expectations and KPIs for partners.\nRegularly assess partner performance and provide constructive feedback.\nDevelop strategies to enhance partner capabilities and efficiency.\nCollaborate with partners to resolve any performance issues promptly.Operations Quality Assurance:Establish and maintain quality standards for refurbishment projects.\nConduct regular quality audits to ensure compliance with standards.\nImplement corrective actions to address quality deviations.\nContinuously improve processes to optimize operational efficiency.\nEnsure adherence to safety and regulatory requirements.Project Delivery Oversight:Monitor project timelines and milestones to ensure on-time delivery.\nCoordinate with partners to resolve any project delays or obstacles.\nImplement project management best practices to streamline processes.\nCommunicate project progress and updates to internal stakeholders.Vendor Relationship Management:Foster positive and collaborative relationships with external partners.\nServe as the primary point of contact for partner communications.\nNegotiate contracts and agreements to secure favorable terms.\nWork with partners to identify areas for mutual growth and improvement.Knowledge and Skills:Excellent understanding of supply chain processes (plan, source, make deliver).\nIdentifies cutting-edge analytical tools, models, and methods for making key business decisions.\nExcellent communication and influencing skills; mastery of English and local language.\nExcellent internal and external relationship management skills.\nExtensive knowledge and understanding of how to analyze business problems using Advanced Microsoft Office skills (Excel, PowerPoint, etc.), statistical analysis, and financial modeling.\nVery Strong project management skills, with the capability to manage cross-functional teams in multiple geographies.\nStrong business acumen and technical knowledge within the area of responsibility.\nExcellent understanding of Material Requirements Planning (MRP), ATP, and master scheduling.\nExcellent understanding of national and international trade requirements to align customs/trade functions with business objectives.\nThorough knowledge of inventory modeling and analysis.\nStrong leadership skills including team building conflict resolution and management.\nExcellent understanding of developing and managing a trade compliance program.Qualifications:Bachelor’s degree in business administration, Operations Management, or a related field (master’s preferred).\nProven experience in operations management, preferably in a partner/vendor management role.\nTypically, 6-10 years of experience in a supply chain function.\nExperience in more than one supply chain function.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal abilities.\nAbility to work independently and lead cross-functional teams.\nProficiency in project management tools and software.\nKnowledge of refurbishment or construction industry practices is a plus.About HPYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.Our history: HP’s commitment to diversity, equity and inclusion – it's just who we are.From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}