{"Job ID": "69872721", "Description": "Scope :Supervise and Lead a team of engineers and designers in carrying out detailed engineering work for medium to small sized projects assuming entire responsibility for conceptual and detailed design and provide necessary technical information for procurement in compliance with tender specifications and within budgeted man-hour and project schedules.Requirement :Bachelors’ Degree with a minimum of 8 & above years (Minimum of 6 years offshore) related to Oil & gas industry experience preferable from a background in working for consultancy or Engineering organizations in the EPC of the Offshore Oil and Gas Industry. Master Degree is advantage. \nHands on experience of SACS/SESAM or equivalent is must. Knowledge of USFOS, GRLWEAP, MOSES etc. is advantage.\nWork experience on at least One EPC project is preferable.Responsibilities :Review ITB (Invitation to Bid) documents and provide technical support to proposal engineering team. Identify software requirements for the project.\nIdentify specialized studies/ subcontract packages requirements and prepare Scope of work.\nEnsure structural design related scope is well understood and captured for cost and schedule purposes.\nPerform responsibility of a Lead Engineer on projects. Review contract requirements for project execution, organise the preparation of Technical Document Register.\nDetermine methods and solutions for complex engineering problems in tandem with the technical specialist and select the most efficient and economical manner in meeting the objectives.\nCoordinate with projects/planning on project time schedules.\nDevelop manpower charts and schedules.\nReview and ensure Project structural design basis, specifications, calculation methods are aligned with Clients requirements.\nEnsure Integrity is maintained in the project and get the engineering deliverables reviewed/audited by technical or subject specialists available in the group.\nSupervise and provide guidance in the development of plot plans, engineering drawings and technical documents issued for IDC’s and the integration of other engineering discipline data inputs. Supervise the review of design calculations.\nDirect the preparation of technical inquiry requests (Inquiry Requisitions) to vendors, participate in the technical evaluation of vendor bid offers. Direct and provide guidance in the Technical Bid Evaluations (TBE).\nAdminister the preparation of Purchase Requisitions for the procurement of Structural items.\nDirect and monitor Material Take off (MTO) activities.\nParticipate and present in 3D Model review/Constructability/Installation workshops for assigned projects as required.\nReview and support Fabrication and Construction/Installation teams as required.\nParticipate in employee performance evaluations, establish performance criteria, identify employee strengths and weaknesses, and recommend training and development requirements.\nEnsure strict compliance with Company’s ISO Quality procedures.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}