{
    "Job ID": "69873419",
    "Description": "Company DescriptionWork with Us. Change the World.At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations.There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of nearly 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world.We're one global team driven by our common purpose to deliver a better world. Join us.Job DescriptionUndertake design and modelling works for potable water supply, firefighting, wastewater and irrigation infrastructure projects.\n\nUndertake stagnation/water age and quality study of the potable water transmission project.\n\nUndertake Modelling for all wet services with different kinds of modelling software.\n\nAbility to validate the modelling output with engineering calculations.\n\nEnsure quality and timely delivery of infrastructure design works for projects to AECOM Clients within the allocated budgets.\n\nAbility to deliver the projects with full BIM implementation.\n\nCoordinate aspects of projects design submittal and deliverables, reviews and approval against contract requirements.\n\nAdhere to AECOM Health and Safety and Quality measures including safety in design works\n\nProduce technical reports, calculations and liaise with other engineering disciplines.\n\nCoordinate and provide design input to CAD Technicians.\n\nCoordinate with authorities for design review and approvals.\n\nComplete understanding of UAE and KSA design guidelines and authorities’ requirements.\n\nSkills and experience in WaterGEM, SewerGEM, StormCAD, Civil 3D, InfoSWMM, MIKE URBAN, Infoworks ICM, Bentley Hammer, ARCMap, PCSWMM, HEC-RAS.Preferred QualificationsProfessional Recognition i.e. Chartered Engineer or working towards chartership\n\n5 Years design experience.QualificationsBachelors or Master Degree in Civil Engineering or water related subjectAdditional InformationAbout AECOMAECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.Freedom to Grow in a World of OpportunityYou will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.All your information will be kept confidential according to EEO guidelines.ReqID: J10094089Business Line: TransportationBusiness Group: DCSStrategic Business Unit: ME and AfricaCareer Area: EngineeringWork Location Model: On-SiteJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}