{"Job ID": "69872785", "Description": "Wood is currently recruiting for FWKO Instrument & Control Engineer to strengthen our team. This is B2B position on a 4/4 rotation in Iraq, with initial period being in Dubai.Experienced Instrument and Control Engineer with proven record of delivery in the Oil and Gas industry, particularly in Commissioning, Start Up and trouble shooting activities. Ability to provide continuous support to Operations team to optimize the plant.Must have strong experience in oil and gas industry i.e. 3 Phase Separation Facilities, Produced Water Facilities and Chemical Injection Facilities. Experience in Delta V (or similar) and in setting and control of Field Instrumentation is essential.Main DutiesCoordinate handover of the Instrument and Control systems from the Commissioning Team utilizing Go Completions.\nSupport the preparation of Start-up Procedures and Method statements\nOversee the Start Up of the new facilities from an Instrumentation and Control viewpoint.\nAssist in the specification and ordering of Start-up and early Operations spares for Instruments and Controls.\nAssist with on the job training requirement for Operators on the new facilities.\nSupport Operations of Instrumentation and Controls once new facilities reach “steady state” operations.\nRaise and follow through on Engineering Queries as necessary during Start Up and Early operations of the facilities.\nCoordinate with Maintenance Department on all requirements during early operations.\nPrepare schedules for vendor attendance and preservation in accordance with the manufacturers requirements\nImplement the ROO HSE Management System during all phases of the workQualification/SkillsBSc (or equivalent) in Control or Electrical Engineering preferable\nMinimum of 10 year experience in Oil and Gas IndustryKnowledge, Skills and Experience:Demonstrable experience in similar role, with a proven background of delivery\nStrong multidiscipline experience in O&G system commissioning, start-up and operations\nRecognised O&G Instruments and Control start up background and very familiar with O&G Control Systems (particulary Delta V or equivalent) and Field Instrumentation\nExperienced in planning and coordinating system start up activities\nExperienced in working with multi-cultural personnel / team\nExperienced in the development and coaching of team members\nAbility to interface and interact with Operations Representatives at all levels\nDelivery focused and committed to achievement of project goals\nConfident and ability to work on own initiative\nDesire to learn and develop not only self but others within team - good attitude to continuous improvement\nAbility to demonstrate high level understanding of HSE safe working practices and procedures and their implementation\nAbility to manage / maintain budget / schedule requirements\nFully conversant with the completions, commissioning and Start Up process\nAbility to interpret project procedures, standards, specifications, and drawings including PFD's / P&ID's / SLD's / C&E's etc\nIT literate in all major software packages (Word / Excel / PowerPoint etc)\nAble to implement, manage and audit Permit to Work procedure and Isolation proceduresWood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}