{
    "Job ID": "69873683",
    "Description": "The opportunityMace is an inclusive employer and welcomes interest from a diverse range of candidates. Even if you feel you do not fulfil all the criteria below, please apply as you may still be the best candidate for this role or another role within our organisation. Should you require any adjustments to assist during the application/hiring process please advise us.To be responsible for managing Mace’s nationalisation by performing duties as a liaison between the HR department and the business unit director to support the nationalisation program, recommend actions to improve the nationalisation percentages and retain nationals.We welcome applications from UAE Nationals with relevant documentation.Your responsibilities will include:Overseeing the nationalisation initiatives for Mace in the UAE through establishing systems and processes at all stages of the employment lifecycle. \n\nMaintaining knowledge of government guidelines to nationalisation and advise the Mace stakeholders accordingly.\n\nBeing the Mace ambassador at universities, career fairs and networking channels.\n\nInvestigating support programmes and support talent acquisitions and the business unit director on recruitment and induction.\n\nMaintaining reports on nationalisation targets and recommend measures and action plans to attract nationals and meet quota requirements.\n\nActing as a formal point of contact for nationals.About youWith a relevant degree qualification in a relevant subject or discipline, chartered or pursuing a similar level of professional qualification is a significant advantage.You are digitally savvy and having knowledge of Oracle would be beneficial. You can build lasting client relationships and provide support to dynamic, motivated teams. You must have experience working as a nationalisation manager. You have relevant experience, with proven experience in a supervisory or leadership role. Previous experience developing and executing nationalization programs from a strategic level You will have a construction or project management background and be hungry to grow your career and enjoy the opportunities Mace have to offer.Apply now for a confidential discussion.#LI-HybridJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}