{
    "Job ID": "69873457",
    "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Responsibilities/What You’ll Do:As part of the team you will be responsible for end to end delivery of a feature.\nUnderstand the existing native automation framework, running the automation suites, analyzing the results and contributing towards existing automation.\nAbility to design and implement new changes to existing automation.\nBe responsible for the delivery, respectful with all team members and support inclusive team cultureUnderstand requirements, develop comprehensive test plans, execute manual and automated test cases, dig deeper into issues, identify root causes and articulate defects clearly.\nAbility to learn and adapt to changing technologies and processes.\nDeliver a high-quality robust product in a fast-paced environment.\nWork closely with the Development, Product Management, and cloud Operations teams from design to release of the product/feature.\nDefine cloud deployment procedures and monitors/alerts for the features and work with the cloud deployment team for the implementation.\nRecreate complex customer and production reported issues to determine root cause and verify the fix.Graduate or Masters in Computer Science Engineering or a related field.\n 4+ years of experience as a Software QA Engineer in a networking and security environment.\nExcellent verbal, written and interpersonal skills\nAbility to develop automation scripts using python \nHas experience in working with mobile platforms like iOS and Android\nHas experience in mobile networking and testing. \nSolid understanding of test case management and defect management.\nStrong understanding of networking concepts at all layers.\nSelf-starter, takes initiative & ownership, identifies and completes tasks; goal driven\nAbility to work with remote teams, handle multiple tasks, prioritize and meet deadlines\nStrong in computer science fundamentals and networking concepts\nProficient in  Networking fundamentals  ( ICMP/UDP/TCP/IP,L3/L7 ) , proxies  & load balancers \nGood understanding of database schema, modeling, Rest APIs , Hypervisors and microservices architecture.\nGood skill in scripting languages like Python , Java, Perl, bash  etc\nGood to have basic System Load and Performance testing knowledge\nDemonstrate good debugging and troubleshooting skills\nKnowledge of Linux system administration , debugging and management is a plus \nExperience setting testbeds in a Virtualization environment is desirable.\nKnowledge of Active Directory, VPN clients is a plus.#LI-GD1What You Can Expect From Us:An environment where you will be working on cutting edge technologies and architectures\nA fun, passionate and collaborative workplace\nCompetitive salary and benefits, including equity\nThe pace and excitement of working for a Silicon Valley UnicornWhy Zscaler?\n\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \n\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chandigarh, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}