{"Job ID": "69875723", "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob DescriptionProcess study and lay-out development,\nEquipment Specification,\nDevelopment of technical descriptions,\nGet offer,\nThird-party management,\nContract management,\nMonitor and follow the execution of works / projects in the field,\nProject budget control,\nStudying the scope and propose improvements,\nSchedule of activities control,\nMeetings with customers and suppliers,Job DescriptionPrepare the projects documentations such as PDCA, VDC, …\nSupport technically the application of integrated practices concerning Yield, Quality, Productivity and HSE (Health Safety Environment),\n Recommend, where appropriate, the frequency adjustment / modification of standards,\nAssist in the preparation and to apply of technical training,\nFor new equipment establish technical parameters for the preparation of maintenance plans,\nComply with HSE norms, instructions and safe working procedures,Job DescriptionUse of appropriate personal protective equipment and safety systems,\nBe familiar with emergency and evacuation procedures,\nNot willfully or recklessly endanger anyone's health and safety,\nAssist with the preparation of risk assessments,\nReport HSE hazards, incidents & issues.Desirable requirementsBachelor degree, preferably in Mechanical or Electrical Engineering,\nFluent English (written and verbal),\nMinimum 3 years of experience as engineer,\nMechanical technical knowledge,\nKnowledge of processes and equipment specification,\nKnowledge in project execution and planning,\nKnowledge in AutoCAD, Solidworks etc.,\nAbility to read and interpret in high-level manner for technical drawings, specs.\nPreferable knowledge in MS Project and MS Office,\nGood knowledge of MS Office (Excel/Word),Desirable requirementsGood understanding & application of problem-solving tools (PDCA, Cause & Effect Diagram)\nProcess layout, analysis skills, strong work ethic and commitment to excellence,\nPerson needs to be proactive, take initiative (proactive),\nFlexibility in working hours and different shifts,\nGood organizational and communication skills,\nGood ability to work under pressure,\nPlanning & coordination with multicultural environment,\nLiving in Bandırma or willing to live in Bandırma.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}