{
    "Job ID": "69875919",
    "Description": "Job DescriptionOur Finance team brings together our financial perspectives into our overall strategic and tactical decision making. We use state-of-the-art techniques for financial analysis, planning, accounting, reporting and performance evaluation. This allows the organization to continue advancing medical innovation and improve lives. You will be responsible for FP&A activities with the objective of providing business counterparts with insightful and informative analysis to help driving successfull P&Lresults. You will deep dive into every aspect of the business, to drive improvement and use data to drive the right long term decisions.Job Description :Set-up of all critical Financial Planning & Analysis processes with a lean and innovative approach\nProvide decision support to Türkiye Cluster ( (Türkiye, Ukraine and CIS countries) management through and outside of planning cycles, perform forecasting/planning cycles\nEstablish stakeholder relationships with business partners, commercial teams. Work closely with support functions to align on month-end closing as well\nCollaborate closely with regional/global process owners to optimize local processes and deliverables\nContinuously focus on process optimization and simplification\nProvide ad-hoc support to the Turkey Cluster Finance Director as per need (not limited to Financial Planning & Analysis, also in controlling and accounting)Qualification :Bachelor's degree from related fields\nAt least 3 years experiences in Financial Planning & Analysis. Preferably in Pharma Industry\nExcellent command of English (both written and verbal)\nAdvanced MS Office knowledge & excellent spreadsheet skills, SAP knowledge is preferable\nStrong business partner attitude to support business counterparts\nSet priorities and organize work to meet strict deadlinesCurrent Employees apply HERECurrent Contingent Workers apply HERESecondary Language(s) Job Description:Search Firm Representatives Please Read Carefully \nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company.  No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails. Employee Status:Relocation:VISA Sponsorship:Travel Requirements:Flexible Work Arrangements:Shift:Valid Driving License:Hazardous Material(s):Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}