{
    "Job ID": "69873514",
    "Description": "JOB PURPOSE Contribute to the provision of a safe working environment within the Emirates Group by providing technical and administrative support to specific safety disciplines within Group Safety. This may include safety promotion and training activities, research and sourcing / collation of information to assist with administrative support to investigations/activations to aid improvements in safety standards and to minimise the likelihood of recurrent accidents. JOB ACCOUNTABILITIES LINKED TO OBJECTIVE AREAS Undertake a variety of special projects as directed, based on emergent trends, involving internal and external research of best practice, on behalf of and within guidelines provided by the SVP-Safety, Head of Flight Safety, Manager SMS or relevant Safety managers. Group Safety Accountabilities Co-ordinate Group Safety administrative services to streamline the support provided and ensures that the operational and administration needs of the various teams are met. Create and update presentations and manuals and organisational systems for records to meet regulatory and organisational requirements. As directed, support investigation processes by retrieving, collating and extracting relevant data from sources and employee personnel records. Ensure that all interim and final reports are in accordance with internal standards as set out in the Group Safety Procedures Manual, and external regulations such as ICAO Annex 13, and that they are disseminated to relevant internal departments and external agencies such as UAE General Civil Aviation Authority (GCAA) etc. in an appropriate and timely manner. Maintain and regularly review a central database of all safety recommendations made from investigation reports and provide Head of Flight Safety, Manager SMS or relevant Group Safety Manager(s) with details of follow up actions and / or outstanding recommendations. Ensure that the emergent trends and risk matrix accurately reflects the current status. Coordinate and update records in relation to agreed Safety Performance Indicators (SPIs) / Safety Performance Targets (SPTs). Provide support in areas such as flight and ground safety debriefs by the coordinating the collation of accurate data and information as required by the Safety Managers to meet any time critical deadlines. Ensure that there is minimal disruption to operations through liaison between Safety Managers and line management so that the debrief can meets all specified requirements. Coordinate the preparation of information submitted to the corporate database to ensure control and accuracy of data for statistical analysis for safety managers to undertake risk analysis. Coordinate and edit information to generate reports such as management safety review reports and departmental safety reports, which are used assist senior management make operational decisions. Ensure that the Flight Safety Go-Team is compliant with the regulatory requirements of the State. This includes auditing and updating the Flight Safety Go-kit equipment and Go-team records such as accident investigation and blood borne pathogen training records, vaccinations, passports, visas etc. Organise and co-ordinate logistics for Group Safety internal and external events such as Safety Days, Emergency Response Planning (ERP) and safety campaigns, roadshows, training, and workshops, Gulf /Flight Safety Committee Meetings, Safety Action Groups, Safety Boards, the Management Review Safety Committee and other safety related conferences which may be required to meet regulatory requirements. Ensure necessary material and documentation is prepared and available, that appropriate facilities such as meeting rooms and accommodation is booked and required personnel are available to attend to ensure the events runs smoothly. Co-ordinate the procurement and logistics for the design, development and global distribution of safety and ERP promotion and training materials. Organise the safety promotion and training safety publications and resources including the stock room, online storage and distribution including liaison with internal and external parties. Monitor and review industry publications and internet sources (including from ICAO and Aircraft Accident Investigation Bureau) to enable the Emirates Group to remain up to date with changes and best practices relating to safety. Ensure that relevant information is communicated to Manager SMS, SMS Standards and Training Manager and / or the relevant Safety teams or Managers for action as appropriate. ate.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}