{"Job ID": "69872892", "Description": "J.P. Morgan Private Bank is committed to providing exceptional service to our clients and business partners. Our sales and client service teams, marketing support, and product specialists, are dedicated to the support of our clients and leverage the capabilities of our global firm to deliver to our clients. We provide an integrated approach to client servicing in order to meet the client’s full range of investment and servicing needs. Each new client is assigned to a Client Service team which consists of a Client Advisor, Client Account Manager, Portfolio Manager and Investment Specialist.You will deliver the Private Bank public web experience vision and industry leading digital web capabilities.  With your knowledge of website production management, you will partner closely with our Product Owners, UX and Marketing Technology team and work as part of the Agile team to deliver a roadmap initiatives for the web product, translates business needs and requirements, and champion usage and adoption.Job ResponsibilitiesActively manages internal and external dependencies and impediments that could impact the team’s completion of Release/Sprint Goals\nCreate, review and support product team in user story writing and decision making as part of the product scrum inclusive of manage user stories dependencies and risks\nEnsure the development team understands items in the backlog to the level needed, plan iterations, and ensure user stories meet standards\nResearch and present analysis and options for specific capabilities\nProactively participate in scrum ceremonies (Scrum, Backlog Refinement, Sprint Planning, Sprint Review, and Retrospective) and longer-term planning exercises (Road Mapping, Release Planning)\nSupport product release and adoption of new functionality with users. Collaborate with Product Owners, UX/design, web operations, and other cross functional marketing partners/stakeholders to deliver new web features\nDemonstrating ability to offer suggestions and in some case key decisions relating to efficiency and prioritization of task completionRequired qualifications, capabilities and skillsStrong understanding of the digital ecosystem, along with best practices and trends in website product management\nExperience with AEM and other Adobe Marketing Cloud tools (Analytics, Launch, and Target) welcomed\nUnderstanding of SEO/SEM, digital marketing and advertising technology ecosystem\nStrong hands-on experience in working in an agile framework\nAbility to balance multiple priorities and meet deadlines.\nAbility to work successfully and efficiently both independently and as part of a teamPreferred qualifications, capabilities and skillsKnowledge of and/or experience in the financial services industry is preferred\nUnderstanding of global web development, HTML, CSS, JavaScript, responsive design, accessibility a plusJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}