{"Job ID": "69876379", "Description": "We wish to recruit an experienced Director - People & Culture to join our Middle East team and actively contribute to the growth and development of the Middle East business. The successful candidate will have at least 15 years' experience and have workedwith an Engineering Consultancy or a similar firm.The Director - People & Culture will be responsible for the People & Culture (P&C) function across the SJ/SMEC Brands in the Middle East Division. The Director– People & Culture manages the delivery of informed and professional P&C solutions that are aligned to the business needs of Group and Divisional level priorities.The Director– People & Culture partners with the Divisional and Head Office Management Teams to develop, execute and deliver the P&C strategy to ensure SJ/SMEC in Middle East has a competitive advantage with a strong and attractive employer brand, optimal resourcing, and talent retention.The Director– People & Culture manages a high performing team of professionals across several disciplines that include P&C Management, Operations & Administration, P&C Compliance, Talent Acquisition (TA), Learning & Development (L&D), Payroll and P&C Projects, driving an exemplary standard of client service through expert and timely advice.Key AccountabilitiesManages the P&C function and drives a high functioning team to successfully deliver the strategy and ensuring compliance with all policies, procedures, and work practices.\nDevelops and executes the P&C business plan and strategy to ensure optimal performance, resourcing, retention, and professional development that is aligned to the Divisional/Group strategy and business plans.\nProvides expertise and effective advice to the Middle East Management Team and wider business, and actively engages in relevant committees, working groups and forums and individual stakeholders.Please note that due to the volume of applications, only candidates with skills and experience matching our current vacancies will be contacted. If you have a CV that we like and that we feel may fit a future role, we hope you don’t mind if we keep your details on our database and contact you when an opportunity arises.At Surbana Jurong, we put talent, hard work, teamwork and a fun workplace together to approach problems and solve them creatively and collaboratively. Join us in making a positive impact on the world!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}