{
    "Job ID": "69875363",
    "Description": "About Acceldata Acceldata is an enterprise Data Observability organization that was first to the market, having coined the term ‘Data Observability’ in 2018. Founded by industry veterans who have spent decades in the AI, Analytics, and Data Monitoring space, Acceldata is a startup in the hyper-growth phase. Having raised $100 million in total, Acceldata is now a 250+ strong entity that is looking to help Enterprises and SMEs/SMBs take control of their pipelines across the cloud-native, multi-cloud, hybrid cloud, or on-premises data systems.As a result of data teams struggling to manage the data that supported mission-critical analytics and AI-based applications, Acceldata built the world’s most comprehensive data observability platform that transforms how organizations build and operate data products.Position SummaryWe are looking for a marketing and communications professional to support Acceldata's marketing and communications efforts. You will oversee the implementation of Acceldata's communications strategy and promote its products and services in order to build brand awareness and enhance customer engagement. A broad understanding of communications is required for this position.Marketing and Communications Managers are energetic, highly skilled self-starters who thrive in a fast-paced environment. The individual has experience preparing verbal, visual, and written communication materials. A Marketing Manager is agile, accurate, and thoughtful, and is able to recognize the potential bigger picture and what is needed to reach multiple audiences effectively.The Marketing Manager supports Acceldata's efforts to maintain a single, consistent brand and voice across all communications. With a global team in a distributed environment, this position is ideal for an ambitious communications professional looking to help a fast-growing company achieve its tremendous potential.This role is based in Bangalore, India (Attending the Acceldata Bangalore Office 3+ days a week is mandatory).ResponsibilitiesLead public relations activities including gathering information for and editing, award and speaking submissions and press releases.\n\nMaintain an up-to-date press list of journalists and analysts.\n\nEdit and support with creating promotional and product videos for social media and the company website.\n\nAssist with scripts and storyboards.\n\nManage video library.\n\nAssist, update and maintain specific sections of the company website ensuring the content is timely, accurate and appropriate.\n\nWork with internal stakeholders and external contractors to coordinate the development and promotion of the Acceldata brand.\n\nMaintain an organic social media plan to build and engage with target audiences.\n\nApply various social media tactics to create brand awareness and generate inbound traffic that strengthens the company’s social media presence.\n\nAssist with customer marketingQualifications Bachelor’s Degree in marketing, business or related field\n\n8-10 years of marketing experience\n\nExceptional verbal & written communication skills\n\nEqually capable of working as part of a team while being self-directed and working autonomously\n\nExcellent interpersonal skills and adept at building relationships with different stakeholders\n\nStrong organizational, planning and project management skills\n\nAgility and flexibility with demonstrated success in rapidly changing environments, including proven ability to manage multiple, competing priorities simultaneously\n\nExperience managing projects from concept through fruition with a high degree of detail\n\nExperience working in fast-paced start-ups in a high-tech environmentAcceldata is an equal-opportunity employerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}