{"Job ID": "69875756", "Description": "Before you apply to a job, select your language preference from the options available at the top right of this page.Explore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.Job Description:Job Summary:The Building & System Engineering (BaSE) Supervisor protects UPS assets including buildings, equipment, and grounds. He/She supervises facility maintenance, housekeeping, environmental and labor compliance, safety, and conveyor system reliability. He/She is responsible for ensuring environmental and safety compliance at the district level for all assigned facilities (e.g., reviews applicable facility regulations, conducts audits, performs trend analysis for compliance activities, confirming completion of Corrective Action Plans (CAPs) etc.). The BaSE Supervisor designs/ reviews safe and efficient facility and conveyor layouts to meet organizational needs for expansions, retrofits, and new buildings. This position develops, tests, and deploys software and hardware solutions. The BaSE Supervisor maintains the documentation of UPS building standards and specifications, assists the field with issues related to building standards and specifications, updates construction project documentation, and provides drafting and web support services. This position manages construction projects of low to moderate complexity and risk (i.e., conveyor installations and facility modifications), ensures adherence to contract documentation, scheduled timelines, and cost control parameters.\nResponsibilities:Manages project lifecycles, including project scope, resources, schedule, initiation, start-up/design, building, and deployment to see projects from beginning-to-end.\nDevelops project plans (i.e., detailed plan, milestones, and work breakdown structures) and assigns tasks to resources to ensure that the project will be completed on time and according to specifications.\nFollows up with assigned resources formally (e.g., status meetings, etc.) and informally to continuously manage the productivity of the team, project timelines, and deliverables.\nBalances multiple projects and deployment schedules to meet stakeholder goals and expectations.\nReviews designs to ensure Occupational Safety and Health Administration (OSHA), local, and UPS conveyor guidelines and specifications are met.\nSupervises the protection of physical assets, facility and equipment maintenance, and facility housekeeping to ensure a clean, efficient, and safe facility.\nSchedules and reviews building automation systems reports (e.g., heating, ventilation, air conditioning, electrical, fire alarm, etc.) to maintain effective operations.\nConducts yearly facility asset protection assessments to develop work scope for next year's projects.\nPerforms daily preventative maintenance of electrical, mechanical, fire, water, and security systems to repair, upgrade, or replace parts required to maintain system performance.\nEnsures that facility appearance is maintained at an acceptable level for the most reasonable cost using BaSE Porters and/or outside service housekeeping or IFM (Integrated Facility Management) vendors.\nPerforms inspections following the Environmental Facility Audit (EFA) to facilitate the comprehensiveness, accuracy, and timeliness of the audit process.\nIdentifies issues with current processes and recommends and implements solutions that address those issues to increase productivity at the facility.\nMaintains specifications and drawings library to provide information for region and district Project Engineers and Architects.\nUpdates construction documents (e.g., building blueprints, PE technical manuals, etc.) to document changes to UPS and manufacturing standards.\nEstimates costs using UPS guidelines and industry standards so projects can be evaluated against the district budget and approvals obtained.\nDepending on the project complexity, assists with or develops alternatives, schedule, drawings, vendor list, and feasibility study and sends to REFCO committee for approval.\nAudits and validates the construction project design to ensure proper installation, maintain proposed scheduling, and maintain performance specifications.\nWorks cross-functionally to identify and implement alternative processes that improve efficiency.\nManages vendor projects to ensure the given solution(s) aligns with the needs of UPS.\nNeeds to support for UPS SCS sites and GBS sites as per the requirement.Qualifications:\nBachelor's Degree or International equivalent in Engineering, Mechanical or Electrical, or related area - PreferredFacility Management – Soft services and technical, MEP (Mechanical, Electrical & Plumbing) etc.\nProject Management skills\nExperienced in managing Business Plan, Facilities Capex and Opex as per the organization guidelines.\nVendor/Supplier Management\nExperience developing/ reading facility layouts in AutoCAD (2D) - Preferred.\nEffective communication skills and detail orientation\nFlexible for working in day and night shifts and willing to travel for work.\nProficiency with Microsoft Office Suite (Outlook, Word, Excel, Power Point etc)UPS is committed to providing a workplace free of discrimination, harassment, and retaliation.Employee Type:\n UPS is committed to providing a workplace free of discrimination, harassment, and retaliation.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}