{"Job ID": "69875632", "Description": "Head Waiter, X Bar & Arabian Terrace \n(9738)At Atlantis, we exist to bring the extraordinary to every holiday and experience through connection, empowerment, precision, care and warmth. Inspired by the majesty and mystery of the ocean, Atlantis resorts are unique destinations full of life, wonder and surprise, where we seek to exceed our guests’ expectations at every possible turn. Nestled between the calm turquoise waters of the Arabian Gulf and the majestic Dubai skyline, Atlantis, The Palm is the crown of the world-famous Palm island in Dubai. With a sense of exhilaration and discovery, we create unforgettable memories by providing guests the opportunity to discover an extraordinary world filled with thrilling adventures. Whether we are designing a couple’s retreat or serving the extraordinary in one of our award-winning celebrity chef restaurants, we approach everything with imagination to spark a sense of courage, inspiration and innovation. This is not simply our job, it’s our passion.About RoleAs Head Waiter at X BAR & ARRABIAN TERRACE, you will provide hands-on support and assistance to colleagues to ensure that the highest levels of fine dining service and courtesy are provided to our guests. The Head Waiter will greet all guests as they are being seated, creating a professional and friendly rapport in order to ensure a positive first impression and exceptional standard of service. You will be familiar with the complete food and beverage menu, knowledgeable on all promotional activities, and provides specialist advice to guests and colleagues on menu items when required. In addition to the above a priority of this role will be to closely monitor the consistency of food and beverage items that are being served to ensure overall service quality, escalating any major problems or complaints to management.About YouThe ideal candidate must have a passion for hospitality with a minimum 2 years’ experience in a similar role with a proven track record of working in a high-volume restaurant. The successful candidate must possess excellent communication skills, be a team player, manage multiple tasks and have confidence in dealing with a diverse set of clientele. Atlantis, The Palm offers an unbeatable opportunity to grow and develop in your career right in the mix of a continuously developing city and a diverse range of cultures.Atlantis Dubai is an iconic entertainment destination comprised of two world-class resorts; Atlantis, The Palm and Atlantis, The Royal; offering an unbeatable opportunity for you to grow and develop in your career. Join a team that is adventurous, creative, warm-hearted and extroverted. We believe in making our guests happy beyond anything they have ever imagined. We wow them at every turn and create memories that will last a lifetime. You will be at the heart of this vision, to constantly innovate to deliver Amazing Experiences and Everlasting Memories.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}