{"Job ID": "69872503", "Description": "SNC-Lavalin has an exciting full-time career opportunity for a Senior Mechanical Engineer with minimum 15 years’ experience. Candidates having relevant project experience with transmission & distribution lines, substations, power stations are preferred. The role is based in Jeddah, Saudi Arabia.The candidate will work in a fast-paced consulting environment with excellent career growth opportunities.ResponsibilitiesWorking in collaboration with the Mechanical team to prepare the following deliverables / provide the following engineering services (non-exhaustive list):Development of technical specifications.\nDevelopment of conceptual and detail designs.\nDesign of interfaces with protection and control systems, civil works, structures, etc.\nPreparation of bid documents and bid evaluations.\nDesign review of detail design performed by O.E.M. and third-party detail design.\nEnsure interdisciplinary coordination.\nTake part in audits and technical assessment.\nConstruction supervision; development of installation procedures and method statements.\nCommissioning supervision.\nWitnessing factory testing.\nFeasibility and techno-economic studies.\nDesign studies and calculations.RequirementsBachelor’s degree in Mechanical Engineering, from a recognized institution.\nMinimum 15 years of relevant experience, particularly related to power systems, transmission & distribution lines, substations, power stations projects.\nExceptional academic and professional record.\nExceptional problem-solving and analytical capabilities with a focus achieving results.\nTeam player with great interpersonal, communication and presentation skills.\nClient focused, highly autonomous, and ability to work under pressure.\nEligibility for registration with a Professional Order of Engineers.\nAvailability for short trips to construction sites, factories, client’s offices, in Canada, international and overseas.\nFluency in English language, both spoken and written. Additional languages will be considered an asset.SNC-Lavalin Projects and O&M Services is a business unit of SNC-Lavalin Group.  We provide a full range of project management, programme management, construction management, engineering services, consulting services and operation and maintenance services across the MENA region.  Active in the Middle East for over 40 years, we have offices in the Saudi Arabia, UAE, Qatar, Oman, and Egypt. for transportation and other infrastructure programmes.Founded in 1911, SNC-Lavalin is a global fully integrated professional services and project management company and a major player in the ownership of infrastructure. From offices around the world, SNC-Lavalin's employees are proud to build what matters. Our teams provide comprehensive end-to-end project solutions – including PPP, capital investment, consulting, design, engineering, construction, sustaining capital and operations and maintenance to international clients. On July 3, 2017, SNC-Lavalin acquired Atkins, one of the world's most respected design, engineering and project management consultancies. http://www.snclavalin.com/SNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;Complying with the relevant employment legislation and codes of practice;Ensuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;Ensuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;Making all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Civil Engineering", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}