{"Job ID": "69876529", "Description": "Rotork plc is a British-based company, Manufacturing industrial flow control equipment. We are a global company with 3,200 employees serving 170 countries.Software Design using embedded C for 32- bit microcontrollers and its peripherals.\nExcellent knowledge in data structures and capable to designing the software from scratch.\nHand on experience in implementing standard protocols such as Modbus and CAN.\nExposure to SDLC and adhering to guidelines such as coding rules, checklists, PC-lint, MISRA guidelines, peer reviews etc.,\nVery good knowledge in test case creation, test scripts development, test execution and test coverage.\nExperience in other software such as Dock light, Python and m-scripts.Any Engineering graduate\nMin 5+ Years of experience in Embedded Coding (C / C++)\nExcellent communication and interpersonal skills.\nA good team Player.Rotork is the market-leading global flow control and instrumentation company, helping our customers manage the flow or liquids, gases and powders across many industries worldwide.Our purpose is Keeping the World Flowing for Future Generations.For over sixty years, the world has relied on us to create the things that keep everything moving. From oil and gas to water and shipping, pharmaceuticals and food- these are the flows on which our modern world depends.Today we're respected and admired for our people, performance and products. Our success flows from our commitment to engineering excellence, and that's what we will always pursue, safely and sustainably.Rotork is going through an exciting period of change and growth, building on our existing market success. It's a great time to join us and make an impact in shaping the future of our business.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}