{
    "Job ID": "69875879",
    "Description": "The Bosch Group is a leading global supplier of technology and services, in the areas of Automotive Technology, Industrial Technology, Consumer Goods, Energy and Building Technology.\nIn India, the Group operates through nine companies with a combined strength of over 30,000 associates which includes around 14,000 research and development associates.\nBosch Chassis Systems India Ltd is a 100 % Bosch owned company in India. The company design and develops world-class Hydraulic Brake System Parts which includes Boosters, Tandem master Cylinders and Proportionating valves. The Control Division develops innovative components, systems and functions in the field of vehicle safety, vehicle dynamics and driver assistance like ABS and ESP. RBIC would soon be expanding its portfolio in passive safety and other Driver assistance products.\nWe invite promising and dynamic professionals for a long-term and\nrewarding career with Bosch.Regional Sales Pricing analyst\nCo-ordination for raising Debit/Credit note with INS/SCC (Sales coordination team for Rg/IN) and Finance team\nCo-ordination for work-on for price amendments\nMIS on Part no wise Sales Price movement sheet\nUpdate Price Master with Latest Price and earlier amendments\nCo-ordination for - product life cycle management (PLCM) on part no level in alignment with AA including release and\ncancellation (RACE)\nPerform 4 eye cross check for BP price planning and current forecasting\nCoordination for volume planning with LOG for Business Plan and Current Forecasts\nAnalysis and reporting of customer deduction and excess payment.BE / BCoM + ICWA preferred (Completed or Inter)Excellent communication\nEnglish language command\nPresentation skill ( PPT / Excel )Sales Process and Risk Management\n- Commercial Account Management\n(Sales Controlling, Sales\nReporting,Sales Process Planning)\n- Price Management ProcessJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}