{
    "Job ID": "69873430",
    "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Consumer Brands continuously drive the evolution in dynamic categories: Laundry & Home Care and Hair. With our trusted brands, including Persil and Schwarzkopf, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.\n\nDare to make an impact?\n\nYOUR ROLEManage the technical documents and all the trials related to new launches, relaunches, maintenance projects related to the new products.\nEnsure the technical feasibility of any new product by taking into consideration different aspects such as formula/ processing / cost / raw materials PIPO.\nCheck the technical feasibility with respecting the good manufacturing practice, norms of quality, hygiene & security.\nLeverage an internal network to share best-practices in process and product development and drive standardization across the business.\nImplement formulation optimizations with regard to cost of goods, raw material substitutions, adaptation of a formulation to customer processes.\nAct as a mentor towards junior colleagues in fostering culture of innovation.YOUR SKILLSKnowledge in formulation and chemical engineering\nBachelor's degree in Chemical engineering, Chemistry, Pharmacy or any relevant study.\nGood project management skills.\nAbility to deal with multiple stakeholders.\nGreat communication skills.\nTeam player.JOB ID:Contract & Job type:Contact information for application-related questions:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}