{"Job ID": "69873284", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! WHAT YOU’LL DOCreate an understanding of business contexts, requirements, objectives and expectations of internal and external customers\nWork with DevOps Transformation Lead and stakeholders to create a roadmap based on our Cloud strategy\nAlign priorities and maintain a prioritized backlog across all sources of work. For example other teams’ dependencies, tech strategy.\nOwn team’s backlog, define and write epics, stories in collaboration with engineers. Communicate with and manage expectations towards the team and the stakeholders\nManage for progress, help remove impediments to ensure delivery. Be the spokesperson and ambassador of team achievements to the rest of the organizationWHAT YOU’LL BRINGEngineering graduate with 9 to 12 years of relevant work experience\nExperience in working as a Product Owner in an agile environment\nGood understanding of cloud/infrastructure domain or a technical background in related field\nAbility to lead through and create progress when things aren’t clear or the way forward is not yet well-defined\nCommunication skills that allow you to translate between different domains and adjust to different audiences\nA solid toolkit and methods that help you along the path from problem to a solution delivered and adopted (prioritisation, slicing and aligning scope, planning and estimation etc.)\nAn eye on non-functional requirements such as security, performance, scalability, availability, cost and operations\nStrong user focus and methods - discovering user needs, introducing KPIs, metrics, etc.\nA passion for coaching and mentoring your less experienced colleagues by drawing upon your experience, skills and knowledge to ‘give back’ to othersMEET YOUR TEAMOur Cloud Teams provide a platform to application development teams for building their services. The platform, Signavio Cloud OS, covers various aspects such as container orchestration, monitoring, deployment tools, security and governance. We aim for an optimal experience for developers - our users - so that they can bootstrap, enhance, and run integrated services with ease. Building on the intelligent enterprise strategy, SAP Signavio set out to support and accompany SAP customers in navigating through their digital transformation by helping them understand and improve their business processes. The Platform group is one of five groups in the engineering department of the SAP Signavio unit. It focuses on cloud infrastructure as well as shared services and technologies. The platform strives for simplifying the development of our suite of products. After getting acquired by SAP, the group aims at adopting BTP capabilities and preparing the way for fast migration to the BTP unified runtime.#SAPBPICareers #businessprocessintelligence #Signavio #BPI  #SAPInternalT3We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 375885  | Work Area: Solution and Product Management  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}