{"Job ID": "69872874", "Description": "Corporate Third Party Oversight Strategy and Design supports the third party risk management organization and committed to delivering high-impact strategic solutions to address the groups most urgent needs. Key objectives include providing objective analysis and making critical business decisions which result in stronger operating models, greater impact to employees, and an improved control environment in partnership with senior leaders from lines of businesses. The remit will encompass all end to end project management, prioritization, planning and execution of work inclusive of design, test execution, and implementation.  The successful candidate must possess strong analytical & problem-solving skills, have the ability to prioritize and manage time, and be able to build relationships with key stakeholders.Algorithm Development: Exposure to development and implementation of analytical algorithms and statistical models to gain deeper insights from data, including machine learning models.\nData analytics and insights: Collaborate with business stakeholders to develop analytics solutions that deliver valuable insights to support data-driven decision-making. Support large volume data analysis, results of data analysis with ease and speed. Extensive experience with popular data analytics and data manipulation tools, such as Google Cloud's BigQuery and Apache Spark. Strong understanding of data analytics, data visualization, and business intelligence tools (e.g., Tableau, Looker, Power BI, Google Data Studio) to create interactive and insightful dashboards.\nData visualization: Drive the creation of intuitive and interactive data visualizations to present complex analytical results, enabling non-technical stakeholders to understand and interpret data effectively.\nContinuous Learning and Improvement: Stay up-to-date with industry trends and emerging technologies related to data analytics, ensuring the adoption of best practices and continuous improvement within the team.\nLeadership and communication: Ability to collaborate effectively with cross-functional teams, and communicate complex technical concepts to both technical and non-technical stakeholders. \nProgramming languages: Proficiency in languages commonly used in data engineering and analytics, such as Python, R, Java, or Scala. Strong problem-solving and critical-thinking skills, with the ability to break down complex problems and develop innovative solutions.\nMachine Learning and Statistical Modeling: Exposure to machine learning algorithms, statistical modeling, and data mining techniques; (nice to have)\nCloud: Experience with cloud platforms like AWS to scale and analyze, manage Big Data, migration and deployment of applications to Cloud. (nice to have)\nA desire to teach others and share knowledge. Looking for team player, to coach other team members on coding practices, design principles, and implementation patterns\nComfortable in uncharted waters. We are building something new. Things change quickly. We need your help to learn our process/data and come up with patterns quickly\nAbility to see the long term. We don’t want you to sacrifice the future for the present. We want you to choose technologies and approaches based on the end goals.\nHigh standards. We are looking for people who expect personal performance and team performance to be nothing short of the best\nClarity of thought. We operate quickly and efficiently, and looking for an individual who are economical with their time and clear with their opinions\nComfortable working within a geographically distributed teamJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}