{"Job ID": "69873163", "Description": "Company DescriptionDentsu Media is the largest area of specialism within the dentsu network. It is brought to markets globally, through three award-winning agency brands: Carat, iProspect and dentsu X. All three are underpinned by a scaled network offering of talent, capabilities, and services to support, grow and transform the world’s leading advertisers. Operating across more than 145 countries, dentsu Media is trusted by leading brands across a broad range of sectors, from pioneering technology to cutting-edge fashion. Dentsu leverages technology, creativity, and in-depth data analytics to drive superior results that amplify its clients' brands. Dentsu Media is transforming advertising as a force forgrowth, a force for good and has become the destination for employees to cultivate meaningful careers and for brands to accelerate previously unseen, sustainable growth.Ability to effectively communicate \nDemonstrate multi-tasking ability and keep multiple projects on-track \nAssist with the maintenance of flowcharts, buying guidelines, plan delivery (pacing and reporting), budget summaries, and billing\nRun and maintain competitive spending reports, and execute baseline assessments of data \nEnsure key information is provided to appropriate individuals and teams regarding operational management issues clear, error-free and on-time \nOther administrative responsibilities as needed: assembly of presentation materials, client binders, meeting setup \nExpress oneself clearly and concisely in oral communications \nWrite in a clear, compelling and concise manner \nOrganize ideas and information logically and sequentially 2 to 4 years of professional experience\nAccuracy and attention to detail a must \nAdvanced computer skills (MS Office) \nAdvertising agency or professional services experience preferred  \nProven ability to interact with people at all levels of an organization, fostering strong cross-functional teamwork and results \nAble to work well in a team environment \nStrong math and analytical skills  \nStrong organization and time management skillsFlexible to work across different time zones/shifts (including night shift)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}