{
    "Job ID": "69873311",
    "Description": "Basic Function:Experienced level position in Food & Beverage PreparationSkills and Abilities:Hotel School education or diploma in culinary is required. Basic computer skills and familiar with inventory systems.\n1-2 Years’ experience in a 5 Star Hotel environment or A Class Restaurants. Excellent understanding of various cooking methods, ingredients, equipment and procedures.\nAble to work in a fast-paced environment with speed and quality.\nGreat personal hygiene and grooming standards.\nReading, writing and oral proficiency in the English language.\nGood level of creativity and good organizational skills.Major ResponsibilitiesGeneralExecutes all tasks assigned by his/her superiors\nDemonstrates a high degree of standards awareness; promotes teamwork and acts as role model\nAttends all scheduled training sessions\nDisplays warmth, care and genuine enthusiasm when dealing with guests and internal customers; lives the Golden RuleDepartmentalCleans and handles initial processing of raw product\nPrepares mis-en-place, bases and ingredients, stocks, dressings etc.\nAssists and trains with line cooks\nMaintains high standards of food hygiene and storage as well as kitchen cleanliness\nSuccessfully completes Safe Step Training certificationSpecific Responsibilities and TasksGeneralAdheres to the Hotel's code of conduct and grooming & hygiene standards\nIs seen as working hands-on, assists colleagues in crunch times; Walks the talk\nActively participates in briefings and meetings\nMaintains a clean and orderly work area and promotes a safe working environment\nPerforms any additional duties as assignedDepartmentalRuns the day to day operation of the station in the kitchen. Assists in creating and preparing menus items and specials. Accommodates the food servers' requests regarding guest preferences. Follows all guidelines for timely food service to guests.\nChecks and completes mis-en-place and pars and set-up the station. Communicates with the Sous Chefs and the Executive Chef regarding menu items, problem situations or shortages. Utilizes the computer system in retrieving orders.\nIs aware of and complies with Hotel's standard recipes and plate presentations in order to maintain standards of quality in production and presentation. Follows all guidelines for timely food service to guests\nStores items properly at the end of the shift; ensures a clean, neat and organized work area.\nEnsures safe and correct use of equipment, tools and machinery\nHandles and reports any accident immediately, no matter how minor. Responds properly in any hotel emergency or safety situation.\nConducts oneself in a professional manner at all times to reflect the high standards of Four Seasons Hotels and encourage staff to do the same.\nPerforms other tasks or projects as assigned by hotel management and staff.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}