{
    "Job ID": "69874029",
    "Description": "Key ResponsibilitiesRequirements analysis\nRequirements decomposition\nSystems design (HVAC-Controls)\nModel based development system design\nSystems integration\nSystems validation & verification\nCustomer interaction\nProject engineering\nbudget/schedule responsibilityYOU MUST HAVEBachelor’s degree in engineering (Electrical/ Electronics/Instrumentation/Mechanical with Controls experience).\nControls engineering experience with PLCs/DCS/DDC Industrial Instrumentation or Building Automation HVAC Systems (Min 5-9 years)\nExperience with complex HVAC systems likes Chilled Water Plants, Boiler Plants, Geothermal Systems, Tunnel ventilation, Bio Labs (Min 5 years)\nHands on experience with commissioning field devices, controllers / field instrumentation. (Min 4 Years)\nHands on experience of SCADA/HMI configurations/point programming. (Min 3 Years)\nAbility to perform FAT ,FWT, SAT & working with third party commissioning agents. (Min 5 Years)\nHands on Experience and/or knowledge of various communication protocols like BACNet, LON, Modbus & TCP-IP. (Min 4 Year)\n\nWE VALUEKnowledge of control systems design development lifecycle\nIndividuals that quickly analyze, incorporate and apply new information and concepts.\nDiverse and global teaming and collaboration\nEffective communicator\nIndividuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done.\nAbility to adapt dictated by project changes\nMulti-tasking and has the ability to manage a variety of complicated tasks.\nExperience with Cloud computing and cloud implementations will be added advantage.\nSome ability to use drafting and design tools like ACAD, Visio, LabView will be added advantage.\nOne who maintains team spirit and contributes for success of the team.JOB ID: HRD206148\nCategory: Engineering\nLocation: 56 & 57 Hadapsar Industrial Estate,Pune,MAHARASHTRA,411013,India\nExemptJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}