{"Job ID": "69873113", "Description": "We create smart innovations to meet the mobility challenges of today and tomorrow. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses and driverless trains, as well as infrastructure, signalling and digital mobility solutions. Joining us means joining a truly global community of more than 75 000 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.Purpose of the JobPerforming 3D modelling, design annotations & dimensions and metadata.\nChecking 3D interfaces for external design.\nApplying applicable Mechanical Domain instructions, processes & tools.Organisation Reporting Hierarchical Reporting: (Site) Electrical / Mechanical Domain Leader (MDL)\nFunctional Reporting: Mechanical Lead Engineer (MLE) ResponsibilitiesModelizing and storing allocated volumes and interfaces for sub-systems / components in Digital Mock-Up.\nPerforming Detailed Design on internal sub-systems.\nPerforming 3D, design annotations and 2D deliverables in compliance with QCD commitments, Metier rules and processes.\nFilling-up attributes for each part in Digital Mock-Up (naming, material, Fire & Smoke, etc.)\nVerifying consistency of digital mock-up (no clash, etc.) and compliance with requirements (allocated volumes, weight, interfaces,etc.) on assigned scope.Preparing and documenting Mechanical Domain Design Reviews according to N+1 instructions.\nUpdating Digital Mock-Up taking into account Change Requests.\nChecking other CADs' and sub-contractor's Design Quality\nRealizing stack-up analysis.\nRealizing Bill of Material.Contributor for :Proposing Design Optimizations (weight, cost, etc.)\nSupporting Manufacturing teams during Production ramp-up.\nCollaborating with Mechanical Domain Leader for continuous improvement of the Metier (including RoE).Knowledge & Experience3D Modelling, drawing rules and stack-up analysis.\nStructured and organised with Hands-on approach.\nEnglish basics in read/writing.An agile, inclusive and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}