{"Job ID": "69873395", "Description": "Harsco Corporation is a market-leading, global provider of environmental solutions for industrial, retail and medical waste streams, and innovative equipment and technology for the rail sector. We have an unrivalled breadth of experience across the globe and an impressive reputation stretching back more than a century. Based in Camp Hill, PA, with more than 13,000 employees and the company operates in more than 30 countries.About Harsco GSCHarsco GSC handles a wide range of services, finance and accounting shared services, global HR shared services, providing IT Service and helpdesk support and market research support to Harsco globally. We are Operating since 2008 & Serving 30+ Countries Should have sound knowledge in accounting\nShould have practical knowledge on invoice processing\nShould have knowledge on resolving issue invoices and clearing on GRNI\nDelivers the tasks assigned within the Turnaround Time (TAT) as per the policies with high level of accuracy\nShould build good rapport and working relationships with overseas internal clients\nShould be able to take up ad hoc requests with minimal supervision and send for further reviewQualification & Experience:Preferably commerce graduate with good accounting skills\nGraduate or post graduate  Fresher/ 0-1 years of relevant experience in Accounts Payable.\nShift timings strictly 4:30 PM to 1:30 AMDisclaimerThe information about this job description given above has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}