{
    "Job ID": "69872842",
    "Description": "Requisition Number: 217205External Description:What You'll Do Teradata is growing our Cloud Operations team and we’re looking for individuals that exemplify our principle of Customer Obsession through operational excellence, leadership, and a passion to continually be the voice of the customer. This is a unique opportunity to join our team in a period of fast growth and expansion. If you are interested in working in a dynamic and fast paced environment where you can directly influence the future of cloud-based analytics solutions and services, then this is the place for you. You will actively develop and implement state of the art technical solutions, including capabilities to support elastic scalability, on-demand self-service, disaster recovery, and usage-based consumption, to enable customers to solve their most complex data analytics challenges.Teradata Cloud seeks a Sr Staff DevOps Engineer to lead in building and operating highly scalable, fault tolerant, and secure systems in a distributed system highly distributed and dynamic Hybrid Cloud environment.What Makes You a Qualified CandidateCollaborate with cross-functional teams to drive SRE, Observability, and DevSecOps initiatives.\nApply SRE principles to drive reliability engineering initiatives, including defining and monitoring service level objectives (SLOs) and error budgets.\nUnderstanding & implementation knowledge of Chaos Engineering\nKeep the lights on, Meet the Business requirement by enabling:\nOncall improvement & taking oncalls.\nAutomate Release management\nImprovement in the Meantime to Resolve\nAutomated or AI enabled incidents/issues.\nDevOps Pipeline Automation\nImprove automation so that issues can be solved at L1 level & L2 level.\nDevelop and maintain documentation, including policies, standards, and procedures, run book maintenance & update.\nImplement robust observability practices by designing and maintaining monitoring, logging, and tracing solutions using tools like Datadog or similar technologies.\nDrive the improvement of proactive alerting using modern monitoring tools such as Datadog.\nDeduplication of alert & Reduction of false positive alerts\nImprove system monitoring and observability through log analysis, dashboard creation, and automated alerts based on established service level objectives (SLO) and service level agreements (SLA)\nCollaborate with monitoring and operations teams to ensure the availability, performance, and scalability of the infrastructure and applications.\nContinuously identify opportunities to improve system performance, reliability, and security through automation, optimization, and architectural enhancements.\nMentor and provide guidance to junior team members, promoting a culture of observability, security, and SRE principles.\nProvide architectural leadership for developing and building highly available systems and software in large distributed and Hybrid Cloud environments\nPromote a culture of continuous improvement for technology, and processes\nLead in-depth analysis for improving the deployment of cloud-native applications, monitoring, securing, and supporting a large-scale public cloud environment\nAnalyse and improve existing provisioning processes for automation opportunities and improvements\nParticipate in on-call for escalated support of production customer and systems\nPerform and improve SRE / operational functions, such as monitoring and maintenance of productions systems\nGood to Have:\nPerform security assessments, vulnerability scans, and observability analysis, and implement remediation actions to address findings.\nDevelop and maintain security-related documentation, including policies, standards, and procedures.What You'll Bring12+ years of relevant job experience\nBachelor’s Degree in computer science or related field preferred\nProficiency in scripting languages like Python, Ruby, or Bash.\nExperience working in hybrid environment preferred\nExpert level hands-on system administrator experience on public cloud platforms with at least one of the big three Google Cloud, Azure, and AWS. (Google Cloud and Azure highly preferred)\nProven experience with Configuration Management tools such as Ansible or equivalent technologies.\nStrong experience with Test and build systems such as Jenkins, GitLab, GitHub.\nExperience with Monitoring and reporting tools such as DataDog, New Relic, Nagios, and Graphite\nStrong experience with Linux operating systems\nExperience working with database systems, network topologies, and hardware\nGood to Have:\nFamiliarity with compliance frameworks such as GDPR, HIPAA, or PCI-DSS.\nUnderstanding of security principles, secure architecture design, and common security frameworks (e.g., OWASP, NIST, CIS).\nExperience with security tools and technologies, such as vulnerability scanners, intrusion detection systems (IDS), and SIEM solutions.CountryEEOText_Description: Why We Think You’ll Love Teradata We prioritize a people-first culture because we know our people are at the very heart of our success. We embrace a flexible work model because we trust our people to make decisions about how, when, and where they work. We focus on well-being because we care about our people and their ability to thrive both personally and professionally. We are an anti-racist company because our dedication to Diversity, Equity, and Inclusion is more than a statement. It is a deep commitment to doing the work to foster an equitable environment that celebrates people for all of who they are.City: Bangalore - VirtualState: KarnatakaCommunity / Marketing Title: Sr. Staff DevOps Engineer - Site Reliablity EngineeringJob Category: EngineeringCompany Profile:Our CompanyTeradata is the connected multi-cloud data platform for enterprise analytics company. Our enterprise analytics solve business challenges from start to scale. Only Teradata gives you the flexibility to handle the massive and mixed data workloads of the future, today.The Teradata Vantage architecture is cloud native, delivered as-a-service, and built on an open ecosystem. These design features make Vantage the ideal platform to optimize price performance in a multi-cloud environment.LinkedIn Remote:Location_formattedLocationLong: Bangalore - Virtual, Karnataka INJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}