{
    "Job ID": "69873706",
    "Description": "Are you driven by innovation? Is collaborative problem-solving your forte? Do you relish the idea of witnessing the ripple effects of your contributions in a grander context? If any of these resonate with you, then you're destined for success within the vibrant realm of WFM Tech Enterprise Data. We are a dynamic cohort of visionaries who channel our expertise into translating cutting-edge advancements in data and software engineering into real-world solutions that transcend conventional boundaries. We shape novel improvements every day, and now we invite you to be part of our pioneering narrative. Welcome to WFM Tech Enterprise Data, where we equip you with the tools and camaraderie you need to forge inventive pathways that are not just professionally fulfilling, but also incredibly enjoyable.\nOur team of Data engineers, Business Intelligence engineers, business analysts, and software engineers form the backbone of our business operations, enabling us to make informed decisions powered by data. As an Amazon Data Engineer, you will find yourself navigating the sprawling landscape of one of the amazon's largest data warehouses. Our enthusiasm lies in constructing a remarkably scalable big data ecosystem that bolsters our analytics, machine learning, and data-driven applications.\nKey job responsibilities\n- Architecture design and implementation of next generation data pipelines and BI solutions\n- Manage AWS resources including EC2, RDS, Redshift, Kinesis, EMR, Lambda, Glue, Apache Airflow etc.\n- Build and deliver high quality data architecture and pipelines to support business analyst, data scientists, and customer reporting needs.\n- Interface with other technology teams to extract, transform, and load data from a wide variety of data sources\n- Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers\nA day in the life\nNo two days are the same in WFM Tech Enterprise DATA team - the nature of the work we do and constantly shifting threat landscape means sometimes you'll be working with developing a data pipeline that will ensure efficient delivery of data to partner teams, other days you'll be working on developing data platform that is capable of processing large amounts of data in a short time.\nA day in the life:\nWork/Life Harmony: Our team gives high value to work-life harmony. Since the Covid19 pandemic we adjusted to remote work and established a hybrid work environment in which engineers spend 3 days working in the office, adjusted to the team needs.\nMentorship & Career Growth: We're committed to the growth and development of every member of the team, and that includes our development managers. As a data engineer you will play a vital part in growing your peers. You will have the opportunity to contribute to the culture and direction and deliver world-wide initiatives that will improve the life of all of our customers.\nOn-Call Responsibility: This position involves On-call responsibility. We work as a team to root-cause the issues and ensure our systems are resilient and fault-tolerant.\nAbout the team\nWFM Tech Enterprise DATA team is responsible for the creation and maintenance of Amazon Whole Foods global data infrastructure. Our mission is to make all of wholefoods and other grocery data easily accessible across multiple businesses by all users from a single location without any restrictions for all their reporting and analytics needs. Our long-term vision is to build a best-in-class data infrastructure to support worldwide grocery data to enable timely reporting and automated decision-making with standardized metrics to deliver top-line and bottom-line impact to Amazon’s grocery business.\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, KA, IND\n- A Bachelor's degree or higher in a quantitative/technical field, such as Computer Science, Statistics, or Engineering.\n- 3+ years of data engineering experience.\n- Profound experience in designing, implementing, and overseeing data processing systems tailored for extensive datasets.\n- Proficiency in at least one modern programming language, whether it's Java, Scala, or Python.\n- Hands-on expertise and advanced comprehension of SQL.\n- A firm grasp of data management fundamentals and principles underpinning data storage.\n- Proficiency in the realm of distributed systems as they pertain to data storage and cloud computing.\n- A proven track record of working with Open-Source Big Data tools, including Hadoop, Spark, Hive, and Presto, among others.\n- Demonstrated aptitude in independently managing and delivering end-to-end projects.\n- Relevance in areas such as Data Engineering, Database Engineering, Business Intelligence, or Business Analytics.\n- Practical familiarity with AWS Big Data Technologies, encompassing EMR, Athena, EC2, Redshift, and S3, to name a few.\n- Prior engagement with Redshift, PostgreSQL, SQL Server, or MySQL.\n- A documented history of successfully implementing robust big data solutions.\n- Proficiency in navigating both Batch and Real-Time data processing systems.\n- A proven knack for effective communication with users, technical counterparts, and senior management to gather requirements, elucidate data modelling decisions, and outline data engineering strategies.\n- Proven experience in providing technical leadership and mentoring fellow engineers in data engineering best practices.\n- Comprehensive comprehension of software coding practices throughout the development lifecycle, inclusive of agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}