{
    "Job ID": "69873285",
    "Description": "Company DescriptionDentsu Media is the largest area of specialism within the dentsu network. It is brought to markets globally, through three award-winning agency brands: Carat, iProspect and dentsu X. All three are underpinned by a scaled network offering of talent, capabilities, and services to support, grow and transform the world’s leading advertisers. Operating across more than 145 countries, dentsu Media is trusted by leading brands across a broad range of sectors, from pioneering technology to cutting-edge fashion. Dentsu leverages technology, creativity, and in-depth data analytics to drive superior results that amplify its clients' brands. Dentsu Media is transforming advertising as a force forgrowth, a force for good and has become the destination for employees to cultivate meaningful careers and for brands to accelerate previously unseen, sustainable growth.Roles & Responsibilities:• Communicate with the onshore team and QC on a day-to-day basis to understand the requirements• Create and develop reports based on the objectives of the social media campaigns and their KPIs• Checking the pacing of live campaigns• Learn the intricacies of every report and the larger role it plays in the Campaign Lifecycle• Read and infer data from trafficking sheets• Translate client’s campaign needs onto the platform• Adding tags to Ads on Social Media platforms• Draw actionable insights from reports made to add value to the on-shore team• Ensure all deliverables are of the highest quality and in adherence with agreed upon SLAsGood to have skills:Basic internet knowledge (Google/Youtube/etc.)\nFlexible to work across different time zones/shifts (including night shift)Must have Skills and Abilities: Excellent verbal and written communication skills\nAccuracy and attention to detail\nBe familiar with basic computer skills (MS Office) \nKnowledge of how digital marketing works\nAbility to interact with people at all levels of an organization, fostering strong cross-functional teamwork and results.\nAble to work well in a team environment.\nGood math and analytical skills Education & Training:• Any Degree• Trained on MS Excel & PowerPoint• Trained & Certified in any Social media platform is an added advantageJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}