{
    "Job ID": "69874351",
    "Description": "Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate.By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.We are currently seeking an experienced finance professional to join our Finance Shared Service Center in the capacity of Accountant – O2C.Overview of the roleAs an (O2C) Accountant in Group Finance Shares Service Centre (FSSC), he/she will focus on supporting the day-to-day activities of the O2C function whilst complying with organization’s policies and procedures and ensuring necessary checks and balances to mitigate risks:This position will be responsible for the following:Provide daily partnering support to business operations by assisting in O2C activities.\nPDC Management, which includes PDC collection, Warehousing, Banking, Maturing, Hold / Postponement etc.\nIdentify, highlight and expedite timely action to resolve exceptions / interface fallouts by performing review, reconciliation and substantiation of O2C accounts and reports.\nHighlight receivables and overdue position to business to facilitate their follow-up and collection activities.\nEnsure adequate provision is created for doubtful debts as per Policy.\nHighlight risks and exceptions based on daily review of Collection control accounts and ensure resolution of exceptions within SLA by escalating in a timely manner.\nCreate and maintain various master record for the O2C activities.\nPerform assigned month end book closing tasks within O2C.\nMonitor the ongoing automated activities and ensure continuity of daily tasks.\nSupport with resolution of audit requests within the submission timelines\nIdentify and support on standardization and improvement initiatives within the O2C function.\nExecute Customer Account Reconciliation/Balance Confirmation/SOA/Dunning etc.What you will doTimely O2C partnering support to Business in day-to-day operations\nPDC Management, which includes PDC collection, Warehousing, Banking, Maturing, Hold / Postponement etc.\nDaily collection control account monitoring and exception management\nPerform monthly / periodic reconciliation and substantiation of O2C accounts and highlight exceptions and related risks to the Business\nPreparation and circulation of periodic O2C exception reports & dashboards to stakeholders\nPerform assigned month end book closing tasks within O2C\nComputation of Provision for doubtful debts in accordance with Policy\nIdentify and support process standardization and improvement initiatives to improve efficiency and quality of reporting for FSSC O2C processes\nAny other O2C activities assigned from time to timeRequired skills to be successfulGood accounting knowledge (IFRS knowledge is preferred)\nAnalytical as well as Process oriented\nExcellent communication skills\nPrior working knowledge in ERP systems (ex: SAP)\nKnowledge of Excel, Power Point and other Microsoft office tools\nDetail-oriented and organizedWhat equips you for the roleFinance Graduate or Semi-qualified or equivalent qualifications\n1-3 years similar experience, with a good knowledge of ERP systemsWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.For further information, and to apply, please visit our website via the “Apply” button below.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}