{
    "Job ID": "69872902",
    "Description": "Requisition ID: 271924 Relocation Authorized: None \nTelework Type: Part-Time Telework \nWork Location: New Delhi Company Overview:Since 1898, we have helped customers complete more than 25,000 projects in 160 countries on all seven continents that have created jobs, grown economies, improved the resiliency of the world's infrastructure, increased access to energy, resources, and vital services, and made the world a safer, cleaner place.\nDifferentiated by the quality of our people and our relentless drive to deliver the most successful outcomes, we align our capabilities to our customers’ objectives to create a lasting positive impact.\nWe serve the Infrastructure; Nuclear, Security & Environmental; Energy, and Mining & Metals markets. Our services span from initial planning and investment, through start-up and operations. Core to Bechtel are our values – ethics, safety, quality, people, culture, relationships, innovation and sustainability, and our covenants – integrity, respect, collaboration, trust, and delivery. They are what we believe, what customers can expect, and how we deliver.Bechtel India is a global operation that supports execution of projects and services around the world. Working seamlessly with business line home offices, project sites, customer organizations and suppliers, our teams have delivered more than 125 projects since our inception in 1994.Our offices in Gurgaon, Vadodara and Chennai will grow significantly and sustainably with exciting career opportunities for both professionals and young graduates who are passionate about creating a cleaner, greener, and safer world; building transformational infrastructure; making decarbonization a reality; and protecting people and the environment.Summary:Responsible for handling a variety of technical activities performed in connection with Client Billing requirements. This position will be responsible for assessing commercial terms in Bechtel contracts and coordinating with the project team and the Job Accounting Data Base (JADB) accountant to set up Bechtel cost flows and terms of reimbursement. The Billing Supervisor role will be expected to initiate billing discussions for new projects (as directed by Mgr), coordinate receipt of required documentation and ensure that project invoicing activities are being handled appropriately.This position will also assist Billing Manager in reviewing journal vouchers and reconciliations prepared by Billing Team, gathering and preparing team metrics and performing other more complex analytical activities. The Billing Supervisor will also provide direction to other Billers within the team and assist them in understanding and performing assigned Billing activities. Supervises the day-to-day operations related to client and intercompany billing process. Reviews processes and procedures and makes recommendations for system enhancements. Reviews and approves accounting entries, client invoice packages, and account reconciliations. Provides day-to-day guidance on billing process inquiries. Assists in research for team's purview. Works closely with the Global Business Unit (GBU) on cost flow reviews for financials. Oversees and performs varied accounting or financial work requiring the standardized application of Corporate Policies and Management instructions, principals, concepts, and practices. Supervises internal and external audits or provides responses to inquiries associated with invoicing.Basic Qualifications:Read, Write, and Speak English Language.\nMust have the legal right to work in New Delhi, India without sponsorship.\nA B. Com degree from an accredited institution and MBA is preferred with emphasis in accounting or finance.\n10-12 years of experience in Finance/Accounting related activities. Accounts Receivable/ Billing experience.Preferred Qualifications:Career-driven individuals looking to relocate to projects or rotate to other finance functions sometime in the future.\nProficiency with Microsoft Office Applications and computer literacy and technical skills necessary to gain proficiency with major ERP systems and software.\nGood understanding of generally accepted accounting practices and techniques and strong analytical skills.\nMust have strong organizational skills and be effective in a high volume, deadline driven work environment. Good initiative and capability to work independently while also functioning effectively within a team environment.\nMust have good communication (oral and written) and interpersonal skills. Position requires significant interaction with other employees inside and outside the Billing Department including 3rd parties (non-Bechtel).\nGood business judgment in execution of assigned work and in understanding when issues need to be escalated for resolution.\nMust demonstrate leadership capabilities commensurate with requirements of a Billing Supervisor.Shaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}