{"Job ID": "69874003", "Description": "We’re looking for a <role> to join our <team> in <location>.Working for Signify means being creative and adaptive. Our culture of continuous learning and commitment to diversity and inclusion creates an environment that allows you to build your skills and career. Together, we’re transforming our industry.As the world leader in lighting, we’re constantly ahead of the curve. Through our leadership in connected lighting and the Internet of Things, we’re breaking new grounds in data analytics, AI, and smart homes, offices, cities and more!Signify is one of the few companies in the world to achieve carbon neutrality and our next sustainability goals are even bolder: doubling our positive impact on the environment and society by 2025.As a <job title> you’ll be responsible for <the main challenge, impact and purpose of the role, the USP!>.We’re on the lookout for forward-thinking innovators with a passion for sustainability. If you match this description, get in touch!What you’ll do<max 5 bullet points! Please mind the Signify tone of voice, make it personable and energetic and avoid corporate language><…..>\n\n<…..>\n\n<….>\n\n<…..>\n\n<……>Your qualifications<max 5 bullet points and only the need-to-haves! Please mind the Signify tone of voice, make it personable and energetic and avoid corporate language><…..>\n\n<…..>\n\n<….>\n\n<…..>\n\n<……>Our candidate profile is just a guide. We know that many talented people only apply for jobs when there is an exact match. If you don't fit all the criteria but believe this role is for you, we would very much like to hear from you.What you’ll get in return…<customize to your region/align specific rewards with your HM>We’re offering multiple opportunities for career development, like mentoring, coaching and stretch assignments, with strong international exposure for dynamic profiles. Learning is fundamental to our culture. Through continuous learning, we are transforming the industry. You have the chance to learn every day, acquire new skills and perspectives through customized online programs, and on-the-job experiences.See #SignifyLife through the eyes of our employees!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}