{"Job ID": "69873038", "Description": "Job Details:The world is transforming - and so is Intel. Here at Intel, we believe the world needs technology that can enrich the lives of every person on earth. We work every single day to design and manufacture silicon products that empower people’s digital lives. Do you love to solve technical challenges that no one has solved yet? Do you enjoy working with cross functional teams to deliver solutions for products that impact customers lives? If so, Come join us to do something wonderful. The IP Engineering Group is looking for energetic and passionate senior Design leaders to work closely with established ASIC design team for advanced digital IO controller (like PCIe, UPI, CXL, IOMMU etc) IP implementation on cutting edge technology nodes. Your responsibilities will include to oversee definition, architecture design, and documentation for SoC development. Work on micro-architecture design, logic design, and system simulation. You will perform all aspects of the SoC design flow from high-level design to synthesis, place and route, timing, and power to create a design database that is ready for SoC integration. Mentoring and coaching junior verification engineers. Leadership to manage stakeholders with end-to-end objectives in mind. The candidate should have the ability to work effectively with both internal and external teams/stakeholders. Should possess strong problem solving/communication skills. Should be a very good team player.Qualifications:You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates.Candidate should possess a Bachelor's degree in Electrical, Electronics, Computer Engineering or Computer Science or any related field with 7+ years' experience -OR - a Master's degree Electrical, Electronics, Computer Engineering or Computer Science or any related field with 5+ years experience -OR- PhD degree in Electrical, Electronics, Computer Engineering or Computer Science or any related field with 3+ years experience in:VLSI design.Verification/validation tests.Expertise in System Verilog/C++/OVM or UVM methodology and/or Formal Verification techniques.Preferred qualification:System simulation models, and debugging RTL/tests.High speed serial links IPs (PCIe, UPI, CXL, IOMMU etc).Experience in Computer architecture and PCIe, UPI, CXL, IOMMU, Cache Coherency protocolsWork Model for this RoleJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}