{"Job ID": "69873622", "Description": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. \nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!Job briefWith Adobe Document Cloud services, get every ounce of potential out of your PDFs and other documents from any device. Connect to your PDFs and Documents from anywhere. Share them with anyone. Create PDFs, get the content out of PDFs, and convert PDF documents to mobile ready layouts. Get more done without ever missing a beat! Experience it yourself at https://documentcloud.adobe.com/Adobe Document Cloud Services is building cloud services and cloud platform from ground up to help Adobe expand the footprint of Adobe Document Cloud to billions of users across devices and surfaces. See it in action at https://www.adobe.io/apis/documentcloud/dcsdk/With all the innovation happening in machine learning domain around Documents, Adobe Document Cloud is at the cusp of a revolution and is redefining the way world interacts with documents and document workflows.Read more about using AI to redesign PDF experience at https://techcrunch.com/2020/09/23/adobes-liquid-mode-uses-ai-to-automatically-redesign-pdfs-for-mobile-devices/ Using AI to extract content from PDF - https://www.adobe.io/apis/documentcloud/dcsdk/pdf-extract.htmlThe Adobe Document Cloud Services team is looking for a highly motivated engineering leader and technical thinker to join a high caliber, fast paced team. The engineering leader is expected to have deep experience of building low latency, high performance complex and distributed systems.What you will do:· Managing a full stack team of back-end and front-end engineers· Collaborate with product management, architects and other engineering teams in Document Cloud and the rest of Adobe to create the technical vision, and road map for the team.· Partnering with Product Management and Design to lead feature execution across engineering disciplines to deliver great experiences· Lead the design, development and testing of large scale, low latency high volume microservices which serve millions of requests every day.· Define and drive the best software development/engineering and operational practices for the team.· Explore new open-source technologies, adopt and contribute back to open-source.· Mentoring people, helping them grow, and develop their careers· Providing oversight, accountability, and leadership for technical decisions with a bias for action· Be well versed in emerging industry technologies and trends and communicate that knowledge to the team and use it to influence product direction.Must have skills:· B.S/B.E./B. Tech. in Computer Science or equivalent engineering degree· Experience in managing people and projects· Experience in design and development of software systems· 10+ years of software engineering experience building front-end & server/service applications· Experience in server-side technology and strong coding skills in Python, C++, Java and other server-side programming languages.· Has breadth of knowledge across the stack of web technologies - GraphQL, REST, Micro-services, data stores such as HBase, CosmosDB, Postgres, managed SQL DB etc.· Goes above and beyond to create high-quality, stable products that customers enjoy using· Brings people together across teams to successfully collaborate on innovative solutions· Proven expertise in distributed systems and building RESTful services· Strong verbal and written communication skillsPreferred skills:· 2+ years as an Engineering Manager or an Architect· Experience with LLM based application development· Experience with technical operations and CI/CD· Experience with Docker, and Kubernetes· Experience with monitoring systems like Splunk, NewRelic, DataDog, Grafana etc· Familiarity with front end frameworks like React. Angular, Vue.js etc.Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Noida, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}