{
    "Job ID": "69873505",
    "Description": "Job Number 23040125 Job Category Procurement, Purchasing, and Quality Assurance Location Rabat Marriott Hotel, Avenue Inaouin Arribat Center Agdal, Rabat, Morocco, Morocco VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Receive and stage merchandise by department, mark appropriately for placement in facility, and deliver merchandise to appropriate department. Stack received merchandise on pallets or carts. Complete requisition forms for inventory and supplies. Notify manager/supervisor of low stock levels in a timely manner. Receive deliveries, store perishables properly, and rotate stock. Inspect deliveries and date times to verify freshness, cleanliness, consistency, and quality throughout case lots. Refuse acceptance of damaged, unacceptable, or incorrect items. Adhere to food safety and handling policies and procedures across all food-related areas. Organize, clean, and sanitize all refrigerators and freezers, floors, food equipment, and drains. Remove empty pallets, cardboard, and trash and place in proper storage areas. Report accidents, injuries, and unsafe work conditions to manager; complete safety training and certifications. Follow all company policies and procedures; ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Speak to guests and co-workers using clear, appropriate and professional language. Develop and maintain positive working relationships with others; support team to reach common goals. Comply with quality assurance expectations and standards. Read and visually verify information in a variety of formats (e.g., small print). Stand, sit, or walk for an extended period of time or for an entire work shift. Move, lift, carry, push, pull, and place objects weighing less than or equal to 50 pounds without assistance. Grasp, turn, and manipulate objects of varying size and weight, requiring fine motor skills and hand-eye coordination. Move through narrow, confined, or elevated spaces. Move over sloping, uneven, or slippery surfaces as well as up and down stairs and/or service ramps. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Rabat, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}