{
    "Job ID": "69872668",
    "Description": "Key Responsibilities :Accountable to the GRL and Global Regulatory staff for the delivery of Marketing Application, pre-approval/investigational and lifecycle maintenance submissions to agreed timelines and in compliance with Regulatory Authority regulations and guidelines and in line with GSK SOPs and working practices\nMay be responsible for leadership of relevant submission team for product regulatory authority submission or maintenance activities associated with an approved product (including product renewals, site registrations/renewals/variations, label harmonisation, periodic benefit risk evaluation reports (PBRER) submissions etc)\nMay be required to provide guidance to project teams and client groups on GSK submission related processes and content and format requirements for key marketsJob Related Experience :Awareness of the pharmaceutical industry, drug development environment, and R&D processes and objectives.\nAwareness of Regulatory Affairs responsibilities from pre-IND through Phases I-IV\nAbility to effectively interact with line and middle management, staff and external contacts on a functional and strategic level in a matrix environment.\nAbility to think flexibly in order to meet constantly shifting priorities and timelines.\nAbility to interpret regulationsOther Job-Related SkillsGood written and verbal communication skills and ability to present information in a clear and concise manner\nExcellent organisational skills, attention to detail and commitment to deliver high quality output, even under pressures sometimes demanded by regulatory deadlines.\nAbility to work flexibility in large teamsWhy Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.  \nImportant notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.It has come to our attention that the names of GlaxoSmithKline or GSK or our group companies are being used in connection with bogus job advertisements or through unsolicited emails asking candidates to make some payments for recruitment opportunities and interview. Please be advised that such advertisements and emails are not connected with the GlaxoSmithKline group in any way.GlaxoSmithKline does not charge any fee whatsoever for recruitment process. Please do not make payments to any individuals / entities in connection with recruitment with any GlaxoSmithKline (or GSK) group company at any worldwide location. Even if they claim that the money is refundable.If you come across unsolicited email from email addresses not ending in gsk.com or job advertisements which state that you should contact an email address that does not end in “gsk.com”, you should disregard the same and inform us by emailing askus@gsk.com, so that we can confirm to you if the job is genuine.         Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}