{
    "Job ID": "69874623",
    "Description": "Company Profile:DMCC is a center of global trade. Headquartered in Dubai, DMCC is the world’s most interconnected Free Zone, home to over 22,000 member companies and the leading trade and enterprise hub for commodities. Whether developing vibrant neighborhoods with world-class property like Jumeirah Lakes Towers and the much anticipated Uptown Dubai, or delivering high performance business services, DMCC provides everything its dynamic community needs to live, work and thrive. Made for Trade, DMCC is proud to sustain and grow Dubai’s position as the place to be for global trade today and long into the future.Role Summary:The objective of the Officer role is to support the growth of the Gaming & Esports ecosystem in DMCC and to strengthen its value proposition by working with the Sr. Exec on developing new services and strategic initiatives and partnerships and delivering engagement and activation programs at the Gaming Centre. The primary focus of the Officer is to be the first point of contact for all incoming leads to the DMCC gaming centre and to nurture those leads and converting them into members, advising them on the most suitable set up solution and license activities, before passing them on to the Business Setup team. The officer will also support the Sr. Executive in the delivery of the center’s activation programs and initiatives and in on-boarding, managing, and retaining members. Finally, the Officer will perform a regular and structured surveying of clients to capture the satisfaction level and support the senior executive conduct market and competitor analysis to ensure we remain relevant and competitive; the Officer will also work with Marketing to ensure that the Centre’s campaigns and marketing collateral are updated. Responsibilities:Support the Sr. Executive and Head in delivering the center's activation programs (acceleration, incubation, and networking) \nSupport in the onboarding and retention of gaming centre members\nPerform a regular and structured surveying of clients to capture the satisfaction level and report feedback to the Manager. \nInitiate contact with assigned leads and answer all inquiries within the same day. Get to know the client’s potential and future plans and really understand their business.\nProvide informed advice on all gaming related license activities and company set up procedures and the set-up timelines.\nSell DMCC, Gaming Centre and Upselling DMCC’s packages & value-added services and convert leads into opportunities. Ensure that clients initiate their application.\nCapture all the required info which can help in profiling and qualifying the new leads and will be a valuable input to the Business Setup Team and to Sales & BD strategy.\nSupport in hosting delegation visits at the Centre and provide a tour of the Centre and other DMCC facilities \nPromote the Centre and generate leads by participating in relevant events, exhibitions, by working with Marketing on content marketing and digital campaigns\nSupport in identifying collaboration opportunities and building new relationships with key multipliers.\nSupport the Sr. Exec in conducting market research and competitive review activities to identify opportunities for improvements and new product development. \nProactively and regularly support the senior executive to review Centre’s on-boarding process, templates, brochures, and web content to identify any gaps or areas for improvement and propose changes and work with respective teams to implement the change. \nWork closely with Events and Marketing teams to build, organize and deliver the Gaming Centre events. Qualifications:Bachelor Degree Level – in Business, management, computer science or related field\n1+ years business experience in a client facing role (sales or account/relationship management) or events management role, preferably in the field of gaming & esports.       \nProficient in office administration\nWorking with a CRM, preferably Salesforce\nGood level of computer literacy and communication skills The successful candidate will enjoy the following:Working at the world’s best Free Zone with highly motivated colleagues\nA very diverse workforce from all around the globe\nWell-being initiatives all over the year\nMarket competitive basic salary\nHousing allowance\nTransportation allowance\nNational Allowance\nAnnual flight allowance\nOther alternative family benefits\nPension Scheme\nDiscretionary bonus schemes\nGenerous annual leave\nMedical and life insurance cover\nFree covered parking\nRetail discounts with over 450 outlets across JLT.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}