{
    "Job ID": "69873009",
    "Description": "The MIG optical group has the charter for all Platform Dependent software development across dierent Optical platforms such as NCS1001/1002/1004, NCS4000, NCS2000. At MIG Optical, we build the Next Generation Optical line systems (NCS series) and next-generation XR-based optical Xponders used for Datacenter interconnect, Metro, and Sub-sea data links.Responsibilities:\nDesign, develop, test, deploy, maintain and improve the software.\nWrite design specications and software. Participate in code reviews and help the team to optimize code.\nLead the project priorities, deadlines, and deliverables.\nWork with product management and technical marketing to understand requirements. Work with internal teams to integrate and test new features and resolve integration issues.\nDebug, root cause, and x complex system-level software deciencies.\nExplore improvement opportunities in product and technology.Desired Skills:\n5-9 years of software development experience in C, C++ programming language. Experience in Python programming language for Unit test automation.\nKnowledge in embedded software development and experience in multi-threaded application development.\nUnderstanding of 10GE,100GE, 400GE Ethernet protocols\nUnderstanding of Optical transport network, OTN, and OTN beyond 100G technology. Understanding of Coherent optical technology.\nAbility to drive system-level architecture and design, with good troubleshooting skills. Ability to work with multiple partners across geographies to solve complex engineering problems.\nExperience in Linux Kernel Programming and open source technologies. Understanding of Agile development and Scrum methodology.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Telecommunications",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}