{"Job ID": "69875805", "Description": "About PayUPayU, a leading payment and Fintech company in 50+ high-growth markets throughout Asia, Central and Eastern Europe, Latin America, the Middle East and Africa, part of Prosus group, one of the largest technology investors in the world is redefining the way people buy and sell online for our+ merchants and millions of consumers. As a leading online payment service provider, we deploy more than 400 payment methods and PCI-certified platforms to process approximately 6 million payments every single day. Thinking of becoming a PayUneer and you are curious to know more about us? Read more about the life in PayU here iyzicoKey ResponsibilitiesWork across the full product lifecycle, from establishing the value proposition to creating and validating initial concepts, to delivering final designs (analysis, ideation, design, implementation, user testing)\nInterpret and translate UX concepts into high fidelity components and designs through close collaboration with our product designers, product managers and developers\nCollaborate with product management and engineering to define and implement innovative solutions for the product direction, visuals and experience\nDeliver compelling insights to the product and design teams\nCreate wireframes, user flows, process flows and site maps to effectively communicate interaction and design ideas\nMake consistent UI, seamless experience cross platform: web, mobile web, native apps\n(Establish and) Promote design guidelines, best practices and standards\nFacilitate evidence-based product and design decisionsQualifications & Experience Min. 5 years of experience in working as a Product Designer for mobile or web-based products\nProficiency in design prototype/handoff/feedback tools such as Figma, Sketch, Abstract, Zeplin, design tools\nKnowing and applying UX research methods where necessary\nDemonstrated ability to analyze and understand problems, user flows, prototype, interactions, and cooperate with developers during the implementation of your design\nUnderstanding of core Product design lifecycle\nInterested in the world of data and eager to use it in design decisions\nUp-to-date with the latest design trends, techniques, and technologies\nHigh analytical and holistic thinking skills\nExcellent presentation and communication skills\nExperience working in an Agile/Scrum development processWhat We OfferA culture of continuous development: conferences, in-house events & Tech Talks to stay up-to-date on current research and technology. P.S.:You do not need to wait to get on the stage and share your expertise with you teammates and the community,\nOnline Training Platform (Free access to Udemy, Harvard ManageMentor, Getabstract, etc.),\nFreedom under responsibility is our common mindset. That’s how we designed our flexible working model called iyzico Homequarters,\nFreedom to work both from home and office. Our headquarters is in Altunizade İnci Ofis.\niyzicoMate is assigned to help you with anything you may need,\nA detailed orientation program designed for you to fully grasp the iyzico culture,\nMeal & Internet Allowance,\nHomequarters Allowance to create an ergonomic workspace at home and we are providing extra monitor and office chair,\nMacbook,\nEmployee support program: free psychological counseling, legal advice, financial advice etc.\nPrivate health insurance,\n1 day birthday leave, Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}