{
    "Job ID": "69873576",
    "Description": "Job Requisition ID: 156790 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the RoleSystems Engineer is responsible for first level support for users, core Infrastructure and Production Systems monitor, maintain IT software and hardware, troubleshoot IT issues, and install new hardware, software and the implementation, deployment of Computer systems and IT projects.What Will You DoOperational SupportProactively ensure system performance are within defined performance matrix and highly available\nSystems are to be secured with latest updates and patches as per the Patch Management Policy\nExecute proactive measures to reduce unplanned downtime\nInstallation and Provision of Infrastructure Systems, computers, POS Machines, hardware and software.\nMonitor critical systems health and capacity, escalate to relevant team for necessary action\nProvide Technical support for end users\nTroubleshoot network issuesIncident & Service Request ManagementResolve assigned Incidents and Service requests to be resolved within agreed SLA’s\nLiaise with vendors and service providers to resolve reported cases\nAssist cross functional team for speedy resolution of IncidentsContinuous Improvement InitiativeIdentify systems which are nearing end of life and refresh in phased manner\nAssist Sr. Systems Engineers in continuous improvement initiativesOther Key ResponsibilitiesDevelop & maintain documentation of system architecture and configurations\nProvide technical support for different IT projectsRequired Skills to be Successful5 years of experience in supporting core IT infrastructure, computer systems, POS machines in a large organization both hardware and software.\nKnowledge of ITIL practices\nStrong experience in Microsoft environment.\nShould have good experience in SAP IS-Auto Dealer Business Management\nFamiliar with configuring Service Order, Service Maintenance Contract, Warranty, MRSS, CATS and NWBC process.\nWell versed with SAP DBM integration with SAP MM and SAP FICO\nExperience in integration with third party applicationAbout the TeamThe role will be based in Cairo and will be reporting to the Group IT Manager.What equips you for the role:A degree or Diploma in Computers, Telecommunication or related discipline.\nMCSE certified\nITIL Certified\nExpertise in Implementing and providing Technical support to core IT Infrastructure of a large organization.\nStrong analytics skills\nReady to support in different locations/ Branches\nReady to provide support when required outside the working hoursWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}