{"Job ID": "69874511", "Description": "We help the world see new possibilities and inspire change for better tomorrows. Our analytic solutions bridge content, data, and analytics to help business, people, and society become stronger, more resilient, and sustainable.Position Overview:\nWe are seeking a skilled and dedicated QA Engineer with 6 to 7 years of experience to join us. As a QA Engineer, you will play a pivotal role in ensuring the quality, reliability, and performance of our insurance products. Your expertise will contribute to our mission of delivering exceptional solutions to our clients and customers.\nResponsibilities:\n• Collaborate with internal development teams to understand project requirements and functionalities.\n• Develop comprehensive test plans, test cases, and test scripts based on project specifications.\n• Execute manual and automated tests across different software applications, including web-based platforms and APIs.\n• Identify, document, and report defects in a clear and structured manner using established tools and processes.\n• Analyze test results and provide feedback to development teams for continuous improvement.\n• Participate in the full software development lifecycle, from design and development to deployment and maintenance.\n• Collaborate with cross-functional teams to ensure alignment on quality standards and project timelines.\n• Perform regression testing to ensure the stability of software releases and updates.\n• Contribute to the enhancement of QA processes, methodologies, and best practices.\n• Stay up-to-date with emerging technologies and industry trends related to quality assurance.Qualifications:\n• Bachelor's degree in Computer Science, Software Engineering, or a related field.\n• Proven experience as a QA Engineer or similar role, with exposure to multiple tech stacks, including PHP, NodeJS, Python, and C#. with a minimum of 6 to 7 years of experience.\n• Familiarity with manual and automated testing methodologies and tools.\n• Solid understanding of software development lifecycle and Agile methodologies.\n• Proficiency in writing test cases, test scripts, and test plans.\n• Experience with testing web-based applications and APIs.\n• Strong problem-solving skills and attention to detail.\n• Excellent communication and collaboration abilities.\n• ISTQB or other relevant certifications are a plus.\nPreferred Skills:\n• Knowledge of version control systems (Git, SVN).\n• Experience with test automation frameworks (Selenium, Cypress, PHPUnit, etc.).\n• Understanding of continuous integration and continuous deployment (CI/CD) pipelines.\n• Familiarity with insurance or financial services industry is a plus.In 2022, Verisk received Great Place to Work® Certification for our outstanding workplace culture for the sixth year in a row and second-time certification in the UK, Spain, and India. We’re also one of the 38 companies on the UK’s Best Workplaces™ list and one of 18 companies on Spain’s Best Workplaces™ list.For over fifty years and through innovation, interpretation, and professional insight, Verisk has replaced uncertainty with precision to unlock opportunities that deliver significant and demonstrable impact. From our historic roots in risk assessment, we’ve grown to provide analytic insights that help transform industries focused on some of the world’s most critical areas. Today, the insurance industry relies on Verisk to be, and to make the world, more productive, resilient, and sustainable.Verisk works in collaboration with our customers and at the intersection of people, data, and advanced technologies. Through proprietary platformed analytics, advanced modeling, and interpretation, we deliver immediate and sustained value to our customers and through them, to the individuals and societies they serve, with greater speed, precision, and scale. We’re 9,000 people strong, committed to translating big data into big ideas. We help others see new possibilities and empower certainty into big decisions that impact individuals and societies. And we relentlessly and ethically pursue innovation to help move our customers, and the world, toward better tomorrows.\n\nEveryone at Verisk—from our chief executive officer to our newest employee—is guided by The Verisk Way, to Be Remarkable, Add Value, and Innovate.\n• Be Remarkable by doing something better each day in service to our customers and each other\n• Add Value by delivering immediate and sustained results that drive positive outcomes\n• Innovate by redefining what’s possible, embracing challenges, and pushing boundariesVerisk BusinessesUnderwriting Solutions — provides underwriting and rating solutions for auto and property, general liability, and excess and surplus to assess and price risk with speed and precisionClaims Solutions — supports end-to-end claims handling with analytic and automation tools that streamline workflow, improve claims management, and support better customer experiencesProperty Estimating Solutions — offers property estimation software and tools for professionals in estimating all phases of building and repair to make day-to-day workflows the most efficientExtreme Event Solutions — provides risk modeling solutions to help individuals, businesses, and society become more resilient to extreme events.Specialty Business Solutions — provides an integrated suite of software for full end-to-end management of insurance and reinsurance business, helping companies manage their businesses through efficiency, flexibility, and data governanceMarketing Solutions — delivers data and insights to improve the reach, timing, relevance, and compliance of every consumer engagementLife Insurance Solutions – offers end-to-end, data insight-driven core capabilities for carriers, distribution, and direct customers across the entire policy lifecycle of life and annuities for both individual and group.Verisk Maplecroft — provides intelligence on sustainability, resilience, and ESG, helping people, business, and societies become strongerVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}