{"Job ID": "69873765", "Description": "You Lead the Way. We’ve Got Your Back.At American Express, we know that with the right backing, people and businesses have the power to progress in incredible ways. Whether we’re supporting our customers’ financial confidence to move ahead, taking commerce to new heights, or encouraging people to explore the world, our colleagues are constantly redefining what’s possible — and we’re proud to back each other every step of the way. When you join #TeamAmex, you become part of a diverse community of over 60,000 colleagues, all with a common goal to deliver an exceptional customer experience every day. We back our colleagues with the support they need to thrive, professionally and personally. That’s why we have Amex Flex, our enterprise working model that provides greater flexibility to colleagues while ensuring we preserve the important aspects of our unique in-person culture. Depending on role and business needs, colleagues will either work onsite, in a hybrid model (combination of in-office and virtual days) or fully virtually.Job Description:American Express is recognised for its innovative, forward-thinking Human Resources organisation. Human Resources has changed to CEG (Colleague Experience Group). This role is a part of CEG Risk and Systems – Operational Excellence organisation which was established within CEG to serve as the first line of defence to strengthen the risk and compliance program.The analyst in this role will report to a Manager - Operational Excellence and will work closely with the larger CEG Operational Excellence team, several of whom are also based in Gurgaon, India. This analyst will play an important role in overseeing the execution of Compliance and PRSA (Process Risk Self-Assessment) programs for CEG.Job Responsibilities:Working knowledge of Compliance programs like Compliance Risk Assessment (CRA) which consists of BUAM (business unit applicability matrix) – Legal Mandate applicability and tagging to various CEG processes along with requirement analysis and mapping\nAnalyse the intake of applicable regulations through the Regulatory Change Management (RCM) program and ensure timely closure of all key milestones as part of the program while collaborating with GCO, MCO, LOBCO and all key business stakeholder within CEG,\nOversee the successful completion of PRSA activities for CEG, including ensuring that processes are well designed, meet applicable requirements and are supported through robust controls and testing.\nWork closely with senior leaders and their representatives to ensure appropriate risk management, mitigation and/or elimination not limited to Control Assertion and Testing\nBuild/maintain strong relationships with key partners: regular forums /steering committees with TLM, TSM, CEG Ops Risk, Information Security/AET, TRMs, Third Parties, Colleague Privacy and other relevant SMEs and key Compliance stakeholders as required\nProvide best practices, promote consistency and lead/contribute to initiatives to improve and streamline processes\nEnsure enterprise risks and control requirements are properly understood by the business and implemented effectively within the process.\nLook for creative, alternate solutions and consolidation opportunities and perform thematic root-cause analysis on recurring Risk Events to identify unmitigated risks and areas for control enhancements\nConduct of risk assessments using the company’s standard methodologies; mitigate identified control weaknesses through the creation of appropriate action plans.\nSupport initiatives and provide consultation on risks that needs to be considered by the business and ensure risks are properly assessed, measured, and mitigated.QualificationsPrior relevant experience working with PRSA program, Audit, Compliance, Operational Risk, Operational Excellence, Regulatory, Legal and/or control functions – Preferred\nUnderstanding of how legal and regulatory requirements are interpreted and can be implemented across various processes; strong awareness of current and upcoming regulatory change\nFlexible approach and ability to ‘think outside the box’\nIntellectual curiosity to manage risk processes as needed for CEG Operational Excellence, including business process improvement and control design and testing.\nArticulate and comfortable with a complex, matrix working environment.\nAbility to manage multiple priorities independently without close supervision.\nEffective in written and verbal communication with partners located globally.\nStrong team player, and self-motivation with the ability to handle multiple work streams and ad-hoc tasks simultaneously.\nProficiency in managing multiple priorities simultaneously with strong attention to detail.\nExperience driving transformation and change initiatives\nAdvanced Excel, PowerPoint and Database skills are essential.We back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritise their physical, financial, and mental health through each stage of life. Benefits include:Competitive base salaries \nBonus incentives \nSupport for financial-well-being and retirement \nComprehensive medical, dental, vision, life insurance, and disability benefits (depending on location) \nFlexible working model with hybrid, onsite or virtual arrangements depending on role and business need \nGenerous paid parental leave policies (depending on your location) \nFree access to global on-site wellness centres staffed with nurses and doctors (depending on location) \nFree and confidential counselling support through our Healthy Minds program \nCareer development and training opportunitiesAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.  Offer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}