{
    "Job ID": "69874665",
    "Description": "About UsDMCC is a government entity established in 2002 to enhance commodity trade flows through Dubai. We perform a range of roles which continue to position Dubai as the preferred destination for global commodities trade and DMCC as the world’s No.1 Free Zone.Company Profile:DMCC is a center of global trade. Headquartered in Dubai, DMCC is the world’s most interconnected Free Zone, home to over 22,000 member companies and the leading trade and enterprise hub for commodities. Whether developing vibrant neighborhoods with world-class property like Jumeirah Lakes Towers and the much-anticipated Uptown Dubai, or delivering high performance business services, DMCC provides everything its dynamic community needs to live, work, and thrive. Made for Trade, DMCC is proud to sustain and grow Dubai’s position as the place to be for global trade today and long into the future.Role Summary:The objective of the Executive role is to support the Manager in growing the crypto & blockchain ecosystem in DMCC and in strengthening its value proposition by developing new services and strategic initiatives and partnerships and delivering engagement and activation programs at the crypto centre. The primary focus of the Executive will be generating and nurturing leads for DMCC crypto centre and converting them into members, advising them on the most suitable set up solution and license activities, before passing them on to the Business Setup team. The executive will also be responsible for supporting the Manager in the delivery of the center’s activation programs and initiatives and in on-boarding, managing and retaining ecosystem partners and members.  Finally, the Executive will support the Manager with key projects and on conducting market and competitor analysis in order to grow the ecosystem. Responsibilities:Work with key partners on delivering the center's activation programs(acceleration, incubation, and networking) in collaboration with Marketing and the Centre’s Manager. \nManage the onboarding and retentionof crypto centre members.\nInitiate contact with assigned leads and answer all inquiries within the same day. Get to know the client’s potential and future plans and really understand their business.\nProvide informed advice on all crypto related license activities and company set up procedures and the set-up timelines.\nSell DMCC, Crypto Centre and Upselling DMCC’s packages & value-added services and convert leads into opportunities. Ensure that clients initiate their application.\nCapture all the required info which can help in profiling and qualifying the new leads and will be a valuable input to the Business Setup Team and to Sales & BD strategy.\nAttend to delegation visits at the Centre and deliver the Centre’s value proposition, linking it to DMCC’s overall vision and objectives. Identify opportunities for collaboration and lead generation and recommend them to the Manager.\nWork with the Manager to support the Centre’s strategic alliances and ecosystem partners, ensuring that appropriate KPI’s are in place and measured. \nPromote the Centre and generate leads by participating in relevant events, exhibitions, by working with Centre Manager and Marketing on content marketing and digital campaigns.\nHost inbound delegations relevant to the Centre and deliver the Centre’s value proposition, linking it to DMCC’s overall vision and objectives. Identify opportunities for collaboration and lead generation and ensure post meeting follow-up is conducted.\nProvide input to Section Head and Marketing on strategies and key target markets for client acquisition from sector.\nSupport the Manager in preparing the centre’s product development plans and in the roll-out of new programs, products, and services and in monitoring the related performance. \nSupport the manager in conducting market research and competitive review activities to identify opportunities for improvements and new product development.  Qualifications:Bachelor’s degree level – in Business, management, or related field.\n3-5 years business experience in sales or client management or account management, with at least 1 in the field of crypto or blockchain.\nWorking with a CRM, preferably Salesforce.\nHigh level of computer literacy and communication skills.\nMarket understanding - knowledge of DMCC and Free zone’s unique selling points, as well as a good idea of the local competition knowledge of the crypto & blockchain sector and technology.The successful candidate will enjoy the following:Working at the world’s best Free Zone with highly motivated colleagues\nA very diverse workforce from all around the globe\nWell-being initiatives all over the year\nMarket competitive basic salary\nHousing allowance\nTransportation allowance\nNational Allowance\nAnnual flight allowance\nOther alternative family benefits\nPension Scheme\nDiscretionary bonus schemes\nGenerous annual leave\nMedical and life insurance cover\nFree covered parking\nRetail discounts with over 450 outlets across JLT.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}