{
    "Job ID": "69873428",
    "Description": "Careers that Change LivesThis position requires close collaboration and working alignment with India commercial and marketing teams for program prioritization and implementation. The position focuses on creating and implementing programs for Sales Force Training and Medical Education Pathways. The aim is to develop therapy knowledge and application skills of sales and health care professionals involved in the management of focus therapy in Neurosciences assigned portfolios. The role will require also execution of procedural and clinical education programs for targeted group of HCPs in alignment to OUs strategic objectives.Strong engagement with key local key opinion leaders is also a foundational pillar to this role.Serves as an expert in designing local context educational programs and raises the bar by creating and implementing new strategies and educational programs to help drive procedural adoption through safe & effective use of training.A Day in the Life·In collaboration with Sales and Marketing, participates in the development of OUs business strategy to achieve educational objectives.·Create & implement 180 days education pathway for New employees.·Conduct training need analysis periodically. Customize refresher programs for existing sales team.·Create and implement Medical Education strategies that are aligned with business requirements. Participation in OUs monthly/Quarterly/ Yearly business review to ensure alignments and representation of T&E plans and outcomes.·Develop and manage faculty/KOL relationships that create and conduct surgical education programs (both live and online).·Recruit, contract and partner with faculty in each target specialty to develop procedural content and assets·Develop regional proctor network for each of the target specialties·Review current Medical Education offering and gaps and to design events that support learning pathways from awareness to advocacy. Analyze program feedback for continuous medical education opportunities; work with Commercial Teams for appropriate follow-up·Implement and maintain T&E data base·Identify / develop / expand key KOLs and training center partnerships as prioritized together with OUs and countries.·Identify and pilot innovative education tools for realistic training scenarios, that can lead to enhancing learner engagement and allow assessment of program effectiveness for both internal MDTs stakeholders and external HCPs.·Maintain solid working relationships with OUs and educators for cross-collaboration and leverage·Provide opportunities for localization of programs·Working with local Legal and Compliance Teams, ensure that all programs meet Medtronic policies and are properly documented – align with T&E Operations teams·Continuously drive and elevate end-user experience of all T&E programs·Working with the Commercial Teams, align with societies / associations / teaching hospitals for appropriate medical education programs·Support key Society events – such as annual conferences - as required·Manage allocated budgets and to contribute to the T&E group’s efficient budget and resources management·Analyze day-to-day issues to identify/ prioritize and oversee possible problem-solving scenarios·Foster solid working relationship with OU education groups for cross-leverage·Prepare events budgets for AOP planning, track expenses quarterly·Develop Training Calendar for AOP and Event Planning – Communicate programs / Outcomes·Ensure that logistics for the various education events are planned and internal stakeholders are informedMust Have: Minimum Requirements·At least 5 years background in the medical devices business area is required. Previous clinical experience is an advantage.·A minimum of 3 years’ experience in medical education strategy and implementation is desirable, with a foundational knowledge of Competency Based Education concepts.·Tertiary education in relevant clinical / business areas·Strong record of achieving goals·Proven ability to create / localize medical education training materials·High level communications and presentation skills·Ability to build strong relationships with key stakeholder·Experience in a “team oriented” multi-cultural environment·Motivated for self-development / improvementJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}