{"Job ID": "69873564", "Description": "Job Number 23148091 Job Category Food and Beverage & Culinary Location Hyderabad Marriott Hotel & Convention Centre, Tank Bund Road, Opposite Hussain Sagar Lake, Hyderabad, Andhra Pradesh, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Accountable for overall success of the daily kitchen operations. Exhibits culinary talents by personally performing tasks while leading the staff and managing all food related functions. Works to continually improve guest and employee satisfaction while maximizing the financial performance in all areas of responsibility. Supervises all kitchen areas to ensure a consistent, high quality product is produced. Responsible for guiding and developing staff including direct reports. Must ensure sanitation and food standards are achieved. Areas of responsibility comprise overseeing all food preparation areas (e.g., banquets, room service, restaurants, bar/lounge and employee cafeteria) and all support areas (e.g., dish room and purchasing). CANDIDATE PROFILE Education and Experience • High school diploma or GED; 6 years experience in the culinary, food and beverage, or related professional area. OR • 2-year degree from an accredited university in Culinary Arts, Hotel and Restaurant Management, or related major; 4 years experience in the culinary, food and beverage, or related professional area. CORE WORK ACTIVITIES Leading Kitchen Operations for Property • Leads kitchen management team. • Provides direction for all day-to-day operations. • Understands employee positions well enough to perform duties in employees' absence or determine appropriate replacement to fill gaps. • Provides guidance and direction to subordinates, including setting performance standards and monitoring performance. • Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example. • Encourages and builds mutual trust, respect, and cooperation among team members. • Serving as a role model to demonstrate appropriate behaviors. • Ensures property policies are administered fairly and consistently. • Reviews staffing levels to ensure that guest service, operational needs and financial objectives are met. • Establishes and maintains open, collaborative relationships with employees and ensures employees do the same within the team. • Solicits employee feedback, utilizes an \"open door\" policy and reviews employee satisfaction results to identify and address employee problems or concerns. • Supervises and coordinates activities of cooks and workers engaged in food preparation. • Demonstrate new cooking techniques and equipment to staff. Setting and Maintaining Goals for Culinary Function and Activities • Develops and implements guidelines and control procedures for purchasing and receiving areas. • Establishes goals including performance goals, budget goals, team goals, etc. • Communicates the importance of safety procedures, detailing procedure codes, ensuring employee understanding of safety codes, monitoring processes and procedures related to safety. • Manages department controllable expenses including food cost, supplies, uniforms and equipment. • Participates in the budgeting process for areas of responsibility. • Knows and implements the brand's safety standards. Ensuring Culinary Standards and Responsibilities are Met • Provides direction for menu development. • Monitors the quality of raw and cooked food products to ensure that standards are met. • Determines how food should be presented, and create decorative food displays. • Recognizes superior quality products, presentations and flavor. • Ensures compliance with food handling and sanitation standards. • Follows proper handling and right temperature of all food products. • Ensures employees maintain required food handling and sanitation certifications. • Maintains purchasing, receiving and food storage standards. • Prepares and cooks foods of all types, either on a regular basis or for special guests or functions. Ensuring Exceptional Customer Service • Provides and supports service behaviors that are above and beyond for customer satisfaction and retention. • Improves service by communicating and assisting individuals to understand guest needs, providing guidance, feedback, and individual coaching when needed. • Manages day-to-day operations, ensuring the quality, standards and meeting the expectations of the customers on a daily basis. • Displays leadership in guest hospitality, exemplifies excellent customer service and creates a positive atmosphere for guest relations. • Interacts with guests to obtain feedback on product quality and service levels. • Responds to and handles guest problems and complaints. • Empowers employees to provide excellent customer service. Establishes guidelines so employees understand expectations and parameters. Ensures employees receive on-going training to understand guest expectations. • Reviews comment cards, guest satisfaction results and other data to identify areas of improvement. Managing and Conducting Human Resource Activities • Identifies the developmental needs of others and coaching, mentoring, or otherwise helping others to improve their knowledge or skills. • Ensures employees are treated fairly and equitably. • Trains kitchen associates on the fundamentals of good cooking and excellent plate presentations. • Administers the performance appraisal process for direct report managers. • Interacts with the Banquet Chef and Catering department on training regarding food knowledge and menu composition. • Observes service behaviors of employees and provides feedback to individuals and or managers. • Manages employee progressive discipline procedures for areas of responsibility. • Ensures disciplinary procedures and documentation are completed according to Standard and Local Operating Procedures (SOPs and LSOPs) and supports the Peer Review Process. Additional Responsibilities • Provides information to executive teams, managers and supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person. • Analyzes information and evaluating results to choose the best solution and solve problems. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}