{"Job ID": "69874329", "Description": "SEEKA Technologies (Not Seeka Limited) is a project under its parent organization called Fresh Futures Australia which is an education consultant based in both Australia and Malaysia. It will be a huge platform that utilises A.I. to help match students and job seekers to the right opportunities relevant to them from Primary/Grade school to University level as well as language schools and job opportunities. Our mission is to make it easier for anyone to find, filter and apply to different schools or educational institutions that suit them best as well as make the transition from studies to work more seamless.   We are currently looking to hire any talented graphics designer who understands user experience design and is passionate about creating great user interfaces that users would just love to use.  IMPORTANT NOTES:Only English is spoken on this job\nFresh graduates are welcome to apply for this job roleUsing Adobe XD for prototype designs\nDesigning app pages, features, buttons, layouts, etc\nDesigning website pages, features, buttons, layouts, etc\nDesigning marketing or promotional material\nConverting design files into ones suited for back-end developers\nHelping us design the overall UI and UX of websites and our Mobile Application\nSuggest to improve software/application user experience\nBeing innovative and creative thinking \nTo design marketing tools such as email templates, social media posts, banners, etc.\nTo work with the marketing, business or psychology department when necessary\nTo work with agile design frameworks between you and your managers and colleagues who may also belong to different departments like I.T., Business, Marketing and even Psychology! Candidate must possess or currently be pursuing a Diploma or Bachelor's Degree in Graphics Design/ Art/Design/Creative Multimedia, Advertising/Media or equivalent.\nHave a CGPA of at least 2.80\nAdobe Photoshop (must have at least basic knowledge)\nAbility to use Adobe Illustrator. InDesign and Premeir Pro is a bonus\nAbility to use Invision and Figma is a bonus\nVideo editing skills is a bonus\nAbility to code and program using HTML, C++, etc is a bonus\nAble to adapt designs to different styles for various projects\nYou must be able to work quickly and fluidly through all phases of the process, from research, to concept, to design and final execution\nCapable of executing design projects independently\nAble to think out of the box in generating new ideas for content creation\nA high degree of accuracy, proactivity and attention to detailBenefits Work from home or remote work is allowed \nA reference letter can be requested upon completion of internship\nA bit of flexibility with working time aside from the usual 9am to 6pm (Ex. 8am to 5pm / 7:30am to 4:30pm)Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Islamabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}