{
    "Job ID": "69875760",
    "Description": "Join the UAE’s largest bank and one of the world’s largest and safest financial institutions. Our focus is to create value for our employees, customers, shareholders and communities to grow through differentiation, agility and innovation. We are looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry.  Implementation and management of a well-coordinated approach to service all corporate sponsorships and partnerships.Assist the lead identifying and managing a portfolio of sponsorships and partnership to deliver against core business objectives.Responsible for the execution and management of sponsorship, partnership, and event activation programs.KEY ACCOUNTABILITIES:Policies, Systems, Processes & ProceduresFollow all relevant departmental policies, processes, standard operating procedures, and instructions so that work is carried out in a controlled and consistent manner.\nDemonstrate compliance to organisation’s values and ethics at all times to support the establishment of a value drive culture within the bank.\nManage and ensure effective implementation of functional policies, procedures and controls covering all areas of assigned department activity so that all relevant procedural/legislative requirements, fulfilled while delivering a quality, cost-effective service.People ManagementMaintain a positive, productive working relationship with other team members, being proactive, using own initiative and taking ownership of situations.Continuous ImprovementTo embrace the voice, attitude, values and integrity of the Brand\nLead the identification of opportunities for continuous improvement and sustainability of systems, processes and practices considering global standards, productivity improvement and cost reduction.\nActively seeks personal development opportunities that supports the team’s careers progression within FAB\nTo deliver added value that can be leveraged across all marketing channels.Job Roles & ResponsibilitiesManage and execute assigned activation programs independently.\nAssist with agency briefing and presentations to senior management\nReview agreements, make recommendations and provide contract negotiation support\nProvide direction and execute on brand guidelines for all creative and other executions related to our partnerships\nManage creative and messaging processes including briefing, creative development and review, agency oversight, print, radio and social assets and deadlines. Lead development of collateral and materials used in experiential/activation locations.\nAnalyze and review sponsorship proposals and manage any response or follow up\nCommunicate and partner with key internal stakeholders to provide strategic direction, understand local objectives and business needs.Minimum QualificationBachelor’s degree in Marketing and Communication or related discipline\nStrategic thinker with passion and energy to remain committed, accountable and get things done.\nA team player who strives to drive performance, develop talent who can achieve exceptional results.\nSolid understanding of project and contract management, and planning.\nStrong interpersonal skills and relationship management.\nThe ability to work on their own initiative, effectively both as an individual and part of a team.\nAbility to work under pressure.Minimum Experience2 – 5 years’ relevant experience in a similar role or related disciplineJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}