{"Job ID": "69873342", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! PURPOSE AND OBJECTIVESChange has always been part of business, but today’s environment forces us to deal with change – both good and bad – faster than ever before. New technologies are changing how we live and work, and COVID, climate change and geopolitical tensions expose how fragile our world is.\n\nOnly companies that can adapt quickly will thrive. You need to work more agile, more intelligently, more efficiently to point out new ways. And doing so takes more than just a technical migration to the cloud.\n\nRISE with SAP brings together everything you need to transform your business in the way that works best for you – regardless of your point of departure or how fast you want to move. And because we know that transformation is a journey, not a destination, RISE with SAP allows you to change not only once, but to continually transform – and we are with you during every step of the way.\n One of the key deployment options for our customers is a Private Cloud environment. SAP provides comprehensive cloud infrastructure and managed service offerings for the private cloud and therefore acting as an essential part of the overall Cloud Strategy of SAP.\n\nRISE with SAP, private edition enables you to safeguard your existing SAP ERP investment while benefiting from a new level of flexibility. Tailor the software to meet your specific needs, retain the company-specific configurations and customizations of your SAP ERP system, and access the latest capabilities that give your company a competitive advantage.\n SAP allows customers to run their SAP S/4 HANA, and HANA applications, including SAP® Business Suite powered by SAP HANA and SAP NetWeaver® Business Warehouse powered by SAP HANA, in a managed private cloud environment either in SAP’s own datacenters, IaaS Hyperscalers and in customers’ existing datacenters with our RISE with SAP, Private Cloud, Customer Datacenter option. SAP has established strategic partnerships with the major public cloud providers, including Amazon Web Services (AWS), Microsoft Azure, and Google Cloud Platform (GCP), to offer customers choice for their SAP private cloud deployment.\n Being part of SAP’s Customer Success organization, we are looking for highly motivated and customer-focused team members to strengthen the Cloud Architecture & Advisory team (CAA). The Cloud Architect acts as a primary point of contact for all technical topics from customer perspective and is working closely with all the other internal teams.EXPECTATIONS AND TASKS\nThis is a customer facing role where you will support the sales teams during the entire cycle of a Cloud deal. Following are the key tasks that this role will perform:\n1.    Present in detail technical and operational aspects of the RISE with SAP Private Cloud.\n2.    Present the requirements and value proposition for SAP private cloud on hyperscalers like Amazon Web Services (AWS), Microsoft Azure, and Google Cloud Platform (GCP).\n3.    Conduct technical assessment workshops with customers to define the future cloud architecture and plan the migration roadmap together with partners, System Integrators, and or SAP Professional Services.\n4.    Guide customers on non-functional capabilities such Business Continuity, Cybersecurity & Compliance, Networking, Technical Operations, and service consumption. \n5.    Work with other teams within the Customer success board area to generate pricing and provide ongoing deal support to sales teams.\n6.    Own the technical discussions with the customer and act as the orchestrator of experts to obtain expertise from the SAP delivery organization as required.\n \nEDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES\n•    Bachelor’s / Master’s degree in Engineering or Computer Science, Business Administration required from an accredited university.\n•    High proficiency in customer communications and presentations is required\n•    High proficiency in the SAP product portfolio, offerings, and industry solutions. \n•    Good understanding of SAP solutions (releases, platform interdependencies etc.)\n•    Good understanding of operational aspects (Application and Technical) of SAP solutions in a cloud environment.  \n•    Good understanding of capabilities of at least one Hyperscaler (AWS; MS Azure or GCP)\n•    Ability and willingness to be part of a global team of Cloud Architects\n•    Willingness to undertake customer related travel on short notice\n•    Fluency in English and ARABIC is a MUSTSaudi NationalWORK EXPERIENCE\n•    5+ years of customer facing SAP Consulting experience.\n•    5+ years of solution design, enterprise architecture and or SAP implementation. \n•    Experience in a customer facing pre-sales role is an advantage.\n•    Experience with IaaS Providers (AWS, MS Azure or GCP) and data centres is a big advantage.\n•    Cybersecurity & Compliance expertise.\n•    SAP Application Lifecycle Management and or SAP Operations.\n•    ITSM, Service Design & Delivery.  \n•    SAP HANA and S/4 HANA skills would be very helpful.\n \nThe position can only be filled as full time position.\n We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 368769  | Work Area: Sales Support  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}