{"Job ID": "69872891", "Description": "As an Agility Lead / Scrum Master, you will act as a servant leader and Agile transformational leader for Consumer Community Banking and Digital Tech Team by  facilitating clear communication to management and to the teams..  Our Scrum Masters are open, approachable, collaborative and enjoy working with passionate people. They are proactive in solving problems to help their team(s) succeed. The Scrum Master drives Agile and Lean frameworks that result in quality product delivery and continuous improvement. They embrace agility as a practice. The Scrum Master is responsible for removing impediments that hinder the team from reaching their goals and has a flexible approach that enables the team to rapidly respond to changes. Our culture of diversity, intellectual curiosity, and problem solving is essential to our success. We bring people together with a wide variety of backgrounds, experiences and perspectives. We support teamwork, thinking big and taking risks in a blame-free environment. We promote self-direction to work on relevant projects, while building an environment that provides support and mentorship needed to learn and grow. We are excited to see what you will bring to our team.Job responsibilitiesWork with the Product owner to align teams with the product vision, sprint goals, and other necessary information\nFacilitate groups of 30 or more, and coach multiple teams across the product\nCreate an environment of collaboration within the teams that allows for open dialogue and productive solutions for resolving conflicts\nChampion continuous improvement activities to reduce waste and increase productivity; coach organization to conduct continuous improvements events\nCommunicate organizational impediments to leadership; clear impediments for the team\nEmbrace the concept of continuous learning in your own journey and instill the same in the team(s) you coach\nCoach product owners in creation and maintenance of the product backlog including empirical planningRequired qualifications, capabilities, and skillsMinimum of 5 years’ experience in a Scrum Master role in an Agile development environment required\nBS/BA degree or equivalent experience\nExpertise with Agile and Scrum Frameworks and their application in a Product Development and delivery organization\nAbility to coach and mentor\nAbility to collaborate with and influence people at various levels\nSound understanding of Scaling framework such as LeSS and various other Agile frameworks such as Kanban, XP\nAble to leverage skills from coaching, facilitation, conflict resolution and more to serve the team(s)\nPossess an executive presence and ability to coach multiple teams across the productPreferred qualifications, capabilities, and skillsAbility to leverage capabilities across the firm to solve local problems\nPossess technical and business acumen to work effectively within a cross-functional Agile team. Business and/or Technology leadership and practical delivery experience required\nTechnical knowledge of preferred programming practices (BDD, TDD, ATDD, CI/CD, automation, etc.) in order to lead the team towards the right modern Agility solutions and improvements.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}