{
    "Job ID": "69873288",
    "Description": "IntroductionAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment.  The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and ResponsibilitiesYou will Design, develop and support SAP Composite Applications in SAP SUP (Sybase Unwired Platform), Sybase Afaria and Syclo’s Agentry Mobile Platform.\nAssist clients in selection and implementation of mobility products.Required Technical and Professional Expertise4-12 years of experience required.\nProven knowledge in Enterprise Mobility Architecture.\nDesign and Development of Mobile Apps, FIORI.\nExperience with designing application in any of the platforms as iOS(I-phone Operating System), Android, Blackberry, and Windows Mobile, incorporating mobile UI(User Interface)/UX(User Experience) concepts.\nExperience in developing reusable artifacts/frameworks, re-usable assets, Industry solutions, reference architecturePreferred Technical and Professional ExpertisePreferred to have knowledge on languages like Java, Objective-C, HTML5, CSS(Cascading Style Sheets), and JavaScript.\nUnderstands how SAP Mobility fits into comprehensive, innovative SAP solutions and strategies.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}