{"Job ID": "69873109", "Description": ", IndiaJob Family Group:Worker Type:Posting Start Date:Business unit:Experience Level:Job Description:Where you fit inThis role will provide an opportunity to work on the latest technology and innovations in Shell as part of the Assets SOM in Information & Digital Services and Operations (IDSO). The purpose is to deliver secure, reliable and affordable IT Operations and Enterprise Technologies required by the Businesses. You will join the Real Time Portfolio which delivers capabilities to Shell’s Upstream Production and Downstream Manufacturing, Projects and Technology, Integrated Gas and New energies Business providing real-time data, alarm Management, process control application, predictive analytics, and modelling & optimization technologies.What’s your roleResponsible for delivery of secure, reliable, and affordable IT service operations for all own operated services as well as all managed (internal & external) services meeting service levels.\nResponsible for fast response and execution of operational escalations with business impact.\nEvergreening and service quality improvement in strong partnership with other Shell IT functional / support.\nAct as a subject matter expert and technical lead towards support teams\nAssist with complex operational issues and ensure support is delivered against service levels and in line with support models.\nProvide guidance and consultation during problem management reviews to ensure complex problems are being worked appropriately.\nKeep the landscape Cyber Safe\nEnsure technical and service documentation is delivered and maintained.\nOwn the technical design and integrity of the full Landscape and provide technical assurance to projects ensuring delivery of cost effective, compliant, reliable, and sustainable solutions.\nFoster relationships with other IT teams in Shell that contribute to application integration and the end-to-end service delivery model of the relevant applications.\nGuide Managed Service Supplier(s)/ other vendors on Shell work processes, Shell organization and ways of working (provide corporate knowledge).\nWork with senior Business leaders, peers, and subordinates, in a virtual, geographically dispersed, and cross-cultural environment\nSelf-motivated with the ability to deliver results working independently or as part of a team\nSetting priorities and work multiple activities concurrently in rapidly changing environment.What we need from youBachelor's degree in engineering/technology with equivalent work experience.\nCandidates with 3-5 years of experience in technical support roles\nKnowledge of applications in the fields of Alarm Management and Process Control and Optimization. Dynamo, MDPro, ROMEO MBM, PACE and PWO for terminals (Required)\nDemonstrate knowledge of industry standard IT service management practices (e.g., ITIL) with understanding of Situation Management/Incident Management, Problem Management and Change management\nKnowledge of hosting and storage technologies (Preferred)\nStrong stakeholder management experience to work and communicate effectively across diverse stakeholders at all levels of the organization.COMPANY DESCRIPTIONShell is a global energy company where we work towards powering progress through more and cleaner energy solutions. We use advanced technologies and take an innovative approach to help build a sustainable energy future. In India Shell has its businesses footprint in Information Technology, Projects & Technology, Finance Operations, Integrated Gas, Downstream & Upstream spread across more than 7 main locations.An innovative place to workThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.Join us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.An inclusive place to workTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential.We’re creating a space, where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.We’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.We’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.We consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.A rewarding place to workCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.We’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible.-DISCLAIMER:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}