{
    "Job ID": "69873448",
    "Description": "Job Requisition ID: 154993 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every dayOverview of the roleManage the overall leadership and management of a planning team with multiple projects.What you will do▪ Resource and manage the planning team to suit the business needs\n▪ Good knowledge of marketing trading, staff availability and terms and conditions\n▪ Motivate and retain staff\n▪ Development of staff, including PDR’s, appraisals and training \n▪ Maintain close relationships, maintain a consistent approach and liaise with other Senior Planning Staff\n▪ Analysis of tender information and review tender programmes before submission \n▪ Review master /contract programmes before sign off\n▪ Liaise with Business Unit management on all planning matters.\n▪ Review and Audit all planning process within the business unit on a regular basis\n▪ Ensure robust Audit trail of as-built information is maintained throughout any project\n▪ Ensure that Project programmes meet the requirements of Time Control measures contained within the contract and are maintained \n▪ Review labour Resource and Plant \n▪ Review and evaluate construction methods and techniques\n▪ Review, recommend and evaluate prelims \n▪ Advise on logistics and methods of working\n▪ Identify complex construction and associated risk/opportunities\n▪ Assist in resolving the problems\n▪ Prepare presentation and attend interviews\n▪ Advise on preparation of entitlement submissions\n▪ Develop business plan to support AFC strategic direction and vision with planning horizons between 3-5 years\n▪ Responsible for operational delivery and growth\n▪ Set business or functional goals objectives \n▪ Has working parameters set by the Managing Director of AFC \n▪ Establishes and sustains key client and sector relationship to support the business plan \n▪ Determines priorities and makes decisions of business unit impact (companywide for professional functions)\n▪ Overall accountability for the direction of multiple, large, complex operations or functions \n▪ Contributes/delivers to business group strategy (typically as part of SMT for Business Group)▪ Accountable for financial performance and risk managementRequired Skills to be successful▪ Excellent understanding of infrastructure/construction, enterprise, innovation and business growth issue\n▪ Good knowledge of local legislation \n▪ Knowledge of key partners and stakeholders, their interest and priorities \n▪ Advance knowledge of economic strategy and programme development\n▪ Knowledge of personnel management, including supervision, training and performance evaluation \n▪ Knowledge of principles of budgeting and finance\n▪ Knowledge of principles and techniques of the planning profession and development process.\n▪ Chartered Membership of a Professional Body with Honours Level Qualifications\n\nWhat equips you for the role▪ Have a minimum of 15 years managerial and or technical experience \n▪ Significant track record of success in strategically leading a major contract, business unit o region and/or professional function\n▪ Experience of negotiation in multi-agency, multi stakeholder’s environment\n▪ Experience in dealing proactively and responsively with a board of directorsAl Futtaim ConstructionAFC is a locally registered and managed building and civil contractor, a wholly owned Al-Futtaim group company. We focus on providing an excellent service to our select list of key customers with whom we aim to build long-term, mutually beneficial relationships. With our roots going back over 41 years, our principal activities have grown to cover a broad range of building, civil engineering, and infrastructure works.The company’s successes have resulted in consistent turnover of over AED2 Billion with one of the largest local work forces in the industry, a testament to our core knowledge, competency and experience. We approach projects by working collaboratively with our customers and their design teams to deliver build-able, cost effective solutions using innovative techniques when required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}