{"Job ID": "69873221", "Description": "Job Number 23167669 Job Category Food and Beverage & Culinary Location W Dubai-Mina Seyahi, King Salman Bin Abdulaziz Al Saud Street, Dubai, United Arab Emirates, United Arab Emirates VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Serve food courses and alcoholic beverages to guests. Set tables according to type of event and service standards. Answer questions on menu selections. Communicate with the kitchen regarding menu questions, the length of wait, re-cook orders, and product availability. Communicate additional meal requirements, allergies, dietary needs, and special requests to the kitchen. Record transaction in MICROS system at time of order. Check in with guests to ensure satisfaction with each food course and/or beverages. Maintain cleanliness of work areas, china, glass, etc., throughout the day. Complete closing duties, including restocking items, turning off lights, etc. Present physical and accurate check to guest and process payment. Follow all company and safety and security policies and procedures; report accidents, injuries, and unsafe work conditions to manager; and complete safety training and certifications. Ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Welcome and acknowledge all guests according to company standards, anticipate and address guests’ service needs, assist individuals with disabilities, and thank guests with genuine appreciation. Speak with others using clear and professional language. Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards. Read and visually verify information in a variety of formats (e.g., small print). Stand, sit, or walk for an extended period of time or for an entire work shift. Move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance and objects weighing in excess of 50 pounds with assistance. Grasp, turn, and manipulate objects of varying size and weight, requiring fine motor skills and hand-eye coordination. Move over sloping, uneven, or slippery surfaces as well as up and down stairs and/or service ramps. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. W Hotels’ mission is to Ignite Curiosity, Expand Worlds. We are a place to experience life. We’re here to open doors and open minds. We are constantly inspired by new faces and new experiences. A tuned-in, up-for-anything spirit is at our core and has made us renowned for reinventing the norms of luxury around the globe. Whatever/Whenever is our culture and service philosophy that brings our guests’ passions to life. If you are original, innovative, and always looking towards the future of what’s possible, welcome to W Hotels. In joining W Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}