{
    "Job ID": "69870014",
    "Description": "Bosch Global Software Technologies Limited (BGSW), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.Our specific team from BGSW works with Bosch Sensortec GmbHBosch Sensortec GmbH develops and markets key technologies in consumer electronics – micro-electro-mechanical sensors (MEMS), solutions and systems for smartphone applications, tablets, video game consoles, wearables, and the Internet of things. The sensors enable devices to recognize their surroundings and to transmit the data collected. MEMS are therefore part of the foundation for a networked world. Bosch Sensortec GmbH is a wholly owned subsidiary of Robert Bosch GmbH.Is Embedded Testing your passion ? Are you bored to repeat manual tests?We are looking for passionate Embedded Test Automation Engineer for the fascinating fast growing IoT/wearable/Hearable industry to work on innovative sensor solutions in an agile team and develop/execute/automate all aspects of verification and validation at the system level of software solutions, including test automation (CI/CD) and system tests.Personality: Team player with cross cultural competence, communicative, reliable, assertive, enthusiasm for new topics\nExperience & Know-How:\n 4 to 7 years of experience in testing and automating Software/Embedded solutions\nStrong programming experience in Python and C\nHaving ISTQB foundation certification is a plus.\nLanguages: We are cooperating with different worldwide locations. Therefore, we expect excellent English skills.\nEducation: Bachelor or Master degree in Computer Science, Electrical Engineering or a related technical fieldStrong scripting experience, preferably Python\nResponsible for test specification, execution, automation and documentation\nResponsible for test case quality and test coverage according to V&V strategy\nA good understanding of embedded system and MEMS sensors\ngood to have C programming skills\nMust be possessing knowledge in Testing concepts & Test processes and practices, Tools and techniques\nGood understanding in experience with static code analysis tools, unit testing frameworks.\nGood understanding of power measurement and management of embedded systems\nGood hold on reading schematics and data sheets for components\nAbility to adapt to fast changing requirements and provide solutions.\nBeing an effective team player and willing to accept challenges and responsibilities.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Coimbatore, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}