{
    "Job ID": "69872831",
    "Description": "51,000 people. 49 countries. Over 120 office locations.We’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?Whatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.comJob Description Worked as a Project Controls with 7-8 years of experience on multi-discipline complex projects in a reputed consulting / EPC company\nDomain Expert / Specialist in the field of Engineering or in Construction - handling EPC / LSTK / PMC / EPCM project. Having overall knowledge of interdependencies between project phases.\nGood understanding of Workflow Process, Execution sequences, inter-relations of Activities, activity durations, WBS. Good understanding of Cost Breakdown Structure (CBS), Cost Codes, Cash Flow is added advantageRequirements Technical skillsHands on experience & sound knowledge of using Planning/Scheduling Tools like Primavera , MS Project (is MUST), Microsoft Office applications & Techniques, Power BI.\nGood understanding of Progress Measurement Norms, progress measurement trend Curves (S-Curve) & forecasting by earned value method (EVM), Resource Planning, Productivity.\nWorking experience in Onshore / Offshore/ EPC, Oil & Gas Industry.\nPreferred working knowledge in ECOsys, P6 (Primavera)  or any other inhouse progress measurement tools.Soft skillsGood Communication & Presentation skills\nHigh on initiative & Drive\nAnalytical skills\nSelf-disciplined & committed\nTeam Player\nTime Management\nUrge to learnWhat we offer youProviding an agile culture and challenging work opportunities results in a positive work environment.  Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment.  We value equal employment opportunity and are committed to promoting fairness, equality and diversity.Our policy is to conduct background checks for all candidates who accept an offer of employment with us.If you have the passion and talent to keep up, it's time to test the limits of what you can become.  Find your future with Worley.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}