{
    "Job ID": "69873803",
    "Description": "S&P Global CorporateThe Role: Software Developer IIThe Team: Our team is responsible for the design, architecture, and development of our client-facing financial analytics product for the organization as a whole.The Impact: Successful candidates will combine an understanding of the SFDC lightning and handling huge data with experience.  Building and working with complicated technical systems. In addition, candidates should have experience building and working with a global team, be highly self-motivated with the ability to execute independently.What’s in it for you: The position plays a key role on the S&P Global Platform SFDC Development team and for the organization. The senior software engineer role offers exposure to all S&P Global divisions and clients, and opens doors for tremendous career opportunities with S&P Global.  In the role, you will directly contribute to building core platform capabilities and services.Responsibilities:Specializing in Sales and Service cloud projects.\n\nLead and participate in defining sales process Improvements.\n\nProvide recommendations for new product feature and pilot software modules to enhance the current implementation.\n\nDeveloping Apex classes, test classes, triggers, batch classes, and scheduler classes.\n\nCreating/Developing customized visual force pages.\n\nCreate/Enhance LWC with Aura framework.What We’re Looking For:Should have good experience in classic salesforce development, in both configurations and customizations such as Reports, Dashboards, Report Types,  Approval process, Custom Objects, Custom Tabs, Workflows, Assignment Rules, Profile management, email templates, process builder, roles, sales process, permission sets, manual sharing & apex sharing, validation rules, page layouts, field-level security and Apex Classes, Apex Triggers, Visual Force Pages, Integration(both REST & SOAP), batch classes, schedulers.\n\nShould have a good understanding of both Agile (SCRUM) and Waterfall delivery principles and the importance of SDLC (Software Development Process) and coding methodology principles\n\nHaving knowledge of Lightning components, application, events, and component-to-component communication.\n\nShould have good knowledge in LWC design and development.\n\nShould have good knowledge on Angular JS, jQuery, JavaScript, CSS, XML, HTML and DHTML.\n\nExperience with Debugging methods such as Anonymous Code Block execution and working/writing to System and Developer Logs\n\nNeed hands-on experience in deployment methods like Changesets, Force.com IDE, Ant Migration Tool (using package.xml and build.xml).\n\nAbility to adjust well to the new atmosphere and have a great sense of responsibility in the execution of any work assigned.\n\nShould have PD1 Certification.(Optional)\n\nThe candidate should help in the development of new products and services and support existing products and services\n\nOur team is responsible for the design, architecture, and development of our client-facing financial analytics product.Return to Work: Have you taken time out for caring responsibilities and are now looking to return to work? As part of our Return to Work initiative (link to career site page when available), we are encouraging enthusiastic and talented returners to apply, and will actively support your return to the workplace.Grade/Level: 9The Location: Hyderabad, Gurgaon, NoidaAbout Company Statement: S&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}