{"Job ID": "69875973", "Description": "Who we are:&nbsp;Motive builds technology to improve the safety, productivity, and profitability of businesses that power the physical economy. Motive combines IoT hardware with AI-powered applications to connect and automate physical operations. Motive is one of the fastest-growing software companies in the world, serving more than 120,000 businesses, across a wide range of industries including trucking and logistics, construction, oil and gas, food and beverage, field service, agriculture, passenger transit, and delivery.Motive is built on four foundational attributes; Own It, Less but Better, Build Trust, and Unlock Potential. This has taken our company to great heights, including being recognized by Fortune for Best Workplaces, Forbes Best Startup Employers, and Comparably for our Best Global Culture, Sales Team, Leadership Team, Career Growth, and CEO for Diversity. We’re proud to receive an employee net promoter score of 63 (according to Comparably) which places Motive in the top 5% of companies with 4,000 employees or more.&nbsp;Today, our team is made up of more than 3,000 employees, located across the world, providing support to a wide range of customers. While most of our employees are remote, many have the opportunity to work on-site at any of our 8 global office locations. Visit our careers website to learn more about opportunities at Motive.&nbsp;About the Role:As a Machine Learning Engineer, you will be a part of a team which develops and deploys cutting edge AI solutions for our product line. This role will give you an opportunity to work on developing models using advanced algorithms and machine learning techniques to solve some of the most pressing problems for fleet safety and best in class Dashcams. As a part of the R&amp;D team, you will also be responsible for deploying these models while working across cross functional teams.What You'll Do:Develop solutions to complex problems using AI, algorithms and machine learning techniques\nDevelop machine learning models using classical and deep learning techniques\nCollaborate with a cross functional team to design and document scalable solutions&nbsp;\nWrite secure, maintainable code that powers the platform that connects the world’s trucks\nLaunch and support features that will be used by trucking industry and its partners\nLead code reviews and help to guide software architecture decisions.What We're Looking For:2-6+ years of experience in machine learning/artificial intelligence&nbsp;\nA degree in computer science, software engineering, or a related field\nExceptional problem solving and analytical skills\nStrong programming skills in Python\nSolid understanding of machine learning models and techniques\nExperience with deep learning models\nAn affinity for creating software that is extensible, performant, and easy to read\nExperience with time series problems (good to have)Creating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives.&nbsp;Please review our Candidate Privacy Notice&nbsp;here.The applicant must be authorized to receive and access those commodities and technologies controlled under U.S. Export Administration Regulations. It is Motive's policy to require that employees be authorized to receive access to Motive products and technology.&nbsp;#LI-RemoteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}