{
    "Job ID": "69873053",
    "Description": "Why Patients Need YouA career with us is about discovering breakthroughs that change patients’ lives. Whatever your role, you will be part of bringing those therapies to people all over the world. You will be driving the industry forward and making a positive difference. And you will discover that amazing things are possible.What You Will AchieveAs part of the business support team, you will represent your organizational unit on administrative matters recommending, interpreting,and implementing company's internal administrative policies and procedures. Your will perform a combination of administrative tasks in various functional areas to maximize the efficiencies of businesses supported. You will also be responsible for supporting services, such as event planning, customer service, publications,and technical writing/editing. You will participate in activities related to improving processes of your team and collaborate with others by sharing your experiences. Your knowledge and skills will help in making decisions that make the best of limited options. You will be proactive in leveraging your team’ knowledge to learn and develop your own work products.It is your hard work andcommitmentthat will make Pfizer ready to achieve new milestones and help patients across the globe.How You Will Achieve ItManage own time and professional development, be accountable for own results and prioritize workflows.\n\nEnsure that the different digital campaigns are executed in a timely manner and as per content plan previously prepared in conjunction with the Marketing and Medical teams.\n\nSupport special projectsanddevelopment of pilots for new digital promotion models.\n\nProvide support to marketing teams during the execution of campaigns,monitoring and optimization of digital campaigns andmanagement of reports.\n\nManage web platforms and / or other digital channels to optimize campaignsandcontent, focused on user experience.\n\nUpdate the platforms for health professionals, according to policies and Regulatory submissions.\n\nMaintain local documentation as required by legislation (includingarchiving/tracking/retrieval).\n\nManage digital platforms  in coordination with regional or local support.\n\nSupport and collaborate with theAreaManager to develop digital editorial calendars and approvals andtheirexecution in the different channels.\n\nSupport analytical insights  to support functional decisions, trigger actions and follow up performance through Key Performance Indicators (KPIs).\n\nEnsure accountability for the highest levels of compliance to norms, policies and procedures.QualificationsMust-HaveHigh School Diploma or GED and 2+ years of experience.\n\nExperience in Marketing, digital marketing, commercial. \n\nHigh attention to detail.\n\nGood interpersonal skills.Nice-to-HaveBachelor's Degree.\n\nAbility to solve routine problems and toconveyissues constructively.\n\nAbility to make basic decisions with an understanding of the consequences.\n\nUnderstanding of both pharma industry and scientific academic research environments.\n\nKnowledge of commercial processes or business analytics processes.Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}