{"Job ID": "69870036", "Description": "Air Traffic Service:Provide Aerodrome Control to all IFR and VFR traffic in the immediate vicinity of the airport and to aircraft to aircraft operating on the maneuvering area in accordance with the procedures detailed in ATSP Part-2.\nExercise control over all vehicles operating on the maneuvering area to prevent runway incursion.\nIssues clearances, instructions, messages, and other information to aircraft under his control.\nIssuing information such as runway to use, wind velocity and direction, visibility, taxiing instructions, and pertinent data on other aircraft operating in vicinity.\nInspect, adjust, and control radio equipment and airport lights.\nAlerting airport emergency operators and other designated personnel when aircraft is having flight difficulties\nTransfer control of departing flights to traffic control centers and accept control of arriving flights.Co-ordination Activities:Perform, as required, the appropriate coordination duties with the other relevant ATC Units\nAdvise the Shift Supervisor of the work trends & issues •Post and update Flight Data Strips (paper or electronic strips)•Coordinating with and issuing instructions to airport vehicles and personnel.\nTransferring control of aircraft to receiving facilities when aircraft leave their airspace, and receiving control of aircraft coming into their airspace\nInform other Units and relevant agencies if low visibility operations become imminent.\nImmediately inform Fire and Rescue Services of any aircraft experiencing trouble of a nature that could require assistance upon landing or immediately after departure.\nCoordinate with Departure Control (Approach) for initial clearance for all departures and any required spacing between inbound due to congestion.Communication:Communicate effectively with air traffic\nInform adjacent Sectors, or Facilities of changes in navigational aid status, unusual weather, or of traffic situations,\nEnsure that the ATIS broadcast is updated and contains the correct information.Policies, Processes and Procedures:Operate all electronic ATC equipment installed in the Tower. This includes approach lights, runway lights, taxiway lights, stop bars and airfield beacon.\nMonitor for any un-serviceability of obstruction lights and ensure that NAVAID monitors and Meteorological instruments are functioning correctly.\nExercise their best judgment and initiative in handling unusual situations not specifically covered in any official publication.\nMaintain proficiency on all positions for which he is qualified.\nSign ‘On’ and ‘Off’ in the position Log.skills:Operational Excellence\nSafety Awareness\nTeamwork\nCommunication\nSafety Management\nAir Traffic Flow & Capacity Management\nManagement of Non-Routine Situations\nSearch & Rescue\nSeparation & Conflict Resolution\nSituational AwarenessJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}