{
    "Job ID": "69875730",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:Manage the identity management service which can encompass Active Direcoty, AZURE AD, DNS, and configuration and security adherence for these services.Key Accountabilities:Generic AccountabilitySenior Engineer of service responsible for keeping service healthy and for delivering enhancement on it.\nWork with team to address and remmidiate any GSO or Audit findings related to service and ensure their resolution.\nWork across multiple Service Delivery Teams\nBAU related work for related services\nProject execution tasks for related servicesJob Context:Specific AccountabilityExperience in managing the Active Directory infrastructure to ensure stable operation, this includes Designing, implementing, maintaining, supporting, and optimizing key functional     areas in and around the Active Directory, Azure AD as well Internal and external DNS.\nExperience in ADFS federation and configuration.\nGood Knowledge of Microsoft M365 and its offerings\nGood Knowledge of Exchange and Exchange Online\nExtensive experience in Group Policy Management, and it using to configure workstations as well as servers.\nExperience in Azure AD Role management and Azure RBAC.\nExperience in configuration of Multifactor Authentication methods using Azure AD as well as other technologies.\nAdvanced Knowledge on implementation and administration of DNS both internally and externally\nAdvance Knowledge In Windows environment both on workstations and servers.\nExperience in Deploying Mobile Device and Application Management solutions using Citrix XenMobile, configuring polices to manage devices and applications, wrapping of IOS/Android apps , publishing MDX and public applications in secure hub   as per requirements.\nExperience of maintaining compliance and governance, in line with organizational policies\nIncident & Change management in line with ITIL processes\nRelated Microsoft/Azure certifications\nGood people skills and ability to manage a team.Overall, 5-10 years of experience in Identity Management.\nExperience in handling technical projects and experience of Active Directory, AZURE AD Group policy\nExperience MS Active Directory , AZURE AD\nExperience DNS, DHCP\nExperience in Vulnerability Management\nExperience in Azure AD ,ADFS, MFA, AZURE Conditional Access Policies\nExperience in EDR solution (Microsoft Defender 365)\nDevice OS compliance monitoring and reporting\nScripting knowledge in PowerShell\nCertifications – Microsoft AZURE certifications, ITILJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}