{
    "Job ID": "69875755",
    "Description": "Who are Inchcape? At Inchcape, our vision is to have a connected world, in which our customers trade successfully and make better decisions in every port, everywhere. We use technology and our global network to help our partners connect to a smoother, smarter ocean.  Inchcape combines its worldwide infrastructure with local expertise through our global network of over 250 proprietary offices, across 70 countries and a team of more than 3,000 committed professionals. Our diverse global customer base includes owners and charterers in the oil, cruise, container, and bulk commodity sectors as well as naval, government, and intergovernmental organizations.  We have an ambitious growth model and a career here is certainly going to be a rewarding one that will allow you to bring your skills & experience. We embrace change and are open to new thinking and pushing for positive change in our industry.  \n We have an exciting opportunity for an Assistant Finance Manager in our GL team in Chennai. You will be responsible for the General Ledger accounting of the entity specified  What you’ll do:  Ensure timely reconciliation of cash & bank accounts \nUpdate accurate exchange rates for foreign currencies in books of accounts on a daily basis \nPerform revaluation of foreign currency balances in book accounts on a monthly basis \nVerification and processing of intercompany invoices in a timely manner Perform intercompany reconciliations on a monthly basis, ensuring NIL variance \nAssist FM / Finance controller in engagement & closure of internal and external audits \nProvide Balance sheet schedules, and other supporting workings/documents as per audit requirement \nTeam leading and induction of new Joiners in the team \nHiring of resources  Who you are:  Degree in Accounting, Commerce, or Business. M.Com or MBA preferred \nGood communication skills: Verbal and Written. \nHonest, transparent, and trustworthy \nProactive, dynamic, and innovative \nProblem-solving skills; an eye for detail Team Management \n8-12 years of experience in accounting. \nExperience in working in a multi-national, multi-cultural organization is a must. \nExperience in shipping /logistics industries. Is preferred Why Inchcape Shipping Services? We believe in building a diverse and high-performing workforce, that works together to provide our customers with the exceptional service they deserve. To reach the highest standards we depend on our people, their welfare, training, and expertise. We realize the value of our staff and know that your unique experiences, skills, and passions will help you to build a rich and rewarding career in our dynamic industry. Our values are at the centre of everything we do and the successful candidate will be expected to demonstrate and fully adopt these: Global Perspective - we connect the world and see the bigger picture. The Power of People - we rely on the strength of local agent knowledge and relationships. Progress - we adopt new thinking and push for positive change in our industry. In return, we will offer you: A diverse range of benefits, depending on your geographical location. Globally as a minimum you will receive:  A retirement savings plan  \nLife assurance  Holiday starting at 26 days  \nHealthcare  \nCompetitive salary  \nEmployee Assistance Programme  \nCareer development and progression opportunities Values Award celebration events \nTeam building days Plus, much more! If you think that you have the right skills, knowledge, and attitude to join our team, then we invite you to apply by simply clicking at the top of this advert!  #ISSthebiggerpicture  Appointment to this role will be subject to satisfactory references and possession of a valid Right to Work documentation depending upon your geographical location. Inchcape is an Equal Employment Opportunity Employer and equality, diversity, and inclusion are at the center of everything we do. We recognize that our customers, colleagues, contractors, and other partners are central to our success and that we work in a diverse society. We acknowledge not only our legal but also our moral responsibility to ensure all groups have equality of opportunity. #LI-DNIJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}