{
    "Job ID": "69874381",
    "Description": "Perform bookkeeping and prepare balance sheets, profit and loss statements and other financial reports. Require a bachelor's degree in area of specialty (B. Com/M. Com). Familiar with standard concepts, practices and procedures within accounting practice. Coordinate with experience team member to plan and accomplish goals. Perform a variety of tasks. Work under minimum supervision. A certain degree of creativity and latitude is required to optimize given tasks.Responsibilities:Prepare asset, liability and capital account entries by compiling and analyzing account information\nDocument financial transactions by entering account information\nSummarize current financial status by collecting information; preparing balance sheet, profit and loss statement and other reports Substantiate financial transactions by reviewing documents\nReconcile financial discrepancies by collecting and analyzing account information\nPost and reconcile transactions (Bank, control accounts, etc.)\nMeet tight deadlines of clients to prepare financial statements and relevant reports\nCommunicate effectively and confidently with peers\nContribute to a strong client relationship through positive interactions with client personnelRequirements:Thorough knowledge of basic accounting procedures and principles\nKnowledge of preparation and key elements of financial statements\nKnowledge of accounting software\nUnderstanding and knowledge of UAE VAT \nAccuracy and attention to detail\nAptitude for numbers and quantitative skills\nBachelor’s Degree (B. Com) or master’s degree (M. Com). work experience will be preferred.\nMust hold dependent visa - sponsored by parent/spouse Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}