{"Job ID": "69873371", "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.\nAbout the team The team are part of Capital Markets, helping our businesses to brings product to market more efficiently with UX, Data and Delivery acceleration through guidance, special interest groups and shared source. As FinTech software evolves and customer expectations grow based on clients experience of modern consumer software an intuitive and modern user interface (UI) is a must for any digital product such as a mobile app, website, SaaS, B2B or enterprise line of business software. This is a Central Team to enable product teams to go to market faster at a lower cost, producing user centered high quality software more effectively by providing the guidance and support to allow them to implementing best practices. Where products teams face larger migration, performance and modernization challenges or needs to build out new greenfield product we also help them. Where product teams already have the experience and resources to achieve their goals but are looking to accelerate product delivery and get to market faster we also help to lower time-to-market of UI development through re-use of common components and shared services.What you will be doing Joining the Capital Markets UI team to work at a high level helping accelerate the delivery of cutting-edge Enterprise scale Angular products. You will have the opportunity to: • Be responsible for the delivery of usable, high quality and visually compelling UI’s • Analyze, design, program, debug and modify software enhancements and/or new products • Interact with product managers and/or users to define system requirements and/or necessary modifications • Participate in software design meetings and analyze user needs to determine technical requirements • Write technical specifications based on conceptual design and stated business requirements • Write code, complete programming and perform testing and debugging of applications using current programming languages and technologies • Complete documentation and procedures for installation and maintenance • Train and communicate with internal Client Training, Client Relationship and Sales teams on systems application • May deliver informational and decision-seeking presentations to technical and business groups to internal and/or external audiences\n• Other related duties assigned as needed • Develop re-usable components and patterns to accelerate cross-product development. • Write well tested and documented Angular using Typescript, HTML and CSS • Quality reviews\n• Contribute to the CoE charter including collaboration, workshops and publishing We are seeking are seeking motivated, forward-thinking developers, passionate about what they do, who can do amazing work. In return we will help all of our team members to grow and develop their own skillsets working on challenging projects.What you bring We need organized, highly technically skilled, motivated self-starters, with deep experience of the modern UI stack and a track record of delivery. Core skills are:\n• 5+ years of enterprise software development experience\n• 2+ years of Angular 2+ experience\n• Core JavaScript / Typescript.\n• Material Design\n• Component / OO / Functional Reactive experience.\n• Good understanding of SOLID, SoC and DRY.\n• Thorough knowledge of web mark-up, HTML, and CSS.\n• RESTful API integration.\n• Unit Testing.\n• Adjacent technologies e.g., Node, Webpack, Nrwl Nx.Added bonus if you have\n• Knowledge of FIS’ products and services and the financial services industry\n• Angular Schematics, Angular Elements and Angular Universal\n• Good eye for detail • Excellent communication skills\n• Front end optimization and performance techniques.\nWhat we offer you\n• An exciting opportunity be a part of World’s Leading FinTech Product MNC\n• To be a part of vibrant team and chart a career on new age technologies building solutions for financial services industry\n• Competitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents\n• A multifaceted job with a high degree of responsibility and a broad spectrum of opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}