{
    "Job ID": "69874195",
    "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.We at Publicis Sapient are looking for Senior Associate Level 2 (Core Java + Microservices) to join our team of bright thinkers and doers. You will drive and translate our client's business problems into innovative technology solutions by creating and owning the technical vision of the project and ensuring that the vision is achieved with a high level of quality. You are a high-performance engineer expected to work in a product squad and deliver solutions for medium to large-scale clients.Your Impact:Responsible for programming as well as the design of the project and working with the design team and clients to create the needed artifacts.\nUnderstands client business domain and has been part of projects with Digital Business Transformation (DBT) opportunity\nCombine your technical expertise and problem-solving passion to work closely with clients, turning complex ideas into end-to-end solutions that transform our client’s businesses.\nConstantly innovate and evaluate emerging technologies and methods to provide scalable and elegant solutions that help clients achieve their business goals.\nResponsible for choosing the needed technology stack based on the functional, and non-functional requirements and based on other factors like client drivers, environment, and feasibilityYour Skills & Experience:Experience range: 7 – 9 years\nExperience in developing micro services in Spring Boot. Experience in security, transaction, Idempotency, log tracing, distributed caching, monitoring and containerization requirements of Micro services. Experience in developing High Cohesion & Loosely Coupled Micro Services.\nHands on experience on Microservices Architecture.\nShould have excellent acumen in Data Structures, algorithms, problem-solving and Logical/Analytical skills. Thorough understanding of OOPS concepts, Design principles and implementation of different type of Design patterns.\nSound understanding of concepts like Exceptional handling, Serialization/Deserialization and Immutability concepts, etc. Good fundamental knowledge in Enums, Collections, Annotations, Generics, Autoboxing, etc.\nExperience with Multithreading, Concurrent Package and Concurrent APIs\nBasic understanding of Java Memory Management (JMM) including garbage collections concepts.\nExperience in RDBMS or NO SQL databases and writing SQL queries (Joins, group by, aggregate functions, etc.)\nHands-on experience with Massage Broker like Kafka or other. Hands-on experience in creating RESTful webservices and consuming webservices. Hands-on experience with spring Cloud/Spring Boot.\nHands-on experience with any of the logging frameworks (SLF4J/LogBack/Log4j)\nExperience of writing Junit test cases using Mockito / Powermock frameworks. Should have practical experience with Maven/Gradle and knowledge of version control systems like Git/SVN etc.\nHands on experience on Cloud deployment/development.Set Yourself Apart With:Any Cloud Certification\nDistributed computing,\nBuilding scalable systems,\nUX areas like ReactJS, NodeJS, Webflux etc.Education:Bachelor’s/Master’s Degree in Computer Engineering, Computer Science, or a related fieldGender-Neutral Policy\n18 paid holidays throughout the year.\nGenerous parental leave and new parent transition program\nFlexible work arrangements\nEmployee Assistance Programs to help you in wellness and well beingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}