{"Job ID": "69873552", "Description": "Job Description\nLocation - Onsite - Genome Valley, Hyderabad.\nJob Purpose:\nAs part of this group, you design, plan and/or perform scientific/technical studies. By bridging the analytical science to the clinical performance, you will drive the transformation of our molecules into medicines that improve and extend patient’s lives.\nThe position is based in the Genome Valley, Hyderabad, within the Technical Research and Development Organization (TRD) of Global Drug Development (GDD).\nMajor Accountabilities:\n• Design, plan and perform scientific experiments for projects at different clinical phases for drug substance and drug product with minimal guidance. Well versed with regulatory guidelines, scientific literature, technology transfer and interpretation of the results to draw conclusions in reports.\n• Adhere to Quality metrics, Compliance and Good Documentation Practices following ALCOA+ principles, GLP, OQM, HSE, ISEC and Novartis guidelines.\n• Should be a Team player by adding value in collaborating with other teams to support project deliverables within agreed timelines, mentoring new joiners, active participation in project meetings / networks / meetings and contributing to Team goals while meeting individual objectives.\n• Responsible for Qualification of instruments / equipment’s (URS to Report) and periodic calibrations as per applicable site procedures.\n• Ability to perform investigations, guide team members, communicate proactively and clearly to global stakeholders and handle multiple priorities.\nDiversity & Inclusion / EEO\nWe are committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\nM.Pharm./M.Sc Good knowledge of English (oral and written).\n• Desirable knowledge of site language. Up to 10 years (for M.Pharm./M.Sc.) & minimum of 4 years (for Ph.D.) of relevant experience in trace level quantification of GTIs/ Nitrosamines in DS and DP.\n• Prior experience of working with Nitrosamine, including NDSRIs is mandatory. Must have expertise on qualitative and quantitative analysis using GCMS, LCMS, HRMS techniques.\n• Should also have good understanding of regulations/guidelines around nitrosamines to independently design study protocols and plan experiments.\n• Good presentation skills and scientific/technical writing skills.\n• Good communication skills\nWhy Novartis?\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\nImagine what you could do here at Novartis!\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/networkJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}