{
    "Job ID": "69874500",
    "Description": "See yourself at TwilioJoin the team as our next&nbsp;Escalation ManagerWho we are &amp; why we’re hiringTwilio powers real-time business communications and data solutions that help companies and developers worldwide build better applications and customer experiences.Although we're headquartered in San Francisco, we have presence throughout South America, Europe, Asia and Australia. We're on a journey to becoming a globally anti-racist, anti-oppressive, anti-bias company that actively opposes racism and all forms of oppression and bias. At Twilio, we support diversity, equity &amp; inclusion wherever we do business. We employ thousands of Twilions worldwide, and we're looking for more builders, creators, and visionaries to help fuel our growth momentum.About the jobThis position is needed to support the escalations team, which is a newly formed team within Twilio's Support organization. This team ensures our customers get the most critical help they need from us at a meaningful time. The ideal Escalation Expert is an inventive and hardworking technical specialist with a positive outlook and strong desire to help customers succeed. This candidate must be equally adept at collaborating closely with internal teams to tackle complex technical issues for customers, along with handling technical, executive-level customer communicationsResponsibilitiesA day in the life of an Escalation Manager involves driving the most visible and impactful issues to resolution to ensure the success of our customers on Twilio platform. When a critical escalation is handled appropriately, it instills trust and strengthens our relationship with our customers.You'll handle top escalations and major outage events; working cross functionally and engage key partners to drive effective communication and create a resolution.\nYou'll participate in Support Escalation On-call rotation, responding and triaging critical escalations and partnering Support Managers to identify the “tiger team” and unblock customers.\nYou'll participate in regular incident review meetings, track and improve key metrics for incident quality and effectiveness, and identify areas for process improvements.\nYou'll partner with TAM and AE on post-mortem discussions with customers and act as their advocate to champion feedback and betterments to Product and Engineering.\nYou'll develop and maintain unified escalation processes to reduce resolution time on business critical issues.\nYou'll provide technical and soft-skills mentoring to Support Engineers.Qualifications&nbsp;Not all applicants will have skills that match a job description exactly. Twilio values diverse experiences in other industries, and we encourage everyone who meets the required qualifications to apply. While having “desired” qualifications make for a strong candidate, we encourage applicants with alternative experiences to also apply. If your career is just starting or hasn't followed a traditional path, don't let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!Required:You excel at being the point person who can elevate our response to complicated and time-sensitive customer concerns and incidents.&nbsp;\n3+ years’ in enterprise technical support, professional services or similar customer facing roles. At least 2 years in a senior technical role.\nStrong can-do mentality with a willingness to embrace the critical and time-sensitive nature of issues and incidents.\nWork optimally with Front Line Support Engineers as well as participate in other cross-team engagements to expedite resolutions to hot issues.\nStrong business insight and executive presence; you have the ability to lead executive-level communications on critical or sensitive issues.\nExcellent customer service skills; possessing a high degree of logic, tact and persistence under pressure while maintaining a positive demeanor.\nAbility to work independently with minimal direct supervision and within a team.\nHighly motivated by challenges and passionate about conducting post mortems to identify process gaps and propose betterments.\nWilling to participate in an on-call rotationDesired:Experience supporting and building on Twilio products.\nPrevious experience as an Escalation Engineer or Technical Account Manager\nPrior telecom (Carrier, SIP, PBX) or messaging platform experience.Location&nbsp;This role will be based remotely in BangaloreThis role will be asked to cover EMEA Timezone hours.What We OfferThere are many benefits to working at Twilio, including, in addition to competitive pay, things like generous time-off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.Twilio thinks big. Do you?We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That's why we seek out colleagues who embody our values — something we call Twilio Magic. Additionally, we empower employees to build positive change in their communities by supporting their volunteering and donation efforts.So, if you're ready to unleash your full potential, do your best work, and be the best version of yourself, apply now!If this role isn't what you're looking for, please consider other open positions.Twilio is proud to be an equal opportunity employer.&nbsp;Twilio is proud to be an Equal Employment Opportunity&nbsp;and Affirmative Action&nbsp;employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Additionally, Twilio participates in the E-Verify program in certain locations, as required by law.Twilio is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability,&nbsp;please&nbsp;contact us at&nbsp;accommodation@twilio.com.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}