{
    "Job ID": "69875908",
    "Description": "Eligibility criteria:Qualification: Commerce Graduate/Postgraduate, MBA/PGDM/M.Com\nExperience: 3-6 years in US Individual Taxation in a recognized firm or a Big4.\nExcellent communication skills.\nSound technical knowledge with respect to country of tax specialisation.\nShould have experience reviewing US Tax Returns for least 12-18 months.\nShould have prior experience interacting with Foreign offices and assignees.\nNeeds to have strong technical knowledge to respond to assignees.\nStrong technical knowledge & analytical thinking ability.\nCommitted, hard-working, ability to work long hours, proactive.\nWork Location: Bangalore / Kolkata/RemoteLine of Service: Tax - US GMS - India VVN Industry/Sector: Not Applicable Specialism: Global Mobility Services (International taxation) Management Level: Senior Associate (US GMS) Job Description & Summary: A career in our Global Mobility Services practice, within People and Organisation Consulting services, will provide you with the opportunity to help our clients reset their talent strategies and deliver extraordinary business results through their people. We focus on evaluating and managing their unique challenges so our clients can maximise their return on the overall investment in human capital. You’ll gain a tremendous depth of expertise in all aspects of human capital, including creating sustainable value through people culture and change, designing compensation and retirement strategies, and improving human capital operations. As a Senior Associate, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. The skills and responsibilities for this management level include but are not limited to: • Use feedback and reflection to develop self awareness, personal strengths and address development areas. • Delegate to others to provide stretch opportunities, coaching them to deliver results. • Demonstrate critical thinking and the ability to bring order to unstructured problems. • Use a broad range of tools and techniques to extract insights from current industry or sector trends. • Review your work and that of others for quality, accuracy and relevance. • Know how and when to use tools available for a given situation and can explain the reasons for this choice. • Seek and embrace opportunities which give exposure to different situations, environments and perspectives. • Use straightforward communication, in a structured way, when influencing and connecting with others. • Able to read situations and modify behavior to build quality relationships. • Uphold the firm's code of ethics and business conduct.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}