{"Job ID": "69873060", "Description": "Job Description:Job Title: Quantitative StrategistCorporate Title: VPLocation: Mumbai, IndiaRole DescriptionDeutsche CIB Centre Pvt Ltd is Deutsche bank’s global platform for front-office & aligned functions to create value by utilizing non-traditional locations, exceptional talent, and a collaborative culture.This branch of Deutsche Bank Group company is looking for extremely bright candidates for the role of Desk Strategic Analytics (Strats). The candidate is required to work in collaboration with FIC Asia Pacificteam on various quantitative and regulatory driven projects. Candidate is required to understand the business problem, gather information required for the implementation and provide an end-to-end optimized solution on a scalable platform. Implementation of the project needs to be done in Python and C++ programming language. Candidate should possess a very good English communication skill to coordinate and communicate his work effectively with various stakeholders spread across globe. Candidate needs to possess people skills and able to handle complex situation.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nFlexible working arrangements\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life InsuranceYour key responsibilitiesCentralization and automation of end of the day pricing and risk calculation for Fixed Income business\nBuild quant driven tools and products for front-office and control functions\nWork on implementation of regulatory driven projects like AQR (Asset Quality Review) for the Bank\nCoordinate and gather information from various stakeholders for deeper understanding of the business\nDesign an automated solution which is optimized and scalable\nDevelop and design tables and databases required for the storage of the data\nDevelop application/libraries for the implementation of the solutionYour skills and experienceStrong educational background in Engineering/Science, preferably from good colleges in India\nTotal experience of 5 years and above in Financial Industry\nRelevant experience and knowledge of various financial products – Bonds, Swaps, Cross Currency Swaps, Loans & Deposits\nKnowledge of derivatives pricing and risk calculations of financial products\nAt least 3 years’ experience in Python programming\nAt least 3 years’ experience with relational database design (oracle, mysql)\nRelevant experience in C++ programming (Class, Pointers, Data structure – stacks, queue)\nExperience with applied econometrics (Hypothesis testing, PCA, Linear/Non-Linear Regression etc)\nKnowledge of applied linear/Integer linear programming, dynamic programming & greedy algorithmsHow we’ll support youTraining and development to help you excel in your career\nFlexible working to assist you balance your personal priorities\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}