{"Job ID": "69872864", "Description": "Job TitleCorporate Risk - Credit Risk Middle Office- NAV- AssociatePosting DescriptionAs part of Risk Management and Compliance, you are at the center of keeping JPMorgan Chase strong and resilient. You help the firm grow its business in a responsible way by anticipating new and emerging risks, and using your expert judgement to solve real-world challenges that impact our company, customers and communities.  Professionals in our Corporate functions cover a diverse range of areas from finance and risk to human resources and marketing. Our corporate teams are an essential part of the company, ensuring that we are setting our businesses, clients, and employees up for success.Credit Risk Middle Office Associate provides support for Credit Risk Management which includes functions such as overlimits, Rules Based Fund processing, credit facility amendments, onboarding, credit reference data maintenance and offboarding.This role provides an excellent opportunity to work with senior credit risk and operations management to lead change agenda. This role will help develop knowledge of credit processes, various Investment products traded in the market,  core operational and control skillsets. A successful candidate will build solid relationships,  business strategy skills, and credit risk infrastructure knowledge. This role will also provide an opportunity to build knowledge on Intelligent Solutions tools and work on the Diversity, Equity and Inclusion agenda.Job ResponsibilitiesOperations management – provide operational support for Credit Risk Management by performing various functions including line facilitation/maintenance, client data management, limit breach monitoring & investigation, and NAV gathering.\nControl Mindset – build knowledge of processes to develop and maintain a strong control environment, including the ability to analyze problems and find solutions. Raise issues timely to management and assist in providing sustainable solutions\nMetrics management- review key metrics to measure risks, controls, workflow capacity and system issues.\nPeople management (if required)- Develop junior team members through day-to-day managerial responsibilities (e.g., people development, pipeline/skills monitoring, training programs).\nCommunication/presentation - influence stakeholders in a meaningful and actionable manner.\nChange Management – partner with CRMO leads and stakeholders to help define business case for changes that would improve processes/reporting and Identify them through to implementation. Problem solving / Analytical skills - solid critical thinking, attention to detail and analytical skills; able to synthesize large amounts of data and formulate appropriate conclusions.Required qualifications, capabilities, and skills6+ years’ experience in financial services, operations or related field.\nExperience in managing people\nPrevious experience in Operational or Risk Management, Compliance, Internal/External Audit or other control function desired.\nExperience in using metrics and KPI’s to measure core functions with the ability to track and report emerging trends and performance results with management.\nBasic knowledge of businesses/products offered by major financial institutions and risk disciplines.\nAbility to identify problems and develop solutions.\nEffective verbal and written communications skills.Preferred qualifications, capabilities, and skillLeader who is able to develop and bring together high performing teams in an effort to meet business needs. People and performance management is a plus.\nProficient in Microsoft Office Suite (Word, Excel, PowerPoint). Experience with automated solutions such as Alteryx, Python and UI Path a plus.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}