{"Job ID": "69870181", "Description": "Asplundh Tree Expert, LLC - 029Foreperson - Union (CDL Required) - ATEAre you a real go-getter looking for an amazing opportunity with anationwide fullForepersonSince 1928, Asplundh has been dedicated to safe, efficient and innovative line clearance services to the utility industry. Reliable, uninterrupted power is an important service provided by the world's electrical utilities and Asplundh has the expertise to help keep the power flowing. Diversification over the years has opened up vegetation management services to other specialized markets such as municipalities, railroads, pipelines, helicopter vegetation services, and departments of transportation.A family-owned and operated corporation headquartered near Philadelphia, Pennsylvania, Asplundh has grown to employ over 36,000 service professionals throughout the United States, Canada, Australia and New Zealand.Job TypePayBenefits:Essential Functions & Responsibilities:Minimum Qualifications:Education & ExperiencePre-ScreenLicense & Certifications:Physical Requirements:RAREOCCASSIONALFREQUENTCONTINUOUSSafetyAs a full-service utility contractor Asplundh performs tree pruning and removals, right-of-way clearing and maintenance, vegetation management with herbicides and emergency storm work and logistical support. Asplundh is the parent company of Asplundh Infrastructure Group whose subsidiaries provide overhead and underground line construction, planning and design, meter reading and AMR/AMI installation, electrical testing, and street lighting/traffic signal services. Asplundh also operates Rotor Blade Airborne Utilities Management, overhead electric distribution and transmission lines using MD 500 helicopters.Individuals must be able to perform the essential functions of the position with or without a reasonable accommodation. Individuals with a disability who desire a reasonable accommodation should contact the ADA Coordinator at 1-800-248-8733, ext. 1339.An Equal Opportunity Employer.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Alexandria, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}