{
    "Job ID": "69875870",
    "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.We are looking for a System Architect to enable Digitalization of the current systems in India. Mobility cloud platform is a product that envisions providing reusable building blocks to accelerate solution development in the cloud for the digital world. We build and maintain highly scalable services pertaining to device management, authentication and authorization, maps, messaging and a whole array of services.The System Architect is responsible for defining and communicating a shared technical and architectural vision for the solutions developed by an ART. This helps ensure that the system or solution under development fits its intended purpose. System Architects play a critical role in aligning Agile Release Train teams to a shared technical direction. They partner with their teams to:Elaborate the system architecture (including the architectural runway)\nValidate technology assumptions\nEvaluate implementation alternatives\nCreate the continuous delivery pipeline\nContinuously evolve architecture in line with technology trends\nEnsure compliance with organizational standards\nProvide technical inputs to make or buy decisions\nPerform technical evaluation of partners when neededExperience Required12-15 years of hands-on experience in software development or application engineering in languages such as Java, Python, Go, or similar Object-oriented languages8 years of experience as Technical Advisor for medium / large sized teams (10 members and more)5-8 years’ experience in architecting and automating Cloud native technologies, deploying applications, and provisioning infrastructure4. Experienced in building SAAS platforms, Open Source Technologies, container-based development, MicroService Architecture, MySql, NoSql DB.5. 5 years’ experience as an Architect with a proven track record of designing large scale, distributed, highly available, fault tolerant systems in the multi cloud environments across geographically distributed data centers6. Deep expertise in Azure/AWS capabilities including both IaaS and PaaS7. Experience architecting cloud native CI/CD workflows and tools, such as Jenkins, Bamboo, TeamCity, Code Deploy (AWS) and/or GitLab8. Architectural leadership experience with microservices and distributed applications, such as containers, Kubernetes, and/or serverless technology9. Experience with the full software development lifecycle and delivery using Agile practicesB.E/B.Tech12-15 yearsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}