{
    "Job ID": "69875991",
    "Description": "Title: Strategy and Quality CoordinatorLocation(s): Gaziantep, TürkiyeGross Monthly Salary Range: £2800 - 3300Service Area(s): Strategy and Quality Unit (SQU)Line Manager: Humanitarian Lead (SQU Lead)Introduction:The Aid Fund for Northern Syria (AFNS) are seeking Humanitarian Strategy and Quality experts to support the delivery of AFNS allocations. This role will play a key role in developing allocation strategies, as well as ensuring that the technical implementation and reporting for projects supported by AFNS are of a high quality. Candidates should have experience in supporting the cluster system in one or more humanitarian sectors, and the ability to assess partner needs and deliver capacity-building exercises to address knowledge gaps.Adam Smith International is an equal opportunity employer. We are committed to equal opportunities and creating an inclusive environment for all our employees. We welcome applicants regardless of ethnic origin, national origin, gender, race, colour, religious beliefs, disability, sexual orientation, or age.Further information about AFNS and the role are below.Background of the Programme:Adam Smith International has been awarded a contract from FCDO to run a multi-donor pooled fund which will provide continuity of humanitarian funding to the northwest of Syria irrespective of United Nations cross-border access. The Fund was established in November 2022 to meet priority needs in the north of Syria with a primary focus on the northwest of the country. The Fund is additional and complementary to the overall response and is based on humanitarian needs alone.The overall objectives of the Fund are:Save lives: Provide lifesaving and life-sustaining humanitarian assistance to the most vulnerable people with an emphasis on those in areas with high severity of needs.\nContribute to transformational change: Integrate local development with humanitarian response by supporting community-based action that does no harm and contributes to gender, age, and ability equality; and that enhances opportunities for peace and stability.\nEnhance protection: Enhance the prevention and mitigation of protection risks and respond to protection needs through supporting the protective environment in Syria, by promoting international law, International Humanitarian Law and International Human Rights Law, and through quality, principled assistance.\nIncrease resilience and access to services: Increase the resilience of affected communities by improving access to more sustainable livelihood opportunities and basic services, especially among the most vulnerable households and communities.About ASIAdam Smith International is a global advisory company that works locally to transform lives by making economies stronger, societies more stable, and governments more effective.  Our clients are governments, international organisations, companies, and foundations. They come to us to develop strategies and to design, deliver and evaluate programmes that address the big challenges facing the world.As a company with experience of delivering lasting results, including in fragile states and where there is conflict, we are prepared to manage a high level of risk to achieve our purpose.Our core team of staff and technical experts, in multiple offices around the world, ensures the quality of delivery and high ethical standards that we and our clients require.ASI is owned and operated by its employees. We are committed to corporate integrity and a triple bottom line of social, environmental, and financial performance.  This commitment was formally recognised when we became a certified B Corp. The certification indicates we balance profit and purpose through the highest standards of transparency and accountability as well as social and environmental performance.We are also a participant in the UN Global Compact, which certifies our respect for standards of human rights, labour, environment, and anti-corruption.About the RoleKey Responsibilities and AccountabilitiesSpecialist knowledge: Participate in the technical review process of proposals and reporting. Expected to include review of proposal submissions, facilitation of the Strategic and Technical Review Committee and their feedback to implementing partners. capacity building for AFNS team and implementing partners, and other exercises aligned the Humanitarian Officer’s area of expertise.\nAssist in the preparation of allocation documentation: Assist the Humanitarian Lead to prepare allocation documents in line with the Humanitarian Response Plan and prioritise in line with Cluster gaps and priorities.\nCoordination and relationship development: Build relationships with humanitarian clusters and other key stakeholders as identified, to support information exchange, effective coordination, strategy design, and implementation of AFNS funded projects.\nSyrian humanitarian context and gap analysis to inform humanitarian needs and response: Support the Humanitarian Lead with rigorous gap analysis of the humanitarian context of northwest Syria, drawing upon inputs from cluster leads as well as programme research outputs, to identify priorities for AFNS allocation cycles.\nStrategy development: Supports the AFNS Leadership to develop Fund and allocation strategies for AFNS that addresses the most pressing areas of humanitarian need and maximises impact of donor funding contributions.\nAFNS team and Implementing Partner Capacity-building: Identification of training and capacity needs, development of capacity building plans for AFNS team members and partners. Contribute to the development of training materials and conducting training sessions.\nReporting and revision: Review implementing partner reporting to ensure the accuracy and quality to input into wider reporting from the allocation and Fund. Support project revision requests in consultation with Humanitarian Lead.\nSurge capacity: Provide surge support to colleagues as requested, including the Grants and Partnership Unit (GPU) at peak times. Other tasks as identified by the Humanitarian Lead.About YouAbility to work under pressure and manage competing demands against tight deadlines.\nGood judgement, integrity, sensitivity, and respect for confidentiality.\nPro-active, flexible and result focused approach.\nA strong team player, with the ability to build effective relationships working remotely.EssentialEligible to work in Türkiye (right to work).\nA bachelor’s degree in social sciences, or any other relevant field.\n3 - 5 years’ work experience in a comparable role.\nExcellent spoken and written English language.\nMicrosoft Excel (advanced level), Word, and Outlook (intermediate level).\nStrong understanding of humanitarian issues and principles as well as the humanitarian context in northern Syria.\nExperience delivering capacity building exercises.\nSpecialist expertise in one or more humanitarian sector area.Highly DesirableArabic language skills.\nPrevious experience on a grant management programme.\nExperience working in a humanitarian role for an organisation involved in Syria cross-border aid delivery.\nFemale candidates are strongly encouraged to apply for this vacancy.What we Offer YouOur people are at the heart of our strategy and our decisions. We offer a salary in GBP and learning and support to develop your skills to assist in progressing your career.\nThe diversity of our workforce makes AFNS a great place to work, friendly, more creative and resourceful, and underpins strong partnerships.\nWe’ve built a culture to reflect our values, full of likeminded professionals who are smart, passionate and great at what they do.How to Apply:Interested applicants are requested to submit a CV and a one-page covering letter addressing the Key Responsibilities and Accountabilities. Applications close Wednesday 27 September at 9:00am (GMT+03).Due to the volume of applications, only short-listed applicants will be contacted.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gaziantep, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}