{
    "Job ID": "69873249",
    "Description": "IntroductionYour Role and ResponsibilitiesYour main duties will include designing and implementing new features, optimizing, and maintaining existing code, and ensuring the software meets high-quality standards through testing and debugging. You will also work closely with other developers, designers, and product managers to ensure the software meets user needs.\nAdditional responsibilities may include:Team collaboration to maintain end-to-end ownership and delivery of a market-leading IT BusinessManagement product.\nIntegration of the IT FinOps Business Management product within the IBM cloud ecosystem.Required Technical and Professional Expertise6+ years demonstrated experience developing enterprise-level software as well as providing testingand support to software applications\nDemonstrated experience with end to end application development.\nProficiency in Java and REST APIs\nExperience with relational databases, schema design and SQL\nExcellent communication skills, team collaboration and critical thinking\nProven application development skills with web or enterprise scale software.\nStrong knowledge of data structures, algorithms, object-oriented programming.Preferred Technical and Professional ExpertiseExperience with AWS or other public cloud technologies\nExperience with JavaScript and one or more modern JS UI frameworks\nExperience with Database implementations, specifically utilizing NoSQL\nExperience with distributed source control systems such as Git and Mercurial.\nExperience with test-driven development and frameworks.\nFamiliarity working in a DevOps model.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}