{
    "Job ID": "69875708",
    "Description": "Location:Job ID:Date Posted:Company Name:Profession (Job Category):Job Schedule: Remote:Job Description:General Information:Business Information:The Hitachi Energy Indian Operations Center (INOPC) is a competence center with around 1500 skilled engineers who focus on tendering, engineering, planning, procurement, functional system testing, installation supervision and commissioning. However, over the last decade, it has evolved to become the largest engineering hub. The India Operations Centre is a key aspect of the Power Grids business Power Up transformation program. The Hitachi Energy Indian Operations Center team at Chennai supports Hitachi Energy’s units in more than 40 countries across a wide portfolio of all the four business units in Power Grid business. To date, the team has executed engineering and commissioning for projects in more than 80 countries.Mission Statement:Lead the execution of GCB (Generator Circuit Breakers) projects and troubleshooting cases and ensure that all related activities are performed in accordance with Hitachi Energy policy, contractual agreements, quality standards, health, safety and environment requirements, financial targets as well as schedule commitments.Your Responsibilities:Planning:Defines jointly with project controls / project operations, sales and engineering teams all project plan documents, including scope and financial plan, schedule and risk & claim management plan.Project leadership:Establishes the project execution approach and overseas project handover, execution planning and monitoring and control of both internal and external resources to accomplish all project goals.Project Execution and Control:Review of Contract receipt from Sales.\n\n  Develop project schedule and freeze with respective stakeholders (internal and external).\n\n  Preparation of project specific risk and opportunities management plan if applicable.\n\n  Preparation of project wise Master document list if applicable.\n\n  Coordination for Engineering drawing approvals.\n\n  Coordination with Engg and SCM to place order on sub supplier for material procurement.\n\n  Coordination on Stage inspections (if any).\n\n  Coordination with LPG for material readiness and completion of FAT during SFM.\n\n  Coordinate packing with packing company.\n\n  Follow-up on Material shipment, material receipt at site and acknowledgment from sites for submission of Milestone billings (if any).\n\n  Coordinate with Service group for site activities.\n\n  Closely coordinate and document change requests related to project scope and get approvals for time extension, additional cost etc .\n\nProject handing over, as-built drawings, commercial closure etc and collection of PAC, close out of snags & FAC.\n\n  Payment follow up with Customers.\n\n  Main contact for customers in project, leading customer meetings.\n\n  Execute trouble shooting in case of warranty issues.Principles:  Adhere to the project management processes in the organization.\n\n  Ensure implementation and compliance of OHS group guidelines.\n\n  Ensure Hitachi Powergrids integrity guidelines are followed in the team.\n\n  Ensure IS security policy followed in the team.\n\n  Acts as role model for the tea.\n\nSafety and Integrity: Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.Your Background:Graduate in engineering with Experience in execution Energy projects, preferably GCB projects or order handling in any of power system OEMs with a min of 2 years in leading projects and ability to work in ERP environment.\n\nStrong technical knowledge is a must.\n\n Preference will be given to those who have completed PMP.\n\nShould possess strong leadership skills and ability to convince stakeholders in the interest of the project.\n\nAbility to work under pressure to deliver the projects with time, cost and quality.\n\nProficiency in both spoken & written English language is required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}