{
    "Job ID": "69872593",
    "Description": "\"Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\nDo what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"Food & Beverage Manager\n As a Food & Beverage Manager, you will strategically lead the team to take guest satisfaction to the next level.\nWhat is in it for you:\nEmployee benefit card offering discounted rates in Accor worldwide\nLearning programs through our Academies and the opportunity to earn qualifications while you work\nOpportunity to develop your talent and grow within your property and across the world!\nAbility to make a difference in the local community through our Corporate Social Responsibility activities, like Planet 21\nWhat you will be doing:\nLead, mentor and train the Food & Beverage Operations team\nEnsure Food & Beverage relevant brand standards are maintained\nStrategize on new products and service offerings\nCreate unforgettable experiences for our guests\"Your experience and skills include:\nService focused personality is essential and previous leadership experience required\nProven ability to build and maintain good relationships with all stakeholders\nCommunicate thoughts, actions and opportunities clearly with strong networking skills\nAbility to lead by example, believe in a strong team culture and set the scene for high performanceNote: Customization may be included for any specific local or legislative requirements, such as work permits\nOur commitment to Diversity & Inclusion:\nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}