{
    "Job ID": "69873989",
    "Description": "The Team:\nSolutions Operations is the industry leader in leveraged loan, private equity and high-yield solutions and provides comprehensive products and services for portfolio management, administration, reporting, and analysis. Through our numerous platforms, managed services, or full outsourcing to front to back-office functions, Solutions Operations offers flexible and unique solutions tailored to client needs. \nThe Impact: \nOutsourcing delivery associate is responsible to learn various nuances of loan operations and its impact on clients. An associate is expected to quality check activities/transactions which results in better client experience and satisfaction with our deliverables. Adapt quickly to changing business/client needs to pivot comfortably in fast-paced environment.\nWhat’s in it for you: \nAn individual will be aligned within our finance operations vertical and will be responsible to manage daily BAU, conducting analysis and reconciling client transactions. You will be communicating with global business partners to understand changes in process and implementing process changes in-house.\nResponsibilities:\n•    Process trade settlement in WSO Admin as well as new borrowings, increases, rollovers, pay downs, commitment reductions, etc. maintain current accuracy standards based on the information provided by client.\n•    Responsible for accurately processing and QC daily activity, new deal closings, restructures and amendments for all asset types (Loans, Bonds, ABS, Equities, CDS) by reviewing source documentation and faxes from agent banks.\n•    Should be comfortable working in fast-paced environments with ability to pivot and adapt quickly to changing business needs \n•    Creativity to go beyond current tools to deliver the best solution to the problem, ability and comfort with working independently and making key decisions on projects and business critical activities \n•    Provide training to new hires and guide them throughout their learning curve.\n•    Build collaborative environment with other departments and stakeholders, to identify business needs and opportunities for improvement\nWhat We’re Looking For: \n•    Bachelor’s from accredited institution or equivalent work experience needed\n•    Business/Finance/Accounting strongly recommended\n•    Strong Computer skills – Microsoft Office suite\n•    Strong work ethic – organized, detail oriented, analytical, task driven Flexible Working (optional)\nWe pride ourselves on our agility and diversity, and we welcome requests to work flexibly. For most roles, flexible hours and/or an element of remote working are usually possible. Please talk to us at interview about the type of arrangement that is best for you. We will always try to be adaptable wherever we can.  Return to Work\nHave you taken time out for caring responsibilities and are now looking to return to work? As part of our Return to Work initiative (link to career site page when available), we are encouraging enthusiastic and talented returners to apply, and will actively support your return to the workplace.Grade/Level (relevant for internal applicants only): Grade 8The Location: Gurugram, IndiaAbout Company Statement: \nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.S&P Global Market Intelligence partners with customers to broaden their perspective and operate with confidence by bringing them leading data sources and technologies that embed insight in their daily work.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}