{"Job ID": "69875935", "Description": "Bosch Global Software Technologies Private Limited (BGSW) is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22000+ associates, we are the largest software development center of Bosch, outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence i n US, Europe and the Asia Pacific region. We have seven state-of-the-art facilities spread across Bangalore and Coimbatore in India and Ho Chi Minh City in Vietnam. For over 20 years, BGSW has been the preferred engineering services and solutions partner for the Bosch Group worldwide.\n\n  Project Management experience in Steering/Power train/Brakes/Transmission domain is preferred.\nWorked with Change management tools like ClearQuest\nKnowledge / experience with Quality process & Safety-standards such as ASPICE/CMMI, ISO 26262\nWorked with AUTOSAR / HIS standards,ISO14229,ISO TP Layers\nPMQ-L1// PMQ-L2/ PMP certified\n Complete ownership of the project from requirement to delivery\n Planning and scheduling of project activities based on customer requirement\n Should possess strong customer interfacing skills along with good business acumen\n Good in stakeholder management\n Good in writing proposal and estimation for the RFQ\n Should Achieve results within the approved project schedules, estimated costs /efforts and quality plan\n Should Lead, self-driven and motivate the team to achieve the project goals and customer expectation.\n Should able to handle dynamic requirements of the customer\n Flexible to handle pressure in adverse situations\n Should Co-ordinate with the Architects, Specialists, process responsible and the team to implement software change request and the changes on the test specification, test execution etc\n Good problem management skills (PS002, 8D Coach certification)B.E (ECE,EEE,E&I)/ME7-9yearsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Coimbatore, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}