{
    "Job ID": "69875583",
    "Description": "Your Work Shapes the World at Caterpillar Inc.When you join Caterpillar, you're joining a global team who cares not just about the work we do – but also about each other.  We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don't just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it.At Caterpillar, you build what matters—whether it’s the career you want, crucial work skills, strong relationships, or new digital technologies. There are big jobs to be done worldwide—building critical infrastructure, bolstering local economies, meeting the demand for energy—and that work is powered by our people.Every single Caterpillar employee moves our company forward. Piece by piece, part by part, person by person. Together we create sustainable, world-changing solutions that impact lives around the globe.Position Title: Patent AgentJob Location: Chennai, TN-IndiaJob Description:Caterpillar is seeking an experienced patent agent to be based in Chennai, Tamilnadu. Caterpillar’s intellectual property group offers a very broad-based intellectual property practice.Skill Set Requirement:International patent portfolio management\nInvention harvesting\nDrafting and prosecuting patent applications, and working with external counsel to have patent applications drafted and prosecuted for US, India and/or EP Jurisdiction; and\nGeneral IP counselling\nAftermarket Patent Lifecycle Development\nPatent enforcement work experience in India\nKnowledge of Indian Patents Act and US Patent Laws\nExperience in drafting and prosecution of Software/Electronics/Electrical PatentsThe candidate will work closely with Business Unit Patent Attorneys within the candidate’s assigned technology and product area to evaluate the patentability of innovations with specific attention to managing the preparation, drafting, and filing of patent applications and office action responses globally.\nAdditionally, the candidate will draft approximately 10 patent applications annually and draft responses to select office actions.\nHowever, the candidate will primarily manage outside counsel for the majority of the candidate’s patent preparation and prosecution docket of work. \nThe candidate will be expected to work closely with attorneys, engineers, and service providers to collect relevant materials including any invention-related materials for preparing or having prepared, patent applications that are filed in the U.S., India, and globally.\nThe candidate may be asked to perform research and analysis, provide guidance on a variety of patent and IP-related issues, and act as a liaison for interdepartmental initiatives.\nThe Candidate must have the ability to work under strict deadlines with minimum supervision.\nThe Caterpillar IP team has broad international exposure to IP matters and provides the opportunity to work closely with colleagues spread over the globe.\nThe role will require a highly motivated individual that is looking for autonomy and flexibility but also looking to be part of an enthusiastic team.Qualification & Experience:The preferred candidate will be a registered patent agent with the  Indian Patent and Trademark Office and must have a Bachelors’ degree (B.E. / B.Tech) in engineering in electronics/electrical/computer-science domain.\nStrong background with, 2 years of relevant engineering experience, plus 8-10 years of IP experience with patent protection of software, electronics, and electrical technologies related to construction equipment or automotive domain is highly desirable.\nWhether your experience has been in-house or in private practice, you must demonstrate strong organizational skills, excellent communication skills, and must also be prepared to undertake occasional business travel, including occasional travel to various facilities within India to liaise with inventors, business unit professionals, and other members of Intellectual Property.Additional Information:Caterpillar is not currently hiring individuals for this position who now or in the future require sponsorship for employment visa status; however, as a global company, Caterpillar offers many job opportunities outside of the U.S. which can be found through our employment website at www.caterpillar.com/careers\n\nCaterpillar is an Equal Opportunity Employer (EEO)\n\nEEO/AA Employer. All qualified individuals - including minorities, females, veterans and individuals with disabilities - are encouraged to apply.Caterpillar is an Equal Opportunity Employer (EEO).Not ready to apply? Submit your information to our Talent Network here .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}