{
    "Job ID": "69874346",
    "Description": "Veolia group is the global leader in optimized resource management. The Group designs and provides water, waste, and energy management solutions that contribute to the sustainable development of communities and industries.MAIN TASKS AND RESPONSIBILITIES\nTechnicalPrepare/review the internal procedures for tenders (memos, Risk Analysis Form, Tender Summary Form, etc. ) with proposal engineer(s)\nPrimary design and coordination of validation process-related departments\nCoordination with all departments on proposal/tender deliverables\nDiscuss technical options/process choices/optimizations with design and tender teams and validate the estimates\nCoordinate with partners/subcontractors on the external costs and participate in the evaluation of offers\nManage the negotiations/clarifications after bid submission till award with the project team \nPrepare the hand-over file and provide the support required by the Execution Team after the award\nFollow up with sales on leads and opportunities\nMake technical choices and validate the estimates\nPrepare costs/price optimization of the tenders\nIdentify potential risks and opportunities during the tender stage \nPrepare a list of clarifications to the client  and attend client meetings \nWork within the company QA procedures and complete internal forms required\nCompliance check of potential clients via internal tools.\nCarbon footprint analysis of offered technologies via internal tools, partners and suppliersQUALIFICATIONS AND EXPERIENCEBA in Environmental Engineering  \n10 years experience on tender and proposal in water treatment sector\nGood at English languageTECHNICAL CAD and other drawing software capability\nGood at Google work space sheets/excel \nEnglish language \nWater treatment sector knowledge\nWaste water treatment sector knowledgeBEHAVIORAL Initiative taker, self-motivational\nWork under pressure\nHigh work ethics \nSelf-responsibilityQHSE Commitments Ensure H&S Plan is implemented in the projects. Ensure Veolia and Subcontractor teams are complying with our safety Policy. Ensure procedures are well respected on sites. Coordinate with the QHSE Manager for feedback and support. Establish annual quality objectives for both strategic and operational levels Improve the effectiveness of management system, quality of activities, products and services VEOLIA CODE OF CONDUCT Comply with applicable ethics and legislation referred to in Veolia Code of Conduct policy, particularly in the fight against corruption and influence-peddling As an inclusive company, Veolia is committed to diversity and gives equal consideration to all applications, without discrimination.As an inclusive company, Veolia is committed to diversity and gives equal consideration to all applications, without discrimination.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}