{
    "Job ID": "69876117",
    "Description": "GENEL NİTELİKLER VE İŞ TANIMIParaşüt 2013 yılında, Türkiye ekonomisinde önemli bir yere sahip olan küçük ve orta ölçekli işletmelerin finansal operasyonlarını daha verimli yönetebilmesini desteklemek amacıyla kurulan, bulut tabanlı bir ön muhasebe programıdır. 2019 yılının Mayıs ayında, Mikrogrup çatısı altında Mikro Yazılım ve Zirve Yazılım ile güçlerini birleştirmemiz ve 2020 yılında Shopside ve IRGAT'ın bünyemize katılması ile beraber ailemiz giderek büyüdü. Bugün ise Paraşüt ve tüm Mikrogrup ailesi olarak KOBİ'lere, kuruldukları ilk günden itibaren her aşamada işlerini kolaylaştıracak ürün ve hizmetler geliştirmeye devam ediyoruz. Büyüyen ve gelişen organizasyonumuzda“Müşteri Hizmetleri Müdürü” rolünde çalışacak ekip arkadaşımızı aryoruz!Nasıl bir ekip arkadaşı arıyoruz?Üniversitelerin lisans bölümlerinden mezun,\nMüşteri Hizmetleri/Çağrı Merkezi alanında en az 10 yıl deneyimli,\nTercihen yazılım, bilişim, iletişim sektörlerinde çalışma deneyimi olan,\nTercihen daha önce ürün ekipleriyle birlikte çalışma deneyimi olan,\nAgile metodlarla çalışmış,\nMüşteri odaklı çalışabilecek,\nSözlü ve yazılı iletişim becerileri yüksek,\nBütçe yönetimi, analiz, planlama ve koordinasyon becerileri gelişmiş,\nİçsel motivasyonu yüksek,\nLiderlik özellikleri gelişmiş.Sorumlulukları nelerdir ?Şirket stratejileri ve hedefleriyle paralel Müşteri Hizmetleri Operasyonlarının belirlenmiş olan servis seviyesi (SL) ve Kritik Performans Göstergelerinin (KPIs) gerçekleştirilmesini sağlamak,\nYeni trendlere ve teknolojik ilerlemelere yönelik araştırma ve analizler yaparak şirket stratejileri doğrultusunda sürekli geliştirmek ve iyileştirmek,\nDepartmana ait yıllık bütçe planlamasını ve planlanan/gerçekleşen bütçe takibini, gerektiği durumlarda bütçe revizyonunu yapmak,\nMüşteri memnuniyetini arttırmaya yönelik çalışmalarda bulunmak,\nEkibinin gelişimini sağlayarak verimliliğini, sadakatini, motivasyonunu ve memnuniyetini artırmaya yönelik aksiyonları almak,\nRaporların doğru ve anlaşılır bir şekilde üretilmesini sağlamak, analiz ve yorumlarını yapmak,\nDepartmana ait projelere aktif katılmak, projeleri yönetmek.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}