{"Job ID": "69875649", "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The opportunity:Reporting to Technical Success Services (TSS) Practice Manager, Lead Cloud Applications Consultant is responsible for being the technical SPOC that involves complete ownership of technical delivery including administration and management of the OpenText Media Management suite for our worldwide customers.The role is customer-facing and requires excellent interpersonal skills with the ability to communicate to a wide range of stakeholders (internally and externally), both verbally and in writing.What it takes:Excellent grasp of the principles of OpenText Media Management Platform version 21.x., 22.x,23.x\nMandatory experience in administration and management of the OpenText Media Management platform.\nShould have working experience on Rest services, JAVA and J2EE developments.\nShould have working experience on OpenText Media Management, DAM Link Connector, OTMM for SAP Solutions and Creative Review\nGood to have working experience in the management of OpenText Media Management Platform in Cloud Technologies like AWS or GCP or Azure with containerized deployments.\nShould have experience on OpenText Media Management customization modules, like creating custom jobs, workflow,Integrating with third-party applications using Rest Services.Proficient in OpenText Media Management and OpenText Directory Services Installation, Configuration/Administration.\nGood experience on Java, JavaScript, AngularJS, html, Xml, web services and external system integration.\nShould be able to work Independent in maintenance support, troubleshoot issue and rectify bug.\nPrior experience in developing, maintaining and customizing UI (new screen), business rules, workflow and Jobs using OpenText Media Management.\nParticipate in the day-to-day administration of the systems, including Incident & Problem Management, Change & Release Management.\nProficient in the administration of SQL Server or Oracle.\nGood understanding of object-oriented programming, Web Services, LDAP configuration, and RDBMS concepts\nWorking knowledge of Unix and Windows operating systems\nStrong analytical skills combined with the ability to work in a fast-paced environment with geographically distributed teams.\nAbility to develop shared library to using GitLab or AWS Code Commit to enable build and deploy. \nExperience working with AWS/ google in a solution and deployment role.\nShould have experience on build and deployment process for different technology-based applications like Java, Python, shell etc.\nExperience with at least one of CI/CD build and deployment system (Jenkins, GitLab, GitHub or Azure DevOps GitHub, Maven)\nStrong understanding of cloud native and container based distributed systems like Kubernetes.\nKnowledge of Windows, UNIX, and Application administration skills.\nExperience working with relational DBMS (PostgreSQL/Postgres, Oracle, MS SQL Server)\nProgramming/scripting is helpful, (ie. SQL, .sh/.bat, Java, JavaScript)\nFamiliarity with configuration and management of web/application servers (IIS, Apache, Tomcat, JBoss, etc.).\nGood understanding of object-oriented programming, Web Services, LDAP configuration, and RDBMS concepts\nExperience in Docker, Docker compose, Docker file.\nRelevant Experience: 8 - 12 yearsYou are great at:Represent OpenText in a professional manner to customers, partners, and other OpenText personnel always.\nTechnical SPOC for assigned customer engagements. Take complete ownership of technical delivery including providing SME guidance to the TSS team.\nProficient in conducting architecture, performance, and capacity reviews for deployed application landscape and coming up with recommendations for improvement.\nLead & drive all major activities/milestones to successful completion within the agreed timelines.\nImprove team & delivery efficiency by meeting customer agreed KPIs & SLAs, showcasing process improvements, and identifying automation opportunities wherever needed.\nStrong hands-on in managing OpenText Media Management applications for global customers using the ITIL framework.\nSupport and report to the engagement Service Delivery Manager while assigned to active customer engagements. Regularly communicate status to the engagement project manager and proactively identify issues and preventive/remedial measures.\nEstablishes relationships with client technical counterparts. Participates in weekly and monthly client service delivery meetings including escalation calls.\nWork in conjunction with colleagues from different teams of OpenText including product support, engineering, product management & Cloud Ops Teams (like DB, Storage, network, etc.)\nPrepare, maintain, and submit activity/progress reports and time recording/management reports in accordance with published procedures. Keep delivery managers informed of activities and alert of any issues promptly. Provide inputs as part of engagement closure on project learnings and suggest improvements.\nProvide knowledge transfer to team members, train staff personnel, provide on-the-job guidance and mentoring and conduct training sessions to customer personnel when authorized by management.\nAdhere to processes and methodologies to perform the required function. Report deviations from defined processes to the engagement project manager and recommend associated improvements.OpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}