{
    "Job ID": "69873777",
    "Description": "Careers that Change LivesThe Principal Product Specialist will be part of a paradigm shift in hypertension care in India. The individual will be responsible for end-to-end product marketing activities of renal denervation procedure (a procedure to lower blood pressure levels) launch in India. The individual will be in charge of commercialising all aspects of the product including but not limited to, preparing launch plans, planning advocacy for the product, creating referral pathways and executing the launch plan with the sales team through promotions and conferences. From a downstream marketing perspective, this position will work with regional and global marketing teams to align and leverage expertise around the world to help in execution of training, launch and revenue growth plans. A strong emphasis is also required in digital marketing to ensure the awareness and risks of hypertension is spread across the Indian population.Portfolio : Coronary, Cardiovascular, Renal DenervationProducts : Symplicity Spyral™ renal denervation systemA Day in the Life·Develop comprehensive marketing plans including market entry, pricing strategy, sales/revenue forecasts, inventory management and brand communication initiatives.  Support the marketing strategy through setting appropriate budgets, goals and metrics.·Partner with global leads to develop local marketing strategies & strategic plans for the region ·Manage global forecast & product life cycles ·Conduct advocacy meetings, market research, and obtain market intelligence for pricing analysis and product positioning·Develop, implement, and execute marketing strategies including messaging, physician engagement, effective pricing & sales engagement.·Consult with country and/or regional marketing and sales teams to introduce new changes toproduct marketing like features, techniques, training, and capabilities. ·Coordinate sales and related activities such as advertising, public relations, social media, and strategies to achieve marketing objectives. ·Develop and execute strategic launch plans and set 3–5-year growth targets  ·Foster positive relationships with key opinion leaders, industry luminaries, and other partners to support therapy acceptance, therapy expansion, and safe and effective use of Medtronic products. ·Collaborate with a wide variety of internal stakeholders across legal & compliance, regulatory, clinical, supply chain, finance and government affairs to drive alignment and execution of marketing strategies.·Lead and participate in core team to address key business opportunities and challenges in alignment with senior leadership.·Spend significant time in the field with sales personnel and customers to understand their perspective and ideas and stay at the front of market dynamics and changes.  Represent the customer during internal meetings and represent the company at advisory boards and medical congresses.Must Have: Minimum RequirementsBachelors degree required,MBA preferred\nMinimum of 8 to 12 years of marketing experience, or advanced degree with a minimum of 5 years relevant experienceNice to HaveTeam orientation, collaboration, written/oral communication, analytical and customer focus, people management and priority setting.Exceptional quantitative, analytical, written and verbal skills. Proven track record of planning, execution and resultsAbout MedtronicJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Marketing",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}