{
    "Job ID": "69873600",
    "Description": "<p><b>What can you expect?</b></p><ul><li>Strong understanding of Reinsurance principles, Reinsurance contracts and market practices.</li><li>Dealing with complex Reinsurance placements, Setting up risk on system basis contract document/Broker Instruction sheets and generating covering letter (EOC) for the clients</li><li>Creating Premiums transactions & generate LPANs and closing instructions</li><li>Understanding/analysing complex claims documents from the clients, setting up of claims on system, creating claims transactions & generating documents</li><li>Submission of documents to Reinsurers</li><li>Monitor the agreement, following up with clients and reinsurers</li><li>Handling enquiries from Reinsurers and clients</li><li>Assist in quick settlement of funds to clients and reinsurers</li></ul><p><b>We will count on you to:</b></p><ul><li>Assisting Junior Technicians with technical queries and troubleshooting systems issues.</li><li>Ensure that own work and the work of the Junior Technicians are processed accurately and in accordance with internal and external Key Performance Indicators (KPIs)/Service Level Agreements (SLAs).</li><li>Produce all necessary documentation per market requirements to support the advice of claims to the market and the collection and payment of funds to/from Clients and Underwriters.</li><li>Maintain accurate records of all communications (written only) with Clients (internal and external) and Underwriters and ensure that e-filing is per written procedures.</li><li>Ensure that all statutory regulations and company procedures are adhered to in line with the Operating Policies & Guidance Manual/Operating Procedures Manual/Claims Procedures.</li><li>Appropriate use of internal systems and controls.</li><li>A good understanding and processing capability in systems and ECF and ability to work on the London IMR.</li><li>Ensure that all statutory and company regulations are followed while processing work to protect clients, colleagues and the business interests of the company</li><li>Contribute to the development of a supported and flexible working environment ensuring business needs are met at all times</li><li>Achievement of individual performance measures as outlined and targets set within performance appraisal as agreed with line manager</li><li>Understand and contribute to the achievement of individual and departmental Key Performance Indicators and Service Levels Agreements</li><li>Working towards enhancing customer/client experience whilst adding value to the respective end-to-end business process</li><li>Displaying professional communication skills at all levels within MMC  and with external customers</li><li>Maintenance of relevant record / logs / timesheet & hygiene of work as required by management and for MIS purposes</li><li>Participate and attend any training programs or learning sessions as deemed necessary for enhancing job skills or nominated by managers. Conduct training to team members on complex reinsurance terms and practices to improve knowledge of the team.</li><li>Constantly build technical expertise and business knowledge associated with the respective process as deemed necessary by line manager</li><li>Taking ownership of work queues and ensuring proper handover of work to team/line manager in case of absence from work</li></ul><p></p><p><b>What you need to have: </b></p><p></p><ul><li>Experience in Reinsurance domain (minimum 5 years)</li><li>Basic understanding of Insurance principles, terminologies and Reinsurance concepts and practices</li><li>Good written and verbal communication skills (mandatory)</li><li>Good Typing speed</li><li>Logical Reasoning and prioritization skills</li><li>Problem Solving and Analytical Skills</li><li>Proficient with MS outlook & MS Excel</li></ul><p></p><p><b>What makes you stand out?</b></p><p></p><ul><li>Experience in interacting with international customers (preferred)</li><li>Excellent presentation and MS office power point skills (preferred)</li><li>Basic understanding of Risk & Financial regulatory bodies (preferred)</li><li>Experience in regulations that govern Insurance in our countries of operation (i.e. UK, Australia, Asia) (preferred)</li></ul>Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}