{"Job ID": "69873017", "Description": "Associate Mechanical Design and Analysis EngineerCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest (Per Boeing LinkedIn page) aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, Model-Based Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.  With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.Job Description:The Boeing India Engineering is currently looking for an Associate Mechanical Design and Analysis Engineer to join the Boeing India Engineering Team located at Chennai, India.This team has been developed to create growth and development opportunities for the employees in multiple domains and fostering execution excellence for the organization. For the employees, it positions them for further career growth through assignments and trainings. For the organization, it helps build ready-now agile teams who are able to work across different domains and projects. Position Responsibilities:Understands, integrates and documents mechanical, fluid and thermal analyses and test results to validate and verify systems and components meet requirements and specifications.\nDevelops new design/analysis processes and tools to improve effectiveness, quality and efficiency of the development effort. Investigates emerging technologies to develop concepts for future product designs to meet projected requirements\nThis position will be responsible for communicating regularly with team members in Boeing organizations and shall provide periodic update on project progress, quality metrics, project summaries, and other related documents.\nMust be able to work collaboratively with cross-functional teams within Boeing and external partners.\nThis position will participate and support initiatives of Boeing India organization related to engineering excellence, employee development, customer engagement etc.\nThe Engineer must be flexible and accommodative to get trained and execute not only in Mechanical Engineering tasks, but also in Electrical Engineering, Technical Publications, Systems Engineering as well. (Necessary trainings and mentorship shall be provided all along to execute, perform and deliver)\nEngineer must help other peers in other domains for Mechanical Engineering aspectsBasic Qualifications (Required Skills/Experience):Expertise in CAD Tools (AutoCAD, CATIA, Creo, Unigraphics/NX, Solid works) for Modeling & Drafting\nPreferred knowledge in Model Based Definition and PLM software (Enovia, Teamcenter).\nExpert in Generative shape design, Part design, Assembly design, Sheet metal design, Tubing, Drafting\nExperience in structural design, mechanical design, stress analysis, material properties, awareness of Industry standards for structural and mechanical design.\nExperience in Geometric dimension and tolerance (ASME Y14.5-2009).\nExperience in Tolerance Stack up analysis\nKnowledge in DFM – Sheetmetal and Assembly\nKnowledge of DO-160 certification requirements for Mechanical Engineering products\nCreation of Qualification Plans, procedure and processes is a plus.\nKnowledge of aircraft structural, system or environmental testing is preferred.\nKnowledge of NASTRAN, PATRAN, Hyper mesh, and Manufacturing systems will be an advantage\nAble to work independently with minimum supervision, positive attitude and highest ethics.\nPro-actively seek information and direction to successfully complete the statement of work.\nDemonstrate strong written, verbal and interpersonal communication skills. Be fluent in written and spoken English.Typical Education & Experience:Education/experience typically acquired from an accredited university in engineering preferably in Mechanical / Aerospace Aeronautical (e.g. Bachelor) and typically 5 to 8 years' related work experience or (e.g. Master 4 to 7 years' related work experience, etc.).Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}