{"Job ID": "69873423", "Description": "Amazon’s vision is to be Earth's most customer-centric company; to build a place where people can come to find and discover anything they might want to buy online.\n\nAmazon's diverse online business requires VAT filings in a number of jurisdictions across Europe and creates specific VAT compliance obligations relating to third parties (3P) that sell via our websites. These 3P obligations are the responsibility of the European VAT Compliance & Controllership team (VAT C&C) which is located primarily in Bratislava. We are looking for a number of Tax Analysts to join us in Bangalore. This is a multiple headcount hire , which will involve working within the part of the team that is responsible for checking the VAT compliance status of our 3P sellers, providing 3P data to tax authorities, and controlling the access of 3P sellers to our websites. Work may also include some mainstream VAT compliance activities, supporting internal and external audits, and liaising with colleagues in VAT C&C as well as Tax and the wider business.\nKey job responsibilities\nResponsibilities:\nWorking within the EMEA VAT C&C team:\n· Confirm the VAT registration and compliance status of 3P sellers;\n· Provide transactional and other data to tax authorities in respect of 3P sellers;\n· Manage and control access of 3P sellers to Amazon marketplaces based on VAT compliance status and requests from tax authorities;\n· Assist with VAT registrations across various jurisdictions;\n\nWe are open to hiring candidates to work out of one of the following locations:\nBangalore, IND\n- Knowledge of Excel at an advanced level\n- Experience with Microsoft Office products and applications\n- 1+ years of finance operations/shared services, accounts payable, account receivable (collections) or general ledger experienceJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}