{"Job ID": "69873565", "Description": "Job Requisition ID: 157136 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the role:The primary focus of the role will be to provide professional and technically sound installation at site for air-conditioning equipment and appliances. \nWhat you will do:Provide professional and technically sound installation at site for air-conditioning equipment and appliances marketed by the company.\nAttend site visits, and study technical drawings to determine equipment selection for project jobs.\nSub-contractor selection, job allocations, monitoring and continuous performance assessment. \nVendor development for local procurement.\nProvide adequate support to the installation team at site, to estimate installation costs, which assists in the procuring of orders for the company which maximizes sales and gross margin for the Division.\nHandling key customer accounts.\nconstantly collect competitors’ information to enable the HSM to negotiate with Principals for better price and marketing support.\nsubmit technical data to ministry of electricity and water, building engineering department for getting approval certificate to enable participation in government tenders. Required Skills to be successful:\n1.- Customer management and communication skills.\n2.- Air conditioning installation experience. \n3.- Data and report management.\n4.- Supervisory experience.About the Team:Reporting to the Head of Sales & Marketing- Electronics and will work closely with the workshop team and the broader internal and external stakeholders.What equips you for the role:Degree/ Diploma in A/C and Refrigeration or Mechanical Engineering.\n3 to 5 years' experience of supervising AC installation jobs in Qatar. \nValid Qatar driving license.\nProficient in Arabic and English.\n We’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Doha, Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}