{
    "Job ID": "69872583",
    "Description": "Job Requisition ID #Position Overview\nWe are hiring a Technical Support Specialist to join our friendly team of tech enthusiasts assisting customers to get the best out of their Autodesk products. This position is for AMER ( 10:00 pm - 6:30 am) shift hours. We are primarily working from home now, but the ability to commute to this office is a requirement of the role.\nDo you enjoy solving problems and helping others? Are you passionate about customer experience? Are you familiar with other Autodesk Media and Entertainment (M&E) software such as ShotGrid, Maya, 3ds Max, Moxion, or Flame Family? Do you know our Automotive products, Alias and/or VRED? Willing to build off your foundational knowledge to become an M&E powerhouse?Using troubleshooting and communication skills, you will focus on solving issues our customers are encountering while using Moxion. You will properly analyze, document, and resolve issues, creating an outstanding customer experience and enhancing the team's knowledge. You will report to a Technical Support Manager and use good judgment, critical thinking, and independent decision-making when managing a caseload. Your customers will be international powerhouses in the film and TV industry, which brings a raft of interesting problems to solve. This means you’ll be tasked to challenge the status quo, think globally, and come up with world-class solutions.To be successful in this role, you will act with a sense of urgency to resolve customers’ problems, reflect a friendly and professional disposition during phone calls, chats and in writing, and provide follow up to communications ensuring that your suggestions are understood and applied appropriately by the customer. You must also be resourceful. No one has ever needed to say “let me google that for you.” In fact, you are often the one to do the Googling (but with a smile instead of snarkiness).About the TeamGlobal Product Support (GPS) is a dynamic team of product, industry, and workflow experts responsible for delivering exceptional support to all our customers. We provide technical guidance, analytics, thought leadership, and hands-on, root-cause problem resolution to help and inspire our customers to maximize the business value and adoption of their technology investments. GPS is part of our Customer Success organization.ResponsibilitiesProvide timely, friendly, and efficient assistance to Autodesk customers on a variety of issues and questions\n\nDocument problems and solutions in short and clear articles for our knowledgebase\n\nResearch, verify, and document product issues\n\nContinuous improvement through self-driven learning on software enhancements and features\n\nManage customer expectations by providing timely updates on progress\n\nActively address personal backlog of support requests\n\nContribute to the unassigned case backlog by taking cases proactively\n\nParticipate in team efforts to improve support delivery processes and strategies\n\nPrioritize support between our Standard, Premium, and Enterprise Priority support offeringsMinimum Qualifications2+ years of experience in software support\n\nStrong written and verbal English Language skills\n\nKnowledge of Windows and Mac OS\n\nStrong communicator and able to build relationship at all levels, taking initiative\n\nDemonstrated motivation to learn new skills and technologies\n\nStrong troubleshooting and analytical skills\n\nMust be flexible, decisive, self-motivated and proactive\n\nComfortable with ambiguity and working through change while driving results\n\nOpen to training and learning new content and software to better assist customers\n\nExcellent Team player, enjoying supporting and interacting with other members of a global, team with shared responsibilities\n\nAbility to work on-call shifts, including rotating weekend shiftsPreferred QualificationsKnowledge of QTake\n\nExperience in Information Technology or Computer Science\n\nKnowledge of the film and television industry, with experience in film production or post-production\n\nKnowledge of Autodesk Maya, 3ds Max, Motion Builder, Mudbox, Alias, VRED, Flame, ShotGrid, Moxion, and/or Arnold\n\nLanguage skills English, additional languages\n\nKnowledge of network setup and management in the scope of rendering, production coordination, and user management tasksThe Ideal CandidateCourage, the passion to be bold and brave in one’s actions to enable controlled risk taking, promoting provoking yet respectful questions thereby delivering strong results\n\nSpeed, we strive to be as efficient as our environment allows, empowering people to favor small sprints and course correction towards desired outcomes\n\nAccountability, clear and eager ownership of tasks and responsibilities which drives a defined and desired outcome\n\nSimplicity, have an approach and mindset to avoid unnecessary complexity and duplication; open to collaboration and desire to keep things simple to achieve quicker outcomes\n\nSolving system-wide, when problem solving, First seek to understand the entire picture by asking questions that remove silos and organizational barriers, followed by establishing a safe environment that supports cross-geo collaboration and communication to develop a shared vision\n\nFlexibility, the world of software is constantly evolving, and that is especially true in the M&E industry. In this role you will be expected to continuously evolve your skills and knowledge with the products as new features and strategies emerge (often driving your own learning experience as needed#LI-SV2Learn MoreAbout Autodesk\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.We take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.When you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!Salary transparencySalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.Diversity & Belonging\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belongingAre you an existing contractor or consultant with Autodesk?Please search for open jobs and apply internally (not on this external site).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}