{
    "Job ID": "69873056",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Workspace Experience EnablerWork DynamicsWhat this job involves:Overall RoleThis position is in its nature proactive and focused on the detail, to ensure workplace services are delivered to an agreed consistent standard to enable Occupant and Guest Experience based on requirements “works every time”, while maintaining safe working practices throughout all we do.The role actively ensures the day to day service delivery by the Workplace team and vendor partners, ensuring compliance to SOPs and SLAs. Importantly alignment must prevail with the Workplace Experience team to ensure service delivery to the ultimate target of creating Customer Delight, with agility of mind, and so service provision, to maintain this alignment.Transforming to the Workplace Team of the futureCommitment to deliver the best level of service every time through obsessive level of attention detail\n\nEnsures resets back to agreed format, including owning Clear Deck policy / Lost property process enactment and associated reporting to Workplace Experience team to allow for onward sharing with LOBs\n\nProactive checks to agreed schedule, reviewing ping reports from with a proportion after business hours so Occupants come back to refreshed and clean workplaceOperations ManagementFunctional operational control to deliver excellence every time\n\nImplement service tasks, procedures and policies and measure performance\n\nReview and spot-check suppliers/service providers performance to ensure contractual obligations are delivered\n\nUnderstand the operational & technical requirements of the site and ensure that current contracts are maintained to provide necessary supplies and services\n\nProvide comprehensive workplace management for the office premises\n\nImplement and manage the change control process\n\nResolve user's complaints and concerns with solutions and follow up\n\nBe able to resolve problems or improve operations\n\nImplementation of service task, procedures and policies\n\nPrepare risk assessments for self-delivery\n\nAssist with critical out-of-hours issues & participate as a key team member in responses to emergency situations\n\nReport building incident following with set escalation channels with measures and solutions\n\nResponsible for monitoring and managing staff performance with criteria set in Individual Performance Management\n\nCoordinate, manage and oversee vendors to perform a wide range of workplace-related services\n\nEnsure service deliverables meet SLAs and KPIs\n\nWork with all related parties on timely delivery of all services\n\nEnsuring up to date information on Client’s Property Services SharePoint\n\nWhen necessary raise risks to Workplace Experience Site Lead for further investigation\n\nContinuous Improvement implementation\n\nCost saving mind-set that drives value for service as every level\n\nConduct data analysis report when necessary\n\nSupport with critical out-of-hours issues & participate as a key team member in responses to emergency situations\n\nResets back to agreed format, including owning Clear Deck policy / Lost property process enactment and associated reporting to Workplace Experience team to allow for onward sharing with LOBs\n\nProactive checks to agreed schedule, reviewing ping reports from with a proportion after business hours so Occupants come back to refreshed and clean workplaceSound like you? To apply you need to have:Ideal ExperienceExcellent verbal and written communication skills\n\nA minimum of 3 years in the facility management industry/hospitality industry\n\nAn added benefit would be a Bachelor’s degree in facilities management, building, business or other related field; however, this is not a must.Other Personal CharacteristicsDetail focused and proactive in nature\n\nSelf-motivated\n\nExhibits honesty & trustworthiness\n\nOpen to new ideas & willing to challenge status quoWhat we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:Job Tags:If this job description resonates with you, we encourage you to apply, even if you don’t meet all the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500® company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}