{"Job ID": "69873447", "Description": "Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Jeff Bezos founded Amazon.com, Inc. in 1994 and launched it online in 1995. Amazon.com started as an online bookstore, but soon diversified, selling DVDs, CDs, MP3 downloads, computer software, video games, electronics, apparel, furniture, food, and toys. Amazon has established separate websites in Canada, the United Kingdom, Germany, France, Italy, Japan, China and India. Today, as a market leader in online retail, Amazon product lines include Amazon.com, A9.com, IMDb, Kindle, Amazon Web Services, Alexa.com, Audible.com, A2Z Development, Alexa Internet and Endless.com.\nHigh quality data is the foundation of building awesome user experiences. It powers unrivaled product discovery, informs customer buying decisions, offers a large selection and positions Amazon as the first stop for product discovery. Now take the world’s largest product catalog and imagine how you could influence the experience for millions of customers on the world’s largest e-commerce site.\nAmazon’s Global Catalog Operations (GCO) is looking for a customer and people focused Manager, Program Management to help us make the world’s best product catalog even better.\nAs a Manager, Program Management in the team, you will lead strategic initiatives to identify and eliminate defects within Amazon’s e-commerce platforms and product catalog. You will define metrics that capture long term success criteria and use data to identify new opportunities. You will work with business teams to define requirements and lead projects across functional organizations. You will define roadmaps and programs, collect requirements, write and present detailed data driven analysis, coordinate efforts to scope, schedule, and drive programs; as well as analyze cost/benefit of different decisions.\nKey job responsibilities\n· Interact with stakeholders at multiple levels and dynamically lead Operations and Program managers to define and deliver solutions to establish catalog experience standards and processes.\n· Identify and analyze data to isolate issues, develop solutions and prioritize opportunities for customer experience improvements.\n· Plan and manage parallel projects.\n· Maximize resources for the greater good of the organization.\n· Create, maintain and disseminate project information to stakeholders and senior management\n· Remain flexible to changing priorities, open to new ideas and have Associate experience as the top focus.\nLonger term, this leader will:\n· Be a visible and vocal role model across the wider business for Amazon’s customer-centric culture, championing catalog quality needs and using data and technology to anticipate and exceed them.\n· Ensure Catalog Quality programs effectively scale to meet the needs of the rapidly growing business, including identifying new ways to improve product catalog world wide.\nWe are open to hiring candidates to work out of one of the following locations:\nChennai, TN, IND\n- 7+ years of cross functional project delivery experience\n- 7+ years of program or project management experience\n- 7+ years of working cross functionally with tech and non-tech teams experience\n- Experience defining program requirements and using data and metrics to determine improvements\n- Experience managing teams\n- Experience managing, analyzing and communicating results to senior leadershipJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}