{
    "Job ID": "69876014",
    "Description": "Get To Know AimFit:Empowering women is at the heart of everything we do. We know in our culture that women, as primary caregivers and nurturers, put their own health on the back seat to look after others. All evidence clearly points out that a health-conscious matriarch is better for the family, society, and economy. The barriers to women adopting a healthy lifestyle are real though – an absence of information, motivation, skills, spouse & family support, accessibility to places for physical activity, cost-effective services, and free time are real challenges. This is where AimFit comes in, AimFit is a fitness platform for women with a mission to make 110 million women in Pakistan the fittest in the world and change the future of our nation. We produce and distribute hyper-localized fitness content through our app and web products, targeting women and aim for our users to get hooked onto them.We raised our Seed funding round of 1 million USD in Sept 2020. You can read more about it here: https://www.menabytes.com/aimfit-seedWe are hiring to expand our product engineering team. Our tech team is currently small but growing fast so stakeholders joining now can expect to have a huge contribution towards the business and enjoy significant positions and stake in the company as we grow!Key Responsibilities:Business Analysis: Conduct in-depth business analysis to identify trends, opportunities, and potential risks. The candidate must be able to understand the end to end customer journey and recognise business blockers. \n\nData Analysis: Collect and analyze data to inform business decisions and strategies.\n\nProcess Improvement: Identify areas for unblocking the business funnel (improving lead generation and conversion rates) and work with cross-functional teams to implement changes.\n\nBusiness Documentation: Create and maintain documentation for business processes, workflows, and best practices.\n\nReporting: Generate and present regular data reports to management, highlighting key performance indicators and trends.\n\nCross-functional Coordination: Collaborate with different departments, including sales, marketing, and engineering, to achieve business objectives.\n\nWorkflow Automation: Proficiency in workflow automation tools and techniques is a plus to streamline and optimize business processes.\n\nProduct and QA Testing: Experience with understanding product and quality assurance (QA) testing of the app is extremely desirable.Qualifications:Bachelor's degree in Business Administration, Management Science, Data Analytics or a quantitative field. \n\nA related field (Master's degree is a plus).\n\n2-3 years of experience in a business analyst or data product manager role.\n\nStrong analytical and problem-solving skills.\n\nExcellent communication and interpersonal abilities.\n\nProficiency in data analysis and reporting tools.\n\nProject management skills and the ability to manage multiple tasks simultaneously.\n\nAttention to detail and a commitment to accuracy.\n\nSelf-motivated and results-oriented with a strong work ethic.Technical Skills:SQL: Proficiency in SQL for data querying and analysis.\n\nExcel: Must be able to do analysis using pivot tables.\n\nData Visualization: Experience with data visualization software such as Looker Studio and Metabase.Good to have skills:Workflow Automation: Familiarity with workflow automation tools and techniques is a plus.\n\nCRM:  Some experience with CRM tools such as Pipedrive, Salesforce is a plus. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}