{
    "Job ID": "69873367",
    "Description": "About Jumeirah & the Hotel:Jumeirah Group, a member of Dubai Holding, has been making a distinguished impact on the global hospitality market for more than two decades with its Stay Different™ brand promise.Its award-winning destinations, such as the iconic Burj Al Arab Jumeirah, position service beyond expectations, elevated dining destinations and surprising architecture and design at the heart of every guest experience.Today, Jumeirah operates a world-class portfolio of 23 properties across the Middle East, Europe and Asia and employs over 8,000 colleagues, representing over 106 nationalities.As Jumeirah continues to expand its global portfolio and scales up its operations to the next level of growth, it remains fully committed to developing and empowering our colleagues to excel in world class environments.Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity.Jumeirah Bahrain Gulf Resort and Spa is an idyllic getaway situated majestically on the shores of the Gulf and takes its architectural inspiration from the gentle movements of the sea. The resort’s cluster of villas and elegantly designed rooms, along with the award-winning Talise Spa, offers a sanctuary for travelers looking to recharge and embark on a journey for wellbeing. Bahrain presents itself as a destination for the ultimate Middle Eastern experience, with its rich heritage of beautiful forts and charming bazaars blending perfectly with an inspirational vision for the future. The resort harmonises Jumeirah’s promise of unparalleled hospitality with the wonder of the destination, providing a true beachside escape in the heart of culture. Set to exceed all guest expectations, the resort and spa is an oasis for nature-loving friends, families and couples hoping to disconnect from the chaos of everyday life.About the Job:An opportunity has arisen for a Team Leader – Food & Beverage role to join Jumeirah Gulf of Bahrain Resort & Spa Family. The main duties and responsibilities of this role:Developing and maintaining an elegantly appointed environment, with superior colleagues, dedicated to an attentive, distinctive experience for all dining periods.\nMaintaining a friendly yet unobtrusive manner with all guests.\nBeing able to control reservations and seating of the outlet.\nBeing able to control usage of all food and beverage items and appropriate usage of equipment, tools and service equipment.\nAssisting in preparing staff schedules, which allow for appropriate service while controlling overtime.\nPromoting teamwork and foster a harmonious working climate.About You:The ideal candidate for this position will have the following experience and qualifications:Hotel School Degree or Diploma\nA minimum of 3 years’ food & beverage experience\nMulti-Culture environment experience\nWorking in 5-star international luxury environmentAbout the Benefits:We offer an attractive tax-free salary, paid in Bahraini Dinar (BHD), the local currency of Bahrain. In addition, we offer reduced hotel rates across our properties globally, excellent leave and health care package, flights home, accommodation allowance, life insurance, 50% discount off Jumeirah F&B Outlets and reduced hotel rates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}