{"Job ID": "69873460", "Description": "Job Title : Team Leader-Sales Support Center , BangaloreNo. of Vacancies: 1Job ID  : R0059083Location : BangaloreFull time /Part Time : Full timeRegular /Temporary : RegularSANDVIK COROMANT is the world’s leading supplier of tools, tooling solutions and know-how to the metalworking industry. With extensive investments in research and development we create unique innovations and set new productivity standards together with our customers. These include the world's major automotive, aerospace and energy industries. Sandvik Coromant has 8,000 employees and is represented in 130 countries. We are part of the business area Sandvik Machining Solutions within the global industrial group Sandvik.At Sandvik Coromant, we are driven by a passion for excellence in everything we do. Our belief is that sustainable success is a team effort and with our profound knowledge of metal cutting and insight into the varying challenges of different industries, we strive to develop innovative solutions in collaboration with our customers, to meet both current and future demands.We are seeking for people who are passionate in their work and possess the drive to excel to join us.Scope:To manage the daily 1st line operations (enquiry to delivery) and tasks of Sales Support and Order Entry Associates, to serve the direct customers and channel partners via Sales. To lead and manage all the people related administration within the team and ensure continuous improvement with making best use of resources, technology / e-commerce and improving the overall “Customer Experience” in a pro-active way.Roles & Responsibilities :Lead and manage the 1st line Sales Support Associates, Order Entry Associates and activities within the Sales Support Center.\n\nChange management and organizational development to support the growth of efficiency and effectiveness of 1st line team since it is created till it reaches the full capacity and stable setup\n\nDevelop team and manage people related administration in line with strategy and company guidelines\n\nBe operational and hands-on to manage Sales Support team activities, focusing on increased automation, increased customer satisfaction and improved operational efficiency.\n\nStimulate and encourage an environment in which continuous improvement, customer experience and innovation are sought and nurtured\n\nResponsible and accountable for front line Enquiry to Delivery activities including; enquiries, orders, returns, test tooling, recycling, services, A/R queries, credits / debits, price changes, customer complaint registration.\n\nEnsure the team make full efficient use of standard IT and global platforms for quotations, orders, quality and services which includes EBP, CRM, TIBP, B2B, mobility etc to serve customers\n\nDrive, communicate and follow up on local KPI’s aligned with Customer Services objectives and the SA Operations Purposes\n\nParticipate and attend Sales Support Center meetings as required\n\nManage Annual Performance Management and Development Review (PDR) process for direct reports (manage high / low performers, Talent & Succession planning for key positions)\n\nEstablish APP targets for all direct reports (in line with Sales Support Function and SA cascading)\n\nProactively drive a Sandvik Safety First culture in all business dealings\n\nProactively drive and apply Sandvik Core Values in all business and personal dealingsREQUIRED COMPETENCIESDynamic and self-motivated customer-oriented approach.\n\nPassion for customer service exhibited by courteous telephone etiquette, empathy, patience and professionalism.\n\nFlexibility is working in shifts on 24/5 business support environment.\n\nExcellent multi-task skills focused on various communication methods with multiple customers and stakeholders Experience and skills within ERP system SAP, Microsoft Office 365.\n\nCapable of working in a demanding environment (high stress tolerance) High level of communication across all mediums.\n\nStrong attention to customer experience and commitment to quality customer service\n\nProficient in written/verbal English communication skills. Additional proficiency in other language is valued.\n\nBe persuasive and have good interpersonal skills\n\nBe a self-starter with a positive mind-set and solution orientated In addition, the employee may be assigned other duties within the area of their competence.EXPERIENCE5-8 years of experience as customer service roleThis position reports to Sales Support Manager, BangaloreBenefitsSandvik offers a competitive total compensation package including comprehensive benefits. In addition, we provide opportunities for professional competence development and training, as well as opportunities for career advancement.How to applyYou may upload your updated profile in Workday system through your ESS login, no later than September 29, 2023.OrPlease send your application by registering on our site www.sandvik.com/career and uploading your CV against JO Requisition no. R0059083 September 29, 2023.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}