{"Job ID": "69873839", "Description": "The future is what we make it.When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future.That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars.Working at Honeywell isn’t just about developing cool things. That’s why all our employees enjoy access to dynamic career opportunities across different fields and industries.Are you ready to help us make the future?We have an opportunity for a Projects Closing Out Manager to join our Honeywell Building Technologies Team in Riyadh, Saudi.We are looking for Projects Closing Out Manager who will be responsible for the successful delivery of their assigned projects as well as closeout of legacy projects.This requires preparing, planning, executing, and controlling all aspects of the project either directly or through delegation with the project teamProjects Closing Out Manager ResponsibilitiesEnsure a safe working environment on site for all employees, subcontractors, suppliers, Clients and visitors. Lead the achievement of company and Global Major Project safety targets and zero tolerance of unsafe working practices and occurrences.\nThe successful candidate will also be responsible for closeout of Running and legacy projects, including ensuring that all contractual scope of work has been completed and all project management processes have been executed, obtain formal recognition of the project completion by all stakeholders and handover.\nManage all administrative closeout aspects of the project including capturing lessons learned, releasing project resources, retrieving performance bonds, financial closeout and transitioning all project deliverables to customer organization.\nProvide technical guidance to the site and resolve critical site issues.\nCoordinate and provide supervision the project managers to ensure close the projects, that are technical closed, ensure we fulfill all the contractual obligations, retrieve our bonds, close legally and get the cash and retention.\nImplement the company and Global Major Projects QA/QC procedures and ensure works meet quality standards and specifications.\nAssess progress, productivity, commercial performance and implement action for improvement pre-emptively.\nWork with the planning team to develop detailed and accurate work schedules, daily and weekly metrics and reporting data.\nEnsure the keeping of accurate and up-to-date daily records of site progress and key issues through site diaries.\nProvide input on all GMP-related VO’s and contractual claims ensuring that the construction-related substantiation in notifications and follow-up is clearly defined, accurate and demonstrable.\nEnsure the physical completion of works packages in all respects to facilitate handover and acceptance.\nFollow up and track all Retention and Defects Liability Period punch-lists/snags to ensure close out of work packages and release of retention monies.\nDeploy standard methodologies in the delivery and control of projects. Ensure use of Honeywell project processes and tools\nManage effective communications with all project stakeholders.\nManage the contractual requirements of the project to ensure Honeywell’s risk exposure is minimized and controlled through timely responses and internal escalation.\nDevising and implementing risk management programs and ensure proactive risk mitigation strategies are implemented and communicating these to management on a regular basis\nCoordination and control of the change management process both technical and commercial.\nEnsure all deliverables must be accepted by the customer and stakeholders before the project can be officially closed.\nGathering, organizing, storing, and preserving project documents for future reference. Documentation includes all the information gathered from the beginning of the project to its completion; this could include but is not limited to meeting minutes, cost tracking records, design specifications, risk management reports, and issue logs.\nHaving an accurate document trail provides helpful insights into what went right or wrong with a particular project and serves as a valuable basis for making improvements in future projects.\nAllows the project team to analyze and review the overall success of the project in order to determine what worked, what didn’t work, and any lessons learned. It also helps stakeholders to understand where their investment has gone, as well as provide feedback for future projects.\nConduct Post-project evaluations including surveys, interviews with key personnel, and provide comprehensive report detailing successes, failures, and recommendations for improvement.\nDevelop a processes such as closing out open tasks and handing over completed deliverables; archiving project documentation; revisiting budgeting procedures; updating policies etc.,\nEnsure that all obligations have been fulfilled. This includes contractual obligations for payment of any fees associated with the project, compliance with regulatory requirements, acceptance of deliverables from third-party vendors, and other matters related to the closure of a project.Qualifications and ExperienceBachelor’s degree in electrical engineering, ELV Systems, Information Technology (Preferred).\nTertiary qualifications in Project Management are preferred.\nFurther education in management or project management would also be advantageous.\nProven experience in project management including budget ownership/management, resource allocation, scheduling, forecasting, and planning on large scale ICT / ELV related projects in excess of $25 - 100M\nProven experience in closing out large scale projects, including projects with complex scope, variations and requiring contractual negotiations.\nDemonstrated leadership experience in the directing and managing of specialist multi-skilled technical and professional staff within a diverse and complex project environment. Building/construction experience preferred.\nDemonstrated experience in safety and safety management on large commercial and infrastructure projects\nCommitment to the development of junior or less experienced staff in the project team\nProven ability to develop and lead a team\nCapacity to deliver against multiple and competing objectives.\nDemonstrable customer relation skill\nProven commercial/contractual acumen\nDemonstrated experience and working knowledge of the application of ICT design principles for business and IT system projects.\nProven ability to negotiate, engage, monitor, and manage ICT / ELV contractors.We offerHoneywell offers employees the opportunity to work on the world’s most exciting projects, transforming the cities we live in, the buildings where we work, and the vehicles that move us. \nGroup medical insurance plan Life.\nPaid annual leave and time off work.\nA culture that fosters inclusion, diversity and innovation.\nMarket specific training and on-going personal development.If this is your dream role, then we'd love to hear from you.We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability statusJOB ID: HRD208155\nCategory: Engineering\nLocation: 3rd Floor, Olaya Tower A,Riyadh,AL RIYADH,Saudi Arabia\nExemptJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}