{
    "Job ID": "69875793",
    "Description": "Property Finder is the leading digital real estate platform in the Middle East and North Africa region. A UAE-born startup, Property Finder expanded its operations to Qatar, Bahrain, Saudi Arabia, and Egypt over the years. Recently, it acquired a significant stake in Zingat in Turkey. The company is one of the largest technology start-ups in the region and on a journey to becoming a Unicorn. We are aspiring to create a lighthouse technology company which will have a lasting impact in the entire tech ecosystem in our geography.&nbsp;Position summaryThis role is one of the key positions of the Engineering leadership team driving the development of our tech calibre and with key involvement in management &amp; delivery of products at Property Finder. Within the tribe and squad structure the position will be a leader of one or more squads located in an international environment (mainly Dubai and Istanbul) to deliver the best product to our customers.&nbsp;This engineering position will lead our consumer experience initiatives working closely with our Product, Data &amp; Marketing teams. Campaign management and marketing automation is at the core of this squad's domain.The position is a key leader in our engineering organization guiding our tech talent in terms of engineering excellence practices, solution designs as well as coaching for professional growth.Key Responsibilities:Work with Business Stakeholders, Product Managers in order to shape priorities and technical roadmap\nSprint planning, execution, stakeholder management\nMentor team members, jointly develop &amp; execute professional growth plan\nLeadership &amp; guidance on system design and architecture\nTechnical hands-on leadership (i.e. PR reviews, PoC and prototyping etc.)&nbsp;Tech StackNote that we value most the system design knowledge with a product oriented mindset rather than a specific programming language knowledge.Still though, for reference, our current stack consists of; Golang, PHP, Javascript (Node.js - Next.js), React, MongoDB, MySQL, AWS: Kubernetes, Docker, Jenkins. We are also reducing our PHP landscape as part of our tech transformation efforts.Essential experience8+ years of software development experience\n3+ years of team leadership experience\nHands-on technology leader\nCloud-Native stack and AWS know-how\nExperience in Web development &amp; API integrations\nGood problem solving and analytical skills\nGood communication skills with speaking-level EnglishOther CapabilitiesSolution design, not necessarily custom development for all needs and utilizing commodity &amp; cloud solutions\nExpertise in service oriented architecture and domain driven design\nExpertise in frontend development technologies\nExposure to NoSQL like MongoDB\nCustomer focused and forming data-driven decisions\nProactive in ensuring product reliability, improving customer experience\nExperience in Classifieds industry is a big plusProperty Finder PrinciplesMove fast and make things\nData beats opinions\nDon’t confuse motion with progress\nFailure is success if we learn from it\nPeople over pixels&nbsp;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}