{
    "Job ID": "69873309",
    "Description": "IntroductionYour Role and ResponsibilitiesWe are currently seeking an experienced Cloud Solution Architect for Managed Services to support our clients.Some of the responsibilities for the Cloud Solution Architect:Leads or performs the installation and/or management of the physical or operational elements of the system, including network management, operating system, application platforms, and database components.\nProvides in-depth knowledge of the IBM Cloud, Azure or AWS Ecosystem and evaluates the customer’s business and technical requirements as a trusted advisor.\nDevelops Cloud architectural designs that includes – IaaS, Networking, App Services, Databases, and Authentication/Access Management etc.\nProvides documentation of the technical design which express what actions a solution must take and what outcome is expected\nConducts technical proof of concepts for first of a kind, unknown, or complex situations.\nConduct customer workshop, capability demonstration, proof of concept of offering etc.\nParticipates in business development activities, from opportunity identification, qualification, scoping, solutioning, proposal writing, orals presentations and demonstrations.\nUnderstands the relationship the delivery of cloud services plays in client success and takes pride in being a trusted advisor.\nProject Management and leadership skills and ability to lead technical cloud delivery projects from beginning to end.Required Technical and Professional Expertise4+ years’ experience with Cloud Security, Data privacy and Threat protection\nExperience delivering cloud projects (IBM, AWS, and/or Azure) and the DevSecOps pipeline\nExperience with NIST, PCI DSS, HIPAA, and ISO27K cloud security compliance standards\n4+ years’ experience in an architectural leadership role, with proven ability of defining and documenting security policies and proceduresPreferred Technical and Professional ExpertiseNoneJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gurgaon, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}