{
    "Job ID": "69873100",
    "Description": "The Technology Lead Business Analyst is a senior-level position responsible for liaising between business users and technologists to exchange information in a concise, logical and understandable way in coordination with the Technology team. The overall objective of this role is to contribute to continuous iterative exploration and investigation of business performance and other measures to gain insight and drive business planning.\nResponsibilities:Develop creative technical solutions to meet business needs and manage complex, high volume applications in partnership with business partners and stakeholders\nManage multiple work stream and applications across geographies for Credit Initiation and Onboarding\nContribute to formulation of strategies/processes for Product Road map, Development and Governance and contribute to defining standards and new automation initiatives\nDevelop communication to guide, influence and convince others, including colleagues in other areas and external customers\nProvide advice and counsel related to the technology or operations of the business and filter, prioritize and validate potentially complex material from multiple sources\nSupervise day-to-day staff management issues, including resource management, work allocation, mentoring of onsite and offsite resources and other duties and functions as assigned\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:6-10 years of experience in business analysis or systems analysis\nDemonstrated expertise in presenting and using planning tools\nProven diplomatic and analytical skills\nProven ability to manage complex and variable issues with substantial potential impact by weighing various action plans and balancing potentially conflicting needsEducation:Bachelor's degree/University degree or equivalent experience\nMaster's degree preferred-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}