{
    "Job ID": "69873792",
    "Description": "You Lead the Way. We’ve Got Your Back.With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.Join Team Amex and let's lead the way together.How will you make an impact in this role?The Operational Excellence organization operates within Global Commercial Services (GCS) and serves as the first line of defense to strengthen the risk and compliance program. One piece of the overall responsibility of Operational Excellence is Issue Management, which is responsible for timely and accurate management and resolution of all Operational Risk Events and Corrective Actions related to GCS.The GCS Issue Management team is responsible for the end-to-end oversight, management and resolution of Operational Risk Event and Corrective Actions arising within our organization. Our mission is to transform the issue management program by providing insights which will drive process improvements, improve process efficiencies, and influence investment decisions, while strengthening the control environment; meeting regulatory requirements; enabling and supporting growth; and ensuring flawless customer experience.Responsibilities:Drive Operational Risk Events (ORE) and Corrective Action (CAP) projects to resolution on time\nSupport team in performing detailed analysis of issues to discover the root cause of problems to identify and implement appropriate solutions\nProvide regular status update to leaders, including the identification and escalation of risks and issues\nPartner with key stakeholders to implement sustainable solutions and controls as part of the Control Enhancement phase to eliminate issue reoccurrence\nSupport in driving the investigation of issues related to the data flow among multiple technology systems with different owners\nPartner closely with key stakeholders such as Compliance, Operational Risk Governance Group (ORGG), GCS Business, US Banks, Credit Fraud Risk (CFR), Global Servicing Group (GSG) and Technology to ensure timely and high-quality resolution for owned issues\nUnderstanding of regulatory rules and remediation processes to support critical scope discussions and drive decisions\nUnder supervision of Manager, perform ad-hoc development of reports, visualization, data manipulation or data cleanse activitiesMinimum Qualifications:Demonstrated project management ability to drive projects and tasks to successful completion (on time, on budget and high quality)\nCapable of applying critical thinking to solve problems in a structured way to develop and/or implement solutions\nDemonstrated ability in data analysis and visualization skills (e.g., Excel, Tableau)\nExperience with coding or scripting (e.g., Python)\nA background in Financial Services (i.e., Commercial Business, B2B) a plus\nStrong verbal and written communication skills\nComfortable with ambiguity and unstructured problem-solving\nAbility to manage multiple priorities under pressure, meet tight deadlines, take initiative and act decisively\nMust be willing to be flexible with your work arrangements if needed to meet issue milestones\nHave a ‘customer-centric’ attitude and basic skills in analyzing existing processes and implement process improvements\nKnowledge of Operational Risk Events and Corrective Actions a plusWe back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:Competitive base salaries \nBonus incentives \nSupport for financial-well-being and retirement \nComprehensive medical, dental, vision, life insurance, and disability benefits (depending on location) \nFlexible working model with hybrid, onsite or virtual arrangements depending on role and business need \nGenerous paid parental leave policies (depending on your location) \nFree access to global on-site wellness centers staffed with nurses and doctors (depending on location) \nFree and confidential counseling support through our Healthy Minds program \nCareer development and training opportunitiesAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.  Offer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}