{"Job ID": "69873291", "Description": "Believe is one of the world’s leading digital music companies. Believe’s mission is to develop local artists and labels in the digital ecosystem by providing them the solutions they need to grow their audience at each stage of their career and development.Its 1,610 employees in more than 50 countries aim to support local artists and labels with a unique digital expertise, respect, fairness, and transparency.To support our fast-growing presence on all continents, we are constantly looking for new Believers to join us and make a stronger and more positive impact on the music industry!Believe is listed on compartment A of the regulated market of Euronext Paris (Ticker: BLV, ISIN: FR0014003FE9).www.believe.comReady to #setthetone with Believe?As part of its Content Operations business, Believe's TuneCore Service is currently looking for a Content Quality Senior Administrator of TuneCore for India. Working within our international Content team, the candidate will perform the following tasks, both internationally and for the local market, specifically focusing on music content of TuneCore which includes:Ensure Quality checks for all responses of tickets (mails and responses) to the TuneCore artists which is done via Zendesk software.\nEnsure to improve the Ticket satisfaction score and rating that is done for the artists.\nEnsure proper coordination with the central team of Believe and TuneCore for the release validation process.\nEnsure on time customer support for all the client in TC with relevant solutions following the SLA.\nResearch and find patterns to prevent unsatisfied rating and activity of Zendesk ticketed replies to the artists.\nInvestigate potential occurrences of unsatisfied tickets and activity and report to management.\nProvide reporting on customer and product issues.In addition to it, Believe's TuneCore Service's mission is to offer cutting-edge distribution and publishing technologies, innovative artist tools and best-in-class services that empower artists, labels, and managers to reach worldwide audiences, maximize their music sales revenue and access the tools they need to grow and sustain their careers without surrendering their independenceBachelor's Degree\nKeen interest in music industry, new technologies, digital music platforms etc.\nShould have been mandatorily working on Zendesk with minimum of 2-3 years.\nGood communication skills\nExperienced in Customer support and reporting.\nProactive and willing to improve process and tools.\nOrganized, reliable and independent.\nMotivated and curious, you know how to prioritize the work given.\nTeam spirit\nProficient using Microsoft Office\nFluency in English is mandatory, both written and spoken\nStrong attention to detail\nUnderstand the importance of good customer service.\nExtensive music knowledge (US & International) and/or a willingness to keep up to date with current music. Benefits @Believe:#Flexibility - Just punch in leaves, not intime and out time#Office perks - a game of foosball, table tennis to bat the afternoon lackluster, free event pass for exclusive and limited shows, music subscription, etc#Wellbeing - Caring by EUTELMED, professionals are at your disposal for advice and support, in your own language and culture#Transperancy – engaged in secondary activity just disclose it to us#Compensation – Tailor made flexi pay plan for tax saving#Sustainability - You can be a part of CSR program, represent yourself as a #shaper and contribute to a better future.Disclosure:Believe strongly promotes equal treatment regardless of race, ethnicity, nationality, gender, sexual orientation, socio-economic status, age, marital or civil partner status, pregnancy or maternity, physical abilities, religious beliefs, political beliefs, or other ideologies.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}