{"Job ID": "69873030", "Description": "Our breakthroughs would not make it to the hands of patients without our pharmaceutical manufacturing team. We rely on a team of dedicated and agile members, who understand the importance and impact of their role in Pfizer’s mission. Patients need colleagues like you who take pride in their work and always look to improve outcomes. You will help to ensure that patients and physicians have the medicines they need, when they need them.Your expertise in the manufacturing domain will help Pfizer with the operations required for the assembly and packaging of finished goods. You will manage product finishing scheduling, setting up, operating, maintaining, and adjusting processes or packaging equipment. You will be a team member who is relied to have a good understanding of procedures, techniques, tools, materials and equipment. Your decision making will help you prioritize workflows based on the available resources.You will follow standard procedures to complete tasks, some of which may vary in scope, sequence, complexity and timing. You will contribute to the team’s success by sharing your previously acquired knowledge. You will be relied upon to maximize quality and efficiency; completing batch records and associated documentation, and working in an integrated computerized manufacturing environment.It is your hard work and focus that will help in making Pfizer ready to achieve new milestones and help patients across the globe.Manage own time, professional development, prioritize work-flows and be accountable for own results.\nAct as a skilled Packaging Operations Technician within {Current} Good Manufacturing Practices {part of GxP} regulated areas in the Packaging facility, reporting to the Packaging Team Leader.\nOperate the appropriate assembly/packaging equipment per Standard Operating Procedures and Batch Records.\nEnsures equipment is operational when returned after maintenance, and maintenance log is completed and accurate.\nWork effectively within a team with moderate supervision, at times working cross functionally.\nAble to perform calculations for percent accountabilities, reconciliation of numerical values.\nMonitor, evaluate and adjust processes or packaging equipment to maximize quality and efficiency.\nConduct primary packaging process both in pilot/study and commercial lots that meet product specification as per approved Packaging Instruction and/or protocol.\nPerform all manual packaging and inspection duties as required by operating unit.High School Diploma or GED\n2+ years’ experience\nExperience of related experience and/or training\nMath and reading skills required for Standard Operating Procedure, Good Manufacturing Practices {also cGMP} and Batch Record comprehension\nAbility to understand and carry out instructions furnished in written, oral or diagram form\nSelf-motivated and willing to learn new and changing responsibilities\nAbility to contribute to department success in a team environment and perform tasks at a productive level under demanding conditionsBachelor's DegreePfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}