{
    "Job ID": "69870478",
    "Description": "Devexperts has been working for nearly two decades consulting and developing for the financial industry. We solve complex technological challenges facing the most well-respected financial institutions worldwide.By becoming a part of Devexperts, you’ll become a part of a company that fosters self-improvement and actively seeks out-of-the-box ideas. Our teams work together to create the next generation of financial software solutions. We welcome all candidates who believe, as we do, that innovation is grounded in education.We're building next generation trading platform for US market. Now we're looking for experienced accessibility testing specialists to join our distributed european team.What we expect you to know:Responsibilities:Collaborating closely with internal teams to review concepts, wireframes, designs, and copy from an accessibility standpoint\nDeveloping test strategies based on requirements and schedule;\nCompiling detailed reports that highlight accessibility issues and their potential implications.What we expect you to have:Deep empathy for human beings\nUnderstanding of the diverse range of assistive technologies utilised by individuals with disabilities\nExpertise on modern standards (WCAG and mobile guidelines)\nFamiliarity with various accessibility tools (JAWS, NVDA, iOS VoiceOver, Android TalkBack) and standards such as WAI-ARIA\nHands-on experience conducting accessibility audit for web, including quality assurance, usability and inclusive designWhat could be a big plus:FinTech testing or stock/futures trading experience\naXe automated tools experience\nCI/CD hands on experienceDevexperts employees create the art of FinTech in comfortable working spaces located in modern business centers around the world.\n\nJoin our team in Istanbul and enjoy:sport compensation\nmedical Insurance\nmeal cards\nfree snacks in the office\nmodern well-equipped office in the scientific R&D area\ncorporate events and teambuildings\nprofessional certifications\ninternal Referral Program\ninternal education and mentorship program\nEnglish coursesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}