{
    "Job ID": "69873763",
    "Description": "Data Science (Data Scientist)X Labs is hiring for a Data Science professional who is passionate to work in the area of financial services (credit risk) business. Ever dreamed of working with 2-5 trillion records / day on a 200+ petabyte base?Want to improve experience of ~400 million consumers using machine learning?Do you want to work with one of world’s largest telco and India’s top brand?If so, we would like you to join us on an exciting journey to create significant impact using data. The mission of the Data Science team is to transform terabytes of data into robust models for personalization and discovery. See why we call it India’s Best Data Challenge: http://bit.ly/IndiasBestDataJobYour work will directly impact the way millions of Indians use our Digital offerings. We would like you to join us on an exciting journey to create advanced ML products.ResponsibilitiesWork on complex business problems related to underwriting and risk.\nEnd to end development and testing of the solutions as per the requirements.\nDesign, run and analyze A/B and multivariate hypothesis tests aimed at optimizing customer experience, business KPIs and product funnels.\nBe involved in technology research, capability building across newer technologies and tools in Machine Learning ecosystem at scale.Qualifications – As a successful applicant, you should have:B.Tech or MS in Computer Science / Statistics / Applied Mathematics.\nDeep understanding of Statistical Analysis, Modeling and Machine Learning algorithms.\n3 to 6 years of experience with machine learning model development in credit risk and underwriting. Experience in designing and deploying ML modeling and prediction pipelines.\nGood command over Python, Tensorflow/PyTorch, PySpark.\nStrong coding skills with the ability to write high-performance code in Python/Julia/C++.\nMust be fluent with SQL and Hive.\nAbility to contribute to multiple projects simultaneously and work in a fast-paced, collaborative and iterative environment.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}