{
    "Job ID": "69876131",
    "Description": "Nisum is a leading global digital commerce firm headquartered in California, with services spanning digital strategy and transformation, insights and analytics, blockchain, business agility, and custom software development. Founded in 2000 with the customer-centric motto “Building Success Together®,” Nisum has grown to over 1,800 professionals across the United States, Chile,Colombia, India, Pakistan and Canada. A preferred advisor to leading Fortune 500 brands, Nisum enables clients to achieve direct business growth by building the advanced technology they need to reach end customers in today’s world, with immersive and seamless experiences across digital and physical channels.What You'll DoShould be able to develop an application with any Javascript framework React.\nMaintain reusable code and improve code quality.\nOptimize application for maximum speed.\nShould be an individual contributor role. (SME)\nShould take ownership and work closely with other teams. such as the back end.\nMake suggestions for better solutions to problems and keep abreast of the latest and emerging technologies.\nBe comfortable working throughout the lifespan of a project.What You KnowShould have a minimum of 5-8 years of experience.\nExtensive knowledge in ReactJS, JS, CSS, HTML, Django framework\nShould be proficient in the framework ReactJs.\nHaving knowledge about any Digital Asset management tool\nWoking knowledge about any RDBMS (Preferablly SQL Server or Postgress\nGood to have experience in web component development.\nGood understanding of Responsive Web Designing, CSS media queries, and Bootstrap library.\nUnderstanding of cross-browser compatibility issues and ways to work around them.\nGood understanding of OOJS.\nKnowledge of code versioning tools, such as GIT.\nKnowledge in writing UI test cases using any test framework.\nGood in Agile concepts\nShould be a team playerEducationCS degree or equivalent experienceBenefitsIn addition to competitive salaries and benefits packages, Nisum India offers its employees some unique and fun extras:\nContinuous Learning - Year-round training sessions are offered as part of skill enhancement certifications sponsored by the company on an as need basis. We support our team to excel in their field.\nParental Medical Insurance - Nisum believes our team is the heart of our business and we want to make sure to take care of the heart of theirs. We offer opt-in parental medical insurance in addition to our medical benefits.\nActivities -From the Nisum Premier League's cricket tournaments to hosted Hack-a-thon, Nisum employees can participate in a variety of team building activities such as skits, dances performance in addition to festival celebrations.\nFree Meals - Free snacks and dinner is provided on a daily basis, in addition to subsidized lunch.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}