{
    "Job ID": "69875846",
    "Description": "Working at Boskalis is about creating new horizons and sustainable solutions. In a world where population growth, an increase of global trade, demand for (new) energy and climate change are driving forces, we challenge you to make your mark in finding innovative and relevant solutions for complex infrastructural and marine projects.\n\nWithin a vibrant company culture, you will be working as part of a diverse, international team of experts. We offer you the opportunity to realize your full personal potential and expand your professional career by creating new horizons. Together!You will make your mark as accountant at our Abu Dhabi branch office. You will be part of our finance shared service centre (FSSC), Supporting Administration worldwide in the various area of Accounts.\nYou will be working from our Abu Dhabi office and will be part of our Abu Dhabi finance team, consisting of around 50 people from different backgrounds. You will be involved in processes from record to record, procurement to pay, master data and other general finance related tasks.\n\nYour responsibilities as an Accountant areAssisting projects worldwide by providing finance support.\nManaging all financial transactions, from record to report.\nInvoice processing, checking, and cost coding.\nLiaise with various business units and project sites to providing continuous support.\nMaking specifications, reconciliations, and analysis on various aspects in the accounts.\nMonthly or quarterly management reporting.Your qualities\nYou can make your mark as accountant if you have:At least 2 years’ relevant work experience, preferably in a multinational company, multicultural environment.\nA bachelor’s degree in finance or accounting, a masters degree is preferred.\nExcellent communication skills in English both written and verbal.\nAn organized and analytical way of working.\nExperience in Enterprise Resource Planning Software (preferred Infor LN, Basware & Vena).\nStrong analytical skills and able to analysis work processes and suggest improvements.\nProactive in suggesting changes for improvement and confident to speak up to management if necessary.\nAmbition to develop into controller role within short time.What you can expectCareer opportunities: We challenge you every day to get better. Together we realize your full personal and professional career by creating development opportunities.\nWarm welcome: We warmly welcome our new colleagues, so they feel at home as soon as possible. During your online onboarding program, we give you all the ins and outs of Boskalis!Extra informationYour team: You will be part of the FSSC Abu Dhabi team, and you will also work closely together with the head office corporate finance team and the project team.\nWhere you will work: You will work from our beautiful office in Abu Dhabi.Fulltime/ part- time job: The position of accountant is a fulltime job.\nProcedure: All you need to do to apply for a job is to complete the online application form and send it to us along with your CV and cover letter. As soon as you have sent your application, you will receive a confirmation email. Depending on the job, we will invite you for two or more interviews via Microsoft Teams or at our office. If both sides are happy to proceed after interviews, we will make you an offer to join Boskalis. After successfully completing all the steps in the procedure, we warmly welcome you to our organization.Want to know more?We are more than happy to answer your questions about the position of Accountant. Please contact Arshad Asharaf, corporate recruiter via our career page.\n\nInterested? Please apply before the 18th of September.Disclaimer for recruitment and selection agenciesWe do not accept any unsolicited applications or CVs from recruitment- and selection agencies.LI-AASHJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}