{"Job ID": "69875837", "Description": "Responsibilities:Understand requirement and translate that to product features.\nDevelop Technical solution for complex business problems using Java and related technologies\nShould be able to use design patterns to make the application reliable, scalable, and highly available.\nShould be able to design Microservices and Serverless based architecture.\nShould work with client architect and define top notch solutions.\nShould provide reference architecture for the application in scope.\nShould work with vendors and work on integration of multiple systems.\nShould work in designing application including asynchronous programming, multithreading, mutability and concurrency control/recovery when dealing with persistent data stores\nShould drive the entire development team by defining and setting up high coding standards and follow best practices and principles aligning to the solution.\nShould work with the Devops team an implement CI/CD architecture\nDevelop applications using Front end, middleware, and database related technologies.\nShould participate in reviewing other project architecture for flaws and suggest solutions.\nShould be hands in developing and implementing best practices and write smart piece of code.\nMentor the technical teamThe Role offers:An outstanding opportunity to re-imagine, redesign, and apply technology to add value to the business and operations.\nAn end-to-end project exposure across multiple technical stack and cloud platform\nAn individual who has passion to learn and adapt to new technologies quickly and scale to next level easily.\nExposure to multiple platforms and team and work with them collaboratively to get the technical solution implemented.\nHigh visibility, opportunity to interact with multiple groups within the organization, technology vendors and implementation partners.Essential Skills:In-depth knowledge in core Java, spring and Hibernate\nHands-on-experience in spring boot\nHands-on-experience in developing Microservices using docker container or similar containerized platform.\nExperience with concurrency in Java including asynchronous programming, multithreading, mutability and concurrency control/recovery when dealing with persistent data stores.\nHands-on-experience in RESTful HTTP services design\nShould have exposure or hands on in designing API using RAML or Open API Specification\nProven experience in technically mentoring teams and exposure to solution architecture.\nShould have strong command on design patterns like CQRS, Factory, Dependency Injection, IOT, Aggregator etc\nShould be familiar or hands on in using Devops pipeline and managing Code repository and released using Git/BitBucket\nExperience with Oracle or SQL Server writing stored procedures, performance tuning and identifying deadlocks, transactions and data locking/blocking scenarios\nGood to have knowledge on designing SPA application using Angular 4/6/8 or REACT JS\nHands-on-experience with SQL Server, Postgre SQL writing stored procedures, performance tuning and identifying deadlocks, transactions and data locking/blocking scenarios\nLocalization, Internationalization and Globalization for server and client applications\nExperience working in Agile Development Methodologies such as SCRUMEssential Qualification:MCA/equivalent master’s in computers is a must.\nJava Certification is a must.\nAny cloud certification is a plus.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}