{"Job ID": "69873589", "Description": "Supervise the operations of the Distribution Center ensuring that stocks are maintained at minimum levels and distributed in a timely manner. Specific to Uniform Distribution Center (UDC): Supervise issuance of uniform items to Emirates Group Staff according to their company entitlements. Job Outline: Generic: - Responsible for ensuring stock levels are maintained efficienty at Just-In-Time (JIT) levels to minimize stockholding costs through analysing monthly cycle count inventory reports. - Monitor the physical stock takes, identifying and reconciling any discrepencies providing recommendations to the P&L Manager for their approval and further discussion with Management Accounts. - Manage and supervise the package and distribution of all items (uniforms/promotional and non-stock items) to outstations and promotional events as necessary. Book the shipment and advise delivery details to the departments for their collection and utilization. - Continuously identify daily operations improvements to ensure all customers? needs and department demands are met in a timely manner - Lead and supervise employees to ensure that they are continuously motivated and have a consistent workload. Specific to Uniform Distribution Center: Responsible for all measurements and issuance of uniforms to all Emirates Group employees as per their entitlements and Company Standards. Manage and complete necessary uniform alterations as and when required. - Pack and distribute all uniform items to each employee and ensure all packages are handed over as per Company Standards. - Identifying the needs of the department and customers and find solutions to inventory as the needs arise ensuring the requirements of customers and end users are fulfilled. - Monitor and control the master data accuracy of all inventory across all uniform functions (Pilot, EK & dnata). - Prepare and regularly monitor requisitions for the purchase of stock items to meet department demands in a timely manner. Constantly monitor and follow up on the status of the items ordered with buyers and suppliers. - Monitor and in charge of forcasting and planning of the stock levels to meet all operations requirements. in order to ensure prompt receiving, storing, issuing and inventory control. - Ensures all received items are as per terms and conditions and report all issues of discrepancies and damages to the officer for replacements of items. - Monitor the supplier management and supplier performance markers to ensure full supplier compliance in deliveries and quality as well as quantity. Specific to General Distribution Center: Ensure all stock items are received in accordance with the purchase order terms and conditions, advising the purchasing in the event of discrepencies to enable supplier feedback.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}