{
    "Job ID": "69873413",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Summary:\nTo strengthen our Enterprise Cloud Services (ECS) Delivery Productization team, we are searching for a motivated Procedure Owner working in a highly professional team of experts and architects across different ECS Delivery units. With strong SAP system operations knowledge your focus will be on end-to-end operations process standardization and optimization in close alignment with our development organization. You as role owner will enable and support the ECS Delivery units by providing tool and procedure standardization and automation in Database area also covering all multi-cloud aspects (AWS, Azure, and Google Cloud Platform) with focus on DB2. You will take ownership of integration scenarios, own operational processes, drive standardization and automation to increase efficiency. Understand and improve effort and cost structure (lower TCO). Engage with operation teams to continuously improve processes and tools including requirements engineering (Roll-in/ Rollout) and define a corresponding roadmap.\n Role:\nIn your role as Database Procedure Owner, you are enabling the delivery of robust, downtime optimized, and highly automated lifecycle management activities operated within ECS. •    Manage relationship between different stakeholder groups inside and outside Enterprise Cloud Services (ECS)Delivery.\n•    You will take ownership of integration scenarios and operational processes considering accelerated growth (RISE with SAP).\n•    Drive issue resolution together with the team and utilizing the expert network.\n•    Focus of your activities will be increasing automation along with stabilization improvements to help Operations to reduce manual effort and cost structure (lower TCO) and deliver faster services to our customers. Experience (Role Requirements):\n•     Min. 7 years Strong Database Administration (SAP HANA) experience including Upgrades, HA/DR, Backup & Recovery, System Operations know-how ideally in multi-cloud environment would be preferred.\n•    Best practices experience in Databases (SAP HANA, ASE & Other Databases) / SAP application / technology / solution (NetWeaver)\n•    Professional experience in Cloud infrastructure, system administration or as a technical consultant in SAP cloud implementation & migration projects\n•    Knowledge in design and structuring of integrated E2E Lifecycle Management Procedures\n•    Preferable database skills for HANA and ASE, other database vendors welcome (MAXDB, IQ, SQL Server)\n•    Project management skills\n•    Strong analytical and problem-solving skills\n•    Willingness and experience working in international teams.\n•    Ideally familiar with trending technologies and tools\n•    Fluency in English language About the team / Brand / Line of BusinessSAP Enterprise Cloud Services (ECS) is SAP’s private cloud managed services provider demonstrating accelerated growth & enabling customers start their journey with cloud. \nIn this role you drive standardization and automation, and you are an enabler for the operations teams to deliver in time and quality services to our customers. To achieve this, you will interface with a highly professional, global team of experts and architects from various teams inside ECS and the development organization. Further you will be part of strategic projects for introducing new technologies or tools in our environment.#SAPECSCareers\n We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 380990  | Work Area: Software-Design and Development  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}