{"Job ID": "69874233", "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers.We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity.United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across truly value.As a Director in Data Engineering, you are responsible for defining and executing data strategy for clients. Your role focused on high-quality strategy, definition, and delivery of solutions involving:Data Integration, Governance & Wrangling\nData Storage and Computation Frameworks, Performance Optimizations\nAnalytics & Visualizations\nInfrastructure & Cloud Computing\nData Management Platforms\nThe role requires a hands-on technologist with expertise in databases, Hadoop, MDM, and reporting to provide strategic and tactical direction to customers in the areas of marketing and technology. The person should have a strong programming background like Java.As a data engineering practitioner, you should have a point of view and understanding of build vs. buy, performance considerations, hosting, business intelligence, reporting & analytics. Ideally, you have experience in integrating data with marketing scenarios like segmentation, targeting, consumer 360 view, etc.Responsibilities:Provide inputs to define and execute a strategic roadmap for enterprise data architecture by identifying the current landscape and future business goal\nProvide technical leadership and hands-on implementation role in the areas of data techniques including data access, integration, modeling, visualization, mining, design, and implementation\nLead a globally distributed team to deliver high-quality solutions. Manage functional & non-functional scope and quality\nHelp establish standard data practices like governance and address other non-functional issues like data security, privacy, and quality\nHelp establish best practices like standards and guidelines for design & development, deployment, support and analytics, and mining\nHelp establish best practices in acquiring, storing, and analyzing structured, semi-structured, and unstructured data from the enterprise and outside like social\nCome up with analytics solutions based on the business goals and appropriate data visualization to support the goals\nManage and provide technical leadership to large data programs or multiple programs implementation based on the requirement using agile technologies\nDefine and drive key transformational programs like customer 360-degree view for the clients\nFunctional understanding related to digital marketing & customer experience solution blocks, Master data Management (MDM), Customer Relationship Management (CRM), Campaign Management, Tag Management, Media Buying, Optimization, Recommendations & Targeting, DMP, and DSP.\nUnderstanding Digital data sources such as Open source data (ex: Facebook, Twitter, LinkedIn, etc.), Weblog Data (SiteCatalyst, Google Analytics), 3rd party paid data (ex: Acxiom, ACNielsen, etc.), and business application data (CRM, eCommerce, etc.)\nRun workshops with clients and align client stakeholders to optimal solutions#LI-REMOTE 16+ years of experience within the field of data engineering\nExcellent understanding of data technologies landscape\nWell versed with pros and cons of various database technologies like Relational, NO SQL, MPP, Columnar databases\nWell versed with Software as a service, Platform as a service and Infrastructure as a service concepts and can drive clients to a decision\nExpert in programming languages like Java, Scala and / or JavaScript\nExpert in multi-dimensional modeling like start schema, snowflakes, normalized and de-normalized models\nExpert in one or more ETL, BI, Analytics and advanced visualization technologies\nExpert in in Hadoop eco-system with one or more distribution like Cloudera and HortonWorks\nExpert in agile development with CI / CD pipeline with data projects\nKnowledge in computation frameworks like Storm and Spark\nKnowledge in cloud and social media technologies and integrations\nExpert in master data management and building customer 360 degree views\nStrong analytical and problem solving skills\nStrong communication skills verbal, written and visual presentations\nStrong coordination and negotiation skills\nMulti geo experience and distributed delivery experience in large programs\nBusiness Knowledge:  Data driven marketing experience would be a plus\nWe at Publicis Sapient, enable our clients to thrive in Next and to create business value through expert strategies, customer-centric experience design, and world-class product engineering. \nThe future of business is disruptive, transformative and becoming digital to the core.\nIn our 20 + years in IT, never before have we seen such a dire need for transformation in every major industry - from financial services to automotive, consumer products, retail, energy, and travel.\nTo make this transformative journey a reality in these exciting times, we seek Rockstars who will:\nbrave it out to go do the next; “what will be” from “what is”\nexhibit the optimism that says there is no limit to what we can achieve\ndeeply-skilled, bold, collaborative, flexible\nReimagine the way the world works to help businesses improve the daily lives of people and the world\nOur people thrive because of the belief that it is both our privilege and responsibility to usher our clients and the world into Next. Our work is fueled bychallenging boundaries,\nmultidisciplinary collaboration,\nhighly agile teams, and\nthe power of the newest technologies and platforms. LOCATION:-- Gurugram/Bengaluru/NoidaGender-Neutral Policy\n18 paid holidays throughout the year for NCR/BLR (22 For Mumbai)\nGenerous parental leave and new parent transition program\nFlexible work arrangements\nEmployee Assistance Programs to help you in wellness and well being  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}