{"Job ID": "69874385", "Description": "Senior AuditorsFrom small businesses to some of the world’s best-known brands, our clients count on reliable financial statements, information and processes to inform their on-going strategies. More than ever, business is about interpreting and reacting to complex data - and they look to us for advice and services they can trust every time. You will use your professional skills and experience to make it happen, handling complex audit procedures across a broad range of industries and responsibilities.Our tailored external audit services help build trust and confidence through transparency, clarity and consistency. We are 79,000+ professionals based worldwide across 150 countries. Audit services involve reporting on the fairness in all material respects with which a client’s audited financial statements are presented, in conformity with the applicable financial reporting framework.The opportunityEY is looking for Senior Auditors to support our Audit team and help our clients meet their requirements by accurately reporting on financial statements and providing meaningful insights into accounting and reporting matters. In return, you can expect leading class learning and development tailored to your unique interests and motivations. You will be given all the skills, knowledge and opportunities to progress and become ready to build a better working world for our people, our clients and the communities that support us.Your key responsibilitiesAs a member of the Audit team you will participate in audit engagements, working effectively as a team member, sharing responsibility, providing support, maintaining communication and updating senior team members on progress. You will also help prepare for meetings with target management teams, and participate in these meetings, assist in preparing reports and schedules that will be delivered to clients and other parties and develop and maintain productive working relationships with client personnel.Actively establishing internal and external relationships, and identifying and escalating potential business opportunities for EY will be essential, as well contributing to people initiatives, including recruiting and retaining assurance professionals. With a clear focus on anticipating and identifying risks, you'll escalate issues as appropriate. You'll confirm that the work delivered to clients is of high quality and is reviewed by the next-level reviewer.Skills and attributes for successPro- activity, accountability and results- driven people will flourish in this environment. Dealing with competing priorities, understanding how to manage resources and communicating effectively are key skills. This will have a huge impact on those around you and help promote a positive work ethic.To qualify for the role you must have:Strong academic record, including a degree or professional qualification, such as ACCA, CPA, CA\nAt least 3 years of professional experience in an audit, accounting or finance role\nProficiency in the Arabic languageIdeally you’ll also have• Track record with a leading audit, accounting or consulting firmWhat we look forWe are interested in entrepreneurs who have the confidence to develop and promote a brand new strategic vision both internally and externally. You will be business savvy with a passion for innovation as well as the motivation to create your own EY journey.What we can offer youSupport and coaching from some of the most engaging colleagues around\nOpportunities to develop new skills and progress your career\nThe freedom and flexibility to handle your role in a way that’s right for youAbout EYAs a global leader in assurance, tax, transaction and advisory services, we’re using the finance products, expertise and systems we’ve developed to build a better working world. That starts with a culture that believes in giving you the training, opportunities and creative freedom to make things better. Whenever you join, however long you stay, the exceptional EY experience lasts a lifetime. And with a commitment to hiring and developing the most passionate people, we’ll make our ambition to be the best employer by 2020 a reality.If you can confidently demonstrate that you meet the criteria above, please contact usBuild your legacy with us.For further information, and to apply, please visit our website via the “Apply” button below. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Erbil, Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}