{
    "Job ID": "69875929",
    "Description": "Mechanical Designer – STETYou are responsible forLeading the execution of large-scale projects that drive global sourcing strategies to deliver the strategic business initiatives. This includes supplier management, E2E product launch management, lifecycle management among other critical sustaining engineering activities.\n\nResponsible for creating E2E engineering release schedule to qualify products with new suppliers & release to production – this is the most critical aspect of the job responsibility & product development excellence is critical for success.\n\nAccountable for resolving all technical challenges during the transfer process, which includes resolving product specification challenges, consulting with subject matter experts to guide suppliers, reverse engineering, driving design review workshops, develop test fixtures, etc.\n\nAccountable for supplier quality performance in assigned projects to improve existing benchmarks and developing improvement plans to ensure Supply Chain target performance levels are achieved.\n\nResponsible to ensure product requirements are fully defined to enhance quality through transfer projects, this would involve reverse engineering as needed.\n\nFull responsibility to achieve critical KPIs for QUALITY and productivity targets that are tied to the annual business plans.\n\nPartner with key business stakeholders to ensure that all business needs are met & improved through sourcing/concept projects.To succeed in this role, you should have the following skills and experienceCompleted engineering studies at University level; BE/BTech/ME/M-Tech in Mechanical\n\n6-12 or more years of experience in Plastic Product design, Sheetmetal Design and Resolving issues in tools for Medical Devices / Home Appliances / Personal Health\n\nStrong understanding of physics and hand calculation of the mechanical components for deciding strength, stiffness etc.\n\nProven design engineering and project management experience leading cross-functional teams\n\nExperience supporting global projects \n\nDemonstrated strong analytical and problem solving skills\n\nKnowledge of manufacturing quality systems and working in a regulated industry\n\nWorking knowledge of Microsoft Project, Excel, Power Point, and Word required\n\nProduct Engineering, i.e. modules and parts in both metals and plastics; satisfying our esthetical, functional and manufacturability requirements (e.g. DFM / DFA). For AC/AD/PDLM and MLD projects.\n\nExposure to CAD (Creo and Equivalent), Windchill PDM / PLM for managing lifecycle of the components.\n\nTolerance design and 2D drawing creation (part specification)\n\nFamiliar with latest engineering design and methods, tools, and processes.Specific Knowledge/Skills:Microsoft Office applications, including Excel and PowerPoint\n\nFamiliar with the use of Product Data Management (PDM) systems\n\nHands on experience on Creo / Solid-works CAD Tools.\n\nDisciplined team worker, ability to work independently with timely guidance.\n\nResult oriented team player.\n\nExcellent communication skills and Positive ‘can do’ attitude.\n\nQuality mindset in design and documentation.In return, we offer youA meaningful career, with new challenges in our dynamic organization, working in an encouraging multinational and multicultural environment. We are happy to provide you with this opportunity to work with new technologies. You will be surrounded by passionate and committed, colleagues who share your ambition to create outstanding customer experiences. Your work will be ambitious and full of opportunities for growth. Variety and challenge will be part of your daily routines.Our commitment to inclusion and diversityAt Philips, we provide equal opportunities to all our employees and to all eligible applicants for employment in our company , irrespective of age, color, disability, nationality, race, religion, gender, sexual orientation (LGBTQ +), and all aspects that make individuals unique. Encouraging diversity and fostering inclusion are key to our mission of improving the lives of 2.5 billion people a year by 2030 through meaningful innovation. We have fair, transparent, and clear employee policies which promote diversity and equality, in accordance with currently applicable law. For, we believe that life is better when#youareyou.Why should you join Philips?Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on innovative, customer-first health technology solutions. Help us improve the health and well-being of billions of people, every year. Ultimately creating a career that no one could have planned for. Even you.#L1-PHILINJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}