{
    "Job ID": "69875761",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:Support IT and Business related activities in GTB cash management.\nSetup new initiatives as Delivery manager.\nDelivery of end to end new initiatives, along with the support of existing servicesKey Accountabilities:Generic AccountabilitySenior Engineer – Manager, as part of the CCB - Cash team aligned to respective services.\nLead, Projects driving design, build, Infra, Test and implementation related activities\nParticipate in planning of integration projects and corresponding strategies between business units and development teams\nProvide technical knowledge and experience during the planning, execution and management of integrating new applications\nIdentify and resolve systems issues; identify common patterns and document best practices for integration\nDevelop standards and processes to support and facilitate integration projects and initiatives\nMentor Integration Solution Architects in carrying out application design tasks\nFollow an integration methodology for middleware tools and data architecture\nLiaise with Project Managers and designers to implement effective solutions\nParticipate in integration testing phase of software and applications\nAssist application software developers and engineers in development of APIs to interact with the inhouse and Vendor product.\nBuild relationships with software development and engineering teams to gain an understanding of application architectures and required functionality\nBuild relationships with vendors of application software to provide feedback on their technical integration capabilities\nContinually develop skills in the integration technologies in place, as well as staying informed on new developments in integration technology\nDesign, develop, test and deploy solutions within the organization’s architectural principles, policies and guidelines\nProvide proper guidance to ensure integration services and architectures are designed, tested, documented, implemented, enhanced and maintained according to the enterprise standards and expected service quality\nImplement audit and monitoring solutions to provide proactive operational support\nIdentify opportunities to enhance or improve business processes via integration, and minimize their impactJob Context:Specific AccountabilityWorks across multiple Service Delivery Teams\nThe role requirement is to strengthen existing support and planning workstreams. Ideal candidate should have good exposure to various fields of IT and Delivery\nDesirable (should have good understanding of all below):\nSoftware Development\nTesting\nSupport\nNetwork\nSecurity\nApplication\nPlatform\nDevOps\nCloud\nDatabase\nInfrastructure\nChange Management\nProject Management/ Waterfall, Agile etc10+ years of experience in leading Technology Projects.\nExperience in application integration management in one of the integration technologies –MuleSoft, IBM Enterprise Service Bus, etc.\nExperience in enterprise-level application integration\nExperience in Cloud - Azure, AWS.\nExperience of CI/CD, kubernets...\nDatabase experience (DB2, Sequel, Oracle) Work with database platforms for SQL development, database design, management techniques and debugging\nExperience working with web-based architecture utilizing but not limited to the following - JavaScript, jQuery, HTML, CSS, Java / J2EE / JavaScript, JSON, 3rd Party API Utilization, IIS\nExperience in developing Java User Interfaces and Web Services (SOA/SOAP/REST/XML) applications\nProven experience in overseeing the linking of cross-functional applications between diverse business units and systems\nExperience with business and technical requirements analysis, business process. modeling/mapping and methodology development, and data mapping\nBackground in risk management methodologies as they relate to integration/software engineering\nStrong knowledge of system and software quality assurance best practices and methodologies\nProven communication skills, problem-solving skills, proficiency in programming languages and data structures, and knowledge of integration best practices are critical to successful performance in this role\nSelf-motivated and directed, with keen attention to detail\nAble to prioritize and execute tasks in a high-pressure environment\nExperience working in a team-oriented, collaborative environment\nExperience in Software Development Life Cycle or Service Management (e.g. Incident, Problem, Change, Configuration, Availability, IT Continuant Management)\nAbility to coach and guide the team of Engineers or other Service Management Staff\nAbility to identify requirements and create a solution architecture that meets identified requirements\nAbility to analyze the solution or processes (including, but not limited to Service Management) and offer ways to simplify it\nProficiency in troubleshooting software or infrastructure issues, troubleshooting using tools or debugging a large codebase\nImproves team operation practices by incorporating best practices\nSuccessfully launches new features or re-architects old features. Begins to balance technology with business value\nExtensive service Management, scripting, packaging tools, or programming knowledge in various software languages\nExperience / Proficiency in object-oriented design and analysis\nHands-on experience in designing interactive applications, automation solutions, or service management solutions\nMaintaining the coding or Service Management standards\nIdentifies and evaluates new technologies for implementation\nStrong analytical and reasoning skills with an ability to visualize processes and outcomes\nExperience in system performance monitoring and tuning\nContinually improves system monitoring and alerting\nIdentifies and fixes the security vulnerabilities\nIntegrates software or existing solutions with existing systems\nPractical knowledge of DevSecOps Model\nPractical knowledge of product delivery and project management\nVery good understanding of change management\nAbility to develop test plans and quality assurance procedures\nRecommends changes in policies and procedures\nMastery in engineering tools applicable to the specialization (including but not limited to various development tool suites, scripting tool suites, version control and source control software such as GitHub/GitLab/Bitbucket, or Service Management tools)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}