{"Job ID": "69874185", "Description": "About STARZ PLAYSTARZ PLAY is a subscription video-on-demand service headquartered in Dubai and available in 19 countries in the MENA region. Our service streams thousands of blockbuster Hollywood movies, TV shows, documentaries, kids’ entertainment, and dedicated Arabic content to subscribers in the region. Because we’re based in the Middle East we know exactly what our audience wants to watch, what device they want to watch it on, what language they want to watch it in, and how they prefer to pay for it. This is what makes us the fastest-growing SVOD service in the region. Job Description:Monitor and manage the flow of content from receiving the material till making it available for the publishing team. Responsible for creating the content according to the guideline given & producing relevant promos for the planned material. Ensuring timely delivery of all the deliverables to the publishing teams and telco partner on the given format. The Main activity is to manage the content flow from receiving the content to the publishing team.Main Duties and Responsibilities:Download media files from Content Providers.\nEnsure the quality of assets received from the Provider match with Starzplay internal standards.\nHouse keeping the files in S3 buckets and making sure all the files has been stored in the given location.\nAble to perform edits and fixing the audio tracks using Adobe Premiere tools.\nManage the workflow of material received and transcoding to the given parameters.\nMake sure that the content is delivered to all accounts.\nMonitor & follow the workflow of creating video files.\nEnsure the quality of assets pushed is compiled with given guideline.\nProducing promos for all the received and scheduled content according to the guideline.Must have Experience.Experience as Digital Content Operations (ideally on multimedia company)\nHands-on experience with Adobe Premier content editing tool.\nOral & Written Communication in English (Mandatory)\nHands-on on Microsoft Office (Excel, Outlook)\nKnowledge in Audio &Video Editing using Adobe tools is an added value.\nFreelancers/contractors/interns are encouraged to apply.Why work at STARZ PLAY?At STARZ PLAY we look for BOLD, CREATIVE and INNOVATIVE individuals that have a passion for technology.  We offer a competitive compensation package and an environment that is constantly evolving and exposing you to new market trends and innovations while giving you a chance to contribute to our exciting platform.  If you are a problem solver and visionary thinker then come join us at STARZ PLAY!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Lahore, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}