{
    "Job ID": "69872895",
    "Description": "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level. Job summaryAs a Quality  Assurance Engineer at JPMorgan Chase as part of Public cloud Enablement and Adoption Team, you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.Job responsibilities Proven ability to write automated tests\nAdvanced knowledge of software lifecycles, including Waterfall and Agile, and test automation strategies\nExperience working effectively with teams and stakeholders to develop relationships and achieve common goals\nProficiency in a business function and some understanding of the broader business context\nEvaluate Industry standard Automation Framework Tools and align to product functional testing. \nDevelop/manage Test Automation Framework and educate broader organization \nUnderstands the Product Functional knowledge and advises team on Functional ImpactsRequired qualifications, capabilities, and skills6+ Years of experience in IT with Product Development Based Organizations preferably. \nBachelor’s degree in Computer Science, Computer Engineering or a related field or the foreign equivalent\nServiceNow scripting experience \nAutomation & Testing – Using JUnit, JMeter, Selenium, Cucumber\nDevelopment Tools – IntelliJ/Eclipse\nManage/organizing Test artifacts for each Product testing Iteration\nExperience working in Agile Teams and respond to changes.Preferred qualifications, capabilities, and skillsPair Programming – Comfortable with the concept of pairing with other team members to solve problems\nUI – Any level of experience working with UI framework such as Angular, React is a plusWe recognize that our people are our strength and the diverse talents and perspectives that they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.  (If you are a US or Canadian applicant with a disability and wish to request an accommodation to complete the application process, please contact us by calling the Accessibility Line (US and Canada Only) 1-866-777-4690 and indicate the specifics of the assistance needed.)We offer a competitive total rewards package including base salary determined based on the role, experience, skill set, and location. For those in eligible roles, we offer discretionary incentive compensation which may be awarded in recognition of firm performance and individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.JPMorgan Chase is an Equal Opportunity Employer, including Disability/VeteransJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}