{"Job ID": "69872588", "Description": "Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries. As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture. Department Profile - Internal Audit Internal Audit is responsible for validating whether the firm operates in a controlled environment with appropriate risk-management processes. Auditors evaluate the adequacy and effectiveness of the firm's internal controls using a risk-based methodology developed from professional auditing standards. Internal Audit assists in monitoring the firm's compliance with internal guidelines set for risk management and risk monitoring, as well as external rules and regulations governing the industry. The team reports directly to the Board Audit Committee and helps verify whether the firm meets all of its fiduciary responsibilities to shareholders, while adhering to corporate-governance standards and legal and regulatory requirements. Internal Audit is comprised of Business and Technology auditors. Business and Risk auditors focus on understanding the risks that the businesses face and the controls to mitigate those risks. Technology auditors focus on the application controls supporting the business processes, including systems development, application security and entitlements, production management, and technology governance. Both groups are responsible for understanding, analyzing and testing the controls to protect the franchise. Position Description Morgan Stanley is seeking a Credit Risk Audit Manager, with audit or credit risk experience. The role is at an Audit Manager level, covering MS Bank N.A. and ultimately reports to the Global Head of Credit Risk Internal Audit, within the Global Risk Management Internal Audit team. The Global Risk Management Internal Audit team provides coverage across the risk pillars, with audit teams specialising in Market, Credit, Operational and Liquidity Risk audits, as well as Capital Planning. In addition, there are dedicated Quantitative Auditors who cover Model Risk as well as the Credit Review Group which assesses the Firm's credit underwriting process. Primary Responsibilities > Assesses inherent credit risks and perform risk assessments at the MS Bank N.A. entity and process level > Prepares audit planning documentation, conducts walkthroughs, and assesses the internal control environment through control and substantive testing > Evaluates the adequacy and the effectiveness of key controls and potential business concerns by analyzing available documentation and asking insightful questions to identify root causes and draw the appropriate conclusions > Documents the results of work performed in the Department's automated workpaper system according to Departmental methodologies and documentation standards > Develops and documents audit findings in a clear and concise manner, communicates observations to line management and secures formal management responses to audit recommendations for inclusion in the Audit Report > Arranges follow-up meetings concerning open audit actions with line management quarterlyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}