{"Job ID": "69875817", "Description": "Responsibilities:Understand requirement and translate that to product features.\nDevelop Technical solution for complex business problems using Java and related technologies\nShould be able to use design patterns to make the application reliable, scalable, and highly available.\nShould be able to design Microservices and Serverless based architecture.\nShould work with client architect and define top notch solutions.\nShould provide reference architecture for the application in scope.\nShould work with vendors and work on integration of multiple systems.\nShould work in designing application including asynchronous programming, multithreading, mutability and concurrency control/recovery when dealing with persistent data stores\nShould drive the entire development team by defining and setting up high coding standards and follow best practices and principles aligning to the solution.\nShould work with the Devops team an implement CI/CD architecture\nDevelop applications using Front end, middleware, and database related technologies.\nShould participate in reviewing other project architecture for flaws and suggest solutions.\nShould be hands in developing and implementing best practices and write smart piece of code.\nMentor the technical teamThe Role offers:An outstanding opportunity to re-imagine, redesign, and apply technology to add value to the business and operations.\nAn end-to-end project exposure across multiple technical stack and cloud platform\nAn individual who has passion to learn and adapt to new technologies quickly and scale to next level easily.\nExposure to multiple platforms and team and work with them collaboratively to get the technical solution implemented.\nHigh visibility, opportunity to interact with multiple groups within the organization, technology vendors and implementation partners.Essential Skills:In-depth knowledge in C#, ASP.NET MVC, Web API.\nHands-on-experience in .NET core, EF Core, Web API core.\nHands-on-experience in RESTful Http services design.\nHands-on-experience in developing Microservices and docker. \nExposure for at least 1 year in serverless architecture and exposure using AWS Lambda/Azure Functions\nExposure for at least 1 year in using AWS or Azure PaaS services like storage, Queues, Database, security. It could be the following in AWS and Azure\nAWS: SQS, SNS, Dynamodb, ECS, EC2, Load Balancer, Secrets manager\nAzure: Storage accounts(all types), App services, Web jobs, batch, Logic apps etc\nHands-on-experience in working in any of the cloud platforms like Azure or AWS\nHands-on-experience in Java script, JQuery, Bootstrap, Html5, CSS3\nHands-on-experience with SQL Server, Postgre SQL writing stored procedures, performance tuning and identifying deadlocks, transactions and data locking/blocking scenarios\nGood to have 2+ years of experience in Angular 4/6/8 or REACT JS\nGood to have working knowledge of Webpack, Angular CLI and Agile Scrum framework\nGood communication and unit testing knowledge using NUnit,Xunit etc\nGood to have knowledge in one of the cloud platform like AWS/Azure/PCF\nFamiliar with Continuous Integration methodologies and tools, including Jenkins\nGood to have: Exposure to Microservices, Docker, Kubernetes and cloud deployment Essential Qualification:MCA/equivalent master’s in computers is a must.\nAny cloud certification is a plus.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}