{
    "Job ID": "69873014",
    "Description": "Did you know KONE moves over one billion people every day? We employ over 60,000 professionals in over 60 countries worldwide joined together by a shared vision to “Deliver the best people flow experience”. As a global leader, we provide elevators, escalators, automatic building doors as well as solutions for maintenance and modernization to add value to buildings throughout their lifecycle. Through more effective People Flow®, we make people’s journeys safe, convenient and reliable, in taller, smarter buildings.Why this role?KONE India is embarking upon an exciting growth phase and this represents an opportunity for you to join our Hyderabad KONE India, as Senior Engineer/Assistant Manager - Sales.  What will you be doing?Customer relationship management\n• Proactively develops and creates customer relationships in his/her area of responsibility\n• In early phases of projects, drives solution selling methodology with architects and developers, consultants or other influencers to ensure KONE solutions are meeting customer’s needs and creating value throughout the lifecycle taking into account whole KONE product portfolio\n• Creates interest and demonstrates value of KONE digital offering to influencers and customers\n• Develops and grows KONE’s position in his/her customer base or market area \n• Creates and communicates leads and sales opportunities for entire KONE sales team (e.g. cross-selling)\n• Ensures customer satisfaction and solves complaints with the rest of KONE team \n• Documents the customer and contact information, responsible for correct customer, influencer and contact data in CRMSell\n• Generates leads, opportunities, orders and contracts to meet the sales budget and pricing targets\n• Finds customer needs and designs solution to meet them\n• Is accountable for setting optimal market pricing for each solution\n• Requests technical know-how from Customer Solutions Engineering (CSE) in tendering phase in non-standard cases and according to local policy\n• Arranges pre-tender, pre-booking reviews and ensures Sales-to-Operations handover with complete and correct information\n• Ensures the importance of site readiness communicated to customer and included in the contract \n• Validates that the contents of the order received from the customer are in line with the negotiation process outcome, including terms and conditions, quality and safety\n• Is accountable for the project until Order Booking\n• Ensures correct project categorization at Decision to start tendering by Gate approver\n• Supports the finance function in money collection\n• Driving execution of her / his individual sales plan including proactive / consultative sales customer visits\n• Responsible for gathering relevant information about market and competitors from the field\n• Responsible for timely and accurate reporting\n• Documents full information of opportunities, tasks and visits, including won and lost reasons\n• Responsible for correct opportunity data in CRMAre you the one?Minimum 5+ years of experience in direct/field sales with BE/MBA.What do we offer?Career progression opportunities within a global organization.\nTotal reward elements that engage and motivate our employees and help us make KONE a great place to work.\nComprehensive learning and development programs covering a wide range of professional skills.At KONE, we are focused on creating an innovative and collaborative working culture where we value the contribution of each individual. Employee engagement is a key focus area for us and we encourage participation and the sharing of information and ideas. Sustainability is an integral part of our culture and the daily practice. We follow ethical business practices and we seek to develop a culture of working together where co-workers trust and respect each other and good performance is recognized. In being a great place to work, we are proud to offer a range of experiences and opportunities that will help you to achieve your career and personal goals and enable you to live a healthy and balanced life.Read more on www.kone.com/careersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}