{
    "Job ID": "69874214",
    "Description": "About Zenith:We are the ROI agency, a position we have proudly held true to since 2005. Over the years, we have evolved our definition of ROI, as it has changed with the ever-complicated communications landscape. ROI is no longer simply about the most efficient planning, buying and reporting of media.Yes, ROI is about delivering Return on Investment; but it’s also about going beyond to deliver a Return on Imagination and more integrated experiences that inspire Growth. Top-line growth for our clients’ businesses, growth for our people and growth for our culture.We leverage over 30 years of media planning expertise to go beyond traditional media solutions and deliver a Return on Investment that is both forward–thinking and accountable to our clients.Powered by our best-in-class proprietary tools and data, our work spans the full spectrum of media communications, from analytics, data and technology to performance marketing, content and superior trading.This breadth means we deliver Insight that lies at the intersection of consumer, category, and brand, attributing every budget to stronger business outcomes.It means we deliver more creative media solutions that bring together best-in-class strategy, planning and the power of Publicis Groupe to ensure distinct and more personal brand experiences for our clients.It means we adopt new data analytics and value optimisation techniques while building relationships with some of the world’s most exciting start-ups. We leverage over 30 years of media planning expertise to go beyond traditional media solutions and deliver a Return on Investment that is both forward–thinking and accountable to our clients.At Zenith, we ultimately seek out a more meaningful kind of ROI. Our unique way of thinking inspires growth for some of the world’s leading brands, including Coty, Disney, Electrolux, Essity, Lactalis, Luxottica, Nestlé, Nomad Foods, Reckitt, TikTok and Verizon.Overview of jobLooking for a detail-oriented, competitive, analytical thinker with experience in SEO, who will be responsible for execution of SEO plan in support of business objectives by increasing revenue from Zenith's clients. Should be responsible for improving a brand's organic search results. Creates and launches SEO campaigns, identifies areas of improvement, understanding of PPC campaigns, and attempts to improve the brands' sites' rankings in major search engines.Key Management Areas of Responsibility Define requirements, tasks, and resources associated to SEO strategy  Manage and execute implementation of SEO strategy  Communication to clients, team, and management on strategy/project development, timelines, and results  Collaborate on client strategy and goal definition for success  Keep pace with SEO, search engine, social media and internet marketing industry trends and development  Contribution to the company blog and at least one social media communityMeasures of success – Perform keyword research in coordination with client business objectives to optimize existing content and uncover new opportunities  Provide SEO analysis and recommendations in coordination with elements and structure of websites and web pages  Provide recommendations and execute/manage strategies for content development in coordination with SEO goals – general and keyword specific  Help to create and support marketing content to socialize and use for social media purposes (e.g. customer videos briefs, customer case studies, blog posts, posts from analysts and customers)  Develop and implement link building campaigns  Develop, manage and execute communication/content strategies via social communities in coordination with client goals  Implement and administer search engine programs (XML sitemaps, shopping feeds, webmaster tools)  Monitor and evaluate search results and search performance across the major search channels in order to improve rankings  Research and administer social media tools in support of clients’ social media strategy  Monitor and evaluate web analytics dashboards and reports in order to develop and recommend SEO strategies  Communication to team and management on project development, timelines, and resultsProfessional Competencies Passion for SEO and overall internet marketing  Outstanding ability to think creatively, strategically and identify and resolve problems  Ability to foster strong client relationships at various levels  Attention to detail and the ability to effectively multi-task in a deadline driven atmosphere  Ability to clearly and effectively articulate thoughts and points  High levels of integrity, autonomy, and self-motivation  Excellent analytical, organizational, project management and time management skillsProfessional Skills & Qualifications 10-12 years’ experience in Search Engine Optimization (SEO) and Search Engine Marketing (SEM)  Strong understanding of Search Engine Marketing (SEM) and Search Engine Optimization (SEO) process  Experience working with popular keyword tools (Google, WordTracker, Keyword Discovery, etc)  Experience working with CMS and building/administering content in multiple CMS environments  Knowledge of HTML/CSS and website administration  High-level proficiency in MS Excel, PowerPoint, and Word  Experience with website analysis using a variety of analytics tools including Google Analytics as well as internal reporting tools  Knowledge of PPC programs and optimizing data gathered from both organic and paid sources  Graduation (technical) requiredPublicis Groupe Commitment to Diversity & Equity Policy:Publicis Groupe is deeply committed to diversity and inclusion in spirit and in action at every level of the organization. It reflects our core values and embodies our purpose of building a great company enabling human potential. We have a deep-rooted appreciation for how diversity of thought drives innovation, and we ground that value in a culture of collaboration and connected thinking.  Diversity & inclusion are business imperatives on which Publicis Groupe will not negotiate. While fostering a work environment that is inclusive of all talent is a collective responsibility, it is leadership’s job to nurture the career aspirations and goals of all our talent. Promoting gender equality starts at the top and the Groupe will not tolerate anyone speaking for our organization who does not value the importance of inclusion. Publicis Groupe works very hard to champion diversity and will continue to insist that each agency’s leadership be champions of both diversity and inclusion.\nOur Core values “ VIVA LA DIFFERENC’E is based on the very aspect of celebrating differences \nOur strategy focuses on bringing together teams with diverse perspectives, disciplines, and experiences, because diversity of thought best serves our clients and their customers who they aspire to impactEqual Employment Commitment:We provide equal opportunities to all our employees and to all eligible applicants for employment in our company. We do not unfairly discriminate on any ground, including race, caste, religion, color, ancestry, marital status, gender, sexual orientation, age, nationality, ethnic origin, disability or any other category protected by applicable law.\nWhen recruiting, developing and promoting our employees, our decisions will be based solely on performance, merit, competence and potential.\nWe shall have fair, transparent and clear employee policies which promote diversity and equality, in accordance with applicable law and other provisions of this Code. These policies shall provide for clear terms of employment, training, development and performance management.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}