{
    "Job ID": "69874150",
    "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value. The Publicis Sapient Experience Design Capability is the bridge between business strategy and technology — we create meaningful, holistic experiences for our clients and their customers. We are multiskilled thinkers, computational designers, environmental designers, researchers, and architects. We are seeking a talented and experienced Senior Designer (Hybrid) to play a key role in shaping exceptional user experiences that delight and engage our customers. Bring your expertise and passion for design to contribute to our success in delivering innovative and impactful digital solutions by joining our Experience Design Capability team. In this role, you will be responsible for leading and driving user experience design projects across various business verticals on multiple digital platforms, aiming to simplify complex problems. With 5-10 years of work experience, you will bring a deep understanding of user-centered design principles and a wealth of expertise in UX design, visual design, and interaction design to the table. Your responsibilities will also include creating interactive mock-ups to effectively communicate your design ideas.Your Impact:Take charge of executing the overall UX design project, ensuring alignment with business objectives and user needs. Conduct user research, usability testing, and competitive analysis to inform design decisions.\nCollaborate closely with cross-functional teams, including product managers, designers, developers, and stakeholders, to translate user requirements and business goals into innovative and intuitive design concepts.\nFoster a collaborative and iterative design process that promotes creativity, feedback, and continuous improvement.\nChampion user-centered design principles throughout the design process, ensuring that the user's perspective is at the forefront of decision-making. Conduct user research, manage workshops, and develop concepts, user flows, wireframes, prototypes, and high-fidelity designs that effectively communicate and solve complex user problems.\nAssist in creating exceptional visual design skills by creating aesthetically pleasing and impactful interfaces that adhere to brand guidelines. Apply typography, color theory, iconography, and other design principles to create engaging and visually cohesive user experiences.\nDrive the creation of interactive prototypes and micro-interactions to validate design concepts and gather user feedback. Utilize tools and technologies to bring designs to life and demonstrate seamless user interactions and transitions.\nContribute to the development and maintenance of a design system and component libraries to ensure consistency, scalability, and efficiency across our digital products. Advocate for design system adoption and educate team members on its benefits.\nProvide guidance, mentorship, and support to team members who are junior designers, fostering their professional growth and helping them elevate their design skills.\nAct as a thought leader in the field of UX design, staying up-to-date with industry trends, emerging technologies, and best practices.Your Skills & Experience:7-10 years of professional experience in UX design, visual design, and interaction design, preferably in a hybrid role, with exposure to both B2C and B2B product contexts.\nMaster's or Bachelor's degree in a design-related discipline\nStrong portfolio demonstrating a track record of successful UX design projects, showcasing your ability to solve complex design challenges and deliver high-quality, user-centered designs.\nSolid understanding of user research methodologies, usability testing, and data-driven design.\nProficiency in design tools such as Sketch, Adobe XD, Figma, InVision, Adobe Creative Suite, etc.\nStrong working knowledge of research, analytics, and ideation tools such as Google Analytics, Optimal Workshop, UserTesting, SurveyMonkey, Mural, Miro, Figjam, or equivalent.\nAbility to lead a diverse team in a fast-paced and high-velocity work culture.Set Yourself Apart With:Excellent collaboration and communication skills, with the ability to effectively present and articulate design concepts and rationale to both technical and non-technical stakeholders.\nUp-to-date knowledge of design trends, industry standards, and emerging technologies.Gender-Neutral Policy\n18 paid holidays throughout the year for NCR/BLR (22 For Mumbai)\nGenerous parental leave and new parent transition program\nFlexible work arrangements\nEmployee Assistance Programs to help you in wellness and well being  Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}