{
    "Job ID": "69873267",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Job Title: Global Sales Operations Business Enablement, AssociatePosting Title: Global Field Business Support, AssociateLocation: Global\nExpected Travel: 0 - 10%\nCareer Status: Management\nEmployment Type: Regular Full Time\nCareer Level: T1\nHiring Manager: [Regional Manager – Field Business Support]Recruiter: [HRBP]PURPOSE AND OBJECTIVESWith an aim toward action and pragmatic execution, the Customer Success COO Group delivers exceptional experiences, simple processes, and impactful customer interactions. The organization has holistic responsibility for ensuring efficient day-to-day operations of the Customer Success business, operationalizing and accelerating the True North strategy via the One Customer Success Operating Model and developing disruptive motions, channels, and commercial models to innovate for the future. The team prides itself not only on what is delivered, but on the delivery itself, exemplifying the qualities of Trust, Authenticity, Inclusivity, Integrity, and Courage in every interaction.EXPECTATIONS AND TASKSIn your role as a Global Field Business Support Associate, you will be responsible for the execution of the end-to-end deal operational process for specific deal motions. This is a central team acting as a deal support center for SAP Account Executives in the region. The Field Business Support Team assists, and process deals within the SAP CRM/Harmony system. Supported by your team members, you will guide deals through the quote-to-booking process. The team is expected to contribute to revenue growth and profitability by processing sales opportunities for both existing and net new customers and achieving order targets.RESPONSIBILITIESProcess customer requests for selling deals and completing the required inputs (Harmony/CRM Opportunities, Quotations, Order Forms)\nComply with operational procedures e.g., for sales, delivery, financial and legal requirements. Archiving and maintaining all files and records\nProvide active quarter-end and year-end close deal support to the sales community to ensure timely and accurate completion of work deliverables in a dynamically driven environment\nLegal Contract Validation: Closely cross-collaborate with the Industry AEs, Pricing and Revenue Recognition teams in the local market units during the contract drafting and negotiation process. Verify customer, user and pricing information provided by Account Executives and Pricing teams, work with Finance, Revenue Recognition teams to prevent revenue deferrals, ensure final business, and contract termsREQUIREMENTSBachelor’s degree (preferred)\n1-3 years of experience working in a Sales Operations or Deal Support capacity\nBackground in sales, quote-to-cash process & deal execution\nExperience in a fast-paced environment, ability to multitask, prioritize and problem solve\nExtremely detailed-oriented, organized, and effective communication skills (both oral and written)\nExperience with Smartsheet, advanced MS Office skills (Excel, Word, PowerPoint, and Outlook), DocuSign, CPQ/CRM tool and experience with SAP systems is a plus\nFlexibility to work virtually or in local office (as needed and available)\nFlexibility to work varied business hours to ensure full Field Business Support coverage, especially at quarter and year-end\nAdvanced English needed – additional languages beneficial depending on the supporting region/MUs  We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 380634  | Work Area: Sales Operations  | Expected Travel: 0 - 10%  | Career Status: Graduate  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}