{
    "Job ID": "69874393",
    "Description": "EY Riyadh Tax - Indirect Tax COOP ProgramLocation: Riyadh, KSAWhat if your career could have a lasting impact on you, and on the world?Here at EY, you’ll have the chance to build a truly exceptional experience. We’ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you’ll develop the skillsets you need to stay relevant today and in the future – all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.The exceptional EY experience. It's yours to build.The opportunity: your next adventure awaitsYou will be completing an internship with one of the most trusted, respected, and influential teams in the industry. In Tax, we equip clients to make better business decisions by bringing insights to the forefront. We help companies understand the tax policies and tax laws of governments around the world to plan and comply accordingly. Our teams leverage transformative technologies to deliver strategy and execution, from tax and regulatory obligations to operations and workforce management, to reduce risk and drive sustainable value. Click here to learn more about the Tax service line.We are passionate about making sure the experience you have with us as an intern lasts a lifetime. To demonstrate this, we have developed an Internship Program which offers you a combination of varied on-the-job work experience as well as web-based/self-study learnings. The combination of such components will support you in developing your knowledge around the services we offer while building your communication and interpersonal skills. Along the way you will be supported and coached by a team of professionals within your location.What we look forYou have an agile, growth-oriented mindset. What you know matters. But the right mindset is just as important in determining success. We’re looking for people who are innovative, can work in an agile way, and keep pace with a rapidly changing world.\nYou are curious and purpose-driven. We’re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.\nYou are inclusive. We’re looking for people who seek out and embrace diverse perspectives, who value differences, and team inclusively to build safety and trust.\nQualifications:\nIn your penultimate year at the university (doing any degree related to Accounting, Finance, Economics, Law or any business-related degree where you have completed courses in Taxation).\nSaudi nationals will only be consideredWhat’s in it for youAccelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.\nBroaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds — both professionally and culturally.\nBring out the best in yourself with continuous investment in your personal well-being and career development.\nDevelop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society – building a better working world, together.What you can expectStep 1: ApplyIf you can confidently demonstrate that you meet the criteria above, please complete the online application as soon as possible. Make sure to answer all questions.Make sure you apply early and do not forget to follow the instructions carefully and answer all the questions to ensure your application is successful.Step 2: TestAfter we review your application, you will receive an invitation email from ‘EY Careers’ to complete the EY online assessments. Approach the tests as you would approach any new challenge. It might be tough, but you can do it!Step 3: On-Demand InterviewUpon passing the assessments, you will receive an email invitation to complete a prerecorded video interview. You will be required to record yourself responding to behavioral-based questions. Being yourself is key to passing this step of the recruitment process.Step 4: AttendOnce you have been shortlisted, you may be invited to attend a recruitment day or an interview. This is your opportunity to visit our office, speak with our people, and ask questions about life and work at EY.Step 5: ReceiveIf you are a great fit for the opportunity, you will receive an offer to join EY and begin your career at one of the best companies to work for. It’s time to celebrate.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}