{"Job ID": "69873130", "Description": "Excited to grow your career?We value our talented employees, and whenever possible strive to help one of our associates grow professionally before recruiting new talent to our open positions. If you think the open position you see is right for you, we encourage you to apply!Our people make all the difference in our success.--------------------------------------------------------------Responsibilities:This role is for Performance Test Analyst (IT Quality Analyst 2 - C10) who will take ownership of one or more applications Performance testing solutions & play SME role to engage with Development, Architect & Business team to gather the requirements & design the Performance testing approach to certify the application changes before Production deployments. This role required to work closely with Global NFT team. Person should have strong knowledge to lead Non-Functional Testing (Performance Testing & Engineering) for applications with complex architecture and should have exposure in monitoring, profiling & analyzing with industry standard tools. Responsibility includes conducting performance impact assessments, testing approach, planning, execution, application profiling, metrics analysis, reporting and risk management. Person in this role should be capable of performing independently, capable of handling deliverables without need of monitoring. Should be capable of leading 1-2 members team.Primary Skills: Performance Testing & Engineering. Tools: MF Loadrunner Enterprise with Web, Web Services (Rest, Microservices), MQ (Java), AWR analysis, AppDynamics Profiling, Kibana & Log Analysis, CA Service Virtualization (LISA).Ability to assess & design the standalone component or End to End Testing approach connecting multiple components in payments flowThe implementation and execution of a performance test framework for non-functional testing (load, volume, stress, capacity and scalability) which validate business non-functional requirements.A strong knowledge of Monitoring tools that allow for analysis of system health and potential bottlenecks. i.e. App Dynamics, Kibana, BMC TrueSight, etcProduce and maintain Key Performance Indicators (KPIs) around the testing performed. Manage best in class service quality and manage SLA/OLAs accordinglyIn-depth knowledge and working experience with Performance Center, App Dynamics, HP Site scope and other latest Performance Engineer & Performance Testing tools (i.e. CA Lisa Virtualization) and Open Source performance testing tools (Apache JMeter, WebLOAD etc)A strong knowledge of / experience with profiling application end to end performance and identifying application and hardware / operating systems bottlenecksExperience in identifying and providing tuning recommendation for various infrastructure components such as Application Servers, Database Servers, Message Buses and Web ServersExperience of working in Agile testing methodologyGood collaboration & ability to communicate with technical & non-technical stakeholdersSupport active contribution in creating performance testing artefacts including Performance test strategy and test plans/estimates, optimization & KPI reports.Collaboration with other teams including Development, Architect, Business and Production SupportIdentify, recommend, and implement framework, strategies, and toolsets to optimize test execution, expand test coverage, and reduce riskStrive towards the continuous process improvement & test framework / scripts optimization to achieve efficient testing solutionsAttention to details & ability to automate repetitive tasksExhibits good understanding of procedures and concepts within own technical area and a basic knowledge of these elements in other areas.Requires basic understanding of how own area integrates within IT Quality to achieve objectives.Good to have technical & programming knowledge with one or more languages i.e.  Java, JavaScript, C#, Python, Ruby, etcBusiness domain knowledge of Corporate Digital Channels, Payments, Receivable, Treasure & Trade will be added advantageGood to have exposure for developing stubs and driversQualifications:4-7 years experience in an IT Quality role. Ability to work independently or within groups on projects assignedRequires in-depth knowledge, understanding and analytical thought. Exhibits comprehensive knowledge of several areas within IT Quality and has a good understanding of the industry.Strong understanding of testing processes. In depth understanding of the Systems Development Lifecycle and solid experience in several phases of systems development, preferably in testing program management. Must demonstrate confidence in their abilitiesEducation:Bachelor’s/University degree or equivalent experience-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}