{"Job ID": "69873612", "Description": "Position status: This opportunity is for a secured role that is due to commence in November subject to approval. If you would like to be considered as we progress with this position, please click to apply.The opportunityMace is an inclusive employer and welcomes interest from a diverse range of candidates. Even if you feel you do not fulfil all the criteria below, please apply as you may still be the best candidate for this role or another role within our organisation. Should you require any adjustments to assist during the application/hiring process please advise us.Project: This opportunity is to be involved in a major mixed-use development, in Riyadh. The programme consists of over 200 projects including cultural and heritage assets, F&B, retail and hotels, commercial buildings, and educational facilities. Mace is currently providing programme management and looking for high-calibre Mace is currently providing programme management and looking for high-calibre experienced people. We are hiring an ambitious and forward-thinking senior planning manager to join our established and growing team in Saudi.The role needs to have the ability to play a key role in multidisciplinary teams and take a lead role in creating plans or analysing trends using numerical and statistical techniques. To supervise and manage a team of professionals delivering planning/schedule management services and is responsible for staff development.Your responsibilities will include:Directing the application of specific planning/scheduling methods, techniques and tools. \nAdvising on complex requirements and communicating analysis and corrective measures effectively. \nManaging the planning/scheduling delivery of medium/high projects/programmes. \nProviding effective and timely advice to clients. \nUnderstanding of data management. \nUnderstanding the role and future career paths available from that position. \nProviding excellent attention to detail and ability to validate and check schedule management inputs, recording and reports produced, providing basic commentary and analysis.About youWith a relevant degree qualification, you will take personal development seriously and be chartered or pursuing a similar level of professional qualification.You are digitally savvy, can build lasting client relationships and lead strong, motivated teams. You will have a construction or project management background and be hungry to grow your career and enjoy the opportunities Mace has to offer.If you would like to make a confidential enquiry, please contact Dominika Oleksy in the recruitment team.Please remember the Employee Referral Scheme and if there are any talented people you can recommend, just click the button and use the ‘Refer a friend’ feature found within the relevant job.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}