{
    "Job ID": "69874160",
    "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting, and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of the next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.We at Publicis Sapient, enable our clients to Thrive in Next and to create business value through expert strategies, customer-centric experience design, and world class product engineering.The future of business is disruptive; transformative; and becoming digital to the core.In our 20 + years in IT, never have we seen such a dire need for transformation in every major industry, from financial services to automotive, consumer products, retail, energy, and travel.Your Impact:You will work in the spirit of agile & a product engineering mindset - delivering the sprint outcomes, iteratively & incrementally, following the agile ceremonies\nYou will groom the stories functionally & help define the acceptance criteria (Functional & Non-Functional/NFRs) collaborating actively with stakeholders - locally & in client org., understanding end-to-end customer requirements\nYou will actively contribute in technical grooming, brainstorming & whiteboarding design sessions to define & articulate the solution approaches, to identify tasks & estimates, and to document the module/sub-system design with their interfaces & wireframes\nYou will have breadth of concepts, tools & technologies to address NFRs like security, performance, reliability, maintainability and understand the need for trade-offs\nYou will bring in expertise to optimize and make the relevant design decisions (considering trade-offs) at the module / components levelYou will be a polyglot with a PE mindset – Open & Curious, learning & adopting new languages, platforms & toolkits constantlyYour Skills & Experience:You have 3+ years of professional work experience building large-scale, large-volume services & distributed apps., taking them through production and post-production life cycles.\nYou use more than one programming language with expertise in at least one; Ex:\nMemory Management, GC, Templates/Generics, Closures, etc.\nMulti-Threading, Sync/A-Sync.; Blocking/Non-Blocking execution styles\nYou practice Imperative, Functional Programming styles\nYou are aware of Cloud Platforms like AWS, GCP, Azure, etc.\nYou are a problem solver choosing the relevant data structures, and algorithms considering the tools for Time & Space Complexity\nYou apply SOLID, DRY design principles, design patterns & practice Clean Code\nYou are an expert at String Manipulation, Data/Time Arithmetic, Collections & Generics\nYou practice & guide on handling failures à Error Management & Exception handling\nYou build reliable & high-performance apps leveraging Eventing, Streaming, Concurrency, Multi-Threading & Synchronization libraries and frameworks\nYou develop web apps using HTML, CSS, Javascript & relevant frameworks (Angular, React, Vue)\nYou design and build microservices from the ground up, considering all NFRs & applying DDD, Bounded Contexts\nYou use one or more databases (RDBMS or NoSQL) based on the needs\nYou deploy to production, troubleshoot problems & provide live support\nYou understand the significance of security aspects & compliance to data, code & application security policies; You write secure code to prevent known vulnerabilities; You understand HTTPS/TLS, Symmetric/Asymmetric Cryptography, Certificates\nYou use one or more Web Application Frameworks\nSpring or Spring Boot or Micronaut (Java)\nFlask or Django (Python)\nExpress or Meteor or Koa (Node)\nAsp.net MVC, WebApi or Nancy (.Net)\nYou use one or more messaging platforms (e.g. JMS/RabbitMQ/Kafka/Tibco/Camel)\nYou use Mocks & Stubs & related frameworks (Moq)\nYou use logging frameworks like Log4j, NLog, etc.\nYou use build tools like MSBuild, Maven, Gradle, Gulp, etc.\nYou understand and use containers, virtualization\nYou use proactive monitoring & alerting, dashboards\nYou use Logging/Monitoring solutions (Splunk, ELK, Grafana)Set Yourself Apart With:You understand infra. as code (cattle over pets)\nYou understand reactive programming concepts, Actor models & use RX Java / Spring React / Akka / Play, etc.\nYou are able to set up a CI/CD pipeline infrastructure & stack from grounds-up\nYou are able to articulate the pros, cons of designs & tradeoffs\nYou are aware of distributed tracing, debugging, and troubleshooting\nYou are aware of side-car, service mesh usage along with microservices\nYou are aware of distributed, cloud design patterns & architectural styles\nYou are aware of gateways, load-balancers, CDNs, Edge caching\nYou are aware of gherkin and cucumber for BDD automation\nYou are aware of performance testing tools like JMeter, Gatling\nYou are aware of one search solution like ElasticSearch, SOLR, Endeca\nYou are aware of one distributed caching solution like Redis, MemCache, etc.\nYou are aware of selenium for UI automation\nYou are aware of Rules engines like Drools, Easy Rules, etc.A Tip from the Hiring Manager:Software Development Engineers (SDE-I) are bright, talented, and motivated young minds with strong technical skills, developing software applications and services that make life easier for customers.\nThe SDE-I is expected to work with an agile team to develop, test, and maintain digital business applications.\nAs an SDE-I you will get an opportunity to work with industry-leading clients and global teams to solve complex business problems and build your skills on the full stack of application development technologiesEducation:Bachelor’s/Master’s Degree in Computer Engineering, Computer Science, or a related fieldGender Neutral Policy\n18 paid holidays throughout the year.\nGenerous parental leave and new parent transition program\nFlexible work arrangements \nEmployee Assistance Programs to help you in wellness and well beingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}