{
    "Job ID": "69875608",
    "Description": "It’s an exciting time to be at Infoblox. Named a Top 25 Cyber Security Company by The Software Report and one of Inc. magazine’s Best Workplaces for 2020, Infoblox is the leader in cloud-first networking and security services. Our solutions empower organizations to take full advantage of the cloud to deliver network experiences that are inherently simple, scalable, and reliable for everyone. Infoblox customers are among the largest enterprises in the world and include 70% of the Fortune 500, and our success depends on bright, energetic, talented people who share a passion for building the next generation of networking technologies—and having fun along the way.We are looking for an HR Generalist to join our global People & Places team in Bangalore, reporting to the India HRBP site lead. In this role, you will be responsible for translating business objectives into effective and reasonable organizational solutions and outcomes. You will also assist in the alignment of the organization toward the business strategy plan, to ensure we have the right talent and that the level of resources within business groups are aligned appropriately to meet ever-changing business needs.You are the ideal candidate if you are a highly motivated collaborator with excellent communication skills. You are passionate about helping employees and are excited to be a part of business transformation as our HR Operations and HR Business Partners (HRBP) come together to form a strong HR Shared Services delivery model. This role will be based out of Bangalore office (hybrid)What you’ll do:Support and assist the global HRBP team while also serving as a liaison between the HRBPs and other Centers of Excellence (COE) teams\nDrive issues to resolution and escalate unresolved matters to management in a timely manner, including developing options and making recommendations\nWork proactively with key global partners and stakeholders to build world-class employee experiences to ensure an integrated approach to HR service delivery\nServe as first point of contact for all Tier 1 and some Tier 2 HR inquiries from our employees regarding benefits, policies, employee data, and HR processes and systems; escalate as appropriate to other HR functions including Benefits, Compensation, Talent Acquisition, HRIS, DE&I, IT, and business partners\nMaintain HR records including entering, processing, and auditing employee data within Workday\nBuild and maintain reports within Workday to assist HRBPs and business leaders with tracking and reporting of key people data and analytics across the organization\nMaintain a customer service-focused and user-oriented attitude and always bring a continuous improvement mindset toward operational excellence\nWork with the local employee engagement clubs to ensure delivery of good quality events. Bring the HR perspective during the ideation process.\nParticipate in other companywide initiatives and projects as neededWhat you’ll bring:Great attitude, pleasant demeanour, and passion for collaborating and working in a team environment to solve challenging problems\n0 - 1 years of experience in HR in a fast-paced environment with emphasis on operations and process\nStrong attention to detail for data integrity management\nDemonstrated success in supporting a multi-country organization—experience with an HR shared services or helpdesk model a plus, but not required\nDemonstrated success in managing and working with highly sensitive and confidential information\nAbility to multi-task and prioritize\nDemonstrated ability to successfully work with peers and internal customers at all levels\nKnowledge of supporting multiple HR disciplines (compensation, benefits, learning and development, stock administration, immigration, staffing, HRIS, and reporting)\nExcellent process skills, documentation, and in-depth analytical skills—innovative problem solving, resiliency under pressure\nA full-time degree of MBA, MSW with specialization in HR from a UGC recognized University in IndiaWhat success looks like:In the first six months, you will…Develop strong business relationships with the key stakeholders at India region\nBecome familiar with all Infoblox core policies, processes, and best practices\nStart to help document and set up new HRBP frameworks and infrastructure improvementsAfter about a year, you will…Own and manage all HR Operations processes related to the global HRBP team\nLead with influence during cross-functional HR Operations projects and activities across India region\nBe seen as an HR Operations expert for the global HRBP teamWe’ve got you covered:Our holistic benefits package includes coverage of your health, wealth, and wellness—as well as a great work environment, employee programs, and company culture. We offer a competitive salary and benefits package, including industry-best insurance benefits and generous paid time off to help you balance your life. We have a strong culture and live our values every day—we believe in transparency, curiosity, respect, and above all, having fun while delighting our customers.Speaking of a great work environment, here are just a few of the perks you may enjoy, depending on your location…Delicious and healthy snacks and beverages\nElectric vehicle charging stations\nAmenities include onsite gym, table tennis, pool table, and courtyard\nNewly remodeled offices with state-of-the-art amenitiesWhy Infoblox?We’ve created a culture that embraces diversity, equity, and inclusion and rewards innovation, curiosity, and creativity. We achieve remarkable results by working together in a supportive environment that focuses on continuous learning and embraces change. So, whether you’re a software engineer, marketing manager, customer care pro, or product specialist, you belong here, where you will have the opportunity to grow and develop your career. Check out what it’s like to be a Bloxer. We think you’ll be excited to join our team.\n\n#L1-SK2Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}