{"Job ID": "69870244", "Description": "Full-time Housekeeper required in Sevenoaks and Chelsea, UK, salary £45,000 – £50,000 gross per annum. Live out. Start ASAP\nA high-profile client located between their two properties in Sevenoaks and Chelsea is searching for an exceptional Housekeeper to maintain their two homes to a high standard.\nAs a housekeeper, you will undertake daily duties to maintain the household. Duties will include general upkeep of the family household, assisting with daily cleaning, washing, laundry, ironing, and maintaining the household to a high standard.\nThe home in Sevenoaks is 6 bedrooms and the home in Chelsea is 3 bedrooms. Your time will be split between the two properties.\nThe clients are lovely, with two older children in the home who are currently studying for their GCSE’s and A Levels. The family would love to find a candidate who will remain with them long term and if happy to do so act as guardian within the home should they take an occasional trip. Both children are fully independent.\nThe ideal candidate will be an experienced housekeeper who is dedicated, passionate and excelling in her career. You must be hard-working, experienced, and committed. Being active and reliable is essential.\nThe working schedule will be 5 days on and 2 days off, working Monday – Friday.\nTime will be split between the two homes, with Monday, Wednesday, and Friday in Sevenoaks working from 9am – 4pm. On Tuesday and Thursday, you will be based in Chelsea working for approximately 4 hours per day.\nThis is a live-out position, therefore only suitable to candidates located in London. It is approximately 20 minutes by train from each property.\nTravel allowance may be considered.\nPackage:\nSalary on offer £45,000 – £50,000 gross per annum\n5-day working schedule\nLive out\nPaid holiday\nRequirements:\nExperienced Housekeeper\nGreat team player, dedicated and friendly\nLondon based\nStart ASAPJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Jeddah, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}