{
    "Job ID": "69873691",
    "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,500 companies and 100 Million threats detected a day.We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.  Our EMEA marketing team is looking for a seasoned Senior Marketing Manager, who will focus on strategizing and executing large-scale campaigns, promotions and activities across EMEA to drive awareness and demand for target market segments. This role will also have a primary focus in strategy development, planning, execution, maintenance, and optimization of the integrated marketing campaigns in partnership with the global and field marketing as well as the cross functional teams. Job Duties and Responsibilities: Lead end-to-end campaign management and execution of global/regional campaigns & programs across owned, shared, earned and paid media exceeding set KPIs for awareness and demand in EMEA\nWork with the global demand generation team on the EMEA content syndication program ensuring a mix of local and global vendors. Monitor results and provide feedback\nSupport country/region-specific campaigns including social/digital, when needed, in partnership with the field marketing teams\nProvide guidance to field marketing and SDR teams on campaign execution as well as collaborate with the global campaigns team, sales & channel and the rest of the GTM teams to effectively adapt, plan and execute campaigns at scale\nDevelop campaign enablement and briefing documents, run regular briefing sessions aligned with the campaign calendar with the field, SDR and Sales teams, report on effectiveness and results of campaigns \nWorking to improve the EMEA database health and increasing usable data\nProvide actionable insights and regular reporting to senior management on campaign performance, user acquisition, and revenue growth\nEnsure continuous optimisation of awareness and demand gen activities through objective review and improvement of contents and marketing mix\nLeverage and adapt various MarTech stacks in campaign design, execution and optimization\nWork with various marketing agencies to bring scale to the campaign execution\nStay up to date with industry trends, emerging technologies, and competitive landscape to identify new growth opportunities7+ years’ work experience in technology, preferable with cybersecurity tech • Bachelor's  degree required, or MBA preferably with marketing, communications, or business management \nExperience running campaigns across EMEA in multiple languages\nDeep knowledge of digital marketing and channels (web, social, SEM, display, content syndication, retargeting, webinar, email, mobile, community) including marketing automation capabilities and how to utilize them to engage target persona to drive inbound marketing\nAbility to think strategically, prioritize tasks, execute with attention to detail, and consistently meet deadline\nTech savvy and proficient in Google Suite. Knowledge of SFDC,  Marketo, Tableau, and other MarTech stack, especially ABM related tools \nExperience in extensive interaction with sales and field marketing teams, working cross-functionally in a diverse EMEA environment\nExperience in operating in a shared service (CoE) environment for digital and marketing automation execution\nAccountable for driving results with data and insights, with proven track record driving demand generation and growth. \nAbility to project and program management with exceptional organisation skills that meets or  exceeds goals, timelines, and budget.  \nExceptional written, verbal, communication, and interpersonal skills to communicate,  influence, and effectively convey information at all levels of the organisation#LI-LK2Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}