{
    "Job ID": "69876270",
    "Description": "About VERITASVeritas Technologies solves what no one else can. As the leader in secure multi-cloud data management, over 80,000 customers – including 91% of the Fortune 100 – rely on Veritas to help ensure the protection, recoverability, and compliance of their data.Veritas has a reputation for reliability at scale, which delivers the resilience its customers need against the disruptions threatened by cyberattacks, like ransomware. No other vendor is able to match Veritas’ ability to execute, with support for 800+ data sources, 100+ operating systems, 1,400+ storage targets and 60+ clouds through a single, unified approach. Powered by Cloud Scale Technology, Veritas is delivering today on its strategy for Autonomous Data Management that reduces operational overhead while delivering greater value. Learn more at Veritas.com.The Data Protection Group drives the product strategy, roadmap, and engineering delivery of the Veritas products, which includes NetBackup, APTARE,  Backup Exec, Enterprise Vault (EV), EV.cloud, eDiscovery platform, and Veritas SaaS Backup.Veritas' vision is to enable organizations to thrive in this new world of digital business.Did you know that the International Data Corporation (IDC) predicts that data will double every 2 years, reaching 44 zettabytes by 2020? That's more bytes than gallons of water in the ocean and an exponentially growing problem for businesses. Veritas helps organizations harness the power of their data & turn it into actionable insights. We believe information is everything! Data is an organization's digital currency; a critical business asset that is growing in value. We are the only company that provides a data management platform to address the core challenge of accessing, managing, and analyzing all their data, no matter where it is, in real time - allowing organizations to truly maximize the value of their data.The Appliance Solutions (AS) organization is changing the backup and recovery game for customers—built on industry-leading backup software, our appliances address the technical complexities of modern data protection and optimized secondary storage for companies of all sizes. As the fastest-growing organizations within Veritas, Appliance Solutions is in the business of solving customer problems better than anyone else. Entrepreneurial in nature, get-it-done attitude, mindset to win, culture of open, transparent communication and collaboration are the core values that drive its success.Flex is the fastest growing appliance product by Appliance Solutions (AS) organization. Flex engineering team is currently looking for motivated Principal Software engineer who not only “do” but also lead a change and make a difference. The team is always looking for passionate, dedicated individuals who are self-motivated in their work and careers.What you will be doing:Technically lead web UI development across global development team and guide other engineers contributing to UI development\nDesign, implementation and test automation of web based user interactions for new features and maintenance of existing WebUI\nWork with User experience team to define user interactions for new features/functionality\nDeliver feature/release TOIs, sprint end Demos, contribute to documentation of new features\nCommunicate and collaborate among cross-functional teams in a cross-geo environment\nLead or participate in a scrum team to continuously improve\nContribute to documentation of new features, Deliver feature/release TOIs to cross-functional organization\nWork with Support and customer focus teams on support cases escalated to engineeringWhat skills, experience, and education you need as a team member to succeed:Bachelor's/master’s degree in computer science or related field of study\n9+ years of hands-on Web UI or full stack software development experience (UI focused) on Linux platforms\nStrong development experience with Web UI technologies such as AngularJS, HTML/CSS, AJAX, HTML5, JavaScript, RESTful APIs, static and dynamic web pages, DOM manipulation, Object oriented design\nStrong development experience in designing performant and secure Web UI front ends, REST-APIs\nExperience running various security scanners, analyzing severity and addressing vulnerabilities such as cross site scripting, cross site request forgery, man-in-the-middle attack, etc.\nExperience developing automation using in Robot/Selenium etc.\nExperience working on distributed, fault tolerant, highly available systems, networking and storage systems a plus\nKnowledge of containers, virtualization technologies a plus\nUnderstanding of software architectures across storage infrastructure, security, compliance, operations, service support, and software life cycle management layers a plusAt Veritas, we care about the causes close to your heart and enable you to volunteer, donate, and do good. If you only meet some of the asks for this role, that's OK! We value a diverse range of backgrounds and ideas and believe a more diverse and inclusive workforce makes a winning team. If you have the curiosity to learn and appetite to teach what you know, we encourage you to apply. Come as you are! Interested? Apply and find out more about #TeamVeritas!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}