{
    "Job ID": "69873680",
    "Description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.About the Role:We are looking for a Corporate Travel specialist who will be responsible to manage the travel bookings and Travel meeting vendor agreements, partner with business requesters on venue selection and negotiate with vendors, provide analytics and regular reporting on travel and meeting spend.What You'll Do:Coordinate with business requesters to plan travel, meeting accommodations and itineraries (research destinations and available services and activities)\n\nEvaluate travel and meeting vendors to find the best quality for the price\n\nWork with venues to ensure timely communication of proposals and provide the best possible value to customers.\n\nCoordinate with business requesters to plan travel, meeting accommodations and itineraries (research destinations and available services and activities)\n\nAnalyze travel and meeting spend, trends, define cost benchmarks and policies\n\nAnalyze options for corporate meetings and events to find optimal locations and venues, incorporating logistics and cost effectiveness.\n\nAble to manage and guide Travel Bookings.\n\nHandle and oversee corporate travel and meeting agreements (air, lodgings etc.).\n\nManage relationships with travel and meeting agencies and vendors.\n\nWorks with Travel Category lead for Negotiating contracts or rates with travel and meeting service providers.\n\nWork with requesters to stay within policy.\n\nPrepare and deliver periodic reports on travel and meeting spend against budget\n\nMake recommendations to drive continuous improvement of travel and meeting programsWhat You'll Need:Proven  6-10 years of experience in hospitality, venue sourcing, or corporate travel\n\nComfortable to work in 12 pm to 9 pm shift\n\nTravel Helpdesk Management for Global Regions.\n\nKnowledge of travel industry players, best business practices\n\nExcellent negotiation skills\n\nAbility to analyze travel and meeting spend to identify trends and make recommendations on travel policies and programs.\n\nHighly organized, efficient, and customer service-oriented with a demonstrated desire to exceed expectations\n\nAbility to manage change effectively while being mindful of business processes and systems implications.\n\nProficient in Office applications (Word, Excel, PowerPoint),\n\nExposure on several Travel tools.\n\nHigh school diploma or equivalent; Bachelor’s degree is preferredBonus Points:High-tech, start-up, rapid growth and/or publicly traded company experience#LI-DP1#LI-VJ1Benefits of Working at CrowdStrike:Remote-first culture\n\nMarket leader in compensation and equity awards with option to participate in ESPP in eligible countries\n\nCompetitive vacation and flexible working arrangements\n\nPhysical and mental wellness programs \n\nPaid parental leave, including adoption \n\nA variety of professional development and mentorship opportunities\n\nAccess to CrowdStrike University, LinkedIn Learning and Jhanna\n\nOffices with stocked kitchens when you need to fuel innovation and collaboration\n\nBirthday time-off in your local country\n\nWork with people who are passionate in our mission and Great Place to Work certified across Asia PacificWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.CrowdStrike is committed to maintaining an environment of Equal Opportunity and Affirmative Action. If you need reasonable accommodation to access the information provided on this website, please contactRecruiting@crowdstrike.com, for further assistance.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}