{
    "Job ID": "69872673",
    "Description": "Position Summary:This role will be responsible for defining the Go-to-market (GTM) strategy for selected brands, which will be promoted only via digital channels such as website, chatbots, social media, webinars, emails etc. Digital GTM person will craft Digital Only – DO (brands with only digital HCP engagement) brand strategies and communicate campaign requirements to regional/global digital campaign execution team. The person will act in an individual contributor capacity and will track and monitor the A&P spends and allocated budget to optimize the spends. The person will also be responsible for monitoring the effectiveness of digital campaigns and accordingly, revise the brand strategy and improve the campaign planning.Major stakeholders: BUDs, Sales, Marketing, Commercial Operations (ComOps), Medical, OC PODPrimary Duties & Responsibilities:Brand Strategy, Campaign and P&L PlanningDevelops strategic plan for the select digital brands and products.\nDevelops brand goals, defines, and reviews brand positioning and competitive differentiation, digital channels, and messaging in all aspects.\nDefines the strategy for digital campaigns and collaborates with relevant regional/global team (responsible for campaign execution) for successful campaign execution.\nLeads P/L planning (including A&P spends) and budgetary control of the digital brands and its digital marketing and channels.\nMonitors sales performance to effectively market assigned products/services in collaboration with regional/global teams.\nAccountable for revenue/sales targets of DO brands.Performance TrackingMonitors, analyzes, and evaluates brand performance and customer feedback to generate new/innovative ideas to improve the brand performance and enhance the customer experience (CX)\nLiaises with regional teams to devise strategies to drive engagement of digital brands and products, tracking conversion rates and driving ongoing timely improvements.\nActs on content effectiveness insights to ensure an optimal mix of scientific / promotional / pull & push content for meeting the information needs of the target customers, with the right usability, design, and purposeful content.Cross-Functional CollaborationShares campaign requirements with relevant regional teams to support the delivery and execution of local brand strategy.\nLiaises with regional teams to design campaigns and collaterals for the product/service that are effective and appropriate for the target HCP segment.\nWorks collaboratively with the Business Unit Directors (BUDs), and medical teams to incorporate local HCP insights & brand objectives/ performance goals in campaign planning.Project Management & SupportLiaises with regional teams on an ongoing basis to design, execute, monitor and refine the campaigns for the DO brands. \nFormulates a clear and well-communicated project management plan for digital GTM execution.\nInitiates and supports the selected local activities to achieve digital impact and other relevant growth targets across brands.Experience & Educational Qualifications:Bachelor’s Degree in Pharma, Sales, Marketing, or any other related discipline. MBA preferred. \n5 + years of recommended total experience, including experience in brand management, marketing, or customer engagement in pharmaceutical industry.Preferred Certifications:Digital Marketing Certifications\nBrand Management Certifications\nData Analytics Certifications\nProject Management CertificationsSkills & KnowledgeTechnical Skills:Brand Strategy & Management – Ability to define the brand strategies for digital brands and drive their implementation.\nBrand Marketing – Ability to define digital campaign goals for digital brands and track campaign execution to revise the brand strategy and improve the campaign planning basis effectiveness.\nPlanning & Budgeting – Ability to perform financial analysis to set revenue targets, allocate appropriate budget, track spends, and optimize the cost.\nDigital Campaign Management - Ability to design, plan and optimize digital marketing campaigns across various digital channels and platforms.\nDigital Channel Strategy - Ability to devise a plan for engaging with the HCPs through their preferred set of digital channels in the right frequency and sequence.\nCustomer Experience Management - Ability to design and manage the end-to-end HCP experiences across all digital touchpoints and channels in the campaign user journey to maximize customer satisfaction.\nDigital Marketing - Ability to engage with HCPs through various digital channels, such as search engines (SEO/SEM), social media, emails, websites, etc. to increase the reach and engagement. \nCampaign Analytics & Reporting - Ability to analyze, measure and report effectiveness of OC digital campaigns and use it as a feedback loop for optimizing the future campaigns.\nKPI Tracking & Monitoring - Ability to set digital campaign/content/channel performance goals and metrics, timelines and ensure a formal tracking process is established to measure and manage the progress.Behavioral Skills:Ability to effectively collaborate with regional/global digital campaign execution team and clearly communicate the campaign requirements for efficient digital campaign execution.\nAbility to network and influence effectively across functions and teams to accelerate digital transformation.\nAbility to effectively articulate complicated information/data in a way that others can comprehend.\nAbility to drive the results and meet P&L targets through effective digital customer engagement.\nAbility to successfully build & manage strong relationships with key stakeholders to achieve business objectives.Tools Knowledge:Working knowledge of MS Office suite\nWorking knowledge of CRMs like Veeva, Salesforce\nFamiliarity with Web Analytics tools like Google Analytics\nFamiliarity with Marketing automation tools like SFMC, Pardot*LI-GSK #omnichannelWhy Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Contact information:You may apply for this position online by selecting the Apply now button.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}