{"Job ID": "69870401", "Description": "Graphic Designer PoolLocation: Egypt (Work from home)Contract: 12 Months Hours: 37.5 hours per week (Self employed contract, you will be responsible to pay your own taxes)Salary: $5.50 USD per hourAbout TwinklTwinkl’s mission is to “help those who teach”, and from our humble beginnings in the UK we have since grown to become one of the largest digital educational publishers in the world. For over a decade now we have been providing educators across the world with high quality, trusted teaching resources for their classrooms, homes and learning centres.This roleAs a Graphic Designer at Twinkl, you’ll join a small production team made up of Teacher Content Writers, Teacher Content Editors, Illustrators and Graphic Designers to produce a wide variety of beautiful learning materials that will be downloaded, printed, and utilised for learning in education settings around the world. Upon joining, you’ll undergo 3 weeks of foundation training learning about our brand guidelines, design templates, software and working methods, giving you the tools needed to be a fantastic, efficient and effective designer of educational materials.Once training is completed, you’ll utilise programs such as InDesign, PowerPoint and Word to work through a steady stream of editorial and layout design work, collaborating with the qualified teachers who write and check the content for our resources before they’re uploaded to our website. Within Country/Product teams we create different types of resources covering all areas of the curriculum and across a wide age range every week. The resource types and age range you will be working on will depend on the team you join. As such, you should be passionate about education and excited to contribute to a market-leading business that helps teachers spend more time with children and less time doing the admin that surrounds it.A little about the culture within designThis position is a 12-month contract for 37.5 hours per week of work. As a self-employed position, it comes with lots of flexibility in how you manage your schedule, but unlike many other freelance roles you’ll be welcomed into and feel very much a part of a focused team that meets regularly via video call, collaborates together and works closely as its own production unit. This is a great environment for anyone looking for a close knit, communicative and friendly work environment, but less well suited to those who would prefer the total flexibility and independence that shorter term, project based freelance positions offer.As a designer at Twinkl, you’ll also benefit from being part of a global community of 200+ Graphic Designers across different levels of experience, backgrounds and specialisms. The team regularly shares and celebrates the excellent work that they produce with each other, as well as running forums to share knowledge, tips and tricks to keep your design practice as sharp as possible.ApplyingIf you are interested in becoming part of the amazing Twinkl design team, send us your CV and portfolio of your best editorial and layout design work (think magazines, booklets, posters and anything that involves heavy text) and we may be in contact to discuss adding you to our Graphic design pool. When suitable roles become available, we’ll get in touch regarding the next steps of the recruitment process. Being in the pool does not prevent you from applying for other Twinkl roles, so please keep a lookout on our careers page too.How you’ll spend your day:Your morning may start with a short video call with the rest of your production team. This meeting gives everyone a chance to update on what you’re working on, highlight any blockers and review priorities. It’s also a chance to have a chat with your colleagues and set you up for the day ahead!\nDay to day, you’ll use InDesign, PowerPoint and Word to work on creating the highest priority resources in your team's production backlog. This work lives in a project management system called “Jira”, which you’ll receive full training on when you join.\nYou may also have a regular catch up with your line manager to check in on how you’re feeling and the work you’re involved in. Or a CPD (continuous professional development) session organised by the training team. There’s always lots to get involved in if you’re interested in growth within the business.To succeed in the role, you will:Have excellent English language skills.\nHave strong experience in InDesign.\nHave experience of following brand guidelines.\nBe able to take on feedback and use this to further develop your designs.\nHave an eye for detail, creativity and imagination.\nBe proficient at managing workload and meeting targets and deadlines.\nCare about education and helping teachers and learners across the globeIn this role, you will learn:How to be an in-house designer within a professional workplace.\nLearn and understand the resource lifecycle from our teachers writing the content to our users downloading the content to teach.\nLearn the importance of the end user, accessibility and functionality.\nTo work in an Agile production team environment.\nWork with other Twinklees across the business through live briefs and workshops to improve your design practice.\nOpportunities to learn more about different areas within Twinkl via shadowing.You’ll work with:An international team of designers, illustrators & teachers to create our world renowned teaching materials.\nA team leader and a team of 200+ designers from other products who you can share ideas and solutions with.\nA variety of people from other departments in the business.Equipment ChecklistWhat is Provided by Twinkl?Twinkl Google account (access to Gmail, Google Calendar, sheets etc…)\nAccess to Adobe account\nAccess to Microsoft Office\nTwinkl AccountWhat you will need to provide:Reliable internet connection - use speed checkers such as fast.com to check connection.\nMinimum speed:\n16Mbs download\n8Mbs upload\n50ms average latency when pinging 8.8.8.8\nShould be able to be on a call with 10 people, having camera and microphone on, with no connection issues\nComputer or laptop, Recommended spec:\n10th or 11th Generation Processor\n16Gb RAM\n512 SDD Hard drive\n(This allows for all necessary programs and systems to run optimally)Two monitors is preferable but not required. This allows for design working space and with content and other necessary tabs open.\nMouse\nWebcam (and microphone facility)\nAdequate working space - ideally a desk size that is at least 84cm across and 70cm deepOther ConsiderationsGood working environment free from distractions\nBoundaries in place to separate work from home lifePlease submit a reduced design portfolio (no more than 10 pages) on a PDF with your application so we can understand your skills and suitability. If successful in acquiring an interview we will ask you to present your portfolio. What we look for in a strong portfolio is editorial and layout designs. This can be from magazines, booklets, posters and anything that involves heavy text.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}