{
    "Job ID": "69873703",
    "Description": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. \nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!Adobe's solutions meet the needs of a diverse customer base that spans from consumer to enterprise. Adobe Document Cloud is a complete portfolio of secure digital document solutions that speeds business transactions through 100% digital workflows. It includes Acrobat DC and Adobe Sign services, plus web and mobile apps that integrate into your existing document processes, productivity apps, and systems.The challengeAs the Adobe Document Cloud Enterprise Sales Account Manager, you will be responsible for accelerating the growth of Adobe Document Cloud to net new customers in India across few Enterprise verticals like BFSI, ITES, Conglomerates etc. – this is very much a “Hunter” role. You will be a seasoned sales professional preferably working in new businesses who can identify strategic business opportunities and work independently or in partnership with Adobe Sales teams to achieve the revenue targets. This role is instrumental in contributing to a high performing sales culture and requires a highly passionate, confident and influential person who can develop strong business relationships internally and externally.What you’ll doIdentify whitespace and greenfield opportunities for Adobe Document Cloud across Enterprise verticals and develop a list of target accounts.\nDevelop actionable, strategic sales plans for your target accounts and identify required resources.\nEvangelise Adobe Document Cloud with prospects and customers and work with internal pre-sales resources and/or partner to develop the right solution for the customer.\nContract negotiations with customers\nBuild team brand and personal brand by achieving top internal and external customer service.\nUtilise Salesforce.com for end to end pipeline management by building strong working relationships with the various sales teams and field marketing teams.\nLearn, have fun, and get things done!What you need to succeed15+ years Direct Enterprise Sales experience in software and/or SaaS solutions.\nSelling to FSI, Telcos, Government, and Healthcare verticals highly regarded.\nAbility to understand complex business environments and uncover customer issues, process problems, and translate need into business opportunities.\nComfortable talking with prospects and internal/external customers and building relationships and monetising them.\nStrong ability to demonstrate value propositions & ROI in complex environments to a wide variety of individuals; technical and/or executive audiences.\nInnate sense of what is important and what is not in the context of prospecting/sales cycle (ability to prioritise). Ability to build, run and manage accurate pipeline and forecasts.\nAbility to work in a fast paced, changing environment while still providing quality opportunities and driving revenue.\nExceed sales targets while aiding the entire organisation to do the same.\nStrong entrepreneurial personality, self-motivated and self-managing.\nHighly ethical; will always do what is right by the organisation and customer over personal gain.\nStrong capacity to develop key relationships quickly with customers and technical audience.\nStrong ability to talk at a detailed level about Adobe Document Cloud.\nStrong written and verbal communication, as wells as time management skills.\nStrong team orientation and ability to build cross-functional relationships.\nYou can work with a minimum of supervision and be capable of strategically prioritizing multiple tasks in a proactive manner.Cultural attributesYou are capable of adopting the ideas of others (even if they conflict with your own) for the sake of the company and client. \nAs a member of the Adobe enterprise team, confidentiality, courtesy, discretion and diplomacy are table stakes. Our team grows with being a trusted advisor to our leaders and a trusted resource for our clients. Every member of our team is expected to act with the utmost integrity and professionalism at all times and to put our customers in the center of the room.\nYou are a driven teammate, collaborator, and relationship builder whose infectious can-do attitude inspires others and encourages great performance in a fast-moving environment.\nYou thrive in a fast-paced, changing environment and you're excited by the chance to play a large role.Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}