{"Job ID": "69874201", "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.Bring deep, hands-on technology expertise to the table on the Mobile platform and will be responsible for supporting delivery teams through architecture, design, and building in the capacity of a technology subject matter expert on the Mobile platform. PRIMARY RESPONSIBILITIES Implement robust app architectures and complex user interfaces\nComponent Design and coding new features. includes unit tests, debugging, and solving defects\nComponent Design/Coding/Unit Testing/Debugging\nResponsible for designing app architecture and integration design to various external systems (APIs, 3rd Party SDK)\nFollow best practices using React Native Guidelines\nGood understanding of react design patterns like HOC, Render props, and their applications.\nGood understanding of atomic design principles\nExperience with CSS-in-js / styled-components\nGood understanding of Android & iOS working principles, Release process\nGood interpersonal and communication skills\nConstantly research and adopt new technologies / best practices\nA strong and innovative approach to problem-solving and finding solutions\nAbility to multi-task under pressure and work independently with minimal supervision\nWork on high-performance consumer-facing appsMin 6-9 years of experience in Mobile application development \nMin 2-year Experience in React Native app development\nFirm grasp of the JavaScript {{and TypeScript}} language and its nuances, including ES6+ syntax Follow best practices using Android Guidelines\nKnowledge of {{functional or object-oriented}} programming\nTechnically strong in React-Redux/Mobx development and deep understanding of core mobile concepts such as lifecycle, UI, networking, caching, device features, etc\nExperience with automated testing suites, like {{Jest or Mocha}}\nExperience integrating third-party frameworks. Worked with logging and capturing user navigation and app usage to Analytics and Crashlytics for understanding the most used features by users.\nKnowledge of mobile security and cryptography is an advantage. \nGood working knowledge of tools such as Git, JIRA, Jenkins, or any tools that are similar to these. \nExperience with agile methodology is preferred \nGood communication skills\nGood knowledge of app telemetry integration & app performance management\nHave published at least 2 React Native apps on Play Store & Appstore EDUCATIONFull time Bachelor’s /Master’s degree (Science or Engineering preferred).Gender-Neutral Policy\n18 paid holidays throughout the year for NCR/BLR (22 For Mumbai)\nGenerous parental leave and new parent transition program\nFlexible work arrangements\nEmployee Assistance Programs to help you in wellness and well being  Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}