{"Job ID": "69870426", "Description": "About Glovo:We’re a Barcelona-based startup and the fastest-growing delivery player in Europe, Africa, and Western Asia. With food at the core of the business, Glovo delivers any product within your city at any time of day.At Glovo, you’ll have the job of your life while working together towards our shared vision to give everyone easy access to anything in their city. We welcome top performers that will bring new ideas, diverse perspectives, and provide you the opportunities and freedom to grow and make a real impact on millions of lives… all while having fun!We believe that diversity adds incredible value to our teams, our products, and our culture. We know that the best ideas and solutions come by bringing together people from all over the world and by fostering a culture of inclusion where everyone feels heard and has the chance to make a real impact. It's because of this that we are committed to providing equal opportunities to talent from all backgrounds.&nbsp;In your application, please feel free to note which pronouns you use (For example: she/her/hers, he/him/his, they/them/theirs, etc).Your work-life opportunity:As part of the Sales team you will be directly responsible for partnering with both smaller local stores and bigger brands to display them on our Glovo platform. You will work with the support of other sales executives and be part of a local cross-functional team.As a Glovo Sales Executive, you will be a key representative of our company’s sales team, responsible for creating a pipeline of and signing up local stores and corporate customers around the cities of your region.&nbsp;Be a part of a team where you will:Be an expert in all the tools (Salesforce and dashboards) and you can give feedback to the management on the new developments needed.\nBe an expert on how Glovo Sales Executive methodology way of working works and you apply it perfectly.&nbsp;\nBe an expert on report all daily sales activity (Calls, Mail, Meetings, etc) and Keep detailed notes on leads and opportunities interactions and apply it\nAnalyze results and identify your opportunities to achieve your targets. Meet daily input targets (Tasks, leads and opps impacted) and monthly/quarterly objectives for Sales Executive Level II defined by the company\nBe a perfect buddy for new joiners (SE I and Interns) due to your tools and Glovo Sales Executive way of working methodology works\nContact new partners Level II to source and negotiate the best conditions for partners and Glovo\nBe responsible for the leads clean up in your pipeline\nActively collaborate with your colleagues and learn from each other in a supportive environment that allows you to grow, develop and make a differenceYou have:Full professional level in the local country and fluency in English is a must\nMinimum 1 year of experience in Sales – key contacts in the industry\nA methodological fast learning method and familiar with CRM tools (Salesforce, Dynamics, etc)\nExperience in start-up environment is a plus\nBachelor of Business Administration, Marketing or Public Relations is a plus\nExcellent communication skills\nAn empathetic, inclusive and curious attitudeWe are always looking for the best candidates, so if you think you would be a good fit even if you don't meet 100% of the requirements we would love to hear from you!Experience our Glovo Life benefits:Top-notch private health insurance\nMonthly Glovo credit to spend on our restaurant products and zero delivery fee on all Glovo orders!\nFlexible time off (take the time you need) and hybrid working model (own your time)\nEnhanced parental leave including nursery support!\nOnline therapy and wellbeing benefitGas: Driven to deliver quality results quickly\nGood Vibes: Bring positivity and communicate openly\nStay Humble: Self-aware and open to learning\nCare: Uplift people and the planet\nGlownership: Act as proud owners\nHigh Bar: Focus on Top PerformanceGlovo is transforming the way consumers access local goods, enabling anyone to get almost any product delivered in minutes. Our on-demand logistics connect customers with independent local couriers who acquire goods from any restaurant or store in a city, as well as deliver urgent packages for a variable fee.&nbsp;For additional information on Glovo, please visithttps://about.glovoapp.com/Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Tunis, Tunisia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}