{"Job ID": "69873585", "Description": "Company DescriptionWork with Us. Change the World.At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations.There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of nearly 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world.We're one global team driven by our common purpose to deliver a better world. Join us.Job DescriptionPerforms specific and moderate portions of a broader assignment of an experienced engineer.\n\nGathers and correlates basic engineering data using established and well-defined procedures.\n\nWorks on detailed or routine engineering assignments involving calculations and relatively simple tests.\n\nProposes approach to solve new problems encountered using modifications of standard procedures or methods developed in previous assignments.\n\nIdentifies discrepancies in results.\n\nProvides guidance to entry level engineers.\n\nPerforms work in accordance with agreed upon budget and schedule with little supervision.\n\nIndependently performs all the tasks necessary to complete primary designelements for engineering works.Performance at this level requires developmental experience in a professional position.Responsibilities:Preparation of all design stages of road geometry, signing and marking, ancillary works of major urban and inter-urban road projects, incorporating tunnels, sophisticated grade separation interchanges, and service roads, investigation of alternatives, route selection and preparation of the main items of bill quantities.\n\nAssigning work to junior engineers, supervising work, acquiring Road Design approvals.\n\nCoordination with local authorities for Road geometry, TIS approvals.\n\nResponsible for the submission, discussion and follow up with local authorities for approvals and permits in coordination with department local authority Engineer.\n\nWork coactively with the design team, collaborate closely with sub-consultants and liaising with clients ensuring their satisfaction.\n\nResponsible for acquiring Road Design approvals, work closely with TIS consultant in obtaining approval from the concerned authorities.\n\nProvide design support during the construction stage.\n\nLeads a highway team, leads the highway design work, and coordinates with other design disciplines.\n\nCoordinates and communicates with the client.\n\nPerforms interdisciplinary reviews and provides coordinating data to ensure a compatible design.\n\nUnderstands and applies company commonly used design standards and methods.\n\nPrepares manpower estimates.\n\nDesign of grade-separated interchanges and complex interchanges.\n\nDesign of junctions of roundabouts and signalized junctions both horizontally and vertically, and the development of site grading.\n\nDesign the Roads in 3D environment.\n\nDesign of road cross-sections and generating earthwork quantities from the 3D model.\n\nPavement design and pavement design reports.\n\nBe able to prepare the required presentations to client using PowerPoint or any other applicable software.\n\nReviews supplier data as required.\n\nReads supplier manufacturer drawings.\n\nCompletes additional duties as assigned.Minimum Requirements:Senior Roads & Highways Design Engineer Experience:\n\nMinimum of 10 years of experience in the UAE and KSA working on public and private sector projects at least 5 years of which are with a recognized Consultancy or PMC\n\nApproved status with DMT and RTA is preferred.\n\nKnowledge with the local authority procedure, standards and regulations in UAE and KSA is essential.\n\nExpertise in Civil 3D.\n\nConversant with local authority approval procedure related to road design. including authority NOC/approval/permit procedure.\n\nExcellent interpersonal, communication and presentation skills.QualificationsBEng or MEng in Civil engineeringAdditional InformationAbout AECOMAECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.Freedom to Grow in a World of OpportunityYou will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.All your information will be kept confidential according to EEO guidelines.ReqID: J10094481Business Line: TransportationBusiness Group: DCSStrategic Business Unit: ME and AfricaCareer Area: EngineeringWork Location Model: On-SiteJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}