{
    "Job ID": "69872581",
    "Description": "Java Developer 4.5-8 yearsMumbaiPrime Brokerage Technology Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions, and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com Prime Brokerage Technology Fund Services business provides various services to Hedge Funds like Investor Accounting, Portfolio Accounting, Analytics, Reconciliation etc. Fund Services Technology team builds and maintenance software to help Fund Services Business to meet their business goals. Fund Services functionality is a core area of Prime Brokerage business which makes Morgan Stanley Prime Brokerage business unique compared to other banks. Fund Services is currently one of the expanding areas in Prime Brokerage and huge investments are currently made in IT to expand the business. Fund Services Technology team currently have 100 plus software developers located in New York, Mumbai, Glasgow and Bangalore, now looking at expanding the technology team in London. Job Profile Looking for an enthusiastic new team member who is familiar with Any object-oriented programming language, with willingness to learn and work on any modern technologies Writes clean code and has good software design principles Enjoys the full SDLC life cycle from working with users to get requirements, coding and releasing to production. Follows TDD, BDD and Agile software delivery. Not required to have any finance knowledge Keen to continuously learn new technologies and enjoy problem solving.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}