{"Job ID": "69875819", "Description": "About PayUPayU, a leading payment and Fintech company in 50+ high-growth markets throughout Asia, Central and Eastern Europe, Latin America, the Middle East and Africa, part of Prosus group, one of the largest technology investors in the world is redefining the way people buy and sell online for our+ merchants and millions of consumers. As a leading online payment service provider, we deploy more than 400 payment methods and PCI-certified platforms to process approximately 6 million payments every single day. Thinking of becoming a PayUneer and you are curious to know more about us? Read more about the life in PayU here About the Role:A Person is expected to be a Part of affordability ops team, where he / she is expected to configure the Brand EMI Offers on Payu Platform and ensure error free deliveries. Looking out for a competent self driven professional with prior exp of EMI domainAbout the team:We work on Campaigns and offers which are in coordination with Banks and Brands and get them implemented on Merchants and other LFR. We also work closely with Payu Affordability business team in understanding their specific queries and designing the offers thereofWhat you’ll be doing:Coordination with Sales / Business Team in Offer Creation on Payu Merchants checkout page\nImplementaion of Offers and Campaigns on Key Merchants Checkout Page\nLiason with Finance for Recon and Settelment\nClose coordination with internal Stakeholders like – Product, Technology and Finance for Process improvement and\nConfigure Affordability Schemes of Cashback and Discounts as per the agreed terms and condition\nEnsure Team deliverables are met on time with high quality\nGet on Merchant and Brand Calls if there is a bug or issue which stakeholders are facingWhat are we looking for?Understanding of EMI Business\nAwareness of Low cost EMI schemes, No Cost EMI Schemes\nConfigured Instant Discount and Deferred Cashback Schemes on Brands\nBasic Product and Tech understanding\nHigh degree of ownership in making things work with minimum oversight\nProficient in MS Excel and basic BI Tools\nMinimum 7 to 8 Years of Relevant Experience\nFintech Exp is a PlusJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}