{
    "Job ID": "69876666",
    "Description": "Level of experience Study level Location « Vous devez être le changement que vous voulez voir dans ce monde » Ghandi\nCette citation, à elle seule, pourrait résumer l’ambition du Groupe BMCI. Le monde change autour de nous et aujourd’hui, plus que jamais, s’adapter devient nécessaire pour relever les challenges de demain. Cela ne saurait se conjuguer au singulier et pour cette raison, la BMCI attache une importance particulière au développement de son capital humain. Le collaborateur et son épanouissement au travail sont au centre de la dynamique de développement enclenché par le Groupe, à travers une intégration accompagnée, une gestion de carrière pro-active et un accompagnement approfondi et poussé pour permettre aux collaborateurs, nouvelles recrues ou déjà en poste, de libérer leur potentiel et d’exprimer leur talent.\nRejoindre la BMCI, c’est travailler dans une Banque qui œuvre, au quotidien, pour une finance durable favorisant l’inclusion sociale et la préservation de notre environnement pour un développement durable. BMCI encourage d’ailleurs ses collaborateurs à s’investir pour une société plus juste et est la seule banque de la place à leur offrir un jour de congé par an dans cet optique dans le cadre du programme de mécénat de compétences #1millionhours2Help.\nIntégrer la BMCI, c’est également intégrer une entreprise pour laquelle le mot « mixité » n’est pas appelé à rester lettre morte. Engagée dans la promotion de la diversité Femmes-Hommes au sein de ses départements et filiales, la BMCI, dans la lignée du Groupe BNP Paribas, applique des mesures concrètes au quotidien comme la signature de la Charte #JamaisSansElles.\nVous l’aurez compris, postuler à la BMCI signifie bien plus qu’être candidat à un simple « job ». Il s’agit avant tout de rejoindre un Groupe en constante transformation et donner un sens à son travail.\nMISSION\nRattaché(e) au/à la Responsable pôle Contrôles & Surveillance, le/la Responsable Contrôles décline les politiques, règles, normes et méthodologies du Groupe sur son périmètre, définit l'organisation et la gouvernance du dispositif de contrôle permanent et s’assure du bon fonctionnement de ce dispositif. Il/Elle analyse ensuite la cohérence du dispositif mis en place et se constitue en relai opérationnel entre son périmètre, sa hiérarchie et les autres acteurs concernés.\nACTIVITES PRINCIPALES\nMise en place et réalisation des contrôlesCOMPETENCES COMPORTEMENTALESDiscover the different professions within BNP Paribas: Support FunctionsYour PrivacyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}