{"Job ID": "69875833", "Description": "About the Role:Responsibilities:Implement ITSM solutions using industry best practices within the ServiceNow platform.\nDevelop and customize ServiceNow applications, workflows, and scripts, including Business Rules, Script Includes, Fix Scripts, UI Actions, UI Policies, Client Scripts, and Email Inbound.\nCreate and configure Service Portal and widgets.\nIntegrate ServiceNow with other systems using REST and SOAP-based integrations, and create scripted REST and SOAP APIs.\nHave knowledge of authentication methods such as OAuth 2.0, certificates, and Mid Server.\nImplement ServiceNow projects in a Domain-separated instance.\nImplement ServiceNow Discovery, Service Mapping, Event Management, and Orchestration use cases.\nManage MID Server installation and configuration.\nDevelop custom applications within ServiceNow.\nImplement LDAP/Active Directory/SSO integration.\nImplement Orchestration use cases.Essential Skills:Strong hands-on development experience with ServiceNow scripting and customization, including Business Rules, Script Includes, Fix Scripts, UI Actions, UI Policies, Client Scripts, and Email Inbound.\nExperience with Service Portal and widget creation.\nProficiency in REST and SOAP-based integrations, as well as creating scripted REST and SOAP APIs.\nKnowledge of authentication methods such as OAuth 2.0, certificates, and Mid Server.\nExperience with ServiceNow Discovery, Service Mapping, Event Management, and Orchestration.\nFamiliarity with MID Server installation and management.\nAbility to develop custom applications within the ServiceNow platform.\nExperience with LDAP/Active Directory/SSO integration.\nStrong problem-solving and troubleshooting skills.Essential Qualifications:Certified System Administrator in ServiceNow.\nCertified Application Developer in ServiceNow.\nITIL Foundations certification is preferred.\nBachelor’s degree or equivalent combination of education and experience.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}