{"Job ID": "69873650", "Description": "A luxury hospitality brand for modern travelers, Anantara connects guests to genuine places, people and stories through personal experiences and providing heartfelt hospitality in the world’s most exciting destinations. From pristine islands and tropical beaches to cosmopolitan cities, tranquil deserts and lush jungles, Anantara welcomes guests for journeys rich in discovery.Provide leadership and guidance to a team of Guest Service Center Agents (GSCAs).\nFoster a positive and motivating work environment that encourages teamwork and excellence in guest service.\nConduct regular team meetings and training sessions to ensure the team is well-informed and up to date on all policies, procedures, and resort information.\nSet the standard for exceptional guest service and ensure that GSCAs follow suit.\nMonitor and evaluate guest interactions to maintain service quality and address any service issues promptly.\nAct as a role model for team members, demonstrating outstanding customer service skills.\nOversee the daily operations of the guest service center, including call handling, message handling, and use of standard phraseology.\nEnsure adherence to duty rosters, punctuality, and compliance with standard operating procedures.\nServe as the point of contact for any guest-related matters, working closely with other hotel departments to meet guest needs.\nFacilitate communication during emergencies and ensure all relevant parties are informed and prepared.\nMaintain up-to-date knowledge of VIP/RSVP guests, repeat guests, and resort facilities.\nEnsure that GSCAs are well-informed about the resort, its services, and the competition.\nMaintain accurate records, including CID-related messages and information.\nHandle shift handovers and ensure that guest data is updated promptly and correctly in CID systems.\nParticipate in training programs for the Front Office Department and provide coaching and feedback to GSCAs for their professional development.\nCommunicate effectively with the Duty Manager and other relevant departments.\nReport and maintain accurate records of incidents occurring at the resort.High School diploma\nPrevious experience in same position for at least 1 year.\nLuxury hotel experience is a must\nPassion for excellent service\nExcellent team player and great communication skillsRelocate to remote areaJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}