{
    "Job ID": "69875747",
    "Description": "We are a global modest fashion e-commerce company. We are currently operating in more than 130 countries and providing the content in five languages: Turkish, Arabic, English, French and German by adapting to their local preferences. We bring fashion and technology together with iconic brand and smart operations to create great value for our customers. We invest in each and every customer’s experience. We strongly believe in putting people first – our customers, our teams, our partners. We are looking for game-changer candidates to join our Creative Team as Graphic Designer. Are you looking for a new challenge and likes to work within a dynamic, exciting, innovative, scaling-up working environment? You might be the one for us.What we expect from you:To set a creative brand vision for all areas of the brand blueprint,\nTo provide daily/seasonal/monthly e-mail and social media designs as well as app banners,\nBe able to design across all platforms, producing unique, creative design solutions,\nHave the ability to contribute ideas, make recommendations, and give feedback.What we are looking for:Bachelor’s Degree in the related fields,\n1+ years working as a Graphic Designer in a creative agency, e-commerce or retail industry,\nTo have a strong grasp of the creative development process, have excellent design skills, and consistently deliver excellent design,\nTo demonstrate solid expertise in developing creative solutions in a variety of campaigns in the retail/ fashion industry,\nTo have in-depth knowledge of design tools used in the Figma process, including Photoshop, Illustrator, and InDesign. After Effects and Premiere are optional,\nEnglish is a must.The MODANISA StoryFounded in 2011, with a reason to enrich women’s lives and to become the leader in the modest fashion e-commerce world. Modanisa is a globally renowned e-commerce platform, offering modest fashion apparel, through sales of popular brands, and designers, as well as through its own private label lines.Invested by the international leading investors like Goldman Sachs which is one of the world’s leading investment bank and investor of start-ups like Facebook, Spotify and Uber and by European bank of reconstruction and development (EBRD) - which has already invested about 11 million dollars in Turkey mostly in private sector and Wamda Capital which is MENA's leading venture investing firm. We have been awarded by Al Jazeera and Thomson Reuters and described as one of the largest players in the modest fashion market. We are ambitious and we know our pace.Modanisa’s 700+ employees (along with subcontractors) are living in the creative world of huge brands. Modanisa is all about people. People are exceptionally talented with strategic agility and team first attitude.If you are a game changer who wants to change the way of fashion and technology; Join Us!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}