{"Job ID": "69874375", "Description": "About the TeamGateway Online Academy of Ohio is a fulltime, online option for students that need to catch-up and cross the finish line to high school graduation. Gateway is a proud member of the Accel Schools network, with decades of experience serving students virtually throughout the United States. Join this exciting movement and watch students explore, grow, and learn in an innovative public-school option, at home.About the OpportunityCoordinate school-wide attendance efforts and absentee prevention programming for students and families that includes recognizing good and improved attendance, engaging students/families, monitoring attendance data and practice, providing personalized early outreach, and developing programmatic response to barriers.\n\nPromote positive attitudes by students and families towards education and to ensure that parents are made fully aware of their statutory responsibilities.\n\nProvides intervention to address the underlying issues leading to chronic absenteeism\n\nCollaborates with advisors and teachers to monitor student attendance trends and develop action plans to increase engagement.\n\nConducts outreach via phone calls, emails, and auto-dial messages to targeted students/families\n\nEvaluates situations (e.g. involving other staff, students, parents, the public, police, probation department, etc.) for the purpose of taking appropriate action and/or directing to appropriate personnel for resolution.\n\nOversee HB410 requirements\n\nSchedule and lead Attendance Intervention Team meetings\n\nCreate and maintain Attendance Intervention Plans.\n\nAnswer questions as they pertain to attendance data i.e. how many hours the student is logging daily, provide support and suggestions in helping to get students on track to ensure they are meeting their minimum 23-hour weekly and 920 yearly goals.\n\nWorks with school counselors and success coaches to assist students when additional student support or agency referrals are needed.\n\nMaintains a variety of attendance records, schedules, and files for the purpose of documenting and/or providing reliable information.\n\nDevelops and implements educational workshops related to attendance policies and truancy law for school staff and families.\n\nProvide regular updates for staff on student attendance with targets and strategies for improvement.\n\nProduce and interpret statistical data relating to attendance patterns of groups within the school.About YouExperience in the K-12 educational setting working with truancy\n\nProficiency in Microsoft Office and Google Suite Products\n\nKnowledge of state school attendance laws and other pertinent laws regarding K-12 education\n\nKnowledge of specific court procedures regarding truancy\n\nDemonstrates a reliable, dependable, and trustworthy work ethic\n\nAbility to manage difficult or emotional client situations\n\nAbility to make sound judgments after all available information has been gathered or communicated\n\nDemonstrates a mature attitude and insight into matters affecting department, self and / or company welfare\n\nExcellent written and oral communication skills\n\nAbility to work well under pressure, effectively prioritizing and executing tasks to meet deadlines consistently\n\nCustomer service oriented\n\nAbility to learn new technologies and acquire new skills through independent study, professional training, and from more senior team members\n\nPrior experience working in a school setting preferred\n\nAbility to work independently and contribute to a team\n\nUnderstanding and ability to manage confidential information\n\nAbility to lift 25 lbs.\n\nAbility to pass federal and state criminal background checks\n\nBachelor’s Degree in Education, Counseling, Human Services or related field of study preferredAbout Us“We believe that every child should be able to be anything they want in life, regardless of their birthplace and circumstances.” – Ron Packard, CEO &amp; FounderACCEL Schools is a network of 80+ high-performing, public charter schools serving PK-12 students. We proudly advocate for school choice and work to address educational inequities throughout the United States. Our schools are inclusive and widely differ to reflect the unique values of the many urban, suburban, and rural communities we serve. Our brick-and-mortar, virtual, and hybrid schools specialize in closing educational gaps and offer innovative models such as career-technical education, sports training, bilingual programming, and more. We have been recognized and praised by legislators, authorizers, and researchers for providing exceptional education options to students in historically under-resourced communities.We offer the following benefits:Life benefits – time &amp; peace of mindPaid time off\nRetirement contributions\nOptional Basic Life and AD&amp;D insurance\nVoluntary life insurance (employee, spouse, child)\nDiscounted childcare at Early Learning Academies locationsHealth benefits – stay well &amp; thriveMedical, dental, and vision insurance\nEmployee Assistance Program\nVoluntary short-term disability insurance\nVoluntary long-term disability insuranceCareer benefits – keep growingCareer advancement opportunities throughout Pansophic Learning and our strong network of 4,000+ instructors and education professionalsEQUAL EMPLOYMENT OPPORTUNITYIt is our policy to abide by all federal, state and local laws prohibiting employment discrimination based solely on a person’s race, color, religious creed, sex, national origin, ancestry, citizenship status, pregnancy, childbirth, physical disability, mental and/or intellectual disability, age, military status, veteran status (including protected veterans), marital status, registered domestic partner or civil union status, familial status, gender (including sex stereotyping and gender identity or expression), medical condition, genetic information, sexual orientation, or any other protected status except where a reasonable, bona fide occupational qualification exists.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Of, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}