{"Job ID": "69873630", "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,900 companies and have detected 100 Million threats/day. We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference. The Sr. Business Support Analyst will report to the Manager, Business Applications Support\nAs a Business Support System Analyst within the Sales Automation team, you will be\nresponsible for managing and supporting System Tasks, Initiatives, and Projects that\nsupport our Go To Market and Sales Execution Strategy.Zscaler has spent years building ground-breaking technology that’s improving the\nsecurity postures of enterprises around the world. And while engineering teams have\nbeen building great Zscaler products, our G&A teams have been building Zscaler into a\ngreat company. The members of our GA teams have been working together to recruit\nthe right people, create the right culture and environment, and build a solid financial and\nlegal foundation—all of which has brought us to an incredibly exciting stage with a lot of\nmomentum driving us forward. Join us and you, too, will have the opportunity to be a\npart of the excitement and contribute to Zscaler’s growth and success in meaningful\nways.● 6+ years of experience in Salesforce CPQ\n● Understanding of SFDC functionality with emphasis on CPQ Related\nobjects in Sales Cloud\n● Understanding of Quote to Cash Process.\n● Design and configure Salesforce CPQ to support product configuration,\npricing, quoting and contract management processes.\n● Develop and maintain Salesforce CPQ functionality including price\nrules, product rules, approval rules, product bundling and discounting\nstructures.\n● Conduct testing, troubleshooting and bug fixing to make sure accuracy of\nSalesforce CPQ solutions.\n● Understanding of SFDC Admin functionality which includes object\nmanagement, security model, FLS, Lightning App Builder, Lightning, Flows, Validation Rules, Workflow rules and Process Builders, Reports and Dashboards.\n● Analyze CPQ cases ,user feedback and current implementations and\nidentify scope of process improvement.\n● Coordinate with cross functional teams like deal desk , BSA, and dev\nteam to fix issues.\n● Good to have Salesforce certified Admin /PD1 certification and\nknowledge on APEX.\n● Should have SFDC admin experience and hands on experience with\nValidation Rules, Workflows, Flows , Process builders.#LI-NT1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Nagar, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}