{
    "Job ID": "69872798",
    "Description": "JOB DESCRIPTION:About AbbottAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.Working at AbbottAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:Career development with an international company where you can grow the career you dream of.\n\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\n\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.About Diagnostics divisionIn the Diagnostics division, we’re empowering smarter medical and economic decision making to help transform the way people manage their health at all stages of life. Every day, more than 10 million tests are run on Abbott’s diagnostics instruments, providing lab results for millions of people.Our diagnostic solutions are used in hospitals, laboratories and clinics around the globe. The crucial information derived from our tests, instruments and informatics systems are often the first step in patient care decision making for hundreds of health conditions from heart attacks to blood disorders to infectious diseases and cancers.About Rapid DiagnosticsOur rapid diagnostics solutions are helping address some of the world’s greatest healthcare challenges. Abbott Rapid Diagnostics is part of Abbott’s Diagnostics family of businesses, bringing together exceptional teams of experts and industry leading technologies to support diagnostic testing which provides important information for treatment and management of diseases and other conditions.The position of Collecting Officer is within our Toxicology business and the base of work will be within the newly built ‘Centre of Excellence’ within the Emirates headquarters (HQ) in Dubai. The Collecting Officer is required to attend various locations within the HQ to carry out specimen collections primarily in urine and breath but potentially in oral fluid or hair as required. There will also be a requirement to travel to the other Emirates sites across the globe to conduct the same specimen collections.This job description will be reviewed periodically and is subject to change by management.RESPONSIBILITIES:Conduct specimen collections competently; following internal collection procedures, the customers’ requirements and instructions in order to deliver a quality specimen collection service.\n\nTo participate, where there is a business need, in a 24-hour on-call rota.\n\nWork with the Service Delivery Manager to organise and facilitate the testing program.\n\nTo remain current with processes by reading and acknowledging updates within the required time frame and attend and audits at the required time to remain competent.\n\nAny other reasonable duties as directed by the management of the business.BASIC QUALIFICATIONS | EDUCATION:Medical Laboratory Technician or Medical Lab Technologist (Bachelors in Medical Lab Technology) with 2-4 years experience in related field\n\nEducated to National Standards.\n\nStrong verbal and written English.\n\nIT literate and basic skill in Word, Excel & Outlook.A self-motivated individual with a flexible approach to work.\n\nAbility to follow set processes to ensure the right outcome.COMPETENCIES:Pioneering – Continual self-reviewing of your collections to ensure you meet and exceed customer expectations and feeding back improvements to your management agency or the business if they work directly for us.\n\nAchieving – Communicating effectively ensuring customers are aware of the right information and are updated on changes as they occur in relation to their collection.\n\nCaring – Understand the impact of the actions taken or omissions made within our role and how they affect others both internally and externally. Using this information to ensure only positive outcomes.\n\nEnduring – Ensuring changes to any process through updates or feedback are implemented immediately ensuring the long term success of the Collection Network.Follow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life.Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.The base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}