{
    "Job ID": "69872600",
    "Description": "Pourquoi travailler chez Accor ?Nous sommes bien plus qu’un leader mondial. Nous vous accueillons comme vous êtes et vous pouvez trouver le métier et la marque qui correspond à votre personnalité.Nous vous accompagnons dans votre évolution et votre apprentissage au quotidien, nous nous assurons que votre travail apporte du sens à votre vie. Ainsi, durant votre expérience avec nous, vous pouvez explorer les possibilités illimitées du Groupe Accor.En rejoignant Accor, vous écrivez chaque chapitre de votre histoire et ensemble nous pouvons imaginer l’Hôtellerie de demain. Découvrez la vie qui vous attend chez Accor, visitez https://careers.accor.com/Faites ce que vous aimez, prenez soin du monde qui vous entoure, oser challenger le status quo ! #BELIMITLESSVotre rôle :Relevant du superviseur des réservations, les responsabilités comprennent, sans s’y limiter :Offrir un service exceptionnel, amical et engageant\nAssister le client dans la réservation de son séjour en recueillant les informations nécessaires\nMaximise les occupations de chambres et les revenus, en lien avec les stratégies de vente, tout en effectuant un contrôle régulier des disponibilités\nGérer les réservations de groupe en liaison avec l’équipe commerciale\nGérer la commission en collaboration avec le superviseur\nDoté d’un fort relationnel, vous fidélisez notre clientèle et suivez les historiques clients.\nAutres tâches, telles qu’assignées.Votre expérience et vos compétences incluent :Qualité de service client essentielle ; une expérience similaire est un plus\nMaîtrise du logiciel Opera ou équivalent\nBonne communication et capacité à gérer les conflits\nMaîtrise de l'Anglais, le français et l’arabeNotre Engagement Diversité & Inclusion :Nous sommes une entreprise inclusive et notre ambition est d’attirer, de recruter, et de promouvoir la diversité des talents.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Rabat, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}