{"Job ID": "69873043", "Description": "Associate Software Component Management SpecialistCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, Model-Based Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.  With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.Position Overview:Boeing India Engineering is seeking a skilled Associate Software Component Management Specialist for Webex Meetings/Teams to join our dynamic product delivery team. As a Software Component Management Specialist, you will be responsible for overseeing the configuration, integration, and maintenance of Webex software components within our portfolio across a suite of operating system platforms.Components may include, but aren’t limited to Adobe, web browsers, etc. Responsibilities also include maintaining Webex site compliance, knowledge base articles and providing Tier 3 ticket support.You will play a pivotal role in ensuring the efficient and effective delivery of high-quality software solutions to enable productivity across our enterprise teammate community.This position will be located in the Boeing India Engineering and Technology Center, Bangalore, India.Position Responsibilities:Knowledge of software development processes and methodologies\nExperience evaluating, testing, and implementing Webex/Teams End-User solutions\nExperience with Scripting languages (i.e. VB, C, Powershell)EMPLOYER WILL NOT SPONSOR APPLICANTS FOR EMPLOYMENT VISA STATUS.Basic Qualifications (Required Skills/Experience):Technical Bachelor's degree or Master degree\n4+ years of experience with Windows Desktop OS\n4+ years of experience supporting Mac, iOS, Android (Productivity/Rugged Factory) using WS1\n4+ years of experience with VMware Workspace ONE AdministrationPreferred Qualifications (Desired Skills/Experience):Knowledge of Scaled Agile Framework (SAFe) principles\nExperience with Microsoft 365 IntegrationsTypical Education & Experience:Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 5 years' related work experience or an equivalent combination of education and experience (e.g. Master + 4 years' related work experience.)Relocation:This position does offer relocation based on candidate eligibility within INDIA.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}