{
    "Job ID": "69873794",
    "Description": "Lead, Development-(2300017303)Job:TechnologyPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 6:36:56 AMUnposting Date:OngoingThe Role ResponsibilitiesJob RoleIntegration Lead developers are tenured and matured integration developers. They do the development job and can contribute more in view of their seasoned experience.Scope and ImpactLeads or significantly contributes to medium-to-large feature releases; usually multi-person projects that cross engineering team boundaries.  \nIs highly proficient in one or more technical areas.Technical ExecutionIs recognized for high quality, impactful technical contributions.\nParticipates in the design review process, seeking and providing constructive criticism.\nDemonstrates ability to succeed in a wide range of complex situations across multiple axes: e.g. scale, uncertainty, interconnectedness\nMonitors and adjusts team pace to instil urgency for success but protect from burnout.OwnershipEstimates and manages implementation timelines and risk.\nKeeps the Jira tickets and Agile boards updated on his work.\nPrioritizes and values unowned or undesirable work that enables the team to move faster.Leadership and CollaborationParticipate in daily agile ceremonies and other collaborative meetings to update and plan his / her work.\nAssist Scrum Master and Product Owner in the details they seek.\nCrosses team and service boundaries to solve problems.\nBuilds relationships with stakeholders including customers, product managers, cross-functional partners, and external partners.\nContributes to defining strategic direction, planning the roadmap, escalating issues, and synthesizing feedback to ensure team success.\nEnsures that knowledge is shared amongst the team and does not position themselves or others as a single point of failure.\nHand holds junior developers as required or when requested.Team BuildingAssists and teaches other engineers as a Mentor on an individual basis.\nWorks through others, lifts the skills and expertise of those around them.\nAdvises manager with insights and recommendations to improve the team.\nParticipates in the hiring process by submitting referrals, meeting candidates, attending recruiting events.\nConducts engineering interviews.StrategyTo align with the Business expectations to deliver the integration solutions to the other interface applications.BusinessThis Role is for integration services.ProcessesThis is more on the development of integrations strategic products.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Our Ideal CandidateB.E (ECE)LanguagesEnglish, TamilCertificationIBM WMB, IBM WMQRole Specific Technical CompetenciesFileIT\nSolace\nMDIS\nAPI\nMQ­About Standard CharteredWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle,Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}