{
    "Job ID": "69872883",
    "Description": "What to expect:Counterparty Reconciliation service is offered to clients including asset managers, pension funds and other institutional investors that are trading OTC derivatives as a component of their investment strategies. This service is also extended to funds that are trading on OTC & ETD derivativesCounterparty reconciliation acts as secondary control check to the positions booked by Trade Capture & are responsible for ensuring the client’s books and records captured within accounting platforms remain synchronized with counterparty data received in TriOptima & investigate various types of reconciliation breaks/exception. This will also include – Follow up with different brokers/vendor/client for timely resolution of reconciliation breaks/exception\nInteraction with the client on weekly/fortnightly basis to discuss outstanding itemsJob Responsibilities:We're looking for highly-driven individuals with an interest in working in financial services and at JPMorgan Chase. Key components of the role will be:Perform reconciliation between Broker / Counterparty vs Client to ensure the client books are in line with respective brokers\nDetailed investigation of the breaks. Liaise with external clients and counterparties for breaks resolution\nAttend Client calls in presence of onshore team to discuss the status of the breaks resolution & any other client request / issues. Liaise with internal team for breaks resolution\nProvide MIS reporting on break status. Provide weekly KPI information to management\nEnsure team meet designated deadlines in line with internal SLA's. Proactive & transparent communication to all stakeholders relating to delivery\nProvide comprehensive error reporting when such instances occur, and evidence action plan to ensure any identified gaps are closed. Undertake root cause analysis of regular breaks\nEscalate issues to designated parties to agreed timescales. Identify process improvements to contribute to best practiceRequired Qualifications, Skills and Capabilities:Previous experience of reconciliation. Sound knowledge of basic accounting (ie. debits/ credits)\nExcellent communication, interaction and influencing skills. Strong PC skills, particularly Excel\nAn understanding of derivatives and fund accounting processes is a distinct advantage\nKnowledge of custody and settlement is an advantage\nA proactive approach to problem solving, taking ownership of issues and having the determination to follow things through\nSelf-motivated, innovative, methodical and analytical. Good prioritization and time management\nFlexible approach to hours and task allocation. Good knowledge of risk and controls.About your qualifications:The candidate should have 2-3 years or more experience in a fund accounting/ worked in financial products. JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}