{
    "Job ID": "69875926",
    "Description": "Responsibilities: Hands on experience in developing custom solutions on SharePoint. \nHave been part of SharePoint upgrade and migration projects. \nHave designing and architecting SharePoint solutions experience, also developing Workflows using Visual Studio and third-party workflow engines. \nMust have experience of High level design document for functional and non-functional requirements, estimations of tasks. \nArchitect and manage SharePoint solutions, streamline content management, and enhance collaboration across the organization. Customize sites, enforce compliance, and provide user support for seamless knowledge sharing.\nGood interpersonal communication, Team leading and organization skills. \nParticipate in design, code, test reviews cycles. \nAssist in the creation of prototypes, POCs, presentations, collateral, etc. The Role Offers: To work as an Individual contributor, who can help create Proof of Concept and work on complex technical designs on his ownEssential Skills: Must be well versed with SharePoint 2010/2013/2016, SharePoint Online \nExperience in design and development of solutions / portals for SharePoint 2010, 2013, 2016 and Office 365 \nSharePoint 2013 Add-in design and development (SharePoint hosted app and Provider hosted apps). \nSharePoint 2010/2013/2016 development skills including Server Side Object Model, Office 365 / SharePoint Online, Web parts, Visual Studio, AJAX, SQL Server, Web services, WCF, SharePoint Designer, SharePoint features, BDC/BCS, ASP.NET, Search \nClient side development – CSOM / JSOM / REST API, PowerShell, Third party front-end frameworks ( Angular, React, etc.) \nKnowledge of Modern UI and its development methodologies – SPFx, SharePoint PnP \nBasic Knowledge of SharePoint Admin activities – Configuring Service applications, Managed metadata, Backup and Recovery, Health and Monitoring \nHave developed SharePoint solutions using Site definition, list definition, web parts, features and event receivers. \nUnderstands Logical, physical and information architecture principles of SharePoint \nUnderstands OOPS, OOAD and UML use cases. \nExperience in ASP.NET (forms/MVC), http handlers, modules, IIS 6.0 and above. \nWell-aware of best practices of SharePoint and Service oriented architecture. Essential Qualifications: Bachelors is a must.\nCandidate with minimum of 6 years of software development experience using Microsoft technology platform. \nA relevant 6-7 years of experience on SharePoint.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}