{
    "Job ID": "69875325",
    "Description": "Durée de la mission : 1 anMissions :Garant de la bonne application de la méthodologie agile\nResponsable de l’organisation et l’animation des différentes cérémonies (Daily meeting, rétrospective, sprint review,..) et la production des reports y correspondants.\nAider les équipes dans la planification des sprints et en assurer le suivi et préparer les reportings quotidiens et hebdomadaires ;\nAccompagner chaque membre de l'équipe Scrum, le guider et le coacher pour la bonne application du Framework Scrum.\nVeiller à maximiser la productivité de l’équipe et gérer les dépendances externes et faciliter la résolution des blocages.\nProposer des améliorations du workflow de l’équipe et en assurer l’amélioration continue.Profil recherché :5 ans d'expérience en tant que Scrum Master ou Coach Agile\nAvoir une expérience justifiée par des projets concrets qu’il a menus en tant que scrum master en décrivant les tâches qu’il a réalisées :\nCertifié en tant que Coach agile ou Scrum master.\nMaitriser les outils d’analyse et de suivi des équipes : Trello, Miro, Splane, Outil rétrospective et review, Reporting, --Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}