{"Job ID": "69873641", "Description": "Description :Grade Level: L4Location: KarachiLast date to apply: 24th September, 2023What is Regional Technology Head?As a Regional Technology Head at Jazz, you will play a pivotal role in ensuring the success of our largest region, serving over 20 million subscribers. You will be responsible for maintaining a resilient and robust network infrastructure, delivering exceptional quality of service, and enhancing the overall subscriber experience.What does Regional Technology Head do?Lead the regional technical operations team in tandem with Commercial division, ensuring seamless coordination to achieve our key business performance indicators (KPIs). This includes initiatives to enhance profitability, foster growth, and capitalize on emerging opportunities. The Regional Technical Head will play a pivotal role in aligning technical strategies with overarching business objectives.Key Responsibilities:Ensure seamless network operations by meeting all agreed operational KPIs and SLAs.\nDrive Opex efficiency by implementing best operational practices, controlling spill overs, and exploring alternate energy resources to optimize the net cash flow.\nManage a mix of in-house and outsourced FLM service models to enhance operational efficiency and create a competitive environment.\nOptimize and consolidate the fiber optic legacy network to meet the demands of the growing customer base.\nEfficiently manage project rollouts, swaps, and integration activities.\nLead process improvement initiatives, foster people excellence, and build effective teams.\nMotivate and lead a team of 08 managers and 105 field team members through consistent communication, mentoring, and fostering a collaborative team environment.\nManage 300+ subcontractor resources across the region.\nOversee new rollout projects in the region, including new site deployments, capacity expansions, LTE upgrades, and fiber rollout.\nTake responsibility for network Quality of Service (QoS), handling customer complaints, and network optimization.\nMeet and exceed operational KPIs and SLAs.\nAchieve Opex efficiency targets while maintaining network quality.\nEnsure successful project management and timely execution.\nDrive process improvements and foster a culture of excellence within the team.\nManage and optimize the workforce effectively.\nContribute to the overall success of the region.Key Deliverables:Jazz is an equal opportunity employer. We celebrate, support, and thrive on diversity and are committed to creating an inclusive environment for all employees.RequirementsWhat are we looking for and what does it require to be a Regional Technology Head?Strong leadership and team management skills.\nExcellent communication and mentoring abilities.\nProficiency in project management.\nIn-depth knowledge of network infrastructure and telecommunications technologies.\nProblem-solving and decision-making skills.\nResults-driven and customer-focused mindset.BenefitsWhy Join Jazz?As one of the leading employers in the country, Jazz epitomizes the philosophy that each Jazz employee is passionately living a better every day inspired and enabled by visionary leadership, a unique professional culture, a flourishing lifestyle, and continuous learning and development.Our core values include qualities essential for a positive organizational culture - truthfully guiding entrepreneurial and innovative mindsets, harnessing professional and interpersonal collaboration, and fostering across-the-board customer-obsession.As one of the largest private sector organizations in Pakistan, our objective is to continue to change the lives of our 75 million customers for the better. This is an opportunity for someone who wants to be part of something transformative, someone who can play a critical role in driving our success. Together, we can empower millions more with the tools necessary to progress in an increasingly digital economy.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Karachi, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}