{"Job ID": "69873226", "Description": "Basic Function:To control and supervise the day to day running of the kitchen and deputise in the absence of the Executive Chef or Senior Sous ChefRole and Responsibilities:To supervise the kitchen brigade to ensure the smooth running of the department.\nTo control the quality and presentation for breakfast, TGR, Boulevard, Bar & Lounge and Room Service.\nTo control the quality and presentation standards for:TGR Breakfast      TGR’s Lunch         TGR’s Dinner                                        BanquetingBar & LoungeBoulevardTo control the Staff Restaurant (mise-en-place, ordering and quality of food).\nTo communicate effectively with staff and ensure they are fully briefed at all times.\nTo supervise and carry out refresher training on an on-going basis.\nTo supervise and maintain standards of cleanliness in the kitchen.\nTo ensure that regular knife drill and equipment training is carried out in accordance with the Health and Safety standards.\nTo ensure all members of the kitchen brigade follow the proper Health and Hygiene practices as laid down in the Health and Safety regulations of the Hotel.\nTo ensure daily communication with the Restaurant, Banqueting, Room Service and Purchasing Managers.\nTo ensure Kitchen morale is high and teamwork is evident at all times.\nTo control food cost through careful purchasing, portion control and supervision of wastage.\nTo carry out the costing of recipes as and when required.\nTo make out the dairy and market list in the absence of the Sous Chef or Executive Chef.\nTo draw up staff rotas as and when required.\nTo control the ordering of all the dry stores goods.\nTo control the maintenance of all kitchen equipment, liaising closely with the Director of Engineering and Engineering Supervisor.\nTo participate in the recruitment and selection of staff.\nTo liaise with the Executive Chef and Sous Chef on new menus, new ideas etc.\nTo take proper care of your uniform, personal appearance and hygiene, setting a good example to the rest of the team.\nTo ensure that both you and your staff are fully familiar with the hotel Fire and Emergency procedures.\nTo assist with any other duties as assigned by the Executive Chef, Sous Chef or Director of Food and Beverage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}