{
    "Job ID": "69870037",
    "Description": "Let’s turn visions into reality. At Bosch, we shape the future by inventing high-quality technologies and services that spark enthusiasm and enrich people’s lives. Our areas of activity are every bit as diverse as our outstanding Bosch teams around the world. Their creativity is the key to innovation through connected living, mobility or industry. Our promise to our associates is rock-solid: we grow together, we enjoy our work, and we inspire each other. Join in and feel the difference.\nEvery year, several thousands of young people on practical placements with Bosch experience daily work at first hand. With this long term internship opportunity they are actively integrated into projects and are fully incorporated in the daily work of one of the world's largest industrial corporations. The new specialist experience you gather will help you choose the future focus of your studies and the way you wish to launch your professional career. One thing is sure: Exciting and interesting tasks await you!Students enrolled in University Engineering and Economic Management Science departments can work minimum three days per week in our Istanbul Headquarters or Bursa & Manisa Plants.\nWe are currently offering an opportunity for a highly motivated and enthusiastic individual to join us in starting something remarkable as a Foraign Trade Smart Start.Your contribution to something big:Assist foreign trade team by supporting operational tasks.\nDaily support and preparation of all relevant documents\n Operational support of all customs  activities\nAssist to  foreign trade team in processes and procedures, all internal contacts and coordinations.\nSupporting foreign trade projects by analyzing and reporting.\nPreparing, analyzing and follow ups the variety of foreign trade reports.\nFollowing up the archive studiesWhat distinguishes you:3rd or 4th year of Bachelor student of Logistics, engineering or business administration.\nExcellent command of written and spoken English\nSelf motivated, solution and target-oriented perspective, strong communication skill\nAble to work  3 days during school period.\nEager to learn foreign trade activitiesBosch Grubu şirketlerine ilginiz için teşekkür ederiz. 6698 sayılı Kişisel Verilerin Korunması Kanunu kapsamında kişisel verilerinizi önemsiyor ve bu kapsamda başvurmuş olduğunuz pozisyon hangi Bosch Grubu şirketi bünyesinde yer alıyor ise söz konusu şirketin veri sorumlusu sıfatıyla hareket ettiğini açıkça belirtmek istiyoruz. Mevcut yapacağınız başvurunuz için Kişisel Verilerin Korunması Kanunu kapsamında hazırlanmış olan Aydınlatma Metni’ne buradan ulaşabilirsiniz. İş başvurunuz kapsamında bu ve yönlendirileceğiniz diğer sayfalarda birden fazla Bosch Grubu şirketi aydınlatma metninin bulunması halinde, kişisel verilerinizin işlenmesi bakımından veri sorumlusu sıfatıyla hareket eden ve başvuru yapmış olduğunuz şirkete ait aydınlatma metnini inceleyerek kişisel verileriniz hakkında detaylı bilgiye de her zaman ulaşabilirsiniz.Thank you for your interest in Bosch Group companies. Within the scope of Personal Data Protection Law no.6698, we give importance your personal data and we want to clearly define that the Bosch Group is acting as the data controller for the position you are applying for. For your current application, you can find privacy notice here which was prepared in scope of Personal Data Protection Law. If more than one privacy notice of Bosch Group’s will appear in scope of your job application in this page and pages you will be redirected, you can always access detailed information by reviewing privacy notice of the company you are applying for and acting as a data controller for the processing of your personal data.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}