{
    "Job ID": "69873096",
    "Description": "Job Description:Job Title- Associate Engineer (Associate)Location- PuneRole DescriptionAn Associate Engineer is responsible for developing and delivering elements of engineering solutions to accomplish business goals.  Awareness is expected of the important engineering principles of the Bank.  Root cause analysis skills are developed through addressing enhancements and fixes to products. They attempt to build reliability and resiliency into solutions through early testing, peer reviews and automating the delivery lifecycle.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveKey ResponsibilitiesThis role is responsible for the day-to-day Workday application support and Enhancement including tasks related to identifying and troubleshooting application issues and issues resolution or escalation. And be part in new initiatives and projects.\nResponsibilities also include root cause analysis, management communication. Ensures all production changes are made in accordance with life-cycle methodology and risk guidelines. \nResponsible for coaching and mentoring less experienced team members and or acting as a subject matter expert. In depth knowledge of Workday Application.Your skills and experience2-3  years of Workday hands Experience, over all 5+ years of experience.\nGood hands on in Core HCM and at least one of the advance functional modules (compensation/ Recruiting/Time Tracking/ Absence Management / Payroll/ Talent / Performance) along with Security and Workday Reporting\nOR\nGood hands on in Workday Integrations along with strong Workday Studio and Advance Reporting knowledge.\nGood to have,\nWorking knowledge of Workday Prism/Adaptive/Extend\nWorkday CertificationHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}