{"Job ID": "69872901", "Description": "Kick-start your software engineering career as an entry-level Software Engineer I. Be part of a team that is pushing the boundaries of what's possibleJob summaryAs an experienced Software Engineer I, in the Management Tools Team which is aligned ENG PLATFORMS & EXPERIENCE (EPX) you will work in a dynamic, agile team to enhance, build, and deliver trusted market-leading technology products in a secure, stable, and scalable way. Depending on the team that you join, you could be developing mobile features that give our customers and clients more control over how they bank with us, strategizing on how big data can make our trading systems quicker, creating the next innovation in payments for merchants, or supporting the integration of our private and public cloud platforms. Job responsibilitiesUnderstanding our implementation of various logging solutions like Splunk and Elastic to be able to provide a stable and reliable platform for our customers internally within the Bank.\nContinually reviewing the estate to understand issues that are raised and question “why?” they happen.  We look for long term solutions rather than quick fixes, although quick fixes have their place when we need to ‘get back up and running’.\nReacting to customer queries and concerns, partnering with our Platform Owners and Engineering Teams.\nWe capture metrics and telemetry to understand our applications and supporting hardware in order to evidence the health and adherence to our SLA, SLO and SLI’s as well as monitoring against our error budgets.  Where they deviate, we will deliver solutions to get back on track, or more importantly stay on track!\nOur focus is on automation, and this includes proactively monitoring our systems to highlight events or issues that need attention.  From here we need to intelligently and automatically decide on what corrective action needs to be taken, then acted on (i.e. self-healing). Where this fails, we auto-ticket to get human involvement quickly.\nWe need people who can think on their feet, think outside of the box and not to be afraid of experimenting.Would be required to work after hours and weekends when paged on a rotation basis.An understanding and experience of Site Reliability Engineering (SRE) concepts, terms and day-to-day activities.\nYou have great communication, team work and problem solving skills. You are good at self-management and are self-motivated to see your work through to implementation.Appreciation of Incident Management processes (ServiceNow would be ideal), JIRA concepts, Agile SDLC, BitBucket.Required qualifications, capabilities, and skillsHands-on practical experience with 2+ years in system design, application development, testing and operational stability\nExperience in developing, debugging and maintaining code in an enterprise environment with one or more modern programming languages and database querying languages\nFamiliarity with modern front-end technologies\nOverall knowledge of the Software Development Life Cycle\nSolid understanding of Agile methodologies such as CI/CD, Applicant Resiliency and Security \nExperience of software development or infrastructure engineering; Python language, Ansible development, synthetic testing, any other automation style activities, etc.An understanding of some form of monitoring and dashboard solutions, and how these are implemented.  \nShould be able to drive closure of any gaps by partnering with platform teams.An understanding of Cloud (internal or external) concepts and implementations.Preferred qualifications, capabilities, and skillsGood experience in SRE\nBtech back ground preferredVisa sponsorship may be available for these positions.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}