{
    "Job ID": "69872150",
    "Description": "Skills:\n- Excellent communication and interpersonal skills to effectively interact with guests, team members, and.\n- Strong leadership abilities to manage and motivate a team of servers and ensure excellent service delivery.\n- Extensive knowledge of food and beverage operations, including service standards and procedures.\n- Exceptional organizational skills to efficiently prioritize tasks, handle multiple responsibilities, and meet deadlines.\n- Attention to detail and accuracy to ensure the highest level of service and customer satisfaction.\n- Ability to remain calm and composed in high-pressure situations and resolve any conflicts that may arise.\n- Proficient in using point of sale (POS) systems and other computer software related to food and beverage operations.\n- Knowledge of health and safety regulations and procedures to ensure compliance and maintain a safe working environment.\n- Ability to adapt to and thrive in a fast-paced dynamic work different shifts, including evenings, weekends, and holidays.\n- Positive attitude, proactive nature, and strong work ethic to contribute to a positive and productive team environment.\n- Ability to work well under minimal supervision and take initiative when needed.\n- Fluent in English (additional languages are a plus) to effectively communicate with guests and colleagues from diverse backgrounds.\n- Previous experience in a similar role, preferably in a pre-opening or start-up environment, would be an advantage.\n- Knowledge of the local market and customer preferences is desirable.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Other",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}