{
    "Job ID": "69875840",
    "Description": "Position Overview:Key Responsibilities:Provides Cash Management support for a region, consisting of +/- 250 ATMs and dispensing $5 - $10 million per month\nAnalyzes ATM transaction performance to ensure continuous operation, investigate down terminals and dispatch appropriate service personnel for problem resolution\nInitiates drawdown requests to transfer residual cash back to funding bank account\nRequests wire transfer of funds from funding bank accounts to correspondent bank accounts\nFocuses on resolving all issues and escalating as required\nIdentifies cash-out situations, analyzes data to determine cost justification for emergency runs and dispatches cash handler as required\nReviews carrier notification paperwork and investigates carrier overages and underages\nInvestigates low performing ATM terminals and works with Cash Management team members on corrective action to improve transaction performanceRequired Qualifications:4-6 years’ relevant experience OR equivalent combination of education and experience\nAddresses multiple, undefined and/or complex challenges\nDevelops or adjusts processes to enhance effectiveness, solve recurring problems or improve efficiency\nFinds ways to assess & apply innovative ideas to enhance business results\nCollaborates with functional or crossorganizational teams to generate solutions to complex and challenging problems\nActively seeks and provides feedback to enhance work group, team and broader departmental performanceWhy should you join Diebold Nixdorf?Brightest minds + technology and innovation + business transformation  The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.** To all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our jobs alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not responsible for any fees related to unsolicited resumes**We are a global Company operating in multiple Locations and Entities. As we are keen to find the best solution for our candidates several legal entities might be applicable for a Job offer. A List of our operating entities can be found here - https://www.dieboldnixdorf.com/en-us/about-us/global-locationsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}