{
    "Job ID": "69872938",
    "Description": "We are looking for the right people — people who want to innovate, achieve, grow and lead. We attract and retain the best talent by investing in our employees and empowering them to develop themselves and their careers. Experience the challenges, rewards and opportunity of working for one of the world’s largest providers of products and services to the global energy industry.Under general supervision, supports the effective operation and improvement of one or more HR processes. Collaborates with stakeholders, creates tools and resources, and executes basic programs and projects. Develops subject matter expertise in one or more of the following disciplines: Compensation, Benefits, International HR/Global Mobility, Employee Relations, Learning and Development, Talent Acquisition, HR Information Systems, or HR Operations. Supports the efficient delivery of processes, programs and policies through the application of specialized knowledge and skills, analysis, and business acumen. Assists with HR data reporting and analysis used to determine meaningful recommendations and actions to improve overall HR service delivery. May advise HR and business leaders across the organization on best practices. Requires an undergraduate degree in Human Resources Management, Business Administration, or a similar discipline. Master's degree and Professional HR Certification preferred. No previous experience required.Halliburton is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, disability, genetic information, pregnancy, citizenship, marital status, sex/gender, sexual preference/ orientation, gender identity, age, veteran status, national origin, or any other status protected by law or regulation.LocationAl Moosa Tower, Abu Dhabi, Abu Dhabi, , United Arab EmiratesJob DetailsRequisition Number: 181426  \nExperience Level: Entry-Level \nJob Family: Support Services \nProduct Service Line: Human Resources  \nFull Time / Part Time: Full TimeAdditional Locations for this position: Compensation Information\nCompensation is competitive and commensurate with experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}