{
    "Job ID": "69873091",
    "Description": "Country:Location:Role: SAP BW & HANA DeveloperLocation: HyderabadFull/ Part-time: FulltimeBuild a career with confidenceCarrier Global Corporation, global leader in intelligent climate and energy solutions is committed to creating solutions that matter for people and our planet for generations to come. From the beginning, we've led in inventing new technologies and entirely new industries. Today, we continue to lead because we have a world-class, diverse workforce that puts the customer at the center of everything we do.About the roleSAP BW Developer is responsible for performing complex design, programming and testing work related to project, enhancement and support of SAP reporting per business requirements and specificationsKey Responsibilities:As a SAP BW/ HANA Developer , you’ll be responsible for:Gather and assess development requirements and/or specifications from business stakeholders and/or functional analyst\nTranslate development requirements and specifications into high quality, efficient SAP solutions\nProvide support, technical explanations and documentation as necessary\nIdentify opportunities to re-engineer/integrate existing processes\nMaintain awareness of the relevance and importance of activities and how those contribute to achieving quality objectives\nAct as the technical expert, ensuring quick turnaround in identifying application issues and providing timely solutions.\nDevelop detailed plans and accurate estimates for completion of build, system testing and implementation phases of project.\nTransform business function requirements into technical program specs to code, test and debug programs.\nDevelop, code, document and execute unit tests, systems, integration and acceptance tests and testing tools for functions of high complexity.\nPerform performance tuning to improve performance over multiple functions\nMentor and coach junior developer resources.\nManage design, development and implementation of BW Reporting projects.\nReview and revise technical designs to meet BW Reporting project requirements.\nOther duties as assigned.Requirements:We are looking for people who are :7+ years of experience with SAP BW development Strong development experience with SAP BW reporting including designing, developing and implementing BEx reports. BW & HANA Development (Core Skills).Ability to develop complex and simple Calculation Views and Supporting Views within HANA Studio Experience on SAP BW on HANA modelling and building end-to-end data flows with A-DSOs, Open ODSs, Composite Provider, AMDP scripting and queries. Experience in native HANA modelling - CDS, SQL Scripting, Graphical view-modelling, SDA extraction Ability to work on Native XS and XSA development Ability to work with and create BW Composite Providers and BW InfoObjects within HANA Studio Experience working with BW InfoPackages, Transformations, and DTP’s Ability to develop BEx Report using BEx Query Designer Understanding of when it is best to use Calculated Column within HANA view or formula within BEx Query DesignerBenefitsWe are committed to offering competitive benefits programs for all of our employees, and enhancing our programs when necessary.Enjoy your best years with our retirement savings plan\nHave peace of mind and body with our health insurance\nMake yourself a priority with flexible schedules, parental leave and our holiday purchase scheme\nDrive forward your career through professional development opportunities\nAchieve your personal goals with our Employee Assistance ProgrammeOur commitment to youOur greatest assets are the expertise, creativity and passion of our employees. We strive to provide a great place to work that attracts, develops and retains the best talent, promotes employee engagement, fosters teamwork and ultimately drives innovation for the benefit of our customers. We strive to create an environment where you feel that you belong, with diversity and inclusion as the engine to growth and innovation. We develop and deploy best-in-class programs and practices, providing enriching career opportunities, listening to employee feedback and always challenging ourselves to do better. This is The Carrier Way.Join us and make a difference.Apply Now!Carrier is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Job Applicant's Privacy Notice:Click on this link to read the Job Applicant's Privacy NoticeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}