{"Job ID": "69872787", "Description": "JOB DESCRIPTION:About AbbottAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.Working at AbbottAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:Career development with an international company where you can grow the career you dream of .\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.Established PharmaceuticalsWe are committed to bringing the benefits of our trusted medicines to more people in the world’s fastest-growing countries. Our broad portfolio of high-quality and differentiated branded generic medicines reaches across multiple therapeutic areas including gastroenterology, women's health, cardiometabolic, pain management/central nervous system, and respiratory.Abbott Established Pharma in French Africa is looking for a Market Access Head to be based in Algiers.Core Job Responsibilities:Horizon Scan\nMonitor government and payer policies, especially as related to coverage, pricing, reimbursement, tender, formulary listing, demand control of EPD portfolio, disseminate business implications, call for actions, increase our pro-activeness\nResponsible for MA authorities and customers\n- MoH as related to drug pricing, reimbursement, listing or other relevant policies\n- Pricing & Reimbursement Authority\n- HTA (Health Technology Assessment) Agencies\n- Public market listing agencies (e.g. EDL, Universal Coverage, gov't tender, public hospital drug formulary committees, country-specific drug formularies)\n- Private market listing agencies (e.g. private health plans, private insurance drug formularies, private hospital drug formulary committees)Develop and execute country Market Access plan, including:\n- Forward-looking opportunity and risk assessment\n- MA customer insights\n- MA strategy\n- Action plan synergized horizontally (partner functions) and vertically (local-global)\n- Proper integration into affiliate business and financial planObtain/ maintain/ optimize portfolio pricing, reimbursement, listing and payer guidelines\n- Perform pricing analysis, capture price increase opportunities, minimize price risks\n- Prospect growth opportunities (e.g. gov’t health programs, gov’t tenders, private health plans, private insurances)\n- Define required portfolio to win, incorporate needs into affiliate portfolio book\n- Develop listing or de-listing strategy in collaboration with partner functions\n- Optimize payer demand control guidelines (e.g. INN Rx, Gx substitution, restricted Rx)\n- Prepare pricing, reimbursement, formulary listing (with or without tender) dossiers\n- Negotiate with MA customers to maximize business outcomeDesign payer partnership and value-added programs to enhance our value offeringImprove Market Access regulations for off-patent products\n- Customize global category value proposition & position paper for local market\n- Complement with local evidences\n- Represent EPD at local industry association, proactively drive off-patent policies\n- Build and lead local external engagement\nBuild fundamentals for sustainable growth\n- Customers: mapping, define/ optimize coverage, ensure quality access\n- Talent: recruit talent to profile, continuous talent developmentSupervisory/Management Responsibilities:Supervise country Market Access teamPart of country Leadership team, Part of function Leadership teamDecision-making/ impact:Directly impact affiliate top and bottom line performance\nApprover for country pricing, reimbursement, listing submission\nChief negotiator for country pricing, reimbursement, listingKey success factors:Excellent access to local market access authorities (MOH, Pricing & Reimbursement authorities, HTA agencies, Formulary listing committees) and key stakeholders (experts, academia etc) to obtain insights and perform effective external stakeholder engagement\nExpert knowledge of country/cluster market access regulations and mechanism in order to derive expert insights to guide affiliate/cluster holistic access strategy\nDemonstrate advanced technical skillsets in strategic and tactical pricing, health economics, policy analysis and stakeholder engagement to deliver market access results\nSuccessful track record in submission and negotiation pricing, reimbursement, formulary listing and payer guidelines in responsible countries/ clusters\nStrong leadership and influencing skills in engaging business leaders and partner functions to establish the function and continuously improve market access contribution to the overall business resultsEducation required:University degree. Additional education in Public Health, or Medicines or Pharmacy or Health Economics is a plusExperience-10+ years relevant experience in Market Access and/or Regulatory affairs, pricing in pharmaceutical industryFollow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life.Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.The base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Algeria", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}