{
    "Job ID": "69872731",
    "Description": "Overview AsAs Planogram Analyst deliver visually appealing versioned planograms based on store clustering, space definitions and defined flow. Work closely with Category Management and Space teams to ensure planograms meet approved parameters. Conduct planogram quality control ensuring all planograms meet assortment requirements, visual appeal, innovation opportunities and shelving metrics. Continuously identify opportunities and implement processes to improve quality and timeliness of output. Responsibilities Functional Responsibilities • Be a single point of contact for category/region by mastering Process and Category knowledge. • Partner with Category Manager / KAM’s to building business context and creating effortless partnership • Acquire Project management skills to lead multiple projects seamlessly and ensuring timely delivery of projects. • Knowledge Sharing: Gain in-depth knowledge of PepsiCo business, categories, products, tools and share new learnings with the team on a continual basis. • Ensure accurate and timely delivery of Projects regarding: • Deliver visually appealing versioned planograms based on store clustering, space definitions and defined flow • Conduct planogram quality control ensuring all planograms meet assortment requirements, visual appeal, innovation opportunities and shelving metrics • Ensure timelines are met by tracking project process, coordinating activities, and resolving issues • Leverage data to allocate right space for right product. • Avoid redundancy in reporting and call out best practices to the team • Display a high sense of accountability when completing requests with high visibility or tight turnaround times. • Scale-up growth by identifying areas where CI is required, both within existing scope, as well as new areas of opportunity. • Create an inclusive and collaborative environment • Work in a team environment with focus on achieving team goals vs individual goals • Actively learn and apply advanced level of expertise in JDA, Intermediate - MS Excel, all other relevant applications. • Work alongside of peers and inculcate best practices and elevate the team's ability to tackle business questions with value adds. Qualifications • 4 - 7 years of experience in Space Planning – JDA, Retail or FMCG Experience. • Bachelor’s degree. • Intermediate level skill in Microsoft Office, with demonstrated intermediate Excel skills necessary • Ability solve problems. • Advanced knowledge and experience of space management technology platform JDA • Ability to work collaboratively and proactively with multi-functional teams / Stake holders. • Best-in-class time management and protization skills. • Excellent written and oral communication skills; proactively communicates using appropriate methods for situation and audience in clear, concise and professional mannerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}