{
    "Job ID": "69873101",
    "Description": "Job Description:Job Posting Title: Associate – Data GovernanceLocation: PuneRole Description:The given role will help with effective implementation of DB’s Management framework across the bank. The role involves delivering value in key areas like data governance, data quality and controls, data lineage and compliance metrics and KPIs by leveraging in-depth process understanding, data analysis and technology driven automation.  What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilities:Reconciling the data flows within Manadated scope to the date onboarded on CCO\nAnalysis to help root cause analysis of any issues identified with Landscape metrics\nSupport maintaining data quality of data assets on Collibra\nDesign and implementation of refined processes to minimize manual interventions in critical CDO processes\nStrong business analysis skills to help detailed data analysis associated to:\nProviding reporting, metrics and content updates to relevant data governance forums.\nDesign and implement automated methodology to capture end to end lineage and tag flows to scope\nDesign and implement methodology to capture additional metadata associated to Authority sources to identify strategic vs. non strategic sources utilized for sourcing data\nDesign and implement methodology to track progress against planned Data Management gap closure plans from Divisions with drill down capabilitiesYour skills and experience:5+ years’ strong experience in the area of data management, data lineage, data quality, regulatory compliance\nExperience with tools like Collibra, Solidatus\nStrong problem solving and analytical skillsHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}