{
    "Job ID": "69873654",
    "Description": "Job Title:Job DescriptionEssential Job Elements:P&L: Manage P&L of the business operations, including the development and execution of the overall business strategy.Operations: Drive operational improvements for contact center operations, including optimizing resource allocation within and across teams, improving operational effectiveness, quality, and performance against SLAs, and measuring progress against business goals.Team management: Manage high performance teams Improve organizational efficiencies, and build scalable business processes and infrastructure. Help align delivery capability to pipeline demand. Design and run scaled operations with a data-oriented approach. Provide vision and leadership for business.Strategy: Lead cross-functional strategic planning activities to plan budgets, expansion plans and operational plans (service design, operations costs, hiring, etc.).Client Satisfaction: Ensure client satisfaction. Become ‘Voice of the Customer’ Establish strong relationships with clients.Business Growth: Lead & collaborate efforts with the solutions team for market opportunities. Support business growth by collaborating with Sales & marketing across geographies.Compliance: Ensure compliance with all client regulatory requirementsProfile and Experience:10+ years of operations experience within a BPO/ Contact Centre with last few years managing and running the operation\nExperience of working with Cable/Telecom vertical is mandatory for this role, experience in both voice/non voice will be preferred\nSuccessful track record in growing and inspiring large teams, with proven ability to select, attract, motivate, retain, and develop leaders and team members\nSuccessful track record of improving performance against quality, efficiency, and effectiveness metrics, and meeting/exceeding contractual service level performance requirements.\nExperience of managing multiple clients, multi-lingual operations\nExperience of managing P&L, driving performance and growing businesses\nExperience with a matrix driven global organization.\nProven track record of building strong relationships with stakeholders\nStrong internal client-facing skills with excellent communication, negotiation and conflict management skills\nAnalytical acumen and the ability to streamline complex processes\nExcellent English communication and the ability to deal with global customers and stakeholders\nMBA/ PG Degree would be an advantage\nShift hours Night/US shiftLocation:Language Requirements:Time Type:If you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California ResidentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}