{
    "Job ID": "69875713",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:As Transformation Governance you will join a dynamic and talented team to help in a series of technology and production transformation engagements run by Technology and/or Business jointly for digitization, product value creation and core product development. In this position you will act as a backbone to the domain specific service team to focus on managing the team to deliver the transformation objective.Key Accountabilities:Generic AccountabilityGoverning transformation roadmap, deliverables alignment to Objective & Key Results (OKRs) as per strategy, defining methodology, structure and interface for good governance, guide key stakeholders, steering committee(s) in making decisions.\nYou will understand strategic business needs and plan for growth, govern and analyze the growth of banking transformation in UAE and other international locations. Develop KPIs for the India team to monitor efficiency and productivity\nLead the production monitoring, incident management, second level of 24H support and all activities related to release management\nContribute to the deliver of the Global Markets initiatives, especially related to interfaces, reporting, market data\nContribute in optimizing market data usage in Global Markets business\nLeading of the Global Markets Data LakeJob Context:Specific AccountabilityThis role will be responsible to ensure effective oversight and governance is in place across our transformation programs, which are organized into distinct OKRs for different stakeholder and organization units.\nThis role will cut across service lines/units and serve as Governance Lead and will look to;\nEnsure consistency of execution across all our transformation programs\nInstantiate effective technology governance and oversight across execution plans\nEnable transformation programs to track and control change decisions more effectively and collaboratively\nDrive comprehensive co-ordination and dependency management across portfolio of initiatives, ensuring strong partnership, communication and coordination.\nUncover blockers that are impediment to progress & define mitigation plans\nAct as an 2nd or 3rd level escalation point for organization units such as Business, PMO, Delivery Assurance teams\nCreate a single source of truth for key stakeholders and Steering Committee(s).15 years leading significant change management projects and/or implementing effective and sustainable governance frameworks for large complex organizations\nSpecific subject matter expertise regarding transformation and program management disciplines and a strong business understanding of the products and services offered by the bank’s business units\nFunctional and technical understanding of critical systems and banking services\nGeneral understanding of relevant banking regulation and supervisory expectations for large complex financial institutions\nTrack record of successfully overseeing complex large-scale transformation programs ideally including technology and/or business driven programs at global level\nTrack record of managing senior internal relationships and demonstrated experience in leading sustained change and change management efforts\nCreative thinker and problem solver, able to distill complex problems down to actionable items\nWell-developed listening skills and a strong ability to engage at the executive management level\nArticulate and effective communicator, both orally and in writing\nStrong interpersonal skills, with evidence of working in collaboration across large, complex organizations, including effective influencing skills, a proactive and 'no surprises' approach in communicating issues/requests\nStrong leadership skills with a proven track record in driving positive and sustained change\nMentors and guides transformation and delivery teams while governing overall transformation objectives and key results (OKRs)Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}