{
    "Job ID": "69874390",
    "Description": "Design Engineer ProcessApply nowKey Duties for Design Engineer ProcessPreparation of PFD and P&ID\nPreparation of Heat Balance and Mass Balance Diagram\nMechanical design of Vessel, Reactor, column & Heat Exchanger as per ASME on PV Elite\nHydraulic Calculation, Pump Selection\nSizing of Equipment and Utility Sizing\nPreparation of Design Basis Report\nPreparation of Piping Material Specification\nPreparation of Process Instrumentation Datasheet\nProcess design & simulation with CHEMCAD & ASPENQualified Chemical Engineer from reputed university / institute preferably with Bachelors / Masters in Chemical Engineering with professional work experience\nExperience in preparation of PFD, P&ID, Piping Material Specification, Sizing of Equipment, Utility Sizing, Heat Balance, Mass Balance, Hydraulic Calculation, Pump Selection, Process Instrumentation Datasheet, etc.\nExperience in Process design & simulation with CHEMCAD & ASPEN\nExperience in HAZOP and HAZIS studies.\nExperience with Process Design on Water Treatment and Wastewater Treatment\nGood communication skill and inter-discipline coordination skill\nConversant with Indian and International Standards and local statutory normsPreparation/review of PFD, P & ID, HFD & Piping Material Specification, Sizing of Equipment, Utility Sizing, Heat Balance, Mass Balance, Hydraulic Calculation, Pump Selection, Process Instrumentation Datasheet, etc.\nDesign/review using simulation soft wares namely, Bentley SisHyd, CHEMCAD & ASPEN, HTRI, CCTherm, B-JAC (HTFS), Mechanical design of Vessel, Reactor, column & Heat Exchanger as per ASME on PVElite, HAZOP and HAZISEquality, diversity and inclusionAgile workingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Electric Power Production & Transmission",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}