{
    "Job ID": "69873596",
    "Description": "IntroductionYour Role and ResponsibilitiesYou:A fearless and dynamic engineer on an upward path:\nYou have ambitious career goals and are looking for a company and team where these goals will be fulfilled.\nYou are not afraid to take risks.\nYou are computer science literate and can demonstrate competency in the qualifications you put on your resume.\nYou can quickly figure out how things work.\nYou can read code and learn from it; you can write code so others can learn from it.\nYou can quickly integrate into a team and start contributing.\nYou are comfortable working in multiple code bases and languages.Us:\nWe are a growing and fast-moving team of engineers helping our customers understand\nand optimize their IT costs. Our work spans the whole stack: we ingest and analyze massive\ndata sets, scan billing and usage patterns for insights, automate these insights and present data\nto our customers in an intuitive UI. We follow the DevOps model.What we want you to do:You will work with a talented team to deliver a market-leading IT Business Management product.\nYou will be a part of a team that has end-to-end ownership of the entire product, from design, development, deployment to operations and interacting with customers.\nYou will collaborate with other teams in Apptio to integrate our product within the overall Apptio ecosystem.Required Technical and Professional ExpertiseProficiency in Full Stack product development\nProficiency with Java is essential.\nProficiency with ReactJS, TypeScript, JavaScript, HTML CSS is essential\nProficient with REST APIs\nProficient with product development experience on both front end and back end\nDemonstrable computer science literacy: algorithms, data structures\nProficiency with system design, software defined infrastructure, microservices\nExperience with relational databases, schema design, SQL\nExperience working in a DevOps model\nExperience working in Linux\nProven application development skills with web or enterprise scale software.\nStrong knowledge of data structures, algorithms, object-oriented programming\nExcellent communication skills, collaboration across teams and critical thinking.Willingness to mentor less experienced team mates.Preferred Technical and Professional ExpertiseExperience with AWS and/or other public cloud technologies.\nDatabase implementations (query optimization, index generation, caching) or NoSQL DBs a plus\nExperience with distributed source control systems such as Git and Mercurial.\nExperience with test-driven development and frameworks (e.g. JUnit).Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}