{"Job ID": "69872923", "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.The Visa Business Solutions (VBS) team is a world-class commercial organization experiencing tremendous, double-digit growth as we expand into new payment flows and continue to grow our core card solutions. This is an incredibly exciting team to join our team as we expand globally. Our team brings payment solutions and associated services to clients around the globe.  Our global clients and partners deploy our solutions to serve the needs of Small Businesses, Middle Market Clients, Large Corporate Clients, Multi Nationals and Governments.  We work closely with Issuers, Merchants, FinTechs and other ecosystem players to deliver these services.  We believe that the market is at an inflection point whereby Visa can play a larger role in building and delivering solutions around the world.  Our focus within Business Solutions is to identify needs, assess opportunities and options and quickly act upon our vision while ensuring strong execution.The B2B Acceptance Client Management team is responsible for building and expanding relationships through active management of key commercial merchants. The Sr. Director is a highly visible role, representing Visa externally to the commercial merchant community and responsible for:Lead the B2B Acceptance teams in Europe, CEMEA & AP that manage the top commercial merchants in each region\nDevelop and lead a tenured client management Director.\nContribute active leadership to the broader B2B Acceptance team and VBS organization.\nIdentify B2B expansion opportunities / agreements with accepting and non-accepting merchants/suppliers and expand B2B commercial volume through Acquisition/Expansion, Partnership or Relationship management\nDevelop, expand and deepen relationships with executives at strategic B2B Clients within focused portfolio\nEnsure merchants/suppliers are optimizing their acceptance environment though use of appropriate tools/solutions. \nActively develop and negotiate acceptance deals with suppliers/merchants to position Visa as a preferred method for commercial payment.\nDrive deep analytics and deal-modeling leadership and partner closely with regional AEs and BDs, and MS&A, Pricing and other functions.\nLocation is Flexible to be near any Visa office location\n20-40% Travel\n This is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Leader with 12+ years of extensive experience in business development, strategy and people/team leadership.\nExpertise and experience in building and managing relationships with stakeholders across large businesses\nExperience and expertise in commercial payments with B2B merchants.\nStrong business, commercial, and financial acumen and political smart and savvy to build credibility, lead and guide key client and internal stakeholders.\nStrong analytical and problem-solving experience with a challenger mindset.\nClient management experience, especially in a consulting environment.\nStrong ability to nurture cross-functional relationships (i.e. issuer, acquirer, suppliers, Visa) and drive solutions for broad payment acceptance.\nAbility to structure, manage, and coordinate complex cross-enterprise, goal oriented, objectives with multiple stakeholders at senior levels.\nExceptional communication skills (written, oral & presentation).Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}