{
    "Job ID": "69872158",
    "Description": "Skills:\n- Attention to detail: A room maid in a pre-opening hotel needs to have exceptional attention to detail in order to ensure that all rooms are cleaned and prepared to the highest standards.\n- Organization: Being able to organize and prioritize tasks is essential for a room maid, as they will often have a large number of rooms to clean within a set timeframe.\n- Physical stamina: The job of a room maid can be physically demanding, as it involves a lot of walking, standing, carrying, and bending. Therefore, having good physical stamina is important.\n- Time management: Being able to manage effectively crucial for a room maid, as they need to ensure that all rooms are cleaned and prepared within the allotted time.\n- Communication skills: Room maids often need to communicate with other members thekeeping team, as well as with guests. Therefore, having good communication skills is important.\n- Flexibility: The ability to be flexible and adapt to changing situations is important for a room maid in a pre-opening hotel, as they may need accommodate last-minute room changes or additional cleaning tasks.\n- Initiative: A room maid should be proactive and take initiative in identifying areas that need attention or improvement, and taking the necessary steps to address them.\n- Teamwork: Working well as part of a team is essential for a room maid, as they will often need to collaborate and coordinate with other members of the housekeeping team to ensure efficient and effective room cleaning.\n- Customer service: While not the primary role of a room maid, having good customer service skills can be beneficial, as they may occasionally interact with guests and need to handle any guest requests or concerns professionally and courteously.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Other",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}