{"Job ID": "69875744", "Description": "Join us as our Executive Direct Tax & Control to advance and learn alongside accomplished business leaders to help customers around the world to optimize their processes and enable growth!At Alfa Laval, we always go that extra mile to overcome the toughest challenges. Our driving force is to accelerate success for our customers, people and planet. You can only achieve that by having dedicated people with a curious mind. Curiosity is the spark behind great ideas. And great ideas drive progress.As a member of our team, you thrive in a truly diverse workplace based on empowerment. You are here to make a difference. Constantly building bridges to the future with sustainable solutions that have an impact on our planet’s most urgent problems. Making the world a better place. Every day.We are looking for a proactive Executive Direct Tax & Control who would be a key figure in supporting the financial function of a business.About the JobTax Accounts – Facilitate closure of Tax Audit to ensure compliant tax disclosures. \nDirect Tax  – Advance Tax working, payments , Tax Return, Assessments, Appeal.\nTransfer Pricing Requirements – Segmental reporting, Benchmarking, OECD Guidelines, TP Report.\nTreasury\nBanking Facilities, Limits, Banking fees negotiation\n Foreign Exchange Covers, FX policy\nInvestment of surplus, risk monitoring\nInternal Controls and Compliance –\nEnsuring Compliance to ICFR and internal control framework.\nModification and maintenance of existing control policies.Who you are:Preferably qualified CA/ ICWA\n5-6 Years of Experience\nAwareness of Indian Corporate Income Tax ComplianceSkillsAbility to communicate articulately and efficiently with other people.\nAbility to work independently prioritization of the work.\nSeasoned professional who can efficiently work under pressure in difference circumstances.\nStrong analytical skills and attention to detail\nGood business acumen for problem solving.\nConfidence to deal with a range of stakeholders.Why should you apply?We offer a best environment to work and learning & growth opportunities at regional or global level. Exciting place to build a global network with different nationalities to mingle and to learn.If you consider yourself qualified for the position, please apply on the given link. Selection and interviews will be ongoing.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}