{
    "Job ID": "69874624",
    "Description": "At Branch, we’re transforming how brands and users interact across digital platforms. Our mobile marketing and deep linking solutions are trusted to deliver seamless experiences that increase ROI, decrease wasted spend, and eliminate siloed attribution. Our team consists of smart, humble, and collaborative people who value ownership over all we do to create a product, team, and company that lives and breathes our motto: Build Together, Grow Together, Win Together.We are expanding our Global Billing team and looking for a Global Billing &amp; Rev Ops,\nAnalyst to thrive in a fast-paced and customer-facing environment. The Global Billing &amp;\nRev Ops team provides global support to various cross-functional teams, and you’ll\nwork with internal stakeholders and external customers to ensure an effortless\ncustomer experience while maintaining accuracy in all billing and accounts receivables\ntransactions. You’ll get the opportunity to make an impact and create a scale for a\ngrowing Finance organization.The Global Billing &amp; Revenue Ops team supports the organization with the\nmanagement of billing operations, A/R (Collections) portfolio, and cash applications,\namong other activities. The Global Billing &amp; Rev Ops Analyst will be hands-on and\nsupport our global team.As a Global Billing &amp; Revenue Ops Analyst You Will Get To:● Support with the processing of system transactions such as service provisioning\n(activation), cash applications, cancellations, and other service related requests\n(e.g., Billing, Collections)\n● Handle outbound collection efforts for domestic and international accounts\n● Maintain accuracy, integrity, and completeness of the accounts receivable\nportfolio by resolving invoice disputes and collecting past due receivables\n● Respond in a timely manner to internal and external billing inquiries with a\n‘Partners First’ mentality and enhance customer experience towards excellence\n● Work across departments to research and resolve invoice disputes and requests\nfor exceptions\n● Assist the organization to maintain and monitor business financials, and support\nthe organization’s short-term and long-term accounts receivable goals\n● Manage domestic and international tax form(s) requests, gather requirements,\nresearch when needed, fill out forms, and obtain executive approval/signature\n● Advocate for the customer with a good business sense, to strike a balance\nbetween protecting the company’s business interests and promoting customers’\nneed for superior customer experience\n● Support the organization in developing and implementing procedures/policies to\nsupport the organization’s objectives in a way they can be enforceable, reduces\norganizational/operational expenses, and increases efficiency\n● Work cross-functionally to develop and optimize billing processes and systems\nfor international markets\n● Support the Finance/Billing Organization with special projects as requestedYou’ll be a good fit if you have:\n● Bachelor’s degree in Accounting, Finance, or Business Administration; an MBA or\nMasters in Finance is preferred.\n● 5 or more years of experience in billing and accounts receivables.\n● Experience in the Software as a Service (SaaS) and IT Product industry.\n● Proficient in business writing and customer service, with a track record of\nmanaging customer inquiries and handling billing disputes in written form.\n● Strong problem-solving skills, capable decision-maker, able to work\nindependently and efficiently with minimal supervision.\n● Adaptability to PST working hours due to the global coverage of this role.\n● Basic understanding of US GAAP accounting principles.\n● Familiarity with Salesforce, Netsuite, and/or Zuora.This is a contract role and works 10 PM IST - 7 AM IST to support our global teamsThis role will be based at our Bangalore office and follows a Hybrid schedule that will be aligned with our Return to Office guidelines.A little bit about us:Branch is well capitalized with funding from&nbsp; investors such as NEA, Founders Fund, and Playground Global.\nWe are headquartered in Palo Alto, CA with teams around the globe.\nDiversity at Branch ranks in the top 10% for similarly sized companies (by Comparably).\nIn 2022, we were recognized as one of Forbes Best Startups and certified by Great Places to Work.\nWe have more than 3 billion monthly users and are partnered with over 100,000 apps.If you think you’d be a good fit for this role, we’d love for you to apply! At Branch, we strive to create an inclusive culture that encourages&nbsp;people from all walks of life to bring their unique, diverse perspectives to work. We aim every day to build an environment that empowers us all to do the best work of our&nbsp;careers, and we can’t wait to show you what we have to offer!Candidate Privacy Information:\nFor more information on the data that Branch will collect through&nbsp;your application, and how we use, share, delete, and retain that information as part of our recruitment and employment&nbsp;efforts, please see our&nbsp;HR Privacy Policy.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}