{
    "Job ID": "69875558",
    "Description": "Job RequirementsHCM Solution Developer – Oracle HCM CloudSummary and ScopeOracle HCM Lead Developer with a functional background in Human Capital Management. You will be responsible for providing support of configurations, interfaces, and processes of Oracle HCM Cloud. You will excel in problem solving, customer service, diagnosis, replication, troubleshooting, and resolution of complicated and critical issues. The focus of this position is to provide technical service and functional knowledge to ultimately drive customer success.This is a full-time position that can sit anywhere in Monterrey (Mexico) and India.Responsibilities·      Own and drive forward Oracle HCM technology architecture. Provide architectural solutions/designs and lead the project execution teams for implementation.·      Provide architectural assessments, strategies, and roadmaps for HCM domains.·      Lead projects within architecture. Work with stakeholders to understand functional requirements and interact with other cross-functional teams to architect, design, develop, test, and release features.·      Troubleshoot issues, working tenaciously to understand the root cause.·      Collaborate with Oracle development when issues require escalation and ensure they are resolved.·      Develop Proof-of-Concept projects to validate new architectures and solutions.·      Support the planning, scoping, and creation of technical solutions for the new product capabilities, through to continuous delivery to production.·      Mentor and provide architectural guidance to team members building innovative applications.·      Drive common vision, practices, and capabilities across the team.·      Provide expertise related to reporting, analytics, and dashboards.Knowledge, Skills and Abilities·      Minimum of 7 years of experience working with Oracle HCM Cloud·      End to End implementation experience with following Oracle HCM Cloud modules: Global HR, Compensation, Talent Management, Time and Labor, Absence, and Recruiting·      Experience with HCM Extracts, HCM Data Loader (HDL), BI Publisher, OTBI, Fast Formulas, Workflows and Alerts·      Experience developing integrations between Oracle HCM Cloud and third-party vendors (ADP payroll, benefit providers)·      Extensive knowledge of Oracle HCM Cloud data model, SQL, PLSQL.·      Knowledge of web service development, design and specifications writing with SOAP and REST·      Knowledge of Oracle HCM Cloud security·      Exceptional verbal and written communication skills, with the ability to communicate effectively with people who have technical and non-technical backgrounds·      Certifications in any modules within Oracle HCM Cloud·      Excellent analytical and problem-solving skills·      Strong written and verbal communication skills·      Proven ability to work remotely and independently·      Natural and supportive team leader·      Experience working within insurance, banking, or other financial services is a plus.·      Experience working on a mix of classic and agile delivery methodologies.·      Understanding of fundamental design principles for security and scalability.Key AttributesExcellent documentation and presentation skills\nExceptional analytical and critical thinking skills, with thorough attention to detail\nExcellent planning, documentation, and problem-solving skills\nDemonstrated passion and ability to leverage technology to evolve and meet client needs\nProject management ability and drive-for-results orientation.Chubb is the world’s largest publicly traded property and casualty insurer. With operations in 54 countries, Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance, and life insurance to a diverse group of clients. Chubb offers a competitive compensation package and comprehensive benefits package including life, health and dental, vision, a generous retirement savings plan, disability coverage, stock purchase plan, flexible spending accounts, tuition reimbursement, and business casual dress. At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religion, age, sex, sexual orientation, transgender, national origin, disability, genetic information, veteran, or marital status, or any other characteristic protected by law.For additional information about Chubb or its services, please visit our website.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}