{"Job ID": "69873509", "Description": "Amazon Line Compensation Consulting is seeking a Compensation Specialist to be part of the centralized Hub function supporting Compensation Consultants, HR Business Partners, recruiters, hiring managers and employees across the globe.\nThis is a unique opportunity to join a growing team within Compensation at Amazon. The job primarily exists to ensure timely and accurate delivery on front-line compensation activities for non-step plan employees. Team members will be customer obsessed, build and implement in the face of ambiguity, problem solve with tenacity, and demonstrate analytical skills while providing centralized support to Amazonians.\nKey job responsibilities\n-Learn and evangelize Amazon's Compensation philosophy.\n-Provides customer service through compensation support including reviewing exceptions with time management.\n-Reviews and analyzes compensation data to identify trends and recommend solutions to improve employee experience.\n-Identifies customer-impacting issues to influence policies, processes and products changes through data.\n-Identifies process defects, makes recommendations/influences and implements improvements.\n-Achieves key performance indicator (KPI) goals and objectives in line with the organization’s goals.\n-Assists in implementing and improving training programs to improve the quality and productivity of the team.\n-Works in a fast-paced operational environment and deploys rapid, accurate judgement in the face of ambiguity.\n-Manages confidential and sensitive employee information and adheres to strict data privacy standards.\nA day in the life\nAs a member of the Compensation Hub team you will work on compensation tasks and approvals alongside Compensation Consultants, HR Business Partners, Recruiters, Hiring Managers and Employees through scalable and standardized best practices, processes and procedures across globally.\nAbout the team\nThe team’s vision is to build a central frontline Hub for providing a customer support and decision making to reduce transactional, judgement activities from Compensation Consultants in Line Compensation Consulting (LCC) organization and enable Consultants to maintain a single-threaded focus on their business and HR partnerships. We currently have a Program Manager (PM) to lead ongoing program management of the Hub, a Team Manager to build, manage and develop the team, 5 Specialists as a frontline support and a Business Analyst to create and implement analytics to measure and report the team’s output.\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- 3+ years of human resources experience\n- Experience with HR processes and systems\n- Proven ability to follow existing processes with high attention to detail.\n- communication skills\n- Ability to work regular shift during US-daytime hours.\n- Ability to work overtime as required, which may include weekends.\n- 2+ years of HR/HR shared service center experience\n- Experience with process improvement and stakeholder management\n- Experience managing confidential and sensitive employee information and adherence to strict confidentiality standards\n- Experience working in a fast-paced operational environment.\n- Global mindset – experience working with international customers and stakeholders.\n- Proven ability to identify process defects, make recommendations for process improvements, and implement/influence process improvements.\n- Basic US legislation knowledge pertaining to HR & Labor.\n- 1+ year using case management system, reviewing cases, determining appropriate processes and policies that apply to a specific situation, and resolving a case or establishing/executing a case management plan.\n- PHR, GPHR, or SPHR certification.\n- Attention to detail and organizational skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}