{"Job ID": "69874242", "Description": "When you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon’s best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400+ billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon India is now Great Place to Work-Certified™. Epsilon has also been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com/apac or our LinkedIn page.Powered by the industry’s most advanced loyalty platform, our Loyalty team makes lifetime connections for brands the world over. Focused on platform delivery, the team is equipped with best-in-class technology, unmatched data expertise and identity resolution capabilities. Our connected suite of products and extensive APIs enable us to support any loyalty strategy - from straightforward to the most complex. Our team of passionate loyalty practitioners and leaders love innovating and bringing unique ideas to life.Why we are looking for youThis position is responsible for developing, implementing, and maintaining .net based applications and components for the automotive marketing platform. What you will enjoy in this roleAdvise and mentor team members in specialized technical areas as well as fulfill administrative duties as defined by support processWork with cross-functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross-functional issues.Recognizes and identifies potential areas where existing policies and procedures associated with support requires improvement and helps in the process improvement activity.Update/create Knowledge Base Articles and case studies as necessary. Assist in the creation and improvement of Knowledge ManagementWhat you will doResponsible for development and maintenance of applications with technologies such as .NET C#/SQL Server/Oracle/jQuery/HTML5/Javascript/Angular/Bootstrap.\nCollaborate with developers, project managers, business analysts and business users in conceptualizing, estimating and developing new software applications and enhancements.\nAssist in the definition of software development project plans, including scoping, scheduling, providing time estimates for programming tasks and implementation plans.\nAssist in the definition, development, and documentation of software’s objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments.\nDevelop technical documentation to define the system components, development environment and implementation planning/strategies\nPrepare and dispense work assignments, provide guidance, and/or review the work of other team members.\nCollaborate with QA team to define test cases, metrics, and resolve questions about test results.\nRecommend business process flow improvements and clearly communicate problem/resolution process to project management.\nDevelops and implements solutions in accordance with policies and procedures.\nAssist in the design and implementation process for new products/projects, informing senior executive of alternatives.\nAnalyze user requests and assist with design activities.\nProvide in-depth and strong technical specialty and knowledge to the team.\nDevelop components based on business and/or application requirements\nCreate unit tests in accordance with team policies & procedures\nAssist in the creation of functional tests in cooperation with the QA teamDeveloper with 9+ years of experience required\nEducation: Bachelor’s degree in Computer Science, or equivalent\nExcellent skills in Angular.js, Bootstrap, CSS, CSS3, jQuery, JavaScript and HTML5, XML, REST Web API, SOAP Web Services\nExcellent skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework\nStrong skills in database technologies (Microsoft SQL Server or Oracle) including database development (T-SQL or PL/SQL).\nExcellent knowledge of web architectural and design patterns\nSolid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML).\nFamiliar with various forms of SSO and an understanding of security best practices such as OWASP\nFamiliar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase.\nAbility to design and implement solutions that are reliable, scalable, and perform at a high-level to meet the service levels associated with mission-critical solutions.\nProven analytical and problem-solving abilities with ability to anticipate and avoid problems.\nAbility to work well within a team environment that includes geographically distributed team members.\nAbility to work within tight deadlines and effectively prioritize and execute tasks in a high-pressure environment.\nStrong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences.\nAbility to design and build flexible and extensible systems with focus on code reuse and generation.\nExperience with writing detailed technical specifications for developers; design, validate and execute software test plans.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}