{"Job ID": "69873345", "Description": "Role SummaryThe role is key to ensuring that the critical finance processes are delivered as per group expectations – accounting, compliance to local and applicable international tax laws, banking and fund management, compliance with governance processes within the territory. The role is responsible to lead the finance team for the annual audit process with the external audit team and deliver the audited Financial Statements for all concepts operating in the territory as well as providing adequate support for Internal audit reviews as and when needed. Finally, this role is the senior most resource in the territory and will be required to provide leadership on multiple business and functional issues as and when required (including issues pertaining to commercial matters and government relations).Key Responsibilties:Develop and maintain systems for prompt and accurate collection of financial and accounting information\nPrepare monthly and quarterly financial statement in compliance with the statutory/regulatory norms\nAnalyze discrepancies and resolve queries pertaining to the reports prepared\nManage accounts payables and accounts receivables for all the concepts\nSupervise Insurance transactions – renewal / addition / claim settlements\nSupervise Banking transactions – Daily fund management / utilization of funds / Liaoning with banks / analyzing banking facilities and Repayment of TR in time/Remittances to Corporate Office\nCoordinate with the central finance team to meet finance deliverables by the territory\nEnsure compliance to local tax laws (VAT, ZAKAT, WHT, Corporate taxes, etc.)\nAssist in budget preparation/financial projections including cash flow statements\nInitiate and develop reporting and tracking systems\nTrain and educate the team members about errors / new system developments\nCorrespond with the Oracle team in the resolution of ERP issues (roll out and system)\nAvert IT infrastructure problems and resolve issues before they impact business availability\nAnalyze Working Capital requirement viz. Receivables, Inventory and Trade Creditors and coordinate with concept HoFs  to arrange the required finances\nManage the performance of the team – set annual performance goals-KPIs, monitor performance and provide constructive feedback to improve performance.\nIdentify their training and development needs and ensure their fulfilment\nDevelop and mentor subordinates to move to the next higher level of job through career planning – succession planning – develop back up as KPI.\nEnsure compliance to Company policies and values\nFacilitate timely and accurate internal audits\nConstantly review of the effectiveness of the existing internal control system, segregation of duties.\nEnsure timely renewal of – Trade Licenses / Lease Agreements / Commercial terms in the lease agreements along with PROs with the different authoritiesQualifications and ExperienceQualified Chartered Accountant/CPA/CIMA with 15 Years relevant experience in Hospitality/Retail/FMCG industry. Expert knowledge of IFRS, Knowledge of ERP based Accounting Systems, IT and supply chain knowledgeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}