{
    "Job ID": "69874335",
    "Description": "Require a bachelor's degree in the area of specialty (B. Com) with ACCA part qualified and a minimum 3 years of experience in the audit/accounting firm. Familiar with standard concepts, practices and procedures within an accounting practice. Rely on experience and judgment to plan and accomplish goals. Perform a variety of tasks. Work under general supervision. A certain degree of creativity and latitude is required to optimize given tasks.Responsibilities as Assistant Auditor / AccountantPerform bookkeeping and prepare balance sheets, profit and loss statements and other financial reports\nEnsure compliance with all applicable accounting standards (IFRS)\nStay current on industry trends, and best accounting and accounting practices\nEnsure accuracy of financial information\nReconcile financial discrepancies by collecting and analyzing account information\nVerify, allocate, post and reconcile transactions (Bank, control accounts, etc.)\nProduce error-free accounting reports and present their results to clients\nMeet tight deadlines of clients to prepare financial statements and relevant reports\nUnderstanding on month-end and year-end closings\nCommunicate effectively with clients and firm management\nContribute to a strong client relationship through positive interactions with client personnelQualifications and SkillsBachelor's degree in Accounting & Finance with ACCA Affiliate or part qualified.\n2-3 years of experience in financial accounting from a firm.\nStrong understanding of Accounting Standards, UAE regulations and VAT.\nStrong interpersonal skills, critical thinking skills, and time management skills\nProficient verbal and written communication skills\nKeen to learn automation and software\nAdvanced level practical experience of accounting software such as Zoho and Xero\nAccuracy and attention to detail\nAptitude for numbers and quantitative skills\nPractice integrity and confidentiality\nInitiative taker and Team player\nAdvance level user of MS excel and PDF applications.\nKnowledge and experience of Ms, word, outlookJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}