{"Job ID": "69873964", "Description": "Software Engineer - Apple DevelopmentWould you like to be part of a team that delivers high-quality software to our customers?Would you like to be part of an entrepreneurial Agile squad creating innovation?About our Team:The team comprises 6 experienced native developers, distributed across Scrum teams working on a single product. The head office is located in Dublin. The primary task is to work on the infrastructure layer of a cross-platform application, supporting Apple, Android, and Windows platforms. You will actively collaborate with teams responsible for the development of the UI and engine layers. Our goal is to ensure a reliable and efficient integration of all application components and to develop new ones.About the Role:This position performs complex research, design, and software development assignments within a software functional area or product line, and provides direct input to project plans, schedules, and methodology in the development of cross-functional software products. This position performs software design — typically across multiple systems; mentors more-junior members of the team; and talks to users/customers and translates their requests into solutions.About the Responsibilities:Interfacing with other technical personnel or team members to finalize requirements.\nWriting and reviewing portions of detailed specifications for the development of complex system components.\nCompleting complex bug fixes.\nWorking closely with other development team members to understand complex product requirements and translate them into software designs.\nSuccessfully implementing development processes, coding best practices, and code reviews.\nOperating in various development environments (Agile, Scrum, etc.) while collaborating with key stakeholders.\nResolving complex technical issues as necessary.\nTraining entry-level software engineers as directed by department management, ensuring they are knowledgeable in critical aspects of their roles.\nKeeping abreast of new technology developments.\nDesigning and working with complex data models.\nMentoring less-senior software developers on development methodologies and optimization techniques.\nAll other duties as assigned.About the Requirement:Qualifications-4+ years of Software Engineering experience.\nBS Engineering/Computer Science or equivalent experience required.Primary Skills:Strong knowledge in Objective-C, Swift and Apple development for iOS and macOS\nStrong knowledge of C++17\nExp. in writing unit and integration tests\nExp. in cross-platform app development\nHave strong research skills.Good to Have-Understanding of JavaScript/TypeScript\nUnderstanding of CI/CD (Drone, Fastlane, Github actions)Technical Skills-Have advanced knowledge of software development methodologies (e.g., Agile, Scrum).\nHave strong knowledge of industry best practices in Apple development for iOS and macOS.\nExperience in cross-platform application development for mobile and desktop.\nHave strong experience in development languages: Objective-C, Swift\nStrong knowledge of C++17\nHave an understanding of JavaScript.\nHave an understanding of CI/CD.\nHave strong research skills.\nHave knowledge of using and developing applicable tool sets.\nHave ability to interface competently with other technical personnel or team members to finalize requirements.\nHave ability to work well with internal and external technology resources.\nHave knowledge of test-driven development.\nHave ability to write and review portions of detailed specifications for the development of complex system components.\nHave ability to complete complex bug fixes.\nHave good oral and written communications skills.Work in a way that works for youWe promote a healthy work/life balance across the organization. With an average length of service of 9 years, we are confident that we offer an appealing working prospect for our people. With numerous wellbeing initiatives, shared parental leave, study assistance and sabbaticals, we will help you meet your immediate responsibilities and your long-term goals.Working flexible hours - flexing the times when you work in the day to help you fit everything in and work when you are the most productive.Working with usWe are an equal opportunity employer with a commitment to help you succeed. Here, you will find an inclusive, agile, collaborative, innovative and fun environment, where everyone has a part to play. Regardless of the team you join, we promote a diverse environment with co-workers who are passionate about what they do, and how they do it.Working for youAt Elsevier, we know that your wellbeing and happiness are key to a long and successful career. These are some of the benefits we are delighted to offer:Group Health Insurance Policy (covering self and family)\nGroup Life insurance/accident policy\nGenerous long-service awards\nNew Baby gift\nSubsidised food provided (applies to India- Chennai)\nCasual Leave, Sick Leave, Privilege Leave, Compassionate Leave, Special Sick Leave, Gazetted Public Holiday and Maternity/Paternity Leave\nFree Transport provided to and from the office (applies to India-Chennai)About UsA global leader in information and analytics, we help researchers and healthcare professionals’ advance science and improve health outcomes for the benefit of society. Building on our publishing heritage, we combine quality information and vast data sets with analytics to support visionary science and research, health education and interactive learning, as well as exceptional healthcare and clinical practice. At Elsevier, your work contributes to the world’s grand challenges and a more sustainable future. We harness innovative technologies to support science and healthcare to partner for a better world.Join UsPurposeful Work\nWhen you work with us, your work matters. You are part of an organization that nurtures your curiosity to stimulate innovation for the communities that we serve.\nGrowing Every Day\nLike the communities we serve, you are on a constant path of discovery to shape your career and personal development.\nColleagues Who Care\nYou will be part of the Elsevier family. We will support your well-being and provide the flexibility you need to thrive at work and home.\nTogether, we create possibilities.\nJoin us-----------------------------------------------------------------------Elsevier is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. We are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our Applicant Request Support Form: https://forms.office.com/r/eVgFxjLmAK .Please read our Candidate Privacy Policy.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}