{"Job ID": "69875700", "Description": "Alfa Laval India is looking for a position of Marketing Insights & Analytics Manager (IMEA)- PuneAbout Us -At Alfa Laval, we always go the extra mile to overcome the toughest challenges. Our driving force is to accelerate success for our customers, people, and planet.We make it happen by having dedicated people with a curious mind. Curiosity is the spark behind great ideas. And great ideas drive progress.As a member of our team, you thrive in an open inclusive workplace, based on diversity with a sense of belonging. This is where you can make a difference by constantly building bridges to the future with sustainable solutions that have an impact on our planet’s most urgent problems.Making the world a better place. Every day.Please feel free to peruse our website www.alfalaval.comThe position / About the Job:Facilitate the overall planning process in a Cluster/SCs. Making sure that all functions participate, and data is interpreted in a strategic way, extracting the key business implications.Marketing Insights & Analytics Manager (IMEA) will be Responsible to --Responsible for driving Insights and Analytics Excellence Area across India, Middle East and Africa Sales Cluster\nActively own relationships with key stakeholders across the business, gathering short and long-term requirements and providing on going market analytic support.\nDevelop proficiency in understanding various internal information databases and be able to think holistically to link with business goals and KPIs.\nDrive annual business planning process for the Clusters and sales companies within\nAbility to think holistically to provide insights based on trends.\nStrengthen the internal focus by carrying out bespoke research/analysis on data to achieve actionable insights for the leadership team supporting in critical business decision making.\nAssist teams and individuals across the business in framing questions, defining goals and constructing aligned, accurate and actionable metrics to track performance.\nDeliver insights effectively through visualisations, reports and decks.\nWithin the marketing team, contribute to continuous improvement of analytic best practices and framework.What you can be –6+ years of proven experience providing market insights and analytic support, ideally within the B2B industry.\nEngineer with MBA would be added advantage.\nHigh level of numeracy with Quantitative/ statistical analytic skills\nProficiency with business intelligence tools like Microsoft Access, Power BI, Microsoft Excel, Microsoft PowerPoint\nExperience with visualizing data in reports, dashboards, and decks\nStrong attention to detail, natural curiosity with ability to problem-solve creatively.\nExceptionally strong communication skills (both written and verbal), strong collaboration skills, and the ability to work effectively with a diversity of business users, of different technical abilities.\nSelf-starter who can effectively manage time and workload.\nAn independent learner who can identify knowledge gaps and opportunities for improvements and reach out for resource.The Location-PuneWhy should you apply:We offer you an interesting and challenging position in an open and friendly environment where we help each other to develop and create value for our customers.\nExciting place to build a global network with different nationalities to mingle and to learn.\nYour work will have a true impact on Alfa Laval’s future success, you will be learning new things every day.We always look for both experience and potential, so if you think you have what it takes to join us and are curious to find out more, apply…Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}