{
    "Job ID": "69872900",
    "Description": "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level.Job Summary:As a Software Engineer III in Digital Investment Bank team of the Corporate & Investment Banking at JPMorgan Chase, you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.Job responsibilities .                                                                                                                                         •    Build Cloud Native applications using micro-frontend architecture for the frontend\n•    Be part of an agile team delivering incremental business value & user satisfaction\n•    Be very hands on and involve in designing, architecting, development and defining and driving the technology roadmap\n•    Demonstrate leadership qualities and provide thought leadership to the team\n•    Build a frontend for services/API, leveraging private and/or public cloudRequired qualifications, capabilities, and skills.This role requires a wide variety of strengths and capabilities, including:Formal training, or certification on software engineering concepts and 3+ years applied experience\nExpert proficiency in React.js, Javascript and  Typescript ecosystem\nUnderstanding of web development practices including security, RESTful & micro-services frameworks\nAdherence to code quality principals and consistent experience with unit, functional, and integration code testing\nExperience with code versioning tools such as Git, etc.\nPassionate about building an innovative culture\nUnderstanding of Agile SDLC methodology, including business analysis, development, maintenance, and improvementPreferred qualifications, capabilities, and skillsExperience with Agile SDLC methodology\nExperience with monorepo design and efficient implementations\nExperience with building cloud-native applications, ideally familiar with AWS, Azure, Pivotal, or other cloud platforms\nFamiliar with designing and consuming APIs/microservices frameworks\nFamiliar with CI/CD pipelines (ex: Jenkins) with end-to-end automation\nUnderstanding of web development best practices including security, RESTful practices\nEngineering in fintech working in Investment Banking or Capital MarketsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}