{"Job ID": "69873081", "Description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.Position Title:                            Workday Integrations DeveloperPosition Level:                           P1-P3Workday Integration AnalystPosition Brand Description:The ERP Services IDS organization is responsible to provide support and advancement of enterprise grade solutions that power the operations of Eli Lilly. The Workday Analyst is responsible for the ongoing support and configuration of Workday and system integrations with other internal and external IT systems. The Workday Analyst will maintain compliant and in control operational processes and drive them to increasingly higher levels of efficiency.  This position will report to the ERP Services HCM Manager.Key Objectives/DeliverablesPartner with business leadership, IT Architects, HR Tech Team, and external partners to maintain effective Workday configuration\nPartner with business leadership, IT Architects, HR Tech Team, and external partners to maintain and build effective integrations between Workday and other solutions\nWork directly with business to research, troubleshoot, and lead resolution for issues\nEffectively prioritize and escalate issues\nBuild robust test plans including those necessary due to release activity, environment changes or other\nAuthor and execute detail test scripts\nMaintain effective systems documentation and maintain integrations per company procedures\nLead projects to upgrade or build new integrations\nContinuously improve the operations of the Workday teamBasic Requirements4+ years' experience in Workday integrations and/or Workday HCM modulesconfiguration.\n4+ years' experience in an IT role supporting global, enterprise or SAAS applications\n2+ years of ITIL based IT support with experience in Incident Management, Problem Management, and Change Management.\n1-3 years of experience and understanding of the legal, regulatory and data privacy environments in which the Company operates.\nProblem solving skills necessary to solve complex technical issues\nAbility to establish relationships with and influence those outside of the immediate area\nAbility to effectively communicate, both oral and written, impact of IT problems in business terms to many levels of the organization\nManage and prioritize competing priorities and manage communications with stakeholders\nCoaching, mentoring and teaching skills\nAbility to independently manage work and meet strict deadlinesEducation Requirements:Bachelor’s Degree in Computer Science, MIS or related fieldOther Information:Travel  0-10%Position based in Bangalore, IndiaEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.Lilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.#WeAreLillyJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}