{
    "Job ID": "69874508",
    "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Senior Project Manager.In this role, you will:Work with the various business and functional stakeholders to understand their integration and data requirements and be responsible for forming strategic solutions in conjunction with the Architecture team.\nBe accountable for shaping and re-organising the various integration and data teams within Management Services, creating a strong devops team, and delivering solutions for all Management Services stakeholders.\nDrive cloud migration projects, understand challenges, remove blockers, help to setup a proper model for cloud build, implementation, release, and support.\nAccountable for delivering Integration and data solutions from inception to Production, to agreed timescales and budget. \nAccurately estimate build/design/development effort and cost, and held accountable to deadlines.\nDefine risks and issues, and propose solutions/mitigations before they are realised. Ensure proposed solution designs utilise group approved technology and adhere to approved design patterns. Research current and emerging technologies and propose changes where needed.\nWork with the architecture team to ensure that the deployed system solutions are appropriately hosted (Internally, Externally, Cloud, PaaS, SaaS) including the corresponding governance and relevant approval processes (both internal to HSBC and external/ country level/ regulatory)\nBe responsible for team management covering resource management, perm vs service provider ratio etc. Drive Enterprise Technology initiatives, such as Mode2 adaption. Ensure Integration and data adherence to all HSBC dev/sec ops requirementsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}