{
    "Job ID": "69873554",
    "Description": "Job Requisition ID: 155526 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.Overview of the roleManage assigned IT spend categories of annual spend in line with the guidelines in the Policy, Co-ordinate with the UAE based and International Business Units, with their Business Finance & with Corporate Shared Services, Handle Procure 2 Pay operations on SAP/ Ariba for self-owned categories and on behalf of assigned team colleagues, Source and Develop new vendors, Manage assigned vendor relationships, Conduct Spend analysis, Conduct sourcing of IT projects consisting of software, hardware and maintenance.What you will doDeliver Cost efficiency & more value for moneyNegotiate overall savings in the range of 5%-10%, negotiate on non-financial parameters such as Payment Terms, Warranty etc.Ensure to adhere the procurement process inline to Procurement policyEnsure RFQ/RFP is floated to all prequalified vendors\nEnsure the same information is communicated to all vendors equally to ensure fair competition.\nEnsure products and services are purchased in most cost and time efficient manner.Effectively evaluates commercial proposalEvaluate and analysis suppliers, vendors commercial proposal by using effective methods of price comparison\nSupport with the technical evaluation process of acceptable bids.\nEffectively supports with the preparation of award recommendations for suppliers with coordination of Business units.Source new and manage competitive vendors\nCreate and maintain good relationships with the vendors/ supplies.\nEnsure minimum number of quotations received per project in line with procurement policy.\nMaintain and update a list of suppliers and their qualifications, delivery times, and potential future development.\nA periodic market research is done to stay abreast on new products, equipment and services emerging in the market.Ensure Operational efficiencyTime taken to approve PR/ PO in the system\nOverall turn around time to close a purchasing request.\nCataloguing of repeated spendsEffective internal customer relationship managementTimely & professional communication with the team & business peersReportingGather spend analysis data, display in visualization dashboard. Set benchmarks for continuous improvement\nTimely generation/updation of management report(s)\nWork with team members and procurement manager to complete responsibilities as needed.Work with team members and procurement manager to complete duties as needed.Required skills to be successfulTechnical Skills: Knowledge of handing procurement operations on ERP and/or a P2P platform is desirable ·\nProficient in use of MS Office Applications (Words, Excel, PowerPoint) ·\nStrong data analysis skills with ability to derive logical conclusions.\nLanguage Skills: · Strong verbal and written English communication and preferably can speak Arabic.What equips you for the roleBachelor’s Degree or equivalent\nAny Procurement or Finance Certification is an added valueWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}