{
    "Job ID": "69873323",
    "Description": "Position Overview:As a Senior Technical Engineering Manager at Intella, you will play a pivotal role in leading our technical teams, shaping the direction of our Artificial Intelligence projects, and contributing to the startup's growth and success. This role offers a unique opportunity to be at the forefront of AI innovation and help steer our company towards new horizons.Key Responsibilities:Technical Leadership: Provide visionary technical leadership for Artificial Intelligence projects, guiding the team in the development of innovative solutions that align with our startup's mission\nTeam Management: Lead and mentor a team of skilled engineers, fostering a culture of collaboration, creativity, and excellence.\nProject Execution: Oversee the end-to-end execution of AI projects, from ideation to deployment, ensuring high-quality results, on-time delivery, and efficient resource utilization.\nTechnical Strategy: Contribute to the development of the technical roadmap, identifying opportunities for growth, optimization, and emerging AI trends.\nCross-Functional Collaboration: Collaborate closely with cross-functional teams, including data scientists, product managers, and designers, to ensure seamless integration of AI solutions into our products.\nTechnical Expertise: Stay at the forefront of Artificial Intelligence technologies, tools, and methodologies, and guide the team in their application.\nQuality Assurance: Establish and maintain robust quality assurance processes to ensure the reliability, accuracy, and security of AI systems.\nTechnical Problem Solving: Address technical challenges with creativity and innovation, finding solutions to complex AI problems.Qualifications:Educational Background: A bachelor's degree in computer science, engineering, or a related field is required. A master's or Ph.D. in AI, machine learning, or a related discipline is highly desirable.\nProfessional Experience: Minimum of 8-12 years of progressive experience in AI, machine learning, or deep learning, with a proven track record of leadership and project delivery.\nStartup Experience: Experience working in a startup environment, demonstrating adaptability, resourcefulness, and the ability to thrive in a fast-paced, entrepreneurial setting\nTechnical Proficiency: Profound knowledge of Artificial Intelligence technologies, frameworks (e.g., TensorFlow, PyTorch), and programming languages (Python, Node, Asp.NET, etc.).\nLeadership Skills: Strong leadership and team management skills, with a history of leading and motivating technical teams to achieve exceptional results.\nCommunication Skills: Excellent communication and interpersonal skills, with the ability to convey complex technical concepts to diverse stakeholders.\nProblem-Solving Skills: Exceptional problem-solving abilities and a willingness to tackle novel challenges with enthusiasm.\nAdaptability: An adaptive mindset, ready to embrace new technologies and approaches as the AI field evolves.\nPassion for Innovation: A deep passion for AI and a strong desire to make a significant impact in the AI startup ecosystem.\nEntrepreneurial Spirit: A proactive, entrepreneurial mindset, with the ability to take initiative and drive projects forward in a dynamic startup environment.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}