{
    "Job ID": "69873093",
    "Description": "Associate Manufacturing EngineerCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest (Per Boeing LinkedIn page) aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, Model-Based Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.  With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.Job Description:The Boeing India Engineering is currently looking for an Associate Manufacturing Engineer to join the Boeing India Engineering Team located at Chennai, India.This team has been developed to create growth and development opportunities for the employees in multiple domains and fostering execution excellence for the organization. For the employees, it positions them for further career growth through assignments and trainings. For the organization, it helps build ready-now agile teams who are able to work across different domains and projects. Position Responsibilities:Manufacturability knowledge, information and requirements into the acquire and define program phases as the designated Integrated Product Team (IPT) interface.\nConceptualizes the program architecture for build. Defines, develops and implements the manufacturing plan and represents the program as the primary manufacturing integrator throughout the acquire, define, produce and support phases of the product life cycle.\nAssists in the implementation of Lean principles and technologies. Interfaces with professional associations, suppliers, IPTs and internal customers to develop products, skills, knowledge and experience.\nInterfaces with professional associations, suppliers and internal and external customers to implement program initiatives.Basic Qualifications (Required Skills/Experience):Bachelor degree in engineering, preferably in Mechanical / Aerospace / Aviation / Production Engineering from an accredited university and typically 5 to 8 years' related work experience or (e.g. Master 4 to 7 years' related work experience, etc.) in aerospace domain.\nExperience in manufacturing systems such as DELMIA PE and/or Product Data Manager (PDM)/CAPP.\nKnowledge of NC Programming will be an added advantage\nAwareness of ENOVIA/ CATIA, CREO, UG NX or SolidWorks is added advantage\nModel Based Definitions, Model Based Instructions is added advantage\nDrafting: Good in drafting standards (ANSI Y14.5M-2009), GD&T, design for manufacturability.\nDesign: Awareness of different materials used in aerospace industry and related finishes & coating processes, Material Selection.Preferred Qualifications:Good knowledge of Engineering Fundamentals for mechanical design of simple aerospace components with awareness on aerospace materials, manufacturing processes and heat treatments etc.\nExperience working with global experts in engineering & manufacturing in cross culture performance and hands on / coordination experience working in factory environment\nIdentifies issues and seek help in solutions to routine technical problems of Manufacturing process planning\nBe a self-starter, able to work with minimum supervision, positive attitude and highest ethics\nPro-actively seek information and direction to successfully complete the statement of work\nMust be able to work collaboratively with very strong teaming skills. Must be willing to work flexible hours (early or late as needed) to interface with Boeing personnel around the world\nDevelop and maintain relationships / partnerships with customers, stakeholders, peers, and partners to deploy collaborative plans and execute on projects\nAwareness of AS9100 D quality management system\nGood analytical approach for problem solving, driving the innovations with speed and agility.\nMust be able to work collaboratively with cross-functional teams within Boeing and external partners\nDemonstrate strong written, oral and interpersonal communication skills. Be fluent in written and spoken English, and have high degree of proficiency with MS Office tools.Typical Education & Experience:Bachelor degree in engineering, preferably in Mechanical / Aerospace / Aviation / Production Engineering from an accredited university and typically 5 to 8 years' related work experience or (e.g. Master 4 to 7 years' related work experience, etc.) in aerospace domain.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}