{"Job ID": "69873099", "Description": ", IndiaJob Family Group:Worker Type:Posting Start Date:Business unit:Experience Level:Job Description:Job Description:The Engineer - PTM (Process) is an experienced (5+ years) process engineer tasked with remote monitoring and process performance reporting for chemical processes. The engineer plays a critical role in early detecting and alerting of production performance issues and supports the continuous improvement of the production process.There are no direct reports with this role, but the engineer is expected to interact directly with the site production unit and key site production unit supporting staff.Key accountabilities:The key accountability of the Chemicals Process Engineer PTM is providing support of the technical content for their respective technology or theme area. Performs proactive technical monitoring of the process technology against the safe operating envelope and limits for the process unit(s) that reside within their technology or theme area base. Audits and supports technical content development and other unit performance KPI’s to assure the operation is compliant. The purpose of this activity is to understand unit and equipment performance, identify threats, troubleshoot performance and reliability gaps, and identify opportunities for improvement. This activity feeds into multiple deliverables.• Supports continuous improvement of the theme area. The PTM engineer is assessed based on the delivery of theme area improvement each year which is considered comparable to supervisory team lead leadership. Maintains and improves the portfolio of their respective theme area and delivers value through improvement of the overall theme.• Supports compliance to global and site standards for technical monitoring process and practices in collaboration with P&T and Global work process focal points. This includes implementing and ensuring sustainability of such programs as Advanced Technical Monitoring (ATM) or SMART M.• Provides inputs and guidance to the OSE’s/CSE’s assigned to the physical assets to ensure their assigned assets are operated in a safe, environmentally sound, and reliable manner in accordance with the license to operate and the defined safe operating envelope.• Trains OSE’s and others in how to develop, maintain and use for Proactive Technical Monitoring (PTM).• Maintains up to date technology specific knowledge through LFI, technical networks etc. so as to be able to proactively identify threats to the units or business coming from the wider Shell organization or industry knowledge and practices.• Identify opportunities to improve unit capacity, yield, availability, and utilization in support of the site and business plans.• Participates in technology forums, conferences to share learning and maintain and improve competencies in their specialty.• Maintains and help’s develop training materials and guidance manuals designed for Engineers in conjunction with P&T and Learning.Skills & RequirementsUniversity Degree in Chemical Engineering.- 5+ years of experience in a chemical complex or a refining facility.- Expertise in the chemicals processes (EOG, MEG, SMPO) preferred- Good communication skills.- Good organization, documentation, and follow-up.- Time management skills.- Problem solving skills- knowledge of engineering Standards and best practices.- Computer skills.- Working knowledge of refinery Control systems equipment and technology- Blueprint, FIM investigation, MOC knowledge.- Motivates, coaches, and develops- Values differences- Delivers results- Planning skills- Analyzes and solves problems- Working knowledge of field Measurement, IPF, Quality Measurement, Metering, Base Layer & APC, DCS systems-DISCLAIMER:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}