{"Job ID": "69874640", "Description": "Class Teachers - Maternity CoverFS2 - 17/03/24 - 30/05/24Year 3 - 18/02/24 - 30/05/24Class Teachers required for maternity cover at Doha English Speaking Preparatory School, Qatar.DESS is the premier not-for-profit school in Doha with an outstanding reputation for excellence in teaching and learning. The school is sponsored by the British Embassy and is a proud member of IAPS, COBIS, and BSME. We are a dynamic Prep School with a clear direction, having learning at the heart of our mission. Our children represent 31 nations (90% British) and together generate a culture of success and enjoyment. Learning is led by an excellent group of adults who work in teams to achieve the highest standards academically, as well as providing a very happy working environment. DESS achieved an Outstanding PENTA inspection in May 2017, a COBIS inspection in March 2023 and a BSO Inspection in May 2023 when we achieved Outstanding in all areas. DESS was also voted QBBF Organisation of the Year 2017.We are seeking lively, dynamic Primary teachers to join our team of hardworking and motivated professionals.Suitable candidates will hold UK recognised teaching qualifications, be exemplary practitioners, and enjoy working as part of a team. Candidates must promote high standards and expectations and be committed to contributing to the further development of the school. Teachers who have completed their first year of full-time teaching, are encouraged to apply.We are offering:• A generous tax-free salary• Opportunities for professional development• Small classes & excellent facilities• Fully furnished, air-conditioned accommodation (Sponsored Staff only)• Free utilities (Sponsored Staff only)• On-site swimming pool and sports facilities• Annual return airfares to the UK (Sponsored Staff only)• Private Health Insurance (Sponsored Staff only)• The chance to work in one of the sunniest and most rapidly developing cities in the world!Please apply using the online application at https://dess.breezy.hr/ by 5th 2022 at 1.00 pmInterviews will be held through Google Meet in May 2022, shortlisted candidates will then be observed teaching.We reserve the right to close a position once we have received sufficient applications to form a shortlist. Early application is therefore encouraged.We invite you to visit our school website at www.dess.org to find out more about us. We look forward to receiving your application.Our School is committed to safeguarding and promoting the welfare of children – successful candidates will be subject to relevant Child Protection and reference checks.Please note that all applicants will need to provide:An ICPC certificate, birth and marriage certificate, and certified copies of original Education Certificate/s duly notarised and attested by a notary public in their country of issue, a transcript of their university degree, and a letter from the university stating in-person study. These must be stamped by the Qatar Embassy in the country of issue and by the MOFA (Ministry of Foreign Affairs) in Qatar. (Advice can be provided by the school regarding how these can be obtained).\nOur school is committed to safeguarding and promoting the welfare of children - successful applicants will be subject to relevant Child Protection and reference checks.Link to the job descriptionJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Doha, Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}