{
    "Job ID": "69874240",
    "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.Publicis Sapient is looking for Manager / Specialist Technology (Java/Microservices) to join our team of bright thinkers and doers. You’ll use your problem-solving creativity to design, architect, and develop high-end technology solutions that solve our clients’ most complex and challenging problems across different industries. We are on a mission to transform the world, and you will be instrumental in shaping how we do it with your ideas, thoughts, and solutions.Your Impact:  A hands-on solution architect who has delivered at least 3-4 large-scale projects from ground zero and holding experience in building large-scale, high-volume, low latency, high availability, and complex distributed services.Your Experience & Skills:Experience: 10- 14 yearsProposal and engineering InitiativesWorked on various client-specific proposals\nManage and grow client accounts\nManaged a large sized teamArchitecture and DesignAbility to identify, showcase potential solutions, and recommend the best solution based on requirements.\nManage stakeholders to drive key decisions on tools, technologies, user journeys, and overall governance\nExperience in object-oriented, SOLID, and DRY principles, reactive programming models, Microservices, and event-driven solutions\nDelivered solutions on alternative architecture patterns to meet business requirement\nUnderstands enterprise security, compliance, and data security at the network and Application layerLanguage & frameworks and DatabaseWorked extensively on Java language Java 8 and above, having used concurrency, multithreaded models, blocking/non-blocking IO, lambdas, streams, generics, advanced libraries, algorithms, and data structures.\nExecuted database DDL, DML, modeling, managed transactional scenarios & Isolation levels, and experience with NoSQL and SQL-based DBs in the past.\nExtensively used Springboot/ Spring cloud or similar frameworks to deliver a complex scalable solution\nWorked extensively on API-based digital journeys and enabled DBT and alternatives technologies to achieve the desired outcomesToolsUsed build and Automation tools, Code Quality Plugins, CI/CD Pipelines, and Containerization platforms (Docker/Kubernetes)\nUsed logging and Monitoring solutions like Splunk, ELK, Grafana, etc., and implement technical KPIs.\nExtensively used application profiling tools like profiler, Yourkit, Visual VM, etc.Platforms & Cloud ServicesSuccessfully delivered solutions using one of the cloud platforms e.g. AWS/GCP/Azure/ PCF\nIntegrated with messaging platforms e.g. RabbitMQ/ Kafka/ cloud messaging/ enterprise messaging\nApplied distributed caching solutions like Redis, Memcache, etc.Testing & Performance engineeringMemory management, GC, and GC tuning.\nWriting JUnit test cases, mocking e.g. Mockito, PowerMockito, EasyMock, etc.\nBDD automation tools like Cucumber, JBehave, etc.\nExecute performance and security tests addressing non-functional requirements.Set Yourself Apart With: Any Cloud certification, Modern Technology exposure (AI/ML, IoT, Blockchain, etc.)A Tip from the Hiring Manager:We at Publicis Sapient, enable our clients to Thrive in Next and to create business value through expert strategies, customer-centric experience design, and world class product engineering. The future of business is disruptive; transformative; and becoming digital to the core. We seek the (Passionate Technologists) who areDeeply skilled, bold, collaborative, flexible\nReimagine the way the world works to help businesses improve the daily lives of people, and the workEducation:Bachelor’s/Master’s Degree in Computer Engineering, Computer Science, or a related fieldGender-Neutral Policy\n18 paid holidays throughout the year.\nGenerous parental leave and new parent transition program\nFlexible work arrangements\nEmployee Assistance Programs to help you in wellness and well being  Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}