{
    "Job ID": "69873994",
    "Description": "Department : Global Medical Affairs.Are you passionate about quality and simplification? Do you want to build quality within processes in the most efficient way? Do you have an innovative mindset to drive change in a future-ready environment and support your colleagues and stakeholders by challenging the status quo in a friendly and open-minded way? If so, there is a job opportunity waiting for you as our new Medical Illustrator -Graphic Designer. At Novo Nordisk, we will challenge you to do the best work of your life. Apply Now.The PositionMedical Illustrator will be responsible for the creation of medical communications content, create/format PowerPoint, word, excel documents used for internal and external medical communication based on inputs from Global Medical Affairs – Medical Communications team.Create brochures, infographic reports, illustrations, posters and presentations for a range of internal and external medical communication based on inputs from the Global Medical Affairs – Med Comm team.\nCreate 3D models, animation, motion graphics and textures using Adobe After Effects software.\nEffective communication and expectation setting with relevant stakeholders in the medical affairs teams regarding expected quality and timelines on delivery.\nEvaluate and recommend new methods, materials, and equipment for use in medical illustration and Follow standards and guidelines for consistency with corporate visual identity.\nEffectively follow review/approval process to obtain approvals and signatures for projects and create videos and explore opportunities for innovation in design.QualificationsPrerequisites to master the job are experience in the medical communications/pharmaceutical industry.\nMinimum of 3-5 years of graphic design experience required.\nIn-depth knowledge of anatomy, medical terminology, and medical illustration principles. Maya, Blender, After Effects experience desired and digital photography experience helpful.\nExperience in developing PPT presentations and interactive PDFs.\nAbility to successfully manage multiple projects and priorities.\nBachelor’s Degree in science/engineering/fine arts (Preferred but not required).\nGraphical design background with a solid understanding of medical communication.\nGood team player with communication and stakeholder management skills.About the DepartmentGlobal Medical Affairs, GBS (GMA GBS) is an extension of the Global Medical Affairs team in Headquarters (HQ) in Denmark and Zurich, based out of Global Business Services (GBS), Bangalore, India. The team consists of highly motivated medical advisors, project managers, scientific advisors and publication managers working together with HQ, regions, and affiliates across the world. Our core competencies are communicating scientific and medical knowledge on our products to the external scientific community and across the organisation, delivering external medical events including in-house content development and project management and Publication planning.Working at Novo NordiskAt Novo Nordisk, we don’t wait for change. We drive it. We’re a dynamic company in an even more dynamic industry, and we know that what got us to where we are today is not necessarily what will make us successful in the future. We embrace the spirit of experimentation, striving for excellence without fixating on perfection. We never shy away from opportunities to develop, we seize them. From research and development to manufacturing, marketing, and sales – we’re all working to move the needle on patient care.ContactTo submit your application, please upload your CV online (click on Apply and follow the instructions).Deadline29th September,2023.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}