{
    "Job ID": "69875346",
    "Description": "Digital Services Activity Leader is responsible for the complete performance of the new energy management softwares, asset management solutions & the related softwares in Turkey, Central Asia & Pakistan Cluster. Reporting directly to the Cluster Marketing Manager, s/he also takes active role in the creation and deployment of Field Services Strategy with Field Services Cluster VP & Marketing Manager for his/her related portfolio.Manages Digital Services offer portfolio with direct involvement in the sales process, from prescription to delivery.\nEnsures a strong pipeline and order intake through customer visits and demand generation actions.\nStrive for the growth and profitability of Digital Services offers in the cluster, drive, monitor and report the demand generation initiatives of them in order to increase the pipeline of opportunities, with a focus on early stages (2-3-4)\nSupports team members to leverage IB intelligence and generates business through sales campaigns and any other relevant initiatives\nManages the commercial teams commitments on the growth actions deployment and business objectives.\nSaturates the 'Go to market' by using all relevant Channels. Define & deploy new GtM models if needed, per segment and offer.\nLeads the new offers launch process (Business case, local launch team coordination..),\nMonitors closely the performance of his/her offers (OI, sales, GM)\nDeploy the Annual Marketing & Sales Plan with the countries/ providing feedback on existing offers and facilitating voice of customers to the LOB.\nEnsure proper visibility of pipeline and achievements thru application of BFO guidelines\nUnderstand local processes and tools and promotes global tools when relevant - provide feedback on improvement of tools\nSupport marketing communication team for deployment of digital assets & media communications\nTake neccesary initiatives with internal and external shareholders to ensure correct “Asset Management Life Cycle” stages are drived in the offer mixes.\nPerform competition, market share & accessible market analysis for targeted segments, inline with AMR actionsThe successful candidate should have bachelor's degree in engineering or equivalent work experience, at least 3 years in marketing or technical sales experience.\nCan-do attitude, willing to take the extra step to ensure customer satisfaction is guaranteed\nFluent communication in English, both oral & written is a must.\nSolid sales and business development skills in his/her area of expertise\nStrong knowledge and understanding for Software as a Service (SaaS) business model\nGood grasp on consultative sales approach, value based communication & negotiation\nUnderstanding on the country/regional requirements of the market\nApplication knowledge in electrointensive segments is a plus\nPreferablly proven track record for software salesJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}