{"Job ID": "69874521", "Description": "Job Title:Site Financial ControllerEntity: SiteDepartment: FinanceHierarchical Manager(s) Title(s)Site General ManagerFunctional Manager(s) Title(s)Regional Operations Finance Directoror Product Group Finance Directoror Product Line Finance DirectorMissionDescribe the principal mission of the position:Site controlling and reporting\nBusiness productivity improvement : planning and follow-up\nReliability of information - Safety of assetsResponsibilitiesHighlight the main responsibilitiesManage site Finance department different functions (Accounting, Controlling & Treasury)\nManage site financial performance, KPIs and monitor site efficiency plans.\nSupport local management & PG with needed data and financial view\nConnect Group & Site strategies and objectives with Finance objectives\nEnsure accuracy of management control and costing information in the ERP system of the site\nEnsure reliability of site OM, below OM expenses and working capital. Justify monthly results & forecasts\nBalance sheet, Cost & CAPEX control\nEnsure budget alignment, put action plan for closing gaps\nProvide all supporting information for closing entries (cut off adjustments, accruals, risk estimates...).\nPromote, explain, control Internal Control framework within his/her perimeter.\nMonitor and drive Internal Control improvement plans to mitigate risks & ensure compliance to Group rules.\nPrepare & manage monthly forecast, annual budget, mid-term plan\nDefine, assess & control R&D hourly rate\nSupport shared services centre in resolving day to day issues related to site.\nSupport sales and R&D management control\nSite interface for tax credit, R&D grants and subsidies.\nMitigate tax risk and ensure adequate compliance to country's tax laws\nLiaise with external auditors for statutory Financial statements, ensure accurate reliable statements\nManage treasury topics and align with Group treasury team\nProcesses optimization and automation\nContribute to the Group Ethics & Compliance program by applying and respecting code of Ethics and Valeo's policies.\nPeople management: Supports in the training and career development of finance people. Creates a proactive team within his/her perimeter and help identifying high potentials.People Management: YES X NONumber of people: 2-15Budget Management: YES X NOAttachmentsPositioning of the Job within the Organization Chart\nCompetence Profile for the Job CodeCandidate ProfileEducation/TrainingWhat education and education level are necessary for the position?Degree in Control Management, Finance, or Audit from a Top Business School or MBAProfessionalExperienceHow many years of professional experience in a specific professional area are required for the position?15 years work experienceInternational exposure & Multinational mindsetJob:Organization:Schedule:Employee Status:Job Type:Job Posting Date:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}