{
    "Job ID": "69874625",
    "Description": "Hasura is hiring Support Engineers who can help our customers/community be productive with Hasura, and achieve their desired objectives by helping resolve their queries/issues related to Hasura features and usage patterns. You will work with our users across different product categories (Open Source, Cloud and Enterprise) to address questions in a ticketing system, and Github discussions forum to provide responsive and quality support. Internally, you will act as the voice of the user within the company, and liaise with the product and documentation teams to surface necessary changes.Prior experience in a technical support role, solving cases using a ticketing system\nBackend or Fullstack engineering experience, with a solid understanding of the modern web application stack.\nExperience working with relational databases like Postgres, MySQL, SQL Server, etc.\nExperience with a backend language/framework like Java/Spring boot, Javascript/Node.JS, \nPython/Django, etc.\nFamiliarity with Docker and CI/CD tooling.Creative problem-solving skills.\nVery good written & spoken communication skills in English.\nPrior experience in a developer tools company.\nFamiliarity with GraphQLAt Hasura, we help developers go from zero to fully fledged modern apps, blazing fast. Through your work at Hasura, you will have the opportunity to make a lasting impact on both how Hasura is built as well as the larger developer ecosystem.\nAs a team, we take a lot of pride in our work. We obsess over the developer experience, and our first priority as a company will always be to make things easier for our users.Remote & Hybrid Work Environment: Our team is spread across 18 countries and we’re a remote workforce. We have office spaces in San Francisco and Bangalore for those who want to catch up for high-bandwidth discussions over a whiteboards and snacks!\nSelf-care Fridays: We have the second Friday of every month off - so we always have at least one long weekend to recharge and spend time taking care of ourselves.\nEquipment and learning allowance: We have equipment and learning budgets to ensure team members have what they need to be successful in their roles.\nDonation Matching: We have a donation matching fund of USD 20,000 / year to match employee donations to global organizations working towards equality & equity.\nFlexible timings & PTO: Pick work hours that suit you the best! Ensure that you have effective overlaps with your team members as required, and choose the time and place of work that brings out the best in you.We are on a mission to making developing modern apps and faster APIs a cake walk, and we can’t wait to have you onboard with us! We welcome any questions during the interview process that you may have about our culture, the kind of work we do and the process we employ to make it all come together.\nWe are an equal opportunity employer and do not tolerate discrimination of any kind.We'd love to hear from you. Even if you don't fulfill 100% of the above requirements or are unsure whether this would be the right fit, please apply to us with your questions.Hasura is a venture-backed open-source technology company that makes your data instantly accessible over a real-time GraphQL API, so you can build and ship modern apps and APIs faster. Hasura connects to your databases, REST servers, GraphQL servers and third party APIs (eg: Stripe, Salesforce) and provides a unified API across all your data sources.Hasura Cloud is a highly available, hosted API-as-a-Service, managed entirely by Hasura. It removes the additional ops overhead and takes care of availability and scaling with elegance.We are a globally distributed team, with offices in San Francisco & Bangalore.--Link to this page - https://hasura.io/careers/?jobId=pQ-nGj_vberfJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}