{
    "Job ID": "69873699",
    "Description": "The Shipping Tech and Services organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors on our team in Hyderabad, TS.\nThis Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. Role responsibilities include managing multiple complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travel. This candidate will help build a positive team environment and establish working relationships inside and outside of the group.\nKey job responsibilities\n• This position will require at least 3 days a week in-office\n• Management of complex calendar and scheduling to support teams in multiple global locations and time zones.\n• Manage expense reports, and domestic and international travel.\n• Organize, execute, and assist with team meetings and activities.\n• Understand business priorities and proactively look for ways to improve processes to create efficiency and scale for the leadership team.\n• Plan the annual calendar, and facilitate the integration and prioritization of business activities.\n• Build relationships with Executive Assistants throughout the team and across the company as well as with Finance, HR and Legal partners for the organization\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- 3+ years of senior level leadership support, or 1+ years of Amazon experience\n- High school or equivalent diploma\n- Experience with Microsoft Office products and applications\n- Experience with executive level calendar management\n- Experience in a fast-paced, high-tech company\n- Experience managing multiple calendarsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}