{
    "Job ID": "69875697",
    "Description": "At The Economist Group, we champion progress, by helping people understand and tackle the critical challenges facing the world. The Economist Intelligence Unit (EIU) is a world leader in global business intelligence. We help businesses, the financial sector and governments to understand how the world is changing and how that creates opportunities to be seized and risks to be managed. At our heart is a 50 year forward look, a global forecast of the majority of the world’s economies, we seek to analyse the future and deliver that insight through multiple channels and insights, allowing our clients to take better trading, investment and policy decisions. We’re changing, embedding alternate data sources such as GPS and satellite data into our forecasting, products will increasingly be tailored to individual clients, driven by some of the most innovative data in the market. A highly collaborative team of Product Managers, Customer Experience and Product Engineering is being created with a focus on creating business and customer value driven by real time analytics alongside our traditional products.Join us, to engineer innovative products that bring insight and analysis to global leaders in business and government. Whether building new Economist Intelligence Unit products,  ideating mobile apps that deliver personalised content, or evolving our flagship website, economist.com, you will help transform how we acquire, convert, engage and retain our 1.2 million subscribers.We are developing a world-class enablement team and have an exciting opportunity for a Senior DevOps Engineer to help us build functional systems that improve our customer experience. The enablement team is responsible for driving DevOps across all of our product engineering teams. As a Senior DevOps Engineer you will partner with Senior Management to embed cloud technology and best practice; transforming the capabilities and efficiency of product engineering teams within our organisation.The engineering division has experienced unprecedented growth over the last 18 months, and as a result we’re looking for a DevOps specialist who is eager to develop their skills and career. We have a Gurugram in HQ, which is used for collaborating and connecting in-person–although many of our tech roles operate on a flexible “remote first” policy.How will you contribute:Work with product engineering teams using your proficiency in provisioning, application deployment and AWS.\nMonitor system health and reliability to improve & support business process requirements.\nDesign, write and deliver software to improve the availability, scalability, latency, and efficiency of our services\nEnsure cloud-based infrastructure is secure and efficient.\nManage, configure and automate systems and services in AWS.\nDeploy product updates, identify production issues and implement integrations.\nOwn and drive improvement on Mean-Time-To-Repair and Mean-Time-Between-Incidents uptime.\nPerform deep-dive analysis for all major incidents, coordinating with support and Infrastructure teams to identify root cause in both application and infrastructure.\nTackle complex technological infrastructure and security.\nEducate and mentor engineering team members on AWS services and SRE/DevOps best practices.\nPartner with Senior Management to deliver an enablement roadmap.The ideal skills for the role are:Previous experience working with cloud technologies, AWS products and services.\nSystematic problem solving approach, coupled with a strong sense of ownership and drive.\nKnowledge of cloud infrastructure setup and management for high-scale and secure web applications.\nMain language speciality (or similar) in Python, AWS CDK,Codepipeline/Codebuild for CI/CD, log.io and NewRelic.\nFamiliarity with programming languages - Typescript, Node and Go or C#, Dotnet and Bash.\nExperience using IaC and DevOps tools such as Terraform, Ansible and CloudFormation (or similar).\nExperience with modern CI/CD tools for delivery and automation.\nCapable of performing technical deep-dives into code and architecture.\nFamiliarity with any of the well-known DevSecOps frameworks.\nCapable of working in agile team with multiple technologies.\nYou understand the importance of using metrics to influence product and technical decisions.\nYou are an advocate for modern DevOps/SRE tools, best practices and culture.\nSystematic problem solving approach, coupled with a strong sense of ownership and drive.\nAbility to communicate effectively with technical and non-technical audiences.We believe that having a diverse workforce can be conducive to creativity, innovation and adaptability and we encourage all employees to be:Authentic - Come as you are! We all play a part in building our culture. Whether it's through welcoming new colleagues, team building activities, joining colleague events, celebrations or affinity groups there’s an opportunity for you to get involved.Creative - Our global digital publishing products are used by millions and we want you to channel your creativity and push boundaries.Curious - Continuous development is central to our working culture, so we regularly encourage teams to pair up or mob on tasks. From our 10% a week learning time policy, to our learning and development platform, Degreed, with unlimited access to Udemy courses, as well as a host of other world-class content providers - there are many ways to develop your skills and career with us.The Economist Group values diversity. We are committed to equal opportunities and creating an inclusive environment for all our employees. We welcome applicants regardless of ethnic origin, national origin, gender, gender identity, race, colour, religious beliefs, disability, sexual orientation , age or marital status.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}