{"Job ID": "69875733", "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob Description· OSHA kriterlerine göre iş kazalarının, olayların ve vakaların tanımlanmasını sağlamak, tutanaklarını tutmak ve gerekli yerlere kaydını yapmak,· Revirde ilaç yazılan hastaların reçetelerini kayıt defterine kaydetmek,· Vizite kağıtlarını hazırlamak,· Gerektiğinde hastaneye sevk edilen kişilerin deftere kaydını yapmak,· Revire gelen hastaları ateş, nabız, tansiyonlarını ölçme, ilk müdahale ve tedavilerini yapmak,· İlaçların nasıl kullanılması gerektiği hakkında hastalara bilgi vermek,· Revirde uygulanması gereken ilaçların uygulanmasını yapmak ve deftere, yapılan uygulamaların, ilacın kaydını tutmak,· İş kazalarında İşyeri hekimi ile ilk müdahalede bulunmak gerekirse tek başına da Kesiklerde ilk müdahaleyi yapmak, kanamayı durdurmak ve yaranın enfekte olmasını önlemek,· Periyodik muayenelerin gerçekleştirilmesinde ve sağlık eğitimlerinin verilmesinde İşyeri Hekimi'ne yardımcı olmak,· İş kazalarının tutanağının tutulmasını ve bilgisayar, deftere kaydederek 1 kopyasının revirde saklanmasını sağlamak,· Hastane ve revirden hastalara verilmiş olan raporları bilgisayara ve deftere işlemek, iş başı kağıtlarını ilgili birime teslim etmek,· Yıllık çalışma cetvelini hazırlamak,· Engelli personellerin sağlık raporlarını dosyalamak,· Hamile çalışanların aylık gebe takipleri yapmak ve verileri dijital kayıt olarak ve döküman arşivinde muhafaza etmek,· Revirde kullanılan ilaçların son kullanma tarihi kontrollerini aylık olarak düzenli yapmak ve yapıldığını kayıt altına almak.Desirable requirements· Tercihen Sağlık MYO veya Sağlık Meslek Lisesi Hemşirelik bölümü mezunu,· Tercihen hastane veya işyeri hemşireliği deneyimi olan,· Tam zamanlı ve vardiya sistemi ile çalışabilecek,· İletişim becerileri kuvvetli ve takım çalışmasına yatkın,· MS Office programlarını kullanabilen.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}