{
    "Job ID": "69873111",
    "Description": ", PakistanJob Family Group:Worker Type:Posting Start Date:Business unit:Experience Level:Job Description:PURPOSE:To ensure the quality of products manufactured and distributed by Shell Lubricants in the Country of operations meets Shell, customer, and legislative requirements. Responsible for quality system robustness and production facility integrity. Owner of ISO/TS/OEMS related documentation, certification, and audit preparation; Implement E2E facility integrity program according to LQS/GQS, including jetty, tank, blending, filling, warehouse and logistic; Owner of packaging material testing and acceptance standard. To support different Shell businesses in Pakistan (Trading & Supply, Customer Ops) through the provision of laboratory-based testing of lubes & fuels – including, but not limited to the management of:The inspection, testing and approval/rejection of incoming, in-process and finished products (including packaging) at all defined stages to ensure zero customer incidents.\nTo work with Product Management, Regional Operational Quality Manager or Operational-ROQM; Quality Implementor- OQI the Product Quality Coordinator in the region to improve accuracy, efficiency, cost effectiveness and reliability of laboratory.\nTo satisfactorily resolve customer complaints arising from product quality issues and puts corrective action in place to prevent recurrence.\nTo promote and continuously foster a culture of quality compliance and improvement within the organization. Further coach and develop the laboratory-based staff.PRINCIPAL ACCOUNTABILITIES:1. HSSE: Follow Shell HSSE policy and plant relevant regulations; ensure all lab staffs operate according to requirements of global HSSE system; actively participate in company HSSE activities; report potential safety incidents and update HSSE Case regularly.2.Quality System, standard:Set plant quality management system/standard, drive implementation in line with company quality strategy. Leading the preparation for E2E OS/FA audit, also including Packaging / Labelling / Filling/ Warehouse / Logistics and follow up to close the audit findings. In charge of establish, implementation and improvement of company ISO9001/14001/45001 systems; ensure obtaining 3rd-party / authorized institutions review; ensure the effectiveness of certificate. OEM Audit: Assist Quality Manager on OEM audit of plant. Set the standard and drive continuous improvement: Set acceptance standard for packaging material; set quality control standard for filling, warehouse and logistic. Owner of quality related SOPs/WIs, support quality manager and plant management to set up visual management system.3.Quality Incident:Assist Quality Manager in organizing customer complaint investigation and carrying out relevant correction action to improve customer satisfaction. As part of Quality Team - Help resolve Internal and Supplier Related Quality Incidents, feedback to RAPM, OQI, Plant Management and regional E2E Quality Manager on the Root Cause Analysis and the resolution process for the QIs. Drive implementation of TRAQ (Quality Incident Tracking) into Packaging / Labelling / Filling/ Warehouse / Logistics area.4. 3P Quality Management  Support Quality manager on 3rd Party Toll Blender’s/ Filler for quality audits and Implementation of 3P Supplier Quality Manual; LQS & GQS requirements applicable for these 3P supplier.5. Laboratory ActivitiesTo ensure that all Lubes, fuels, and customers samples are accurately tested and reported within the stipulated time frame. Ensure that the company Quality System and standards are maintained and followed. Providing advice & support to the plant team member for a continuous and sustainable improvement in Quality and Operating practices, in line of Group Policies. Conduct investigative analytical testing on samples originating from customers.\n Understand and implement the principles of good laboratory practice.\nMaintain data for GSAP system as Quality Management Custodian for LOBP Operations. Provide analytical and technical advice to the LOBP on rework/ re-blend of off-spec lubricants and safe disposal of rejects in a cost-effective manner. Participate Shell Co-relation test program (LLCS/GQS, Lubricant Lab Co-relation Scheme). Audit blend formulations using GSAP /BVT/GPC system. Development and training of laboratory new staff regarding Quality matters. Maintains high standard in Quality Assurance system (ISO 9001:2015); 14001:2015; 45001:2018 within LOBP as plant focal. Timely update & resolved of Quality Incident into tracker for all Quality Incidents, including incident investigations where necessary. Participate and provide inputs for business performance review and conduct audits. Establish incoming Quality assurance process. Diverse team management experience. Lead Quality KPIs. Maintain Lab Capex and OPEX, continuously follow up with T&S for SLA compliance.6. Key ChallengesEngaging a wide range of stakeholders and influence them to deliver on the above accountability without formal authority. Managing root cause analysis of plant quality incidents, and ensuring the key learning is drawn. Reaching across the plant with a consistent message and focus on the multiple factors that influence customer quality from end-to-end. Knowledge of Ownership of Hardware and software associated with Packaging / Labelling / Filling / Warehouse / Logistics7. Job Knowledge, Skills & ExperienceA degree or in a scientific discipline, preferably in Chemistry or engineering (Chemical/Petroleum). Experience of quality management, preferably >5 years of quality management or QA work experience, able to independently establish and manage a quality improvement project, familiar with quality improvement tools. SAP & ISO 9001 Quality System experience and knowledge will be a plus. Good in communication and influencing. Ability of applying quality analysis toolsStrong sense of responsibility-Must Have* Master in Chemistry/Chemical with 5 year experience* Supply Chain Product Quality Management -Mastery* Value Chain Management & E2E Profitability –Skill* Supply Chain Integration & Optimization – Skill* Supply Chain Customer Service - Skill\n* Apply Technical Expertise to CVP – Skill* Managing Customer Experience - SkillGood to Have* Supply Chain Project Management – Knowledge* Supply Chain Contracts & Negotiation - Knowledge* Commercial & Economic Acumen - KnowledgeDISCLAIMER:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}