{
    "Job ID": "69874217",
    "Description": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting, and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting, and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.We are looking for a Senior UX Designer to help shape the future for how our clients serve their customers. You will work across every stage of the experience, from designing new features to prototyping high fidelity solutions. Our team is a close-knit collective of diverse thinkers and doers that pioneer solutions that have never been done, collaborate with our clients as partners, and design for future iteration and sustainability.The Publicis Sapient Experience Design Capability is the bridge between business strategy and technology — we create meaningful, holistic experiences for our clients and their customers. We are multiskilled thinkers, computational designers, environmental designers, researchers, and architects.Sounds like you?If you are committed to not only transforming the world with the products you create, but also being a valued citizen to our growing global team, you will be instrumental in shaping how we do it with your ideas, thoughts, and solutions. Apply now.Your ImpactChampion the discovery, research, and data synthesis to identify critical user insights and develop hypotheses to design effective experiences\nCommunicate with excellent aesthetic and an influential voice to shape and position ideas for customer impact\nPresent your own work\nPossess a thorough POV on craft, tools and process \nPropose optimizations and creative approaches to systems that can cultivate impact for users’ needs\nDevelop specification documentation that allows for implementation in software development\nFacilitate design workshops with stakeholders\nCollaborate with teams on the development of motion, content strategy, visual design, and content\nClarify and define success metrics for client and business impact\nDevelop relationships across a project team, specifically technical team members and software developers\nLead and manage small project tracks autonomouslyYour Skills & Experience Complex system mapping and process mapping \nAudits and competitive landscaping\nUser research and design for iterative testing\nWireframing functionality for features and content\nPrototyping skills with a familiarity of 2-3 tools, having advanced experience with at least 1 tool\nLow fidelity prototyping skills (i.e. InVision and XD)\nComponent-based design-development\nNavigation systems design\nCreating sitemaps\nInteraction design\nProcess and specifications documentation \nPresentation design\nApply advance understanding for composition, color, typography, iconography, texture, photographic curation, and usability to help users successfully navigate dynamic multimedia experiences\nDefine the visual direction of a project to shape and position ideas for customer impactSet Yourself Apart WithAffinity group or employee resource group participation history\nHeuristic evaluation and performance data analysis\nPrototyping with code— HTML, CSS, JavaScript, Python, React Native, etc.\nDemonstrated photo or video editing capabilities\nDesign for emerging experiences, i.e. natural language processing and augmented reality#LI-HybridJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}