{
    "Job ID": "69875750",
    "Description": "First Abu Dhabi Bank is an inclusive environment where each person values the experiences, perspectives, ideas and beliefs of others. We’re in a unique position to learn from all our colleagues, combining international experience with deep cultural knowledge and local expertise. At FAB, you’ll have the support of your team and a strong relationship with your line manager, who will trust you with responsibility and recognize your good performance. As we embrace different ways of seeing the world, listening to each other and respecting different viewpoints, we grow stronger – togetherJOB PURPOSEThe VP, Consumer Marketing - Elite is responsible for creating and executing consumer focused marketing plans across a portfolio of products within the Elite Target Segment, managing agency relationships and leading a team of creative marketers. The VP will have to inspire the team to work collaboratively across functions including creative, digital, and social, ops, research, analytics, activation and PR across all products. The role reports to the SVP Head of CBG Marketing.ACCOUNTABILITIES:Generic AccountabilityTranslate the vision for our products into consumer-focused marketing and communication plans.Increase our position in the market with customer 1st focus, NPS improvement and digitization.Steer and coach a team.Develop a strategic approach on several topics in our current reality, with a focus on consumer insight driven campaigns.Ability to deliver on executional excellence, managing projects on time and within budgetWhat to expect:FAB offers a challenging position within a dynamic and business-oriented environment.We are building an open, informal and personal marketing culture. Learning from one another is key. There is room for entrepreneurship and freedom to think and explore. Teamwork is essential. We offer attractive employment conditions and excellent training opportunities. Training for this role could include:Marketing Management\nDigital Marketing\nAdvertising\nAgency Management\nProject Management\nCreativity\nLeadership\nMarketing Planning and Execution\nRelationship Management\nProduct TrainingWhat we expect:We expect delivery against agreed objectives and will equip with the tools to do so. The objectives will be agreed with the line manager. The legacy you leave is up to you. The KPI’s include:Lead generation\nRevenue growth\nMarket share growth\nBrand health scores growth\nTeam development\nCreative content scores\nAnnual marketing plans\nMarketing mix management\nAgency managementQualifications and Experience:Bachelor's from a recognized university.\nSolid professional experience in Marketing with increasing levels of responsibility.\nExperience in a leadership role managing agencies and teams.\nMarketing background from FMCG/CPG business preferred. Lifestyle brand experience a plus.\nExperience of working with global, regional and local marketing teams. Experience in the region and ideally also developed markets.\nOutspoken creative ability and able to inspire others. Able to build and execute on creative ideas. Comfortable in understanding marketing strategies and plans. Effective at decision making. Drive for results. Able to adhere to clear marketing processes and influence other departments to align.\nDemonstrate a proactive, flexible and solution driven attitude and stress resilient.\nProven people skills and a strong leader can influence and convince people. Team player.\nGood communication and project management skills.\nDynamic personality, continually learn, innovative and consumer focused. Want the most out of career and life. Sense of humor and can bring a sense of fun, creativity and innovation to the workplace. Looking for out of the box thinkers.\nFluent in English and ideally Arabic also. Computer literate and technology passionate. Ability to travel between office locations for meetings and workshops.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}