{"Job ID": "69873050", "Description": "Req ID:429758 We create smart innovations to meet the mobility challenges of today and tomorrow. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses and driverless trains, as well as infrastructure, signalling and digital mobility solutions. Joining us means joining a truly global community of more than 38 900 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.PURPOSE OF THE JOBResponsible to deliver N&T Backbone Transmission Network (BTN) specifications and Design consistent with the System Delivery Plan\nContributor to support N&T Backbone Transmission Network (BTN) deployment activities (Installation, Test & Commissioning)What are my responsibilities?Elaborate N&T Backbone Transmission Network (BTN) Design specifications (Preliminary Design & Detailed Design) in line with N&T Engineering rules and relying on best practices inherited from previous projects (cross reviews with installation teams, cybersecurity teams, power experts…)\nEnsure that all N&T BTN Design elaboration follows Quality processes, including application of Adapt and Design N&T Processes, Methods and Guidelines . Promote the Alstom Code of Ethics and adhering to the highest standards of ethical conduct.\nEnsure that BTN Design documents remain in line with project DFQ Gate Reviews milestones and are elaborated as per project Documentation plan . Minimize, by Design, the N&T BTN deployment cost, lead time and risks\nDevelop and elicit BTN Design requirements in line with project needs (internal & external), with a specific focus on BTN dimensioning and Cybersecurity concerns. Check that external interfaces are consistent with N&T sub-system\nContribute to project addressing plan elaboration with Project System teams. Participate to the support of the functional validation phase of the sub-system Test platform for BTN part\nElaborate N&T BTN BoQ as a support to PrIDM, including Design elaboration of BTN cubicles and Prepare & Execute technical room (Switching Equipment’s Rooms) surveys\nPrepare and participate in Design Reviews and Manage technical issues identified on BTN part. Maintain close follow-up on technical gaps implementation (BTN related) and Open and follow technical Change Requests to Product Engineering teams in charge of N&T products and solutions\nParticipate upon request and guide Site Installation,T&C activities in order to validate E2E performance, including support to troubleshooting tasks\nProvide iteration of the Provide iteration of the BTN and Radio configuration files all along project life cycle till end of warranty period and installation studies specific to N&T sub-system for BTN part\nRemain in constant contact with Project N&T Design Leader all along the project life cycle regarding progress of BTN Design activities and Prepare and execute DCS BTN Training. Collect and consolidate Return of Experience (REX) to Product Engineering teams and to N&T Project Engineering teamsWhat do I need to qualify for this job? Educational Requirements Mandatory:B.Tech / B.E / B.Sc/ M.Tech/ M.E/ MEngg/Msc - degree in Engineering/Science with 7+ yrs of relavent experience  (P.G Diploma specialization can be consdifered if experience is relavent.) \nDesign/Engineering background with experience.Desirable:Certifications : CCNA,CCNP,CCIE or equavalent.ExperienceMandatory:Proven experience of LAN/WAN design elaboration\nArchitect, deisgn and deployment of Gigabit Ethernet and IP-MPLS solutions\nKnowledge of Network Security, Cyber concepts, \nProven experience & knowledgeable on monitoring tools, traffic analysis and general IP techniques (network monitoring systems, mib principles, IP traffic analyzer, E2E tests, robustness tests, etc)Desirable:Experience of fiber deployments\nExperience of troubleshooting and technical coordinationCompetencies & Skills  Strong knowledge of RFC protocols, IP routing, Addressign Plan, Network Design, QoS…\nBasic knowledge of Cybersecurity (NAC, 802.1x, Radius, Firewall,…)\nKnowledge of major telco suppliers : HP, Cisco, Hirschmann, Huawei, Nokia, Westermo\nExperience in wireless systems, Radio is an add-on.\nRailway Signaling and system architecture is an add-on.\nResilience and process oriented\nTeam player\nResult orientedAn agile, inclusive and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.   Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}