{
    "Job ID": "69873051",
    "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.We are looking for a Senior Planner for our Project & Development Services business line.About JLLWe’re JLL. We’re a professional services and investment management firm specializing in real estate. We’re committed to our purpose to shape the future of real estate for a better world. Our mission is to help organizations around the world achieve their ambitions by owning, occupying and investing in real estate.If you’re looking to step up your career, JLL is the perfect professional home. At JLL, you’ll have a chance to innovate with the world’s leading businesses, put that expertise into action on landmark projects, and work on game-changing real estate initiatives. You’ll also make long-lasting professional connections through sharing different perspectives, and you’ll be inspired by the best. We’re focused on opportunity and want to help you make the most of yours. Achieve your ambitions – join us at JLL!About Project and Development Services (PDS)\nJLL is a world class real estate development partner for our investor and corporate clients. Our services affect how millions of people live, work, and play every day. It is our responsibility to nurture the impact we can have on all projects and bring value into every detail. From development advisory to project and cost management, from program management to engineering design and sustainability, from fit-out to asset repositioning and major base-build schemes, our services span every dimension across all asset types, sectors and regions.JLL’s PDS team comprises 8,900 project managers, engineers, designers and architects across 50 countries and is actively managing 36,900+ projects yearly. Join the PDS team to expect more and achieve more. There’s room for you to design and build your career within the PDS community and the wider JLL ecosystem. Meet with Julien Walid Goudiard, Head of PDS EMEA at JLL.Role PurposeWe are looking for a Senior Planner responsible for day-to-day planning activities on a major project in Jeddah, Saudi Arabia.What this job involvesMaintaining the schedule baselines and ensure mechanisms are in place to monitor performance.\nWorking closely with the client, sub consultants and main contractors.\nReview overall project status with the Project Management team and recommend corrective action where necessary.\nUse a clear, systematic approach to solving complex issues and able to communicate solutions in an effective, efficient, high level manner.\nCoordinating and managing multiple stakeholders and demonstrate the ability to build relationships.\nEstablish project planning process and procedure to include within the PEP (Project Execution Plan).\nAssure integration of sub-schedules from all parties (functions, subdivisions) involved in the projects.\nTracks and reports progress against the baseline schedule and continuously monitors risks and opportunities as well as proactively develops scenarios, mitigation or back-up plans required.\nReport on schedule progress inclusive of contractual spend utilising reporting metrics including EV (earned value) and PV (planned value) and deviations within all functions and parties involved in the project.\nThe Project Planner produces schedule-related KPI's as required by the project.\nLead meetings related to the schedule and its associated process and procedure.\nManage, with the support of all Project Team members, the effective communication to all functions of their duties and responsibilities in the execution of the schedule.Sounds like you? To apply you need to be / have:P6 trained with strong skills utilising this software.\nDegree Qualification is preferred.\nProfessional Memberships are an advantage but not essential.\nExtensive experience in role of a planning manager in the construction industry.\nMajor international project experience is essential.\nMust have experience in buildings and mixed use projects.\nExcellent written and verbal skills with a fluent proficiency in English.What you can expect from usYou’ll join an entrepreneurial, inclusive culture. One where we succeed together – across the desk and around the globe. Where like-minded people work naturally together to achieve great things.Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay.Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you...Apply today at jll.com/careers.#LI-LS6Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}