{
    "Job ID": "69874372",
    "Description": "Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate.By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.We are currently seeking an experienced finance professional to join our Finance Shared Service Center in the capacity of Accountant - TxBOT.Overview of the roleThe Accountant - TxBOT will support the tax manager. This position is responsible for preparing the VAT Returns, Publishing the monthly / yearly tax calendar and tracking the tax compliance deliverables. In addition, the role will help ensure documentation retention is maintained for tax compliance purposes as well as supporting the co-ordination during Tax Audit.The successful candidate will work closely with the Brands, third party service providers, and other tax professionals in carrying out responsibilities.What you will doMonthly Tax Returns PreparationAssist in the monthly tax returns preparation for both VAT and WHT in all countries from data extract to submission to the governing bodies and liability settlementTax ComplianceDevelop a monthly calendar and tracker to ensure correct and timely filing of all Tax Returns based on country specific tax calendars and review complex income Tax ReturnsTax AccountingSupport the Tax Manager with the tax provision tracking and tax balances on general ledgerTax Document ManagementEnsure all documents are collected on a central database and handle requests for informationTax AuditsProvide coordination support during tax audits to the Tax ManagerAutomationSupport the Streamlining processes identified through automationOther Key ResponsibilitiesTo liaise with relevant managers and stakeholders to ensure full collaboration and understanding on critical topics.\nContribute to the improvement of the solutions and business processes.\nMaintains and upgrades professional knowledge, management skills and domain expertise by using continuous learning & development toolsRequired skills to be successfulAccounting skills\nProject management skills\nAbility to work on various on-going projects with good organizational and time management skills\nMicrosoft Office, particularly Excel\nAnalysis and troubleshootingWhat equips you for the roleTax, Finance Degree, Regional tax knowledge would be a plus\n2 years of GCC Tax Experience\n1-2 years in an international Finance environmentWe’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.For further information, and to apply, please visit our website via the “Apply” button below. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}