{
    "Job ID": "69874628",
    "Description": "Location-Dubai ,  ,United Arab Emirates (AE) Job ID -5784Job Responsibilities Execute import and export shipment end to end.\nAbility to handle both LCL and FCL shipments and hazardous.\nArranging for DO and B/L collection.\nHandle multiple shipments end to end at the same time.\nWell-motivated and capable to handle freight forwarding operations independently without supervision.\nTimely and accurate scheduling of hazardous and non-hazardous bookings.\nArranging Customs clearance and documentation.\nSubmit shipping instructions.\nMonitor suppliers’ invoices and performance.\nComplete job costing and billing.\nFollow company SOPs and achieve KPIsJob RequirementsBachelor’s degree in business or any other field\n3-4 years of relevant working experience in the Freight Forwarding and Logistics industry\nExperience in operations and broad knowledge of regulations.\nExcellent MS office skills: Word, Excel and Power Point\nGood commands in professional emails writing\nWell organized, able to handle stress, with experience in costing and operations. \nKnowledge of local and international requirements and regulations.\nAbility to handle multiple shipments at the same time.\nFollow the end to end shipment cycle and support in maintaining business.\nupdate shipment status.\nIMDG experience and Cargo Wise are plus.Company Overview:Since our founding in 1982 we have grown to become a world leader in comprehensive transport and delivery solutions for business and consumers. Headquartered in Dubai, at the heart of the world’s most dynamic commercial hub and on the site of historic trade routes linking east and west, commerce and transport are deeply embedded in Aramex’s DNA. We are dedicated to transforming the face of trade, expanding our operations rapidly to better connect businesses and consumers worldwide.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}