{"Job ID": "69874495", "Description": "Main Accountabilities: Engineering authority for projects/tenders with low to medium complexity.  Execution of complete engineering assignments on small, medium or large projects/tender  cost effectively and in accordance with contract specifications and quality standards. Based on technical specification from end customers and inputs from OU Engineering team, prepare Substation layouts and section drawings, Grounding system drawings, Lightning system design, drawings, Cable routings, Bill of materials, RFQs, vetting of vendor offers, engg hours estimation, visit to project sites, technical risk assessment and opportunity evaluation, technical risk assessment and opportunity evaluation etc Coordinate with Engineering Manager, Engineering Leads, Tendering team, Project managers, SCM, Secondary and civil / steel design functions, consultants, end customers etc. and provide required support in each Project / Tender. Activities Involved Able to perform the following activities : 1. Primary Engineering Deliverables. Experience in handling complete Engineering deliverables for AIS & GIS projects, Exposure to International experience & Standards IEC, IEEE & AS 2. Substation layouts and section drawings, Grounding system drawings, Lightning system design, drawings, Cable routings, Cable tray routings, Clearance drawings,etc 3. Understanding of auxiliary design aspects of substations, such as LVAC / LVDC supplies, Cable sizing, Battery & Battery Charger Sizing,  etc 4. Technical data sheets verification of primary equipment. Knowledge of primary equipment, such as circuit breakers, disconnectors, earthing switches, instrument transformers, power transformers, etc 5. Vendor Offer Evaulations.  FAT / SAT of primary equipment, system as and when needed. 6. Technical risk and opportunity assessment and validation 7  Innovative ideas to reduce Engineering effort 8. Plan, implement, review and continuously improvise quality system & follow Opex initiatives Qualification & Experience: Bachelors Engineering /Diploma in Electrical 7-10 years exp Specific Knowledge & Skillsets: Proficiency in required CAD design tools (BIM Tools, BIM 360, Navisworks, Microstation / AutoCAD, AutoCAD REVIT, 3D competence) Knowledge of relevant International standards ex. IEEE, IEC,etc Knowledge in substation tendering and project engineering activities (technical & commercial) Soft skills: Individual contributor using in-depth knowledge in a specific area to execute complex or specialized projects / challenges often thinking independently to challenge traditional solutions. Comprehensive knowledge of related disciplines in the organization. Works independently, applying established standards Excellent English speaker, good communication skills Dynamic and Proactive, willing to grow in the organization Team player, ready to play the role across the different countries. High level of ownershipJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}