{"Job ID": "69874239", "Description": "When you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon’s best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400+ billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon India is now Great Place to Work-Certified™. Epsilon has also been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com/apac or our LinkedIn page.About the BUOur Automotive Practice is a fast-growing unit in Epsilon and we are on the lookout for talented individuals who always raise the bar by constantly challenging themselves and are experts in building customized solutions in the digital marketing space.\nSo, are you someone who wants to work with cutting-edge technology and deliver positive business results for global clients by addressing the changing demands of the automotive market? Then you could be exactly who we are looking for.Job DescriptionWe are currently looking for a Director Software Engineering (MS Stack) to join our Bangalore Centre to provide the technical expertise to take on major projects and also manage a team of engineers, leads etc. You not only optimize your own work but make sure engineers are able to optimize theirs. As a Director Software Engineering, you manage your project goals, contribute to product strategy and help develop your team.The position’s purpose includes, but is not limited to:Manage a team of Developers and provide technical direction and manage project timelines, cost and quality\nEfficiently and effectively collaborate with technical and non-technical internal team members as well as third party client stakeholders.\nAs needed, gather requirements and analyze, understand and translate those requirements into technical specifications.\nParticipate in design reviews and provide input to design recommendations where necessary.\nParticipate in code reviews and acceptance process in order to improve methodology and delivery. Setting goals, performance reviews, coaching, training needs, hiring.What you’ll doProvide technical leadership and people leadership to the team\nSupports initiatives of Epsilon Auto related to engineering excellence, employee development, customer engagement etc.\nPerform from leadership role for engineering\nAdvising and mentoring staff members to meet schedules or resolve technical or operational challenges.\nLeading product teams working on high data volume applications\nLead projects consisting of different teams to deliver engineering solutions from Technical and Project Management aspects\nResponsible for mapping business objectives to an optimum engineering structure, including correct estimation of resource allocation.\nResponsible for key technical and product decisions. Provide direction and mentorship to the team. Setup best practices for engineering.\nWork closely with the Product Manager and help them in getting relevant inputs from the engineering team.\nPlan and track the development and release schedules, proactively assess and mitigate risks. Prepare for contingencies and provide visible leadership in crisis.\nWork closely with engineers, conduct their 1:1s, understand their requirements and facilitate an environment where each engineer is happy and productive.\nWork individually with engineers and help them with correct time estimation and scoping of tasks.\nUnderstand the strengths and weaknesses of various engineers, and then map projects to career paths of various engineers.\nConduct regular 1:1s for performance feedback and lead their appraisals.\nResponsible for driving good coding practices in the team like good quality code, documentation, timely bug fixing etc.\nBe responsible for product metrics and drive them in the team.\nInteract with other engineering teams, facilitate discussion among them and provide a framework for inter-team collaboration.\nBuild teams, hire the best talent with right dynamics. Foster a result oriented, performance driven culture by setting clear goals, career paths, core competencies, reward and recognition mechanism for the engineering team.\nCreate and maintain an open and transparent environment that values speed and innovation, motivate engineers to build innovative and effective systems rapidly.What you’ll need\n Education: BE/B.Tech\nExperience between 13-16 years in software development\nMust have worked with globally distributed teams.\nMust have strong experience of +3 years in people management (i.e., performance reviews, goal setting, coaching), with +1 years as a “manager of managers” while leading a group of +20 engineers.\nExceptional engineering & design focused business judgment.Must be able to discuss technical aspects of architecture /design / code issues directly with technical teams.\nStrong experience in building products using Angular, NodeJS, Javascript, Oracle, Web/UI technologies (HTML, CSS, Bootstrap), WebAPI, C#.\nStrong experience of working with REST API and Microservice architectures and integration with external vendors/3rd party apps.\nExperience in following tools: Visual Studio, Jenkins, PostGre, Swagger API, Confluence, Azure Devops.\nSolid knowledge of web architectural and design patterns\nMust be an expert in Agile methodologies\nAccomplish results through direct reports, colleagues in other parts of Epsilon, and partners, even when they are not direct reports.\nAbility to work well with virtual teams across multiple time-zones.\nMust be flexible, with a high tolerance for organizational complexity and ability to work with partners from within Epsilon and outside.\nStrategic thinking and execution – must be able to effectively communicate with Technology organizations, identify capability to perform current and projected engineering work statement, conduct evaluations and assessments regarding their ability to perform these activities.\nFluent and excellent written and verbal communication skills, ability to prepare comprehensive reports, proposals, Statements of Work.\nCandidate must be a self-starter with a positive attitude, high ethics, and a track record of working successfully under pressure in a time-constrained environment.\nMust be able to mentor team members and partners to accomplish project and departmental goals and objectives.\nMust be have experience in planning, analyzing requirements, designing solutions and developing code\nThe ability to display strong problem solving skills and perform under pressure is required.Preferred qualificationsPrior hands-on experience with enterprise class application/web development as developer or manager strongly preferred.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}