{
    "Job ID": "69872696",
    "Description": "SO/ is a coveted collection of hotels, rooted in the world of fashion. Making its stylish debut on the global hotel scene in 2011, SO/ continues to command attention with its avant-garde design and creative approach to the world of luxury.First impressions are everything. When guests arrive at our hotels, we want that impression to be memorable. The same goes for departures. When guests leave, we want them to go with a smile and a feeling that we were there for them throughout their stay. We want to build an experience that is memorable and unique from start to finish.As a Guest Service Agent, you will:Process all guest check-ins by confirming reservations, assigning room, and issuing and activating room key.\nProcess all payment types such as room charges, cash, checks, debit, or credit. Process all check-outs including resolving any late and disputed charges.\nAnswer, record, and process all guest calls, messages, requests, questions, or concerns.\nCoordinate with Housekeeping to track readiness of rooms for check-in. Communicate parking procedures to guests/visitors and dispatch bell staff or valet staff as needed. Supply guests with directions and information regarding property and local areas of interest.\nRun daily reports (number of arrivals, departures), identify any special requests, and check reports for accuracy.\nComplete designated cashier and closing reports in the computer system. Cash guests' personal checks and traveller’s checks.\nCount bank at the beginning and end of shift. Balance and drop receipts according to accounting specificationsAt SO/ Uptown Dubai we do more than just deliver a service. We endeavour to think big, go beyond expectation to make a positive impact that creates an unforgettable experience for our guests and our teams. We’re all expected to show initiative, empowerment and willingness to provide a wide range of services that guide guests throughout their stay at SO/. Whether it is to address guests’ enquiries, preparing reports, operations or just sharing with a guest what is hot in Uptown, from a guest’s perspective every exchange should feel seamless and effortless.At all levels and positions within our organization, our success is incumbent on a set of behaviours each of us are committed to. These include adhering to company policies and procedures, maintaining confidentiality, protecting company assets, and upholding quality standards. Because we’re an avant-garde and stylish brand, we’re also passionate about maintaining a professional uniform, personal appearance, and bespoke communications. There is no room for ego: come as you are, humble and kind. At SO/ we work hard, but make it fun.You will constantly be on the move, walking about and being hands-on. You might even need to lift, carry, push, pull, and place objects weighing less than 10 pounds without assistance. Most of all, our aim is to do things right, not just the first time but every single time to the benefit of our guests, our hotel and each other because we’re all in it together!A successful Guest Service Agent:Has some experience / understanding of Luxury-Lifestyle\nHas great conversational skills and teamwork-oriented\nHas a Positive outlook and outgoing personality\nEnjoys elevating the status quo and finding new ways to create memorable experiences\nOasys / Opera and other hotel operations systems is a plusEnnismore brings together talented teams, from unique brands, to create a culture that is entrepreneurial and purpose-driven in everything we do. We’re the fastest-growing lifestyle hospitality company, and we’re not slowing down. We’re expanding into new countries and cities, creating exciting opportunities.Inspiring DiscoveryOur purpose is to Inspire Discovery for our guests, but we also look to inspire our teams. We inspire our teams to discover their best self through learning opportunities, to grow and to be inspired to make a positive impact on local communities.Inclusive CultureOur culture is purpose-driven, dynamic and inclusive which puts our community at the heart of everything we do. We’re open minded, we celebrate difference, welcome diversity of thought and accept people for who they are, allowing them to bring their whole self to work.Global PerksBeing part of the Ennismore family comes with some incredible perks, including everyone’s favourite, our global discounts programme with up to 50% off stays at our hotels and up to 30% off when eating at our restaurants and bars.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}