{"Job ID": "69873605", "Description": "About this jobOur NielsenIQ Technology teams are working on our new “Discover” platform, a unified, global, open data ecosystem powered by Microsoft Azure. Our clients around the world rely on NielsenIQ’s data and insights to innovate and grow. As a Senior Software Engineer, you’ll be part of a team of smart, highly skilled technologists who are passionate about learning and prototyping cutting-edge technologies. Right now our platform is based in Angular, JAVA, Spring Boot, Mongo, Postgres and Snowflake, and we continue to adopt the best of breed in cloud-native, low-latency technologies. We value CI/CD in everything that we develop. Our team is co-located and agile, with central technology hubs in Chicago, Madrid, Toronto, Pune and Chennai.  ResponsibilitiesDesign and develop quality frontend applications \nWrite complex, clean and maintainable code to develop scalable user-friendly Front-end applications \nDevelop reusable UI components that can serve the needs of multiple applications \nEnsure the maintainability and quality of code \nIntegrate code into modern, automated testing and CI/CD pipelines \nHandle configuration management and deployment tasks as needed 5 and above years of relevant software engineering experience \nStrong fundamentals in the software development life cycle (SDLC) process including proficiency in UI/Web front-end frameworks, Angular, JavaScript, CSS, HTML, Jasmine and Karma  \nFamiliarity integrating Restful APIs and an understanding of microservices architecture \nSome experience with frontend design and solution architecture \nExcellent English communication skills, with the ability to effectively interface across cross-functional technology teams and the business  \nSound SDLC skills, preferably with experience in an agile environment \nMinimum B.S. degree in Computer Science, Computer Engineering or related field About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}