{"Job ID": "69872806", "Description": "JOB DESCRIPTION:This position typically refers to any employee within the EPD Medical organization with medical/scientific qualifications and training who provides scientific/medical support to EPD in a non-sales capacity, where the provision of such scientific/medical support includes significant contact with Abbott customers in the field. This definition is not intended to apply to those employees whose primary job function relates to the monitoring or management of clinical studies.\nReporting into the Senior Manager RMA / Head RMA this position participates in the initiation, oversight and follow-up of assigned clinical studies and medical projects initiated within the EPD Medical Organization, ensuring that activities are carried out in accordance with relevant processes and procedures. The RMA interfaces with other key members of the EPD Medical Organization - for example, Medical Managers, Clinical Research Managers and Medical Advisors - relevant to the therapeutic area for which the RMA has responsibility. The RMA assists relationships and advances the scientific credibility of the Company with established and emerging Regional/National Opinion leaders, responds to requests for scientific and medical information, and provides key scientific information updates to Regional and National Opinion leaders, as appropriate. The RMA develops, and maintains, key scientific knowledge that will enable credible dissemination of scientific information and informed scientific dialogue with physicians and opinion leaders, and the development of professional working relationships.\nJOB RESPONSIBILITIES:\n• Ensure that all activities and interactions are conducted with due regard to all applicable local, global and national laws, regulations, guidelines, codes of conduct, Company policies and accepted standards of best practice.\n• Provide scientific and technical support for, and help maintain professional and credible relationships with, key opinion leaders and academic centers to ensure access to current medical and scientific information on the products and areas of therapeutic interest.\n• Ideate, design, develop and deliver innovative and engaging high science activities for Physicians and Key Opinion Leaders, to help drive Therapy Shaping in the area the RMA is assigned to, in collaboration with the Medical Affairs & the Commercial team.\n• Assist in the initiation, oversight and follow up of assigned clinical studies and medical projects initiated within the relevant therapeutic area for which the RMA carries responsibility (e.g. post marketing clinical activities such as registry/database projects, epidemiological surveys, post-authorization studies (phase IV), IIS projects, etc.): all activities to comply with applicable local laws, guidelines, codes of practice, SOPs, and , I& D * SOPs.\n• Deliver high science, unbiased and accurate scientific presentations to physicians, individually or in groups (meetings, clinical sessions, etc.), when requested.\n• Participate in the selection process to identify appropriately qualified physicians the Company would wish to engage in collaborative efforts – such as potential research collaborations, or lecture/meeting support (Round Tables, Congresses, Symposia, etc.); and to ensure a high level of scientific or educational integrity in these collaborative efforts.TECHNICAL COMPETENCIES:• Therapeutic Area Expertise\n• Management Skills\n• Communication Skills\n• Compliance & Process Improvement Skills\n• Problem/Conflict Solving Ability\n• Priority Setting\n• Relationship BuildingKEY INTERFACES:• EPD medical personnel: Clinical Research Managers, Clinical Operations Managers, Medical Advisors; Medical Information team / specialists; EPD Pharmacovigilance / drug safety personnel\n• Marketing department across therapeutic area\n• Sales organization of the geographic area of responsibility.\n• Administrative personnel of the Medical Department and of the Business Unit.\n• Healthcare personnel (including; physicians, nurses, pharmacists).\n• Patients (through Patient Awareness Programs)\n• Participating Research Investigators\n• Key Opinion leaders\n• Institutions and Scientific or Medical SocietiesThe base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}