{
    "Job ID": "69874218",
    "Description": "Position Title: Fraud Data Analyst II\nDepartment: Customer Operations\nLocation: KarachiWe’re looking for a highly-driven and motivated “Fraud Data Analyst” for our team in Pakistan. If you are\nlooking for a place where you can gain hands-on exposure and have a direct impact, then this may be the\nplace for you!The ideal candidate will have a track record as a significant individual contributor – comfortable working\nindependently, whilst working closely with the management team. This role will be based in Pakistan and\nwill report to the “ Senior Manager – Risk &amp; Fraud”.Responsibilities:\n● As one of the brains behind our customers’ operations, you will be responsible for the\nperformance analysis, optimization and process design of fraud detection systems and\nframeworks\n● You will lead towards designing in best-in-class service functions to address customer\nsegmentation based on fraudulent refund and cashloss\n● You’ll be in a highly data-driven role working on risk analysis, and recommending changes in\nfraud thresholds with a key focus on outer loop initiatives to improve user experience\n● You’ll be adept at managing stakeholders, be it the city or functional managers or vendors to\ninfluence business goals with the ultimate purpose to reduce fraud\n● You’ll be required to be deeply involved with our Shared Service Centre in Malaysia to\ncollaborate, understand and implement our regional and global best practicesRequirements:\n● Bachelor's degree program in STEM from a reputable institution, Masters is a plus\n● Several years of experience in analytical roles involving risk or cost optimization related\nstrategy. Analytical mindset is a must. Exact role can vary depending on experience.\n● Expertise in SQL and Python knowledge is a must,Git / DBT is a plus\n● You are comfortable using business intelligence tools (e.g. Tableau, Google Data Studio)\n● You are proficient in segmentation, outlier detection and correlation via Excel, g-sheet or\nother tools\n● Highly organized and self-disciplined, able to work on multiple projects in a self-structured\nand well-prioritized way\n● Data-driven &amp; with a keen eye on process improvement\n● Effective communication and interpersonal skills with a problem-solving attitude is the\ncornerstone of your personality\n● You must be adept at G-SuiteA little About Us:\nWe are fast, like mind boggling fast! So if you’re someone who loves ever changing goals and\nloves optimization, you’re the right fit for us!\nWe love people who can develop things from scratch, own them and then work on improving\nthem.\nWe love what we do, and we don’t rest until we’ve achieved our targets. So if you’re also\nsomeone who is driven until the dream is achieved, come join us!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}