{
    "Job ID": "69872944",
    "Description": "What you’ll do\nThe Project Coordinator supports in the provision of project/programme management advice, administration and services within the function to enable the successful delivery of projects. They help support the team to identify, manage, and mitigate individual projects, programmes or cross-programme risks and issues in order to facilitate the on-time and on-budget delivery of capabilities and features aligned to the business outcome vision. The Project Coordinator conveys a good understanding of established concepts and procedures in the project management function and supports colleagues to deliver the whole of the proposed change, through effective co-ordination of the programme or project administrative tasks, and updating stakeholders on pending or outstanding actions. Typically reports to The Project Manager.\n\nWho you are* Follows processes to deliver tasks that support the delivery of the programme/project;* Demonstrates a good understanding of established project management office administrative activities and processes;* Supports the team to deliver activities related to programmes/projects through active involvement in specific initiatives to ensure they meet time, cost and quality requirements, comply with project standards and maximise benefit delivery;* Delivers assigned tasks related to overall integrity and coherence of the programme/project milestones;* Formally records updates and maintains systems accurately and in accordance with process;* Uses communication skills to exchange ideas and information in a concise and logical way to support coordinating project stakeholders;* Performs tasks to define release readiness requirements against business outcome needs and records readiness before release into production;* Performs other job-related duties or tasks defined by the supervisor or resulting from assigned agendas.Not a perfect fit?Worried that you don’t meet all the desired criteria exactly? At Vodafone we are passionate about Inclusion for All and creating a workplace where everyone can thrive, whatever their personal or professional background. If you’re excited about this role but your experience doesn’t align exactly with every part of the job description, we encourage you to apply as you may be the right candidate for this role or another role, and our recruitment team can help you see how your skills fit in.What's in it for youTogether we canJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}