{
    "Job ID": "69873328",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. About the team We are Advanced Commercial Banking System (ACBS) Project Management Group and provide Project/Delivery Management Services to our Clients Globally across APAC, Europe, Middle East, Africa, and North America.What you will be doing This position is for Senior Project Manager – Technology. You will be responsible for managing client deliveries globally, work with clients to document requirements, design, develop, and deliver client customizations. You will be providing client support across multiple time zones and assisting clients during ACBS installations in UAT/Production environments over the weekends.What you Bring4 to 6 years in Design and develop reports, dashboards, and interactive visualizations using BI tools such as Power BI. Ensure that these outputs effectively communicate relevant information to end-users.\nWork closely with data architects and database administrators to design and maintain the BI data model. Identify and define the necessary data elements and relationships to support reporting and analysis requirements.\nValidate data accuracy, completeness, and integrity to ensure the reliability of reports and analytics. Perform testing and quality assurance activities to identify and resolve any data issues.\nIdentify opportunities to streamline and optimize existing business processes through data-driven insights. Collaborate with stakeholders to define and implement improvements based on analysis findings.\nAct as a liaison between business users, IT teams, and other stakeholders to facilitate effective communication and collaboration. Understand and address stakeholder concerns, priorities, and expectations\nCollaborated closely with the onshore team, Project Managers, and PS Leads to gain a comprehensive understanding of their metrics and reporting requirements\nExplored new technologies and methodologies to automate reports and processes, utilizing low code and Automation tools like PowerApps, PowerAutomate, etc.Key SkillsData Analytics\nPower BI\nBusiness Insights\nMS Access/SQL                                                                  \nPower Automate Desktop                                             \nPlanview / JIRA / Agile\nMS Excel                                                                              \nMicrosoft Share Point\nMS Power Point / ProjectWhat we offer you \n\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\n\nA broad range of professional education and personal development possibilities – FIS is your final career step!\n\nA competitive salary and benefits\n\nA variety of career development tools, resources and opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}