{
    "Job ID": "69875835",
    "Description": "About the role:The role offers:The role offers an opportunity to work on ServiceNow implementation projects and gain experience in developing and customizing ITSM solutions.\nIt provides exposure to various ServiceNow modules, integration techniques, and best practices.\nThe developer will have the chance to collaborate with a team of professionals and contribute to the successful delivery of ServiceNow solutions that improve IT service delivery and enhance the overall user experience.Responsibilities:Implement ITSM solutions using ServiceNow platform based on industry best practices.\nDevelop and customize ServiceNow applications, workflows, forms, and UI components.\nScripting and configuration of ServiceNow modules, including Business Rules, Script Includes, Fix Scripts, UI Actions, UI Policies, Client Scripts, and Email Inbound actions.\nDesign and create Service Portals and widgets to enhance user experience.\nIntegrate ServiceNow with other systems using REST and SOAP APIs, and create scripted REST and SOAP APIs as needed.\nManage authentication via AUTH 2.0, certificates, and Mid Server.\nWork with domain-separated instances of ServiceNow.\nInstall and manage MID Servers for data integration and management.\nDevelop custom applications on the ServiceNow platform.\nImplement LDAP/Active Directory/SSO integration.\nSupport Orchestration use case implementations.Essential Skills:Strong hands-on development experience with ServiceNow scripting and customization.\nProficiency in ServiceNow modules and components.\nExperience with REST and SOAP integrations and API creation.\nKnowledge of authentication mechanisms and Mid Server management.\nFamiliarity with custom application development on the ServiceNow platform.\nUnderstanding of LDAP/Active Directory/SSO implementation.\nExperience with Orchestration use cases.Essential Qualifications:Minimum of 4 years of experience with ServiceNow.\nMinimum of 4 years of experience in the IT industry.\nCertification as a ServiceNow System Administrator.\nCertification as a ServiceNow Certified Application Developer.\nITIL Foundations certification is preferred.\nBachelor’s degree or equivalent combination of education and experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}