{
    "Job ID": "69875804",
    "Description": "Position OverviewThe Software Engineer role is an individual contributor role in the software product development organization who is able to understand requirements very well & bridge the gaps, design, implement and test end to end solution. You are responsible forEnd to end feature development including design, coding, automation testing.\nUnderstand customer’s business need and actively participate in designing the products. \nEnsures timely delivery and excellent quality of the deliverables for the product.\nWorking on low latency high performance systems\nActs as subject matter expert for the domain, processes, methodology and able to adapt latest technologies, frameworks and tools quickly.\nDebugging and troubleshooting product technical issues \nPeer review of code, unit test, use cases. \nAble to work in agile software development environment. Qualifications2 to 5 years of hands-on experience on Java, J2EE, Spring, Web Services (REST JSON, SOAP)\nFulltime Bachelor and/or master's degree in engineering with a minimum of 60% grade\nHighly skilled on building payment applications, online transaction processing and transaction switching \nMust have worked with Network Schemes certification like Visa, Mastercard, Amex\nWorked with Visa/Mastercard Scheme simulators (MDS/VTS/Paragon/FinSim/T3)\nVery good understanding on ISO8583 messages and Visa/Mastercard/Amex specifications\nUnderstand very well card products like Credit/Debit/Prapaid and EMV & Tokenization\nThe ability to work in teams, global environment, partner effectively with cross-functional teams, and manage multiple deliverables concurrently.\nDemonstrated ability and experience in the entire product development cycle: from design, implementation, test and debugging, to deployment and maintenance.\nStrong problem-solving skills and the ability to think outside the box.Preferred QualificationsExperience in delivering scalable and high-performance services and applications with excellent quality. \nStrong skills in Core Java, J2EE, Spring, EJB 3.x, Web Services (REST JSON, SOAP)\nDeep experience in Micro-services design and implementation\nDeep experience in developing platform/server-side components/APIs\nWell versed with design patterns\nDeep experience working with Payment acquiring and issuing for ATM/POS/EFT/e-commerce.\nExposure around switching products like ACI Base24, Postilion  \nExposure on Instant payments, ISO20022 and PSD2 would be additional benefits.\nExperience in using Gradle/Maven build framework.\nExposure to XML/XSLT, JSON, Groovy scripts \nExperience with Junit, system integration framework and JMeter/SOAPUI\nShould be able to create design documents, Class Diagrams, Sequence Diagrams and Flow Diagrams\nUnderstanding of web technology stack JSF, JQuery, JavaScript, HTML5/CSS3\nWorked with application server (JBOSS/ WebSphere/Liberty) on Linux/Unix/Windows platforms.\nExperience working with databases (i.e. Oracle/Postgres SQL/DB2)\nFamiliar on using Code Coverage and Static analysis tools (i.e. SonarQube/Jacoco)\nExcellent communication and interfacing skills\nUnderstanding of security protocols, encryption/decryption technologies, HSM, certificates (Nice to have)\nUnderstanding of Docker, Kubernetes and exposure to cloud Azure/AWS (Nice to have)Why should you join Diebold Nixdorf?Brightest minds + technology and innovation + business transformation The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.** To all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our job's alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not.Why should you join Diebold Nixdorf?Brightest minds + technology and innovation + business transformation  The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.** To all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our jobs alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not responsible for any fees related to unsolicited resumes**We are a global Company operating in multiple Locations and Entities. As we are keen to find the best solution for our candidates several legal entities might be applicable for a Job offer. A List of our operating entities can be found here - https://www.dieboldnixdorf.com/en-us/about-us/global-locationsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}