{"Job ID": "69872878", "Description": "The Red Hat Telco Consulting team is looking for an Cloud Consultant to join us in Saudi Arabia. In this role, you will guide the on-site delivery and implementation of modern Red Hat technology. You will focus on delivering quality work resulting in a positive customer experience, while building broad and deep technical expertise in Red Hat cloud technologies. As an Cloud Consultant, you'll gain an understanding of our customers' infrastructure with a particular focus on Red Hat Openschift Container Platform and other Red Hat cloud technologies and business needs and make recommendations appropriate to their environment.The candidate must be allocated in Saudi Arabia and Saudi Nationality is mandatory. The previous experience in telco sector is a big plus.Serve as the subject matter expert at the customer site, addressing technical, developmental, or strategic IT needs\nConstantly learn about new technologies and apply those concepts to customers’ needs\nProduce quality results and provide support to more than one project in multiple industries and various types of projects Keep stakeholders updated on actual or potential issues that may affect project or company performance\nManage problem identification, system architecture definition, and software specification, as well as the design, testing, and deployment of open source solutions Provide written project documentation that can be distributed within Red Hat and the customer’s management team\nAdapt to changing customer requirementsExperience in a consulting or a related role\nExperience with enterprise-wide deployments, networking, virt, Linux, storage background s critical\nAdvanced knowledge of Red Hat Enterprise Linux (RHEL) and Red Hat cloud solutions like Red Hat OpenShift and Red Hat Openstack Platform\nAny experience with telco industry and customers is a big plus\nDemonstrated experience communicating value, progress, and metrics of key projects to required stakeholders and diverse audiences\nExcellent written and verbal communication skills\nExceptional analytical, problem-solving, project management, and planning skills Red Hat Certified Engineer (RHCE) or willingness to pursue certification within 90 days\nWillingness to travel up to 100%\nSaudi Nationals is mandatory#LI-JK2Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}