{
    "Job ID": "69870002",
    "Description": "Designing and Automating Performance and reliability KPI's needed for the product executionExperience with test methodologies, writing test plans, creating test cases, test scenario in jira.Performance testing experience with relevant automation and monitoring toolsAbility to create reusable performance test scriptsStrong problem solving and analytical skills demonstrated by the ability to assimilate new information, understand complex topics and arrive at sound analysis and judgmentAutomation of test case development, review, execution, reporting, and traceability.\nExpertise in development, testing, and debugging in Visual Studio.\nExperience with performance testing framework development is preferred\nProgramming skills in Python and C#.Experience in Performance Testing (JMeter, Python , C#) + Manual Testing  (Healthcare  PACS, DICOM and HL7)Work Experience with Jmeter, Python Frameworks , ReadyAPI, BDD  \nGood Exposure to CI / CD processes, GIT for code repository.Experience with test methodologies, writing test plans, creating test cases, test scenario in jira.\nAutomation of test case development, review, execution, reporting, and traceability.\nExpertise in development, testing, and debugging in Visual Studio.\nExperience with automation framework development is preferred\nWork Experience with Visual Studio and JMeter\nGood Experience with windows performance.Performance Experience in Jmeter and python programmingExperience with test methodologies, writing test plans, creating test cases, test scenario in jira.\nAutomation of test case development, review, execution, reporting, and traceability.About Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.#LI-PHILIN\n#LI-Onsite\n#LI-EU\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}