{
    "Job ID": "69873392",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! What you'll do:In your role as a Developer, you will be helping our customers on Development Support level and delivering world class continuous innovations in Focused Build, Focused Insights and Solution Manager.You will be responsible for continuous innovation and support, analysing complex software issues, ensuring excellent quality, and maintaining high standards in message processing, customer notes, software corrections and software enhancements.  In addition, you will contribute to continuous improvement of software quality; design and implement improvements of software architecture and applications.In your day-to-day, you will:You will be working on development support and delivery of world class continuous innovations\nWork on overall incident backlogs for the owned topics and ensuring to keep this at an optimal level. Ensure high quality of corrections and notes for the owned topic areas and of stable assist packages with no regressions.\nSupport our customers during product deployment and critical operations via standard infrastructure, creating maintenance notes and documentation\nWork closely with the team (product owner, designers, architects, and other developers) and customers to holistically understand business and user requirements, and deliver solutions with good quality following the agile methodology\nGet involved in creating, implementing & testing of solutions in an agile environment with openness for new technologies.\nBuild advanced technical knowledge and share expertise within and across teams\nLead best practice and mentor team members for clean and effective code\nHave a logical approach to problem-solving, respond to detailed queries\nBuild expertise in SAP Solution Manager and help our customers to seamlessly run their systems in the landscape and to manage applications by their ownWhat you bring:6+ years of work experience\nB.E/B.Tech/ME/M.Tech, MCA\nStrong programming skills in ABAP, ABAP Webdynpro, SAPUI5, Fiori\nStrong collaboration and communication skills needed to ensure high customer satisfaction and work in cross-cultural teams and across geographies\nVery good analytical skills and debugging skills with an ability to handle complexity\nExperience in performance and security related topics and test-driven developments a plus point\nExhibit learning agility by quickly upskilling on new tasks and conceptsMeet your team:CIS (Continuous Innovation Services), IndiaAs the market leader of ERP software, SAP provides a complete portfolio of maintenance offerings and a comprehensive range of services that enable customers to continually improve core business processes while leveraging their existing solutions. The SAP Solution Manager is a service and support platform, which is designed to assist customers to implement and operate their IT solutions efficiently to increase the reliability and lower the cost of ownership.Today, SAP Solution Manager is the premier platform for SAP’s on-premise customer installed base and partners, where we deliver continuous innovations. For our customers there is no doubt that it is the SAP solution management platform for SAP centric solutions, especially during the transition phase to digital business. It will be the base of our hybrid solutions according to our company strategy.Focused Build for SAP Solution Manager is a ready-to-run and integrated, tool-supported methodology to manage requirements and software development in large, agile projects. It is based on pre-configured standard SAP Solution Manager features and processes, as well as additional build functions.Focused Insights for SAP Solution Manager unifies, aggregates and correlates all SAP Solution Manager’s metrics in single comprehensive views. It offers standard dashboards supporting all SAP ALM scenarios for RunSAP and BuildSAP.Continuous Innovation Services is responsible for the innovation and stabilization of the SAP Solution Manager. As a team we ensure that our large customer base receives continuous innovation and maintenance for SAP Solution Manager throughout their mature lifecycle. With that we safeguard the customer’s investments and strive to retain our customers for life. Delight customers. Always.#DevT2We build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 369447  | Work Area: Software-Design and Development  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}