{
    "Job ID": "69873339",
    "Description": "Responsibilities:Define, architect, and carry out the organizational and infrastructure plan required to carry out the company’s e-commerce and technology strategies.\nDefine and architect the strategic product (e-commerce website and mobile applications) including product vision, product innovation, product design, UI/UX and efficiently manage the entire process of product development.\nEnsure technical resources are available to meet the company’s short and long-term needs including internal and external technical manpower.\nEvaluate, appoint and manage external vendors for product development and enhancement as per business requirements and create and implement timelines for the development and deployment of all technological services.\nRecruit, train, manage and scale talented technology team dedicated to developing innovative solutions that are in line with the company’s business model, values, and vision and act as a mentor and coach to them.\nMonitor management of all hardware, software, databases, and licenses, as well as maintenance and future need projections.\nManage technology budgets and time frames.\nUnderstand automotive market dynamics and convert them into innovation roadmaps keeping the business on top of technology trends and developments.\nSupervise all technology-related functions, such as software design and development, enterprise architecture, quality assurance, production operations and technical support.\nOversee the information security, disaster recovery, and business continuity operations of the organization and ensure all technology practices adhere to the regulatory standards in KSA.\nCollaborate with internal functional teams to advance business capabilities.\nConduct technical evaluations of products or solutions to compare and assess their applicability.\nLead and build organizational capability, identify new spaces and ways to improve and enrich our product offerings.\nInnovate and lead technical programs from conceptualization to commercialization.\nOutline the goals for research and development.\nEstablish a learning and growth program for the team with new technologies and best practices.\nRepresent the organization amongst peers in the community locally and internationally.\nCreate an environment for the technology team to thrive and grow, incubating new ideas and technology to integrate into the existing solutions.\nEnsuring the longevity of the solutions with effectiveness from a budgetary point of view as well as from a technological perspective.Educational backgroundGraduate / Post Graduate degree in Software Development, Computer Science, or Information Technology. An additional degree in Digital Business or Business Administration with digital business experience will be a plus.ExperienceDemonstrable experience as a head in software development, UI/UX, project management, system architecture, product strategy product development as well as in leading e-commerce digital platforms and mobile applications development. Also, a clear understanding of all the emerging technologies and how they can be useful for the business.Specific knowledgeStrong automotive industry knowledge and experience\nStrong work experience in e-commerce, UI/UX and IT project management\nStrong e-commerce platform and mobile applications development experience\nExperience in e-commerce project management\nStrong product vision and strategy planning experience\nExperience in communicating technical concepts, questions and problems for non-technical stakeholders.\nExperience in large technical deJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Jeddah, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}