{"Job ID": "69873471", "Description": "Our MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.Our vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.FLEXWORK is an employee-centric reimagining of how we work. We built FLEXWORK based on employee feedback – it is about flexibility, trust, and choice whenever possible. It’s been a journey of disruption that has yielded the best of our values. We offer as much flexibility as possible, and choices that enable you to be most productive, including benefits that meet your needs and learning opportunities that you feel passionate about.Your CareerAs a Pre-Sales Systems Engineer, you are an important member of our technical sales team, identifying complex security challenges in your customers’ networks and driving solutions with our market-leading security products and services.You are the technical sales representative of the company and focus on customer satisfaction with all that you do. You and your sales partner own the customer relationship and your goal is to help them detect and prevent advanced cyberattacks and breaches while safely enabling applications by deploying the full Palo Alto Networks platform so that they can confidently pursue network, cloud, and mobile technology initiatives.Your ImpactUnderstand and effectively present our security platform and solutions\nWork closely with Enterprise accounts in North India region\nCreate and deliver compelling demonstrations of Palo Alto Networks products and solutions\nEducate customers and partners on the modern network security landscape\nIdentify and qualify new opportunities and support technical pre-sales activities to opportunity closure\nExpand the Palo Alto Networks install base within existing accounts\nEnable and leverage channel partners and work successfully in a channel-driven sales model\nCreate evaluation test plans with customers and lead the evaluation process to a successful conclusion\nDifferentiate from industry technologies and solution\nAssist customers through the support escalation process\nContinuous self-improvement and learning to maintain current technical knowledge and participate in technical communities of interest\nIdentify problems in customer environments - effectively engages customers at the technical field and technical management levels\nEffective in customer-facing engagement, in writing, presentation, and creative problem-solving skillsYour ExperienceBSCS or equivalent or equivalent military experience required and 6+ years of experience as a Pre-Sales Systems Engineer or Solution Consultant or Sales Engineer or Systems Integrator\nPre-sales experience handling North India Enterprise customers \nDemonstrable experience with systems installation, configuration, and administration of routers/switches, UNIX/Linux and Windows-based systems (prior Active Directory/LDAP experience desirable)\nExperience emphasizing L2-L4 Networking (L2 Switching architectures including Spanning Tree, IP routing including OSPF and BGP, L4 Load-balancing)\nIndustry knowledge of security and network product and technology trends\nExperience selling, demonstrating, installing and/or solving network infrastructure security products\nExtensive domestic travel within the territory is often required, and international travel may be required as necessary\nExperience selling network infrastructure based security appliances including, but not limited to - Firewalls, SSL/IPSec VPNs, Security Proxies and Caches\nPractical experience working with routing and switching products that will be installed adjacent to our appliances\nStrong communication and presentation skills, both written and verbal\nStrong analytical skills, ability to analyze complex multivariate problems and use a systematic approach to gain quick resolutionThe TeamAs part of our Systems Engineering team, you’ll support the sales team with technical expertise and guidance when establishing trust with key clients. You won’t find someone at Palo Alto Networks that isn’t committed to your success – with everyone pitching in to assist when it comes to solutions selling, learning, and development. As a member of our systems engineering team, you are motivated by a solutions-focused sales environment and find fulfillment in working with clients to resolve incredible complex cyberthreats.Our CommitmentWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at [email protected].Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.Please note that we will not sponsor applicants for work visas for this position.Covid-19 Vaccination Information for Palo Alto Networks JobsVaccine requirements and disclosure obligations vary by country.\nUnless applicable law requires otherwise, you must be vaccinated for COVID or qualify for a reasonable accommodation if:\nThe job requires accessing a company worksite\nThe job requires in-person customer contact and the customer has implemented such requirements\nYou choose to access a Palo Alto Networks worksite\nIf you have questions about the vaccine requirements of this particular position based on your location or job requirements, please inquire with the recruiter.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Delhi, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}