{
    "Job ID": "69873676",
    "Description": "22534BRRequisition Number:Description:At Stantec, we approach every project as a partnership, because our work creates a lasting impact on our clients’ communities. We believe that when smart, passionate, creative people come together, real possibilities are within reach.Our people are at the heart of everything we do; they give our work purpose. If you want to be a part of our unwavering team and can bring your sense of imagination and determination to every challenge, then this is the right place for you.Stantec is currently looking for a Senior Hydraullic Modeller - Gravity Systems to work on projects associated with wet infrastructure, i.e. wastewater, stormwater, potable water and recycled water systems, water and wastewater treatment system, and flood management and water resources management studies.The role involves working on projects associated with wet infrastructure, i.e. wastewater, stormwater, potable water and recycled water systems, water and wastewater treatment system, and flood management and water resources management studies.As a Senior Hydraulic Modeller, you will be responsible for developing, calibration and analysis of complex gravity system (sewerage and stormwater) hydraulic models to support our clients in the region in planning, design, and operation of their drainage systems.Key responsibilities for this position include, but are not limited to:•\\tReview, organize and analyze collected data•\\tDevelop hydraulic modelling method statements•\\tCarry out hydraulic modelling and model validation, calibration and verification, using recognized modeling software, and develop solutions•\\tDevelop hydraulic modelling reports•\\tDevelop maps (CAD, GIS) to present hydraulic modelling results•\\tWork in conjunction with peer engineers to overcome project challenges•\\tLiaise with other discipline teams and/or teams working remotely from other regions to facilitate completion of project tasks•\\tLiaise with sub-consultants and sub-contractors to facilitate completion of project tasks•\\tComplete all work in line with Stantec’s Core Values and in accordance with the Stantec’s Quality Systems, Project Quality procedures and Health & Safety procedures•\\tOrganize and attend meetings with clients and stakeholder to collect data and discuss technical solutions and optionsCompetencies:•\\tGood level of client service management, i.e. able to interface with clients and build and maintain positive relationships with our clients•\\tCapable to analyze, assess, evaluate issues, complexities pertaining to projects/work packages and support the team in mitigating them in advance•\\tRigorous attention to detail, able to understand and adopt workflows and commitment to professional development•\\tFlexible attitude to accepting different work assignments and proactive attitude to project execution and delivery•\\tExperienced with wet infrastructure design standards in GCC Countries•\\tExperienced with local and international guidelines/standards/codes and technical specifications for hydraulic modelling and design of wet infrastructure•\\tAbility to work on bids to develop technical methodology and estimation of level of effort and identification of resources•\\tInternational working experience, e.g. GCC Region, Europe, North America (preferred)•\\tExcellent command in English both written and spoken•\\tArabic language skills (preferred)•\\tAbility to manage a heavy workload, with close attention to detail•\\tAbility to make decisions independently and strong problem resolutions skills•\\tStrong team working capabilities, committed to working with all levels of management on a daily and ongoing basis•\\tProactive, working effectively in coordinating activities and complex tasks, taking professional responsibility and ownership•\\tPunctual, attentive and competent in adhering to Stantec’s policies, procedures and work practicesTitle:Senior Hydraulic Modeller – Gravity SystemsQualifications:•\\tBachelor’s degree in Civil, Mechanical or Environmental Engineering from a recognized university•\\t10+ years of experience in hydraulic modelling, master planning and design of gravity systems•\\tProven advanced experience and expertise in hydraulic modelling software such as InfoWorks ICM, InfoSWMM, SewerGEMS, InfoSewer, etc. and supporting tools such as AutoCAD, ArcGIS, etc.•\\tProven expertise and experience in hydraulic model calibration and management and coordination of field testing required for model validation, calibration and verification•\\tProfessional accreditation (Chartership/PE or equivalent) from internationally recognised engineering institutions such as ICE, CIWEM, Engineer Australia, etc., or working towards itEmployment Type: Full-TimeJob Type: RegularJob Category: ModellerAbout Stantec:We’re active members of the communities we serve. That’s why at Stantec we always design with community in mind. We believe growing a great design company happens from the inside out. We look for people who are drawn to use every talent they possess, plus creativity, determination and a drive to do the extraordinary.The Stantec community unites approximately 22,000 employees working in over 400 locations across six continents. We collaborate across disciplines and industries to bring projects to life. Our work as architects, engineers, and consultants from initial project concept and planning through design, construction and commissioning is built on a solid history of success. So, when we take on a project, we see the opportunity to make a lasting connection with the people and places where we live and work. Redefine your personal best. Join us!Location :United Arab Emirates-DubaiCountry:United Arab EmiratesState/Province:UAECity:DubaiJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}