{
    "Job ID": "69875759",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Purpose of Job:The Senior automation engineer is responsible to manage and maintain the automation solution platform from its design, build, testing and support. He is also accountable to onboard more services to the automation solution to improve RTO and RPO for recovery in DR.General:Ensure that the ITSM/Service Now tool is used with quality regarding the incidents and service requests\nEnsure that all systems are secured and configured as per defined standards and policies\nVerify connectivity to all infra components and coordinate with application/infra teams to ensure connectivity and synchronization among sites\nConduct regular meetings with application owners and review workflows with the team\nReview all alerts in the CP tool and notify applications alerts with respective team\nEnsure SLA/RPO and RTO of all infra components are met\nParticipate in Business continuity meetings and assist application teams in following best practices\nProvide periodic status reports of infra components to reflect the current conditions and support for the recovery objectives set by the organizationEssential Duties and Responsibilities:Expertise in Disaster recovery management in Perpetuuiti continuity patrol\nGood Knowledge of Change Management frameworks such as ITIL\nGood knowledge of network infrastructure\nGood knowledge on storage replication\nGood knowledge of business continuity processes and requirements.\nGood knowledge on Database\nGood leadership skills including people management, selection and development skills\nVery good analytical, planning, forecasting, execution and problem-solving skills\nFlexible and able to work under pressure\nRespect and promote trust and confidentiality\nResults oriented whilst ensuring high quality of work and able to \"think out of the box\"\nStrong level of customer service orientation and professionalism in all interactions\nAble to manage a multi-cultural environment and promote teamwork and knowledge sharing in order to achieve goals and deliverables.Academics:Bachelor’s degree or equivalent.Job knowledge, skills & experience:Ensure that the following duties are performed duly with quality:\nWork with business units and understand business flow of each application and their interdependencies and develop DR plan for all business applications\nDevelop recovery priorities, timelines, and strategy for proper sequence of recovery components.\nDevelop and understand all testing necessary for a successful DR execution\nConfigure/update infra components, objects and respective business functions, groups and various replication etc.\nConfigure monitoring, alerts and reports as per RPO/RTO/SLA defined by business.\nConfigure failover/failback and switch over workflows for applications and updating existing workflows and verifying their functionality with the runbooks.\nCoordinate with business team and ensure runbooks are updated and reflect the current infrastructure\nLead planned DR Drill exercises and crisis management and provide RPA report of the drills to BCM team and external auditors\nCo-ordinate and manage licenses for infra components with vendor and reclaim licenses for decommissioned and infra components not in use.Behaviour Skills:Independent, Self-Driven and able to bring ideas to the table\nAbility to make decisions and drive changes.\nExcellent Communication skills and able to communicate with Senior stakeholders as well as with the technical teams.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}