{"Job ID": "69873859", "Description": "Career That Change LivesWe are looking for a competitive and trustworthy Country Sales Manager to help us build up our business activities in the Emerging Markets Group, Cardiology space. The incumbent will be responsible for delivering results for the EMG Cardiology business by leading a team of frontline sales executive and managers. This position will be responsible to develop the market by investing in training and education. This position will be responsible to monitor competition activity and developing appropriate strategy to deliver desired organizational resultsThe goal is to meet and surpass the company’s expectations to drive rapid and sustainable growth.Sales teams are the key point of contact between an organization and its clients for answering queries, offering advice and introducing new products.This position interacts internally with the Marketing function, EMG Cardiology business unit and various other stakeholders in MDT and externally with clients, Purchase & healthcare decision makers of hospital in corporate, nursing home and government set up.A Day in the LifeWe offer you a position where you will act as an advisor to the sales team regarding projects, tasks, and operations. This role is crucial in ensuring that the company maintains its agreed-upon quality standards for products, procedures, policies, operations, and customer contact. Your responsibilities will include evaluating and implementing appropriate new sales techniques to increase the department's sales volume.Additionally, you will be responsible for creating long-term business plans for the division and managing the direct sales force to achieve assigned sales targets. You will also be involved in designing and recommending sales programs, as well as setting short- and long-term strategies.Furthermore, you will be expected to develop customer relationships and business with hospitals, purchase managers, authorities, and healthcare decision-makers. You will leverage all Medtronic resources to maximize sales at target hospitals and increase therapy penetration, as well as raise awareness about our therapies. You will also lead negotiations to secure hospital contracts and develop an action plan accordingly.Key Accountability·Work at the field level with the sales team to promote the adoption of EMG Cardiology products and related solutions, and drive revenue generation by delivering the AOP and achieving % SM·Create and sustain strategic relationships/alliances with hospitals and surgeons, and execute agreed marketing, KOL, and Market development plans to support the overall sales strategy.·Develop & maintain a detailed understanding of accounts and purchasing process, and support the creation and execution of Go-to-Market and Long-range plans.·Optimize channels and manage distributors to enhance sales performance and market reach.·Support the preparation of quotations, proposals and evaluate and identify untapped accounts /gain market share, accounts for strategic deal and explore opportunities for new products & supply directly·Analyze market potential and take appropriate decision to quote & keep track of competitive updates and pricing to win in accounts /monitor the performance·Support the creation and execution of Go-to-Market (GTM) and Long-range plans to ensure effective market penetration.·Evolve reimbursement strategies, government tender approaches, and pharma partnerships to drive business growth.·Collaborate with functional partners to ensure operational excellence across the organization.·Partner with T&E and compliance to drive therapy awareness and development to expand reach and SOV for assigned therapies by building COE’s and KOL’s.·Drive leverage across the Cardiovascular to become the preferred partner for HCOs and HCPs in India·Recruit, retain, and develop Sales Managers and Sales Representatives to build a high-performing sales team·Ensure compliance with appropriate SOPs and company policies and practicesMust Have – Minimum Requirements:-        12+ years of field sales experience, distributor management experience preferred.-        Experience selling in both direct and partner-led models-        Ability to articulate comprehensive range of offerings-        Experience selling into the tier 2 & 3 markets preferred & demonstrate business acumen and being visionary & demonstrate ability to retain high performing team-        Familiar with practices, and procedures related to procurement.-        Solid sales record and ability to meet up with targets-        Exceptional negotiation skills, build effective relationships internally or externally-        The ability to manage through influence to drive positive outcomes-        Provide leadership thorough effective communication, vision, active coaching and development of people-        Ability to think strategically, Strategy development and management skills-        Ability to act proactively and plan effectively-        Work within mindset of Eager to Win, Take Ownership, and Team up to Excel. Demonstrate these behaviorsNice to Have:-        Excellent communication and interpersonal skills: Good verbal communicator and presenter-        Professional presentation and \"Presence\"-        Can work autonomously but is also a team player-        Self-motivated and positive-        Outgoing and friendly:  Enthusiastic, energeticJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Sales Outsourcing", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}