{"Job ID": "69873137", "Description": "Country:Location:Job Title: Communication and Engagement LeadBuild A Career with Confidence:Carrier Global Corporation, global leader in intelligent climate and energy solutions is committed to creating solutions that matter for people and our planet for generations to come. From the beginning, we've led in inventing new technologies and entirely new industries. Today, we continue to lead because we have a world-class, diverse workforce that puts the customer at the center of everything we do.About the Role:The Executive Communications, Employee Engagement, and Internal Communications Specialist will be responsible for developing and executing strategic communication initiatives that enhance executive communication, drive employee engagement, and promote effective internal communications within the organization. The role involves collaborating with senior executives, cross-functional teams, and employees to create compelling messages, implement communication strategies, and foster a positive and inclusive work environment. The ideal candidate will possess exceptional communication skills, a strategic mindset, and a deep understanding of employee engagement principles.Key Responsibilities:Bachelor's degree in communications, public relations, marketing, or a related field.\n\nProven experience in executive communications, employee engagement, or internal communications roles with 8-12 years of work experience in large matrix organizations, work experience with Global Capability Centers preferred\n\nExcellent written and verbal communication skills, with exceptional attention to detail.\n\nStrong interpersonal and relationship-building skills, with the ability to collaborate effectively with individuals at all levels of the organization.\n\nDemonstrated ability to develop and implement communication strategies that align with organizational goals.\n\nProficiency in using communication tools and platforms, including intranet systems, design tools. email marketing software, and digital signage solutions.\n\nKnowledge of best practices in employee engagement, internal communications, and change management.\n\nAbility to multitask and prioritize in a fast-paced, dynamic environment.\n\nProficient in using relevant software applications, such as Microsoft Office Suite and content management systems.Executive Communications:Collaborate with senior executives to develop and execute communication plans that effectively convey key messages, promote transparency, and align with the organization's strategic goals.\n\nDraft speeches, presentations, and talking points for senior executives, ensuring consistent messaging and brand voice.\n\nConduct research and gather information to support executive communication initiatives.\n\nManage executive communication channels, such as newsletters, blogs, and internal announcements.Employee Engagement:Design and implement employee engagement initiatives to foster a positive and inclusive work environment.\n\nDevelop and execute internal communication strategies that inform, engage, and motivate employees across various channels.\n\nPlan and coordinate employee events, town halls, and other engagement activities.\n\nMonitor employee feedback and sentiment, and propose actionable strategies for improvement.Internal Communications:Create and implement an internal communications strategy that ensures consistent and timely information flow across the organization.\n\nDevelop and manage internal communication channels, including intranet, email newsletters, and digital signage.\n\nWrite and edit internal communications materials, including memos, announcements, and organizational updates.\n\nCollaborate with cross-functional teams to gather information and ensure accurate and effective communication.Content Development:Create compelling and engaging content for various communication channels, including written, visual, and multimedia formats.\n\nEdit and proofread communication materials to ensure clarity, consistency, and alignment with the organization's tone and style.\n\nDevelop and maintain a content calendar to ensure timely delivery of communication initiatives.\n\nMonitor industry trends and best practices in executive communications and employee engagement to continuously improve communication strategies.Basic Qualifications:University degree or any Equivalent degree\n\nGood expertise in Corporate CommunicationsBenefitsWe are committed to offering competitive benefits programs for all of our employees, and enhancing our programs when necessary.\n\nHave peace of mind and body with our health insurance\n\nMake yourself a priority with flexible schedules and leave Policy\n\nDrive forward your career through professional development opportunities Achieve your personal goals with our Employee Assistance Program.Our commitment to youOur greatest assets are the expertise, creativity and passion of our employees. We strive to provide a great place to work that attracts, develops and retains the best talent, promotes employee engagement, fosters teamwork and ultimately drives innovation for the benefit of our customers. We strive to create an environment where you feel that you belong, with diversity and inclusion as the engine to growth and innovation. We develop and deploy best-in-class programs and practices, providing enriching career opportunities, listening to employee feedback and always challenging ourselves to do better. This is The Carrier Way.Join us and make a difference.Apply NowCarrier is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.Job Applicant's Privacy Notice:Click on this link to read the Job Applicant's Privacy NoticeJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}