{"Job ID": "69875652", "Description": "MAIN PURPOSE OF JOBAs an Operations Specialist, you will play a pivotal role in the day-to-day operations of the company, driving revenue and ensuring that customer commitments are met on time while maintaining the highest quality standards. This position will require a hands-on approach, strategic thinking, and exceptional organizational skills. You will be an early member of our operations team and have the opportunity to shape our most critical operational processes.MAIN DUTIESBuild and drive critical operational processes to ensure day-to-day delivery of customer commitments. \nManage and oversee various aspects of daily operations, including inventory, procurement, logistics, and customer service. \nCreate an effective feedback loop between the front line, product, strategy, and customers. \nCollaborate with cross-functional teams, including Customer Operations, Product Operations, Product Managers, and more to achieve company objectives and KPIs. \nConduct periodic audits to ensure compliance with standards and regulations. \nProvide support in the onboarding and training of new employees. \nAnalyze operational data and metrics to identify areas for improvement. \nParticipate in process optimization projects and come up with creative solutions to bottlenecks. \nAssist in financial budgeting and reporting.  REQUIREMENTSAdvanced English skills. \nBachelor's degree in an analytics-heavy major (e.g., Engineering or Economics) and/or a graduate degree in Engineering, Economics, or Business. \nMinimum of 2-4 years of experience in an operations role and/or a top-tier consulting firm. \nExcellent communication skills, both verbal and written. \nStrong organizational and multitasking skills. \nAn action-oriented mindset that balances creative problem-solving with the scrappiness to ultimately deliver results. \nProficiency in Microsoft Office Suite, with strong Excel skills. \nAnalytical, planning, and process improvement capability.Other relevant skillsExperience with reading SQL or demonstrated analytical skills \nAnalytical Thinking \nTime Management \nAttention to Detail \nTeam Collaboration \nProcess Improvement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}