{"Job ID": "69873049", "Description": "JOB TITLE: Regulatory Affairs Associate ICAREER LEVEL: CLead the way for a new breed of solutions-oriented Regulators.Champion a new approach to Regulatory that supports quick decision-making and balanced risk-taking. Curious enterprise-thinkers we proactively take a strategic approach earlier in the product lifecycle to get involved in shaping drug development.Be part of the team where you are empowered to follow the science.Be part of the solution, turning our drug development strategies into reality. Work at all stages of development to translate our life-changing science into medicines to get the best results for AstraZeneca, patients in need and healthcare professionals.ABOUT ASTRAZENECAAt AstraZeneca we’re dedicated to being a Great Place to Work. Where you are empowered to push the boundaries of science and unleash your entrepreneurial spirit. There’s no better place to make a difference to medicine, patients and society. An inclusive culture that champions diversity and collaboration. Always committed to lifelong learning, growth and development.ABOUT THE TEAMWe are a diverse and open-minded team harnessing our different skills and experiences. As a Regulatory function we use our capabilities to accelerate discovery and development. Combining knowledge from across our Therapy Areas helps us to deliver rapid and global approvals that bring new medicines to patients.ABOUT THE ROLEDescription:The Regulatory Affairs Associate I assist other members of Regulatory Affairs Management (RAM) and the Regulatory Therapy Area (TA) in obtaining and maintaining licences and applications in accordance with agreed regulatory strategy and AstraZeneca standards. The Regulatory Affairs Associate I is an individual contributor who applies regulatory domain knowledge and may work under supervision.Accountabilities/Responsibilities:Document management including uploading and tracking regulatory files and systems according to established AZ procedures and regulatory requirements\n\nPlanning, preparing and completing simple submissions, and assisting with the preparation and planning of regulatory dispatches\n\nBe the talk to health authority (HA) and their systems for designated regulatory tasks e.g., management of user fees, receipt of incoming FDA correspondence, ordering EudraCT number, EudraLink support, use of HA portals\n\nResponsible for the ordering and tracking of specific regulatory requirements such as registration samples, certificates of pharmaceutical products, legal documentation, e.g., letters of authorisation, power of attorney, translations of regulatory documentation\n\nProvide support across the group for assigned non-drug project roles & responsibilities e.g., function as a designated point of contact or superuser\n\nProvide guidance and knowledge sharing within the RAM skill group\n\nIf required, support in activities such as scheduling of regulatory submissions, PBRERs, etc.Minimum Requirements – Education and ExperienceRelevant qualification and/or experience in science\n\nMinimum 2 years of experience from biopharmaceutical industry, or other relevant experience\n\nProficient verbal and written English\n\nProject management skills\n\nExperience in document management and tracking databases.Preferred ExperienceSome regulatory/medical/technical experience\n\nKnowledge of AZ business and processes\n\nSome knowledge of AZ submissions, compilation, publishing and approval processes, standards, systems and tools\n\nExperience of collaborating with people from locations outside of India, especially Europe and/or USA.Skills and CapabilitiesGood written and verbal communication skills in English\n\nCultural awareness\n\nProficiency with common document management tools\n\nAbility to work independently and as part of a team\n\nFocus on continuous improvement and knowledge sharing.Internal and External Contacts/CustomersLead RPM and members of the Global Regulatory Execution Team (GRET) and Global Regulatory Strategy Team (GRST)\n\nOther R&D skill groups, e.g., GRO, Operations Regulatory, Patient Safety, Reg TA (GRL & Regional Leads)\n\nMarketing companies\n\nHealth authorities\n\nExternal collaboration partners\n\nAstraZeneca Legal\n\nAZ vendors for translation, document authentication, etc.WHY JOIN US?We’re a network of high-reaching self-starters who contribute to something far bigger. We enable AstraZeneca to perform at its peak by delivering premier technology and data solutions.We’re not afraid to take ownership and run with it. Empowered with unrivalled freedom. Put simply, it’s because we make a significant impact. Everything we do matters.SO, WHAT’S NEXT?Are you already envisioning yourself joining our team? Good, because we’d love to hear from you! Click the link to apply and we’ll be in touch as soon as we can.WHERE CAN I FIND OUT MORE?Our Social Media, Follow AstraZeneca on LinkedIn https://www.linkedin.com/company/1603/We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.Date PostedClosing DateAstraZeneca embraces diversity and equality of opportunity.  We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills.  We believe that the more inclusive we are, the better our work will be.  We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics.  We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}