{"Job ID": "69873062", "Description": "Job Description:Job Title- Lead DeveloperLocation - PuneRole DescriptionIn this role you will be responsible for delivering the IT solutions for Credit Risk domain.  As a lead developer, you will design and implements technical solutions and configures applications in different environments in response to business problems.The successful candidate will work as part of high performing Agile team and will be responsible for translating the requirements into features/stories, enable solution development, analyzing the impact of changes, supporting the business throughout the implementation process, and ensuring smooth release into Production.Candidate will work on an application that caters to the Credit Risk management function for the bank. This area is responsible to assess Credit Risk, manage exposure to risk across various counterparty portfolios, calculating probability of default, assign credit ratings to the counterparties, manage and monitor credit Limits across various dimensions and also provide inputs to create regulatory risk reports.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesWork on solution design and overall system development in BASE/Advanced SAS on Mainframe system\nAnalyze business problems and provide resolution in a timely manner.\nUnderstand the business flows, translating user requirements, and creating features and User Stories.\nWork in the fast-paced Agile development environment and provide deliverables in timely manner.\nWork closely with Product Manager on backlog prioritization and provide timely updates.\nReport risk and dependencies to Management and work with required stakeholder for resolution.\nProactively help the junior team members and ensure team is delivering the business value to stakeholder in timely manner.\nCollaborate closely with application owners as the business/functional counterpart in solution identification and estimations.\nManage user acceptance testing and test case development/coordination with the business.\nDocument business and process flows.\nSupport implementation team and solve post go-live issues.Your skills and experienceMandatory skills:Hands-on experience on SAS 9.4 or higher versions.\nBasic understanding of working under Mainframe environment (z/OS) and SAS on mainframe.\nShould have experience in writing SAS Macros and Performance Optimization Techniques in SAS\nGood understanding of various SAS data formats and other hierarchical data formats like JSON\nExperience working in Agile/SCRUM teams with good understanding of Agile methodologies.  \nProblem solving ability to manage unexpected events and control and deal with them quickly and efficiently.\nUnderstanding of Application management and compliance topics\nProcess oriented, proactive, and self-motivated individual with ability to perform in difficult situations.\nPro-active team player with good communication and English language skills.Nice to have:Basic understanding of Linux/Unix environment\nUnderstanding of REST architecture and JSON data\nUnderstanding of Cloud platform\nGood understanding of Credit Risk domainHow we’ll support youTraining and development to help you excel in your career.\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression.\nA range of flexible benefits that you can tailor to suit your needs.About us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}