{
    "Job ID": "69873116",
    "Description": "Described by our clients as ‘passionate’, ‘innovative’, ‘collaborative’: BuroHappold is an independent, international engineering practice that over the last 40 years has become synonymous with the delivery of creative, value led building and city solutions for an ever changing world. Having worked on every continent, our clients include more than 90% of the world’s leading architectural practices and we have collaborated with global organisations such as the United Nations, The World Bank and UNESCO. Through our global community of driven, world leading engineering professionals we deliver elegant solutions for buildings and cities that seek to address the major problems facing societies today.As an organisation we strive for progress and are committed to finding new and better ways to deliver elegant solutions. We recognise that this can only happen if our people can keep up with, create and implement the latest developments in technology and ideas. We offer learning and development opportunities at every level, to help shape exciting and personally satisfying careers and ensure our engineers stay at the cutting edge of industry thought.About the role...We are looking to recruit an experienced Senior Infrastructure Engineer in our Hyderabad/ Bangalore office who will be a key member of our Infrastructure group to work on projects in India and across the worldThis Will Encompass\nWorking on the delivery of multidisciplinary projects, with technical inputs from numerous disciplines, including transport, energy, sustainability, and building engineers\nAssisting Project Lead/Discipline lead and developing more junior team members. Identifying opportunities to grow the team and bring new skills into the team\nPreparing designs, drawings, technical reports, specification, and schedules.\nApplying customer focus and be part of the work winning team securing the groups project pipeline.\nThe management of junior technical staff, with responsibility for planning team workload, as well as assisting and mentoring staff where needed, and developing more junior team members. We Are Looking ForIdeally be in the range of 8-12 years’ experience range\nDemonstrating both the ability to work on multidisciplinary projects, collaborate with other disciplines as well as having excellent communication and presentation skills\nExperience of masterplan engineering (Roads, utility coordination, highway drainage), the formulation of options and holistic analysis to provide recommended solutions to clients, as well as an awareness (and ideally experience) of applying the principles of sustainability to infrastructure engineering\nA desire to show continuous quality improvement in our work\nGood IT skills including Microsoft Excel, Word, PowerPoint, Civil3D, Bentley SewerGems and Microdrainage\nDegree in Civil Engineering and preferably a Master’s degree from a reputed institute\nExperience in the Middle East and/or UK would be an advantage\nA Member of a relevant professional institution.\nA willingness to travel, and desire to lead continuous quality improvement in our work.We can offer the chance to be at the cutting edge of creativity in the built environment; on a local, national and global scaleImportant informationThe post holder must at all times carry out his/ her duties with due regard to the BuroHappold Equality & Diversity Policy.You are required to set a personal example in all aspects of Occupational Health and Safety (OH&S).You are responsible for encouraging and maintaining high standards of OH&S in all areas under your control; meeting or exceeding targets and reporting on OH&S Key Performance Indicators.  You will ensure compliance with the Company’s health and safety policy, relevant legislation and guidance in these areas.You are required to fulfil the duties appropriate to your grade as detailed in the Roles & Responsibilities section of the Company’s Health & Safety Management SystemBuro Happold is proud to be a practice of a diverse range of professionals. We actively promote inclusivity to enable every individual to reach their full potential, the more inclusive we are the better our work will be.\n\nWe are working to change the lack of representation of minority groups in the built environment, and are particularly keen to hear from anyone who feels they are underrepresented in the industry. We have much to learn from one another. Embracing difference allows us to develop the most innovative and elegant solutions.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}