{"Job ID": "69873034", "Description": "Create a better future!Do you want to make a difference in the world and contribute to a sustainable future? We believe we can develop technology and gain the knowledge to make that difference.  We have launched our ambition, Mission Zero – enabling our customers to move towards zero emissions in mining and cement. We need your leadership skills, curiosity, and drive for change to fulfill our goal. Together, we enable our customers to produce the materials needed for a better future.Your responsibilitiesDevelops relationships with clients through managing and interpreting their requirements.\n\nVisit Customer and generate lead through interactions.\n\nNew Job Execution and handing over to client.\n\nHandling service calls, on time service and give quality service within defined time.\n\nRevenue generation by promoting AMC and spares.\n\nReport to respective department when there is a change in design.\n\nReport management.\n\nEnsure customer satisfaction.What you bringUnderstanding Electro-Mechanical documents & Customer GA Drawings.\n\nTechnical Know-how.\n\nComputer Knowledge: MS Office\n\nCommunication Verbal / Mail / Documentation.\n\nWriting and Reporting, preparing manuals and documents.Education QualificationBachelor’s Engineering degree / Diploma from a reputed university specializing in Instrumentation/Electrical.Experience3 to 6 years of experience in service execution of weighing systems.What we offerCompetitive remuneration package & access to salary packaging options to allow you to maximize your after-tax income. \n\nCompetitive benefits package including Health Insurance, Personal Accident / Disability, Group Term Life Insurance, Annual health check-up, and voluntary insurance options.\n\nEntitled to one work week of R & R (7 calendar days including weekend) for each three month (90 days) uninterrupted period of service at the site.\n\nTime to recharge through 30 days PTO (with up to 10 days carry forward as Earned Leave stock)\n\nEmployee Assistance program for you and your immediate family \n\nA global network of supportive colleagues and growth opportunities\n\nContinuous development and training in your area of expertise within a global OrganizationAs an equal-opportunity employer, FLSmidth embraces diversity and equality by promoting an environment of inclusion. We encourage applicants of all backgrounds and perspectives to apply – the more diverse our employees are, the stronger our team is.In our commitment to equal opportunity and eliminating bias, we kindly request that you exclude personal information such as age, ethnicity, number of children, and photograph from your application materials.Kindly note that we will review applications and interviewing actively, so please apply as soon as possible.We will contact candidates via email. No recruiters and unsolicited agency referrals please.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}