{
    "Job ID": "69873258",
    "Description": "Company DescriptionDentsu Media is the largest area of specialism within the dentsu network. It is brought to markets globally, through three award-winning agency brands: Carat, iProspect and dentsu X. All three are underpinned by a scaled network offering of talent, capabilities, and services to support, grow and transform the world’s leading advertisers. Operating across more than 145 countries, dentsu Media is trusted by leading brands across a broad range of sectors, from pioneering technology to cutting-edge fashion. Dentsu leverages technology, creativity, and in-depth data analytics to drive superior results that amplify its clients' brands. Dentsu Media is transforming advertising as a force forgrowth, a force for good and has become the destination for employees to cultivate meaningful careers and for brands to accelerate previously unseen, sustainable growth.Work closely with the onshore Video team across the full portfolio of brands for the tasks.\nComplete daily and monthly client deliverables with complete accuracy – Discrepancies reports, Allocations, tracking report, adding ADUs.\nSending out mails and communicating to vendors about campaigns and media buying.\nCompile performance data and assisting in developing weekly and monthly reports\nPrepare and present reports regularly based on client’s requirement.\nProduce work with 100% quality in timely manner.\nFollow the exact process requested by client/seniors to complete the work.\nAdherence to data protection policies and requirementsExcellent communication skills - ability to express oneself clearly and concisely in written and oral communication is a must.\nDemonstrated good skill using Excel, Word, and PowerPoint\nMust be a Quick Learner\nPositive attitude and Analytical thinking\nFlexibility to work across markets & Shifts (Night shift)Education & Training:• Any Degree• Trained on MS Excel & PowerPoint• Trained & Certified in any Social media platform is an added advantageJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}