{
    "Job ID": "69872506",
    "Description": "Job OverviewThe Handover Manager is a full-time role, responsible for managing and coordinating all handover activities, ensuring that all aspects of the Riyadh Metro projects are ready for operational use, comply with safety regulations, and meet quality standards.This position involves coordination, documentation, and collaboration with various stakeholders to facilitate a smooth handover process from construction to operations.Our Client requires the person appointed to this role to have a minimum of 10 years of experience within this area of expertise.ResponsibilitiesLead and manage the handover process, ensuring effective communication and collaboration between D&B contractors, OMC contractors and relevant authorities.\n\nDevelop a comprehensive handover plan outlining all necessary activities, milestones, and timelines for transitioning of the assets from construction to operations.\n\nLead handover management coordination forum, engage will all stakeholders, set and agree term of reference, manage meeting agenda, review progress on actions, take minutes and communicate to all stakeholders.\n\nManage coordination of handover activities, such as documentation, technical database, handover inspections, asset snags, develop a snag database, dashboard/ tracker, maintain record and report progress.\n\nPrepare reports, presentation slides, escalate issues at senior level forums and seek direction.\n\nMonitor performance of all handover activities against plan, ensure that any issues that could potentially impact successful handover are brought to the attention of the appropriate teams.\n\nIdentify potential risks and challenges that could impact the handover process and implement mitigation strategies.\n\nAddress any concerns, inquiries, or issues raised by stakeholders in a timely and effective manner.\n\nLiaise with internal and external stakeholders, including Employer Representative teams, authorities, Operation & Maintenance teams, and third-party contractors, to manage expectations and facilitateQualifications & ExperienceBachelor's degree in Engineering, Project Management, or a related field.\n\nProven experience in project management, preferably in the rail/metro industry, with a focus on project handover and transition to operations.\n\nStrong knowledge of rail/metro systems, infrastructure, and operational requirements.\n\nFamiliarity with safety regulations, industry standards, and regulatory compliance related to rail/metro operations.\n\nExcellent communication, interpersonal, and stakeholder management skills.\n\nStrong problem-solving abilities and a proactive approach to risk management.\n\nProficiency in project management tools and software.\n\nRelevant certifications in project management, rail operations, or relatedSkills & AptitudesAble to work within a collaborative team that promotes sharing of knowledge and experience.\n\nThe Candidate must be physically capable of carrying out site visits and inspections in a railway environment, throughout the construction, testing & commissioning and operational phases of the project.\n\nInterpersonal skills\n\nCommunication skills\n\nNegotiation skills.\n\nClient management skills\n\nLeadership skills.\n\nDriving licenseAdditional Project RequirementsThe project language is English. The candidate must have excellent verbal and written English language skills.\n\nArabic language would be advantageous.\n\nAbility of other languages.Personal QualitiesWork to tight deadlines.\n\nWorking with multiple priorities.\n\nManaging project deadlines.\n\nManaging TeamsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}