{
    "Job ID": "69875795",
    "Description": "Responsibilities:Responsible for developing and executing formal PERFORMANCE test plans to ensure the delivery of quality software applications. \nInvolved in test planning, writing test cases/scripts, test case automation, PERFORMANCE test execution and analysis of PERFORMANCE test results. \nCollects and analyzes data for software process evaluation and improvements and integrates them into business processes to address the needs of the business. \nDocuments all problems and assists in their resolution. Delivers quality process training to technical staff and acts as an internal quality consultant to advise or influence business or technical partners. \nPerforms quality audits across the various IT functions to ensure quality standards, procedures and methodologies are being followed. \nPro-actively sharing and reporting risks, issues, challenges, blockers and forthcoming tasks to the Scrum Master or Quality Manager.\nAccountable to ensure the defects are detected and reported to be prioritized (based on impact) with the Product Owners.\nProviding support in highlighting software and hardware requirements to ensure proficient delivery of your role.\nActively contributes to their Centre of Excellence (CoE) specialism by cross sharing of learnings, emerging, good and best practice with their CoE colleagues. Also comply where required with CoE standards & policies.The Role offers:High visibility, opportunity to understand and analyze acceptance criteria with colleagues to plan and manage the work necessary to perform and deliver testing for projects.\nBuilds effective and trusted working partnerships with a wide variety of individuals. Maintains an open and honest approach.  Essential Skills:Person with 4+ years of experience in Performance Testing of Web & PeopleSoft applications.\nPreparation of scripts using LoadRunner or JMeter, Desirable to have exposure to other Load testing tools.\nStrong knowledge developing performance test scenarios, test execution, analyzing results and providing recommendations.\nProficient in different types of performance testing (Stress, Volume, Load, etc.) to align the business requirements in Performance test models.\nProficiency with performance Testing tools involving Performance Center / LoadRunner, JMeter and Neoload\nExperience working with APM tools such as AppDynamics, New Relic, Dynatrace etc\nProvide Fine Tuning Suggestions\nShould be strong in communication skills.\nExpertise in Performance Test assessments.\nStrong expertise in Performance Test frameworks and implementation processes.\nExcellent Communication skills – written, oral.Essential Qualification:BE degree Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}