{"Job ID": "69872665", "Description": "Job Purpose:This role will be responsible for defining the content strategy, which includes planning, development, and management of content to enhance customer experience and support brand objectives. Content Strategist will drive the implementation of defined content strategy, measurement of content effectiveness, and optimization of content across channels, based on the campaign goals and deliver high quality promotional materials. He/she will work with cross-functional teams to ensure cohesive and personalized messaging across all channels.Key Responsibilities:Content Strategy & DesignDefines content strategy that supports the development of purposeful content, personalized as per local HCP needs/preferences\nGuides on the LOC specific nuances for development of relevant push & pull content based on campaign and brand objectives, content pillars and HCP needs to establish connection across the Omnichannel (OC) ecosystem\nProvides guidance on designing the right content for the customer journeys, leveraging relevant global or local content for each touchpointContent Development & ManagementOversees the creation and management of content calendars\nDevelops content governance guidelines for design, tone, style, and voice of all content in alignment with Marketing, Medical & Compliance\nShares guidance to ensure all content development, optimization and implementation follows the requirements set out within internal and external operating frameworks including the GSK Code & ABPI code\nEnsure alignment with Global content strategies and manage content complexity and adaptation as per local needs\nConducts periodic content audits to identify gaps in the content and suggests ways to extend, augment, edit or create content, as required\nEnsures editorial outlook is up to date, provides feedback and suggestion on digital content (both on visuals and copies)\nWorks with the relevant regional/global teams to share guidance on relevant content creationCross-functional CollaborationWorks closely with OC Lead , Experience Design & Channel Orchestrator and Analytics & Insights Lead  to share relevant inputs on customer journey design\nPartners with brand managers to ideate on content, aligned with the business objectives, relevant to the segment/ persona and fit for purpose for the channels\nShares Medical, Marketing & Sales teams inputs around having right nuances, scientific content / HCP content preferences/needs with relevant teams and agencies for content planning & development, lead briefing processes with agencies\nCollaborates with Content Management, Creative, Technology CRM agencies to identify content topics most relevant to target HCPs and shares with relevant teams to accordingly modify brand’s communicationContent Analytics & InsightsActs on content analytics to enhance content effectiveness and adjusts strategies and tactics as necessary to optimize results and provide personalized content to HCPs\nCapable of working with analytics and drawing insights to support content analysis\nTranslates insights, data, and disparate pieces of information into narratives that promote the value of the company’s products and servicesProject Management & SupportCreates and maintains project schedules by developing project plans and specification, estimating time requirements, establishing timelines, monitoring milestone completion, providing timely reporting of issues that impact project process, coordinating actions, and resolving conflicts\nProvides expertise and guidance to relevant teams for designing the content architecture, developing the right content that can be leveraged across channels\nActs as a single point of contact and subject matter expert to guide on content planning, development & approval, taking into consideration local LOC nuancesWhy you?Basic QualificationsWe are looking for professionals with these required skills to achieve our goals:Bachelor’s degree in marketing, Communications, Advertising, or any other related discipline.\nMBA in Marketing or any other post-graduate degree in content / communication preferred.  \n5+ years of directly related or relevant experience, preferably in content management, marketing communications or advertising.\nOmnichannel or Digital Marketing experience will be a plus.Preferred Qualifications:If you have the following characteristics, it would be a plus:Preferred Certifications:Digital Marketing Certifications\nContent Marketing Certifications\nData Analytics Certifications\nProject Management CertificationsSkills & KnowledgeTechnical Skills:Content Strategy\nContent Curation & Assessment\nMarket & Customer Intelligence\nMarketing Analytics & Customer Insights\nCustomer Experience Management\nKPI Reporting & Monitoring\nAsset & Content Management\nMedia Auditing & Evaluation\nContent Analytics and Performance Management\nProject Management\nExperience with copy approval processBehavioral Skills:Proficiency in leading and engaging cross-functional stakeholders for collaborations.\nDetail Oriented\nEffective Communication\nCreativity & Innovation\nPresentation Skills\nNegotiation skills\nStrongly independent and problem solving mindset\nResilience and agility to stretchTools Knowledge:MS Office suite\nWeb Analytics tools like Google Analytics\nCRMs like Veeva, Salesforce\nMarketing automation tools like SFMC, Pardot\nContent Management Systems like Veeva Vault\nData tools like Claravine\nDatabase Activity Monitoring (DAM) tools#Omnichannel#OCStrategyJob Posting End Date: 22.09.2023Why Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Contact information:You may apply for this position online by selecting the Apply now button.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}