{"Job ID": "69873054", "Description": "Business Unit:Company Details:Job Details:Job Summary:The India Accounting manager will manage a team supporting the Corporate and regional (US, EMEA and APAC) accounting teams.This role will be responsible for general ledger accounting, closing and entity accounting processes with a focus on quality while also driving their direct reports to continuously improve the process foundation.  This role will report directly to the CAO Controller with highly matrixed interaction with the regional controllership.  This role is Hybrid, with US working hours. (2pm-11pm India) and will oversee 7-10 individuals.Essential Job Duties and Responsibilities:Manages the India Accounting team who provides general and entity accounting services to the Corporate and Regional accounting teams\nDrives the team to adherence to the global close calendar and delivering on time to enable CAO to deliver accurate and timely consolidated financial statements\nAdhere to the global accounting controls requirements\nProvides quality analysis and financial information to operating and corporate management.\nPrepares other financial reports or analyses, as required.\nWorks closely with management and other stakeholders to establish first class metrics to monitor performance against requirements\nPromote a culture of high performance and continuous improvement and innovation that values learning and a commitment to quality\nSupervises and trains department staff to improve individual and organizational performance.  Evaluates staff performance and provides positive feedback.  Prepares or reviews annual performance evaluations for the India Accounting team.\nAssists leadership on various internal improvement initiatives\nIn addition to the duties and responsibilities listed, the job holder is required to perform other duties assigned by their manager from time-to-time, as may be reasonably required of themMinimum Job Requirements:Four-year college degree in Accounting or Finance with at least 5 to 7 years progressive accounting experience and a Chartered accountant certification.\nMinimum of 5 years’ experience with general ledger, P&L and Balance Sheet including experience and working knowledge of generally accepted accounting principles (US GAAP).\nPrior experience managing an accounting team is required along with demonstrated success creating and maintaining strong partnerships with colleagues, regional controllers and internal stakeholders.  \nAbility to identify areas of under-performance and agree plans to rectify. Demonstrated experience designing and implementing business process improvements.\nDemonstrates excellent personal interaction skills with a willingness to share knowledge, coach and collaborate effectively with individuals and other departments.\nStrong organization and planning skills with the ability to multitask and prioritize.\nPrior experience in a manufacturing environment and service-based organization are highly desirable.\nProficient with Microsoft Office Suite or similar software, (including automation), prior experience of SAP preferred but not essential. Able to protect and handle confidential personnel information.Condition of Employment:Successful outcome of a National Police Check and background check.The description provided above is not intended to be an exhaustive list of all job duties, responsibilities, and requirements.  Duties, responsibilities, and requirements may change over time and according to business need.Worker Type:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}