{
    "Job ID": "69870469",
    "Description": "Mob Inspire PVT Ltd is one of the fastest growing mobile platform development and innovative technology company in Islamabad. The company leverages unique processes to build and control world class mobile platforms. Mob Inspire helps leading Enterprises, Brands and Startups to solve big problems in their countries by launching a great platform that can hold big data of consumers and providers.We are looking for Android developer with 3-4 years experience who have done complex mobile projects with REST API integrations. This position will be full time on-site. #LI-onsiteTranslate designs and wireframes into high quality code.\nDesign, build, and maintain high performance, reusable, and reliable Java code.\nEnsure the best possible performance, quality, and responsiveness of the application.\nIdentify and correct bottlenecks and fix bugs.\nHelp maintain code quality, organization, and automation.\nProduce detailed specifications.\nContribute in all phases of the development lifecycle.\nFollow industry best practices.\nDevelop and deploy new features to facilitate related procedures and tools if necessary.Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes.\nFamiliarity with RESTful APIs to connect Android applications to back-end services.\nStrong knowledge of Android UI design principles, patterns, and best practices.\nExperience with offline storage, threading, and performance tuning.\nAbility to design applications around natural user interfaces, such as “touch”.\nFamiliarity with the use of additional sensors, such as gyroscopes and accelerometers.\nKnowledge of the open-source Android ecosystem and the libraries available for common tasks.\nAbility to understand business requirements and translate them into technical requirements.\nFamiliarity with cloud message APIs and push notifications.\nFamiliarity with Socket programming will be a big plus.\nKnowledge of Kotlin language would be a plus.\nA knack for benchmarking and optimization.\nUnderstanding of Google’s Android design principles and interface guidelines.\nProficient understanding of code versioning tools, such as Git.\nFamiliarity with continuous integration.At our software house, we offer an exciting and rewarding opportunity to be part of a dynamic and innovative team. Here are some compelling reasons why you should consider joining us: Leave Encashment. \n\nDental service allowance. \n\nInhouse games/activities. \n\nAnnual, Casual & Sick Paid Leaves. \n\nCutting-Edge Technology. \n\nChallenging Projects.  \n\nCollaborative Work Culture. \n\nImpactful Work. \n\nCompetitive Compensation and Benefits. \n\nMarket-leading Salary. \n\nEmployee Performance-based bonuses. \n\nMedical Reimbursement. \n\nFree unlimited tea/coffee. \n\nEmployee referral bonus. \n\nOccasional bonuses/gifts Joining our company means becoming part of a team that values innovation, collaboration, and personal growth. Take the opportunity to make a difference and shape the future of software development with us. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Islamabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}