{"Job ID": "69870265", "Description": "Security Management\n Support the Cyber Security Unit and IT Technology Infrastructure Section team in the process of engineering, implementing and monitoring security measures for the protection of computer systems, networks and information.\n Designing system security architecture in accordance with the defined timelines and policy standards to support business process and user requirements.\nSecurity Design and Implementation\n Ensure that the IT systems and network design is in line with the enterprise security architecture.\n Implement systems in line with the best in class security practices to ensure high levels of system performance and availability for end users. Evaluate new technologies and processes that enhance security capabilities.\n Review of security configurations for products such as antivirus softwares, patch management solutions, systems firewall solutions, SIEM solution, EDR solutions, endpoint security solutions, data encryptions, data protection tools like data classifications, DLP and other security solutions to ensure internal users get easy and secure access to IT systems and applications.\n Security hardening of operating systems, Endpoint pc, systems, network devices, applications & database.\n Regular Security vulnerability scanning & mitigations of systems, network devices and web applications & database\n Investigate intrusion incidents, conduct security threat detection and mitigation and provide resolutions.\nJob Description\nDoc ID: Issue Date: Rev. Date: DD.MM.YY Rev #: 01 Page 2 of 3\n4. DESCRIPTION\nNetwork Security and Administration\n Assist in the administration of IT network security solutions and technologies to the required standards by analyzing, troubleshooting and correcting security-related problems to resolve operational issues timely and efficiently.\n Effective administration of various IT network components, identifying errors in the network and ensuring timely resolution of same to maintain an error free network with high reliability of data.\n Review & baseline network configurations and troubleshooting.\n Monitor backups for all network and security devices.\n Assist in the administration network security devices like firewall, Intrusion prevention systems, DDoS solutions, sandboxing, Web application firewall, network deception solutions, VPN, SSL security, SIEM etc.\nReporting\n Ensure that all functional reports are prepared timely and accurately and meet GCAA requirements and quality standards.\nHealth, Safety and Environment within GCAA\n Ensure compliance with all relevant health, safety, quality and environmental management procedures and controls to guarantee employee safety, legislative compliance, delivery of high quality products/services and a responsible environmental attitude as per IMS available standards\nOther Tasks/ Accountability\n Perform additional tasks relevant to the role / area of expertise as requested by the management to be able to achieve the objectives/commitments.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}