{
    "Job ID": "69874034",
    "Description": "You Lead the Way. We’ve Got Your Back.With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.Join Team Amex and let's lead the way together.How will you make an impact in this role?     The position is responsible for providing quality and timely completion of Merchant requests related to KYC & Banking Updates/Maintenanceon existing merchant accounts/New Account set-ups, payments research and account reconciliation.·Requires the handling of outbound and inbound calls to and/or from Financial Institutions, Merchants, and internal customers.·Provide service & support to Merchants, Processors, MS TSC, Banking, SRG/KOAT, Contract Review, Submissions, ESSU, CMS, Acquisition, Network Development, Risk Management, and Welcome Acceptance·Review, analyze, and process merchant requests from the simple to the complex.·Review, verify, understand, and apply information from business and legal documents, i.e., Articles of Inc., Business license, Bank Statements, Guarantee Agreements, IRS documents, AMEX Terms and Conditions, Policies and procedures and PAD Agreements in order to fulfill critical maintenance requests & KYC requirements.·Ensure timely completion of cases and following strict deadlines for enhanced merchant experience·Strong analytical and collaboration skills·Excellent written and verbal communication skills·Demonstrates ability to be self-directed with excellent follow through·Customer focused with a high level of urgency; role model for delivering Extraordinary Customer Care·Able to interact professionally with all levels of clients·Ability to manage multiple tasks simultaneously·Working knowledge of MS Office products, i.e. Excel, Word, PowerPoint etc.Minimum QualificationsGraduate\n\n·Excellent verbal and written communication skills\n\n·Ability to evaluate Merchant information\n\n·High result orientation\n\n·Ability to take independent decision & meet stringent deadlines\n\n·Demonstrated dependabilityWe back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:Competitive base salaries \nBonus incentives \nSupport for financial-well-being and retirement \nComprehensive medical, dental, vision, life insurance, and disability benefits (depending on location) \nFlexible working model with hybrid, onsite or virtual arrangements depending on role and business need \nGenerous paid parental leave policies (depending on your location) \nFree access to global on-site wellness centers staffed with nurses and doctors (depending on location) \nFree and confidential counseling support through our Healthy Minds program \nCareer development and training opportunitiesAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.  Offer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}