{
    "Job ID": "69876463",
    "Description": "About Glovo:We’re a Barcelona-based startup and the fastest-growing delivery player in Europe, Africa, and Western Asia. With food at the core of the business, Glovo delivers any product within your city at any time of day.At Glovo, you’ll have the job of your life while working together towards our shared vision to give everyone easy access to anything in their city. We welcome top performers that will bring new ideas, diverse perspectives, and provide you the opportunities and freedom to grow and make a real impact on millions of lives… all while having fun!We believe that diversity adds incredible value to our teams, our products, and our culture. We know that the best ideas and solutions come by bringing together people from all over the world and by fostering a culture of inclusion where everyone feels heard and has the chance to make a real impact. It's because of this that we are committed to providing equal opportunities to talent from all backgrounds.&nbsp;Your work-life opportunity:Glovo is looking for a talented and ambitious Account Manager to join our Partners &amp; Brands team and contribute to our partners' Growth. Are you looking for a challenging experience in one of the fastest growing Startups? Do you want to contribute building a product that will disrupt the On demand market?&nbsp;Be a part of a team where you will:Be responsible for the entire sales process with new partners to source and negotiate the best products in your cities to deliver to our customers\nMeet monthly and quarterly objectives defined by the company\nOnboard new partners on our platform by providing them all the necessary tools and information to start working\nGather all the insights from our partners to create an amazing experience for them and our customers, tackle through problems to raise the bar.\nGet feedback from our stores and translate it into product improvement\nMaintain good relationship between Glovo and our partners\nForecast and track key account metrics\nActively collaborate with your colleagues and learn from each other in a supportive environment that allows you to grow, develop and make a differenceYou have:&nbsp;Strong business acumen\nHave excellent communication skills. Detail oriented, strong grammar and writing skills\nProactive, organised, and obsessed with detail and accuracy\nBachelor's degree in business, marketing or sales\nHands-on and autonomous\nData-driven profile\nProficiency in French is a must&nbsp;\nProficiency in English is desirable\nAn empathetic, inclusive and curious attitude\nSelf-starter who is able to work in a highly demanding environment (impossible is not Glovo, you make everything happen)\nAbility to influence stakeholders in order to help achieve your goals\nComputer literate; good knowledge of Google Docs and MS Office\nExperience in a high-growth digital startup business is a plusWe are always looking for the best candidates, so if you think you would be a good fit even if you don't meet 100% of the requirements we would love to hear from you!Experience our Glovo Life benefits:Enticing equity plan (if applicable)\nTop-notch private health insurance\nMonthly Glovo credit to spend on our restaurant products and zero delivery fee on all Glovo orders!\nDiscounted gym memberships\nFlexible time off (take the time you need) and hybrid working model (own your time)\nEnhanced parental leave including nursery support!\nOnline therapy and wellbeing benefit\nExternal learning budgetGas: Driven to deliver quality results quickly\nGood Vibes: Bring positivity and communicate openly\nStay Humble: Self-aware and open to learning\nCare: Uplift people and the planet\nGlownership: Act as proud owners\nHigh Bar: Focus on Top PerformanceGlovo is transforming the way consumers access local goods, enabling anyone to get almost any product delivered in minutes. Our on-demand logistics connect customers with independent local couriers who acquire goods from any restaurant or store in a city, as well as deliver urgent packages for a variable fee.&nbsp;For additional information on Glovo, please visithttps://about.glovoapp.com/Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}