{"Job ID": "69874167", "Description": "Publicis Groupe Commitment to Diversity & Equity Policy:Publicis Groupe is deeply committed to diversity and inclusion in spirit and in action at every level of the organization. It reflects our core values and embodies our purpose of building a great company enabling human potential. We have a deep-rooted appreciation for how diversity of thought drives innovation, and we ground that value in a culture of collaboration and connected thinking.  Diversity & inclusion are business imperatives on which Publicis Groupe will not negotiate. While fostering a work environment that is inclusive of all talent is a collective responsibility, it is leadership’s job to nurture the career aspirations and goals of all our talent. Promoting gender equality starts at the top and the Groupe will not tolerate anyone speaking for our organization who does not value the importance of inclusion. Publicis Groupe works very hard to champion diversity and will continue to insist that each agency’s leadership be champions of both diversity and inclusion.\nOur Core values “ VIVA LA DIFFERENC’E is based on the very aspect of celebrating differences \nOur strategy focuses on bringing together teams with diverse perspectives, disciplines, and experiences, because diversity of thought best serves our clients and their customers who they aspire to impactEqual Employment Commitment:We provide equal opportunities to all our employees and to all eligible applicants for employment in our company. We do not unfairly discriminate on any ground, including race, caste, religion, color, ancestry, marital status, gender, sexual orientation, age, nationality, ethnic origin, disability or any other category protected by applicable law.\nWhen recruiting, developing and promoting our employees, our decisions will be based solely on performance, merit, competence and potential.\nWe shall have fair, transparent and clear employee policies which promote diversity and equality, in accordance with applicable law and other provisions of this Code. These policies shall provide for clear terms of employment, training, development and performance management.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}