{"Job ID": "69872865", "Description": "As a Secure Transactions Product Delivery Lead, you will lead efforts to establish our target state data environment.  You will be responsible for establishing our cloud-based data environments including data pipelines, data mesh architecture and analytics and AI/ML environments.  This data and environment is the foundation for a new generation of data products that will accelerate our growth into the future.  Your goal will be to ensure that our environment is built as effectively as possible so that it can be leveraged a cross an array of use cases and support the entire Customer Identity & Authentication product lines.Job Responsibilities:Partner with Area Product Owners and Identity Management/Authentication product team for ongoing refinement of product backlog, execution of the product roadmap and product modernization agenda\nManage delivery on existing product features, write epics, user stories, acceptance criteria and participate in all agile events of the product group. Lead the research, definition, and development of new features to advance the product roadmap. \nWork with other product teams, legal, risk, operations, design and technology teams to define, prioritize, deliver and align solutions to product vision and roadmap\nAct as subject matter expert with respect to Customer Identity and Access Management processes and supporting applications/capabilities\nSupport Product Owner and Area Product Owners with developing business cases and/or measuring/improving operational results\nPartner with agile lead to adopt and continually improve agile practicesRequired Qualifications, Capabilities and skillsAcademic Qualification: Minimum Bachelor’s Degree \n5+ years of digital product or project management or relevant experience in Infrastructure Authentication, identity management, and/or fraud mitigation\nPlatform systems and operations for large scale enterprises\nStrong Product orientation with experience in defining and building out product roadmap and business models\nStrong experience in cross location agile product development techniques and practices\nAbility to map business processes and identify requirements from those processes\nStructured thinker, effective communicator with excellent written communication skillsPreferred Qualifications, Capabilities and skillsExpertise in AWS, Cloud, Snowflake, DataBricks, Python, Alteryx, or similar data engineering and analytics tools a plus\nProficient in Tools: MS Office Suite, JIRAJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}