{"Job ID": "69875709", "Description": "About the Company:In Alfa Laval, we are every single day contributing to a more sustainable future for our planet through engineering innovation. Our global team designs and implements the refining, recycling and purifying process that allow our customers to be better themselves. You will find our work in leading applications for water purification, clean energy, food production, waste processing, pharmaceutical development and much more. The people of Alfa Laval enjoy the freedom to pursue ideas and the resources to see those ideas to become reality, in an environment that welcomes drive, courage and diversity. The result is a company where we all can be very proud of what we do.Join us as our Business Controller to advance and learn alongside accomplished business leaders to help customers around the world to optimize their processes and enable growth!Our core competencies are in the areas of heat transfer separation, and fluid handling. We are dedicated to optimizing the performance of our customers' processes. our world-class technologies, our systems, equipment and services must create solutions that help our customers stay ahead.Please feel free to peruse our website www.alfalaval.comThe position / About the Job:The position acts as finance partner for E&S, FOS (projects business) and Service Operations. Service operations includes field service and service centres.  It is an individual contributor role, working closely with various stakeholders across functions and businesses to track and improve business performance and to maintain financial discipline.The position is responsible overall performance, financial discipline and management analysis within the area of responsibility. Some key areas are as follows:Projects businessProject Controlling, Governance, and Internal Control:Collaborate with key stakeholders such as Project Manager, Business Head, Business Controller, Credit Control, Sourcing department and supply chain etc. to drive key project financial performance parameters.Conduct comprehensive review of projects and risk assessment, covering assessment of liabilities, ageing of contracts, cost incurred and cost to complete, inventory at hand, accounts receivable, adequacy of provisions, unbilled / unearned revenue, margin exposure.Actively engage with business, legal and project costing team during contract negotiation. Ensure contractual terms dictate + cover for open exposures. Ensure appropriate level of contingencies are built and costing is sharp. Large and long-term contracts cash flows are evaluated. Permanent Establishment cases are highlighted.Prepare business cases. Support and challenge the project team on new business opportunities and assumptions.Ensure internal policies are structured and respective departments adhere to it / follow it. Internal control gaps, if any, are identified and escalated with appropriate solutions.Challenge the status quo to identify inadequate business processes and recommend improvement to obtain efficiency.Drive consistency, standardization and efficiency amongst common outcomes/objectives across business and team.Ensure customer invoicing is raised as per compliance and milestones. Hours booked are reconciled with invoiced hours. Unbilled provision is taken against to be invoiced hours.Project Revenue Recognition (POC) reporting and financial performance P1 responsibility:Prepare monthly workings of project unbilled/unearned and revenue recognition workings following IND AS115 and internal accounting guidelines (MISAL compliance).Support reporting team in preparation of Engineering and Supply organization financial statements (P3E and P3A). Perform and complete analysis of financial result, drawing out key drivers and insights.Preparation, analysis, and presentation of month end financial performance. Communicate issues and pre-warnings of any major gaps to financial commitment.Annual Costing Update and Financial Forecasting:Work with Global + Local business controllers and delivery team to establish the labor rates and material overhead recovery rate on annual basis. Maintain overhead recovery model.Monitor actual and proposed adjustment to rate workings rates if necessary.Support Business Controller in forecasting order booking, Net Invoicing, Margin, working capital, P1, P1A, P3E and P3A. This demands a rigorous engagement with delivery teams, business managers, Sourcing team and Global controllers. 90% accuracy KPI to be maintained.Service OperationsIndependent responsibility of handling all Controlling activities including, Investment analysis, Variance Statement, impact of legal and structural changes within the company, simulating results under various scenarios. Costing update and forecasting for Service operation Reporting Costing update and Forecast in MRS Review Monthly, quarterly and annual reporting for Service Operations (P3) prior to upload in MRS Collaboration with Service Managers on monitoring and improving performance Cost monitoring and suggestions on savings Demand Planning meeting Quarterly reviews of Inventory, analyzing fast, slow and non-moving inventory Monthly, Quarterly review for warranty and claims. Sporadic reviews for Capex, preparation of CBA for major investments Aligning inventory, capex policies to new structural changes. Review for Service hours booked, sales not recognized. Supporting external as well as internal Audits Help reporting and Split common allocation costs within Service operations Driving Capacity expansion & competitiveness projectsWho you are -As an Business Controller to work in the areas responsible for payments to Suppliers. Direct & Indirect Taxes and Duties as per company policy. Proper recording of expenses through invoice booking and provisions.What you can be –Finance professional (CA/CS/CWA/MBA) with good experience in business partnering\n3-5 years of work experience. Experience involving project accounting and controls related to projects is preferred.\nExperience with a manufacturing organization required.Personal AttributesA go-getter, taking initiative to identify and drive various initiatives.\nAbility to work in sync with multiple stakeholders.\nAbility to constructively challenge business colleagues.\nAbility to form and assertively put forward a point of view.\nAn eye for detail\nWork independently with minimal supervisionLocation -Pune.Why should you applyWe offer you an interesting and challenging position in an open and friendly environment where we help each other to develop and create value for our customers.\nExciting place to build a global network with different nationalities to mingle and to learn.\nYour work will have a true impact on Alfa Laval’s future success, you will be learning new things every day.Interested? Please apply for the position.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}