{
    "Job ID": "69875607",
    "Description": "Order Taker, In Room Dining \n(8626)At Atlantis, we exist to bring the extraordinary to every holiday and experience through connection, empowerment, precision, care and warmth. Inspired by the majesty and mystery of the ocean, Atlantis resorts are unique destinations full of life, wonder and surprise, where we seek to exceed our guests’ expectations at every possible turn. Atlantis, The Royal will forever change the landscape of Dubai. Crafted by the world’s leading designers, architects and artists, this iconic destination will offer extraordinary stays, dining, attractions and entertainment. The world is yet to experience anything like it. With a sense of exhilaration and discovery, we create unforgettable memories by providing guests the opportunity to discover an extraordinary world filled with thrilling adventures. Whether we are designing a couple’s retreat or serving the extraordinary in one of our award-winning celebrity chef restaurants, we approach everything with imagination to spark a sense of courage, inspiration and innovation. This is not simply our job, it’s our passion.About The Role We are on the lookout for a talented and motivated individual to join our Food and Beverage Team. If you are comfortable talking and engaging with guests over the telephone? Are you passionate about food and beverage and giving a unique first-class F&B Experience? If you possess these skills, we have the perfect job for you, at Atlantis, The Royal.As an Order Taker, In Room Dining, you will be responsible for taking the guest orders over the phone and delivering an exceptional standard of service. You will be working closely with both kitchen and service team, making sure that sanitation and safety standards are always followed and maintained. It is also essential that you have full knowledge of the food and beverage menu.An Order taker, In Room Dining should be patient when dealing with guests, always maintain a positive attitude have a good knowledge of Micros, pay attention to details, passionate about customer service.About YouThe ideal candidate will have 1-year experience in a similar role with a proven track record of working in an international hotel. Exposure in high volume operations is desired. The successful candidate must possess excellent communication skills, be a team player, manage multiple tasks and have confidence in dealing with a diverse set of clienteles.Atlantis Dubai is an iconic entertainment destination comprised of two world-class resorts; Atlantis, The Palm and Atlantis, The Royal; offering an unbeatable opportunity for you to grow and develop in your career.Join a team that is adventurous, creative, warm-hearted and extroverted. We believe in making our guests happy beyond anything they have ever imagined. We wow them at every turn and create memories that will last a lifetime. You will be at the heart of this vision, to constantly innovate to deliver Amazing Experiences and Everlasting Memories.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}