{
    "Job ID": "69873996",
    "Description": "Who are we and What do we do?&nbsp;InMobi is a global provider of enterprise platform for marketers. Our platforms help Marketers reach nearly 1.56 billion unique users through mobile to help them engage, acquire, re-engage, re-market and retain valuable users. InMobi is also India’s first unicorn and one of the only profitable global tech-product companies to emerge out of India.&nbsp;At 20+ offices across the globe, InMobi employs over 1000 personnel constituting 25 nationalities. Acclaimed for its culture, InMobi has consecutively featured on the Great Places to Work (GPTW) list, with a consistent hold in the Top 50 position for the past two years. Moreover, these accolades are not just restricted to India, InMobi has also secured a ranking on the GPTW’s 2017 China List, a notable feat for an Indian startup.&nbsp;&nbsp;InMobi has also regularly featured on world disruptor lists&nbsp;–&nbsp;MIT Technology Review’s 2013 50 Disruptive Companies; Fast Company’s Most Innovative Companies for 2016, 2018; CNBC’s Disruptor 50 list of 2018, here InMobi was selected amongst a pool of more than 980 forward-thinking and ambitiou private companies across the globe, we now share this space with the likes of SpaceX, Airbnb, Uber and so on.&nbsp;What’s the InMobi family like?&nbsp;&nbsp;&nbsp;We are an infectious bunch. Be it the way we rise up to challenges, the cutting edge products we create, the dreams we chase or the fun we have at work. We are sure that if you meet us, you will be infected too. Today, we are proud to be the leaders in Mobile advertising and are on an accelerated path of being a leader in enterprise software for marketers. We invite you to free yourself, dream big and chase your passion. We are here today because a few of us did just that.&nbsp;&nbsp;What can we promise?&nbsp;&nbsp;We offer you an opportunity to work on building enterprise platforms that require you to acquire, hone and demonstrate your engineering skills in designing and solving for complex problems, thereby creating software that creates value for our customers in a very reliable, scalable, secure and AI-first manner. At InMobi, you get to work on cutting-edge technologies, work closely with business teams and grow as an overall technology leader.&nbsp;Modern work environment, flexible schedule and smart, creative, down-to-earth people. Internal opportunities to move roles and try out bridge assignments with different teams.&nbsp; Food for your soul – free meals all days of the week, gym or Yoga class to flex those biceps, cocktails at drink cart Thursdays and fun at work on Funky Fridays. We even promise to let you bring your kids and pets to work.&nbsp;What do the team do?&nbsp;\nWorking with some of the largest apps in the world Meson is an alternative mediation platform solving the challenges other platforms cannot. We’ve developed Mediation-as-a-Service; a unique blend of functionality, transparency, and control for app publishers.&nbsp;What will you be doing?&nbsp;We're looking for a Product Designer to join our team and deliver beautiful and practical UX and UI designs.&nbsp;&nbsp;&nbsp;Here are some examples of the kind of thing you'd be doing day-to-day:&nbsp;Designing beautiful and accessible user interfaces for web and mobile apps\nDrawing up wireframes and user flows, and creating interactive prototypes to test them with target users\nPlanning and facilitating client workshops, user interviews and discovery activities to understand how we can best meet user needs\nCollaborating with developers to ensure that designs are implemented to a high standard\nWorking directly with clients to understand business requirements and help shape the future of their products\nPresenting things you've learned back to the team as part of our weekly team chat\nRepresenting the design team at Meson.ai in meetings with potential clients&nbsp;&nbsp;What we're looking for&nbsp;&nbsp;We hire people who are considerate, enthusiastic, and really care about having a positive impact on the people who use the products we design and build.&nbsp;&nbsp;What are we looking for?&nbsp;Have at least 1-3 years experience in an agency or tech startup environment\nHave an excellent understanding of user-centered design principles and their real world applications\nHave practical experience designing complex digital products with Figma, Sketch, Adobe XD or similar\nCommunicate their design decisions in a clear and efficient way, both on calls and in writing\nCare deeply about producing designs that have a positive impact on users\nHave tons of initiative and a good eye for detail\nAre interested in mentoring junior team members and helping to improve their skills\nAre always learning and challenging their own thinking&nbsp;&nbsp;We know our team isn't diverse enough at the moment and we're actively trying to change this. No matter who you are, if you're a good fit for the role we want to hear from you.&nbsp;&nbsp;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}