{"Job ID": "69876262", "Description": "About VERITASVeritas Technologies solves what no one else can. As the leader in secure multi-cloud data management, over 80,000 customers – including 91% of the Fortune 100 – rely on Veritas to help ensure the protection, recoverability, and compliance of their data.Veritas has a reputation for reliability at scale, which delivers the resilience its customers need against the disruptions threatened by cyberattacks, like ransomware. No other vendor is able to match Veritas’ ability to execute, with support for 800+ data sources, 100+ operating systems, 1,400+ storage targets and 60+ clouds through a single, unified approach. Powered by Cloud Scale Technology, Veritas is delivering today on its strategy for Autonomous Data Management that reduces operational overhead while delivering greater value. Learn more at Veritas.com.The Data Protection Group drives the product strategy, roadmap, and engineering delivery of the Veritas products, which includes NetBackup, APTARE,  Backup Exec, Enterprise Vault (EV), EV.cloud, eDiscovery platform, and Veritas SaaS Backup.Responsibilities:We are looking for candidates who have experience with file systems, storage and cloud technology for data protection solution. You should also have an eye for great design and a knack for pushing projects from conception all the way to customers.In this role, you will collaborate to design and develop data protection solutions using the latest technologies. You will own product quality and overall customer experience.You will also propose technical solutions to product/service problems while refining, designing and implementing software components in line with technical requirements.The Sr. Software Engineer will productively work in a highly collaborative agile team, coach junior team members, actively participate in knowledge sharing all while communicating across teams in a multinational environment.Minimum Required Skills include:MS/BS in Computer Science/Computer Engineering or related field of study with 5+ years of relevant experience\nFull understanding of file systems, storage and cloud technologies, emerging standards and engineering best practices\nStrong communication skills, both oral and written\nDesigns, develops and maintains high quality code for product components, focusing on implementation.\nMastery in automation languages such as Perl or Python\nProficient in API fundamentals and best practices\nKnowledge of code coverage tools, reports and how to use them to produce a bug free code.\nExperience in Agile development methodologies including unit testing and TDD (test-driven development)\nSkills with Office Application Suite Microsoft Access, Excel, Word, PowerPoint and Visio, both in use and automation\nKnowledge of databases and SQL\nKnowledge of operating Systems: LINUX/UNIX· Object Oriented Language· Agile Process\nStrong problem solving and organizational skillsDesired Skills include:Solid knowledge of algorithms and design patterns\nKnowledge and experience with OpenStack/K8S/AWS/Hadoop/Cassandra\nWorking knowledge of delivering into cloud based environments using standard CI/CD tools (Jenkins, Artifactory, Spinnaker, SonarQube) and best practices\nKnowledge of cloud IaaS/PaaS and Microservices design a plus\nAbility to collaborate with various teams to implement innovative and viable solutions for commercial product and internal tool user interfaces\nAbility to communicate and collaborate among cross-functional teams in a multinational environmentAt Veritas, we care about the causes close to your heart and enable you to volunteer, donate, and do good. If you only meet some of the asks for this role, that's OK! We value a diverse range of backgrounds and ideas and believe a more diverse and inclusive workforce makes a winning team. If you have the curiosity to learn and appetite to teach what you know, we encourage you to apply. Come as you are! Interested? Apply and find out more about #TeamVeritas!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}