{"Job ID": "69875698", "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:To cover the purpose of the role or/& how this role would add value example: Principal Engineer, IB/MB Support is responsible for the delivery of the features related to FAB Mobile & Internet banking (both scrum delivery by service team or project & program delivery) that have interdependency amongst Services (within a Domain), other service lines and vendors. They make sure that requirements on the service squads’ backlog are prioritized and worked upon for timely implementation.Key Accountabilities:Generic AccountabilityPrincipal Engineer as part of the Service\nIdeally through experience you will enhance your skills across multiple specialisationsJob Context:Specific Accountability (what is the day to day responsibilities)Works across multiple Service Delivery Teams\nSpecialisation:\nSoftware Development\nTest\nSupport\nNetwork\nSecurity\nApplication\nPlatform\nDevOps\nCloud\nData\nDatabase\nInfrastructure10-15 Years of Experience in SDLC or Service Management\nHas 2 years’ experience in in Digital Transformation and Agile Ways of Working\nFunctions effectively as a Team Leader. Drives best practices inside and outside of organization.\nSolves problems with high ambiguity\nEffectively estimates time to implement design.\nThinks in terms of architecture as well as code.\nConsistently makes systems simpler. Improves system interaction\nSpends time reviewing code, configuration, and design, providing value-added feedback\nSuccessfully launches projects of significant impact. Balances technology with business value\nMentors and guides Engineering or service Management Teams, in aspects of the engineering specialization or service management, monitoring, reporting, quality procedures, and timely execution of deliverables\nEnsures technical debt is controlled and managed\nPerforms, assists and coaches on coding, scripting, automating, testing and technical design related best practices / principles\nAnalyses and guides the delivery team on E2E solution hosting and technical aspects of the platform\nStrong technical background with key focus on automation\nProven track record of manual testing transformation to automation\nProven track record of driving uplift in an organization’s engineering practice, highly visible in the internal engineering community\nAble to attract external talentJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}