{"Job ID": "69873784", "Description": "Department: Global Finance GBSDo you have sense of urgency, ability to manage and prioritise multiple work requirement to meet deadlines? Are you flexible and enthusiastic to go beyond the given instructions to create business value? If so, Novo Nordisk awaits your application as a Power BI Developer. Apply today and join us for a life-changing career.About the departmentGlobal Finance GBS Bangalore was established in 2007, is currently responsible for supporting Accounting, Finance & Procurement, Financial Planning & Analysis (FP&A) for Headquarters, region Europe, North America, International Operations (IO) & GBS Bangalore. The main purpose of our existence is to provide superior service to our stakeholders consistently and add value to the processes in terms of standardization and efficiency.The PositionAs a Power BI Developer in BI COE team, Finance GBS FP&A team you will participate in financial system operational activities in Novo Nordisk with a close link to Product supply in Headquarter based in Denmark. Our aim in Corporate Finance is to be the best finance operation in the global pharma industry.Main focus areas are corporate financial BI visualization applications which are used to financial reporting and business decisions. In this role, you will work as an integrated part of the BI and Analytics team for Product supply with close collaboration across India and Denmark. Your individual contribution to the team will be critical in driving the upscaling of BI and Analytics within Finance in Novo Nordisk. Furthermore, you will ensure superior customer satisfaction by delivering high end quality support to the front office in Headquarter.Providing Business Solutions for reporting and analysis Power BI and Power Platform tools. Enhance and optimize existing solutions with the aim of 100% automation and superior user satisfaction.\nCo-develop new innovative solutions for the finance community using latest technologies. Performing rigorous detailed analysis, resolution of issues and data quality check.\nPreparing test cases and executing the test cases. Ensuring the quality of the solutions provided to the Stakeholders and adhering to the project plan.\nEnsuring to keep the Stakeholders updated on the project. Assisting in user acceptance test, troubleshooting and end-user support.\nDocumentation on technical specification, user guidelines and provide end-user trainings. Drive innovative initiatives across projects and share best practices.QualificationsTechnical Qualifications (minimum requirements):Advanced knowledge of Power BI and MS Power Platforms.\nSolid experience covering specification, design, development or implementation of PBI Solutions.\nStrong User experience skills and able to provide right advice to the business.\nProficient on working with complex data models and different schemas.\nExperience in SQL, relational databases and dimensional modelling.\nGood experience with application management and support processes.\nMust be well versed in managing projects in the agile methodology.Additional criteria:Microsoft certification of PL-400, PL-200 or PL-300.\nExperience with Alteryx.\nExperience with Alteryx DVW connector.\nExperience with SAP BW and queries.\nExperience with Pharmaceutical sales data.Personal Qualifications:Strong communication skills – effective verbal and written communication skills in English..\nMust be self-managed, responsive and dedicated to customer support\nQuick learner and pro-active in developing new skills and sparring with the team.Working at Novo NordiskWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.ContactTo submit your application, please upload your CV online (click on Apply and follow the instructions).Deadline28th Sep, 2023   We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}