{
    "Job ID": "69875702",
    "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob DescriptionAnalyse and report unit cost and inventory movements.\nSupport agro and factory operation in terms of costing and inventory.\nAnalyse and report costing accounts.\nMaking necessary accounting adjustments.\nSupport the MIS area with the implementation of cost drivers in order to ensure the correct cost allocation in the products.\nIdentify opportunities in the production to improve the cost efficiency, intermediating the interaction between the MIS and other areas such as Commercial, S&OP, logistics, etc\nWork in close relationship with external and internal auditors.\nAdditional controller duties if necessary.Desirable requirementsGraduated from the Faculty of Economics and Administrative Sciences of the Universities or from the Departments of Industrial Engineering, Management Engineering, Mathematics\nMinimum 1 years of experience in Finance, Accounting or Controlling or related areas,\nFluency in English both written and verbally,\nGood communication skills and a team player,\nStrategic thinker with analytical skills, high achievement drive and ability of taking initiative\nSelf-motivated,\nHigh reporting ability,\nStrong MS Excel and Power point skills,\nLiving in Bandırma or willing to live in Bandırma.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}