{
    "Job ID": "69873069",
    "Description": "About Builder.aiWe’re on a mission to make app building so easy everyone can do it – regardless of their background, tech knowledge or budget. We’ve already helped thousands of entrepreneurs, small businesses and even global brands, like the BBC, Makro and Pepsi achieve their software goals and we’ve only just started.Builder.ai was voted as one of 2023’s ‘Most Innovative Companies in AI’ by Fast Company, and won Europas 2022 ‘Scaleup of the Year’. Our team has grown to over 800 people across the world and our recent announcement of $250m Series D funding (and partnership with Microsoft) means there’s never been a more exciting time to become a Builder.Life at Builder.aiAt Builder.ai we encourage you to experiment! Each role at Builder has unlimited opportunities to learn, progress and challenge the status quo. We want you to help us become even better at supporting our customers and take AI app building to new heights.Our global team is diverse, collaborative and exceptionally talented. We hire people for their differences but all unite with our shared belief in Builder’s HEARTT values: (Heart, Entrepreneurship, Accountability, Respect, Trust and Transparency) and a let’s-get-stuff-done attitude.In return for your skills and commitment, we offer a range of great perks, from hybrid working and a variable annual bonus, to employee stock options, generous paid leave, and trips abroad #WhatWillYouBuilding with finance folks to invent new business models. #WhatWouldYouBuildWhat we are looking forWe are looking for an experienced Financial Systems Manager to lead the implementation, and improvement of our core financial systems as well as enhancing our reporting capabilities. This is a key role involved in planning, testing and implementing major changes and updates to the various financial systems used across the organisation. This role will provide finance systems support for various functions within the organisation and responsible for core elements of the month-end close process.Why we need this roleTo drive the inegrations and maintenance of our finance systems and ensure these are set up to perform at an optimum level (NetSuite, Billing, Expenses, Payment Processing, Vendor Management, Approvals, etc.)Why you should joinThe successful candidate will be working closely with the Finance leadership team to contribute towards shaping the structure of our financial systems. If you are someone who likes to lead projects and want to be at the intersection of finance, systems, data and growth, you will love this role.What will you be doingWorking as a systems finance subject matter expert supporting steady state processes and changes in financial systems and processes\nImplement and improve critical financial systems that support our core business processes\nMonth-end processes and systems support; including creation of monthly reports required by management, monitoring system behaviour and key posting processes\nMaintenance of finance systems including master data, query resolution\nEvolve reporting capabilities, dashboards and KPIs\nDrive continuous improvement and Business Process Improvement (\"BPI\") initiatives throughout Finance and the wider organizationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}