{
    "Job ID": "69873785",
    "Description": "Department: Procurement GBSDo you have a strong business acumen & good understanding on the procurement value chain? Can you work and communicate effectively with people from different cultures and at different organisational levels? If yes, Novo Nordisk is waiting for your application as Sr. Associate- Procurement. Apply Today.About the departmentProcurement GBS is the offshoring unit of Global Procurement and is part of Finance GBS Bangalore. The Digital Procurement team in Procurement GBS is overall responsible for managing end user support for our Global Procurement and provide superior service to our stakeholders consistently and add value to the processes in terms of Coupa Support such as sourcing, purchasing, contracting, supplier modules and other BI activities.The positionAs a Senior Associate, you will primarily be responsible for handling Coupa system administration and end user support (Purchasing and Contracting module) across Novo Nordisk globally. Key responsibilities cover managing the Coupa related queries in CRM, review & approval of system accesses, supporting/guiding the end-users on relevant access, procurement workflow, supplier onboarding/change requests, purchasing policies, contract related queries and phone support. You will have frequent interactions with both internal and external stakeholders globally, and the role requires excellent written and verbal communication skills. You will proactively manage the daily operations tasks with speed & agility while having a quality-oriented mindset. Your tasks will also include effective collaboration with project team & IT system support & vendor management team.You will handle end user queries, provide appropriate solutions and alternatives, plus proactively follow up to ensure the resolution. You will build sustainable relationships and trust with end users through open and interactive communication. Drive continuous improvement and challenge status quo. You are expected to have a good flair for systems, strong business understanding, customer centric mindset, and most of all a natural curiosity in wanting to understand, learn and improve how we support our global stakeholders in the best possible way. You will be responsible to adhere to the purchasing guidelines and processes and being proactive in communicating/highlighting any deviations or non-conformance.Responsible for Coupa system administration and end user support through phone and email (Purchasing & Contract module).\nManaging end-user queries on Coupa system functionalities, process workflow, access review & approvals, purchasing policies & compliance, contracts navigation.\nEnsure high customer satisfaction through First Time Right (FTR) resolution with high quality deliverables.\nSolve transactional issues related to data quality (i.e. cancel PO, perform GR, contract modification, access, etc.).\nAssist technical support function in solving complex issues that may have combined root cause.Qualifications:You hold a bachelor’s/master’s degree from a reputed university (preferably in business administration/supply chain/IT). Excellent academic track record and grades.\nYou have 2-5 year of experience in procurement system administration and support (e.g., Coupa, Ariba other ERPs/purchase to pay (P2P) systems) or equivalent experience in customer tech support (preferably procurement/supply chain products/services) from an offshoring setup, specifically in working with business units outside India.\nYou should possess strong inter-personal skills including excellent communication skills (oral and written English), stakeholder management, basic MS office knowledge, collaborative working, flexible to support under different time zones.Working at Novo Nordisk          At Novo Nordisk, we don’t wait for change. We drive it. We’re a dynamic company in an even more dynamic industry, and we know that what got us to where we are today is not necessarily what will make us successful in the future. We embrace the spirit of experimentation, striving for excellence without fixating on perfection. We never shy away from opportunities to develop, we seize them. From research and development, through to manufacturing, marketing and sales – we’re all working to move the needle on patient care.ContactTo submit your application, please upload your CV online (click on Apply and follow the instructions).Deadline24th Sep 2023We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}