{"Job ID": "69873799", "Description": "S&P Global Commodity InsightsThe Role: Consultant , Chemical ConsultingThe Team: You are part of a global dynamic chemical consulting team. Fast paced, with ever expanding new ways of creating and advising chemical producers, governments, financial institutions and technology providers operating at any point along the chemical value chain, from commodity to specialty chemicals. With in-house expertise spanning across the value chain and markets, our team are uniquely equipped to deliver bespoke projects that meet each customer's individual requirements.The Impact: The consultant will be responsible for support execution of project engagements across a wide spectrum of potential activities.  The job will require the ability to manage complex analytically based tasks simultaneously while ensuring a high standard of quality.What’s in it for you: We are looking for a dynamic team member who is eager to rapidly learn and develop high levels of analytical and data management skills to source and interpret data combined with generating and communicating high-quality insight into future trends. This person will have the opportunity to increase their analytical skills and knowledge by interacting with industry experts within the organization, helping to form a consistent and comprehensive view of the petrochemical, and commodity markets.Responsibilities:Maintain general knowledge of petrochemical market for interaction with project managers and occasionally, clients.\nSupport execution of project proposals requested by clients. Capable of independent work to support project delivery. \nPossess and demonstrate clear communications skills and analytical creativity to determine and develop deliverables that best serves client needs and budget. \nExpected to have excellent analytical skills to support requirements of projects he/she leads or supports.  Be an expert in building and using models to satisfy unique project requests. \nUnderstand, use, improve and develop competitive assessment tools and economic modeling tools.  Actively pursue and develop unique analytical approaches that provide value to S&P clients and/or potential clients.  Execute or support execution of projects using these tools and other unique analytical approaches.\nMaintain a fundamental working knowledge of the basic S&P databases and tools.\nPrepare written reports or presentations following S&P standards.  Be capable of summarizing project information for clear presentation of results and conclusions to clients.  Interface with client, if necessary, in the presentation of the final results.\nEnsure consistency of complex model assumptions with econometric model assumptions where appropriate.\nSupport maintenance and improvement of financial and economic models.  Develop and improve cash flow models used for financial analysis.  Use financial and economic models to support valuation analysis.What We’re Looking For:High degree of data management\nA conceptual understanding of the chemicals business.\nHighly proficient in Microsoft Office Programs (Excel, Word, PowerPoint)\nPersonable interface at multiple levels within a client’s organization.\nCooperatively work across S&P at multi levels to efficiently and effectively utilize the resources and knowledge base available in a team approach. \nCommunicating internationally with consultants in other world regions in multiple time zones effectively.\nExcellent written communication skills.\nAbility to travel (Including international travel)Grade/Level (relevant for internal applicants only): 9The Location: Gurugram, IndiaAbout Company Statement:S&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.S&P Global Commodity Insights enables organizations to create long-term, sustainable value with data and insights for a complete view on the global energy and commodities markets.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}