{
    "Job ID": "69872746",
    "Description": "Brand Overview:Since 1974, ibis has been a trailblazing brand, open and welcoming to all. ibis hotels are beloved by travelers and locals for their contemporary style, vibrant social hubs, rooms that feel like home, lively bars, satisfying dining options, and easy mobile check-in experience. The brand is known for its passion for live music, offering guests playlists curated for every mood and access to exclusive gigs with up-and-coming musicians. No matter where in the world a guest may travel, ibis always feels like the right place to be. With over 2,500 hotels in 70+ countries, ibis family is recognized across the globe as the leading brand in economy hospitality. ibis is part of Accor, a world leading hospitality group counting over 5,500+ properties throughout more than 110 countries, and a participating brand in ALL - Accor Live Limitless – a lifestyle loyalty program providing access to a wide variety of rewards, services and experiences.India Story:In India we have 22 hotels in 14 cities- New Delhi, Gurgaon, Jaipur, 3 in Mumbai, Thane, 3 in Chennai, 4 in Bangalore, 2 in Pune, Kochi, Coimbatore, Kolkata, Nashik, Hyderabad and ibis styles in Goa.ibis New Delhi Aerocity:ibis Delhi Aerocity is the flagship of ibis in India contributing with 445 rooms to the largest inventory of Accor in Aerocity area and is the third largest ibis hotel in the world. It is located next to India’s busiest international Airport with the Airport express metro at walking distance. We match our vibes with our guests to create inclusive and uplifting experiences. So we welcome you to the Vibe Headquarters.We at ibis India areOpenAlways friendly, inclusive, and approachableYoungYoung at heart is the key. After all, age is just a numberFlexibleGoing out of our way to accommodate and delightEnergeticEnthusiasm for always learning and evolvingPrimary ResponsibilitiesSales ManagementAchieve daily targeted number of sales calls with effectivenessDevelop business leads for the Hotel on a weekly basisPrepare monthly list of accounts to penetrate for the following monthPlan a minimum of 2 site inspections/entertainment meetings per week to qualified potential accounts or new accountsPrepare monthly action plan for main market segmentPerform monthly review account profile on room nights production and average rateMonitor competitors’ rate strategy, account penetration and marketing activities to maintain a competitive edgeFully responsible of accounts under his/her management , including contracting, updating profile and renewing contractsUpdate management on VIP arrivals, meet and greet accordinglyUp-sell, cross-sell and promote Hotel facilities & services at every available opportunity in order to maximize sales revenueConduct negotiations to achieve the best profit and rates for the HotelAttend hotel clients and local community business events to network and maintain high visibilityUpdate Director of Sales & Marketing on market trends and business leads\n Knowledge and ExperienceDiploma in Tourism / Hospitality Management\nMinimum of 2 years of experience in a similar capacity with proven track records\nExcellent reading, writing and oral proficiency in English languageProficient in MS Excel, Word, & PowerPointJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}