{
    "Job ID": "69875575",
    "Description": "IT Business Partner is a senior role that aims at improving the strategic alignment between business and IT, and ensure that the IT services are provided to produce the intended business outcomes. This role focuses on three key areas of IT Service Management – Business Relationship Management, Strategically aligned demand management and Service Level Management & Reporting.IT Business Partner aligns the IT roadmap with business objectives, works with business to secure the necessary funds, and manages the relationship with the business as the roadmap is executed by different functions within IT. IT Business Partner also works with Business Analysts in selecting and sourcing appropriate IT solutions in line with changing business needs and technology landscape.Job Responsibilities:Responsible for the development and implementation of solution roadmaps and to ensure successful introductions across the organization and with customers. Partner with key staff members to create strategic business plans.\nDevelop productive relationships with business leaders across the organization to influence how applications can enable new sources of value.\nCollaborate with management to develop annual budgets for respective business areas. Create and analyse relevant information and develop recommendations that they present to senior management.\nDevelop solution concepts and business cases for new investments. Perform business analysis and prepare recommendations and business plans as needed.\nIdentify, screen and evaluate new solution opportunities to address unmet (internal and external) customer needs.\nAct as the key liaison across all functional areas, including business units, the information technology department, and outside vendors.\nAct as change manager to realize the added value of digital changes in the organization and thus leading and driving change management and digitalization projects.\nManage application group personnel, developing their skills and capabilities to meet the needs of the organization, as well as building on existing recruiting capabilities to address new needs and skills gaps.\nImplement and manage application life cycle management status reporting, metrics and benchmarks.\nManage relationships with major vendors and service providers to ensure they cost-effectively meet the needs of the organization.\nUtilize the appropriate technologies and ensure that customers have the solutions they need, when they need them, and in the media best suited to their requirements.\nOverseeing the application organization's successful delivery in partnership with business colleagues.\nOversee the launch of solutions and help to maximize the positive impact on the organization.\nOverseeing support activities in conjunction with infrastructure and operations to ensure the applications perform well in production.\nWorking with IT security team to ensure that the organization's applications are effectively secured and that risks are mitigated.\nEnsure Business Relationship Management and Demand Management processes are established and executed according to the company procedures\nDefining, monitoring and reporting performance and IT Service Levels to the business as per agreed SLAs\nDevelop and maintain healthy relationship with partners and vendors to ensure effective delivery and availability of external capacity on-demandReview IT risks along with Group IT Management, business units and other stakeholdersEducation and Professional Qualification:Master’s or equivalent in computer science and business management\nCertified in Project Management (PMP/Agile or equivalent), IT Service Management (ITIL) and IT Governance (COBIT, CGEIT, etc.)\nProduct certifications from major enterprise application vendors is desirableExperience:5+ years of experience in an IT Management role, working with business to strategize, plan and execute transformational initiatives\nMinimum of 10 years’ experience and/or exposure to design and implementation of enterprise applications including ERP/CRM systems, mobile applications, SaaS systems, bespoke applications, etc.\nExperience in application architecture, project management, software as a service (SaaS), opensource platform, automated software testing, data management/governance, business intelligence, security and/or business process analysis etc.\nProven domain knowledge and experience in one or more verticals – Automotive, Properties, Retail, Manufacturing, Logistics, Group Functions (Finance, HR, Procurement, etc.)Competencies:Possess strong analytical skills, including an understanding of business economics and financial resources.\nDemonstrated interpersonal and presentation skills and ability to deal with heads of business units on a regular basis\nMust have demonstrated leadership experience building cross-organizational consensus with exposure to technology providers and/or business clients.\nMust have demonstrated experience managing a high-performing, cohesive team.Should have experience in managing the risk and cost implications of IT contracts or contract negotiations and managing vendors.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}