{
    "Job ID": "69873377",
    "Description": "This is where you save and sustain livesAt Baxter, we are deeply connected by our mission. No matter your role at Baxter, your work makes a positive impact on people around the world. You'll feel a sense of purpose throughout the organization, as we know our work improves outcomes for millions of patients.Baxter's products and therapies are found in almost every hospital worldwide, in clinics and in the home. For over 85 years, we have pioneered significant medical innovations that transform healthcare.Together, we create a place where we are happy, successful and inspire each other. This is where you can do your best work.Join us at the intersection of saving and sustaining lives—where your purpose accelerates our mission.Summary:Responsible for  driving primary sales through product promotion in defined territory by meeting HCPs and para medical staff; Coordinating with commercial / purchase authorities and channel partners for ensuring supply and liquidation of products. Drive awareness and adoption through activations in his/her territory/accounts.Essential Duties and ResponsibilitiesStrategic Imperative:Drive awareness and adoption on intravenous (IV) solutions, Parenteral nutrition and drug delivery devices amongst Doctors  in the assigned territoriesPlanningMonthly account wise planning of secondary  sales leading to primary sales for their territory/accounts\nWeekly planning for coverage and calls\nMonthly/quarterly sales forecast for defined territory\nQuarterly activation planningExecutionDrives adherence to SFE processes :, Call average, customer coverage, working days, SME trackers, prescription tracker, secondary sales  and product sampling/demonstrations\nTo track all product and service quality related complaints and coordinate with National/Sales Manager/quality to ensure formal response and closure to complaints report it to PV & Quality\nCompetition & Market Mapping -- Track and gather market data, no. of indicated surgeries, gather and analyze competitor activities\nP5 Implementation – Implementation of Marketing strategy and activations as per defined GTM\nIdentify and drive business  development initiatives in his/her  current /new accounts including training and education of paramedical staff\nEnsure speedy  and adequate availability of products in his/her accountsFinancialAchievement of monthly secondary sales target revenue numbers (SFE)Non FinancialAlignment to P5 plan (Segmentation and Targeting) – Deviation from MCL and account plan (WIP)\nSME development – As per defined list (WIP)\nMarket Activations as per GTM  (SFE)BehavioralDrive for results\nPersuasive Communication\nData analysis and Problem solving skills\nMarket Orientation\nPlanning and Prioritization\nPeople ManagementFunctional:Consultative Selling skills\nProduct/Therapy/Competitor knowledge\nStrategic key account management\nNegotiation skills\nWork with marketing to drive execution of campaigns and activations\nGovt. and Corporate account sales target\nTerritory Performance\nAccount planning & performance\nActivation Plan\nSubject Matter Expert (SME) Management at account level\nPricing decisions at account level through competition mappingMission Critical Collaborators:Sales Manager\nMarketing\nBaxSol and Corp Account Sales TeamQualification:B Pharma/ BSc/ Btech with Masters in Management would be add on .Experience:7 plus years of experience desired in a reputed pharmaceutical/ Medical device/ Healthcare companies in Sales.Key Skills and Experience            Strategic Perspective Effectively organizes data to identify trends, problems, and their causes.Systematically evaluates opportunities and targets those with the greatest potential for producing positive results with the minimum amount of risk\nEffectively articulates new and different ways of thinking and doing business\nTranslates concepts and ideas into actionable plans\nAbility to resolve emerging issues using existing teams and/or an established network of expert consultants.\nDemonstrate capability for scientific, creative and strategic thinking, championing ideas for positions, and an ability to present and maintain fair-balance during scientific discussions\nStays confident when challenged, stating the rationale for one’s viewpoint clearly while listening to and respecting others right to different opinions\nInterpersonal Skills & Influence Adapts communication style to the audience in order to be heard\nEstablishes and maintains collegial peer-to-peer relationships with a wide range of external thought leaders including healthcare professionals.\nDemonstrates organizational awareness and experience working on cross functional teams\nInvests time in teamwork and developing collaborative relationships with other teams and individualsReasonable AccommodationsBaxter is committed to working with and providing reasonable accommodations to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application or interview process, please send an e-mail to Americas_TTA@baxter.com and let us know the nature of your request along with your contact information.Recruitment Fraud Notice\nBaxter has discovered incidents of employment scams, where fraudulent parties pose as Baxter employees, recruiters, or other agents, and engage with online job seekers in an attempt to steal personal and/or financial information. To learn how you can protect yourself, review our Recruitment Fraud Notice.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}