{
    "Job ID": "69873685",
    "Description": "About Graphics Designer, Marketing roleResponsibilities (not exhaustive)●   Translate design briefs from multiple teams into captivating visual solutions, encompassing both graphic and video elements.●   Create and edit videos, including motion graphics, product videos, social collaterals and other content, with a focus on quality and creativity.●   Manage brand integrity across social media and digital channels, thereby maintaining a consistent look and feel across multiple interactions with target audiences.●   Collaborate closely with team members to ensure designs effectively communicate the intended message and resonate with target audiences.●   Take ownership of projects, managing the entire design process from initial ideation to final delivery, minimizing the need for constant supervision.●   Prioritize and manage workload to meet project deadlines, ensuring a consistent balance between speed and quality.●   Collaborate with the remaining video creators and other relevant stakeholders to streamline and expedite the video production process.●   Be conversant with the latest graphics design tools, including those using AI capabilities.Education / skill set●   Excellent written and verbal communication skills●   Existing portfolio demonstrating visual design and motion graphics skills.●   Proficiency in graphic design tools, such as GIF Animation, Photoshop, and AdobeIllustrator.●   Good video editing skills.●  Ability to conceptualize based on design briefs. Good understanding of brand visual identity and ability to maintain brand integrity.●   Handling multiple projects in a fast-paced work environment.●   Cross-functional collaboration.Experience●   A creative and self-driven professional with minimum 5 years of experience. Bachelor's degree required. The ideal candidate will possess expertise in independently handling design requests from various teams and executing projects from concept to completion.Abilities and traits●   Design: This dimension will evaluate how you perform graphics design based on design briefs and execute a project from conceptualization to the end output. Ability to effectively use various graphics design tools and deliver design output in different formats is another requirement. Continuous improvement in terms of delivery using new graphics design tools and adherence to brand identity and integrity guidelines is an indicator of superior performance.●   Communication: This dimension evaluates the quality of your written and oral client communications, including email communications, formal written documents, oral presentations, meetings and discussions. An exceptional performance in this area means that your managers and peer group love to work with you and you are in control of the business workflow.About disprzDisprz is an exciting growth stage series C SaaS company in the learning and skilling tech space. Serving over 2 million + learners,It has established itself as a leading start-up in this space in emerging APAC, a fact confirmed by the Government of India's Atma Nirbhar App award (#1 in the eLearning category) and its enviable client list of 300+ customers in every continent of the world, which includes the leading household names such as Amazon, Bajaj Insurance, Tata Motors, Uber, Pidilite, Indian oil, PETRONAS, DG Sharaf, to name a few. Disprz has recently forayed into developed markets and enjoys product-market fit and is now ready to scale in the US, UK and ANZ markets as well. Disprz boasts of a great culture code that empowers teams, values work-life balance and encourages innovation and experimentation.If you are driven, curious, and passionate about tackling technical challenges and driving innovation forward, we believe that you would be a great fit for our team at Disprz.Why Join disprz? / What we offer for you ?Diversity & inclusion - to value the right skills and ambitions, no matter what your age, experience, nationality, gender is.Top decile package - Happens to come as an added perk as we recognize the great work you do.Well being programs - To ensure that you are healthy and happy at all timesGlobal exposure - As we are growing and disprzing our presence across the worldLife at disprz is... Fast-paced yet Balanced | Cutting edge yet Classic | Challenging yet FunA Sneak-Peek into our Culture -https://youtu.be/GYlPdgY_C40?feature=sharedlocation | Mumbai & BengaluruJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}