{
    "Job ID": "69873844",
    "Description": "Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Website to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\n\nJob Description: We are seeking a passionate, experienced and analytical business professional based in Egypt, with great attention to detail and ability to effectively prioritize and multi-task. The Retail Account Manager will be primarily responsible for: 1) managing vendors at scale across multiple Middle East countries (Egypt, Kingdom of Saudi Arabia, UAE) with help of tools and automation; 2) improving business terms and driving business growth for vendors at scale; 3) working closely with cross-category teams and drive operational improvements in vendor-management processes; and 4) own vendor communication and relationship to drive vendor self-sufficiency in long-term. The candidate should have experience in analyzing opportunities for systematic improvements in business management functions and building strong processes and SOPs to drive process-improvements. He/She should be comfortable managing multiple responsibilities within a fast-paced environment and preferably with experience in ecommerce.\nThe successful Retail Account Manager:\n- Manages day to day business relationship, and proactively and autonomously negotiates costs, promotional opportunities, and other business inputs with vendors.\n- Demonstrates excellent time-management skills and the ability to work independently knowledge while using departmental resources, policies and procedures.\n- Conducts vendor analysis and makes recommendations for initiatives that optimize for business growth. Maximizes Amazon’s business profitability and selection expansion opportunities.\n- Uses data to identify trends, opportunities and risks and translate those insights into actions to drive long-term growth.\n- Coordinate cross-functional teams, and communicate with internal and external stakeholders, while meeting tight deadlines.\n- Identifies opportunities for systematic process improvement and drives those improvements at scale.\nLanguage Requirements (English & Arabic)\n\nWe are open to hiring candidates to work out of one of the following locations:\nCairo, EGY\n- Bachelor's degree\n- Fluency in English and Arabic is essential\n- 2+ years of relevant experience in retail or business management (could include account management, category management, project management, financial analysis, etc.) with a proven history of delivering results\n- Experience in negotiations, pricing, or inventory management.\n- Proven experience leading cross-functional projects.\n- Proficiency with Excel and strong analytical acumen\n- Strong communication (verbal and written) and collaboration skills that enable you to earn trust at all levels\n- Business focused thinking, an ability to focus on key issues and a strong hands-on, results driven mentality\n- Bachelors’ degree with an MBA is a plus\n- Ability to think and react in a high-energy, fast-paced Experience in vendor negotiations, pricing and promotion, inventory management, and product development.\n- Experience with Excel, or other analytical/reporting tools.\n- Ability to operate simultaneously and effectively in both tactical and strategic modes.\n- A willingness to roll up sleeves to get things done.\n- Working in a start-up or early stage environment where you will be defining best practice for your function.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Project & Construction Planning",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}