{"Job ID": "69874209", "Description": "IntroductionYour Role and ResponsibilitiesWho you are:The position is for skilled test professionals to perform Testing integral to the IBM Power Servers running various Linux operating systems over a Hybrid cloud stack with real-world workloads. They will perform testing on the various features IBM is enabling for the Customers on different Power Servers and also on different Linux, RHEL, SLES flavours.What you’ll do:\nEmployees will be working closely with Development and Functional test organization in defining the test planning, scoping the valid scenarios for Line Items/Features. Employees will also work on troubleshooting and debugging customer field issues and incorporating test cases/updating existing test cases to further strengthen the test plan to maintain high product quality and customer satisfaction.\nTeamwork is expected to be of the highest quality.How we’ll help you grow:\nAs a System Test engineer, you will be performing a variety of tests that are integral to the IBM Power Servers running various Linux operating system over a Hybrid cloud stack with real-world workloads to ensure nothing remains untested and a stable product reaches the hands of the customer.\nYou will perform System test and be entirely responsible for delivery of kernel components. Design & perform stress and integration testing of variety of IBM power systems running Linux OS.You will work in an Agile and collaborative environment to understand requirements, design, code and test innovative applications for automation of test on large systems.\nYou will employ IBM’s Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability.\nYou will technically lead a team to design and work on deliverables, continuous integration of products\nYou will create and execute test plans and test cases that are clean, well-documented, and easy to use.\nYou will lead efforts towards innovative ways of testing.\nYou will verify the design and implementation of large-scale systems that enable continuous delivery.\nHave a good understanding of the operating system as well as hardware platform and the application workloads that are relevant in customer environments\nUnderstand the functioning of an integrated system across the SW and HW stack and various interfaces and interactions that leads to the System Test\nHave an eye for quality and ensure the product is thoroughly tested by innovatively creating scenarios to exercise the system and yet adhere to business timelines.\nYou should have good understanding of software test, development and programming languages especially oriented towards test automation, not necessarily GUI.Required Technical and Professional Expertise4-8 years of Industry experience\nSound knowledge of operating system internals (Linux/Unix )\nSound knowledge of System test skills, PowerVM functionalities.\nProficient programming skills (C, Shell scripting, python, Ansible etc.,)\nKnowledge of Testing Processes and Methodologies.\nProven debugging and problem-solving skills\nStrong team player with good communication and interpersonal skills\nProven ability to work effectively in a global team environment.Preferred Technical and Professional ExpertiseExperience of working with RHEL and SLES distros\nAI/ML skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}