{"Job ID": "69875566", "Description": "Micro Focus (now OpenText) is one of the world’s largest enterprise software providers. We deliver mission-critical technology and supporting services that help thousands of customers worldwide manage core IT elements of their business so they can run and transform—at the same time.The Opportunity:Responsible for providing technical support and/or leadership in the creation and delivery of technology solutions designed to meet customers’ business needs and, consequently, for understanding customers’ businesses. As trusted advisor create and maintain effective customer relationships to ensure customer satisfaction. Expert in Ops Bridge suite of products, like OMi /OBM 10 & Management pack & connectors.You are great at:Experience in deploying and integrating Micro Focus Ops Bridge suite of products independently and Standalone mode.\n\nExperience in Ops Bridge suite of products with in-depth hands-on experience of at least 2-3 products in Ops Bridge suite.\n\nOMi /OBM 10 & Management pack & connectors (Mandatory)\n\nOBR / Operations Bridge Analytics\n\nBVD\n\nUpgrading OM to OBM experiences\n\nConfiguring Integration with Ops B Suite and other Micro Focus Products\n\nConfiguring High Availability, SSL SSO for Ops Bridge Suite of Products\n\nConduct Product Knowledge Transfer Session to end customer.\n\nUnix (RHEL, SUSE, etc.)  and windows OS knowledge and experience\n\nStrong Perl /shell / Python/Groovy scripting skills\n\nCisco networks i.e. ability to make changes on router, configure firewall etc.\n\nDatabase knowledge - general SQL skills\n\nITSM v3/v4 foundation certificationWhat it takes:Good programming skills.\n\nGood trouble shooting skills.\n\nExcellent verbal and written English communication skills.\n\nExperience in working with other members at remote location (International).\n\nTime flexibility for meetings that may be conducted outside local business hours.\n\nDemonstrated technical documentation skills - technical documentation, solution design, release notes, user guides, test plans, test results summary document etc. Experience in creating Design document and Acceptance Test Plan.Micro Focus (now OpenText) is proud to be an  Equal Opportunity Employer.  Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}