{"Job ID": "69873370", "Description": "Company Profile:At Unilever you are more than your job title, you are part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us.We produce world-leading brands including Knorr, Dove, Axe, Hellmann’s and Omo, alongside trusted local names and innovative-forward thinking brands like Ben & Jerry’s, The Dollar Shave Club and Surf.Be part of the most successful purpose-led business in the world. Have the opportunity to see the true impact that you’re having in the work you do - every small thing counts.Main Job Purpose:The Process Engineer role is critical to the development of our factories to World Class, which means zero defects, zero waste and zero losses and to lead the change management role on projects, ensuring all inputs are available, factory is geared up for new innovations, VIP, product transfers, rollouts, recipe changes, line extension within an agreed time plan. you will apply extensively the full range of Focused Improvement and Quality and EEM pillar methods and tools to counter losses identified in the areas of Safety, Quality, Cost Deployment, Customer Service and Logistics and optimize the cost for projects. Roles & Responsibilities:Working directly with the line crews on a daily basis the Process Engineer also acts as the technical trainer for line teams and provides coaching in phenomena identification, root cause analysis and the establishment of countermeasures as well as involving them early on the projects. He/she is single point of contact for R&D and Cluster Engineering team regarding innovation, VIP and other projects.\nConduct technical risk assessments for projects. Prepare and execute factory trials, including budgeting, report results and develop process manuals. Supervise 1st productions and conduct relevant training for operators.\nResponsible for the validation of all process improvements and the establishment of revised basic conditions on the line. Eliminate losses and wastes.\nIncrease the stability of the line to support the transition of traditional line teams to semi-autonomous teams.\nEliminate Waste and Loss according to the WCM prioritization process using AM, PM, FI and QC pillar tools and methodologies.\nCreate Technical Standards to ensure process stability on the line.\nTrain line crews on technical standards and restoration of basic conditions (Stability sustainability).\nIdentify and extend good practice to other lines.\nApplication and accuracy of MMP Code data.\nNPDs, VIPs, recipe changes, product transfer and line extension projects OTIF and within budget; from technical feasibility assessment through capex preparation and technical installation to trials and first productions.\nProcess manuals and training for operatorsKey Competencies & Skills:3+ years of experience in similar role, preferably in FMCG industry.\nBachelor’s degree in Mechanical, Chemical, or Electrical Engineering.\nDemonstrate a strong technical knowledge from previous practice with evidence of elimination wastes and losses from production lines.  Must possess strong engineering leadership credentials with a proven ability to manage significant projects.\nAble to clearly understand operating principles and establish correct operating standards;\nAble to present findings and rationales clearly so that whole factory team can understand;\nAble to make logical decisions based on data;\nAble to manage stakeholders for projects\nExperience in statistics and process control tools.\nPassion for Growth\nTeam Commitment\nExcellent communication skills    Unilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}