{
    "Job ID": "69874777",
    "Description": "General DescriptionProvide account management to CSG EA IBI Gold customers. The Gold Technical Architect is a SME (Subject Matter Expert) that works closely with the customer on technical topics and issues. He or She works closely with the Gold Success Manager as well as the account team, product and engineering to identify needs and ensure commitments are met and maintains high levels of customer satisfaction for Gold customers and ensures yearly renewal of service.Reports to: Director, Gold ServicesBE in Information Technology, Computer Science or related.\nExperience – 3.5 to 9 yrs\nConcentration or certification in Networking & Security is a plus\nSuperior troubleshooting skills and demonstrated ability to quickly resolve complex technical issues, specifically involving any or all of the below aspects:\nConfiguration\nAuthentication\nApplication administration\nLogging\nNetworking\nMonitoring\nSuperior verbal and writing skills and demonstrated ability to articulate complex concepts\nExceptionally high attention to detail and demonstrated ability to deliver extremely high-quality knowledge to our customers.\nDemonstrated ability to manage a demanding workload.Good to HaveAuthentication (SSO, LDAP, AD, SAML, Kerberos, OpenID, X509, Siteminder,etc…)\nAcademic knowledge or hands on experience with at least one major OO programming language (Java, C, C++, C# .NET, Python etc…)\nAcademic knowledge or hands on experience with:\nRDBMS (Oracle, SQL Server, PostgreSQL)\nUnix/Linux\nApache Tomcat /IIS\nJavaScript\nHTML/CSS\nExperience with usage and administration of cloud platforms such as AWS, Azure, and GCP Demonstrated ability to handle demanding and difficult customers and their expectations.\nIntrinsic understanding of the Global Support Mission and Vision to deliver the highest level of Technical Support and Customer Satisfaction.\nDemonstrated ability to facilitate Zoom and/or conference calls\nDemonstrated skill at mentoring other support staff.Cloud Software Group is firmly committed to Equal Employment Opportunity (EEO) and to compliance with all federal, state and local laws that prohibit employment discrimination on the basis of age, race, color, gender, sexual orientation, gender identity, ethnicity, national origin, citizenship, religion, genetic carrier status, disability, pregnancy, childbirth or related medical conditions, marital status, protected veteran status, and other protected classifications.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}