{"Job ID": "69873498", "Description": "As a leader in consumer intelligence company, NIQ is one of the most trusted sources of BI for the world's top brands. The work we do makes a significant difference to how businesses and brands perform in markets around the world. At NIQ we all share a commitment to our core values of being simple, open and integrated in how we work — with each other, our partners, and our clients.   We are looking for experienced and passionate people to join our team in Chennai.  SIMPLY PUT:  This position is responsible for overseeing the day-to-day operations of a team (10 direct reports), ensuring that tasks are completed efficiently and effectively. You will also be responsible for setting goals, leading team meetings, and providing support and guidance to team members.  A Team Leader also acts as a liaison between the team and upper management, providing regular updates on progress and identifying areas for improvement.  CHALLENGES THAT AWAIT YOU: Plan, monitor and manage the team’s work  Facilitate the team focus on the on-time delivery of agreed deliverables \n\nEncourage full participation of team members within their defined roles and responsibilities \n\nEnsure that the delivery process is properly focused and controlled \n\nIdentify and advise the manager on any issues and risks associated with a work package.  \n\nSupport the implementation of new services & platforms  Partner with all RDDS teams and beyond to ensure SLAs, set expectations, and deliver client-specific KPIs (as required)   \n\nPartner with larger teams to contribute to the development and further improvement of internal and external KPIs through process standard improvement as well as work on production incidents and other areas for root cause identification and improvement plan development \n\nSupport dedicated team in day-to-day requests and escalations  \n\nSupport UAT and upgrade efforts via test planning, validation of staffing and status YOUR PROFILE: Previous supervisory experience required \n\nAbility to motivate staff and maintain a high enthusiasm among employees within the center \n\nKnowledge of employee training and its practices. Ability to recognize high performance and reward accomplishments.  \n\nProficiency in Microsoft Office applications. \n\nDemonstrated communication skills, both verbal and written \n\nEffective problem solving \n\nAbility and willingness to learn and drive improvement  Ability to work across multiple stakeholders and functions in the matrixed organizational structure \n\nKnowledge of NIQ products, and other GBS functions (preferred) OPPORTUNITY TO GROW:  At NIQ you will experience a dynamic, open, and solution-oriented international environment, where we support your development through a trust-based feedback culture and diverse training possibilities.  As part of our culture, our promise to you is that at Nielsen you can: Be Yourself, Make a Difference and grow with Us.   RDDS Overview Nielsen Retail Direct Data Solution (RDDS) provides software, data content, analytics, and consulting designed to efficiently extract insights from daily-store-item level and related data, creating actionable information that enables manufacturers to execute more effectively at retail. JOIN OUR TEAM AT NIQ!  As part of our culture, our promise to you is that at Nielsen you can: Be Yourself, Make a Difference and grow with Us.  About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}