{
    "Job ID": "69873160",
    "Description": "Role and Responsibilities:P& L:Responsible for the financial and volume budgets as a profit center head\nDaily Control of the Branch’s Budget Figures as well as ensuring timely electronic closure of the files in the system, including countercheck of job profits, Revenue, Volumes.\nIn charge of the Branch’s financial affairs including local cash flows, collections,controlling credit exposures.Monitoring the monthly overhead cost in line with the budg et.\nOperations:\nIn charge of the daily business activities for all products.\nMaintain the company’s business locally and play an active role in enhancing further and faster development of the Branch business activities in close cooperation with the Management team.\nEnsuring smooth communication processes and resolution of disputes with local customers as well as overseas partners.\nManage and liaise with the various departments in the branch and ensure that the Company’s procedures, service standards as well as policies are fully implemented at all times.\nPerform regular market investigations and surveys in terms of the competition and subcontractor activities, rates and pricing levels.Ensure a professional business relationship with all stake holders to ensure best service and pricing at all times.\nStrive to continually improve and build on the local organization and its performance.\nEvery filing clerk will have to submit accurate data to systems and ensure timely filing and avoid amendments. Each Branch Manager to monitor with immediate effect.\nTo have better synergies between sales, operations & accounts.\nResponsible for daily business activities for all products including operational efficiency.\nRetain the company’s business locally and play and active role in enhancing further and faster development of the Branch business activities in close operation with the management team.\nTo create process efficiency and value for the customer.\nTo ensure branch follow the SOP’s and compliances in all business area.\nMonthly closing of MIS from the given deadlines. Closing of the jobs as per agreed timelines.\nProcess Improvement through innovation.\nService Excellence :\nManage and liaise with the various departments in the branch and ensure that the Company’s procedures, service standards as well as policies are fully implemented at all times. Work closely with Teams to achieve Service Excellence.\nAchieve department wise service excellence as well as MIS on consistent basis.\nBusiness Development :\nStrive to continually improve and build on the local organization and its performance.\nMaintain, Promote and develop the business activities with regular sales visits to existing, new and potential clients.\nDetermine the tactical and strategic plans with the management consent and implement it successfully.Assist, support and motivate the sales team by organizing regular sales meetings and attend joint sales calls.\nPersonal Business “A” Category customers.\nGeographical Expansion\nFocusing more on Customer Retention especially A & B Customers.\nDevelop Carrier relations and Negotiation skills.\nPeriodic interaction with Customers for retention.\nFocus on developing vertical products.\nSatellite areas to sell products specific to that region.\nBranch Manager to ensure market expansion within the given territory and continuously out efforts to increase the market share.\nAchieve personal revenue target minimum equivalent to 3* CTC\nBi-monthly interaction trough personal visits to Top 10 customers of the branch.\nPeople Management:\nMaintain a positive team spirit and working environment at the branch.\nResponsible for the human resources and the general administration for the Branch in close co-operation with the Management.\nAssist, support and motivate the branch team by organizing regular activities.\nMonitoring the FTEs in the branch, recruitment, appointment and replacement of staff due to resignations or due to increase in business volumes in accordance with the budget and with the prior approval of the management.\nEnsure required training are imparted to the branch team members.\nMake sales department successful giving full operational support.\nDesired sales force to be in place at all locations.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}