{"Job ID": "69874510", "Description": "Key areas of focus include:Corporate governance and/or Internal audit/Internal controls over financial reporting\n  Role:As an Advisory Senior, you will make a significant technical contribution to client engagements and internal projects.\nWithin your role, you will actively establish, maintain, and strengthen internal and external relationships. With a clear focus on anticipating and identifying risks, compliance, and governance issues, you will escalate issues as appropriate to the Manager/Director. \nWorking closely with colleagues, you will confirm whether the work plan is properly executed, documented, and concluded in compliance with KPMG’s guidelines. \nWorking effectively as a team member, sharing responsibility, providing support, maintaining communication, and updating senior team members on progress\nDeveloping and maintaining productive working relationships with client personnel\nBuilding strong internal relationships within KPMG and with other services across the organization\nContribute to performance feedback for staff\nOther cognate duties\nSuperior analytical, critical thinking and problem-solving skillsInternal Audit Perform risk assessments by analyzing current risks and identifying potential risks that are affecting the company\nConduct process understanding session with client to gain knowledge of on ground practices, policies and procedure implemented to identify the design gaps, associated risks\nDevelop internal audit program containing detailed testing strategies to validate the efficacy implemented controls\nLead client discussions/presentations for gaps identified along with root causes and provide agile solutions mitigating the risks\nSkill set to develop policies and procedures from scratch highlighting balanced control environment mitigating business risks\nAcumen to identify business deficiencies and recommending value adding solution driving.\nWriting detailed audit reports effectively communicating the gaps, risks, and recommendations\nHelping prepare reports and schedules that will be delivered to clients and other partiesRole: Corporate Governance Advise on effective corporate governance structure including roles and responsibilities of the CEO, Board Committee etc. \nAssist in development of Delegation of Authority at corporate level based on the constitutional documents such as Articles of Association, Shareholder Agreement, BOD committee terms of reference, etc. \nAdvise on matters to be delegated to the CEO and reserved for BOD/Shareholder matters. \nAssist in drafting terms of reference for BOD Committees, etc. \nAdvise on the type of BOD committees to be developed i.e., advisory/decision making \nEnsure full compliance with relevant legislation and regulation pertaining to the corporate governance of the entity \nAssist in managing the preparation and publication of the Annual Corporate Governance Statement, Reports and Accounts, and other annual reports as required. This also includes monitoring and disclosure of Third-Party transactions.\nAssist in the implementation of the governance framework.\nRegular review and maintenance of the Corporate Governance policy.To qualify for the role, you must have\n Bachelor's or master’s degree in finance, Business or other related field\nIndustry related certification (e.g., ACCA, ICAEW, CIA, CRMA,  ICSA, ACAMS)\n4-5 years professional experience in the internal auditing preferably within Big4 and/or leading companies\nProficiency with MS Office \nKnowledge in data analytics would be an advantage.\nDemonstrated integrity, values, principles, and work ethic\nStrong analytical, interpersonal and communication skills\nMust possess flawless communication skills in English. Arabic will be a big plusJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}