{"Job ID": "69876723", "Description": "- Expert principal 2 (EP2) : Architecte/ingénieur civil spécialisé dans les constructions éducatives\nLocation: Rabat Le lieu principal de la Mission est le Royaume du Maroc, et plus particulièrement à Rabat, où se situe le siège du Promoteur. Le Consultant sera libre de choisir le lieu exact à partir duquel il réalisera ses prestations au Maroc mais il devra se situer à proximité des bureaux du promoteur (maximum 500 mètres a vol d´oiseau d´une superficie d`au minimum 10m2 par expert ainsi qu´un 1 salle de reunion pour 15 personnes). Des\nréunions, dans la mesure du possible à Rabat dans les locaux du Promoteur, ainsi que des visites de site sont à prévoir.\nLe Consultant aura à visiter les sites à analyser pour la sécurisation des terrains et ceux choisis pour les plantation possibles, disséminés 9 AREFs (de préférence entre 3 et\n5 AREFs).\nAfin de réduire les déplacements des experts, le Consultant pourrait être amené à ouvrir un ou deux bureaux secondaires à proximité des lieux d'activités. Cela se fera sur simple demande du promoteur et après\nvalidation de la BEI. L'emplacement sera alors localisé à proximité (maximum 500m à vol d'oiseau) des sièges des AREFS dans lesquels des projets seront en développement ou en construction.\nLa durée des missions décentralisées sera fonction du nombre de constructions prévues et de leur\ncalendrier. Le Consultant devra assister les personnels des AREFs et les membres du CGP dans le suivi des travaux. Tous les frais de déplacement et autres frais liés aux missions sur le terrain, ainsi que tous les moyens nécessaires à la parfaite et complète exécution de la présente AT doivent être inclus dans les honoraires des experts. La localisation exacte des sites sera Préparatoire.\nQualifications et compétences :Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Rabat, Morocco", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}