{"Job ID": "69874399", "Description": "At first glance, you’ll see that for more than 80 years we’ve been dedicated to advancing and optimizing the laboratory to move science and healthcare forward. Join a team where you can be heard, be supported, and always be yourself. We’re building a culture that celebrates backgrounds, experiences, and perspectives of all our associates. Look again and you’ll see we are invested in you, providing the opportunity to build a meaningful career, be creative, and try new things with the support you need to be successful.Beckman Coulter Diagnostics is proud to work alongside a community of six fellow Diagnostics Companies at Danaher. Together, we’re working at the pace of change to improve patient lives with diagnostic tools that address the world’s biggest health challenges. IDC is a research and development center with the vision of accelerating product roadmaps across various Danaher business segments. Started in 2014, the center now hosts 700+ associates, for multiple Danaher operating companies focusing on Diagnostics, Life Science, and Environmental and Applied Science segments. The operating companies includes Beckman Coulter, Radiometer, Leica Biosystems, Digital Teams, Hach, Leica Microsystems, HemoCue, Videojet, SCIEX, IDBS, Laetus and Cepheid.The IDC workforce comprises of various product engineering teams, working on development of software and hardware components of cutting-edge products for, Immunoassay, Chemistry, Hematology, Molecular diagnostics, Oncology, Neurosurgery and Water Quality. IDC has evolved as center of excellence for Cloud and data analytics, with significant contributions to the key informatics solutions. The teams consist of highly hardworking software & hardware engineers and development managers. The teams are supported by local Product managers, Quality & Regulatory and Intellectual property specialists.The inhouse teams works in close coordination with other global R&D centers at US, France, Germany, Japan, Australia, Denmark and Sweden. Located at the center of Bangalore IT HUB, IDC is housed at state of art facility.The Verification Engineer for Beckman Coulter Diagnostics is responsible for bringing in his/her expertise to improve our automation systems by carrying out software/system testing activities on newly developed software.This position is part of the Systems, Software and Automation business unit located in Bangalore, India and will be on-site. At Beckman Coulter, our vision is to relentlessly reimagine healthcare, one diagnosis at a time.You will be a part of the Lab Automation Verification team.We are looking for a hardworking and enthusiastic Software Verification Engineer to enhance the development of our clinical automation systems. The candidate will contribute to the success of our customers by ensuring Beckman Coulter provides the most innovative, reliable and accurate automation products.In this role, you will have the opportunity to:Assessment of product requirements\nDefinition of test strategy, test methods, acceptance criteria, needed materials, applicable sampling plan etc.\nDefinition and development of test fixtures / test benches, special test environment and ensure they are adequate for the test purpose\nPreparation of test protocols / test reports and reporting of identified issues\nExecution of test cases / test protocols on system\nInvestigation of identified issues (root cause analysis, reproducibility steps etc.)\nCollaboration with other functions (development, system engineering, QA) to define the appropriate approach for the above mentioned activities\nDocumentation on relevant tools\nSupporting definition of the project test strategy, project plan and metrics\nSupporting definition of process improvement, tools and laboratory management\nDefinition and improvement of test techniques\nSupport the Manager for team activities and mentoring other team members\nFacilitate discussion within the team and with other departments\nTroubleshooting of SW and HW problemsThe essential requirements of the job include:Bachelor’s or Master´s degree in a related field with minimum 2 years of relevant experience in manual testing/system verification.\nUnderstanding of software development processes for a regulated environment (FDA/ISO13485) and experience in medical device verification is a plus.\nExperience in Agile and Scrum principles and ISTQB foundation certification or equivalent.\nAbility to work independently while staying aligned with the functional team\nEffective written and spoken communication skills in English\nAbility to work with multi-functional and remote teamsIt would be a plus if you also possess previous experience in:Experience with clinical labs and working in a regulated environment\nLaboratory routine activities (e.g. operation, calibration and maintenance of instruments).Danaher is a global science & technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 80,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $29.5B in revenue last year. We are ranked #130 on the Fortune 500 and our stock has outperformed the S&P 500 by more than 5,200% over 25 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need hardworking people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and bring value for customers and shareholders. Come join our winning team!Danaher is committed to competitive compensation that typically has key components including base salary, variable annual incentive compensation based on personal and company performance, and long-term incentive.Equal Opportunity EmployerDanaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The “EEO is the Law” poster is available at: http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf.AccommodationsIndividuals who need a reasonable accommodation because of a disability for any part of the employment process should call 202-419-7762 or e-mail applyassistance@danaher.com to request accommodation.When you join us, you’ll also be joining Danaher’s global organization, where 80,000 people wake up every day determined to help our customers win. As an associate, you’ll try new things, work hard, and advance your skills with guidance from dedicated leaders, all with the support of powerful Danaher Business System tools and the stability of a tested organization.\nAt Danaher, we value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve.Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.\nIf you’ve ever wondered what’s within you, there’s no better time to find out.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}