{"Job ID": "69872872", "Description": "Job responsibilitiesSupports delivery processes including intake, dependency management, release management, product operationalization, delivery feasibility decision-making, and product performance reporting, while highlighting opportunities to improve efficiencies\nContributes to change management activities across functional partners and documents adherence to the firm’s risk, controls, compliance, and regulatory requirements\nDocuments blockers and impediments to aid with dependency management and resource availability\nCollaborates with the Product Delivery Manager to engage stakeholders and cross-functional partners to manage dependencies and timelinesRequired qualifications, capabilities, and skills2+ years of experience or equivalent expertise in product management, project management, or a relevant domain area\nDemonstrated experience or equivalent expertise in product management, project management, or a relevant domain area\nExposure to operational management and change readiness workstreamsPreferred qualifications, capabilities, and skillsEmerging knowledge of product release and deployment processes JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}