{
    "Job ID": "69876527",
    "Description": "Louis Dreyfus Company is a leading merchant and processor of agricultural goods. Our activities span the entire value chain from farm to fork, across a broad range of business lines, we leverage our global reach and extensive asset network to serve our customers and consumers around the world. Structured as a matrix organization of six geographical regions and ten platforms, Louis Dreyfus Company is active in over 100 countries and employs approximately 15,000 people globally.• Ensure all contract costs DN/CN received from buyers are in good order vs contract costs booked in Accounting System.\n• Ensure the settlement is performed properly include receiving the payment in a timely manner and the payment is correct; Liaise with traders on weight and quality issues both on purchases and sales. To able to identify the improvements in daily work.\n• Report insurance claims to insurance team and insurance broker and properly preserve all correspondence on the claim.\n• Reconciliation of intercompany transactions and its payment process on weekly basis.\n• Checking and approval of Contracts in Front System after thorough checking of trade details as per Trader/Broker confirmation.\n• Maintain necessary data tracking spreadsheet daily and ensure the costs occurred are well supported by supplementary documents and info needed.\n• Liaising externally with both other LD offices as well as with suppliers, Brokers and customers.\n• Review daily reports; distribute to traders and management when required. Provide monthly report and KPIs to reporting manager.\n• Responsible for testing new applications and changes in new trading system before implementation.\n• Coordinate retrieval of requested information for various audits throughout the year.\n• Other job and tasks may assign.\n• Manages and leads team members in achieving company/platform goal, motivate and assesses performance.\n• Provide encouragement to team members, including communicating team goals and identifying areas for training or skill checks.\n• Develops strategies to promote team member adherence to company regulations and performance goals.\n• Keep the team motivated and help on their learning and growth.\n• Assists management and develop talents.• University bachelor’s & master's degree preferred in International Trade, English, Logistics related major.\n• Minimum 7 years of experience with a foreign-invested commodities trading/ International Logistics.• Strong verbal and written communication skills in English. Proficiency with MS Word and Excel.\n• Scrupulous and pay attention to details, good analytical skill.\n• Knowledge of commodity trading practices, terminology and settlement process including but not limit to L/C, D/P and T/T payment terms.\n• Familiar with international practice and incoterms 2010.\n• Ability to prioritize multiple tasks and meet strict deadlinesWhat We OfferWe provide a dynamic and stimulating international environment, which will stretch and develop your abilities and channel your skills and expertise with outstanding career development opportunities in one of the largest and most solid private companies in the world.We offerCompetitive salary and benefits\nHybrid work available (not applicable to all roles)\nPension contributions\nAccess to Training and Development \nAccess to Concierge PartnershipsDiversity & Inclusion\n\nLDC is driven by a set of shared values and high ethical standards, with diversity and inclusion being part of our DNA. LDC is an equal opportunity employer committed to providing a working environment that embraces and values diversity, equity and inclusion.\n\nLDC encourages diversity, supports local communities and environmental initiatives. We encourage people of all backgrounds to apply.Sustainability\n\nSustainable value is at the heart of our purpose as a company.\n\nWe are passionate about creating fair and sustainable value, both for our business and for other value chain stakeholders: our people, our business partners, the communities we touch and the environment around usJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gurgaon, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}