{"Job ID": "69873848", "Description": "About Jumeirah and the Hotel:At Jumeirah, we are committed to encouraging and developing our colleagues, in a world-class environment. We value diversity and equal opportunity, employing over 14,000 colleagues from over 140 different countries including locations in Asia Pacific, CIS, Central Asia, Western and Eastern Europe, Africa and the Middle East. Our lifestyle brand, Zabeel House takes inspiration from our roots – Dubai. Much like the city where it was created, we too like to push the boundaries to create innovative hotel stays. We are curators of ‘what is good’, and build experiences that people want to share. The Zabeel House has five key brand values. Limitless curiosity is our commitment to engage the guest in the local neighbourhood through sharing our knowledge of the area with guests to inspire them to explore. Inventiveness is our commitment to engage with guests with open minds, with ingenuity, with fresh creativity always thinking outside the box. Honesty reflects our commitment to always be genuine towards our guests; to have conversations, not interactions. Freedom relates to Zabeel House design and ambiance – we created a brand that is high on design but low on complexity and our design-led spaces are crafted to allow our guests to have the freedom to be who they want to be and stay how they want to stay. Finally, Belonging reflects how we want our guests to feel - guests who want to live like a local even if just for a day.Our property, Zabeel House by Jumeirah, The Greens, offers its guests 210 rooms and suites, a co-work space with meeting rooms, a modern gym, rooftop pool and a number of happening restaurant outlets including a multi award winning vibrant Pan-Asian restaurant.“Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity.”About the Role:An opportunity has arisen for a Team Leader to join the Front Office Department in Zabeel House by Jumeirah™, The Greens. The main purpose of the role is to be the main point of contact for guests and visitors in the hotel lobby, welcoming and escorting guests & making them comfortable. Being a reliable source of information, exceeding guest’s expected and unexpected needs in a professional, warm, friendly and efficient manner. The main duties and responsibilities of this role:   Maintain a high level of knowledge about property facilities and services as well as Dubai (UAE) and other Jumeirah properties. To be prepared to answer any guest enquiries and questions.\nActively use the Service Standard and the ‘Zabeel House’ approach in every day tasks. Live the Vision, Mission, Guiding Principles and Hallmarks of Jumeirah and lead by example. Making sure the guests understand the ‘Stay Different’ concept.\nAssist the Concierge and Lobby Butlers Operations with any guest service requirements. \nTo recognize repeat guests & their preferences. Establish and develop personal guest contacts, promote feedback and be consistently proactive in anticipating guest needs and requirements.\nHandling check- in, check-out and cashiering for in house guests and visiting guests. Helping out charging for other departments.\nAuditing the Guest Service Executives during the closer of the day.\nPromote the Loyalty program with enrolling 10 new guests on daily basis.\nEnsure that the maximum of guest information are collected with a target of 5 preferences daily and passed on to the guest history team.\nMaintains open line of communication and co-ordination with related departments to ensure customer requests and complaints are handled effectively and efficiently at all time.\nAdheres to the Hotel standards and SOP of guest services at all times with ensuring a high level of quality service.\nTo ensure that all the registration cards are checked with the correct guest profile and sign on the registration cards.\nTo make the weekly roster for the reception.   \nAny other duties as may reasonably be requested by the managementAbout You: The ideal candidate for this position will have the following experience and qualifications:A minimum of two year experience or a similar role in a five star hotel environment.\nGood knowledge in OPERA, HOTSOS \nGuest contact skills & problem solving skills\nBasic computer knowledge\nPMS knowledge preferred\nAlways project smiling, helpful and friendly attitude towards colleagues and guests and provides a courteous and professional service at all times\nGood written and spoken English language skills. Language would be of advantage: Arabic, Russian, Mandarin or European language.\nOperational Excellence: Delivering Excellence / Influencing & Communication.\nPersonal Attributes: Flexibility and Adaptability / Understanding peopleAbout the Benefits: This position offers an attractive tax-free salary, paid in Dirhams (AED), the local currency of UAE. In addition, we offer generous F&B benefits, reduced hotel rates across our properties globally, excellent leave and health care package, flights home, accommodation, life insurance, functional incentives and other employee benefits making the role attractive to high performers and any applicant looking for a career with one of the most luxurious brands in the hospitality industry. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}