{
    "Job ID": "69873108",
    "Description": "Job Description:Job Title- Oracle PL/SQL DeveloperLocation- Pune, IndiaRole Description\nIndividual is required to possess strong technical skills as a full stack developerCandidate’s primary responsibility will be to work closely with functional teams and ensure the functions are built properly adhering to requirements, present architecture and standards.Full Stack end to end development and ownershipStrong commitment towards automated testing and writing high quality codeInvolvement in contributing to standards and practicesWhat we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesIndividual is required to possess strong technical skills as a full stack developer\nCandidate’s primary responsibility will be to work closely with functional teams and ensure the functions are built properly adhering to requirements, present architecture and standards.\nFull Stack end to end development and ownership\nStrong commitment towards automated testing and writing high quality code\nInvolvement in contributing to standards and practicesYour skills and experienceLanguage: Spark SQL, Spark Java, Python, Bash Shell Scripting\nAutomation Testing: BDD Framework using Cucumber\nServer: RHEL\nDatabases: Oracle 12c+, Hive, Impala\nSCM: GIT\nBuild tools : Maven (Build tool)\nSDLC Tools: JAMA, JIRA, SONAR, TeamCity, BitBucket, ALM, U-deploy etc.\nPractices: DevOPS, Agile\nOther open source: Spring Famework, Spring BootExposure to other technologies like UNIX, Job Scheduling (Exp: Control-M)\nFamiliarity with Agile and Scrum practices\nExperience with Behavior Driven Development (BDD).How we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}