{
    "Job ID": "69872683",
    "Description": "Media.Monks is looking for a Senior Manager, Media Strategy Operations who will manage marketing engagement channel programs for one of Media.Monk’s top tier global clients. The Senior Manager, Media Strategy Operations will collaborate with cross-functional teams to help define our processes and work to deliver high-quality marketing campaigns and content through well-managed, on time and on-budget projects. Our ideal candidate is a fast and flexible go-getter who jumps on new opportunities, with a natural aptitude for collaboration. Sound like you? Let’s get acquainted!What You’ll Do:Build and launch digital marketing campaigns that live across devices on desktop, mobile and app.\nDevelop campaigns with the account and creative teams based on client brief (text copy, image assets, audience targeting, etc.).\nTrack required delivery dates of campaign components (e.g., targeting definitions, creative elements, legal approvals, etc.).\nFlag any missing components that jeopardize launch dates, and work with the appropriate teams to track down the missing components.\nReview campaigns for compatibility within the policy guidelines and concurrently running campaigns. Work with client contacts to resolve any conflicts.\nConfirm campaigns launch on time and as specified by client. Flag any unexpected results for review by client.\nMaintain a master calendar of all marketing-driven campaigns.\nManage constantly changing project priorities, timelines, and deliverables, proactively communicating updates across teams.\nTrack campaign changes and their impact on the cost/time frame of project delivery.\nSupport strategies for risk mitigation and contingency planning.\nEnsure project documents are complete, current, and stored appropriately.\nServe as the main lead and client point-of-contact for campaigns.Who we're looking for:College degree and 6+ years of experience in a campaign/project management role, working closely with clients and cross functional teams (i.e. account managers, art directors, developers/engineers, marketing managers, etc.).\nHigh attention to detail and organized \nRelationship orientated w/ good written and verbal communication skills  \nHands-on experience in marketing campaign execution (e.g. email) and basic understanding of performance metrics (e.g. CTR); comfortable reviewing and providing basic analysis if needed\nCampaign timeline development and project management skills  \nAbility to manage multiple complex projects simultaneously\nComfortable in fast-paced environment, navigating uncertainty and prioritizing when needed\nAbility to work as well independently as within a team\nHigh energy and go-getter attitude; comfortable working autonomously; eager to learn\nProficient in Google Suite: Drive, Docs, Slides, Sheets or equivalent (e.g., Word, PowerPoint, Excel)\nComfortable dealing with ambiguity and changes, able to manage moving timelines\nSense of humor and strong team orientation\nCreative agency experience a plus\nOk and comfortable working with a global team#LI-JA3About Media.Monks:Media.Monks is the purely digital operating brand of S4Capital plc that connects 8,600+ digital natives across one global team. We are united by a mission to shift industries forward and pave the path towards ambitious outcomes so our clients and our people can realize their full potential for growth. Our unified model combines solutions in media, data, social, platforms, studio, experience, brand and technology services to help our clients continuously reinvent themselves throughout increasingly rapid cycles of disruption. Our efforts to shape culture, build innovative technologies and unlock the future of growth have earned recognition from numerous esteemed panels: we maintain a constant presence on Adweek’s Fastest Growing lists (2019-22), regular recognition at Cannes Lions, inclusion in AdExchanger’s Programmatic Power Players (2020-23), the title of Webby Production Company of the Year (2021-23), a record number of FWAs, and have earned a spot on Newsweek’s Top 100 Global Most Loved Workplaces 2023. Together, these achievements solidify our experience in digital innovation, excellence in craft, and commitment to personal growth.While we continue to grow our teams, please be mindful of fraudulent job postings and recruiting activities that may use our company name and information. Please be mindful to protect your personal information, especially your national identification number, and bank account information during a recruiting process. While Media.Monks may reach out to potential candidates via LinkedIn, we will always ask applicants to apply through our website (https://media.monks.com/careers) and will never ask for payment or bank account information during the recruitment process.Responsible for resourcing and implementing security controls for your teams processes and systems\nResponsible that all your personnel apply information security in accordance with the established information security policyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}