{"Job ID": "69875788", "Description": "Miratech is an IT services and outsourcing company that provides services to multinational organizations all over the world. Our highly professional team achieves success with 99% of IT projects in financial, telecommunication, and technology domains. Founded in 1989, Miratech has its headquarters in New York, USA; with R&D centers in Poland, Philippines, Slovakia, Spain, and Ukraine. Technical complexity is our passion, stability is our standard, friendly work environment is our style. We empower our employees to grow together with the company, to achieve ambitious goals, and to be a part of the international relentless team which helps the visionaries to change the world.The world's largest Healthcare company is going through a Customer Experience transformation and Miratech is the trusted partner in this journey.Transformation of traditional call center systems and processes to an omnichannel for our consumers, providers, and agents. The project's capabilities are a constant evolution of features and functions to support business needs. Client’s customer-focused contact center solutions offer solutions to enhance and execute a seamless conversation between consumers and advocates.We are doing myriad projects across the spectrum of client's CX estate, including the development and implementation of routing/IVR strategies across various lines of business, BOT development/middleware, digital development for omnichannel experience, agent desktop creation and customization for various line of business demands, support the business architecture team, migrations off legacy systems, Digital expansion including LivePerson implementations as well as contact center production control and operations.We are looking for a BOT Tester to join our team. Responsibilities:This role will be responsible for testing the Conversational AI Application.\nEffectively plan, define test strategy/test cases, provide QA estimates, provide test management, and test reporting.\nPerform automated testing for scalable results.\nBe accountable for all project or release test efforts for programs that span multiple domains and apps including System Integration or End to End Testing efforts.Experience in testing any of the Conversational AI applications (Preferred Voice BOT) is mandatory.\nHands-on experience on Text-to-speech augmentation.\nHands-on experience on SSML tags, Audio Augmentation\nStrong coding knowledge in Python.\nDialog Testing using Botium - Bot Emulator\nExperience in using testing tools such as Cyara.\nExperience in LUIS testing is a plus.\nExperience / Knowledge in Q &A Maker is nice to have.We offerCulture of relentless performance: join an unstoppable technology development team with a 99% project success rate and more than 30% year-over-year revenue growth. \nForeverRemote work culture: make the most of the flexibility that comes with remote work.\nCompetitive pay and benefits: enjoy a comprehensive compensation and benefits package, including health insurance, language courses, and a relocation program. \nGrowth mindset: reap the benefits of a range of professional development opportunities, including certification programs, mentorship and talent investment programs, internal mobility, and internship opportunities. \nGlobal impact: collaborate on impactful projects for top global clients and shape the future of industries. \nWelcoming multicultural environment: be a part of a dynamic, global team and thrive in an inclusive and supportive work environment with open communication and regular team-building company social events. \nSocial sustainability values: join our sustainable business practices focused on five pillars, including IT education, community empowerment, fair operating practices, environmental sustainability, and gender equality. * Miratech is an equal opportunity employer and does not discriminate against any employee or applicant for employment on the basis of race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other protected status under applicable law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}