{
    "Job ID": "69875871",
    "Description": "Advance Development Team Full Time Employee Job Description: AI CV Research Engineer/ScientistPhilips Enterprise Informatics is a global organization that helps Philips introduce meaningful innovations that improve people’s lives. We provide technology options for innovations in health and well-being, targeted at both developed and emerging markets. Positioned at the front-end of the innovation process, we work on everything from spotting trends and ideation to proof of concept and – where needed – first-of-a-kind product development.Clinical Informatics Advance development group in India is a key lab, developing innovative concepts and solutions in the areas of healthcare informatics, cardiology, oncology, pregnancy and parenting. These are enabled by advanced pattern recognition, deep learning and AI technologies to modernize clinical diagnostics and healthcare industrialization.To meet our strategic goals, we are looking for professionals who are passionate about AI, advancing science, and building the next generation of intelligent systems for various health-care applications. Our ambitious AI research agenda is both broad and deep, with leading edge projects in signal/image processing, machine learning, deep learning, and NLP techniques. You will interact with multiple teams on AI and will help bring research ideas into scalable, robust systems.Responsibilities:Explore and develop various Artificial Intelligence (AI) algorithms for healthcare applications\nDeveloping AI, pre and post processing algorithms on images and videos with a focus on data from different imaging modalities\nDeveloping various machine learning and deep learning techniques and algorithms for segmentation, classification, and statistical modelling, etc.,\nCollaborate with research engineers at other R&D locations to translate algorithms into commercially viable products and services.\nBuilding prototypes and putting your work into a production environment\nCommunicate and present various proposals, concepts, and results to collaborators and customersBasic Qualifications:Masters with 2 to 6 Years of experience / PhD holders with 1 to 2 years of experience in signal & image processing/machine learning/artificial intelligence /data science or any other related discipline\nExperience with one or more analytic software tools or languages (like Python)\nGood coding experience in C++\nExperience in developing various machine learning algorithms and various deep learning frameworks (like Tensor flow, PyTorch, ...)\nStrong problem solving, communication, and team skills.About Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}