{
    "Job ID": "69873615",
    "Description": "As part of&nbsp;the Global Supply Chain &amp; Manufacturing Excellence Team, the Global Supply Chain Performance Tool Development Engineer &amp; Analyst will have responsibility to develop standardized performance measuring tools &amp; processes which enables efficient &amp; transparent performance measurement, as well as Capex management &amp; L&amp;O cost reduction for global &amp; regional supply chain teams.You`ll be responsible to design &amp; develop standard supply chain KPI monitoring solution and support the global &amp; regional teams to implement them.Provide regular analytical reports supporting global &amp; regional supply chain teams` needs (Inventory, Factory KPI`s, Capex, L&amp;O saving, Warehouse &amp; logistic costs, procurement reports, quality etc).Execute key projects to improve the reporting efficiency beside improved data integrity. Support the L&amp;O cost reduction process by monitoring performance vs targets.&nbsp;&nbsp;Develop &amp; maintain manufacturing plant`s KPI data reporting system, maintain and analyze all BU Components plant`s KPI data, as well as develop Weekly Drive Action and Monthly Plant Operating Review protocols and reporting systems supporting the most efficient communications and common manufacturing plant performance evaluations.&nbsp;&nbsp;Develop efficient &amp; transparent CapEx investment reporting protocol supporting allocation of global investment budget to local manufacturing plants, monitor &amp; report the CapEx spendings in alignment of the approved budgets, support frequent investment reviews with each BU Component plant to ensure spending plans are in-line with approved projects scope.&nbsp;While working with a variety of global stakeholders, the Global Supply Chain Performance Tool development engineer &amp; Analyst is an independent, driving and goal-oriented person, who needs to possess strong Power BI programming capabilities, ERP user experience,&nbsp;good communicational skills, deep analytical skills, structured approach and out of box thinking mindset. For this interesting position we are offering a one-year contract with the possibility of an extension. &nbsp;MAIN TASKS AND RESPONSIBILITIES&nbsp;Develop the KPI data reporting system for the global manufacturing plant performance measurement&nbsp;\nDirect contact with each BU Component plant responsible to support on-time KPI reviews and ensure data accuracy.&nbsp;\nDevelop reporting system which efficiently support the Weekly Drive Action meetings with each plant&nbsp;\nDevelop reporting system for the Monthly Plant Operating reviews deployed to each plant&nbsp;\nExecuteJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}