{
    "Job ID": "69875711",
    "Description": "Fundamental Hospitality is looking to hire an experienced cleaner for our high end restaurant located in DIFC, Dubai.Who are we?Established in 2011, Fundamental Hospitality is a UAE born company that unifies the regions leading lifestyle concepts. As an international ecosystem of hospitality brands, the group develops elevated, home-grown concepts that showcase the quality and innovation of the region, whilst exporting them to key cosmopolitan cities around the world. Fundamental Hospitality delivers lifestyle brands reimagined, where a creative approach to concept development leads to a dynamic experience in each and every venue. The group has played a fundamental role in the expansion of brands from the UAE to the world, where we understand the essential elements needed to execute experience driven lifestyle concepts on an international scale. The collection of brands within the portfolio include globally acclaimed concepts Gaia, Shanghai Me, Alaya, La Maison Ani, Piatti and Izu Burger, as well as international franchises, Scalini Dubai, Scalini Riyadh, Cipriani Dubai, and Cipriani Dolci UAE. Fundamental Hospitality owns and operates venues across the Middle East and Europe, with ongoing expansion of the group’s concepts into the GCC, Europe, UK, and USA. Dubai will further see the launch of new home grown concepts as Fundamental Hospitality continues to cement itself as the leading innovator in the hospitality industry.Website: http://www.fundamentalhospitality.com- All candidates should be available in UAE for a face to face interview.- Prior experience as a cleaner is mandatoryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}