{"Job ID": "69873438", "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Position: Senior Business Systems Analyst- ServiceNow\nLocation: Bangalore / HyderabadThis position is responsible to create and deliver value by automating business processes and supporting our ServiceNow application to support business growth. The main responsibility of this position is to partner directly with our IT Operations teams to implement major projects and enhancements related to IT Asset Management and ITSM processes.  You will be part of the IT Business Applications team and engage and collaborate with IT Ops team.Responsibilities/What You’ll Do:Meet with business leaders, decision-makers, and end-users to define business requirements, and systems goals\nFacilitate discussions among business owners to understand problem statements and gather requirements\nHave a strategic advisor mindset to assist business stakeholders with accomplishing their business outcomes\nLead, own, and deliver the ServiceNow application related projects within the defined timelines using the Agile/Scrum methodology\nAutomate new business processes and improve the existing ones \nInteract with cross-functional business units to define requirements and understand the system's upstream and downstream changes\nDocument and develop high level, business processes flow, requirements, and design documents for new business requirements \nManage implementation vendors and consultants to implement new systems, projects, and enhancements \nEngage with business partners to discuss business requirements, determine feasibility, business value, and a cost-effective and scalable solution\nStay up to date with ServiceNow's latest releases and review new useful features and functionalities with our business team\nAbility to effectively collaborate with the business stakeholders\nIdentify test criteria and test new functionality/enhancements\nProvide training to end-usersMinimum of 6 years of IT experience in complete software development life cycle process including System Analysis, Design, Development, Testing, Implementation, and Documentation\nMinimum of 4 yr. experience as a business analyst for an enterprise ITIL/ITSM platform\nMinimum of 3 yr. experience with the ServiceNow platform\nITIL certification is a major plus\nStrong knowledge of Change Management, Configuration Management, and Release Management as it relates to ITIL\nStrong knowledge of ITSM, ITOM, IT Asset Management, Sec Ops, Dev Ops CMDB, and ITSM processes\nImplementation experience for SecOps (SIR, VR, Threat Intelligence)\nHands-on experience with ServiceNow Platform capabilities and configuration\nStrong knowledge of system and software quality assurance best practices and methodologies\nDemonstrates strong and effective verbal and written communication skills\nFlexible and adaptable in regard to learning and understanding new technologies\nExcellent leadership and project delivery skills\nExcellent written and oral communication skills\nExcellent interpersonal skills\nProven problem-solving, analytical and investigative skills\nAbility to conduct research into software-related issues and products\nHighly self-motivated and directed by being a great team player \nAbility to effectively prioritize and execute tasks in a high-pressure environment\n4-year degree BS/BA in a technical, business, or other analytical field required#LI-NT1\n\nWhy Zscaler?\n\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \n\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}