{"Job ID": "69876635", "Description": "Mob Inspire PVT Ltd is one of the fastest growing mobile platform development and innovative technology company in Islamabad. The company leverages unique processes to build and control world class mobile platforms. Through cutting-edge development processes we get a bunch of data intelligence and predictive traffic technologies. Mob Inspire helps leading Enterprises, Brands and news startups make it easier to solve big problems in their countries by launching a great platform that can hold big data of consumers and providers. Our vision is simple – to solve big problems, empower people, work on innovations, and rest of the time we spend on planning and enhance commerce.We are urgently looking for \"iOS developer\" with 3-5 years experience who have done complex mobile projects with REST API integrations for our new project. This is full-time onsite opportunity, no remote and hybrid work allowed. #LI-onsiteExperience in developing native apps written in Swift, experience working with peripherals is highly desirable.\nSolid experience in native IOS development frameworks (API, testing, deployment, etc.) experience with Swift, XCode, Cocoa APIs on OS X, iOS SDK, & iOS Tools.\nExperience in Design, Development, Coding, Testing, and Releasing to QA iOS apps in alignment with our business goals.\nExperience with Dependency Injection.\nImprove code quality through writing unit tests, automation and performing code reviews.\nCollaborate with colleagues across engineering, product, design, and operations to provide end-to-end solutions\nStrong foundation of software design know how to create software that is extensible, reusable and meets desired architectural objectives.\nEmphasis on the performance, quality, and responsiveness of the app. Knowledge of memory management and multi-threading. Familiarity with RESTful APIs to connect to back-end services.Bachelor’s degree in computer science or software engineering.\nProven experience as an app developer.\nAdvance expertise in Swift.\n3-5 years on experience with on-demand and real time application development. \nExtensive experience with iOS Frameworks such as Core Data and Core Animation.\nKnowledge of iOS back-end services.\nKnowledge of Apple’s design principles and application interface guidelines.\nProficient in code versioning tools including Mercurial, Git, and SVN.\nKnowledge of C-based libraries.\nWorking knowledge of REST APIs, concurrency, layouts, transitions, animations, client side persistence, and architectural patterns on mobile apps\nExperience with app publishing to Appstore.\nMust be a resident of Islamabad/Rawalpindi.\nExperience with mobile CI/CD tools like Jenkins, Circle CI or BitriseBenefits:(Will be given after successful completion of the probation period) Leave Encashment. \n\nDental service allowance. (40% off on the bill) \n\nInhouse games/activities. \n\nAnnual (8 leaves that can be encashed or availed at the end of the year)\n\nCasual & Sick Paid Leaves. (Per month 2 paid leaves are allowed)\n\nCutting-Edge Technology. \n\nChallenging Projects.  \n\nCompetitive Compensation and Benefits. \n\nEmployee Performance-based bonuses. \n\nMedical Reimbursement. (10% of basic each month)\n\nEmployee referral bonus. (5% of the candidate's salary package)\n\nOccasional bonuses/gifts. Job days: Monday to Friday. Job type: On-site Job Location: Bahria Town phase 4, Rawalpindi. Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Islamabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}