{"Job ID": "69873037", "Description": "Role: Junior Security AnalystDivision: Assessment & Qualifications DeliveryGrade: B1Location: Chennai or Bangalore, IndiaAbout Pearson: At Pearson we ‘add life to a lifetime of learning’ so everyone can realise the life they imagine. We do this by creating vibrant and enriching learning experiences designed for real-life impact. Our Purpose | Add Life to a Lifetime of Learning. Pearson was founded in 1844 and has been built on our ability to grow with and adapt to a constantly evolving market. Our 20,000+ employees are dedicated to creating the high-quality, digital-first, accessible and sustainable resources for lifelong learning.About UK Assessment & Qualifications: We are responsible for the delivery of nearly 4 million examination results per annum, including A-Level, GCSE, BTEC and T-levels for students in UK and International centres. Our in-house systems process every learner from registration to marking and certification, in a highly regulated business. We currently operate a hybrid estate of predominantly bespoke systems, with an ongoing strategic transformation programme to migrate from on-prem to cloud based, cost effective, scalable, and resilient services.Key Responsibilities:Assist and support the Divisional Security Lead (DSL) in the day to day management of all matters relating to information security within the DSLs responsibilities which include:Work with product teams throughout the product development lifecycle to ensure security requirements are defined and measured to completion. Drive the implementation of security controls and the adoption of security capabilities.\nUndertake research to support design reviews, security risk assessments and divisional security strategy.\nWork closely with developers and other technical teams on the delivery of security testing. Co-ordinating, scoping and triaging Pen-testing and AppSec testing activities\nSupport the management reporting cycle for key security related metrics, Key Performance Indicators and to identify trends in security risk exposure.\nChampion automation and drive efficiency across security tools and processes\nSupport a large information discovery project within the division, working directly with different business units.\nProvide consultation and advice on all matters relating to security to a wide variety of stakeholders from across the business and technology.Essential skills and experienced requiredDemonstrable interest and prior training in technology securityAll our roles are hybrid working; for this role that means visiting your base office no more than once a week, and with the possibility of occasional business travel to UK Pearson sites.We actively encourage our staff to participate in at least 40 hours of training a year, and offer relevant AWS (Amazon Web Service) training and certification as part of this role.Flexible working: Pearson is committed to hybrid working practices and has adopted flexible remote and virtual working. Where possible our employees can choose to manage their attendance to the office more flexibly. Diversity: At Pearson we value the power of an inclusive culture and a strong sense of belonging. We promote a culture wheredifferences are embraced as strengths and opportunities are equal and accessible. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Join us and be part of a collaborative team that drives innovation and shapes the future of software engineering! #LI-POSTJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}