{
    "Job ID": "69875614",
    "Description": "Senior UX Designer – HCMAre you a creative person who loves a challenge? Solve the complex puzzles you’ve been dreaming of as our Senior UX Designer – HCM. If you have a passion for innovation in tech, we want you on our team! Thrive in this crucial role. Oracle is a technology leader that’s changing how the world does business. We’re looking for an experienced and self-motivated person. We appreciate you taking the time to review the list of qualifications and to apply for the position. Come and join us! At Oracle | NetSuite, we’re seeking a highly skilled and dedicated Senior UX Designer to join our team in Hyderabad, India. We are looking for an individual who enjoys crafting outstanding user experiences and a proven track record in designing digital products.Our team’s focus is on our HCM (Human Capital Management) product which provides a suite of capabilities that make HR service delivery easier and more efficient for everyone across the organization.Our company culture: We help each other and foster collaboration across roles and teams.\nWe lift each other up. We know how to celebrate our successes and learn from our failures.\nIdeas are fragile, and we consider them no matter how simple or outlandish.\nWe always try to do the right thing – for ourselves, for the product and ultimately for our customers.Enjoy productive discussions and collaboration within, and outside the team.\nThrive in a collaborative and cross-functional environment, actively seeking input and feedback from collaborators.\nHave pride in your work.\nTake initiative, responsibility, and ownership of your projects.\nKeep up to date on the latest design trends and industry standard methodologies and new technologies.\nA desire to keep learning.Online portfolio demonstrating your process and problem-solving ability using Design Thinking (research, problem analysis, personas, empathy mapping, surveys, scenarios, user journeys, task-flows, sketches, wireframes, and prototypes).\nA commitment to learning and the ongoing development of your skills – and a desire to share your findings with others.\nA positive and resilient personality. You must be able to embrace feedback and you for continuous iteration and improvement.\nExperience working in Figma or other similar software.\nProficient in English, strong communication, presentation, and interpersonal skills.\nFlexibility to work with geographically distributed teams and willing to travel.\nExperience working in Agile environments a plus.An Oracle career can span industries, roles, Countries and cultures, giving you the opportunity to flourish in new roles and innovate, while blending work life in. Oracle has thrived through 40+ years of change by innovating and operating with integrity while delivering for the top companies in almost every industry.In order to nurture the talent that makes this happen, we are committed to an inclusive culture that celebrates and values diverse insights and perspectives, a workforce that inspires thought leadership and innovation.Oracle offers a highly competitive suite of Employee Benefits designed on the principles of parity, consistency, and affordability. The overall package includes certain core elements such as Medical, Life Insurance, access to Retirement Planning, and much more. We also encourage our employees to engage in the culture of giving back to the communities where we live and do business.At Oracle, we believe that innovation starts with diversity and inclusion and to create the future we need talent from various backgrounds, perspectives, and abilities. We ensure that individuals with disabilities are provided reasonable accommodation to successfully participate in the job application, interview process, and in potential roles. to perform crucial job functions.That’s why we’re committed to creating a workforce where all individuals can do their best work. It’s when everyone’s voice is heard and valued that we’re inspired to go beyond what’s been done before.Oracle is an Equal Employment Opportunity Employer*. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.* Which includes being a United States Affirmative Action EmployerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}