{
    "Job ID": "69874801",
    "Description": "Coursera was launched in 2012 by two Stanford Computer Science professors, Andrew Ng and Daphne Koller, with a mission to provide universal access to world-class learning. It is now one of the largest online learning platforms in the world, with 129 million registered learners as of June 30, 2023.Coursera partners with over 300 leading university and industry partners to offer a broad catalog of content and credentials, including courses, Specializations, Professional Certificates, Guided Projects, and bachelor’s and master’s degrees. Institutions around the world use Coursera to upskill and reskill their employees, citizens, and students in fields such as data science, technology, and business. Coursera became a B Corp in February 2021.Join us in our mission to create a world where anyone, anywhere can transform their life through access to education. We're seeking talented individuals who share our passion and drive to revolutionize the way the world learns.We at Coursera are committed to building a globally diverse team and are thrilled to extend employment opportunities to individuals in any country where we have a legal entity. We require candidates to possess eligible working rights and have a compatible timezone overlap with their team to facilitate seamless collaboration. As a remote-first company, our interviews and onboarding are entirely virtual, providing a smooth and efficient experience for our candidates.Job Overview:Coursera is looking for a strategic Content Marketing Manager to lead content efforts for Coursera for Campus. The ideal candidate will have experience developing high-performing content assets across a range of formats, including data reports, e-books, videos, and webpages. Strong communication and collaboration skills are required to drive alignment across the marketing, sales and leadership teams. You are a creative individual that is motivated to tell impactful stories with content.Responsibilities:Conceptualize and define content marketing projects that reflect our goals, campaign themes, and target personas\nDevelop project briefs, messaging, and detailed outlines for content assets\nFlex from editor to writer by reviewing all content deliverables and authoring content as needed\nLead content production of data reports, e-books, short-form visuals, videos, articles, webinars and webpages\nPartner with product marketing, demand generation, customer marketing, sales and creative to drive alignment on content topics&nbsp;\nReview and edit all content to ensure is consistent with Coursera’s messaging, style, voice, tone and support quarterly editorial calendar planning for content marketingBasic Qualifications:5+ years experience in content marketing, preferably for a higher ed audience\nBackground in writing, editing or communication\nDemonstrated history of producing a variety of content such as e-books, data reports, videos, webpages\nExperience overseeing freelance writers and agencies to produce high-quality content\nExperience handling multiple projects at once and driving alignment across marketing disciplines, sales, and brand &amp; creative\nProject management skills and great attention to detailPreferred Qualifications:Bachelor’s Degree in English, Communication, Journalism, or equivalent field\nStrategic, metrics-driven mindset with a passion for the art and science of content marketing\nAbility to analyze raw data and synthesize into compelling insights\nConversant in Salesforce reporting and Marketo\nA demonstrable understanding of the evolving edtech landscape and the future of learning\nExperience writing for a higher education audienceIf this opportunity interests you, you might like these courses on Coursera:Content Strategy for Professionals: Engaging Audiences\nThe Strategy of Content Marketing\nAI for Everyone#LI-TP1Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}