{
    "Job ID": "69873618",
    "Description": "Job Title:        Supply PlannerDepartment:   Global Supply & Demand PlanningJob Summary:Reporting to Manager- Demand and Supply Planning, the successful candidate will be part of global SIOP process and would be responsible for supply planning activities for APAC region.Essential ResponsibilitiesPlacing purchase orders to suppliers as per MRP, re-order report and special PO’s, follow-up with vendor for order acknowledgement, commitment date and shipment once the PO is released.\nDecision making on MRP for the requirement of materials triggered in system.\nSupporting APAC regions for supply chain activities and ensuring material is shipped on time as committed.\nCorrective measures taken to resolve pricing discrepancy in shipping documents.\nDirect inbound operations, such as transportation, forwarder details or logistics quality management.\nWeekly backorder reporting, Inventory reporting and analysis.\nTracking all shipments from the place of origin to destination and resolve problems concerning transportation and logistics system.\nResolve L&D queries for custom clearance, FTA etc.\nCreate and update open order summary report on daily basis.\nResponsible for the weekly, monthly reporting of Global measurements.\nResolve MAPLE ageing cases.\nThis is a one year contract roleKey SkillsKnowledge of Supply Planning, Statistics.\nKnowledge of Inventory Management, Safety Stock, MRP run etc.Educational/Experience Background:Graduate with 2-4 years of related experience.Technical Skills:Knowledge of ERPs SAP, PRONTO, BAAN\nProficient in MS Excel\nGood written and verbal communication skills.\nSelf-motivated and ability to take initiatives.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}