{
    "Job ID": "69873511",
    "Description": "Job Description\n2023 will potentially see Sandoz become a standalone organization! Already a global market leader in Generics and Biosimilar medicine, this is an exciting, once-in-a-career opportunity to set our own path forward as an independent, purpose-driven organization, and as the founders of a new Sandoz, this is a time of immense opportunity for us all, both professionally and personally!\nTogether we will shape the future of Sandoz... are you ready to make a difference?\nPosition Purpose:\nImplements regulatory maintenance activities to achieve targets and business objectives in accordance with the submission plan to avoid stock-outs and delayed launches. Ensures that preparation of variations and second wave submissions follow established processes and timelines.\nKey Responsibilities:\n-Preparation of regulatory life cycle maintenance submissions - variations, renewals and second wave submissions, Modules 2 to 5 as per defined timelines.\n-Evaluates proposed changes and provides on time regulatory input for worldwide regulatory impact.\n-Contributes to performance and KPI's of the team to deliver agreed targets and objectives and supports reporting.\n-On time response to HA commitments and deficiency letters.\n-Ensures that the escalation process to next or higher-level management is followed, as applicable.\n-Ensures the receipt of proper product transfers from DRCs, MRCs and BD Regulatory.\n-Ensures proper data management and completion of all assigned trainings within specified timelines.\n-Any other responsibility assigned after training (as applicable).\nDiversity & Inclusion / EEO\nWe are committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\n• At least 2-4 years of proven experience in regulatory with an exposure of working in global organization in generics is preferred. Campus graduates with agility can be considered.\n• Exposure towards project management is a plus.\n• Well-structured, self-committed, resilient, flexible, team player.\n• High operational excellence orientationJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}