{"Job ID": "69873070", "Description": "Job Description:Job Title - Information Security Analyst, NCTLocation – Pune, IndiaRole Description:The Information Security Analyst is responsible for supporting the execution of the Information Security strategy. The Information Security Analyst provides data and analysis to measure the effectiveness of Information Security controls across group wide products and services. The Information Security Analyst identifies and evaluates potential areas of Information Security threats by assessing the probability and impact, and facilitates feedback for mitigation.\nRoles within Information Security may cover one or more areas of speciality, e.g. Identity & Access Management (which may include, for example, authentication; access management & control; recertification etc.); Information Security (“IS”) Operations (which may for example include, cyber threat operations; cyber forensics, protection against data leakage etc.) and IS Technology (which may include IS architecture, IS engineering, cryptographic services etc.)OverviewThe DWS CSO I&A function designs, build, and operate strategic solutions for managing the request, approval, provision, revocation of privileged access and its’ recertification to ensure DWS stays compliant with internal and external controls and regulations.We are in the process of building a IAM (Identity & Access Management solution) based on Forgerock and PAM (Privileged Access Management) solution based on CyberArk Technology in the CloudWhat we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilities:Execute Manual ID admin requests\nSupport all IAM or PAM related governance processes, e. g. operational run of Campaign recertifications, Detective SoD, On-boarding of accounts and applications\nExecute compensating controls where IT implementation is not yet ready\nUnderstand and define requirements and business processes\nSupport the Access Lifecycle processes for the strategic solution as well as compensating controls for tactical solutions\nUnderstand and proactively manage operational, regulatory, and other risks related to the service\nSupport maintenance of IAM and PAM information assets across the organisation, including documentation, catalogues and risk assessments\nSupport UAT and Functional Testing of the IAM solutionYour skills and experience:Knowledge of IAM and PAM processes and solutions\n1 to 2 years of experience in Information Security, specifically Identity and Privileged Access Management\nUnderstand the large scale thinking and approach of a global service\nProven experience in an ID administration role\nProven experience in an IAM Business Analyst role\nAttention to detail and able to deliver high quality material to agreed timeframes\nGood understanding of Information Security Control frameworks\nStrong analytical and problem solving skills\nStrong relationship management and communication skills\nKnowledge of the financial services industry and its compliance issues is a plusHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}