{
    "Job ID": "69875615",
    "Description": "First Abu Dhabi Bank is an inclusive environment where each person values the experiences, perspectives, ideas and beliefs of others. We’re in a unique position to learn from all our colleagues, combining international experience with deep cultural knowledge and local expertise. At FAB, you’ll have the support of your team and a strong relationship with your line manager, who will trust you with responsibility and recognize your good performance. As we embrace different ways of seeing the world, listening to each other and respecting different viewpoints, we grow stronger – together.Actively supports the client facing front office function for Relationship Managers of Elite Banking and Key Client Group UAE office(s); supports customers and provides support to the Business Planning and support team\nAct as first point of contact to External & Internal persons, clients, prospects & FAB staff.\nActive role using her /his multi lingual skills with all other FAB departments within & outside  the UAE\nThe receptionist is often the first business contact a person will meet at any organization. Therefore, it is an expectation that the receptionist maintains a calm, courteous and professional demeanour at all times regardless of the visitor's behaviour. Some personal qualities that a receptionist is expected to have in order to do the job successfully include: cheerfulness [always with a smile], attentiveness, a well-groomed appearance, initiative, loyalty, maturity, respect for confidentiality and discretion, a positive attitude and dependability.\nThe person must be a strong character coupled with good manners & discretion who can handle difficult personalities (male & female) without aggression.\nAt times, the job may be stressful due to interaction with many different people with different types of personalities, and being expected to perform multiple tasks quickly.\nResponsible to receive and greet all persons.\nHandles all visitors & clients.\nHandles initial client leads, information, & complaints\nThe business duties of the receptionist include: answering visitor inquiries about Elite Banking directing visitors to their destinations, sorting mail, answering incoming calls on multi-line telephones, setting appointments, filing, records keeping, keyboarding/data entry and performing a variety of other office tasks, such as faxing or emailing. The office expects the receptionist to ensure that the lobby area is kept tidy.\nThe receptionist may also assume some security guard access control functions for an organization by verifying employee / client identification, issuing visitor passes, and by observing and reporting any unusual or suspicious persons or activities.\nHandles the travel on duty bookings in liaison with RMs, travel agencies & HR.\nMonitors & reports the travel on duty of PB UAE on a monthly basis for MIS purposes.\nThe job holder must be a presentable and self- motivated person with exceptional interpersonal, communication, relationship and multi lingual skills.\nAll other tasks as reasonably requested.Preferably a university degree in business, languages, economics or marketing.\nAbility to work within a team and develop professional relationships.\nLanguage skills in English and Arabic.\nGood track record of performance.\nKnowledge of locations within the UAE.\nGood administration skills.\nAbility to work within a team and develop relationships\nMinimum 3-5 years’ experience in a similar role with a proven track recordJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}