{
    "Job ID": "69873121",
    "Description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease. We’re looking for people who are determined to make life better for people around the world.As Lilly strives to achieve these objectives, we have embarked on building and in-housing a state-of-the-art “next-best action recommendation engine” platform to enable more agile sales and marketing operations. This platform will- ingest a wide variety of data sources,- run advanced personalized marketing models- and integrate seamlessly with all other Lilly SF and marketing operations platformsto provide recommendations on “what should we do next” to the sales and marketing teams at the individual doctor level, enabling better decision making and improving customer experience.As part of this team, we are excited to welcome professionals interested in driving cutting-edge technology-driven business operations, with a focus on quality assurance and continuous improvement. This team will be responsible for operating the omnichannel recommendation engine platform, which will drive SF and marketing campaigns for Eli Lilly USA.Mandatory Requirements:Technical and behavioral skills/qualifications:Bachelor’s degree, preferably in quantitative/IT related fields (Engineering, operations, IT/IS)\n>3 years total experience, with 1+ years’ in manipulating and mining large data sets using SQL, including ability to debug code written by others, good working experience in TechOps with focus on Process improvement/innovation.\nStrong understanding of how technology-driven data management and analytics drive better personalized marketing campaigns.\nGood verbal and written communication to enable successful delivery in a dynamic environment in a large matrixed team.Preferred qualifications:Prior experience in executing operations programs that use data-driven decision engines, in sales (through Veeva etc.) or digital marketing (through SFMC, Adobe etc.)\nCertifications in SQL or other querying/programming languages; project mgmt. certifications\nExperience working in Agile/Scrum setups, using JIRA or other relevant platforms.\nFundamental understanding of the digital marketing ecosystem (customer data, analytics, content creation and management, A/B testing etc.)\nPrior experience with executing US pharmaceutical SF and digital marketing operations (how Veeva, emails, web, P2P channels are used for marketing to doctors) and specific services (Epocrates, Medscape, Doximity etc.), either with an agency or  through in-house service centersEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.Lilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.#WeAreLillyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}