{
    "Job ID": "69875626",
    "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The opportunity:As a Lead Software Engineer you will utilize superior knowledge and experience to perform complex product design, systems analysis, research, maintenance, troubleshooting and other programming activities. You will also play a key role in the development of work teams by providing others with direction and leadership. You will also be involved in cross-team planning activities such as providing status updates and coordinating activities.\n \nYou are great at:Produce high quality code according to design specifications.\nDetailed technical design of highly complex software components.\nUtilize superior analytical skills to troubleshoot and fix highly complex code defects.\nPropose creative solutions or alternatives balancing risk, complexity, and effort to meet requirements.\nLead software design/code reviews to ensure quality and adherence to company standards.\nLead and mentor other team members.\nCollaborate with Product Owner to plan and prioritize tasks for others to support the achievement of team objectives.\nWork across teams and functional roles to ensure interoperability among other products, including training and consultation.\nProvide status updates to stakeholders and escalates issues when necessary.\nLead and/or participate in the software development process from design to release in an Agile Development Framework.    What it takes: 8+ years of relevant experience\nBachelor’s degree in Computer Science or related field\nSolid experience in Java\nSolid background in SQL, Java, J2EE, web services and SOA and REST services.\nSolid experience in J2EE Web technologies and frameworks\nGood Experience in working with J2EE App server (Weblogic, Tomcat,Jboss, Websphere)\nExperience in administering J2EE Servers\nGood experience in ORM, DB tools and frameworks\nExperience in Client side technologies (CSS, HTML, JavaScript ) and frameworks.\nKnowledge / experience with Javascript backbone , ReactJS is advantage though not mandatory\nPhp & cloud skills is advantage though not mandatory\nExperience in  Configuring  and working with LDAP and SSO Systems\nExperience in handling performance and Security related aspects of web applications\nPerforms design, development, testing, documentation, and analysis and maintenance activities related to software applications.\n Contribute to the continual improvement of our agile development processes.\nMaintain up-to-date documentation on processes and code.Fundamentally good programming and debugging skills\nStrong hands-on experience with building enterprise applicationsExperience liaising with groups of people across several geographiesExcellent communication and time management skillsOpenText is an equal opportunity employer that hires and attracts talent regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, marital status, sex, age, veteran status, or sexual orientation. At OpenText we acknowledge, value and respect diversity. We draw on diversity of thought and experience to reflect the rich array of cultures representing our broad global customer base.OpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. Should you require accommodations during the selection process, please contact accommodationrequests@opentext.com.Subject to applicable laws and regulations, OpenText’s global vaccination policy requires all employees to be fully vaccinated against COVID-19 to enter an OpenText office. Accommodations may be available for specific roles.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}