{
    "Job ID": "69872662",
    "Description": "Position: Location:Ensure Engineering Dossier are delivered with a robust Mechanical Rotating Engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of NOC standard, project basis of design, and SOR.\nEnsure assigned project tasks are well managed in accordance with the project execution plan and contractual requirements that includes but not limited to:\nThorough, efficient, and timely review of project Mechanical Rotating discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome.\nEnsure the proper realization of the Mechanical Rotating Engineering design in compliance with NOC Standard, project specifications and procedures, time schedule, required level of quality and safety\nsupport project studies and meetings related to the Mechanical Rotating discipline as per project approved gate levels and design maturity.\nIdentifying potential risks and scope changes, conducting initial impact assessment to provide detailed information to Mechanical Rotating Engineering Lead.  \nQualification: Engineering degree in Mechanical Engineering.\nExperience: Minimum 12 years’ experience as Rotating Engineering in Oil and Gas industry.\nExperience as rotating engineer in project involving gas turbines and compressors Computer \nStrong leadership skills and good communication skills.\nGood analytical skills.\nFamiliar with Total general specifications is a plus, and with relevant codes and standards,\nLanguage: fluent English,\nAbility to work on projects in a complex and multicultural environment.shruti.kadam@nesfircroft.comJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Doha, Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}