{"Job ID": "69872793", "Description": "Role        : Head of Call Center\nLocation : Abu Dhabi\nRole Purpose:\nThis role’s primary goals is: To manage the activities and operations of the Contact Centre unit, assist and back up the Head of the Division in terms of sales and service, ensure departmental coordination with respective branches and departments for solving customer queries, ensure reduction of cost per transaction and the development of the unit as the most cost-effective sales force of the back through budgeting and costing, audit, and monitoring of risk across all activities.Play a pivotal role in driving cost efficiency while enhancing our customer experience through the strategic utilization of digital channels. Responsible for overseeing the daily operations of our contact center, ensuring smooth customer interactions, and optimizing resource allocation to minimize operational expenses. This role demands a forward-thinking individual with a keen eye for data-driven decision-making and a passion for enhancing customer engagement through digital platforms.\n    \nKey Accountabilities of the role      Cost Management and optimization: Develop and execute strategies to optimize operational costs within the contact center, including Staffing, technology, and other resources. Monitor and analyze key performance metrics to identify cost-saving opportunities and areas for improvement. Foster a culture of continuous improvement and employee engagement.\nDigital Channel Optimization: Lead the transition of customer interactions from traditional voice channels to digital channels, such as chat, Mobile banking, Internet banking, and self-service options. Develop and implement a roadmap for digital channel expansion, ensuring seamless integration and functionality. Collaborate with IT and customer experience teams to enhance digital self-service options.\nManage the effective achievement of the team’s objectives through setting individual objectives, managing performance, developing the team, and providing formal and informal feedback to maximize overall performance, engagement, and motivation\nContribute to the preparation of the business area’s budget and manage and monitor the financial performance against the budget so that areas of unsatisfactory performance are identified, rectified promptly and potential performance improvement opportunities are capitalized upon\nDrive a culture that is focused on exceeding customer expectations, create, and use methods to reward, recognize and drive the delivery of service excellence\nEngage customers as stakeholders to develop a unique customer value proposition for the business and drive the delivery of this to all customers in alignment with the strategy, leading by example to create a customer-centric environment and facilitating effective team and cross-functional working to achieve business results\nAchieve set targets in terms of service standards for the Contact Centre, succeed in attaining satisfactory NPS ratings, champion and propagate the expected service standards throughout the unit by performing model service delivery in all interactions with customers\nCapitalize on the usage of electronic/alternate channels like Online Chat, Internet Banking, SMS Mobile Banking, Voice Biometrics, IVR system, and Mobile Banking and ensure customers’ queries are handled, taking appropriate steps to ensure that the marketing strategy is communicated with absolute clarity to all team members to follow, ensure customer satisfaction and error-free transactions by supporting and overseeing the activities of the frontline staff\nAdhere to all relevant organizational and departmental policies, processes, standard operating procedures, and instructions so that work is carried out to the required standard and in a consistent manner while delivering the required standard of service to customers and stakeholders\nManage and motivate the team to ensure they contribute to and participate in, the identification and implementation of change initiatives, programmers, and projects in line with the bank’s standards.\nAct as the Voice of the Customer, championing change and improvements across the customer experience, driving change, and influencing future change/projects to support and improve customer experience.\nDemonstrate Our Promise and apply the bank Service Standards to deliver the bank’s required levels of service in all internal and external customer interactionsSpecialist Skills / Technical Knowledge Required for this role:Arabic Native \nDecision-making skills\nPeople management skills\nRisk management skills\nAnalytical skills\nAdvanced MS Excel, Word, PowerPointJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}