{
    "Job ID": "69873041",
    "Description": "Job Purpose:Developer with strong analytical and technical ability with over 3 years of experience in enterprise Web application development using .NET and .NET Core technologies and Oracle (PL/SQL) as backend database.  \nShould have working knowledge of Document Management Systems\nShould have hand-on knowledge of C#, JavaScript, JQuery, HTML5, Angular\nHands-on experience in creating Web APIs and REST Services\nAbility to work independently, good communication skills, has experience in working on complex and medium to large projects. \nPerson should have worked in Agile/DevOps Environment.Responsibilities:Implement and maintain a suite of applications for Document Management Platform\nImplement a framework to integrate into legacy systems and external systems.\nHands on coding, authoring unit tests, performance tests and maintaining high code quality.\nNeeds to be able to react and provide quick turnaround to business requirements and management requests\nWell versed in Agile Development Life CycleRequired Skills:Over 3+ years of experience in enterprise Web application development using .NET (C#), .NET Core and Oracle as backend database.\nAbility to work independently, good communication skills, has experience in working on complex and medium to large projects.\nExpertise in Git and developing in Continuous Delivery pipeline Hands on experience in .NET, HTML, JAVSCRIPT,XML/XSL,JSON\nExperience of Document Management\nExpertise in WebServices –REST, SOAP.\nExpertise in mocking, unit testing (NUnit) and perf testing of solutions.\nShould possess basic Unix knowledge to be able to write and understand basic shell scripts and basic Unix commands\nStrong design skills on .NET Solutions\nHands-on experience in Angular\nGood understanding on .NET core micro services\nAngular knowledge is preferable but is not a must\nFinancial markets background is preferable but is not a mustQualifications:Bachelor’s degree (in science, computers, information technology or engineering)\nCandidate should be willing to work late in the evening India time on need basis in order to interact with US onshore team and to meet urgent requests by Clients.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}