{
    "Job ID": "69872677",
    "Description": "Basic Requirements:  Education: Graduate in Science / Pharmacy discipline\nExperience: Preferably 5 plus years’ experience in Quality Assurance in Quality Management Systems, Documentation management and Pharmaceuticals formulations\nSpecial Knowledge: Good Knowledge of Documentation/ Regulatory requirements & Quality Management Systems.\nEffective verbal and communication skills, collaborative team member & team leader.\nCapable to work independently & efficiently.\nBusiness understanding: understanding the pharmaceutical industry.Responsibilities:Job Purpose: External Supply Quality Strategy & Governance. Primary responsibilities for this role are as follows:Deviations & CAPA management – To drive Deviation investigations with adequate & timely closures and CAPA management in ES India Rx and adherence to GSK QMS expectations.\nChange Control management – To drive implementation of changes through robust Change Management System in ES India Rx and adherence to GSK QMS expectations.\nComplaints management – To drive Compliant Management with adequate & timely closures in ES India Rx and adherence to GSK QMS expectations.\nDocumentation management – To support cross functional team in defining document management and control culture. Management of document life cycle as per GSK QMS expectations in ES India Rx.\nTo facilitate ESQ Tier calls, ES Quality weekly escalation calls and to provide support in Regional Quality Weekly Escalation by providing relevant data on weekly basis.\nTo be Inspection Ready all the time for all the profiles/activities managed.Key Responsibilities:Deviation & CAPA management:•To align the Deviation & CAPA management process as per GSK QMS requirements.To drive Deviation process through adequate investigations & devising appropriate CAPAs.To track and monitor all the deviations of entire ES functions & CMOs for timely closure.\nTo track the progress of all CAPAs generated at all ES functions for timely closure.•To report Deviation & CAPA KPIs & any escalations to ES QualityCouncil/ Governance Board forums periodically.•To perform annual review of Deviation & CAPA management process to identify opportunities for improvement and process simplification.Change Control management:To align the Change Control management process as per GSK QMS requirements.\nTo drive Change Control AL Panel review meeting to review and approve proposed change with effective impact assessment & action plan, in timely manner and support business with respect to change control process.\nTo review Change control raised in VQMS for the adequacy in-line with applicable procedure.\nTo support ES Team in trending & tracking of Change controls & it’s actions and access to associated software.\nTo co-ordinate for deployment of updates in Veeva QMS process for Change Control process in ES India Rx.\nTo report Change control KPIs & any escalations to ES Quality Council/ Governance Board forums periodically.\nTo perform annual reviews of Change Control Process to identify opportunities for improvement and process simplification.Complaints management:To align the Complaints management process as per GSK QMS requirements.\nTo provide support to the investigation into the complaint carried out by the team in the manufacturing plant, to ensure that the complaint sample is provided to the manufacturing site on time and availability of any other material needed by the CMO for further investigation.\nTo ensure required investigation is completed and corrective action is implemented on time; track the timely closure of complaints & to escalate any critical/major to appropriate stakeholders immediately.\nTo provide support related to any additional information needed by the manufacturing site to carry out the investigation.\nTo co-ordinate for deployment of Veeva QMS process for Complaints management process in ES India Rx.\nTo report Complaints management KPIs & any escalations to ES Quality Council/ Governance Board forums periodically.\nTo perform annual reviews of Complaints management process to identify opportunities for improvement and process simplification.Documentation management:To align the Documentation management process as per GSK QMS requirements.\nTo manage document life cycle as per GSK global retention policy.\nTo manage documents generated in ES (Hard and soft copies) are maintained in respective repositories in co-ordination with Departmental Record Coordinators.\nTo issue document reference numbers to associates in ES as per request & maintain logs.\nTo drive routine meetings with departmental record coordinators of ES, as per agenda.\nTo maintain List of deputies to sign key documents, System Register etc.\nTo Support ES team members for swift usage of Digital Signatures and co-ordinate with Global SMEs for trouble shooting if any.\nTo support VQD users of ES India Rx from Documentation perspective.\nTo perform annual reviews of Complaints management process to identify opportunities for improvement and process simplification.Quality Escalation Call & Tier calls:To facilitate ES Quality weekly escalation call and to provide support in Regional Quality escalation calls by providing relevant data on weekly basis.\nTo conduct ES Quality Tier meetings as per GPS standards on daily basis.\nTo ensure respective profile owners update their daily/weekly/monthly data on MS Teams.\nTo provide a daily update on any overdue/ issues to ESQ QMS Lead and ESQ Head based on daily discussion.Additional responsibilities:To perform gap analysis between GSK documents QMS and ES Rx India LSOPs\nTo prepare and revise of the SOPs as when required.\nTo conduct MM/IBM audits as per the schedule.\nTo ensure the all-time audit/inspection readiness for above mentioned job profile.\nTo ensure all the KPI targets for relevant profiles are achieved and provide the relevant data/updates in this regard to ES Quality council and other forums.\nTo identify and log the risks in RMS for any risks foreseen relevant to the assigned profile.\nTo ensure VQMS actions & trainings in Mylearning/other tools are completed on time.\nTo publish daily updates of relevant Power Bi dashboard.\nTo perform any other task assigned by line manager.At GSK we value diversity (Gender, LGBTQ +, PwD etc.) and treat all candidates equally. We aim to create an inclusive workplace where all employees feel engaged, supportive of one another, and know their work makes an important contribution.*LI-GSKWhy Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.It has come to our attention that the names of GlaxoSmithKline or GSK or our group companies are being used in connection with bogus job advertisements or through unsolicited emails asking candidates to make some payments for recruitment opportunities and interview. Please be advised that such advertisements and emails are not connected with the GlaxoSmithKline group in any way.GlaxoSmithKline does not charge any fee whatsoever for recruitment process. Please do not make payments to any individuals / entities in connection with recruitment with any GlaxoSmithKline (or GSK) group company at any worldwide location. Even if they claim that the money is refundable.If you come across unsolicited email from email addresses not ending in gsk.com or job advertisements which state that you should contact an email address that does not end in “gsk.com”, you should disregard the same and inform us by emailing askus@gsk.com, so that we can confirm to you if the job is genuine.         Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}