{
    "Job ID": "69875357",
    "Description": "Serviceability ArchitectAs we progress with the Serviceability Transformation of our company, we’re looking to onboard a Serviceability Architect to define the Serviceability roadmap within the Secure Power Division. Joining the Serviceability Excellence Chapter, they will be responsible for the Services innovation stack within the Secure Power Division, influencing the product roadmap to implement the relevant technical evolutions to enable Services. As a pillar of the Serviceability Transformation, they will need to deliver on specific roadmap with a strong focus on the Services Business Growth. This is a Global role that will be preferably located in India, although candidates from Europe may be considered. If you are capable of seeing our product roadmap and medium-term evolution from a services standpoint, and our services roadmap from a product standpoint, this job may be for you.Main Responsibilities:Own the innovation stack on services for the product division roadmap\nInfluences the Product Innovation Strategy\nParticipates in the innovate stage of product offer development\nShares with Services Leagues the product roadmaps\nTranslates Services Goals into Product Requirements\nIdentify Project and product evolutions for Serviceability Experts\nLead the deployment of the Serviceability Guidelines at Division level for Electrical / Mechanical, Digital and Circular Services\nDrive the technical and business enablement of Services Roadmap through Product development\nFacilitates the collaboration between Services and Product Leagues\nParticipate in the incubation and exploration phase of the Offer Creation projects prescribing features and specifications that will enable future services\nDrive the engagement of Services within the Product LoB Leagues with a growth mindset\nReveal the customers’ needs related to the offer serviceability and ensure the integration of these needs in the offer roadmapInteraction:Product LoBs: League Leaders, Product Owners, EcoDesign Leaders, Strategy Leaders\nServices LoB: League Leaders, Innovation LeadersKey Metrics:Services Attachment Rate for Division\nServiceability index for Division PortfolioProfile:Strong knowledge of Services’ Customer Applications\nProduct Expertise in Secure Power\nHolistic (Services / Product) long term vision\nServices mindset\nVocal and influencer\nPresentation and training skills\nHigh power of collaboration, influence, and assertiveness\nTechnical background and design experience\nStrong initiative and self-motivation\nCritical thinking and problem-solving skills\nPlanning and organizing\nDecision-making, renunciation management\nAbility to work cross-functionally with other departments \nAbility to multi-task and deliver high quality results.\nStrong synthesis capabilities and analysis\nFluent EnglishJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}