{
    "Job ID": "69873568",
    "Description": "IntroductionYour Role and ResponsibilitiesAre you a lead software engineer with a passion for building scalable micro-services that handlemassive amounts of data and form the backbone of customer-facing managed services? We are agrowing SaaS company centred that helps customers enterprises plan, analyse, and optimize their IT spending across traditional and cloud infrastructure. We are looking for a Principal Software Engineer who is passionate about building large scale services optimized for performance, efficiency, and handling lots of data. You will be responsible for designing new services, revamping existing ones, and guiding the team’s overall system design and architecture.As part of our growing team, you will:Build cloud-natives services that solve new and existing business challenges and customer needs.\nDesign and implement resilient systems and that horizontally scale.\nDive into complex architectures and research and identify new technologies to solve tough problems.\nInfluence multiple teams and hold a high bar for systems architecture, operations, and quality.\nMentor and foster career growth for junior engineers.Required Technical and Professional Expertise12 to 15 years of experience in enterprise level software architecture, design, development (architecture, design patterns, reliability and scaling) of new and current systems\nExperienced in Full Stack product development\nBachelor’s Degree in computer science or a related field\nComputer Science fundamentals in data structures, algorithm design and problem solving.\nExtensive knowledge and deep understanding of Java and related technologies\nExperience with modern software development methodologies: Agile/Kanban, CI/CD, DevOps, etc.\nProficiency in Full Stack product development\nProficiency with Java is essential.\nProficiency with React, TypeScript, JavaScript, HTML CSS is essential\nProficient with REST APIs\nProficient with product development experience on both front end and back end\nExperience with AWS and/or other public cloud technologies.\nDatabase Experience (query optimization, index generation, caching) or NoSQL DBs a plusPreferred Technical and Professional ExpertiseStrong customer focus, ownership, and drive\nDemonstrated capability to provide depth and breadth technical leadership\nExperience in SaaS Solutions\nAt least one additional modern programming language, such as Go, Scala, Python.\nGood knowledge of advanced concepts in microservices, containers\nExperience in mentoring, recruiting, and team-building\nStrong communication skills, both written and verbalJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}