{"Job ID": "69872585", "Description": "Department Profile Morgan Stanleys Institutional Equity Division (IED) is a world leader in the origination, distribution and trading of equity, equity-linked and equity-derivative securities. Our broad and deep client relationships, market-leading platform and intellectual insights enable us to be a world-class service provider to our clients for their financing, market access and portfolio management needs. Global Markets Group is the offshoring arm of Morgan Stanleys Equity businesses in India. It covers functions across IED ranging from those associated with sales, trading, analytics, strats to risk management. Background on the Team The Business Control Unit (BCU) risk team within Institutional Equity Division (IED) provides oversight of regulatory and firm requirements for supervision, surveillance, entitlements, and information security by performing in-depth assessments and implementing consistent programmatic coverage globally for Institutional Equities. The team seeks to ensure front-office compliance with all applicable rules and regulations governing the firm, as well as adherence to internal standards, controls, and policies. The BCU Risk team fulfils a front office advisory role as the first line of defence. The scope includes escalation, oversight, project execution, control ownership and is the default owner for division-wide audit and regulatory issues. Primary Responsibilities Reviewing internal policy breaches on daily basis, investigate, educate and escalate as necessary Trend and identify repeat behaviours and establish a process to address recurrence Reviewing electronic communications and escalating where these are not in line with internal policies Create management reports to highlight issues, trends, new regulatory changes etc. Support BU projects to create, enhance or develop procedures/protocols Engaging with other regional teams to focus on and deliver increased automation and standardization across applicable surveillance processes Engaging with BCU contacts and other stakeholders to build awareness of Non-Financial Risk and continued focus on proactive and effective surveillance and supervision Drive discussion with relevant Risk and Compliance contacts to validate the existing review process and alert disposition logic Help ensure that BCU activities comply with relevant legal, regulatory, and Firm requirements Partner with stakeholders to design and implement new reports to assist with the Firm keeping pace with the evolving Regulatory environment Partner in projects related to improving the review process, reduce false positives or further enhance the report logicJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}