{
    "Job ID": "69875872",
    "Description": "VavaCars 2. el araç alım satımına getirdiği yeni yaklaşımla bu alanda devrim yaratmakta ve bunun için olabilecek en güvenilir platformu sağlamaktadır. İstanbul Pendik lokasyonunda yer alan, Türkiye'nin en büyük araç yenileme merkezlerinden biri olan tesisimizde görevlendirilmek üzere Oto Kuaför Ustası arıyoruz.Kararlı ve geleceğe odaklı bir ekibe dahil olacak ve bizler için de kilit bir pozisyonda görev yapacaksınız. Yeni kurulan bir şirketin heyecanını yaşadığımız için hem ekip kültürümüzün belirlenmesine önemli katkılarda bulunma fırsatına, hem de faaliyetlerimizi yürütürken şirket içi uygulamalara dair en yüksek standartları tesis etme imkanına sahip olacaksınız. Şirketimiz faaliyetlerini büyüttükçe ve kişisel ve mesleki gelişim fırsatı sunma imkanı buldukça, siz de kendinizi geliştirme imkanı bulacaksınız.Temizleyici, koruyucu ve yenileyici ürünleri doğru şekilde kullanarak araçların fabrika kondisyonunu geri kazandırılması ve korunmasının sağlanması\nUygun polisaj ekipmanlarını kullanarak pasta, cila ve diğer ara katman ürünlerinin boyalı yüzeylere prosedürlere uygun şekilde uygulanması\nVakum, döşeme yıkama makinası ve buharlı temizlik ekipmanlarını kullanarak araçların tavan, taban ve koltuk döşemelerinin, plastik trim aksamlarınn temizlenmesi, fabrika kondisyonuna geri getirilmesi\nSeramik kaplama yapılması ve tüm katmanların prosedüre uygun olarak tamamlanması\nEğitim fırsatlarından yararlanarak güncel bilgi seviyesini ve teknik yeteneklerin sürekli geliştirilmesi\nTüm kuaför ekipmanı ve özel takımların düzgün çalışmasını, temizliğinin ve düzeninin sağlanması\nÇalışma yerine dair günlük tertip ve düzen rutinlerinin takip edilmesiJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}