{"Job ID": "69873343", "Description": "We are recruiting a dedicated and focused Account Manager responsible for business in Dubai & Northern Emirates. If you have 3+ years’ experience in Information technology / Cyber Security Sales, have a flair for client communication and understand consumer behavior, we’d like to meet you. Ideally, candidates for this role will know how to meet ambitious individual and team-wide sales targets.Your prime role as an Account Manager will be to ensure that our clients are contented with our services. The fundamental task is to provide various companies with cyber security solutions and services to aid them in securing their business across multiple domains including finance, government, real estate, healthcare, and technology in Dubai & Norther Emirates.Our employees witness various opportunities to grow in their career and advance in their positions globally. We have a dynamic Senior Executive Team in place that is involved with all the aspects of our business – ensuring that the talent our employee holds is nourished and encouraged to boost the growth of both our employees and the company.Sales HUNTER by nature, should be self-motivated enough to call, meet and manage the customer.\nCreate customer opportunities and convince customers to allocate their yearly security budgets to us.\nServe as the lead point of contact for all customer account management matters.\nBuild and maintain strong, long-lasting client relationships.\nDevelop trusted advisor relationships with key accounts.\nEnsure the timely and successful delivery of our solutions according to customer needs and objectives.\nClearly communicate the progress of monthly/quarterly initiatives to internal and external stakeholders\nDevelop new business with existing clients and/or identify areas of improvement to meet sales targets.\nForecast and track key account metrics – weekly, quarterly & monthly sales results and annual forecasts)\nPrepare reports on account status.\nCollaborate with sales team to identify and grow opportunities within territory.\nProactively work with our support team to close escalations of managed existing customers\nBuild market position by locating, developing, defining, and closing business relationships.\nProtect organization’s value by keeping information confidential.Must have 2-5 years’ experience as an Account Manager or relevant B2B sales.\nExperience in exceeding monthly company targets\nMust have existing contacts in IT sector of Dubai & Northern Emirates Market\nBachelor’s degree or higher, preferred.\nMust speak fluent English (Arabic will be an added advantage)\nMust have top level executive relationships.\nMust have strong negotiation and presentation skills.\nGood presentation skills\nAbility to handle multiple priorities and work under stress.\nSelf-driven and motivated\nMust have a valid UAE driving license and be based in Dubai & Northern emirates.We are a high-paced Cyber Security company offering one of the most advanced and integrated portfolios of security solutions and services for SME’s and Enterprises. We are a global leader in Cyber Security solutions and services, headquartered in Dubai, UAE, and have 100+ employees world-wide.Our team is immensely dedicated and passionate at the same time - and we challenge them consistently to go that extra mile; thus, utilizing their passion efficiently to help them reach their highest potential and propel them to become better every day.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}