{"Job ID": "69874358", "Description": "DescriptionEstablished in the region for 40 years, PwC has around 8,000 people in 12 countries across the region: Bahrain, Egypt, Iraq, Jordan, Kuwait, Lebanon, Libya, Oman, the Palestinian territories, Qatar, Saudi Arabia and the United Arab Emirates.Our regional team operates across the Middle East bringing international experience delivered within the context of the region and its culture. We can bring the collective knowledge and experience of more than 328,000 people across the entire global PwC network in advisory, assurance and tax to help you find the value you are looking for.Job Description & SummaryPwC Global OverviewWith offices in 152 countries and almost 328,000 people, we are among the leading professional services networks in the world. We help organisations and individuals create the value they are looking for, by delivering quality in Assurance, Tax and Advisory services.PwC Middle East OverviewEstablished in the region for 40 years, PwC has around 7,000 people in 12 countries across the region: Bahrain, Egypt, Iraq, Jordan, Kuwait, Lebanon, Libya, Oman, the Palestinian territories, Qatar, Saudi Arabia and the United Arab Emirates.Our regional team with its tailored solutions, brings international experience, helping our clients meet the challenges and opportunities of doing business in the Middle East market, and beyond.Line of Service OverviewOur Middle East Assurance practice includes over 2,300 people based in 12 countries across the region and is part of PwC’s global network that is operating worldwide. PwC Middle East’s Assurance practice combines the right mix of human-led and tech powered solutions to provide our clients with quality audits and other risk services that create confidence and impact in our region and across society.Business Unit OverviewUnder Assurance Center of Excellence (ACE), an in-house Translation centre that is based in Jordan, and it contributes to the success of our Delivery Centre by supporting our mainstream Assurance departments offering translation services to our key clients in a range of industries across the region.What is expected from you?Due to the rapid growth of our regional Assurance Centre of Excellence (ACE), we currently have opportunities for ambitious and motivated translation professionals who are able to communicate comfortably in English and Arabic as part of virtual teams.Your job duties will include but will not be limited to:Assisting in the translation of the client’s financial statements, proposals, reports, letters and various other types of documents using top notch CAT Tools\nTranslating texts from English to Arabic and vice versa using the appropriate CAT tools and other software\nAdhering to the specific instructions given for each request you will handle; this includes, but is not limited to, translation, formatting, self-review and technical support for others when neededWhat will you bring?You are ambitious and get use of opportunities to grow and develop. In addition, you recognise yourself in the following characteristics:Having a Bachelor’s degree in Translation, Applied Linguistics, English and Arabic Literature, or any relevant major\nHaving 0 - 2 years of experience\nExcellent communication, presentation, and interpersonal skills that allow you to thrive in a team environment\nBilingual proficiency in Arabic and English (oral and written) is a plus\nPrior translation/ proofreading experience in financial/accountancy/tax/consulting and related fields is a plus\nExcellent IT skills in MS Office tools, and knowledge in Abbyy FineReader and CAT Tools is a plus\nWorking under pressure and meeting multiple deadlines a day while maintaining a positive attitude and customer service mindset\nExcellent organisational and project management skills, having the ability to prioritise workload whilst being resilient and being able to cope well under pressure and meeting tight deadlines\nAbility to collaborate with colleagues across different countries in the region on translation projects to ensure they meet the client’s expectations.\nWillingness to challenge the ‘norms’ and to create a cohesive and effective working team\nCommitment to valuing differences and working alongside diverse people and perspectivesThe skills we look for in future employeesAll our people need to demonstrate the skills and behaviours that help us deliver our business strategy - that make up “ The PwC Professional”.The PwC Professional framework plays a significant role in outlining the capabilities needed by our people to flourish, learn and develop together as leaders at every level. The framework exists to support the development and career progression of our people, helping them to meet the expectations of our clients, colleagues and communities in today’s changing global marketplace.Why you’ll love working for PwCWe’re a business that leads with the heart and we prioritise our people. Led by our value of care, we find ways to help our people, our clients and one another. With PwC, you will ignite a meaningful career and will be provided with a range of financial and non-financial rewards and benefits designed to encourage your growth, like:A competitive remuneration plan in which you will be rewarded for your success and acknowledged for the value you provide to our company .\nWe encourage an inclusive and diverse culture where people can be themselves, are valued for their strengths and are empowered to be the best they can be. This makes us strong as a business, enabling us to solve important problems and deliver value to our clients.\nA flexible workframe to encourage work-life balance.\nWe care about our employees' mental health and well-being by providing specialists to offer advice, as well as meditation, yoga, and other relaxation online sessions.\nLimitless opportunities for continuous learning and digital upskilling.\nA friendly atmosphere that encourages innovative mindsets, relationships development, and assisting others in growing and working in ways that bring out their best.\nA competitive Schooling allowance and insurance packages (As per PwC policy).To learn more about our new equation that built this culture please visit this link.If you’re looking for a place that fuels your ambition to make a difference, that matches your curiosity with continuous learning opportunities and reimagines ways of working to enable you to lead a more balanced life, then you’re a future PwCer.Learn more about “Life at PwC ME” through this link.Travel RequirementsAvailable for Work Visa Sponsorship?Government Clearance Required?Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Cairo, Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}