{"Job ID": "69874049", "Description": "S&P Global PlattsThe Role: Senior Software DeveloperThe Team:            At S&P Global Platts, we provide the insights; you make better informed trading and business decisions with confidence. We’re the leading independent provider of information and benchmark prices for the commodities and energy markets. Customers in over 150 countries look to our expertise in news, pricing and analytics to deliver greater transparency and efficiency to markets. S&P Global Platts coverage includes oil and gas, power, petrochemicals, metals, agriculture, and shipping.S&P Global Platts is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.platts.com\n Software Engineer (Full Stack)Hyderabad, IndiaJob Title: Full Stack Software EngineerCommodity Insights, S&P Global – Responsible for the ongoing software development of data ingestion systems. Drawing on a global network of software development experts this exciting area is rapidly expanding to meet the needs of our complex and sophisticated product line.SummaryTo work as part of a team delivering high quality software products within agreed timeframes according to the requirement of the business. Products are typically used by internal customers.Roles and Responsibilities•            Participate as part of a project team to design, code, unit test and implement programs to support the portfolio management process•            Use established testing procedures to ensure application is thoroughly tested throughout development and before release•            Work as part of an agile team to identify and deliver solutions to prioritised requirements•            Perform other duties as requiredRequired Qualifications & Experience•            Degree in computer science or equivalent•            At least 3 years professional experience of software development•            Analytical and problem-solving skills•            Familiarity with agile development methodology•            Able to work effectively as part of a project/program team•            Able to clearly express ideas and be comfortable in written and oral communicationTechnical Proficiencies•            Programming languages and frameworks: Angular, C# .Net, SQL, GIT, CI/CD•            Cloud Technologies: AWS (S3, Lambda, SNS, RDS)•            Unit testing and code reviews•            Database languages and technologies: Oracle, PostgreSQL•            Operating Systems: Linux, WindowsAbout S&P Global Platts:At S&P Global Platts, we provide the insights; you make better informed trading and business decisions with confidence. We’re the leading independent provider of information and benchmark prices for the commodities and energy markets. Customers in over 150 countries look to our expertise in news, pricing and analytics to deliver greater transparency and efficiency to markets. S&P Global Platts coverage includes oil and gas, power, petrochemicals, metals, agriculture and shipping.S&P Global Platts is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.platts.com.Equal Opportunity Employer:S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment.If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. -----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}