{"Job ID": "69874522", "Description": "Mission Statement Responsible for Configuration of Communication equipment’s like PLCC/FOTE used in EHV Substations using vendor specific tools and testing of the same Ensure that the Projects delivered by HEIL are configured as per the project requirements and tested, put into service on time, meeting highest HEIL quality and OHS standards. Meet or exceed the customer expectations in testing & configuration of communication equipment’s in line with project requirements. Your responsibilities As a testing and configuration engineer, carrying out the configuration of communication equipment’s like PLCC/FOTE in line with project requirements and testing of communication panels, Substation automation system delivered and actively contribute in the testing team of Grid Automation Systems. Execute the communication projects configurations and testing safely following all safety standards of HEIL as well as customer. Reports Hazards, Near Misses at working location back to office for records and further improvement. Ensure that customer relations are managed in an optimal way. Carryout the Configurations of communication equipment’s like PLCC/FOTE and testing the communication panels as per the documented process description and checklists. Continuous interactions with testing Lead and expert help to carry out the testing works effectively. Report the Configuration and testing project status testing progress & testing plan to testing Lead. Ensure efficient use of the testing assets like Test kits, Tools etc. Ensures project information of any project is fully taken from testing lead and get all communication equipment’s fully configured and tested in line with customer approved drawings and ready for the project specific testing activities before offering the projects to customer during FAT. Handing over the marked-up drawings to engineering for preparing the As-build drawing and onward submission to customer to close the project. Handover the final testing backup CD's, NMS/Micro SCADA system backup, IET workplace backup and other backup as per the checklist to lead. Actively and regularly (Compulsory for every project) provides feedback to Engineering Project Management, manufacturing and quality in way that ensures re-usage of experience. Follow the key process like Test procedures, Time sheets and STAART Meetings. Ensure the usage of the latest tools and latest software versions during project configurations and testing. Continuous learning & acquiring expertise in various protection schemes and communication system to achieve the higher growth in ‘learning curve’. Living Hitachi Energy core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your background: Should be a graduate in Electrical and Electronics engineering or Electronics and Communication Engineering Should have a minimum of 3 years of experience in testing and commissioning of communication equipment’s and panels like PLCC and FOTE. Should have good knowledge on Power system and power system communications requirements Should be ready for frequent travels all over India and overseas wherever assigned for at least next 5 years. Should have e good knowledge on configuration of Telecommunications equipment like PLCC and FOTE and competitors tele communication equipment’s in line with project requirements Should have a minimum of 3 years of experience in commissioning of tele communication systems and equipment’s like PLCC and FOTE. Should have good knowledge on IEC61850 standards, Ethernet, Serial communications. • Should have good knowledge on communication protocols such as Modbus, DNP 3.0, IEC 101, IEC 104, OPC, Should have competency on networking, configuration of managed Ethernet switches. Should have hands on experience on Protocol analyzers like IEC browser and network analyzer tools like wire sharks. Should have certification like CCNA/CCNP basic course networking requirement Proficiency in both spoken & written English language is required.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}