{"Job ID": "69870032", "Description": "Bosch Global Software Technologies (BGSW), is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end to end engineering, IT and Business solutions.\n\nWith over 18000 associates, BGSW is the largest software development center of Bosch outside Germany, indicating we are the Technology Powerhouse of Bosch in India. We have a global footprint with presence in US, Europe and the Asia Pacific region. BGSW is ISO 9001:2008 certified (2012), appraised at CMMI-L5 as per version 1.3 (2011), ASPICE - level3 based on version 2.5 and ISO 15504- 5 and 7, and also ISO 27001 with seven state-of-the-art facilities spread across Bangalore and Coimbatore in India, Ho Chi Minh City in Vietnam and Guadalajara in Mexico, ISO/IEC 20000-1:2011 certified (2014).\n\nWe nurture, build and sustain enduring customer relationships to enable direct operational and strategic benefits to our customers. We make it happen through qualified, motivated and flexible professional associates, who uphold the heritage and values of Bosch - time-tested over 125 years of a successful journey; a journey marked by quality, reliability and innovation of service to enhance the interest of our customers and the community we live in.\n\nWe provide solutions for businesses in primarily three areas:\n\n•Engineering Services\n•IT services\n•Business services\n\nOur focal industries:\n\n•Automotive industry\n•Industrial Technology\n•Consumer Goods and Building Technology.\n\nOur role\n“We see BGSW as helping us to achieve the technological lead we need to have in order to prevail in increasingly competitive world markets….. BGSW is about ensuring product excellence under conditions that allow us to maintain our global competitiveness” – Mr. Franz Fehrenbach, Chairman of the Board of Management, Robert Bosch GmbH.Design the appropriate TAA (Test Automation Architecture) for a given project.\nDesign and develop test automation framework for testing the functionality of software and hardware.\nDesign and develop test  automation strategies based on  product requirements and Software test strategies.\nAnalyze the system under test and determine the appropriate automation solution.\nEnsure proper execution of test procedures and automated test suites and scripts against requirements.\nAnalyze deployment risks and identify technical issues that could lead to failure of the test automation project, and plan mitigation strategies\nApply guidelines that support effective test tool pilot and deployment activities\nAbility to Understand factors support and affect TAS (Test Automation Solution) maintainability.\nDefine metrics that can be used to monitor the test automation strategy and Effectiveness.\nAnalyze test logging of both TAS and SUT(System Under Test) data.\nVerify the correctness of an automated test environment including test tool setup.\nVerify the correct behavior for a given automated test script and/or test suite.\nAnalyze the technical aspects of a deployed test automation solution and provide recommendations for improvement\nAnalyze the automated testware, including test environment components, tools and supporting function libraries, in order to understand where consolidation and updates should be made following a given set of test environment or SUT changes\nAnalyze test automation tools for a given project and report technical findings and recommendations\nCollaborate with development team and verification and validation team to develop test automation solutions.\nMentor and provide guidance to testing and automation team.\nEstablish continuous integration environment for execution of automated tests.Required SkillsExpert in designing and developing test automation frameworks\nExpert in software development using Python.\nExpert in test automation tools and frameworks.\nExperience in Embedded domain.\nExperience in Sensor Domain would be an added advantage.\nISTQB Foundation Level Certification.\nISTQB Advanced Test Automation Engineer Certification would be an added advantage.\nExperience with Continuous Integration and Continuous Delivery pipeline using Jenkins.\nKnowledge on any open-source test automation framework like Pytest\nGood understanding in experience with static code analysis tools & unit testing frameworks.\nKnowledge of Agile Software Development processes\nExperience with defect tracking/management software like JIRA.\nA creative mindset and the ability to approach a problem creatively.Bachelor or Master’s degree in engineering or related technical field.\n10+ years of experience in testing and automating Software/Embedded solutions.\n5+ years of Extensive programming experience in Python.5+ Years of Testing Experience.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Coimbatore, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}