{
    "Job ID": "69873176",
    "Description": "IntroductionYour Role and ResponsibilitiesThe QA Automation engineer having experience with agile methodology and who can develop system level test and automate them. Ability to work on Windows and Unix systems. The QA Automation Engineer will work closely with software engineers in an agile team to ensure the quality of code and products. This role will be responsible for creating and executing automated test harnesses, testing and reporting manual scenarios, testing new features, patches or hot fixes of the product and automateAs an Automation Engineer, you will play a crucial role in designing, developing, and implementing automated solutions to streamline our processes, increase efficiency, and optimize productivity. You will collaborate with cross-functional teams to identify automation opportunities, design robust automation frameworks, and execute end-to-end automation testing.Required Technical and Professional Expertise7+ years of IT experience\nStrong programming skills in Java.\nProficiency in automation tools/frameworks such as Selenium WebDriver.\nExperience working with continuous integration and delivery (CI/CD) tools such as Jenkins, Git, and JIRA\nHands-on experience with API testing and automation tools like Postman or SoapUI.\nFamiliarity with relational databases and ability to write SQL queries for data validation and verification.\nKnowledge of Agile/Scrum methodologies and experience working in an Agile development environment.\nExcellent problem-solving and analytical skills, with a keen attention to detail.\nStrong communication and interpersonal skills to collaborate effectively with cross-functional teams.\nAbility to multitask, prioritize work effectively, and thrive in a fast-paced, deadline-driven environment.Preferred Technical and Professional ExpertiseExperience with cloud-based platforms (e.g., AWS, Azure, Google Cloud) and their automation tools.\nBig data knowledge.\nUnix knowledge.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}