{"Job ID": "69873235", "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Senior Account Executive (Midmarket)Role DescriptionThe Senior Account Executive’s primary responsibilities include prospecting, qualifying, selling and closing new business either for IBs existing or for net new customers. The Senior Account Executive brings a Point of View to the Customer engagement; uses all resources to solve customer problems with appropriate SAP products.EXPECTATIONS AND TASKSAccount and Customer Relationship Management, Sales and Software License and Cloud Subscription Revenue.\nAnnual Revenue - Achieve / exceed quota targets.\nSales strategies - Develops effective and specific account plans to ensure revenue target delivery and sustainable growth. Develop relationships in new and existing customers and leverage to drive strategy through organization.\nTrusted advisor - Establishes strong relationships based on knowledge of customer requirements and commitment to value. Builds a foundation on which to harvest future business opportunities and accurate account information and coaching.\nCustomer Industry Acumen - Actively understand each customer’s technology footprint, strategic growth plans, technology strategy and competitive landscape. Review public information (e.g. new executive appointments, earnings statements, press releases) for the company and its competitors to remain updated on key industry trends and issues impacting the prospect.\nTerritory and Account Leadership - Lead designated territory, including accounts, account relationships, prospect profiling, and sales cycles. Encourage all accounts to become SAP references.\nBusiness Planning – Develop and deliver comprehensive business plan to address customer and prospects priorities and pain points. Utilize VE, benchmarking and ROI data to support the customer’s decision process.\nDemand Generation, Pipeline and Opportunity Management\nPipeline planning - Follow a disciplined approach to maintaining a rolling pipeline. Keep pipeline current and moving up the pipeline curve.\nPipeline partnerships – Leverage support organizations including Marketing, Inside sales, Partners and channels to funnel pipeline into the assigned territory.\nLeverage SAP Solutions – Be proficient in and bring all SAP offers to bear on sales pursuits including Industry Solutions, LOB solutions (CX, SFSF, SCM, HCM, SRM et. al) and technology solutions (Business Analytics, Mobility, Database and Technology, et. al)\nAdvance and close sales opportunities - through the successful execution of the sales strategy and roadmap.\nSupport all SAP promotions and events in the territory\nSales Excellence\nMaintain White Space analysis and execution of initiatives (up sell and cross sell) on customer base.\nOrchestrate resources: deploy appropriate teams to execute winning sales. Create OneSAP.\nUtilize best practice sales models.\nUnderstand SAP’s competition and effectively position solutions against them.\nMaintain CRM system with accurate customer and pipeline information.\nLeading a (Virtual) Account Team from presales and solution sales teams.\nDemonstrates leadership skills in the orchestration of remote teams.\nEnsure account teams and Partners are well versed in each account’s strategy and well positioned for all customer touch points and events. Maximize the value of all sales support organizations.Work Experience:8+ years of experience in sales of complex business software / IT solutions\nProven track record in business application software sales.\nExperience in lead role of a team-selling environment.\nDemonstrated success with large transactions and lengthy sales campaigns in a fast-paced, consultative and competitive market.\nBusiness level English: Fluent\nLocal language: Fluent, Business LevelWe build breakthroughs togetherSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.We win with inclusionSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.Requisition ID: 380745  | Work Area: Sales  | Expected Travel: 0 - 10%  | Career Status: Professional  | Employment Type: Regular Full Time   | Additional Locations: #LI-Hybrid.\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}