{"Job ID": "69873582", "Description": "Position Title: Territory ManagerLocation: Islamabad, Faisalabad, RYKRole Overview:Our Territory Manager is our front-line leader who manages the distributors and trade for the designated territory to ensure effective and efficient distribution operations and deliver sales, Key Performance Indicators / targets. If you want to develop an in-depth understanding of the world of sales and help drive meaningful change through Unilever’s purposeful growth and digital transformation agenda, then this role would interest you.Key Responsibilities:Drive the business to the desired ambition Underlying Volume / Sales Growth.\n\nUplift the Competitive visibility in Store.\n\nCoordinate with Distributor/Customer Operational plans / Executions.\n\nNegotiate with Customer for Joint Business planning.\n\nEfficiently plan and manage eRTM, build optimized routes for DSRs.\n\nSupport digital transformation strategy for your territory.\n\nHave the acumen for Financial Matrix – Business Profitability / Gross Margin.\n\nLead and drive an extended team – Build team & develop talent.\n\nBe accountable to uphold the business Key Performance Indicators.\n\nRedefine the process post execution analysis with strong analytical skills.\n\nThis role must ensure the instore execution of all promotions across categories and IMT & LMT stores assigned to them.Skills Required:Have strong business and financial acumen.\n\nStrong Communication and Negotiation Skills.\n\nCommand over Microsoft Office and Power BI\n\nActive feet on street and market time\n\nCapability to Strategize and possess strong execution skills.\n\nUpdated with competition insights.\n\nThis is an empowered role hence the resource should display accountability, responsibility and have strong bias for action.Education & Work Experience:Bachelor’s Degree\n\n1-4 years of relevant sales experience in FMCG industry is preferred.Unilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}