{
    "Job ID": "69875727",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:To conduct business analysis  and assist in implementing  technology solutions in efficient way by determining  the requirements and communicating them clearly to stakeholdersBe a Technology advisor and subject matter expert on Corporate Banking /Retail Banking/ Enterprise support functions business especially on (Cash Management, Liquidity, Channel Banking, Trade Finance, Cards, Assets & Liabilities, HR functions, Finance etc., as applicable)Establish trusted partnerships with business product heads, Operations and processing teams, Vendors, Technology and other internal teams.Key ACcoutabilities:Generic AccountabilityLiases with PO / BO only on converting business demand into technology req\nMay manage a team of BA’s\nPerform business analysis, enhancements and changes\nAssist in developing business and operational processes and to participate in the developing system training artefacts\nDefines service value chains and detailed processes\nArticulates functional / non-functional requirementsJob Context:Specific AccountabilityConvert specified and unspecified business needs to technology specifications\nArticulate current and future capabilities clearly and confidently to business and technology stakeholders.\nUnderstanding of business architecture, technical architecture, system features and limitations and ability to apply this knowledge in projects and smaller initiatives.\nConceptualize & review solutions for the requirements raised by business teams and coordinate required stakeholders for delivery\nParticipate in all project related activities with regards to requirements gathering, planning, implementation, as well as system & user acceptance testing.\nSupport the Program/project managers in driving the project delivery and meeting business objectives.\nRelentlessly be the voice of business and customer while driving technology led business solutions.\nConduct end user training and ensuring the required knowledge transfer to key team members is set in place.7-12 years of experience as a BA in the relevant specialization\nComprehensive knowledge of Software Engineering Methodologies like SDLC e.g. Waterfall, Iterative (Agile/Scrum)\nHigh Level of proficiency in Technology like Data base structure, OOP\nProven ability in Reporting Tools, BPM tools, Testing tools, Requirement management tools, Prototyping tools\nProven development of innovative and impactful systems solutions\nEvidence based experience in meaningful business impact through analytical prowess\nCan act as Senior Product Owner in Agile practices\nTrack record of driving uplift in an organization's BA practice, highly visible in the internal BA community\nAble to attract external talentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}