{"Job ID": "69873071", "Description": "As a member of the Rights and Permissions team you will support the rights clearance function which enables the use of photos, videos and text assets within English Language Learning (ELL) products and services.  Working with colleagues you will manage data processing and other systems-based tasks for multiple, concurrent projects; your manager will help you to prioritize in a way that enables you to achieve your goals of accuracy and effectiveness. There will be opportunities to learn beyond the immediate remit of this role and to set goals that expand your knowledge of rights and permissions.PurposeTo work within systems that support the acquisition of third-party media rights: financial processing, entering/managing data relating to image/text/video assets and running reports (training and support will be provided) \nYou will identify tasks within the systems that require escalation or enhancement (e.g., data inaccuracies, process blockers) and be responsible for re-opening and closing them \nWith support from the rest of the team you will proactively address any backlog of clearance tasks as well as maintain new tasks\nA key aim of this role will be to work with the ELL R&P team to support the completion (“closure”) of projects and to identify systems records that might need to be re-opened and remediated\nYou will work closely with the rest of the ELL team and provide support for Project Managers in administrative tasks to meet project schedules\nR&P projects generate documentation (digital files), part of your role will be to manage these files to ensure they remain organized and discoverableKey Accountabilities:Ensure project closure dates are met for all non-automated tasks\nMonitor project dates for work in progress and request extensions for any that are not completed but are approaching their end date \nAchieve clearance task targets to meet project deadlines\nAdd assessment logs to data management system after project close out\nDownload hi-res media assets (images/video) as required and upload to data management system\nCreate content plans (detailed lists of assets for inclusion within products) for small/ad-hoc projects\nProcess permission requests as appropriate to ensure that rights are acquired prior to publication / product release \nManage the upload of data for new versions of existing projects\nInvoice management for clearance tasks that are cost-bearing\nEngage with rights initiatives within the wider R&P function\nAttend meetings across the line of business to communicate project statusKey ChallengesAttention to detail - accuracy is key\nWork across a variety of projects, simultaneouslyCompetenciesFluent English speaker\nHighly organized, excellent administrator\nGeneral understanding of Microsoft Office, database management\nEager to learn and achieve competency and mastery in bespoke systems\nCommunication and team-working skills\nContent, media or publishing experience (or interested to learn)\nKnowledge of copyright (or interested to learn)Education, qualifications & trainingA good level of academic and/or vocational qualification.Full training and ongoing support for bespoke systems and processes will be provided. An interest in learning, education and digital technologies.Pearson is an equal opportunities employer. We do not discriminate against employees or job applicants and select the best person for each job based on relevant skills and experience. We are also committed to building an accurate picture of the make-up of the workforce and encouraging equality and diversity. The information you provide will stay confidential and be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}