{"Job ID": "69870006", "Description": "Bosch Global Software Technologies is a 100% owned subsidiary of Robert Bosch GmbH,\none of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions.\nWith over 18,000 associates, it’s the largest software development centre of Bosch, outside Germany, indicating that it is the\nTechnology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.VnV Architect (Electronic Battery Sensor)Value proposition:As a technical test expert you will designs test solutions and build test strategies to verify a product/system end to end.What You’ll Be DoingOwn the Electronic Battery Sensor(EBS) Software testing and its artifacts\nResponsible for defining the overall test strategy in alignment with Dept. goals, functional safety standards, and products requirements & setting the direction for testing, and recommending test tools\nTo provide technical leadership and assist the Test Manager & team with test planning, and guidance to team for test design & test specification development\nAct as mentors to teams, and create Intellectual Capital assets for reuse.\nStay up to update on process and technology developments to ensure they are brought in-house and enhance the solutions applied to the testing problems\nSharp focus on productivity with efficiency measures by higher automation percentage.\nIdentifying the technical risk and mitigate them on time.\nAnalyze System & Software functional safety requirements for different ASIL requirements for body/chassis electronics system.\nDevelop and maintain work products defined by the safety standards.\nEstablish and monitor development flows and processes to achieve and sustain required quality and safety levels\nHandle System & software compliance against ISO26262 safety standards, collaborate on efforts, measure results, and provide status reports\nWork very closely with System team, Software team, hardware team,\nDiscuss & execute functional safety verification and validation with team\nOrganize and lead internal and external project team meetings \nRegular reporting to project team and management\nRepresent VnV in Security and safety analyses task.8+ years of industry experience in Automotive, with exposure to Electronic Battery sensors project\nhold a B.E /B.Tech or higher degree in Electronics Engineering / Power Electronics/ Automotive Technology\nWork experience in Vehicle batteries & testing, Electronics battery sensor algorithms testing is huge advantage.\npreferred certification in ISO26262, ISTQB advanced level.\nworking experience in V&V projects /Products related to Safety critical Automotive Embedded products.\nworked in development and deployment of test strategy, test architecture and test automation with continuous build integration(Jenkins)\nexperience in setting up a test setup framework from scratch and improving existing frameworks to be more efficient and effective.\nhands-on experience with HIL(Vector), SIL setup , ALM, vTestStudio, CANOe, IC55000\nproficient in Verification and Validation, simulation, test tools and methods\nsound knowledge in System testing, Integration testing, Unit testing, and Fault insertion testing\nexperience with different programming and scripting languages, including CAPL, Python, C++\na strong teammate, self-motivated with a positive attitude.\nability to work closely with both software &hardware designers in requirement elicitations.\nCurious to learn and passion to out-perform.\nCan deal with demanding work environment and flexibility to cope-up.excellent team working culture, timing flexibility, career development coachingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}