{
    "Job ID": "69872952",
    "Description": "You are a strategic thinker passionate about driving solutions. You have found the right team.As the Scrum professional, you will spend each day defining, refining and delivering set goals for our firmAs a Scrum Master, you will act as a leader for your team(s) by facilitating clear communication to management and to the team. As the Scrum professional for Firmwide Management Information Systems, you’ll collaborate with dedicated product owners and feature teams to drive the planning and execution of key business initiatives. The Firmwide Management Information Systems (MIS) in Financial Analysis (FA) is responsible for the accuracy, integrity and timeliness of the Line of Business segment results for actuals, while providing reporting to both internal and external clients.Job Responsibilities:Work with the Product owner to align teams with the product vision, initiatives, and OKRs\nOwns Sprint planning, grooming sessions, and retrospectives\nCreate an environment of collaboration within the teams that allows for open dialogue and productive solutions for resolving conflicts\nChampion continuous improvement activities to reduce waste and increase productivity; coach organization to conduct continuous improvement events\nCommunicate organizational impediments to leadership; clear impediments for the team\nEmbrace the concept of continuous learning in your own journey and instill the same in the team(s) you coach\nCoach product owners in creation and maintenance of the product backlog, including story writing and estimationQualifications:BS/BA degree or equivalent experience\nFamiliarity and adherence to core Agile values and principles\nExperience as a practicing Scrum Master on a team\nExperience with JIRA, Familiarity with Continuous Delivery\nUnderstanding of Agile and Scrum framework and its application in Product Development and delivery organization\nLeverage skills from coaching, facilitation, conflict resolution, and more to serve the team(s)\nAbility to collaborate with and influence people at various levelsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}