{
    "Job ID": "69874787",
    "Description": "Main Purpose:Knowledge Skills and Abilities, Key Responsibilities:Key Responsibilities include :Leadership This is a senior leadership role which will assist the  head of stock in leading and managing stock analysts on a daily basis in the execution of their work.   In addition to this the incumbent will also manage the specific country activities on their own.Month end proceduresStock reconciliations with a focus on ensuring Physical and book values are reconciled. All adjusting entries should be computed and reviewed with in country FMS and regional team Provisions and NRV impact calculations and ensure adjusting entries comply with group policy Reconciliations of 3rd party stocks including confirmations and accounting for differences Reconciliations of inventory vendors Reconciliation of intercompany/country stock positions both Physical and value Accrued purchase recon Item charges management Balance sheet report input including presentation to regional team Data for input into HFM Stock valuation analysis including NRV calculationsWeekly/ fortnightly reconciliationsReconciliations of 3rd party stocks including confirmations and accounting for differences Reconciliations of inventory vendors Reconciliation of intercompany/country stock positions both Physical and valueAdhocImplementation and enhancement of stock systems as necessaryManagement, supervision, coaching and training of stock accounting teamStock Day to Day ManagementCoordinate daily relation with Operations in order to ensure that fuel delivery cycle is done accurately> Work closely with BSM/Accountant/JSU Supply team\nCoordinate daily relation with Operations in order to ensure that the fuel purchase process is done accurately > Work closely with BSM/Accountant/JSU Supply team\nControl inventory journals and post in NAVISION:\nPhysical Inventory journals are the last stock adjustments for a site. These include the final declared gains or losses for a site for a particular day. Stock Controller reviews the Physical inventory journal is in line with the site’s Stock Reconciliation.\nAbnormal losses/gains are investigated and necessary corrective action is taken by the site managers. Petroleum taxes are correctly computed and paid on time\nReview inventory valuation in NAVISION and QlikView which involves\nChecking inventory valuation in NAVISION, and comparing versus expected costs cost of product. This is done in NAVISION using Stock Keeping Units and Inventory Valuation Report.\nWork closely with BSM/Accountant/JSU Supply team\nEnsure daily Mass Balance closure by all Sites. This requires;\nEnsuring sites are submitting daily stock reconciliations timeously\nFollowing up and helping resolve challenges that may result in delays in mass balance closure.\nCirculate daily closure progress for all sites. Using an excel template, Physical Item journal posted per site are updated in the template. The template shows sites that haven’t yet had physical inventory journals. This is circulated to Management and Depot Managers.\nRun Adjust Cost Routine. This is a program in NAVISION that does the Average Based Costing.\nReview product costs and taxes before processing in NAVISION as submitted by Product Accountant and Tax Accountant\nInsure that stock is correctly reported and match with sub ledger in the Flash and Monthly reporting.\nEnforce internal controls in the stocks function. This entails ensuring adherence to Stocks Procedures as advised in the Internal Control Policy\nCirculate daily dashboard reconciliations for all entities clearly detailing any reconciliation items and ensure these are followed up and closed out timeouslyExperienceChartered Accountant or Cost Accountant with Graduate Commerce Degree or equivalent  \nAccounting certification\nStock experience is required\nKnowledge of stock accounting method needed (Average / FIFO)\nCapacity to manage multiple products/stock at the same time\nGood verbal and written communication skills with the ability to articulate complex information\nMicrosoft Office proficientSkills & CompetenciesAccounting\nStock accounting\nERP experience\nStock reconciliationsReportingMonthly reports\nDaily Stock reconciliation report\nCoaching, supervision of team membersKey Relationships and Department Overview:Global stakeholdersJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}