{"Job ID": "69875914", "Description": "Job Posting DescriptionTo be responsible for Product quality activities in factory.Describe in one impactful sentence the bigger purpose that this role contributes to in our company.In this role, you have the opportunity to be part of Global Quality & Regulatory team and support the Philips’s Quality compliance culture.You are responsible forSupport  for  product quality improvement activities and to reduce  defect  rate of products\nMaintain the product quality level to meet global quality standards\nIdentify opportunities and work for improvement in product quality by working closely with cross functional team\nDriving closure of assigned CAPAs on timely manner\nQuality oversight of the manufacturing operations (facilities, equipment, processes, and documentation)\nConducts Quality data analysis and provides input for Quality review meetings\nSupport  for  product quality improvement activities and focus on customer complaint reduction by interacting with Global team for resolutionYou are a part ofOperations Quality team which is part of Global Quality & Regulatory organization. This team takes care of Product Quality, QMS & Regulatory compliance.To succeed in this role, you should have the following skills and experienceEducation Qualification: Engineering Graduate in Electronics/Telecommunication/Electrical\nWork Experience : 8 to 10 years of experience in Quality Assurance / Quality Control Activities in Medical devices industry preferred\nTechnical/Functional Competencies: Working knowledge in the following quality areas: inspection, product disposition, documentation control, Calibration and non-conforming material, measurement system analysis. Good knowledge of the ISO13485/9001 regulations.\nBehavioral Competencies: Good verbal and written influential communication skills. Good technical writing skills. Good team player and able to influence cross-functional teams.In return, we offer youGet opportunity to work in regulated Medical industry and be part of Global Quality & Regulatory organization.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}