{
    "Job ID": "69873698",
    "Description": "Job Description:Roles and ResponsibilitiesEMEA collector will own a collection portfolio in the range of $25M - $75M. Collector will liaise with customer accounts payable, field & service sales, order management , regional tax , logistics & contract manufacturers,  to action on accounts receivable , orders on hold, customer disputes, new deals, payment terms & credit limit. Candidate should be familiar with a region collection practices & with complex business model involving resellers, distributors & direct partners. Candidate should be able to thoroughly analyze & strategize a given collection portfolio to ensure average due date remains at zero.Duties & Responsibilities:Perform collection duties on delinquent accounts.\nRespond to customer inquiries relative to billing and/or payment problems in a timely manner.\nEstablish and maintain positive relationships/communication with other departments and clients to enhance customer service.\nMaintain complete and accurate records of all accounts.\nHandle difficult collection problems in order to eliminate the need for outside collection efforts.\nHandle all the AR adjustments like, creating Debits/ credits for tax, VAT, WTAX, Refunds, Intercompany transfers, reconciliations\nRecommend accounts to be referred to collection agencies in a timely manner.\nOnline billing to our top customersEducation: Bachelor’s DegreeSkills:Basic knowledge of accounting, banking, and finance\nKnowledge of SAP, CRM is a mustExperience:Minimum of 4-6 years in collections\nExposure to large dollar volume customers\nSuccessful record of communicating with internal and external customers\nDemonstrated problem resolution\nDemonstrated process improvementCharacteristics:Professional phone etiquette\nAbility to communicate (verbal and written) effectively\nGood organizational skills\nAbility to consistently meet deadlines\nShows initiative in decision making\nAbility to set priorities\nAttention to detail\nGoal oriented\nAble to work individually (self-starter) and in a team environment\nWork in EMEA shiftJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}