{
    "Job ID": "69872986",
    "Description": "Description:Asset Servicing roles are responsible for managing all corporate and income related events across all asset classes for collections, announcement capture, corporate actions processing, income processing, proxy and controls, entitlement completion and payment processing, claims management,  Job Duties : Reconcile positions, payments and process transactions to client’s account\nPerforms both routine and non-routine asset servicing transactions and tasks with moderate to advanced complexity by leveraging intermediate to advanced subject matter expertise. This may include diagnosing problems and providing operational or technical resolution within defined and limited autonomy.\nInvolves managing customer accounts, processing payments, income, or taxes, and resolving queries across multiple corporate- and income-related events.\nUnderstanding of asset servicing lifecycle.\nServes as point of contact for internal communication with Middle Office and Client Service.\nAdditional responsibilities include peer work review and offering suggestions on process improvements.\nFlexible with extended hours as per business requirements to meet client expectations .Ability to work under pressure and in different shiftsCore AbilitiesExcellent prior asset servicing services, securities lending or prime brokerage operational experience\nAbility to work closely with business partners and interact with all staff levels\nAbility to be flexible, follow tight deadlines, organize and prioritize work\nExperience of working on multi-stream programs\nStrategic thinking coupled with practical execution\nStrong analytical and problem-solving skills including taking the initiative to drive change and enhance controls\nAbility to manage through a changing business landscapeQualificationsBachelor’s degree required (business discipline preferred)\nMinimum experience 10 – 12 years in Financial Services industry, preferably in custody asset servicing & fund services, markets or prime brokerage, securities lending space\nProficient in Microsoft Office & Project Management skillsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}