{"Job ID": "69873972", "Description": "Business Development Manager, Priority Clients-(2300016004)Job:Retail BankingPrimary Location:Asia-India-MumbaiSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 1:21:58 PMUnposting Date:OngoingThe Role ResponsibilitiesBusinessAchieve personal sales target\nSegment focus, customer focussed needs-based selling\nBeing a Priority Clients Acquisition Executive, focus has to be on acquiring new HVS customer relationship and fulfilling needs with respect to Liabilities, Insurance and Investment for such customers as mandated by the Bank. It will also involving deepening these relationships by cross-selling various product Risk ManagementConduct CDD, MLP & TCF diligently\nZero tolerance – Fraud, Mis-selling\nAttend training, acquire knowledge and apply to job function\nAdhere to all policies, guidelines and procedures, comply with local regulatory requirements\nTo comply with all applicable money laundering prevention procedures and, in particular, report any suspicious activity to the Unit Money Laundering Prevention Officer and line managerRegulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles. Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.Our Ideal CandidateSubstantial experience in the banking industry, including demonstrated success in a similar role.\nMust possess sharp business / sales acumen, excellent interpersonal skills and multi-cultural awareness and sensitivity.\nAbility to work with geographically dispersed and highly varied stakeholders\nAt least 2-3 years of relevant experience across CASA sales in the regionRole Specific Technical CompetenciesBusiness – Market Knowledge\nBusiness – Products and Processes\nFM – Products – Bonds and LoansAbout Standard Chartered We're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\nOur purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\nBe better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long termIn line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locations\nTime-off including annual, parental/maternity (20 weeks), sabbatical (12 weeks maximum) and volunteering leave (3 days), along with minimum global standards for annual and public holiday, which is combined to 30 days minimum\nFlexible working options based around home and office locations, with flexible working patterns\nProactive wellbeing support through Unmind, a market-leading digital wellbeing platform, development courses for resilience and other human skills, global Employee Assistance Programme, sick leave, mental health first-aiders and all sorts of self-help toolkits\nA continuous learning culture to support your growth, with opportunities to reskill and upskill and access to physical, virtual and digital learning\nBeing part of an inclusive and values driven organisation, one that embraces and celebrates our unique diversity, across our teams, business functions and geographies - everyone feels respected and can realise their full potential.Recruitment assessments - some of our roles use assessments to help us understand how suitable you are for the role you've applied to. If you are invited to take an assessment, this is great news. It means your application has progressed to an important stage of our recruitment process.Visit our careers website www.sc.com/careersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}