{"Job ID": "69873266", "Description": "Job title:\nSenior Data Engineer I\nYour role:Data Engineer with >8 years’ experience, who is inquisitive, has an eye for detail and has a knack for seamlessly connecting disparate data sources\n\nTo build our next generation smarts, you will be working with experts in a variety of fields, including clinical & regulatory specialists, UX designers, dental and skin care professionals, system architects, product management to integrate new technologies and refine system performance. You will help build learning systems, leveraging data sets consisting of user interactions and actions, collected from hundreds of thousands of consumer devices, per day to model, analyze, and predict user behaviours. While some of our algorithms run on resource constrained devices, others require large clusters on our cloud infrastructure. \n\nAs a Data Engineer, you will be responsible for developing, testing and boosting our data pipeline architecture, develop and standardize data pipes for utilization by our cross functional teams. The Data Engineer will support our software developers, data architects, data analysts and data scientists throughout the lifecycle of the data projects.You're the right fit if:Bachelor’s or master's degree in Computer Science, Information management, Statistics or related field\n\n>8 years of experience in the Consumer or Healthcare industry in an analytical role with focus on building on data pipelines, querying data, analyzing and clearly presenting analyses to member of the data science team.\n\nTechnical expertise with data models, data mining.\n\nHands on Knowledge of programming languages in Python.\n\nStrong knowledge in the Big data tools such as AWS Redshift, Hadoop, map reduce etc.\n\nHaving knowledge in tools like Airflow, AWS Glue, S3, AWS EMR, Streaming data pipelines, Kafka/Kinesis is desirable. \n\nHands on knowledge in SQL and No-SQL database design.\n\nHaving knowledge in CI/CD for the building and hosting the solutions.\n\nHaving AWS certification is an added advantage.\n\nHaving Strong knowledge in visualization tools like Tableau, QlikView is an added advantage\n\nA team player capable of working and integrating across cross-functional team for implementing project requirements. Experience in technical requirements gathering and documentation.\n\nAbility to work effectively and independently in a fast-paced agile environment with tight deadlines\n\nA flexible, pragmatic and collaborative team player with innate ability to engage with data architects, analysts and scientists.About Philips\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\nIf you’re interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here.#LI-EU\n#LI-Hybrid\n Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}