{
    "Job ID": "69872728",
    "Description": "Overview This position will be part of the GBS organization supporting Frito Lay North America business retail customer team. The TPM analyst is critical to maintain promotions backend data both on internal systems and external systems. The analyst will be also responsible to process promotion invoices and sharing new item information with the retailer teams. The analyst will be working with the Lead analyst who will channel work on various work groups mentioned above or outside of it. The analyst role is business impacting and time bound; accuracy and timeliness of completion of tasks is critical for the PC team’s success in turn the sales teams’. The TPM analyst will be expected to work on transformation initiatives of their respective processes and bring in their learnings to streamling, automate and effectively lay down processes with the Lead analyst support. Responsibilities Functional Responsibilities • Associate TPM analysts work with the Lead analyst to pick up format / region responsibilities. • Ensure delivering below work tasks adhering to SLAs and OLAs. • Promo data ingestion in Pepsico internal systems and customer external portals for trade planning, demand planning. • Contract management which is an agreement between retailer and Pepsico to be managed end to end for upcoming promotions. • Update TPM events , Deal sheets and New item maintenance based on promotions discussion with retailers and price changes. • Processing and reconciliations of Payments/Deduction invoices and monitor approvals from Stakeholders and its timeliness • Communicate Risks and Opportunities to Sales team /Control/Finance. • Validate Tactic pricing with Pricing Grids for any discrepancy in accruals and invoice • Payments and funding tracking for vendors • Manage expectations through verbal and written interactions with internal teams that includes sales, Finance and Control • Ensure delivery of accurate and timely payment data in accordance with agreed service level agreements (SLA) • Implement continued improvements and simplifications of processes, standardization of reporting and optimal use of technology (Automation) Qualifications • 2-6 years of experience in Operations Finance/Sales • Bachelor’s in commerce/business administration/marketing or Finance. • Prior Fast Moving Consumer Goods (FMCG) company experience preferred • Analytical Skills: Good data skills and ability work through large data sets • Communication: Strong communication skills and collaboration skills • Strong written and verbal communication skills • Excellent organisation and prioritisation skills • Proactive, responsive and results driven • Highly proficient in Microsoft Office especially Excel and PowerPointJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}