{"Job ID": "69872691", "Description": "Position Title: Supervisor, Women ResidencesEntity: Aga Khan UniversityLocation: KarachiIntroduction to the Aga Khan University:Chartered in 1983, Aga Khan University (AKU) is a private, autonomous and self-governing international university with 13 teaching sites in 6 countries distributed across three continents. As an integral part of the Aga Khan Development Network, AKU provides higher education in several disciplines, carries out research pertinent to the countries in which it exists and has campuses, programmes and/or teaching hospitals in Afghanistan, Kenya, Pakistan, Tanzania, Uganda and the UK. As an international institution, AKU operates on the core principles of quality, relevance, impact and access; and AKU is a model of academic excellence and an agent of social change.Job Role / Responsibilities:You will report to Manager/ nominee of women residence, as a WR Supervisor, the role is required to ensure and effective implementation of WR policies, procedures and rules, smooth process of check-In & check-out of residents/guests along with all requirements like preparing/closing files, room preparation and inventory, welcome a new resident/guest with a proper orientation. Resolved all complaints of the guests/residents with the support of maintenance team as soon as possible or provide an appropriate solution to user. Take WR and Dr’s on call room property round, maintain inventory of rooms/tags items, track the upkeep of the facility, follow up on complaints and other assets of WR and Dr’s on call room. Ensure to maintain a professional and working relationship with support departments to get the work done. Any other tasks assigned by the manager or nominee, time to time which may handle reception or administrative tasks etc.Specifically, you will be responsible to;ensure and effective implementation of policies, procedures, and rules in the Women Residences\ncommunicate on regular and via defined process with the team i.e., other supervisors during the shift change, proper and complete handover of information is mandatory\ntake proper and regular rounds of the property to ensure identification of maintenance needs and highlight in the complaint logbook and track until completed\nkeep check and control of the inventories of the property and ensure to track of operating expenses to keep the costs low\nensure proper usage of facilities offered to the residents i.e. pantry, laundry, common lounges, and washrooms and advise residents or guests who miss-use the assets of the property and document the details\nbe a guest agent by meeting, greeting, and welcoming the new guest/resident during the orientation session along with a proper tour of the property and be warm and gentle with the new residents/guests\nensure the rooms and documents of the check-in and check-out residents/guests is prepared and accurate\nattend to the complaints raised by the residents. Seek permission in writing prior to entering any resident’s room and ensure to attend the complaints within the given TAT (Turnaround time), justify for delays\nbe solution oriented, alert, and available for residents at all times\nthink out of the box, quick and economical solutions to daily challenges and share the new requirements /recommendations for improvements with the manager as and when needed\nrecording and monitoring of residents away leaves, maintenance complaints, inventories, guests, and other tracking records which required filing to done properly\nmanage the reception area well and keep track of the calls, messages, and visitors, when required\na1l the residents should be treated equally, maintain confidentiality and act in a very professional manner and should not develop personal relationship and friendship with the residents.Eligibility Criteria / Requirements:minimum intermediate, Graduate preferable, \nappropriate knowledge of MS Office (word, excel, power point), outlook and internet.\nat least 1 year of relevant / similar nature of Job experience\ngood interpersonal and communication skills, written / spoken/reading English language\nbe able to interact with residents and guests both local and international\ngood Organizational, time management, teamwork, and decision-making skills\nability to handle sensitive issues, problem solving and counselling skills\nability to follow and adhere to policies & procedures\nwilling to work in shift duties or flexible hours.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}