{"Job ID": "69873602", "Description": "Company Description:Locationo-( Pune OR Bangalore)Zscaler enables the world’s leading organizations to securely transform their networks and applications for a mobile and cloud first world. Its flagship services, Zscaler Internet Access and Zscaler Private Access, create fast, secure connections between users and applications, regardless of device, location, or network. Zscaler services are 100% cloud-delivered and offer the simplicity, enhanced security, and improved user experience that traditional appliances are unable to match. Used in more than 190 countries, Zscaler operates the world’s largest cloud security platform, protecting thousands of enterprises and government agencies from cyberattacks and data loss. The Zscaler platform operates at a carrier grade level– we process over 50 billion transactions a day in our cloud to protect our customers.We are looking for salespeople who are sharp, creative, and hardworking with an unwavering desire to be the best.Traditional security companies are becoming less relevant as cloud adoption and digital transformation become the norm in every market industry and in every market segmentation.  Zscaler has been a leader in Gartner’s MQ for 9 consecutive years and has helped shape the emerging SASE category (a true category creator).  We are well positioned to dominate this massively growing cloud security market.  Key Responsibilities:\n- Lead and execute scalability, stress, and performance testing for our products.\n- Help write simulators for scale testing.\n- Develop and maintain automation frameworks and tools to streamline testing processes.\n- Collaborate with cross-functional teams to identify performance bottlenecks and propose solutions.\n- Evaluate and implement cloud security measures to ensure the highest level of protection for our systems.\n- Conduct database scalability testing to optimize data handling and storage.\n- Perform UI scalability testing to ensure a seamless user experience.\n- Document and communicate test results, findings, and recommendations to stakeholders.\n- Stay up-to-date with industry trends and emerging technologies in cloud security and scalability testing.\n  Bachelor's or Master's degree in Computer Science or a related field.\n- Proven experience (4+ years) in scalability, stress, and performance testing of networking products.\n- Strong expertise in automation and tooling for testing processes.\n- In-depth knowledge of cloud security best practices.\n- Experience with database scalability testing, including SQL and NoSQL databases.\n- Proficiency in UI scalability testing and user experience evaluation.\n- Excellent problem-solving skills and attention to detail.\n- Strong communication and collaboration skills.\n- Ability to work independently and as part of a team in a fast-paced environment.\n- Industry certifications (e.g., AWS Certified Security, CISSP) are a plus. Why [Your Company Name]?\n- Join a dynamic team at the forefront of cloud security innovation.\n- Work on challenging and high-impact projects.#LI-GD1Additional Information:Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}