{"Job ID": "69872698", "Description": "Get ready to discover Mövenpick Resort Al Marjan Island, a 5 star resort in Ras Al Khaimah built beside 300M. of soft sand beach. 418 rooms and suites offer flexible comfort with spectacular sea views from every balcony. Six specialty bars and restaurants , three outdoor pools, a wellness hub with a fully equipped gym and four treatment rooms, water sports, and a year round Kids Club make it an ideal holiday destination.As Credit Collection Officer in Finance Department, you will be playing a key role in credit section to ensure timely invoicing as well as payment follow ups from Corporate Companies & Partners. Your duties and responsibilities are enlisted belowThoroughly review Credit Applications and recommend approval or rejection of Credit Facility.\nDaily posting of Accounts Receivable Batch \nWeekly task to dispatch Travel Agency / Tour Operator invoices \nTo be able to dispatch Corporate Company / Government Offices invoices  within 48 Hours\nShould be able to prepare the Group Invoices \nPayment Follow up to be done daily\nPayment collection – Within 30 days from the date of invoice.\nPayment allocation – on the same day of receipt of payment.\nReconciliation on Credit Card and Payment allocation –Permanent Folios in Front office – Daily\nReview Accounts Receivable aging report on daily basis and plan appropriate actions.\nTo carry out any other reasonable duties and responsibilities as assigned.Graduate with majors in Finance/ Accounting\nAt least 1 Year experience in finance department of a reputed International Corporate Company.\nGood interpersonal skills\nShould have good command in Microsoft Office / Excel as well as Accounting Systems\nShould be able to organize daily / weekly and monthly tasks within set timelines.What is in it for You:Heartist benefit card offering discounted rates in Accor worldwide\nLearning programs through our Academies\nOpportunity to develop your talent and grow within your property and across the world!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Ras Al Khaimah, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}