{
    "Job ID": "69873551",
    "Description": "Job Requisition ID: 156386 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every dayOverview of the role:Responsible for integrating the MEP Team, delivery of Engineering deliverables, material, construction day to day administration and commissioning reports.Responsible for ensuring zonal integration and technical fit between building and engineering systems.What you will do:Responsible for:Initiation and Understanding the SOW:Will be briefed by the Line Manager on the IFC documents inclusive of IFC drawings, Specifications, Addendums…etc\nBriefed on the extent of the SOW in accordance with the IFC documents and tender queries.\nIn collaboration with the Line manager; understand the Risk Register and the risks foreseen to impact the project delivery from aspects such as; work program, Procurement, Engineering, Construction and Close out.\nEnsure the inclusion of the Authorities Design NOCs as part of the IFC documents provided by the client.\nDiscuss with the line manager to understand the Key Milestones and key deliverables.\nFamiliarize self with the Responsibility Matrix detailing the interfaces of works between AFC and the MEP contractor.\nUntil the appointment of the MEP contractor, take responsibility of preparing the necessary shop drawings, Material submittals and method statements necessary to facilitate the MEP services associated with enabling works undertaken by AFC. Key Deliverables and interim Milestones/work schedule:Ensure understanding the MEP construction program. Discuss with the line manager for further clarifications and assistance.  \nFamiliarize self with the project Organizational structure and key personnel\nUnderstand the requirements to be provided by the MEP contractor based on the manpower histogram.  \nThe line manager will explain the cost and resource loaded program; cash flow forecast submitted by the MEP contractor to align with progress at site.\nEnsure understanding the project key deliverables and logs submitted by the MEP contractor for tracking purposes are updated on weekly basis, not limited to shop drawings, builders work logs, Material Submittals, method Statements, procurement tracking logs…etc\nEnsure to be aligned with the RFI process and the extent of impact of the responses obtained from the Engineer.\nIn coordination with AFC Engineering, ensure to adequately conduct the necessary technical integration process, Zonal coordination and technical fit at interfaces between the various systems.Operational accountability, Safety Quality and environmental,Fully understand and comply with AFC HSE manual plan.\nEnsure that the MEP Contractor duly submit the project HSE and execution plan for AFC review and approval.\nEnsure that the MEP contractor appoints the competent HSE leads/officers duly accredited in accordance with the international standards and codes.\nEnsure full adherence of the relevant safety, Quality and environmental procedures, instructions and controls in accordance with AFC guidelines.\nEnsure conducting and participating the periodic toolbox talks.\nEnsure that incident/near miss reports are timely issued, and lessons learned sessions are conducted for the project construction operatives.Construction Management and Tracking process:Verify the Key Performance Indicators of the MEP contractor and ensure that they reflect the actual achieved status.\nReview the MEP contractor’s submitted shop drawings, clash detection reports, material and technical submittal, method statements and drive out any deficiencies or coordination concerns prior to submission for the engineer approval.\nKPIs shall clearly indicate Plan vs Actual achievements and shall be presented during the weekly MEP progress meetings. The outcomes of these meetings shall be shared with the line manager.\nCoordinate the links between MEP Civil and other trades. Timely availability of Material, method statement, workforce, supervision and adequate/timely access to the certain area.\nEnsure that the works are carried out based on Coordinated shop drawings with clash free reports, the MEP contractor conducted the necessary site survey and inspection prior to commencement, timely request for any builders work necessary for the work.\nEnsure the QAQC procedures are in place, Material Inspection Reports are duly signed off by the Engineer.\nEnsure to observe the quality of work and timely offered for inspection.\nEnsure all MIRs and WIRs are signed off by the Engineer which will subsequently for the necessary substantiation of the interim Payment applications and assessment of claims/abortive works following changes.  \nEnsure to discuss with AFC Civil team the MEP contractor Logistics plan and map out the handling and movement of material and equipment.\nEnsure conducting site walks and workshops with the MEP construction team and explain areas of concern conveyed from the Civil team.\nObserve progress productivity trend, and report to the line manager on any deficiency.\nEnsure to maintain robust and timely documentation/notarization of events/delays and inform the line manager for the doing the needful accordingly.  \nEnsure that the MEP contractor provides look ahead programs, register of WIRs and shared within the Contractor daily reports.\nEnsure coordination at site during the Authorities inspections and capture the comments resulting from these visits.  Testing Commissioning and Project Close Out:Ensure understanding the detailed Testing and Commissioning program extracted and integrated within the project Approved Baseline Program.\nEnsure the attendance of the commissioning agent/specialist at early stage for inputs during Engineering/procurement/buildability stage.\nEnsure to have possession of the approved Commissioning Method statement and strictly followed at site.\n Ensure that the pre commissioning activities are duly performed and signed off by the Cx agent and the Engineer.\nEnsure that all commissioning activities are adequately and sufficiently rendered, life safety and cause and effect scenarios are duly followed and implemented.\nEnsure to maintain updated register for the elements necessary for a successful project closing out such as; red marked drawings, As built, validated material submittals, closure of NCRs, snags management, Operation and Maintenance Manuals, Training sessions conducted for the employer by the MEP contractor/specialists. People Management:Ensure to liaise with the site team and employ ownership and dedication.\nEnsure that to communicate with MEP contractor personnel and maintain and track the lookahead programs and monitor productivity.Required skills to be successful:Behavioural Competencies:Goal Obsessed\nManaging Complexity\nChange Agile\nFuture - Proofing\nInfluence & ChallengeWhat equips you for the role:Minimum Qualifications and Knowledge:Bachelor’s degree/ Diploma in Construction Management, Engineering or any other related discipline.\nExperience in relevant industry\nKnowledge in Contracts and related laws project planning software, AutoCAD software.Minimum Experience:Min. 5 years’ experience working with main contractor.About Al Futtaim Construction\nAFC is a locally registered and managed building and civil contractor, a wholly owned Al-Futtaim group company. We focus on providing an excellent service to our select list of key customers with whom we aim to build long-term, mutually beneficial relationships. With our roots going back over 41 years, our principal activities have grown to cover a broad range of building, civil engineering, and infrastructure works.The company’s successes have resulted in consistent turnover of over AED2 Billion with one of the largest local work forces in the industry, a testament to our core knowledge, competency and experience. We approach projects by working collaboratively with our customers and their design teams to deliver build-able, cost effective solutions using innovative techniques when required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}