{
    "Job ID": "69873350",
    "Description": "We help the world run betterOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now! Location : Bangalore/Gurgaon\n\nFor this Role, consultant should have experience in at least 3-5 full life cycle implementation on a good mix of new age and established technologies like SAP Analytics Cloud, SAP Analytics Cloud Planning, S/4HANA Analytics, SAP BW/4HANA or HANA Modelling.What You'll Do:\n Create business blueprint as per the functional requirements provided\nPrepare Solution Architecture and produce Technical design document\nCreate prototype as necessary\nDeliver solution as per the business blueprint and technical design\nWork as part of large team or work independently\nGuide team members\nFlexibility to work on various skills and proactive approach to delivery\nPosition solutions to customer at pre-sales stage\nDrive enablement of the teamWhat You'll Need:Qualification  / Skills and CompetenciesA degree in computer science, engineering, accounting, finance or related field\nMinimum years of Education required: 16 years or more.\nExpert level knowledge of at least one of the following: SAP Analytics Cloud, SAC Planning, S/4HANA Analytics, SAP Datasphere (Data Warehouse Cloud – DWC)\nExpert level knowledge of at least one of the SAP data warehousing solutions like SAP BW/4HANA or SAP HANA (esp. HANA Cloud or HANA 2.0) for both modelling and scripting including ability to write complex stored procedures. High level knowledge of various replication methods to HANA or BW\nFor senior profiles: Architectural knowledge of deployment modes of various SAP Analytics solutions (Cloud, On-Premise, Hybrid)\nAbility to work in or drive large engagements of team size 10+\nGood core consulting skills – Oral and written communication, organization and planning, client facing and interpersonal skills\nGood knowledge of latest trends in Analytics space including platforms and solutions from other vendorsWork ExperienceMinimum of 3 full life cycle implementations in two or more of the following skills: SAP SAC, SAP SAC Planning (or deep planning functional know-how), S/4HANA Analytics including CDS Views Development, SAP HANA Cloud or HANA 2.0, SAP BW/4HANA\n4-15 years of work experience in above mentioned skills,\nExperience working on mixed modelling with BW/4HANA and HANA native modelling.\nExpertise in collecting requirements and designing of solutions. Functional knowledge on planning solutions is an added advantage.\nKnowledge and experience on SAP Analytics Cloud or SAC Planning is preferred.\nKnowledge on S/4HANA Analytics like building and extending CDS Views, Creating Query Views or Building KPIs using KPI Modeller is preferred.\nHands-on experience in advanced analytics domain like Predictive Analytics or SAC Smart Features, SAC Application Designer is a plus.\nKnowledge of development on HANA 2.0 like HANA XSA Development, nodeJS or ABAP development would be an added advantage.\nHands on knowledge of related planning solutions like BPC, TPM, BW-IP will be nice to have and will give added advantage.Meet Your Team:Consultant will be responsible for implementing data warehousing, planning and reporting solutions based on SAP S/4HANA Analytics, SAP Analytics Cloud (SAC), SAC Planning, SAP BW/4HANA, SAP HANA, in various industry and functional domains. The consultant will interact with onsite team members or at times directly with customer to understand requirement or build as per given design. He/she will be responsible for technical implementation of the business model, performance improvements,Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Gurgaon, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}