{
    "Job ID": "69873286",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we\nbelieve in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.About the team\nThis role is part of FIS’ Derivatives Reconciliations team responsible for on-boarding of new reconciliations, maintenance of existing reconciliations, implementation of client driven changes, platform upgrades, and production platform stability and efficiencies for all the DIM hosted clients.What you will be doingDesign and implement new changes in partnership with internal stakeholders, change delivery, and client teams. Provide analytical and subject matter expertise into broader strategic initiatives.\n\nWork collaboratively with other teams to identify pain areas, process efficiencies, utilize subject matter expertise to drive automation and deliver efficiencies.\n\nSupport UAT testing, conduct thorough regression testing to delivery high quality defect free changes to Production ensuring platform stability.\n\nOn-boarding of new reconciliations and maintenance of existing reconciliations adhering to the reconciliations standards laid down in the project\n\nEnsure the reconciliations platform is compliant with all non-discretionary change i.e., mandatory changes, regulatory changes and FIS software & hardware policies.\n\nLeadership & Innovation – Utilize strong subject matter expertise to drive the definition of innovative solutions, both within the organization and the industry.Skills4 - 8 years of strong reconciliation development experience in all modules of IntelliMatch (Recollector, Admin, Reconciliation).\n\n4 - 8 years of strong database experience in SQL.\n\nGood communication skills for clear and effective interaction with both internal and external parties.\n\nSelf-starter with good interpersonal skills and a solution driven approach.\n\nKnowledge of IntelliMatch NextGen is desirable\n\nScripting languages such as POWERSHELL, Windows Batch Scripting will be added advantage.\n\nWorking experience with Jira, ServiceNow will be useful.What you bring:\nKnowledge / ExperienceExtensive experience of software/service solutions delivered on a hosted and managed basis including SQL Server\n\nKnowledge of the financial services marketplace\n\nReconciliation knowledge\n\nAbility to build and maintain strong Client relationships portraying deep technical and functional expertise\n\nKnowledge of Project Methodology viz. AGILE, Waterfall etc\n\nCompetent in best practice principals of risk, information security and compliance.What we offer you\nAn exciting opportunity be a part of World’s Leading FinTech Product MNC\nTo be a part of vibrant team and to build up a career on core banking/payments domain\nCompetitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nA broad range of professional education and personal development possibilities – FIS is your final career step!Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}