{
    "Job ID": "69873853",
    "Description": "Senior Implementation engineer / Professional Service ConsultantDo you have experience as a Implementation Engineer?Are you a highly visible champion with a ‘can do’ attitude and enthusiasm that inspires others?About the Role:As part of the consultancy team, you will deliver LNRS solutions internationally to clients in banking, insurance, and fortune 1000s, building enduring relationships with these clients and acting as the gateway between the internal product team and the client’s compliance and IT departments. \nYou will help external clients understand our compliance and risk software solutions and integrate these into their IT or systems infrastructure.\nYou will be involved in interesting and challenging, client-facing work, with responsibility for some or all phases within the project life cycle, including data analysis, implementation, training and ongoing client relationship management.\nThe role is based in our Mumbai office.  As this is a client-facing role, you may frequently be based on client site, and regular travel is part of the job, up to 50% of your time. About the Team:You will be part of the Professional Services team, working closely with our Product Technology, Sales and Product Management teams. \nThe Professional Services team is recognized for its passion and professionalism, with a fun, energizing and fast-paced work environment.\nThe role will report into the Regional Lead, Professional Services, and collaborates closely with other Professional Services team members on client projects.About the Responsibilities:Functional consulting support and data analysis:Using your understanding of compliance and sanctions risk management, provide advice and support to clients on compliance and risk regulations, systems and processes.\nInvestigate and analyze client business activities and processes to make them more efficient and compliant using LNRS products.\nConduct workshops to gather and analyze client requirements and recommend solutions.\nUnderstand client use cases and requirements and apply best practice to client implementation.\nIdentify, analyze, and interpret trends or patterns in complex data sets.\nEnsure the integrity of project data, including data extraction, storage, manipulation, processing, and analysis.\nPerform the functional customization of the solution.\nTrain end users on the new systems and processes.\nCreate and deliver ad-hoc reporting as well as automating on-going reporting to meet client needs.\nManage project prioritization, planning and tracking to ensure quality and timelines of deliverables to the client are met.Implementation:Deliver, install, and configure all applications to specified requirements and provide technical training and transfer of knowledge.\nTroubleshoot client issues during implementation.\nMaintain strong client relationships through regular close contact.\nOrganize and execute deep technical and product health checks and audits for clients.\nOwn and coordinate quality reviews – escalating issues appropriately and prioritizing activities.About the Requirements:Overall Work Experience: 4~10 YearsPrimary Requirement:Good communication skill\nAbility to learn.\nFamiliar with Technologies\nSelf-motivated\nClient-facing/Should have exp in Service-based or Product-based organizations.Secondary Requirement:Familiarity with Banking/Financial services\nExp with AML/KYC, Financial-crime compliance, sanctions screening, transaction-screening/monitoring.Expectations from the Candidates:Candidates should be willing to travel.\nCandidates will be in a customer facing role.\nCandidates will be covering the South APAC regions.Detailed Requirements:You are likely to be successful in this role if you have:A bachelor’s degree: a Science based degree is preferable.\nExperience in either a data analysis role or technical role involving product support and/or implementation.\nBusiness proficiency in EnglishAnd if you are:An intelligent, inquisitive professional with a passion for technology\nClient focused, with a strong desire to meet client needs.\nPrepared to undertake regular (international) travel.\nStrong business acumen.Key SkillsYou will possess the following technical skills:Knowledge of Unix and Windows Operating Systems.\nKnowledge of RDBMS and SQL.\nKnowledge of Application Servers Deployment (Apache Tomcat).\nStrong MS Office expertise, especially Excel.\nAnalytical, problem solving and troubleshooting skills and you can demonstrate great organizational and interpersonal skills.\nCollaborative and supportive, enjoying a team-based environment.\nStrong communication, presentation and influencing skills.\nExcellent organizational skills, prioritizing a dynamic workload.\nHighly motivated, with energy and initiativeOther skills that are also desirable:Experience of managing small teams of analysts/ consultants.\nKnowledge of scripting languages (Python, C#, VBA).\nExperience with technical implementations.\nAffinity or experience within the Compliance domain: CTF (Counter Terrorist Financing), AML (Anti-Money Laundering), or KYC (Know Your Customer).\nExperience of working in a multi-national and multi-cultural environmentBenefits:Group Health Insurance Policy (covering self and family)\nGroup Life insurance/accident policy\nGenerous long-service awards\nNew Baby giftAbout UsRELX is a global provider of information-based analytics and decision tools for professional and business customers.We help scientists make new discoveries, doctors and nurses improve the lives of patients and lawyers win cases. We prevent online fraud and money laundering, and help insurance companies evaluate and predict risk. Our events enable customers to learn about markets, source products and complete transactions. In short, we enable our customers to make better decisions, get better results and be more productive. The Group serves customers in more than 180 countries and has offices in about 40 countries. It employs over 33,000 people, of which around 1/4th are technologists.We want RELX to be a great place to work, where our employees feel valued, have equal opportunities and benefit from pay equality, regardless of their gender, gender identity, national origin, race, ethnicity, religion, sexual orientation, age or disability status. Inclusion and diversity are important to our future. We need the engagement of people from a wide range of backgrounds, experiences and ideas to achieve real innovation for our customers around the world.About LexisNexis Risk SolutionsLexisNexis Risk Solutions Group is a portfolio of brands that span multiple industries providing customers with innovative technologies, information-based analytics and decision tools and data services. Our brands provide market-specific solutions that help our customers solve problems, make better decisions, stay compliant, reduce risk and improve their operations.Serving customers in more than 180 countries, we employ approximately 9,700 people. We are part of RELX, a global provider of information and analytics for professional and business customers. We have offices in 24 countries around the world.Apply today, or to learn more about opportunities with LexisNexis Risk Solutions or RELX Global, join us here:https://risk.lexisnexis.com/group/careerswww.relx.com/careers/join-us-----------------------------------------------------------------------Elsevier is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. We are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our Applicant Request Support Form: https://forms.office.com/r/eVgFxjLmAK .Please read our Candidate Privacy Policy.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}