{
    "Job ID": "69873854",
    "Description": "Department –GBS People OperationsDoes your motivation come from challenges and working in a dynamic environment? Do you thrive in a working environment where close collaboration with key stakeholders and strategic alignment is essential? Do you have a can-do attitude with continuous improvement as one of your career objectives? Then we might have the right position for you. Apply now and join a growing team, working in an international environment.About the DepartmentPeople and Organisation (P&O) function designs strategies for Recruitment, Performance Management, Learning & Development, Total Rewards, Mobility, Reporting and Analytics. Global Business Services (GBS) People Operations (PO) is a department within P&O situated in GBS Bangalore. The core activity and responsibility of GBS-PO is to support the global P&O to achieve its strategies.The PositionAs a Senior EDM Associate I the key responsibilities:Act as a Subject Matter Expert on all the tasks within the team. Organizational Management and Employee Profile – Employee data Life cycle maintenance (EC/SF & SAP HR – end user). Perform data to day activities according to defined KPIs and SOPs, follow internal guidelines/ policies. Ensure data confidentiality is maintained at all times. Ensure transactions are processed as per data quality standards and checklists. Prepare and maintain Work Instructions and SOP’s as and when required. Collaborate within team and stakeholders across GBS. Actively participate in Projects and engagement activities. Prepare weekly/Monthly KPI reports. Drive Key projects and actively participate in Working Groups. Training & Knowledge Transfer to new and existing teamShould be able to coach and mentor team members.Perform all actions related to Employee Data Management, perform self-Data Quality checks on the cases performed to deliver Quality Right first Time.\nStandardizing and Simplification of existing process (Lean mind-set). Report generations and perform analysis on data. Creating and Maintaining SOP and relevant documents related to process.\nShould have prior hands-on experience in transition of processes. Support and maintain the relevant Standard Operating procedures and process documents.\nPrepare and maintain relevant process documents like Forms, Templates, checklists and emails. Drive the sharing of process knowledge and best practices within the team. Professional interaction and communication should be able to get message and sent across. Self-motivated to work independently, within delegated authority, with minimal.\nDemonstrates the ability to work as part of a team, and a clear understanding of how assigned responsibilities impact other processes and the work of other people. Should be able to quickly grasp new or complex processes, concepts. Constantly and proactively support continuous improvement on processes / reports.Qualifications Relevant academic degree at minimum bachelor’s degree (Business Administration, etc.).\n3-5 years of relevant experience preferably in an international HR Shared Service Centre.\nExperience in transfer, promotion, termination, bonus, salary changes.\nExperience in ERP system (SAP HR & EC) as an end user on Org Management and Position Management & Employee Profiles.\nPreferably experience with SAP & EC.\nPreferably experience with SAP HR, EC and LEAN principles.\nPreferable exposure in supporting international countries.\nExperience on Process Transition.\nBe able to work independently with no supervision.\nEffective and affirmative communication.\nHave a relatively high stress threshold and possess the ability to handle work fast in accordance with pre-defined KPIs.Working at Novo NordiskWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.ContactTo submit your application, please upload your CV online (click on Apply and follow the instructions).Apply Now!Deadline29th September 2023.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}