{"Job ID": "69873132", "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleWhat does a great Quality Assurance Engineer do? The Quality Assurance (QA) - Specialist will be part of Corillian Online ASP Professional Services Implementations team. This position is responsible for providing Quality Assurance during client online banking and bill pay implementations. The QA Analyst will be a technical member of the Implementations group and will possess strong quality assurance skills.This individual will create and perform semi-routine tasks under minimal supervision, develop, apply, and maintain quality requirements for client implementations while looking for automation opportunities. This quality associate will develop, implement and maintain automation tools, QA test plans and test cases, automation scripts, reports, and procedures. Provide the necessary help to team members. Should participate in Go-Live and Post-Production events.What you will do:Will influence QA processes and procedures.\nWorks under minimal general supervision, often setting own goals with management approval.\nCommunicates effectively in all forms to all audiences.\nPerforms cross-functional duties without guidance.\nExecutes test cases.\nSupports major quality initiatives that may span multiple departments from a technical perspective.\nAdvocates for improved quality practices throughout the organization and synthesizes new methods with measurable positive changes to company operations.\nResponds to occasional requests for additional off-hour work in the event of an emergency client incident or critical business need.What you will need to have:5-7 years of experience in software testing.\nExperience of handling a team of 3–5 members.\nCandidate must have experience and willing to work on both automation and functional/ manual testing.\nBasic SQL & Product Installation knowledge.\nExperience in Automation (C# and Selenium) - Required Skills.\nHands-on in API/Web services testing.\nGood knowledge of SDLC and QA practices and hands-on exposure.\nExposure to online banking domain.\nHands-on in functional, regression, and automation testing.\nExposure to QA tools (Bug Tracking, Test Management, Script Management, etc.).\nExperience in creating manual test cases, automated test scripts and execute them in various test environments.\nExposure to Metrics (Defect, Test Execution), status reports and QA-Signoff reports.\nParticipate in all design reviews, test case reviews, interaction with BU, clients and stakeholders.\nKnowledge of tools such as Tricentis qTest, eJIRA, etc. is preferred.\nISTQB Foundation or Advanced certification is preferred.What would be great to have:Client management and relationship building skills; experience with external clients preferred.\nProven ability to develop and maintain positive working relationships.Thank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}