{
    "Job ID": "69875844",
    "Description": "Responsibilities:Maintain configuration and functional design documents and support role-based profile changes. Perform all tasks in the development cycle, starting from business process definition, to configuration and unit testing, assistance and follow-up with user testing, to co-ordination of transports to Production, to training and post-live support and fixes, etc.\nFunctional and technical expertise to develop SAP PaPM solutions and best address customer requirement and provide expertise in SAP PaPM.\nWork well under cost and time constraints and good understanding of allocation, profitability and SAP PaPM.\nImplement customer specific profitability solutions, analyze client business process and build models in the areas of cost accounting, allocation and transfer pricing.\nTested and migrated successfully to SAP FPSL from Bank Analyzer 8.5.\nPerform configurations with respect to the SAP FP-SL architecture and components like SDL, RDL, CVPM and reporting integration with SAP Analytics Cloud.\nHandle Business Requirements Management on accounting standards IFRS9.\nTranslate functional requirements into solution design for configuration of SAP FPSL.\nDesign of functional and technical concepts in financial sub-ledger accounting (SAP FPSL).\nGood Knowledge on Data modelling, ETL, Training and Knowledge transfer.Essential Skills:4+ years relevant experience in SAP\nMust have SAP Technical knowledge and good understanding of allocation, inventory,  profitability and SAP PaPM.\nAbility to provide solution SAP S/4HANA costing.\nExperience in SAP implementation at banking industry.\nCloud Essentials experience\nMust have worked on implementation of the central financial software FPSL Finance\nMust have configured Integration of the central subsidiary ledger FPSL in S/4HANA Finance.\nExperience in SAP Profitability & Performance Management (PaPM), SAP Financial Performance Management (FS_PER) SAP FI/CO, SAP HANA Finance and Cost Management.\nMust be confident in Solution design and configuration of SAP FPSL.\nExperience in Banking sector and Accounting business processesEssential Qualification:Bachelors is a mustJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}