{
    "Job ID": "69876510",
    "Description": "Empowering people, creating technology.Responsibilities:Support the Marketing Manager to develop and implement PAID Digital awareness and communication strategy based on brand objectives.\nOrchestrate the Digital customer journey (PAID, OWNED,SHARED, EARNED) from planning to rollout in relevant channels of the Digital funnel until conversion to deliver against KPI's.\nTrack all media platforms, search platforms (Google, Youtube,Amazon) and campaign analytics from our brand and competition for agile improvement and adaptations of future. Campaigns ensuring KPI’s are met, and ROI is achieved needs to be included.\nOwn the OWNED channels (for your area of responsibility), develop SEO strategy and constantly maintain and upgrade the website/shop content in order to create unique user experience and optimize sales.\nDevelop Customer selling stories (both national and account specific) and coordinate Customers line reviews to help drive. Top line sales, awareness, and trial of products for customer shelf sets for e-commerce.Qualifications:Minimum 3-5 years’ experience in preferably in FMCG D2C brands in digital marketing, media, and SEO managementMasters in marketingThe Freudenberg Group is an equal opportunity employer that is committed to diversity and inclusion. Employment opportunities are available to all applicants and associates without regard to race, color, religion, creed, gender (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, mental or physical disability, genetic information, marital status, familial status, sexual orientation, protected military or veteran status, or any other characteristic protected by applicable law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}