{"Job ID": "69874648", "Description": "We are currently looking for a Recruitment Consultant to join our team at AL AMAL BUSINESS SOLUTIONS. As a Recruitment Consultant, you will be responsible for sourcing, attracting and hiring qualified candidates for our clients in the hospitality industry. You will work closely with the Hiring Manager to understand the clients recruitment needs, develop job postings, and execute recruitment strategies to create a strong talent pool. You will be responsible for managing full recruitment cycles from sourcing to candidate onboarding, ensuring a positive experience for both clients and candidates. As a member of our team, you will have ample opportunities to learn and grow in a dynamic and supportive environment.AL AMAL BUSINESS SOLUTIONS is a boutique multi-service consultancy firm with over 10 years of experience providing specialized services to a diverse range of clients in the hospitality, healthcare, retail, construction and engineering sectors. We take pride in our reputation as a transparent, flexible, and affordable service provider. Our consultants are committed to delivering desired results and goals within budgets and timelines.Identify and attract qualified candidates through various recruitment channels such as job boards, social media, networking and referrals\nCollaborate with AABS Hiring Manager to understand the clients recruitment needs and develop job postings\nScreen, interview and assess candidates to ensure they meet client requirements\nProvide guidance and support to candidates throughout the recruitment process\nNegotiate salary packages and develop job offers for successful candidates\nMaintain accurate and up-to-date candidate records in our recruitment database\nBuild strong relationships with candidates to ensure a positive experience throughout the recruitment cycle\nDevelop and execute recruitment strategies to ensure a consistent pipeline of qualified candidatesJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}