{
    "Job ID": "69872594",
    "Description": "Vice President8 - 13 yearsBengaluruEquity Derivatives Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries. As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture. Institutional Securities Technology (IST) is a global team which develops enterprise systems in support of Morgan Stanley's Institutional Securities Group, including Equities, Fixed Income, Commodities, Investment Banking, Research, and Global Capital Markets. The ESTAR group within IST provides technology solutions to the Equities Business. This role is within the Derivatives Trade Capture team with the key focus on implementing trade capture and trade lifecycle management applications for our traders and their support teams. Equity Derivatives Business Analyst Morgan Stanley is the number one Equities house globally. TX is the Firms strategic trade capture platform for OTC and Structured equity derivative products. The platform is central to the Firms OTC and Structured activity, as well as being flexible enough to adapt to the latest demands from our trading desks. Job Profile We are embarking on a significant renovation of our OTC and structured equity derivative trade capture and lifecycle management platform front to back to support the expected business growth in the near term and are seeking highly motivated, proactive business analysts to play a pivotal role in ensuring the success of this project. Working within a global development team of engineers, testers, fellow business analysts and business SMEs, the ideal candidate will be a strong team player, enthusiastic problem-solver, articulate communicator and have an astute eye for detail. Sound knowledge of equity derivative or other derivative products, the trade lifecycle, the regulatory landscape and evolution of the industry trends are essential to be successful in the role. As a member of the development team, the candidate will be committed to Agile principles and play a critical role in fostering a culture of continuous delivery and ensuring teams develop high-quality, fit-for-purpose solutions to meet the needs of our Trading, Sales and Operations users. In return, this role presents an excellent opportunity for candidates to work closely with our stakeholders to develop key relationships, extend their business knowledge, shape the next generation of the equity derivative platform within the bank and drive innovative business solutions in a complex and demanding business domain. Responsibilities include: - Working closely with key stakeholders capturing key business requirements, preparing business case and functional specifications. - Analyzing complex trade booking structures and life cycle events front to back and determining how best to represent these within the system(s). - Performing impact analysis on upstream / downstream systems impacted by possible changes and working with relevant teams them to coordinate any changes and integration required. - Working closely with developers to ensure they fully understand the requirements and be part of their Agile SDLC process. - Producing test scenarios and ensure they are thorough and integrated into the early stages of development. - Conducting user acceptance testing, demos and training sessions with users. - Ensuring the required documentations are up-to-date from inception to end of the project cycle. - Assessing existing processes and seeking opportunities to optimize, streamline or re-engineer Collaborating with the release management team, developers and stakeholders to estimate, prioritize and scheduleJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}