{"Job ID": "69875546", "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The Opportunity:\n The Sr. Cloud Network Engineer will provide project-oriented network configuration and design, utilizing best practices for enterprise datacenter infrastructure. Working in a collaborative environment, the engineer will suggest and implement solutions relating to all aspects of a highly complex network infrastructure to see all assigned projects through to completion.\n Your great at:\n Plan, design, document and implement solutions to the networking needs of the business.\nCoordinate hardware and software upgrades while working with key stakeholders.\nProvide support of routers, switches, firewalls and load balancers (physical and virtual).\nPlan and recommend design that could improve the existing network environment.\nImplement networking best practices and standards throughout the infrastructure.\nCreate and update documentation (to include Visio diagrams) relating to all implementations.\nUnderstanding of ITIL process including change and incident process.\n24x7 on call work outside of these hours.What it takes:Minimum 5 Years of experience in complex network implementation/support\nHands on in F5 Load Balancer LTM, Certificate management, Routers, Switches, Firewalls, Load Balancers (Multivendor Network Environment) like Cisco Nexus , FortiGate, Checkpoint, PaloAlto, Juniper\nMust have Network Skills & Concepts: \nTCP/IP, routing protocols (EIGRP, OSPF, BGP, MPLS, IPSec VPN), Layer2/3 switching and VLAN configuration, Firewall security policy.\nRouting Protocols: EIGRP, BGP, DMVPN, OSPF.\nTrunking Protocols: VLAN, SVI, 802.1q, LACP, vPC\nGood understanding on Spine and Leaf\nTroubleshooting through TCP/IP packet capture analysis\nExperience in Hyperscalers (AWS, Azure, GCP.) and Cloud networking.\nExperience in Automation using Python, Terraform, Ansible\nUnderstating of Network Virtualization (VMware NSX-T)\nDesired Certifications (not mandatory):\nCisco CCNA Data Center\nCisco CCNP Data Center\nGCP/AWS or Azure CertificationOpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at 1-800-499-6544.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}