{
    "Job ID": "69875803",
    "Description": "Executive Sous ChefKey Responsibilities: Assist with organizing special events and special food promotions.\nAssist the Executive Chef in developing training plans, develop training material in accordance with Kempinski guidelines and implement training plans for the Food Production employees and other Food and Beverage employees.\nAssume the duties and responsibilities of the Executive Chef in their absence. \nAssist the Executive Chef in developing and maintaining up-dated operations manuals for all Food Production and Stewarding sections and in developing recipes and maintaining up-dated and accurate costing of all dishes prepared and sold in the Food and Beverage operation.\nParticipate and supervise the kitchen in the preparation and presentation of all food items in accordance with the hotel’s food and beverage standards and standardized menu guidelines.\nMaintain a hygienic kitchen and personal hygiene.\nWork with Executive Chef and Director of People Services to ensure the departmental performance of staff is productive and assists in planning for future staffing needs.\nAssist in maintaining a comprehensive, current and guest focused set of departmental standards and procedures and oversee their implementation.\nEnsure training needs analysis of Kitchen staff is carried out and training programs are designed and implemented to meet needs.\nProvide input for probation and formal performance appraisal discussions in line with company guidelines. \nCoach, counsel and discipline staff, providing constructive feedback to enhance performance.\nApprove leave after consideration of hotel occupancy.\nWork with Executive Chef in the preparation and management of the department’s budget.\nDemonstrate awareness of OH&S policies and procedures and ensure all procedures are conducted safely and within OH&S guidelines and ensure your direct reports do the same.\nBe aware of duty of care and adhere to occupational, health and safety legislation, policies and procedures. \nBe familiar with property safety, first aid and fire and emergency procedures and operate equipment safely and sensibly.\nInitiate action to correct a hazardous situation and notify supervisors of potential dangers.\nLog security incidents and accidents in accordance with hotel requirements.\nImplement and practice HACCP.Requirements:  Nationality: LebaneseEducation: Gastronomic education certificate or equivalent (apprenticeship/diploma/BA/Bsc), HACCP Certifcation Experience: Minimum 6 years kitchen experience\nMinimum 3 years in kitchen management role, preferably with an international 5* hotel chain\nExperience in a standalone F&B operation is beneficial\nInternational experience is preferred\nBanqueting experience is preferredLANGUAGE: Ability to work and communicate in a multinational environmentLocal language – excellent oral and written skills where necessary\nEnglish – excellent oral and written skills\nAdditional language - beneficialCOMPETENCIES: Ability to work independently, thrive under pressure in challenging circumstances and come up with proactive, rational solutions\nExcellent written and verbal communication skills\nAbility to establish and retain effective working relationships with hotel staff and clients/vendors\nAbility to identify and delegate tasks effectively\nExcellent organizational and time management skills\nApplies a professional, confidential and ethical approach at all times\nWorks in a safe, prudent and organized manner\nKnowledgeable of food safety regulations\nAbility to operate computer and office equipment\nProficiency in Microsoft OfficeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Beirut, Lebanon",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}