{"Job ID": "69870003", "Description": "The Bosch Group, founded in 1886, is a leading global supplier of technology and services for over 130 years. It employs roughly 420,000 associates worldwide (as of December 31, 2022). According to preliminary figures, the company generated sales of 88.4 billion euros in 2022. Its operations are divided into four business sectors: Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. As a leading IoT provider, Bosch offers innovative solutions for smart homes, Industry 4.0, and connected mobility. Bosch is pursuing a vision of mobility that is sustainable, safe, and exciting. It uses its expertise in sensor technology, software, and services, as well as its own IoT cloud, to offer its customers connected, cross-domain solutions from a single source. The Bosch Group’s strategic objective is to facilitate connected living with products and solutions that either contain artificial intelligence (AI) or have been developed or manufactured with its help. Bosch improves quality of life worldwide with products and services that are innovative and spark enthusiasm. In short, Bosch creates technology that is “Invented for life.” Read more about us at https://www.bosch.com/company/Bosch Global Software Technologies Pvt Ltd (formerly known as Robert Bosch Engineering and Business Solutions) is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global suppliers of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 25,000 associates, it’s the largest software & technology center of Bosch, outside Germany, headquartered in India with a global footprint and presence in US, Europe, and the Asia Pacific region. BGSW offers end-to-end solutions that connect sensors, software, and services to enable businesses to move from the traditional to digital or improve businesses by introducing a digital element in their products and processes. In this role you will be part of the brand, marketing & communications team for Bosch Global Software Technologies, BGSW (formerly known as Robert Bosch Engineering & Business Solutions, RBEI)Minimum 5 years of exposure to working with the IT Industry. Should have handled minimum 0.5 mio.sqft area\nResponsible for Soft services majority housekeeping services for IT companies standard.\nPreparing detailed RFQ document for housekeeping services at BGSW Ban location right from creating the scope of services, area details, penalty clauses decision on the manpower requirement etc., Bosch locations across Bangalore locations.\nEnsure through service partner that high standard hygiene is maintained across all office area, restrooms, meeting/conference rooms. Frequent audit to all offices with regard to hygiene at washrooms.\nPlan and support for all the internal workshops/ trainings, events, customer meetings, customer events/visits etc., Right from planning, briefing to the service partner, arranging and until execution for all the events at Bosch.\nVendor evaluation every year and decide on the service partner\nTo be able to Introduce mechanized cleaning service at Bosch in order to efficiently utilize the manpower and also give the complete hygiene environment. Always updated the service with new technology and hygiene way of handling.\nPlan and executive complete housekeeping requirements for the new location.\nPlan for suitable Facility Managers from service partner side who would manage operations at all leased facility.\nSupport for relocation planning during change of leased buildings.\nManage non-hazardous waste management right from process for segregation, disposal to authorized vendor etc.\nAware of ISO standards OHSAS, EMS\nAwareness on suitable Chemicals and consumables for housekeeping services\nAwareness on digital tools for soft services implementation, closure etc.\nAwareness on managing office chair maintenance, window blinds etc.Graduation in Hotel Management\nLooking for FEMALE CANDIDATES ONLY !!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}