{"Job ID": "69873086", "Description": "Work Flexibility: Hybrid or OnsiteHR Operations SpecialistWho We WantSelf-directed imitators. People who take ownership of their work and need no prompting to drive productivity, change, and outcomes.\nEffective communicators. People who can interpret information clearly and accurately to concisely communicate results and recommendations to stakeholders, senior management, and their teams.\nData analyst. People who enjoy compiling, organizing and consolidating large volumes of data and reports.Detail-oriented process improvers. Critical thinkers who naturally see opportunities to develop and optimize work processes – finding ways to simplify, standardize and automate.Dedicated achievers. People who thrive in a fast-paced environment and will stop at nothing to ensure a project is complete and meets regulations and expectations.What You will DoAs the HR Operations Specialist, you will provide support and expertise to the business by managing day to day Workday transactions, HR data, enquiries, Tier 1 & Tier 2 support for India and the APAC region. Reporting to APAC HR Operations Leader, you will collaborate with Local HRs, COE, Regional & Global HR Ops teams, Local IS and relevant stakeholders to drive HR operational excellence. You will play an integral role in supporting HR processes cycle, while participating in projects to drive continuous improvements in HR service delivery model, data quality, training, technology enhancements, and processes.Provide accurate, consistent and timely responses via MS Teams, HR case management & Phone systems\n\nSupport workforce administration processing, data input and verification of required documentation on the designated HR employee life cycle activity\n\nRespond to and troubleshoot employee and manager-related workforce transactions and issues\n\nDirect employees and managers to the appropriate online support materials, reports, tools systems, and/or vendors, if applicable\n\nManage organizational changes in the system, including preparing files for mass uploads, supporting mass changes and troubleshooting issues.\n\nSupport system testing and deployment of new functionality, participate in global SME networks\n\nIdentify issues with process configuration or system breaks and coordinate with HR Systems for fast resolution\n\nEnsure all escalated issues are handled in a timely manner and resolution is well communicated\n\nProvide reporting support for compliance needs and ad hoc requests\n\nReview and audit system transactions and troubleshoot transition and data issues\n\nProvide guidance and training on Workday HR processes, workflow and relevant systems.\n\nUpdate and maintain HR Ops knowledge base and troubleshooting guides.\n\nManage workload efficiency to fulfil commitments in accordance with established service level agreements (SLA)What You Need2-3 years of total HR/HRIS experience required. Candidates with strong experience in Workday/Tier 2 support may be considered as Senior HR Operations Specialist\n\nBachelor’s degree required\n\nBasic knowledge of HR data, processes and system integrations\n\nHands on ticket resolution, data cleansing experiences with a strong attention to detail\n\nExcellent analytical skills, effectively manage confidential data, and drive data quality\n\nDemonstrated excellence in customer relations, problem solving and proactive service orientation\n\nAbility to work under tight deadlines and in a rapidly changing regulatory and business environment\n\nAbility to work independently as well as a team player in a highly collaborative environment.\n\nStrong written, verbal communication and presentation skills in English. Fluency in other asian languages is a plusWork Flexibility: Hybrid or OnsiteTravel Percentage: 10%Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}