{
    "Job ID": "69874040",
    "Description": "Be part of a team that designs, develops and integrates highly complex software functions within Honeywell Aero Services & Connectivity. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.We are looking for experienced Software Development Engineer to support and develop Full Stack Web applications/ portals and services in Java Spring Boot and React JS. The successful candidate is going to be part of our agile software development team working closely with DevOps and Vendors for large volume data processing and integration to advanced web applications. The candidate will also need to be able to automate Unit Tests, Functional & Performance Tests using Junit, Katalon & Locust.We need people who can think on their own and see software as part of the entire product. The ideal candidate you should enjoy taking ownership of projects or defined deliverables and want to work in a collaborative environment with a small team. Creativity, independent thinking, and vision are required.Key ResponsibilitiesWork in an agile environment with other developers and our algorithm team to develop and implement new software programs.\nMaintain and improve the performance of existing software.\nWrite high-quality, efficient, testable code.\nContribute to planning, design, implementation, testing, operations, and process improvement as a member of a Scrum team.\nRequirements and design\nSoftware architecture and coding\nIntegration\nCertification\nTest\nFeature Definition\nCustomer Support\nVerification and Validation\nAbility to code in multiple languages\nAnalytical skills & software development skillsJOB ACTIVITIESYOU MUST HAVEBachelor’s degree in engineering or Computer Science\n3+ Years of overall software web application development experience\n2+ Years’ experience working Java Spring Boot\n2+ Years’ experience working React JS#HTSIND2022Bachelor’s degree in engineering or Computer Science\n3+ Years of overall software web application development experience.WE VALUEBachelors or higher degree in Computer Science or a related field (or equivalent work experience)\nExcellent verbal and written communication skills\nExperience with RESTful APIs\nExperience with modern best practices for HTML and CSS development, including LESS or SASS\nExperience with Kafka Message Queues\nExperience with Junit for Unit Test Automation\nExperience with Katalon Studio for UI & Functional Test Automation\nExperience with Locust for PSR Test Automation\nExperience with Postgresql\nExperience with Docker containerization & Kubernetes orchestration\nExperience with Automate, Bamboo, Octopus\nExperience with Kibana\nUnderstanding Agile software development lifecycle\nKnowledge of software configuration management and change management practices, and usage of GIT version control, JIRA & Confluence\nDiverse and global team and collaboration\nWide degree of creativity and latitude\nIndividuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events.\nAbility to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness.\nCan quickly analyze, incorporate, and apply new information and concepts.JOB ID: HRD209102\nCategory: Engineering\nLocation: Lot 115 (P),Nanakramguda Village,,Serilinganpally Madndal, RR District,Hyderabad,TELANGANA STATE,500019,India\nExemptJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}