{
    "Job ID": "69876129",
    "Description": "Here at AppNation, we strive to develop cutting-edge AI-powered mobile apps. Our products consistently hit the top-charts in over 30 countries and make a positive impact on 20+ million users worldwide! Currently, we are actively seeking a talented Data Scientist to join our dynamic team. If you are genuinely passionate about mobile apps and enthusiastic about contributing to the creation of remarkable experiences that are downloaded and enjoyed by millions, then you might be our next teammate!As a member of the Marketing team, you will have a unique opportunity to take ownership of organizing and monitoring the data analysis infrastructure of our applications, playing an active role in data review and interpretation, working closely alongside some of the brightest minds in the mobile app arena. Your expertise and dedication will be essential in shaping the development and success of our apps.What you’ll be doing:Work together with the development team to ensure a healthy data flow\nOrganize data analysis tools and develop in-house solutions\nTake new steps to shape and improve the company's data analysis mentality\nAssist the installation and use of modern data analysis and visualization tools\nPlay a leading role in establishing a data analysis culture\nTake the responsibility of data analysis and manage inter-team communication in this field\nInterpret data and create the relevant reportsWhat we’re looking for:Bachelor’s degree preferably in Mathematics, Statistics or a related subject, having a Master’s degree in a similar field is a plus\nAt least 2 years of experience as a Data Scientist or in a similar role\nStrong proficiency in SQL and BigQuery\nHands on experience with ETL, Looker, Tableau, Power BI and best practices\nKnowledge in Python and R\nFamiliarity with AppsFlyer and Adjust is a plus\nAnalytical and solution-oriented mindset\nAbility to make data-driven decisionsWhat’s in it for you?Competitive Salary\nSemi-Annual Success Incentives based on Contribution and Performance\nMeal & Commute Compensation\nPrivate Health Insurance\nHybrid Working Environment\nBirthday Leave\nAccess to Udemy Courses\nGym Reimbursement\nRelocation Package\nTech GearWhat does the recruitment process look like?1. Application Review: We will carefully review your CV to evaluate your accomplishments and qualifications.2. Interview: A 30-minute Google Meet interview with our People & Culture Specialist will be conducted to discuss your experience, expectations, and potential synergies. This will help us determine how we can collaborate effectively.3. Case Study: You will be provided with a project relevant to the position, which you will complete to demonstrate your proficiency and practical knowledge.4. Technical Meeting: A Google Meet session with our team lead will be arranged for you to engage in in-depth discussions on technical topics that align with your expertise. You will be asked specific questions to further showcase your technical skills.5. Team Meeting: You will have an in-person meeting with the founders of AppNation, during which we will discuss your expectations and explore how you can contribute to our team. This interview will also provide an opportunity for you to gain insights into AppNation's culture and working environment.6. Final Decision: Within a few days, we will inform you of our decision regarding your suitability for the role.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Marketing",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}