{
    "Job ID": "69870121",
    "Description": "Job Objective:Develop and implement Dubai Tourism's regional business-to-business Travel&Trade marketing strategy, operating model and objectives; assist the regional relationship building activities by coordinating eventsFunctional Responsibilities·Provide support to the execution of Dubai Tourism's regional operating model drafting activities·Conduct research based on the identified methods, objectives, data sources and timelines to build an understanding of the trends, customer behaviors, major players and possible partners in the region·Conduct cost-benefit and feasibility studies to provide support to regional operating model development activities·Follow the provided direction to detail approved regional operating model and create organization structures, develop workflows and identify objectives·Review and collate theanalysis conducted (e.g. trend analysis, market research) to develop regional business-to-business marketing strategy·Monitor and report regional business-to-business marketing performance realization against set plans, metrics and standards·Draft regional business-to-business marketing performance related reports and presentations·Conduct market research on possible travel&trade organizations (e.g. travel agencies, airlines) to develop partnerships·Communicate with possible regional travel&trade organizations to collect detailed information and seek for partnership opportunities·Conduct feasibility and impact analysis to support regional travel&trade partnership negotiation process·Draft contracts, gather supporting materials and coordinate with regional travel&trade organizations during contract submission·Coordinate with internal stakeholders to understand Dubai Tourism's needs/ requirements from regional travel&trade partnerships·Coordinate with relevant internal stakeholders and draft the regional event calendar which includes exhibitions, roadshows, trips, etc.·Assess the information collected from providers (e.g. venue owners, collateral development companies, caterers, transportation providers) during in-market event (e.g. road shows, tourism sales calls, marketing events) planning and provide suggestions on suitable partners·Develop in-market event relatedmaterials (e.g. presentations, collateral, analysis) and handle vendor communication if necessary·Liaise with relevant internal parties to arrange logistics/ itineraries for in-Dubai marketing activities·Participate selection process of third party providers/ agencies and conduct follow-ups with the bidders if required·Communicate with third party providers (e.g. consultants, agencies) on day-to-day basis regarding to activities related to Dubai Tourism's regional business-to-business marketing needs; exchange information and resolve inquiriesMinimum Experience: ·5+ Years of relevant experienceMinimum Qualifications:·University/College Degree in a related fieldJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}