{"Job ID": "69870476", "Description": "For more than 265 years, JACOBS DOUWE EGBERTS (JDE) is inspired by its belief that it’s amazing what can happen over a cup of coffee or tea. We are fuelled by our purpose of unleashing the possibilities of coffee and tea to create a better future. Today, our coffee & tea portfolio is available in more than 100 developed and emerging markets, through a portfolio of over 50 brands that collectively cover the entire category landscape led by leading household names such as L’OR, Jacobs, Senseo, Tassimo, Douwe Egberts, Old Town, Super, Pickwick and Moccona. JDE is part of JDE Peet’s, the world’s largest pure-play coffee and tea company, headquartered in The Netherlands.What’s it like to work at JDE?We are proud of our passionate, driven associates that challenge the status quo and pursue mastery in everything they do. Our goal is simple and ambitious – JDE: A coffee & tea for every cup.At JDE, we're Made to Stand Out. Every day we are progressive in outlook, ambitious in nature, resourceful in action and decisive in approach, bringing coffee and tea moments to everyone around the world.As the Regional Procurement Analyst, you will be acting as a member of the MEA Procurement Team and support markets that drive business growth in hot beverages categories (Coffee, Tea).This position assumes responsibility for procurement processes support in the following geography: MEA (50%), Turkey (50%).Transactional support for further categories: HR, IT, Logistics&Warehousing, Marketing, Sales, CAPEX (MES), Raw&Pack materials.Regional Procurement Analyst is reporting to Procurement manager MEA•    1 or 2 years of experience in administration or procurement\n•    Fluent Turkish &  English, French will be a plus\n•    SAP knowledge (preferred)\n•    Highly collaborative / team player\n•    Independent and pro-active, able to deal with ambiguity\n•    Good analytical skills, diligence and accuracyYour application at JDE\nIf you are interested in this career opportunity at JDE, hit the “I’m interested” button and upload your application. After receiving your application we will do our utmost to give you quick feedback. Part of the recruitment procedure at JDE will be an online assessment, followed by interviews. A pre-employment check can be part of the recruitment process.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}