{"Job ID": "69872727", "Description": "We are looking for a highly motivated Talent Acquisition Coordinator who will support DNV in hiring the best talents. Our Talent Coordinator will play an important role in managing recruiting activities and coordinating with external and internal stakeholders. You will also be engaged in different process improvement initiatives where you will have an opportunity to share and implement your ideas.In your role you will:Partner with Talent Acquisition Specialists in IMEA, South Asia and North Asia Regions\nSupport the Talent Acquisition team with scheduling and coordination of recruitment activities\nSchedule interviews (including room bookings) for candidates and hiring managers across multiple time zones and locations\nConduct Candidate assessments and record all recruitment activities in the Applicant Tracking System (ATS)\nProvide support with Staffing Vendors in various regions\nCommunicate effectively both verbally and in written form with candidates to understand their queries and respond to them in an effective manner and ensure high quality candidate experience\nWork collaboratively with other team members within Talent Acquisition Team to share ideas for the continuous improvement of recruitment processes, incl. cooperation with the European Global Centre\nWork on improvement and digitalization initiatives2-3 years of experience as HR/Recruitment Coordinator\nBachelor’s degree required in related field (Human Resources related academic credentials preferred)\nExcellent organizational skills, verbal and written communication skills\nSelf-driven, and detail oriented\nExperience in managing and prioritizing multiple searches, projects and client relationships in a high-volume recruitment environment\nWorking knowledge of applicant Tracking Systems (iCIMS and Oracle knowledge will be an advantage)\nAbility to generate and interpret recruitment reports\nProficiency in the use of Microsoft Suite requiredAnd the following characteristics will be prioritized:A caring and respectful team player aligned with the DNV company values\nEnthusiastic and passionate about the recruitment processes\nStrong customer service orientation, proactivity and detail oriented\nStrong interpersonal skills and solid work ethic\nAbility to develop and implement new ideas or ways of working and adapt to change\nExcellent written and oral communication in English is required, other languages will be an advantageDNV  is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business. We provide classification, technical assurance, software and independent expert advisory services to the maritime, oil & gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.Combining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers’ decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight. With origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.The Global Shared Services (GSS) organization within DNV  provides high quality, cost effective services and processes within Human Resources, Finance and IT, based on requirements defined by the business areas and Group. GSS also develops central competence for distinct services, projects and development and will support policy, procedures and system implementation on a global, regional, and local level.GSS is about bringing a team of true process experts together, going for professional service levels at industry standards, and offering centers of expertise for competence based advisory. We are driven by people’s competence and motivation to help and support the business areas. As a member of the GSS community you act in a professional, multi-cultural, competent and service oriented environment with good possibilities to enhance your personal competencies and expertise, and to build a strong network with colleagues around the world.DNV is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to gender, religion, race, national or ethnic origin, cultural background, social group, disability, sexual orientation, gender identity, marital status, age or political opinion. Diversity is fundamental to our culture and we invite you to be part of this diversity!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}