{"Job ID": "69870501", "Description": "Rotork plc is a British-based company, Manufacturing industrial flow control equipment. We are a global company with 3,200 employees serving 170 countries. Rotork ensures cutting-edge products are available for every application, as we solve customer challenges and develop new solutions to create successful and reliable operations. An experienced Dynamics D365 Functional Consultant.\nExperience in any of the D365 Modules like Supply chain, Trade, Sales, Marketing, Service and Finance.\nExperience and knowledge of working with D365.\nPreviously involved in implementation or support projects of D365.\nWill be delivering / supporting the deployment of MS D365 global build to all Rotork Subs.3+ years of relevant experience in D365 \nWomen candidates preferred.\nAny graduation\nExcellent communication and interpersonal skills.\nGood Knowledge of Excel, PowerPoint.\nA good team Player.Rotork is the market-leading global flow control and instrumentation company, helping our customers manage the flow or liquids, gases and powders across many industries worldwide.Our purpose is Keeping the World Flowing for Future Generations.For over sixty years, the world has relied on us to create the things that keep everything moving. From oil and gas to water and shipping, pharmaceuticals and food- these are the flows on which our modern world depends.Today we're respected and admired for our people, performance and products. Our success flows from our commitment to engineering excellence, and that's what we will always pursue, safely and sustainably.Rotork is going through an exciting period of change and growth, building on our existing market success. It's a great time to join us and make an impact in shaping the future of our business.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chennai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}