{
    "Job ID": "69875371",
    "Description": "Job  Responsibilities:BD has to manage Edge Solution & needs to serve as the key point of contact and manages the day to day activities between Schneider Electric and assigned Strategic Accounts.ØPosition:Presales Executive/ BD Manager Data Center (Non-IT infrastructure)ØWork Experience:7-8 years or more in sales/presales in the domain of Edge-DC / Data Center infrastructures like Power, Cooling, Rack, IBMS etc.ØSkills & Profile requirement:·Business Development, Pre-sales support to sales teams across region for Edge Data Center infrastructure which includes Micro Data Center, In-rack Smart Solutions, Rack, Power, Cooling, DCIM software Electrical work, Civil work and IBMS works. Co-ordinate/Review/Strategize Data Center business with Schneider Electric team.·Should act as a consultant during customer engagements and demonstrate Edge Data Center domain expertise.·Responsible for customer requirement understanding, developing solutions for – new Data Centers, Edge DC, retrofit Data Centers and other Data Center Life Cycle services offerings like Critical facility operations, Remote monitoring services etc.·Aware about DCIM software and its utility. Should focus on DCIM software as a key driver for Data Center Business.·Responsible for Region’s Data Center Project Revenue numbers along with sales team. He/she should Plan and Strategize along with sales teams to achieve Targets.·Consultant Meetings and Relationship·The person should be well versed with Electrical and HVAC calculation tools.·Should have knowledge of Electrical single line diagrams and HVAC piping schematic etc.·Good to have knowledge of IT infrastructure like Server, Storage & Network H/w.·Quick learning ability and passionate about technical solution design & selling.·To analyze the exact customer needs to create solutions that meet the techno-commercial requirements of the customer keeping edge over market offerings.·Co-ordinate with internal teams like Solution teams, Product team, Project team etc. to define, Design and optimize solution to make is competitive and differentiated.·Good in reporting and follow ups to keep track of Funnel for the region and update leadership team about progress of datacenter business.B.E./B.Tech. (Electrical/Mechanical), MBA, CDCP certification will be preferred.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}