{
    "Job ID": "69873334",
    "Description": "ABOUT UNILEVER:Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that strive to improve the lives of our consumers and the communities around us every day. Every day, nine out of ten Indian households use our products to feel good, look good and get more out of life – giving us a unique opportunity to build a brighter future. We promote innovation, big and small, to make our business win and grow; and we believe in business as a force for good. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best.At HUL, we believe that every individual irrespective of their race, colour, religion, gender, sexual orientation, gender identity or expression, age, nationality, caste, disability or marital status can bring their purpose to life. So apply to us, to unleash your curiosity, challenge ideas and disrupt processes; use your energy to make the world a better place. As you work to make a real impact on the business and the world, we’ll work to help you become a better you!We are looking to hire a Research Executive, Homecare team based in Unilever R&D Bangalore:With an investment of €1 billion over the next ten years, we are on a mission to replace ingredients derived from fossil fuels in our cleaning and laundry product formulations with ingredients from renewable or recycled sources by 2030. Everybody does laundry yet 90% get the detergent dosage wrong. Unit dose solutions offer performance, convenience in a sustainable manner.https://www.unilever.com/news/news-and-features/Feature-article/2019/everybody-does-laundry-yet-90-per-cent-get-the-detergent-dosage-wrong.htmlhttps://www.unilever.com/news/news-and-features/Feature-article/2020/we-are-reimagining-the-future-of-cleaning.htmlARE YOU READY TO REIMAGINE THE FUTURE OF CLEANING AND JOIN US IN THE CLEAN FUTURE JOURNEY?PurposeIn this role, as part of the Future core formats team within the Science & Technology, Home Care category, you will be working on developing proprietary technologies for ultraconcentrated solid formats like powders and bars.  The need is to use renewable, sustainable, biodegradable ingredients that delivers superior cleaning benefits to consumers while offering convenience at affordable cost. You will be required to develop the technology with the triple constraints of chemical, plastics and water to identify the sweet spot for the consumers via new formats. The key challenges to be addressed include: scouting new materials, meeting the cleaning action standards criteria at affordable cost to everyone, establishing formulation robustness at lab and pilot scale, interfacing with various teams to address processing issues & identifying patent opportunities.Main ResponsibilitiesCandidate is expected to work in the laboratory to carry out “on the bench” experiments & demonstrate technical performance of product prototypes.\n\nHe/She will be expected to implement the technology in pilot plant with fine tuning formulation and processing.\n\nHe/She will work with team to develop new products or formats to offer superior cleaning benefits to consumers.\n\nHe/She will work with teams to build laboratory and processing capabilities.\n\nCandidate is expected to use appropriate literature / patent / competition / supplier searches related to the projects.\n\nHe/She will leverage digital age tools such as automation, simulation, and modeling to minimize experiments, maximize output & speed up program delivery.\n\nHe/She will work with external partners and suppliers to scout for technologies and speed up deliveries to market\n\nHe/She will interface with other Science & Technology, Global Design, Cluster Design, SEAC, regulatory teams while developing formulations/formatsAll About YouWe are looking for a person with right attitude and competencies. Candidates with one or two years of experience in product development are preferredEducation: Bachelor’s degree in Chemical Engineering / Chemistry with First class from reputed institutes\n\nBackground/Experience: Prior 2-3 experience in bar making is an added advantage.\n\nTechnical skills: Good understanding on material science and chemistry, colloid and interface science, and also processing development\n\nSoft skills: Teamwork, multi-tasking, good communication and writing skills, creativity, ability to analyze data and provide logical conclusionsWhat do we offer?Competitive Salary\n\nAgile Working\n\nOpportunity to work on brands that improve lives of billions of people across the globe\n\nExciting career opportunities in a global, purpose led business.We are looking for the right people for our roles and our ambition, we are open to talk about how our flexible working policies can make this role the right one for you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}