{
    "Job ID": "69875638",
    "Description": "Why Deliveroo?We're building the definitive online food company, transforming the way the world eats by making hyper-local food more convenient and accessible. We obsess about building the future of food, whilst using our network as a force for good. We're at the forefront of an industry, powered by our market-leading technology and unrivalled network to bring incredible convenience and selection to our customers.Working at Deliveroo is the perfect environment to build a definitive career. Firstly, the impact that working here will have on your development, allowing you to grow faster than you might elsewhere; secondly, the impact that you can have on Deliveroo, leaving your mark as we scale; and finally, being part of something bigger, through the impact that we make together in our marketplace and communities.Team overviewWe're looking for Engineering Managers onsite (Hybrid) in Hyderabad to manage both local and remote teams of SRE and Release engineers. You will report into a Senior Engineering Manager.\nThe SRE team builds (and maintains) services, tools and infrastructure utilised by the Engineering Organisation. We assist engineers throughout the firm in developing an SRE culture, allowing them to boost change velocity\nWe are involved in the production readiness of our services so that they can handle scale with speed and safety. We set the strategy for service reliability, observability, infrastructure management and incident response.\nOur team members build and debug distributed systems using software and systems engineering skills. If you are comfortable working with unfamiliar codebases, including internal, open source, and third-party code, you are a fantastic fit for us.What you will be doingAs a manager you will lead a group of SRE and Release engineers\nYou'll take part in decisions related to how we undertake new projects, contribute to the group strategy, set project goals and continue to support and mentor your team\nYou'll Grow a diverse, accomplished group of engineers, create a learning environment for your team and act as a technical mentor for engineers and up coming leaders and deploying large-scale projects internationally\nYou'll develop solutions to improve the reliability and stability across the Deliveroo Platform for our customers, riders, restaurants and grocery partner\nYou'll work with engineering teams across the organisation to gather requirements and scope out projects with the team\nYou will work outside of your development team and directly with our agents and customers to help scope our challenges and test your solution.\nExpectations\nExperience as a line manager to a team, with at least 2 years of experience\nExperience as a Software Engineer with a focus on code reliability\nExperience collaborating with managers, peers, and directs, with a mentality to encourage your team to improve their code\nExperience taking your team through performance reviews and goal setting, offering advice and setting your team up for success\nExperience with collaborationBenefitsAt Deliveroo, we believe that our employees are our most valuable asset. We are committed to providing a comprehensive benefits package that supports their well-being, financial security, and work-life balance. Join our team and enjoy your benefits such as Health Insurance for for you and your eligible dependents including parents, Gym reimbursement, Paid time off, Professional development.Workplace &amp; DiversityAt Deliveroo we know that people are the heart of the business and we prioritise their welfare. We offer multiple great benefits in areas including health, family, finance, community, convenience, growth and relocation.We believe a great workplace is one that represents the world we live in and how beautifully diverse it can be. That means we have no judgement when it comes to any one of the things that make you who you are - your gender, race, sexuality, religion or a secret aversion to coriander. All you need is experience with (most) food and a desire to be part of one of the fastest-growing startups in an exciting space.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}