{
    "Job ID": "69873015",
    "Description": "Job Overview\nManage end-to-end delivery of data management services for single/multi-service projects with minimal guidance, ensuring quality deliverables on time and within budget, to customer satisfaction. Provide comprehensive data management expertise to Clinical Data Management (CDM) team to provide high quality data management products that meet customer needs. Provide leadership to the team in the areas of project planning, execution, and close-out; financial management; communications; and milestone deliverables. Perform role of Data Team Lead (DTL). Comply with Good Clinical Practices (GCPs), applicable regulatory guidelines, SOPs, policies, and, where available, CDM guidance documents.Essential Functions\n• Client Management:\n• Serve as primary point of contact for customer on data management deliverables\n• With minimal guidance, provide project management expertise working with customer data managers, key decision makers, and internal team members to manage continuous process improvements, issue escalation, workload projections, and provide technical expertise\n• With guidance, provide input for and perform direct negotiations with customer, e.g., timelines, financial, process, resources\n• Maintain strong customer relationships\n• Ensure open communications with customer and IQVIA management to manage and meet contractual obligations\n• Service Management:\n• Meet with Data Operations Coordinator (DOC) and/or Data Operations team members on a regular basis to ensure milestones meet timelines and quality deliverables\n• Establish strong communications with Data Operations team, functional leads, project managers and all other stake holders\n• With minimal guidance, support DM service delivery with comprehensive DM process and technical expertise in executing projects.\n• Serve as the escalation point for unresolved data issues\n• with guidance, work with client data managers, vendors, internal team members for resolution\n• Work with functional manager(s) to ensure appropriate resources are assigned to meet project deliverables\n• With guidance, create and/or review and sign-off on all data management plan (DMP) documents\n• Implement proactive quality management plan. Identify any service and quality issues with agreed upon specifications per the DMP and contract/SOW and work with functional manager(s) to resolve\n• With guidance, track service performance and provide leadership to identify root causes of issues and implement remedial actions\n• Continuously look for opportunities to improve efficiency of tasks and quality of deliverables\n• Identify compliance issues and work with functional manager(s) to ensure timely follow-up and resolution\n• With guidance, maintain internal tracking databases and systems\n• Financial Management/Business Development Support:\n• With guidance, ensure service and quality meet agreed upon timelines and deliverables in contract/Scope of Work (SOW)\n• Manage SOW/budget\n• Review financial reports on a monthly basis and participate in project reviews as requested\n• Identify out of scope tasks and track change orders to completion\n• With guidance, may serve as Project Manager for single service DM projects, including financial tracking, revenue recognition, and invoicing\n• With guidance, participate in and support RFP process (review RFP documents, pricing, attend bid defense)\n• Other:\n• Provide input on DM process improvements or project solutions to CDM team/CDM department\n• Provide input on the development and implementation of a new technology or tool\n• Participate in a focus team or global or local best practice team\n• Perform other duties as directed by functional manager(s)Qualifications\n• Bachelor's Degree Health, clinical, biological or mathematical sciences, or related field Req\n• 3 years direct Data Management experience, including 1 or more years as a CDM project lead. Equivalent combination of education, training and experience.\n• Previous experience and proven competence in managing study delivery through full DM life-cycle (at least 1 medium Phase III). Demonstrated data management skills and thorough knowledge of the data management process (e.g., therapeutic area, extensive knowledge in DM processes, SAE reconciliation, external data vendor reconciliation, management of local laboratory data, and/or new technology). Knowledge of Medical Terminology, Pharmacology, Anatomy, and/or Physiology. Knowledge of operating procedures and work instructions and the ability to apply them in practice. Knowledge of Good Clinical Practices and applicable regulatory guidelines. Excellent communication, interpersonal, customer service, and teamwork skills. Excellent organizational and problem-solving skills. Excellent project management skills. Ability to work with minimal supervision, using available resources, e.g., functional managers, senior DTLs. Comprehensive understanding of clinical drug development process. Ability to establish and maintain effective working relationships with coworkers, managers and customers. Previous experience and proven competence in managing study delivery through full DM life-cycle (at least 1 medium Phase III). Demonstrated data management skills and thorough knowledge of the data management process (e.g., therapeutic area, extensive knowledge in DM processes, SAE reconciliation, external data vendor reconciliation, management of local laboratory data, and/or new technology). Knowledge of Medical Terminology, Pharmacology, Anatomy, and/or Physiology. Knowledge of operating procedures and work instructions and the ability to apply them in practice. Knowledge of Good Clinical Practices and applicable regulatory guidelines. Excellent communication, interpersonal, customer service, and teamwork skills. Excellent organizational and problem-solving skills. Excellent project management skills. Ability to work with minimal supervision, using available resources, e.g., functional managers, senior DTLs. Comprehensive understanding of clinical drug development process. Ability to establish and maintain effective working relationships with coworkers, managers and customers.IQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}