{"Job ID": "69874140", "Description": "EPAM has a great opportunity for a Principal, Digital Technology Solutions (Director) in Dubai as part of our region's rapidly growing Digital Engagement Practice (DEP). You will play a highly visible and leading role driving digital solutions and client engagement in the region while working closely with our DEP leadership teams globally. <br/> <br/>This senior position will support business development and pre-sales as well as consulting assignments in which we work with our clients to create the future, together. Our projects typically range from short-term reviews of existing businesses to developing business strategy, with a client base ranging from major multi-nationals to start-up business units, and you can expect to work on a similar range of architecture challenges. <br/>You will be responsible for integrating business and IT by creating the Digital Enterprise Architecture Map so that the right portfolio of investment projects can be designed and executed and achieves the planned business outcomes. <br/>You will be tasked to lead digital transformation in the organization through enterprise architecture and core technology expertise in Dubai and the broader Middle East providing end-to-end service for helping clients with business-to-technology alignment, platform selection, technology business cases, and road-mapping. Ideally, you will also come from a Digital Domain Architecture background with a strong hands-on skills acting as a pivotal link between our clients' business aspirations and our cutting-edge technological solutions. <br/><br/>This position will require wide experience, technical leadership, and multi-faceted communication skills. You will be involved in consulting, delivery services, and competency growth activities. You will need to leverage existing EPAM capabilities for up-sale and cross-sale on brand new and existing accounts, actively participating in sales and presales activities with sales, account and delivery managers.<br/><br/>RESPONSIBILITIES<ul><li>Evaluate the applicability of leading-edge technologies (cloud, applications and platforms) and use this information to influence future IT strategy significantly</li><li>Assess the current state for adherence to target state direction or validate deviation justification and the recovery plans and reviews and assess the impact of proposed scope changes to the future state</li><li>Translates clients’ business issues/opportunities into business requirements and technical solutions as well as provide expert consultancy to assist clients in defining their overall technology strategy, designs and delivery programmes</li><li>Develop conceptual architecture together with solution architects and oversight detailed solution architecture design</li><li>Acts as an Director of Technology, account CTO or Enterprise Architect, Lead Digital Domain Architect working with the delivery team in large or complex programmes</li><li>Lead teams of solution architects and delivery managers; lead technology consulting/architecture engagements and major transformation through execution phases and where applicable, drive internal, client and third party vendor mixed teams</li><li>Perform program(s) and project(s) execution oversight and overall architectural governance and develop, support, and communicate architecture guidelines and best practices</li><li>Accumulate and share knowledge across the team and the company, provide mentorship, conduct interviews and asses candidates, conduct webinars and training, participate in conferences as well as measure the impact and future direction of technology whilst providing first-line intelligence on new developments within the community</li><li>Engage clients with varying degrees of maturity at the CxO level to lead innovation and the development of strategy</li><li>Support clients (C-Level & Heads Of) in the establishment of digital architecture functions and architecture</li></ul><br/>REQUIREMENTS<ul><li>Extensive experience in technology implementing digital commerce and omnichannel solutions</li><li>Strong hands-on experience as a domain architect, enterprise architect, technology consultant, presales architect, or similar roles</li><li>Experience in forming and leading virtual teams</li><li>Must have</li><ul><li>Digital and omnichannel knowledge & experience: expert in at least 3 of the following domains</li><li>Digital commerce management</li><li>Stock and Inventory management</li><li>Order Management and Fulfillment</li><li>Customer Warehouse Management</li><li>Payments</li><li>Customer and Digital User Experience</li><li>Knowledge of a broader set of omnichannel customer-facing business domains</li><li>CRM and Loyalty</li><li>Marketing and Customer Service</li><li>Store operations</li><li>Merchandising</li></ul><li>Proven track record in implementing solutions using both established and modern platforms (e.g., SAP Commerce, kibo commerce, Sitecore, Adobe Magento) and progressive composable components (commercetools, fluentcommerce, contentstack, bloomreach search), with a focus on diverse implementation approaches. (customization, MACH, etc.)</li><li>Solid experience in technology consulting, encompassing technology selection, investment planning, business casing, and roadmap creation, culminating in impeccable solution design</li><li>Demonstrated expertise in presales activities, including crafting responses to RFI/RFP, delivering compelling solution pitches, providing accurate estimates, orchestrating presales prototypes, and more</li><li>Robust command of enterprise architecture principles and a nuanced understanding of architecture design, governance, and solution delivery</li><li>Ability and background experience to provide leadership in the practice and demonstrated effectiveness in client management</li><li>A proven record of delivering business value from information technology at an executive level</li><li>Digital D2C, B2B and B2C transformation, products and propositions</li></ul><br/>NICE TO HAVE<ul><li>Frameworks (TOGAF, Zachman, IT4IT, COBIT, ITIL etc.)</li><li>Body of Knowledges (BizBOK, DMBOK, ITABoK, etc.)</li><li>SAFe certification</li></ul><br/>WE OFFER<ul><li>Competitive compensation depending on experience and skills</li><li>Opportunity to work on leading edge platforms, working in a fast-paced, agile, software engineering culture</li><li>Knowledge-sharing with colleagues from EPAM's global tech communities</li><li>Unlimited access to LinkedIn learning solutions</li><li>Regular performance feedback and salary reviews</li><li>Opportunities for professional growth</li></ul><br/>ABOUT EPAM<ul><li>EPAM is a leading global provider of digital platform engineering and development services. We are committed to having a positive impact on our customers, our employees, and our communities. We embrace a dynamic and inclusive culture. Here you will collaborate with multi-national teams, contribute to a myriad of innovative projects that deliver the most creative and cutting-edge solutions, and have an opportunity to continuously learn and grow. No matter where you are located, you will join a dedicated, creative, and diverse community that will help you discover your fullest potential</li></ul>Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}