{
    "Job ID": "69875650",
    "Description": "Creator Success Manager (India) - Nas.ioAbout Nas Company&nbsp;Founded by Nuseir Yassin from Nas Daily (65 million followers), the Nas Company builds technology products for the modern creator. “Nas” means “people” and our mission is to Bring People Together. People can do more together. They can find friends, mentors, and accountability partners within a community. The single easiest way to change the world is to create tolerant and passionate communities.\nNas.io is a product for people to have a trustworthy and internationally recognized place to grow and monetize their communities – including content creators, thought leaders, coaches, entrepreneurs, and brands. With Nas.io, you can create memberships and sell digital products, while integrating with chat platforms such as WhatsApp, Discord and Telegram. With the rise of short form content, we believe every content creator needs to own their own audience and has the potential to build a business on top of their private community.Online communities today take many different forms:A community can be an influencer’s 1,000 true fans learning from each other in a WhatsApp group.\nA community can be a group of 100 people who come together every week to share and discuss ideas on Zoom.\nA community can be 25 people flying in from across the world for a yoga retreat every 3 months.As a company, we’ve successfully built communities over and over again – and now, we’ve raised a total of US$23 million to build powerful tools and integrations that will allow other people to build communities faster than ever before.About the roleNas.io recently launched in India, and we are looking for a Creator Success Manager, based in India, to help us onboard and support the pioneering India creators onto the Nas.io platform. This is a partnerships and customer success role that will be key in driving business growth in the region, reporting into the Head of Creator Partnerships in India.You will be one of the faces of Nas.io in India, working with and&nbsp; supporting content creators, brands and online entrepreneurs across the country (think YouTubers, Instagrams, LinkedIn/ Twitter Creators and more!). This will be a fast paced, exciting and dynamic role full of opportunities to grow and nurture creators across all different categories and backgrounds.What you will doThis role will cover a range of Partnerships, Account Management, Education and Event activities that include:PartnershipsIdentifying and building marketing collaborations with media, creators and businesses to reach more target creators for the Nas.io platform\nIdentify strategic partnerships with top creators and brands who can unlock new categories and growth for Nas.io IndiaEducation &amp; Thought LeadershipBuilding educational resources for communities to be able to make money on Nas.io\nEducating existing and new community managers on how to use Nas.io effectively\nProduct marketing to help CMs understand new features and launches\nBuild case studies of successful creators that can be used to help other customers learn and grow on the platformEventsRun online education events for Nas.io\nRun collaboration events with CMs to create visibility and attract new users\nFind smart opportunities for Nas.io to collaborate with brands and summits to find new creators (without spending much money!)Account ManagementManaging and maintaining relationships with Top Creators on Nas.io India\nManaging the community groups of Nas.io India CMs\nFinding ways to provide more opportunities for creators to earn with Nas.io&nbsp;Experience Desired3-5&nbsp; years working in a business development, partnerships or marketing capacity.\nAt least 1-2&nbsp; years experience in working with content creators, influencers, entrepreneurs, or a high level of interest/ knowledge in the online entrepreneurship and creator space\nExceptional storyteller, both written and verbal.\nIndependent self starter who is comfortable in a remote working environment.&nbsp;Our Company ValuesThink in days: Not months. Not weeks. Days. Consistent, small steps give massive results towards fulfilling our mission.Always share secrets: We foster transparency and collaboration through open knowledge sharing.Create for the world: Everything we create, from our content to our products, is universal and speaks to the world.Do no harm: All our actions intend to bring a positive impact to everyone around us.Explain for a 10-year old: We communicate in a simple and inclusive manner, free from unnecessary complexity.&nbsp;BenefitsAt Nas Company, we work hard, REALLY HARD! So we value our employees' well-being and believe that a supportive and fulfilling work environment contributes to their success. We're proud to offer a range of benefits that will enhance your professional and personal life. Here's what you can look forward to as part of our team:💻 Remote Working: For those based in our offices, we provide the flexibility of remote work. Enjoy a balance between the office and your preferred workspace.😷 Medical Insurance: We care about your health. Our comprehensive medical insurance plans are tailored to each region, ensuring you have the coverage you need.🧘🏽‍♀️ Self Care/Wellness Fund: Your well-being matters. We provide a monthly fund of $100 USD to spend on activities that bring you joy and promote your self-care.🍎 Fully Stocked Fridges: Stay fueled and energized with our fully stocked fridges featuring a selection of healthy, high-protein, and low-calorie snacks and drinks.👯‍♀️ Team Outings: We believe in the power of connection. Join us for team outings that foster strong relationships and create lasting memories.🏖️ Yearly Retreats: Unwind, bond, and collaborate at our annual company retreats. A time for the entire company to come together to rejuvenate and bond.&nbsp;🌍 Nas Summit and Nas Travels: Employees who successfully clear probation are eligible for a choice between attending 1 Nas Summit or 1 Nas Travels trip per year, fully sponsored (T&amp;Cs)💰 Stock Options: As part of our team, you'll have the opportunity to own a piece of the company through stock options, aligning your success with ours.🚕 Transport Allowance: Employees located in Singapore and Dubai enjoy a transport allowance, making your daily commute more convenient.At Nas Company, we're committed to nurturing a supportive and engaging workplace that promotes your growth and well-being. Join us and enjoy a comprehensive array of benefits designed with you in mindJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}