{"Job ID": "69872682", "Description": "Contract Duration: 12 Months (renewable and extendable)Manage Security & Market Safety organization and oversee all related activities within an affiliate and act as the key contact and counselor to Affiliate Security & Market Safety teams/designates (if applicable) and Affiliate (commercial, manufacturing, and other business units) management for Security & Market Safety issues.Plan, implement, drive and follow-up security & market/fleet safety programs' requirements in order to address and mitigate all security and safety risks to people and reputation. Minimize/prevent fleet related crashes, injuries, fatalities and security losses and property damage. Ensure that all risks mitigation plans and emergency response procedures are implemented, trained and kept up-dated in order to avoid business disruption, and to be in compliance with relevant local legislations, company's principles & practices, standards, procedures and guidelines.Lead the local Security & Market Safety in accordance with Corporate strategy and Company commitments. Manage the local Security & Market Safety. Ensure the local Security & Market Safety organization has received sufficient training to perform their job.\nEvaluate emerging business and operational models for potential Security & Market Safety risk exposure and gaps; highlight risks/exposures with affiliate management, the Senior Manager, Security & Market Safety, and other Security & Market Safety stakeholders.\nIdentify and solve Security & Market Safety issues within the affiliate. Maintain situational awareness of the country, including external and internal risk exposure and road accident trends, to inform business decision-making processes.\nMaintain regular liaison with affiliate (commercial & manufacturing) management, other stakeholders, and functional peers to align Security & Market Safety strategies and service levels with affiliate strategy and objectives.\nPerform/conduct functional security and market/fleet safety risk assessments and reviews at the affiliate level; identify and address risks and non-conformities. Respond to and report Security & Market Safety incidents as per Program requirements.\nPlan, organize and deliver security, market safety and fleet safety training programs as per company and local regulatory requirements to all local staff.\nProvide expert support to local management on tactical and practical emergency response management.\nEnsure timeliness and accuracy of Security & Market Safety-related incident and events reporting requirements. Review/consolidate related metrics and KPI, to provide focused and detailed reports; monitor atmospherics and escalate trends and critical issues to appropriate levels of management.\nImplementing fleet safety minimum requirements, in order to ensure that the correct standard of vehicles are procured in line with company Fleet Safety requirements.\nHelp to select, appoint, manage and oversee local third party service providers in conjunction with procurement and Senior or Cluster Security & Market Safety Manager.Requirements and Qualifications:Minimum - 2 to 3 years in a corporate, operational security environment or related area, preferably in a country security/safety manager role or equivalent.\nDeveloped knowledge of specialist security systems & market safety tools\nWorking knowledge of OHS / NEBOSH best practices beneficial.\nLanguage: Full professional proficiency in English, Arabic is an advantage.\nWell versed in MS Office Package, Power BI is a plus.\nExperience conducting security risk assessments and security or safety audits, familiarity with supply chain security standards (i.e. TAPA, C-TPAT), OHS training or certifications (such as NIOSH or equivalent) a plus\nUnderstanding of crisis management and emergency response best practice and knowledge of fleet safety best practices a significant advantage.\nStrong verbal and written communication skills, high level of personal and professional integrityJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}