{"Job ID": "69872884", "Description": "DUTIES AND RESPONSIBILITIES: Performs the professional duties of a Specialist Family Medicine in adherence to the Delineation of Privileges depending on the efficiency and skills of the particular individual.\nAdministers Executive Health Program examinations on a regular basis.\nOrders diagnostic laboratory and X-ray examinations, determining the diagnosis and prescribing applicable therapy and taking the necessary preventive medicine.\nReviews journals and textbooks in order to keep current on latest techniques, procedures and therapy.\nPrescribe or administer treatment, therapy, medication, vaccination, and other specialized medical care to treat or prevent illness, disease, or injury.\nImmunize patients. \nPrescribe treatments or therapies.\nPrescribe medications.\nCollect, record, and maintain patient information, such as medical history, reports, and examination results. Collect medical information from patients, family members other medical professionals. Record patient medical histories.\nRefer patients to medical specialists or other practitioners when necessary.\nParticipates in continuing in-service training programs, physician’s conferences, etc. Answers in-patient consultations from medical or other in-patient services.\nComply with all OSH and infection control policies, standards and procedures and cooperate with hospital management to comply those requirements.Administrative activities:Maintains complete and accurate records of all cases.\nAttends committee meetings when so assigned by the Head of department.\nInvolved in development of international level guidelines protocols along with senior staff to standardize and improve quality of service provided.\nFollows standard policies and procedures as required by HAAD, JCI, ISO, OSHMS and other regulatory bodies.\nParticipates in and contributes to in-service activities such as training programs, CMEs, lectures, conferences, or other committees as requested and rounds and participates and contributes to all the quality assurance activities of the service (e.g., monthly mortality and morbidity conference, peer review, audit, and chart review).\nParticipates in the monthly activities related to Family Medicine \nParticipates in in-service death review, chart, Quality Assurance, and peer reviews.\nTo work with the patients throughout the entire process starting from consultation to treatment plan.\nParticipate in improvement initiates within the department.\nHandle complaints in an amicable manner when necessary\nFoster interdepartmental liaison in order to ensure maintenance of established level of Service Agreements.\nAware of hospital fire policy and emergency procedures.\nParticipate in a quality assurance program for the endocrinology services and help develop and monitor clinical and other established indicators.\nDocuments of care provided, and education/information given to patients within their medical health record, as per professional and practice standards / protocols.\nReviews journals, texts, or periodicals in order to keep current on latest techniques, procedures, drugs and therapy.\nCommunication, interpersonal skills as applied to interaction with co-workers, superiors, patients & families.\nAbility to work long hours and work effectively under stress and pressure.\nAbility to demonstrate patience, compassion, sensitivity, and self-motivation. \nMust have good decision-making skills and emotional stability in dealing with sensitive and life-threatening situations. \nMust have good communication skills to be able to interact with many parents and caregivers of newborns. \nMust have excellent medical skills such as manual dexterity to perform surgery on very small newborns and the ability to diagnose a variety of medical conditions.\nMust possess thorough knowledge of Medical Department policies and procedures with reference to the obligation to maintain the confidentiality of work.\nAbility to review procedures and implement new models of service delivery to satisfy client and organizational requirements.\nDemonstrated commitment to quality outcomes and ability to consult with staff regarding continuous improvement.\nAdheres to the Bylaws and Rules and Regulations of the Medical Department and assures that work performed is in keeping with the established standards of the Regulatory authorities.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}