{"Job ID": "69870252", "Description": "Tu as une passion pour les réseaux sociaux ? Tu maîtrises plusieurs langues (français, anglais, etc.) ?Tu recherches un emploi motivant et des perspectives d’évolution au sein d’un environnement d’excellence ? Ne cherche plus ! J’ai une bonne nouvelle pour toi : TELEPERFORMANCE Tunisie recrute des modérateurs de contenu bilingue.Un poste basé sur nos valeurs qui nous animent : l'innovation, la proximité, l’écoute, l’épanouissement et la bienveillance. Le tout, agrémenté d’une touche de « FAST & FUN » ! Rejoins-nous maintenant !Ta mission si tu l’acceptes :Jouer un rôle essentiel en utilisant tes connaissances des tendances dans l’amélioration de l’expérience utilisateur notamment en rendant la plate-forme friendly et safe !Nous te garantissons :Un CDI dès l’embauche et une formation produit rémunérée.\nLe choix parmi deux régimes horaires de travail : 40H et 28H par semaine.\nUn salaire fixe motivant complété par un 13ème mois et un système de primes attractif (prime sur objectifs mensuelle, prime de flexibilité mensuelle, bonus sur challenges).\nDe nombreux avantages voués au bien-être de nos collaborateurs : transport gratuit, tickets restaurant et assurance groupe, prime d’ancienneté, primes saisonnières (Ramadan, rentrée scolaire), fonds social (mariage, naissance, aides exceptionnelles, crédits à 0%), tarifs préférentiels auprès d’enseignes commerciales diverses.\nDes opportunités d’évolution grâce à nos politiques de formation continue et gestion de carrières (95% de nos managers sont issus de la promotion interne).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Tunis, Tunisia", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}