{"Job ID": "69873119", "Description": "Job Description:Job Title: Analyst/Sr AnalystLocation: Pune, IndiaRole DescriptionIn accordance with Anti-Money Laundering Requirements, Banks, such as Deutsche Bank AG (\"DB\"), are obliged to perform Know-your-client (“KYC”) reviews on all new clients they adopt. These checks and reviews are made in strict accordance with regulatory requirement and the bank’s internal policies.The project involves verification of the Client data, performing due diligence checks on the Clients, reviewing KYC documentation performing the risk assessment of the Client, liaising with the Business/Compliance, advising on KYC requirements and signing off on new client adoptions.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoy.Best in class leave policy.\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nFlexible working arrangements\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesResponsible for verification of Client data\nPerform due diligence of new and existing clients covering a wide range of different client types including Listed and Regulated, small/medium/ large private and public companies as well as more complex structures such as SPVs, Co-operatives, Foundations and Funds, Governments, Joint Ventures, etc.\nVerifying KYC documentation of the Clients to be adopted/reviewed.\nPerform the risk assessment of the Client to be adopted/reviewed.\nSigning off on new client adoptions and periodic reviews\nManage New Client Adoption or Periodic Review stream, to ensure that all requests are approved in accordance with regulatory requirements and the bank’s internal policies.\nManage exception ensuring that all SLA’s defined with the Business on timeliness and quality are adhered.Your skills and experience1 to 2 years of relevant work experience (AML/KYC/compliance related) within corporate financial services industry, Research/Analytics role in other Banks / KPOs etc\nUnderstanding of Control, Compliance, Investigation/chasing functions in banks\nFamiliarity AML/KYC regulations and industry guidelines (FSA, JMLSG, 3rd EU Money Laundering Directive, MiFID)\nAbility to interpret regulatory guidelines and assessing risk scores and entity types.\nAbility to interpreting alerts.\nAbility to identifying trends and inconsistencies.\nUnderstanding of end-to-end KYC process.Experience/ExposureGraduates with good academic records\nExposure to draft procedures based on policies formulated by the Bank's AML Compliance departments.\nRelevant KYC experience in any Financial Sector for 1-2 years\nGerman Language experience and proficiency level -B2.2 aboveHow we’ll support youTraining and development to help you excel in your career.\nFlexible working to assist you balance your personal priorities.\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}