{
    "Job ID": "69874028",
    "Description": "Job Description\n145 ! Is the number of colleagues in clinical project management contributing to >100 diverse clinical projects across the entire Novartis organization. Come join this team of multi-cultural, motivated and solution-focused colleagues directly impacting the lives of patients and families. Our CPM organization offers a dynamic and flexible environment to enable you to learn and grow your cross-functional expertise.\nYour responsibilities include, but are not limited to:\n• Execute clinical services and meet planned deliverables in line with defined roles and responsibilities agreed with colleagues/customers.\n• Support set-up and maintenance of information in Clinical Trial Management Systems (CTMS) and other systems as applicable, under responsibility of COS or CPM as applicable: Update data, timelines, milestones, EC/HA authorizations, etc. on an ongoing basis.\n• Support (Sr.) Clinical Project Manager (CPM) with study budget management, ensuring accurate planning, tracking and reporting of clinical study budget and Grant Plan as applicable. Perform Good receipt booking in line with Vendor financial report and study status, as required\n• Support set-up and maintenance of Trial Master File (TMF): Ensuring that all key documents are present and filed as appropriate in TMF, under responsibility of COS or CPM as applicable. Follow up with Clinical Trial Team at agreed frequency for TMF maintenance.\n• Track clinical service progress, ensure CTMS, TMF and other systems as applicable are up to date, report to colleague/customer as per scope of work. Address questions; escalate issues or critical findings to project lead (Sr./CPM).\n• Support (Sr.) CPM in set up and coordination of External Service Providers, ensuring all information, documentation and material in place for study start during study conduct and close-out. Follow-up with External Service Providers on day-to-day operations.\n• Ensure all data is reported to the Clinical Trial Team and available to colleague/customer. Logistical support to study team (internal and external) onboarding process\n• Support in meeting set up, coordination and meeting minutes, running reports from systems, draft project documentation. Support CTT in study start-up activities, recruitment and close-out activities as required. Champion the implementation of operational changes and transitions as required.\nDiversity & Inclusion / EEO\nWe are committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\nWhat You’ll bring to the role:\nEssential:\n• Approximately 3-4 years of operational experience of clinical study execution in a pharmaceutical company or contract research organization.\n• Experience in finance: forecast, actuals, cost reconciliation, a plus. Strong technical and organizational skills (Excel, MP,), Details oriented.\nDesirable requirements:\n• Thorough knowledge of Good Clinical practice. Demonstrated ability to establish effective working relationship in a matrix and multicultural environment.\n• Demonstrated presentation and diplomacy skills. Strong customer-oriented mindset.\nWhy Novartis?\n236 million lives were touched by Novartis medicines in 2022, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s li\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\nImagine what you could do here at Novartis!\nCommitment to Diversity & Inclusion:\nNovartis embraces diversity, equal opportunity and inclusion. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration, and empowers our people to unleash their full potential.\nAccessibility and accommodation\nNovartis is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the recruitment process, or in order to perform the essential functions of a position, please send an e-mail to [email protected] and let us know the nature of your request and your contact information. Please include the job requisition number in your message.\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to learn more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/networkJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}