{
    "Job ID": "69873432",
    "Description": "Job Number 23167882 Job Category Food and Beverage & Culinary Location Goa Marriott Resort & Spa, Post Box No. 64 Miramar, Goa, Goa, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Accountable for overall success of the daily kitchen operations. Exhibits culinary talents by personally performing tasks while leading the staff and managing all food related functions. Works to continually improve guest and employee satisfaction while maintaining the operating budget. Supervises all kitchen areas to ensure a consistent, high quality product is produced. Responsible for guiding and developing staff including direct reports. Must ensure sanitation and food standards are achieved. CANDIDATE PROFILE Education and Experience • High school diploma or GED; 4 years experience in the culinary, food and beverage, or related professional area. OR • 2-year degree from an accredited university in Culinary Arts, Hotel and Restaurant Management, or related major; 2 years experience in the culinary, food and beverage, or related professional area. CORE WORK ACTIVITIES Ensuring Culinary Standards and Responsibilities are Met • Manages kitchen shift operations and ensures compliance with all Food & Beverage policies, standards and procedures. • Estimates daily production needs on a weekly basis and communicates production needs to kitchen personnel daily. • Assists Executive Chef with all kitchen operations and preparation. • Prepares and cooks foods of all types, either on a regular basis or for special guests or functions. • Develops, designs, or creates new applications, ideas, relationships, systems, or products, including artistic contributions. • Assists in determining how food should be presented and creates decorative food displays. • Maintains purchasing, receiving and food storage standards. • Ensures compliance with food handling and sanitation standards. • Performs all duties of kitchen managers and employees as necessary. • Recognizes superior quality products, presentations and flavor. • Ensures compliance with all applicable laws and regulations. • Follows proper handling and right temperature of all food products. • Operates and maintains all department equipment and reports malfunctions. • Checks the quality of raw and cooked food products to ensure that standards are met. Leading Kitchen Operations • Supervises and coordinates activities of cooks and workers engaged in food preparation. • Leads shifts while personally preparing food items and executing requests based on required specifications. • Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example. • Encourages and builds mutual trust, respect, and cooperation among team members. • Serves as a role model to demonstrate appropriate behaviors. • Maintains the productivity level of employees. • Ensures employees understand expectations and parameters. • Establishes and maintains open, collaborative relationships with employees and ensures employees do the same within the team. • Ensures property policies are administered fairly and consistently. • Communicates performance expectations in accordance with job descriptions for each position. • Recognizes success performance and produces desired results. Ensuring Exceptional Customer Service • Provides services that are above and beyond for customer satisfaction and retention. • Manages day-to-day operations, ensuring the quality, standards and meeting the expectations of the customers on a daily basis. • Sets a positive example for guest relations. • Empowers employees to provide excellent customer service. • Interacts with guests to obtain feedback on product quality and service levels. • Handles guest problems and complaints. Maintaining Culinary Goals • Achieves and exceeds goals including performance goals, budget goals, team goals, etc. • Develops specific goals and plans to prioritize, organize, and accomplish your work. • Utilizes the Labor Management System to effectively schedule to business demands and for tracking of employee time and attendance. • Trains employees in safety procedures. Managing and Conducting Human Resource Activities • Identifies the developmental needs of others and coaching, mentoring, or otherwise helping others to improve their knowledge or skills. • Improves service by communicating and assisting individuals to understand guest needs, providing guidance, feedback, and individual coaching when needed. • Participates in the employee performance appraisal process, providing feedback as needed. • Brings issues to the attention of the department manager and Human Resources as necessary. Additional Responsibilities • Provides information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person. • Analyzes information and evaluating results to choose the best solution and solve problems. • Attends and participates in all pertinent meetings. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}