{
    "Job ID": "69873387",
    "Description": "Avery Dennison Corporation (NYSE: AVY) is a global materials science and digital identification solutions company that provides branding and information labeling solutions, including pressure-sensitive materials, radio-frequency identification (RFID) inlays and tags, and a variety of converted products and solutions. The company designs and manufactures a wide range of labeling and functional materials that enhance branded packaging, carry or display information that connects the physical and the digital, and improve customers’ product performance. The company serves an array of industries worldwide, including home and personal care, apparel, e-commerce, logistics, food and grocery, pharmaceuticals and automotive. The company employs approximately 36,000 employees in more than 50 countries. Reported sales in 2022 were $9.0 billion. Learn more at www.averydennison.com.This Role is responsible for managing Administrative & Security functions for multi location business of the organization. The role will be based at Pune Plant & will manage day to day administration, facilities management & Security services for the plant complex as well as Kolktatta Distribution center. This role will report to Plant Manager, Pune & will facilitate the Plant Manager by organizing the essential services for running of the Plant. These services will include the facilities management, staff transportation & taxi services, canteen services, stationery & printing services, travel management, event management & liaising with Local authorities and managing secured environment for the business contrinity of the plant. This role will have a dotted line reporting to the Manager-Administration and will ensure the best practices, SOP & compliances are followed in day to day operations. This role will collaborate with all depts in order to support the business.Job Responsibilities:The incumbent will be responsible for putting systems and processes in place in all the areas under the Administration ambit (Security/Housekeeping/ horticulture/pest control/ staff Transportation/ Canteen services/ taxi hirings/ Uniforms/ Hotels/Events/ Engagement activities/ Contracting, billing & compliances/ Time office ).The incumbent will be responsible for all facility management including offices, Guest Houses and factory locations including maintaining inventory of all admin related assets.\nThe incumbent will be responsible for issuance, usage tracking and monitoring all employee related entitlements as per policy like mobile SIM, Data Card and Company Cars.\nThe incumbent will be solely responsible for maintaining proper liaison with the local Administration like Police, District Collectors Office, Municipal Authorities and other Government and Non-Government bodies including statutory authorities, as required.\nPreparation and monitoring of Admin Capex and Opex budget and ensuring budget versus actual expenditure tracking.\nTo generate administration MIS in desired formats at a Weekly/Monthly/ Quarterly/Half yearly frequency and ensure sound documentation of files, records.\nPartner Purchasing team in ensuring timely renewals of different Contracts and vendor performance tracking.\nReceives the office equipment and stationeries and arranges their storage / distribution.\nArranges allotment of company vehicles or arranges hired vehicles for company officials and guests/visitors and also oversees hotel / guest house accommodations of guests / visitors.\nOrganize the events within the company premise as well external events.The incumbent will have to operate Security across location in Line with “Structured Security Operating Manual\" with standing operating procedures.\nEnsure proper deployment of security personnel at site - by regularly visiting the site and by conducting SECURITY AUDITS.\nPut in place proper Registers & documents and e-systems, wherever applicable, to ensure Operational Efficiency.\nConduct regular liaison with Locals, assess Security Threat to employees- take corrective actions, manage the Site security, liaise regularly with security agencies etc.The incumbent should be a graduate with good communication skills &  minimum 10 years of relevant experience. The incumbent should have handled Administration in the manufacturing plant for a minimum of 2 years. The incumbent should be proactive, self-driven & energetic. The incumbent must be a good team player & enthusiasticLocal Language is MandatoryJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}