{"Job ID": "69875573", "Description": "Job DescriptionWe are passionate about being data and technically agile, and driving enhanced value for our clients and patients. Determined to improve patient health, we help PPD clinical research services provide industry-leading statistical, programming and clinical pharmacology contributions through global delivery, consistent quality adherence and scientific insight.We are currently recruiting for an experienced Sr Biostatistician II to join our Biostatistics & Programming department. Working remotely across the EMEA or at one of our offices in the UK – Cambridge or Glasgow.As a Sr Biostatistician II, you will function independently as Lead Statistician on projects and as support/project statistician on others, your responsibilities will include (but are not limited to) the following: Develop statistical analysis plans, including analysis database and tables & listing specifications \nProvide randomization schemes and appropriate documentation \nProvide sample size calculations and review protocols for completeness, appropriateness of clinical design and sound statistical analysis  \nCoordinate and collaborate with Programmers and Data Management personnel as to database maintenance, updating and documentation.  \nLead the project team, conduct team meetings, maintain project timelines, assess resources needed and allocate resources as required. \nProvide mentorship to junior team members Education/Experience:Master's Degree in Biostatistics, Statistics, Mathematics or related field \n5+ years of experience working in Biostatistics (previous CRO experience is desirable)  \nSolid SAS programming experience (proficient in BASE, STAT, MACRO and GRAPH) \nStrong understanding of statistical principles and excellent statistical skills\nGood project management experience, demonstrated through previous experience managing multiple projects \nCapable of providing mentorship and promoting teamwork in a multi-disciplinary team setting \nFluency in English is essential At PPD clinical research services we hire the best, develop ourselves and each other, and recognize the power of being one team. We understand that you will want to grow both professionally and personally throughout your career, and therefore at PPD clinical research services you will benefit from an award-winning learning and development programme, ensuring you reach your potential.As well as being rewarded a competitive salary, we have an extensive benefits package based around the health and well-being of our employees. We have a flexible working culture, where PPD clinical research services truly value a work-life balance. We’ve grown sustainably year on year but continue to offer a collaborative environment, with teams of colleagues eager to share expertise and have fun together. We are a global organization but with a local feel.Our 4i Values:Integrity – Innovation – Intensity – Involvement If you resonate with our 4i values above, and ultimately wish to accelerate the delivery of safe and effective therapeutics for some of the world’s most urgent health needs, submit your application – we’d love to hear from you!#LI-EM2Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}