{"Job ID": "69875820", "Description": "At Vialto we create the connections that build global careers and societies, bridging the gap between people and their aspirations. As the world of work continues to evolve, we are bringing together the individuals, ideas and technology to unlock business and human growth.In Morocco, we are starting an exciting new chapter with over 70 people on board. This is a story of growth, creating multiple opportunities for people who are committed to self-learning and continuous improvement, and who are flexible to work on technology-driven projects at the same time.Working at Vialto Partners is about getting the chance to be part of a multinational and dynamic team by bringing Finance expertise. It is about driving innovation, bringing up bold solutions and catching opportunities all while leaving your own personal footprint. Working with us means working with highly skilled and interesting people – and to do the work that matters.Our current vacancy - Finance Manager is a global role. You will be covering and supporting our VVN locations across the globe - Canada, US, Morocco, Poland, India, Malasia, Singapore.  Finance Manager will be reporting and closely working with existing Senior Manager and collaborating with Senior Vialto Partners Management.A minimum experience of 8-10 years in the field of finance.\nMaster’s degree in finance or MBA or any other relevant finance degree.\nExcellent level of written and spoken English\nExcellent interpersonal skills\nPrevious experience in FP&A domain, good understanding of Forecasting, Budgeting, Financial analysis\nGood understanding of Accounts Payable, Accounts Receivable and treasury (limited) functions\nManagement Reporting\nOverall, understanding of Transfer Pricing, international Tax and VAT will be advantage but not essential.\nMS office knowledge, especially MS Excel (handle macros, financial formulas etc.)\nPower BI and Alteryx knowledge will be preferredWhat´s in it for you?Comprehensive Health Care Insurance\nComprehensive Insurance Group Program\nPension\nThe possibility to work from our office in Casablanca and be part of our growing energetic Team.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Casablanca, Morocco", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}