{
    "Job ID": "69874047",
    "Description": "Lead - NR Client Service and Excellence-(2300017429)Job:Retail BankingPrimary Location:Asia-India-MumbaiSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 11:12:33 AMUnposting Date:29/Sep/2023, 10:59:00 PMJob SummaryEnsuring high quality customer service, ensuring internal and external compliance on NR operations, handling NR client escalations and leading the service agenda across NR channels- NR Acquisition and NR HUB) involving process improvements and re-engineering.ResponsibilitiesAssist Business NR Client Experience and Process Manager in coordinating, driving and directing effective customer service excellence, seamless processes, service agenda and audit related actionable across all NR Acquisition and NR HUB\nEnsure timely resolution of NR complaints and end to end closure for escalation cases.\nGather/prepare statics for service quality and productive indicators.\nReview of SRs across various platforms, referrals and rejects, including archival of documents.\nTracking of ratification on deviations/waivers approved for NR transactions\nEnsure compliance with internal and external guidelines and ensure minimal audit findings.\nFind ways to improve operations efficiencies and cost save measures \nEnsure high level accuracy on transaction processing within standard turnaround time to ensure client satisfaction.\nMonitor customer satisfaction survey ratings, net promoter score from the clients and ensure continuous improvement for better quality services.\nEnsure adherence to laid down processes, facilitate first time resolution, minimise rejections and client escalations.\nDrive digital penetration, migrate client transaction to alternate delivery channels.\nResponsible to ensure timely completion and follow up of remediations across NR channels including RFI, TRR, PRR, HNW, PEP review, dispensation, hard hold cases, sigcap and other CDD related remediations undertaken time to time. \nLead and support implementation of process improvement and simplification initiatives for the NR Business Unit. \nProactively communicate with the NR Client experience and process manager on process improvements andrisk issues. Escalate significant events to as appropriate.\nEnsure risks issues identified are resolved in an appropriate and timely manner. \nAssist NR Client experience and process manager in the implementation of standardised service framework across all NR channels in all locations.\nManage and ensure traction on various pending remediations for NR channels.\nIdentify gaps and arrange training on process improvements and policies for NR service.StrategyEnsuring high quality customer service, ensuring internal and external compliance on NR operations, handling NR client escalations and leading the service agenda across NR channels involving process improvements and re-engineeringBusinessNR Business ProcessesNR Service and ProcessesPeople & TalentMust be a graduate. MBA’s would be an advantage\nAbility to identify, monitor and resolve issues.\nStrong process orientation.\nAbility to influence outcome and manage conflict situations\nKnowledge of Bank TP and other systems\nKnowledge of NR processes, policies, and related guideline mandatory.\nDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead to achieve the outcomes set out in the Bank’s Conduct Principles:\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance mattersRisk ManagementEnsure compliance with internal and external guidelines and ensure minimal audit findings.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}