{
    "Job ID": "69875315",
    "Description": "What you will doAnalyze and report defects identified through our automation testing frameworks.\nDesign, develop, and execute comprehensive test cases to validate software functionality and performance.\nCollaborate closely with the development team to optimize and scale test activities.\nContribute to the ongoing enhancement and automation of software development processes.\nPerform quarterly release testing and verification of packages using existing automated established processesWhat You Have DoneStrong technical background and a passion for ensuring product quality.\nAbility to setup/automate postgresql server and related tools/application/components for reproduction of bugs or test scenarios.\nHands-on experience in testing ecosystem of vanilla postgresql: pg_regress, builtin testsuites, tap testing for advanced setups.\nProficiency in defining and executing automated test cases using industry-standard testing frameworks.\nExperience with Ansible for automating application deployment and configuration management.\nFamiliarity with Jenkins for continuous integration and continuous deployment (CI/CD) processes.\nHands-on experience with Linux operating systems for testing and development purposes.\nExperience in bash, python, pytest, or testinfra for automated testing.What Will Make You Stand Out:Active participation in open-source projects related to testing or the PostgreSQL ecosystem.\nExperience with containerization technologies such as Docker and Kubernetes.\nExperience with GitHub Actions for automating the application deployment and testing.\nKnowledge of cloud platforms like AWS, Azure, or Google Cloud Platform.\nFamiliarity with performance testing and security testing techniques.\nExperience with compiling, building, and packaging software applications.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}