{"Job ID": "69873202", "Description": "Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and the environment safer, healthier and more sustainable. From the food you eat to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic, and labelling is accurate. Eurofins is a global leader in food, environmental, pharmaceutical and cosmetic product testing and in AgroScience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.In over just 35 years, Eurofins has grown from one laboratory in Nantes, France to 62,000 staff across a network of over 1,000 independent companies in 61 countries, operating 900 laboratories. Performing over 450 million tests every year, Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.Eurofins is one of the fastest growing listed European companies with a listing on the French stock exchange since 1997.Eurofins IT Solutions India Pvt Ltd (EITSI) is a fully owned subsidiary of Eurofins and functions as a Global Software Delivery Center exclusively catering to Eurofins Global IT business needs. The code shipped out of EITSI impacts the global network of Eurofins labs and services.The primary focus at EITSI is to develop the next generation LIMS (Lab Information Management system), Customer portals, e-commerce solutions, ERP/CRM system, Mobile Apps & other B2B platforms for various Eurofins Laboratories and businesses. Young and dynamic, we have a rich culture, and we offer fulfilling careers.Work closely with the Business Analysts and HR Business teams to gather requirements for reports, interfaces, extensions, integrations, or any other functional changes\nDevelop functional and technical design and documentation for Oracle Applications dependent data conversions, interfaces, custom reporting, and custom applications.\nParticipate in the design, development, and maintenance of Conversions, Modifications/ Customizations, and Interfaces/ Integrations to/ from Oracle HCM Cloud\nOpen, manage and resolve Oracle Service Requests with Oracle Support\nSupport and maintain Oracle Patches and Upgrades\nDrive the resolution & troubleshooting of issues during development and post-production support.\nDesign, Document, and Perform Unit Testing to validate product functionalityExperience/ Qualifications:5+ years working on Oracle HCM Cloud Applications components\nDemonstrated strong analytical abilities\nWilling to learn a range of business or technical and functional specialties based on business needs\nExcellent interpersonal, communication, and presentation skills\nDemonstrated ability to convey complex information in a clear and concise manner\nExpertise in reports development, interface development, troubleshooting, Application security roles, and Workflow Approvals is mandatory\nHave experience in Oracles OIC, Benefit Open Enrollment, and Payroll Year End is a plus\nShould have contributed to the end-to-end implementation in at least a few of the modules: Core HR, Payroll, Compensation, Benefits, Learning, Talent, OTL, Digital Assistant, Help DeskAny GraduateExcellent analytical and problem-solving skills\nExcellent verbal/written communication skills. Fluent in English and the working country language\nShould be a self-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship management skills\nAbility to work in a complex international environment\nExperience in Agile (Scrum) methodologies would be a plus.\nAbility to adapt quickly to an existing, complex environment.\nAbility to quickly learn new concepts and software is necessary\nShould be able to mentor the team members and able to review their code and suggest best solutions wherever applicable.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}