{
    "Job ID": "69872502",
    "Description": "SNC Lavalin group is looking for a Contracts Expert with 5 years’ experience in managing and performing the administration of the employers’ Contracts preferably related to Intelligent Traffic System (ITS), undertaking commercial activities and representing the organization in negotiations of the most-complex contractual issues. Ensuring the Contractors meet their contractual obligations while coordinating & leading the required departments to ensure compliance with any legal, financial & corporate protocols.Role and ResponsibilitiesDirect liaison with the client, providing progress reports and advising on any contractual risks and opportunities.\n\nResponsible for the accurate administration of Contracts and the timely execution of the applicable clauses as required.\n\nDrafting contractual reports and correspondence.\n\nManaging Claims and Variations to ensure a robust response in compliance with the Contract.\n\nEnsuring the O&M Contractors fulfilment of all contractual obligations in accordance with the Contract.\n\nPreparation of contractual presentations.\n\nDriving progression via contractual progress meetings.\n\nDocumenting and addressing change and claim matters.\n\nParticipating in contractual negotiations and dispute resolution.\n\nEnsuring that all Project departments understand and adhere to the contractual obligations\n\nExperience in administering and managing various forms of Contract including standard form and bespoke.\n\nExperience in the Transport industry is a must.\n\nKnowledge and understanding of the legal requirements involved in specific contracts.\n\nExperience in managing certification of contractor’s payment applications.\n\nKnowledge of Operations and Maintenance Contracts is preferableQualification and Education RequirementsMandatory ExperienceA minimum of 5 years’ experience in Contract Administration. Preferably within Intelligent Traffic System (ITS) environment in Operation and Maintenance (O&M).   \n\nDegree required in relevant field.\n\nExperience in Middle East for a minimum of 3 years (Preferred).\n\nProfessional Membership with a recognized institution e.g., MRICS, MCIARB would be a plus.\n\nExperience in drafting contractual letters and taking the lead in coordinating with internal key players of the organization to address variations and claims matters.  \n\nProven track record of managing complex projects/contracts and leading cross-functional teams.Additional Skills:Getting Things Done attitude is a must.\n\nReliable.\n\nResourceful.\n\nContractual astuteness and Commercial awareness. \n\nGood written and spoken English\n\nAbility to communicate in Arabic (Preferred)\n\nCompetence in Project Management IT systems e.g., MS Office\n\nTeam working and Interpersonal skills\n\nDrafting of formal correspondence and presentations\n\nDispute avoidance/resolution skills\n\nAnalytical, problem solving and critical thinking skills\n\nStrong organizational and time management skills\n\nExcellent communication skills\n\nIntegrity\n\nHigh standard of service\n\nPromoting trust\n\nRespectful\n\nTaking responsibilityRewards & Benefits:We offer an excellent package which includes:A competitive salary\n\nTransportation allowance\n\nMedical and life insurance cover\n\nAnnual leave\n\nCompany gratuity scheme\n\nDiscretionary bonus scheme\n\nAnnual flight allowance to point of origin\n\nEmployee Well-Being Programme – 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants;SNC-Lavalin is committed to eliminating discrimination and encouraging diversity amongst our workforce. We aim to provide quality and fairness for all job applicants and employees and not to discriminate on grounds of gender, marital status, age, race, ethnic origin, religious conviction or disablement. We oppose all forms of unlawful treatment and discrimination.Our aim is for the company to be representative of all sections of society and that each employee feels respected and able to give their best. We are committed to a policy of treating all our employees and job applications equally.We pursue this commitment by:Having clear and concise procedures and guidelines for both line managers and employees to ensure policies are fully understood and implemented;\n\nComplying with the relevant employment legislation and codes of practice;\n\nEnsuring that all existing employees, potential employees, colleagues and customers are treated equally and with respect;\n\nEnsuring that the workplace is an environment free from discrimination, harassment, victimisation and bullying regardless of an individual’s gender, marital status, age, race, ethnic origin, religious conviction or disablement;\n\nMaking all decisions relating to recruitment, selection or promotion according to the employees’ ability.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}