{
    "Job ID": "69872670",
    "Description": "This is a new kind of hospitality, grounded in the spirit of discovery, the fantasy of nightlife and the adventure of connection. Hyde is more than a brand, it’s a state of mind.THE HYDE DUBAIHyde Hotels, Resorts & Residences, part of the world-leading Accor group, is the first Hyde hotel outside of the United States, Hyde Dubai Business Bay, in close proximity to the iconic Burj Khalifa directly fronting the Business Bay canal and promenade.The 276-rooms, all with balconies, is a mix of gracious standard rooms and luxurious suites with views of the Dubai Canal, the Dubai skyline and the iconic Burj Khalifa – the tallest building in the world.Hyde Hotel Dubai features three incredible culinary experiences including the Mediterranean concept, Cleo Mediterráneo, contemporary Japanese from Katsuya, hand-crafted burgers from Hudson Tavern. Also on the property is The Perq, a coffee concept, a lobby lounge, and Hyde pool & lounge as well as a spa, male/female salon, fitness center, a swimming pool and retail area. The hotel’s public areas, guestrooms and Cleo are designed by Ciarmoli Queda Studio. Katsuya, Hudson Tavern and Hyde pool and lounge are designed by Tristan Plessis Studio.The PositionOrganizes kitchen operations and prepares and serves a range of dishes, whilst supervising junior members of the Kitchen Brigade. Promotes the work culture and the company’s core values.DUTIES & RESPONSIBILITIESTo report for duty punctually wearing the correct uniform and name badges at all times\nOrganize shifting in the section with regard to mise-en-place production and its service\nGive tasks to Demi Chefs and Commis Chefs and check that they are carried out in the correct manner\nWrite daily wine, dry store, food requisitions and kitchen transfers on the appropriate forms for the approval of the Sous Chef / Head Chef in order to achieve the high stock rotation desired in his/her section.\nMaintain good colleagues relations and motivate colleagues\nEnsure that training on a one-to-one basis has been carried out and comprehended.\nCheck on a daily basis food preparation regarding portion size, quantity and quality as laid down in the recipe index.\nResponsible for completing the daily checklist regarding Mise-en-place and food storage.\nAttend daily and monthly meetings with the Chef de cuisine and other meetings as requested by the Sous Chef / Head Chef\nReport any problems regarding failure of machinery and small equipment to the Sous Chef / Head Chef and to follow up and ensure the necessary work has been carried out.\nCheck the main information board regarding changes in any Banquets or other information regarding the organization.\nKeep the section clean and tidy.\nPass all information to the next shift\nAccidents and sickness to be written in log Book and report to the Sous Chef / Head Chef\nCheck Demi Chefs / Commis Chefs on his/her section:  e.g. regarding personal hygiene.\nAssist the Sous Chef / Head Chef in composing new recipes and menu ideas.\nHave a complete understanding of and adhere to the company’s policy relating to fire, hygiene and safety.\nThe above description is not to be regarded as exhaustive. Other tasks and responsibilities of a broadly comparable nature may be added on a temporary or permanent basis as appropriateQUALIFICATIONS & REQUIREMENTS:Reading, writing and oral proficiency in the English language\nStrong leadership, training and motivational skills.\nStrong organizational skills and ability to work in stressful fast paced environment.EXPERIENCE:Minimum 2 years cooking experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}