{
    "Job ID": "69873633",
    "Description": "Discover the opportunity:Once upon a time, in the dynamic realm of fintech and global banking, a pioneering financial institution emerged, changing the way people experience online trading. Operating across over 20 countries, our client has been at the forefront of revolutionizing the trading landscape. Now, we invite you to become a vital part of their journey as they build a Design, Product, and Customer Experience (CX) hub in the vibrant city of Dubai.Discover the role:As a Design System Manager, you will play a crucial role in establishing and maintaining our clients' design system, ensuring consistency and excellence across all our products. You will be responsible for the following key aspects:\n\nAs a Design System Manager, you will play a crucial role in establishing and maintaining our design system, ensuring consistency and excellence across all our products. You will be responsible for the following key aspects:\n\nDesign System Strategy: Develop and communicate the vision and strategy for our design system, aligning it with the company's overall design and brand guidelines. This includes defining design principles, design components, and design thinking methodologies to guide the team\n\nDesign System Governance: Establish and enforce design system governance policies and procedures to maintain the integrity and consistency of the design system as it evolves\n\nCross-Functional Collaboration: Collaborate closely with cross-functional teams, including product designers, engineers, and stakeholders, to ensure the seamless integration and adoption of the design system in product development\n\nDesign System Documentation: Create and maintain comprehensive documentation for the design system, including guidelines, best practices, and usage instructions, to facilitate its adoption and utilisation by design and development teams\n\nComponent Library Management: Oversee the development and maintenance of a component library within the design system, ensuring that it reflects the latest design standards and trendsDiscover the requirements:Minimum of 5 years of experience in design, with a focus on design systems and component libraries\n\nTeam management experience\n\nProven expertise in developing and maintaining design systems for digital products.\n\nStrong skills in design tools and software relevant to design systems, such as Figma\n\nExperienced working with micro-interactions and interaction design\n\nExperience within financial services / fintech is preferred\n\nUnderstanding the engineering behind building components, facilitating integration and collaboration between design and development teamsThis is an office-based opportunity, in Dubai offering visa, healthcare sponsorship and a competitve overall package.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}