{
    "Job ID": "69873606",
    "Description": "At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you. With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.About Digital TechnologyWe’re not yesterday’s IT department, we're Digital Technology. The world around us keeps changing and so do we. We’re redefining what it means to be IT with a mindset centered on transformation, experience, AI-driven automation, innovation, and growth. We’re all about delivering delightful, secure customer and employee experiences that accelerate ServiceNow’s journey to become the defining enterprise software company of the 21st century. And we love co-creating, using, and highlighting our own products to do it.Ultimately, we strive to make the world work better for our employees and customers—when you work in ServiceNow Digital Technology, you work for them.What our team values:Being humble and having each others’ backs\n\nLearning new things and sharing expertise with each other—by answering a quick\n\nquestion on teams, pairing on a feature, or leading a lunch and learn session\n\nProducing high quality work we’re proud of, and not taking shortcuts\n\nHaving fun—we like to joke around, eat lunch together, and even hang outside of work\n\nLeaving work at work, maintaining a sustainable pace (no big bangs, few big pushes)You will play a major part in building AI and Machine Learning (ML) solutions that transform the user experience and workflow efficiency of enterprise services. Traditional analytical tools tend to require a technically knowledgeable user to produce even simple results. We are taking a completely fresh approach with the expectation that any user, regardless of technical knowledge, can use the AI/ML solutions we develop to operate the services in the enterprise setting in a thoughtful and scalable manner. We are just getting started with our early-adopter customers and we need your help in building and making available an amazing range of solutions to our 5k+ enterprise customers around the world.Build the best cloud-based AI/ML solutions to power intelligent enterprise services\nCollaborate daily with a team of like-minded developers, product managers and quality engineers to produce quality software\nWork with product owners to understand detailed requirements and own your code from design, implementation, testing and delivery of high-quality solutions to our usersTo be successful in this role you have:5+ years of related experience with a Bachelor's degree; or 3 years and a Master's degree; or a PhD without experience; or equivalent work experience\nExpertise in Java or Python, OOP, Design Patterns, time and space-efficient algorithms\nExperience building new products that use challenging algorithms\nExpertise in coding efficient, object-oriented, modularized and quality software\nKnowledge of core AI/ML techniques and algorithms\nKnowledge of unit testing, profiling, and code tuningFD21ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.At ServiceNow, we lead with flexibility and trust in our distributed world of work. Click here to learn about our work personas: flexible, remote and required-in-office.If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at [email protected] for assistance.For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.Please Note: Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}