{"Job ID": "69873211", "Description": "Chef de PartieFull timeFour Seasons Resort Dubai at Jumeirah BeachThe Four Seasons Resort Dubai at Jumeriah Beach with its unparalleled location, fresh approach to luxury and legendary personalized service, has exceeded the high expectations in the ultra- competitive Dubai market. At Four Seasons we believe that our most important asset is our team of employees. The Four Seasons has a tremendous commitment to the development and training of all employees. We ensure that the best packages and finest management structure are in place to guarantee a stable environment in which development is second nature for our employees. Successful Four Seasons candidates will be offered once- in-a- lifetime opportunity rich in personal and professional growth.Four Seasons Dubai at Jumeirah Beach includes five outlets options - from the beachfront Sea Fu restaurant to the rooftop Mercury Lounge, and it includes 237 Dubai luxury hotel rooms – including 49 suites – subtle Arabic design motifs blend with cool, contemporary style, featuring soft backgrounds of blue or green. Dubai is the second largest of the seven Emirates that make up the United Arab Emirates, Dubai is located on the southern shore of the Arabian Gulf. Has a Sub- tropical, arid climate.Join our TeamWork on a team that is built on mutual respect, collaboration, excellent service.Four Seasons provides employees with the same level of care that we expect to be shared with our guests.Four Seasons have been ranked in FORTUNE Magazine's 100 best companies to work for since 1998.ResponsibilitiesParticipates in the preparation of food items according to guest orders of consistent quality following recipe cards, as well as production, portion, and presentation standards; set-up station for breakfast, lunch, and/or dinner service.\n\nStart food items that are prepared ahead of time, making sure not prepare beyond estimated needs.\n\nTrain, motivate, recommend discipline, and supervise the work of kitchen employees ensuring that all cultural and core standards are met.\n\nOperate, maintain and properly clean kitchen equipment, including deep fryer, broiler, stove, steamer, food processor, mixer, slicer, oven, steam table, tilt kettle, waffle iron, and flat top grill.Preferred Qualifications and SkillsHigh school education, cooking school or culinary institute education or equivalent experience.\n\nMinimum two years culinary or related work experience.\n\nCold kitchen with sushi/sashimi experience is must.What to Expect: You Will....Be part of a cohesive team with opportunities to build a successful career with global potential.\n\nHave the opportunity to engage in diverse and challenging work.\n\nBe recognized for excellence.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}