{"Job ID": "69875667", "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The Opportunity:Service manager (Role) would the primary point of contact for the customer(s) for deals which are sold through reseller channel where SM should be able to help escalate internally with product support & engineering, drive the resolution of issues reported in timely and professionally manner by following mutually agreed process and should be able be answer customer questions related to product offering, feature and new release and seek opportunities for cross selling the product or services.Also can ensure that Customer voice is heard and understood and help improve on customer satisfaction. You are great at:Should be able to define process diagrams, detailed procedures, other service offering related Artifacts and measurement matrices for analysis and should be able to plan a course correction.\nReview Contract documents, build book and flag nonstandard items\nCreate & maintain a repository of customer specific KPI’s , Requirements , Customer contacts, environment details etc.\nEnsure Ticketing tool setup with correct details for each customer\nPrepare Kickoff agenda, setup monthly service reviews, review and agree reporting templates.\nDiscuss and Validate Post Go-Live Migration requirements and open issues with customer.What it takes:Prepare & present service engagement model to customer(s)\nCollaborate on go-lives\nMonitoring of Mailbox and responding to the customer as and when required.\nUpgrade Activity, follow-up, and tracking\nManage service escalations professionally by reaching out to product support & engineering and ensure issues resolution are moving forward in right directions.\nShould be able to provide status report to various customer on agreed frequency\nRecord and analyze deviation in availability report and provide justifications\nAssessment, recording software configuration for each customer\nEnsuring Overages are invoices\nWillingness to work in shift (preferably NA shift hours)OpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}