{
    "Job ID": "69874509",
    "Description": "We help the world see new possibilities and inspire change for better tomorrows. Our analytic solutions bridge content, data, and analytics to help business, people, and society become stronger, more resilient, and sustainable.As a member of our Climate and Resilience team, you will work collaboratively to help deliver a range of projects for global corporate and financial sector clients. Depending on the skills and experience of the successful candidate, this is likely to include:Work on larger-scale GIS datasets for external clients\nAnalyze, validate, and present results using spreadsheets, charts, and maps\nAutomate GIS procedures and develop new and innovative ways for geoprocessing team workflows in Python\nWork as member of multi-faceted research team and assist team members in ensuring best GIS practices\nCreate technical documents for internal use and distribution to clients\nDevelop and update process documentation for technical workflowsEducational Qualifications: PHD, M Tech or M.Sc. (in Geo-Informatics/Geography/Remote Sensing & GIS) or Spatial Technologies.\nTotal Experience: 3 - 5 years\nFluent in ArcGISPro and QGIS\nStrong working knowledge of Python and ARCPy\nDemonstrable experience of ArcGIS Enterprise, Open-Source GIS (GDAL, SAGA, GeoDa, etc.), R, SQL Server, Matlab\nMust have working knowledge in ArcGIS Extensions: Spatial Analyst, 3D Analyst, Image Analyst, and Network Analyst\nDemonstrable working experience of database management and database versioning within ESRI environments\nStrong geo-analytics and geoprocessing skills with emphasis on raster format\nAbility to work flexibly, to tight deadlines, while managing your own scheduleNice-To-Have:Educational background in Geography/Environmental Science or similar\nStrong understanding of climate change and/or security risks and opportunities for organisations and how those interact with social, economic, and political factors\nAbility to communicate technical process and data outputs to non-technical audiences\nGeo-statistical techniques and data mining\nGood mathematical and statistical background.#LI-DR1In 2022, Verisk received Great Place to Work® Certification for our outstanding workplace culture for the sixth year in a row and second-time certification in the UK, Spain, and India. We’re also one of the 38 companies on the UK’s Best Workplaces™ list and one of 18 companies on Spain’s Best Workplaces™ list.For over fifty years and through innovation, interpretation, and professional insight, Verisk has replaced uncertainty with precision to unlock opportunities that deliver significant and demonstrable impact. From our historic roots in risk assessment, we’ve grown to provide analytic insights that help transform industries focused on some of the world’s most critical areas. Today, the insurance industry relies on Verisk to be, and to make the world, more productive, resilient, and sustainable.Verisk works in collaboration with our customers and at the intersection of people, data, and advanced technologies. Through proprietary platformed analytics, advanced modeling, and interpretation, we deliver immediate and sustained value to our customers and through them, to the individuals and societies they serve, with greater speed, precision, and scale. We’re 9,000 people strong, committed to translating big data into big ideas. We help others see new possibilities and empower certainty into big decisions that impact individuals and societies. And we relentlessly and ethically pursue innovation to help move our customers, and the world, toward better tomorrows.\n\nEveryone at Verisk—from our chief executive officer to our newest employee—is guided by The Verisk Way, to Be Remarkable, Add Value, and Innovate.\n• Be Remarkable by doing something better each day in service to our customers and each other\n• Add Value by delivering immediate and sustained results that drive positive outcomes\n• Innovate by redefining what’s possible, embracing challenges, and pushing boundariesVerisk BusinessesUnderwriting Solutions — provides underwriting and rating solutions for auto and property, general liability, and excess and surplus to assess and price risk with speed and precisionClaims Solutions — supports end-to-end claims handling with analytic and automation tools that streamline workflow, improve claims management, and support better customer experiencesProperty Estimating Solutions — offers property estimation software and tools for professionals in estimating all phases of building and repair to make day-to-day workflows the most efficientExtreme Event Solutions — provides risk modeling solutions to help individuals, businesses, and society become more resilient to extreme events.Specialty Business Solutions — provides an integrated suite of software for full end-to-end management of insurance and reinsurance business, helping companies manage their businesses through efficiency, flexibility, and data governanceMarketing Solutions — delivers data and insights to improve the reach, timing, relevance, and compliance of every consumer engagementLife Insurance Solutions – offers end-to-end, data insight-driven core capabilities for carriers, distribution, and direct customers across the entire policy lifecycle of life and annuities for both individual and group.Verisk Maplecroft — provides intelligence on sustainability, resilience, and ESG, helping people, business, and societies become strongerVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}