{
    "Job ID": "69875823",
    "Description": "Job SummaryMain focus of the role will be to work closely with the various business units and customers to bring the needs of the customer to market in commercially viable product solutions.\nThe role should identify key customers within their areas and propose plan to introduce new products and increase size of business with them. Increase the distribution coverage by opening new accounts and evaluating their potential.\nIs responsible for the active listing of new SKU's which the individual will educate both the customer and the team (If there is a team) on, so we ensure product retention.\nFor this the role will require the ability to focus on communicating features and benefits of our entire product range. Building relationship with customers, so we are the first choice for solving customer issues or helping them bring new products to their customers.\nExploring feedback from the team and direct from customers and then producing new recommendations on what the ongoing needs of the customers are. If these can be made in to commercially viable projects, these are then driven through PMR process and S&OP process.                                    Customer Strategy and Business Plan\nExecutes the Channel / customer business plan for his/her area.\nBuild and maintain business relationship with customer’s decision makers.\nEnsure customer needs are clearly communicated to business units and internal stakeholders.\nWorking in closely with development teams to introduce new products / new applications with customers\nGuides and leads team of sales representative to open new customers\nSupport wider team with customer support on complaints and technical issues\nEnsuring the team's understand features and benefits of our entire product range, so product retention is high\nAdvisory role to highlight key benefits of our products and how they deliver on the needs of the customer and in so doing, add value. Help higher management work on overcoming objections for benefiting future negotiation strategy.IFFCO brand awareness and market data gathering and segmentation\n# of New Customers\nRevenue budget as allocated5 to 7 years’ experience in similar role in the assigned market.\n5 years experience in FMCG technical Sales in ingredient's business will be idealBachelor degree in business or management related field.\nMBA degree in business or management related field.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}