{"Job ID": "69873515", "Description": "IntroductionYour Role and ResponsibilitiesDescription of SkillsSecurity Domain SkillsThis position requires knowledge across multiple platforms, processes or architectures. This position requires eGRC consulting skills and the ability to act as a trusted client advisor and a trusted technical lead for the team. The eGRC Consultant will need to have skills to be able to work with other IBM teams and:\n• Deliver GRC automation projects on eGRC platforms\n• A proven record of security thought leadership and be recognized for business and technical acumen for eGRC automation\n• Knowledge of eGRC solution (ServiceNow, Archer, etc.) architecture and design\n• Expertise in eGRC tools (ServiceNow, Archer, etc.) and out of the box solutionsCore consulting skills\n• Strong analytical and problem solving skills\n• Strong communication and presentation skills\n• The ability to lead large groups and be a primary facilitator and lead.\n• Strong written skills\n• Comfortable working in a project based / client serving model\n• Ability to lead and shape client expectations\n• Help drive pursuits and engage in complex deals, matching outcomes to expectations\n• Ability to work easily with diverse and dynamic teams\n• Ability to work in a matrix management model\n• Self-motivated, positive attitude, and a team player\n• Ability to work independently and with minimal supervision\n\nRequired Technical and Professional Expertise\n• At least 5 years of experience delivering GRC automation projects on eGRC platforms\n• eGRC consulting experience across multiple client verticals, including Financial Services, Public Sector, Technology, Telecommunications, Manufacturing, Industrial & Mining etc.\n• Experience managing projects in various SLDC stages including Analysis, Design, Development, Enhancement, Testing, Migration, Documentation and Implementation of applications FOR eGRC platforms such as ServiceNow, etc.\n• Good experience in eGRC platform out-of-the-box/Custom solution implementations.\n• Experienced in creating fields, reports, iView’s and dashboards, configuring access control, record permissions, events and notifications in eGRC tools.\n• Experience in creating UAT and SIT test scripts which is used for testing the applications by the client.\n• Experience in configuring Data Feed Manager to import data from external source.\n• Having good experience in content mapping in eGRC solution, also involved in content mapping from industry best standards to eGRC solution.\n• Experience in understanding clients business environment and proposing fit for Purpose rGRC solution\n• Knowledge and implementation/ consulting experience in managing GRC projects\n• Knowledge on coding and scripting, web API Integration will be added advantage.\n• Ensure quality delivery as per IBM/client requirements.\n• Work in a team and guide less experienced members in the team\n• Readiness to travel\n• English: Fluent\n\nPreferred Technical and Professional Expertise\n• +5 years in GRC Cybersecurity and related experience\n• +3 years’ experience delivering GRC automation projects on eGRC platforms\n• Bachelor’s degree or master’s degree in technology or Cybersecurity\n• Experience working with offshore teams\n• Certified in CISSP, CISA or CISM preferred\n• Strong understanding of Information Technology, IT Security and CybersecurityJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Riyadh, Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}