{
    "Job ID": "69875876",
    "Description": "Robert Bosch Engineering and Business Solutions Private Limited is a 100% owned subsidiary of Robert Bosch GmbH,\none of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions.\nWith over 25,000 associates, it’s the largest software development centre of Bosch, outside Germany, indicating that it is the\nTechnology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Modern vehicles have a diagnostic interface for off-board diagnostics, which makes it possible to connect a computer (client) or diagnostics tool, which is referred to as tester, to the bus system of the vehicle. Thus, the messages defined in UDS can be sent to the controllers which must provide the predetermined UDS services. This makes it possible to interrogate the fault memory of the individual control units in the vehicle or to update them with a new firmware.Diagnostics Communication Protocol Module developer role deals with SW development which fits the context mentioned above along with detailed SW development activities mentioned below.•Analyze customer requirements or spec proposal\n•Software design and implementation for customer project specification\n•Interface between customer project, Platform and SW development group\n•Integration, test and delivery of UDS [Unified Diagnostic Services] based CAN network communication related software project development along with planning, coordination and release for series production\n•Follow company development and quality processes\n•Investigate for the issues or problem during the project development and after production.\n•Department task support / coordinationSkill Set:•Software designing experience in similar area of automobile industry/institute\n•CAN & UDS communication skill\n•Knowledge about ISO14229, 14230 and UDS standard network protocols\n•C design experience\n•Electronic circuit knowledge\n•Good documentation/report ability\n•Good in MS Office software.Autosar knowledge.C, C++ knowladge• B.Tech., / M.Tech., degree in Electronics & Communication, Electrical, Mechatronics Engineering.At least 5~10year experience in Embedded software developmentJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}