{
    "Job ID": "69870033",
    "Description": "Job Description and QualificationsDesigner - Instrumentation\nJob Description Summary\nInstrumentation DesignerI. POSITION SUMMARYTo deliver safe, fit for purpose instrument designs to an agreed schedule to meet a pre agreed budget.II,  NATURE AND SCOPEThe job holder is one of the key members of the design team having responsibility for the instrumentation design. Based on the execution strategy the job holder will be responsible for performing instrumentation design on projects.III. DIMENSIONS:Responsible for delivery of instrumentation design for AP projects.\nResponsible for producing all instrumentation design deliverables on a project.\nAn instrument engineer / designer as the lead for instrument design on the project and as the technical interface with AP project execution teams. Providing support to other AP engineering centers as workload requires.IV. PRINCIPAL ACCOUNTABILITIESCompliance with company or project standards and specifications.\nGenerate deliverables such as Instrument Index, Instrument Location Layouts, Cable Schedules, Wiring Diagrams/ Schematics, Analyzer Panel Design, Instrument Hook-Ups, Instrument Power Distribution, Material Take Offs / Bill of Quantities, Control Room and Analyzer Room Layouts, Cable Routing Layouts\n3D modelling of equipment using SP3D / PDS.\nAttend model reviews\nSupport development of instrument design strategies.\nEffectively communicate by email, ppt or ‘face to face’ AP’s execution strategies, schedule issues and project requirements.\nDevelop common work practices within engineering organization.\nReview/ interpret vendor documents.\nInterface with other disciplines to overcome design issues\nImplementation of quality procedures and contribute to continuous implementation of improvement activities.V.  MINIMUM REQUIREMENTS AND QUALIFICATIONSAn Engineering Degree or a Diploma in Instrumentation and work experience of around 15 years’.\nExcellent written and spoken English and strong communication skills\nExperience comparable with the grade in a relevant industry.\nMust be familiar with an engineering organization, the function of each discipline and how they interact and the function of the various support groups globally.\nExperience to generate all instrumentation design deliverables like wiring diagrams, cable schedules, Hook up drawings, MTOs, layouts, 3D modelling etc.\nExperience of preparing control room and analyzer room layouts.\nExperience working with tools such as SPI, SP3D or PDS.\nMust be able to be interface and work with other disciplines for the finalization of cable layouts and other instrument design deliverables.\nExperience / Exposure of using global engineering standards\nKnowledge and experience of plant layouts and model review meetings\nExperience and knowledge to effectively communicate issues and ideas effectivelyJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}