{
    "Job ID": "69874337",
    "Description": "DescriptionJob Description & SummaryThe Transaction Diligence team aims to assist clients, both private equity firms and corporate clients, throughout the whole transaction process. Transaction Services supports corporate clients, private businesses, private equity firms and investment funds through mergers, acquisitions and disposals. As a Senior Associate you'll work on transactions with a diverse range of clients. It's an opportunity to build deals experience, including analysis of financial and non-financial business information, as well as wider deals execution know-how. In particular you’ll get to grips with the processes of financial due diligence, including the identification of value drivers and detailed financial analysis. You’ll also develop skills in writing issued-focused due diligence reports for our corporate and private equity clients.What to consider before applyingThis role requires the candidate to be based out of our United Arab Emirates office (Abu Dhabi).Role Responsibilities:Participate in financial due diligence assignments in the context of buy- and sell-side M&A transactions, servicing both corporate and private equity clients.\nAdd value to the targeted transaction by transforming key findings into price adjustments and proposed warranties;\nAnalyze and present financial information (i.e. Income, Balance sheet and Cash flow statements), as well as underlying key performance drivers.\nAssess key valuation metrics used to bridge Enterprise and Equity value by analyzing underlying EBITDA, working capital requirements and net (financial) debt.\nProvide insight on other (non-) financial risks and opportunities specific to the business and relevant to consider in a transaction context.\nConducting M&A and IPO engagements\nReviewing financial information of the client/ target\nAdding or forming financial, commercial, and business views to help the target, client and investors in their decision makingSkills & Requirements:You have a Bachelor’s degree preferably from an reputable/ international university and at least 3 years experience in a relevant domain (Financial Due Diligence, Financial Analysis, Financial Audit, …) with relevant experience in transaction services related domain considered a plus;\nYou have excellent English speaking and writing skills. Arabic is preferable.\nStrong numeracy and analytical skills with a keen eye for detailWhy you’ll love PwCWe’re inspiring and empowering our people to change the world. Powered by the latest technology, you’ll be a part of amazing teams helping public and private clients build trust and deliver sustained outcomes. This meaningful work, and our continuous development environment, will take your career to the next level. We reward your impact, and support your wellbeing, through a competitive compensation package, inclusive benefits and flexibility programs that will help you thrive in work and life. Learn more about us at https://www.pwc.com/m1/en/about-us/life-at-pwc.htmlThe most connected firm through activity based workingWith connectivity being a key enabler of our strategy, our objective is to become the most connected firm - connected to our clients, our communities and to each other. PwC follows an Activity Based Work model, where our PwC professionals engage in a diverse range of meaningful activities from our offices, from client sites, or our homes.Travel RequirementsUp to 20%Available for Work Visa Sponsorship?YesGovernment Clearance Required?NoFor further information, and to apply, please visit our website via the “Apply” button below.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}