{"Job ID": "69873836", "Description": "Who are we and What do we do?&nbsp;InMobi Group’s mission is to power intelligent, mobile-first experiences for enterprises and consumers. Its businesses across advertising, marketing, data and content platforms are shaping consumer experience in a world of connected devices. InMobi Group has been recognized on both the 2018 and 2019 CNBC Disruptor 50 list and as one of Fast Company’s 2018 World’s Most Innovative Companies.&nbsp;&nbsp;What’s the InMobi family like? &nbsp;Consistently featured among the “Great Places to Work” in India since 2017, our culture is our true north, enabling us to think big, solve complex challenges and grow with new opportunities. InMobians are passionate and driven, creative and fun loving, take ownership and are results focused. We invite you to free yourself, dream big and chase your passion.&nbsp;&nbsp;What do we promise?&nbsp;We offer an opportunity to have an immediate impact on the company and our products. The work that you shall do will be mission critical for InMobi and will be critical for optimizing tech operations, working with highly capable and ambitious peer groups. At InMobi, you get food for your body, soul, and mind with daily meals, gym, and yoga classes, cutting-edge training and tools, cocktails at drink cart Thursdays and fun at work on Funky Fridays. We even promise to let you bring your kids and pets to work.&nbsp;&nbsp;What will you be doing?  &nbsp;Microsoft and InMobi have entered into partnership. As per which, InMobi will be exclusive partner for Microsoft’s search inventory. Microsoft Search Advertising empowers the largest advertisers around the world to reach their maximum potential through paid search engine marketing on the Microsoft Bing Ads platform. InMobi will be responsible for complete management / transaction across Bing. &nbsp;We are seeking individuals who have attention to detail, customer obsession and passion to learn and adapt in an evolving environment. You will create impact across the organization (Data, Systems, Process and People), that has implications on day-to-day business and long-term organizational strategies for scaling the business. You will work alongside a team with great aptitude and business context and will be responsible for helping optimize the operating procedures within the org.&nbsp;&nbsp;What is expected out of you?&nbsp;Assist in defining and enforcing sales process across multiple sales, Account Management teams and regions&nbsp;\nBuild and maintain reporting in Salesforce to drive data-based decision making throughout the GTM organization&nbsp;\nLead and streamline the ticketing process across teams and regions&nbsp;&nbsp;\nPartner with finance, sales, marketing, and operations teams to gain alignment on process requirements and change management&nbsp;Evaluate and collect feedback from the sales and marketing team to identify end-to-end challenges and/or solutions and remove bottlenecks&nbsp;\nMake recommendations to optimize our tech stack, identify gaps and redundancies, and propose scalable solutions to meet current and future business needs&nbsp;\nEnsure sales and marketing teams are following workflows and provide actionable feedback&nbsp;\nPrior working experience driving measurable insights and implementing scalable systems and processes, particularly leveraging Salesforce.com, within a B2B software environment&nbsp;\nGood working knowledge of MS Excel and Advanced Excel functions.&nbsp;Excellent Stakeholder Management skills and proven work record of aiding decision makers on real-time basis.&nbsp;&nbsp;&nbsp;Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}