{
    "Job ID": "69873456",
    "Description": "Job Description\n4^4 The number of projects that you would lead or support across multiple therapeutic areas.\nWe are looking for an experienced professional with robust programming competencies (SAS, SQL, Python, R, etc.) & strong communication skills for our Clinical Database Development Reporting & Analytics function. As a member of this function, you would be primarily responsible for seamless end to end data flow of Clinical & Operational Data from Data Collection, Transformation, Reporting & Analytics & provisioning of data to downstream applications & teams.\nYour responsibilities include, but are not limited to:\n•Drive the implementation of data analytics reports and dashboards for optimal data review by working with the users to establish robust user specifications and with programmers to implement the optimal output. Translate business requirements into logical models and provide direction to the development team to translate business logic.\n•Lead authoring of the user requirements document, functional specifications and functional testing scripts. Proactively identify or address needs for optimal data review working with users and programmers as appropriate .Implement and execute robust project plans for delivery, ensuring customer needs are addressed in a timely manner.\n•Provide coordination between the project resources so that deadlines are met on deliverables.\nDrive development of appropriate user training. Drive all necessary change management activities related to implementation of new data review tools / reports as related to data cleaning, review and visualization.\n•Provide understandable and actionable reports on clinical data and monitoring of clinical data for key stakeholders. Provide quantitative analytical support to the global program teams, including providing support on analyzing reports and defining KPI Metrics.\n•Systematically sample / monitor utilization of reports and tools, perform and coordinate periodic review of outputs. Report findings and take necessary steps to ensure reports are being used for optimal data review via Metrics. Create, file and maintain appropriate documentation.\n•Work with the internal SMEs and key stakeholders in providing analysis and interpretation of clinical program/trial operational data. Lead initiatives within Analytics, including training, to support overall compliance and adherence to data review through robust reports and tools.Proactively identify and address areas of concerns to avoid issues and ensure consistency, accuracy and completeness of reported clinical data.\n•Support or lead special projects of limited scope (sub team lead, local project, etc.) both clinical and non-clinical in nature. Provide study level expertise and involvement in CTTs and on GPTs for small projects. May assist manager in coordinating and directing Clinical Reporting activities of External Partners (Contingent Workers, Functional Service Providers, Interns, etc.)\n•Program reports of advanced complexity from documented requirements, within the clinical reporting systems using SQL, PL/SQL, C#, VB script, SAS, Python, R. Demonstrated experience in the concepts and use of Clinical Data Standards (e.g. SDTM, Novartis standard) for creation of report specifications or reports output. Lead special projects both clinical and non-clinical in nature or in general areas spanning various responsibilities but not limited to systems issues, processes, user support, training, etc.\nDiversity & Inclusion / EEO\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum Requirements\nWhat You’ll bring to the role:\n• At least 7-9 years’ experience in clinical review and reporting programming, business analytics and/or clinical trial setup, gained in the pharmaceutical industry, CRO or Life Science related industry.\n•Strong knowledge of programming languages (SQL, PL/SQL, C#, VB script, SAS, Python, R). Strong knowledge of Data Review and/or Business Intelligence tools (such as Spotfire, JReview)\n•Knowledge of clinical data management systems and/or relational databases (e.g. OC/RDC, INFORM, RAVE) as applied to clinical trials. Attention to detail, quality, time management and customer focus.\n•Ability to translate technical concepts for non-technical users in the areas of clinical database design and data review reporting development. Strong verbal and written communication skills to work with our global partners and customers.\n•Understanding of Drug Development Process, ICH-GCP and Health Authority guidelines and regulations.\n•Good CDISC understanding: implementation of CDISC Standards.\n•Ability to train and supervise new or less experienced associates\nWhy Novartis?\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\nImagine what you could do here at Novartis!\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/networkJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}