{"Job ID": "69873775", "Description": "Department – Quality Audits GBSAre you passionate about quality and simplification? Do you want to build quality within processes in the most efficient way? Do you have an innovative mindset to drive change in a future-ready environment and support your colleagues and stakeholders by challenging the status-quo in a friendly and open-minded way? If so, there is a unique job opportunity waiting for you as our new Lead Auditor for GCP. At Novo Nordisk, we will challenge you to do the best work of your life. Apply now and join a growing team, working in an international environment.About the departmentNovo Nordisk Quality GBS was established in May 2015. We are responsible for supporting and development of overall quality services, such as training coordination, content control, digital solutions, quality and compliance management and records management for various units within Novo Nordisk. Here, you will be a part of an ambitious, dynamic, and global team ensuring high quality as well as fit-for-purpose processes for the entire value chain from research to market. We make quality easy, simple, and understandable.PositionAs a Lead GCP Auditor you will be working in the domain of GCP..  You will conduct audits to provide assurance of Patient Safety, Product Quality and Compliance to the organisation.  You are entrusted to fulfil the following responsibilities:Have great impact on the quality of the clinical trial work sponsored by Novo Nordisk.\nConduct on-site and remote audits globally (expect ~ 60 travel days annually)\nWork in a dynamic area where changes to the audit schedule require high flexibility.\nWork both independently and in smaller teams.\nInteract with external and internal global stakeholders at all organisational levels.QualificationsBachelor’s or Master’s in the science/pharmacy/clinical trials\nMinimum 10-12 years of relevant work experience.\nExperience from working with GCP eg. from a role as GCP inspector, CRA or other role within clinical drug development.\nKnowledge of the pharmaceutical industry (GxP) is a must.\nThorough understanding of relevant regulatory requirements.\nExcellent communication skills – written and verbal.\nThe ability to create rapport with stakeholders by being curios for both understanding the “why” behind a decision and being able to explain the “why” behind an audit observation.\nAn understanding of the ethical standards within the pharmaceutical industry and insights into your own personal code of ethics which is guiding your behaviour.\nCommitment to ensure safety of trial subjects and data integrity for the purpose of development of new treatments.\nAn open-minded and pragmatic approach to that compliance can be obtained by different solutions to similar challenges.\nThe ability to know when to fight for a case despite resistance among stakeholders.\nAn ability to viewing challenges with an analytical and pragmatic mind-set.\nA positive attitude towards cultural differences and an interest in gaining knowledge of different cultural practices to strengthen intercultural communication and interaction.\nEnjoying working with many daily contacts with different stakeholders globally, and from working in a dynamic environment with changing priorities.Working in Novo NordiskWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.ContactApply Now!Deadline29th September 2023.We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}