{"Job ID": "69872783", "Description": "JOB PURPOSETo work as a Team Member to maintain a high standard of cleanliness in the Guestroom and in the public areas assigned.\nHandling request of the external and internal customer in a professional manner.\nTo service the guest rooms which are either occupied, check out and to carry out turn down service of the rooms in accordance with the LRA standards.\nTo make zero defect rooms.\nEXECUTIVE RESPONSIBILITIES & EMPOWERMENT\nResponsible for maintaining designated area clean and defect free as per LRA standards.\nEmpowered to give personalized service, assist guests, interact with guests and create WOW moments for the guests.\nKEY OPERATIONAL RESPONSIBILITIESFinancial- Optimize the use of chemicals, equipments and supplies to save cost.\nMaintains the par stock required at the pantry.\nHelping supervisor to make store requisition.Operational-Clean rooms as per the company standards and LRA standards ensuring a defect free room.\nEquipping all rooms with linen and amenities.\nShould be helpful and courteous to guests at all times.\nShould handover important messages and guest requests to the supervisors.\nReport any missing or broken property to the supervisor.\nReports all lost and found items. \nmaintains hygiene standards by building awareness of cleaning facts and chemicals used.\nMaintains high levels of personal hygiene.\nFollows periodical cleaning schedules.\nKnowledge of the proper utilization of the housekeeping attendant’s trolley.\nEnsure that the trolley is kept clean tidy and well equipped in the proper position.\nBe familiar with the deep room cleaning procedure\nStand in coordination for single point entry\nAware of the guest complaint handling procedure\nEnsures that the floor pantry, corridors, fire exits are maintenance free\nEnsures the upkeep of all the equipment\nFollows up on any assignments handed over by the supervisor\nPerforms any other duty assigned by the supervisor\nAbide by companie’s policy and decision\nTo fill the Associates Daily Assignment Sheet with all the required information after completion of a guest room\nAbides by the key handling procedures\nAbides by the Lost and Found procedures\nFollows all safety and security measures\nSafeguard and protect Hotel Property\nTo help floor supervisor in carrying out Inventory of Linen and guest amenities\nTo carry out start and end of the shift duties:Keeping the guest corridor area clean.\nKeeping the service landing, walls, elevators and surrounding area clean.\nKeeping the pantry clean and neat.\nReplenish the trolley before and after completing the shift.                       \nTo clean the vacuum, minibar glasses, cups and other equipment used.\nTo report any maintenance issues in the guestroom and at the public areas.Business plan /AnalysisHelping the supervisor in analyzing all guest complaints and feedbacks.\nShould be aware of occupancy status as per business plan.\nShould be aware of departmental financials.General DutyMaintain good working relations with fellow colleagues and respect supervisors and management.\nProvide other duties and services as assigned by the housekeeping manager.\nShows quick response in handling of emergency situations.\nTo have complete knowledge of facilities available in-house.\nMust be thorough on fire and safety procedures.\nAdheres to hygiene standards.\nFollows environmental issues.\nEnsures that personal grooming is adhered as per standards.\nBedroom and bathroom cleaning procedure.\nBasic cleaning techniques to use:\nHow to vacuum?\nRecognizing various types of soil on various surfaces and chemical application.\nCarpet, drapery and upholstery care.\nFloor care.\nMarble restorationJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}