{
    "Job ID": "69873555",
    "Description": "Principal engineer - Chennai/ PuneREF24784PThe #NielsenIQ technology teams are working on building a unified, global, open data ecosystem powered by Microsoft Azure. Our clients around the world rely on #NielsenIQ data and insights to innovate and grow. We are looking for an experienced Oracle PL/SQL expert to be part of our Technology hub in India to build, maintain and transform our factory systems, that are critical to the business. Responsibilities Design & develop solutions using Oracle PL/SQL as an individual contributor \nOwn end-to-end solution design for several application components \nProvide epic-level estimates and drive delivery to meet expectations \nWrite complex, maintainable code to develop scalable data processing engine \nProvide solutions to improve process quality, understand emerging technologies, standards and best practices in cross platform development \nDemonstrate mastery in applying concepts, and methodologies to innovative solutions \nCan work autonomously, and solve complex challenges, applying mastery and demonstrating expertise in their domain \nContinuously discover, evaluate, and implement new technologies and frameworks to maximize efficiency \nAct as tech mentor for the team 12+ years of experience in Oracle PL/SQL and advanced SQL programming \nExpertise leveraging collections, data partitioning, query tuning/ performance tuning \nHigh proficiency in a technology stream and can quickly adapt/upskill to new technologies \nProven track record in designing solutions to solve business problems \nGood experience working with large data sets with hands-on technology skills to design and build robust data processing engine using industry standard frameworks \nHands-on configuration management, monitoring, performance tuning of database operations \nAbility to foster an environment of innovation, experimentation and inclusion in solving problems, seeking and embracing diversity of thought \nAbility to successfully build relationships with stakeholders and navigate complex social environments \nBuild relationships with other teams and lead component integration & E2E validation \nExperience working on Java and cloud platforms would be a bonus \nEngineering degree in Computer Science, Information Technology or related field Enjoy a flexible and rewarding work environment with peer-to-peer recognition platforms. \nRecharge and revitalize with help of wellness plans made for you and your family. \nPlan your future with financial wellness tools. \nStay relevant and upskill yourself with career development opportunities. About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}