{
    "Job ID": "69873798",
    "Description": "About the Hotel:Jumeirah Group, a member of Dubai Holding, has been making a distinguished impact on the global hospitality market for more than two decades with its Stay Different™ brand promise. its award-winning destinations, such as the iconic Burj Al Arab Jumeirah, position service beyond expectations, elevated dining destinations and surprising architecture and design at the heart of every guest experience.Today, Jumeirah operates a world-class portfolio of 23 properties across the Middle East, Europe and Asia and employs over 8,000 colleagues, representing over 106 nationalities. As Jumeirah continues to expand its global portfolio and scales up its operations to the next level of growth, it remains fully committed to developing and empowering our colleagues to excel in world class environments.Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity.Jumeirah Living World Trade Centre Residence is a 41-floor luxury serviced apartment tower in the canter of Dubai’s business district. Standing on the site of the old-World Trade Centre on Zabeel Road, the striking high-rise comprises 377 serviced residences ranging from one-bedroom duplexes up to four-bedroom double-floor apartments. One of Dubai’s most acclaimed luxuries serviced residences, Jumeirah Living World Trade Centre Residence is the place of first choice for travelers in search of short, medium-term and extended stays that combine home comforts with all the hallmarks of a five-star hotel service. About The Job:An opportunity has arisen for a Waitress to join The Club Service Department in Jumeirah Living WTCR. The main duties and responsibilities of this role:Main Duties:• Identify customer needs and expectations correctly, including those with special needs, and provide appropriate products, services or information.\n• Meet all reasonable needs and requests of customers within acceptable enterprise time frames.\n• Identify and take all opportunities to enhance the quality of service.\n• Recognize customer dissatisfaction promptly and take action to resolve the situation according to individual level of responsibility and customer feedback/ complaint procedures.\n• Offer assistance to colleagues when required, to ensure designated work goals are met.\n• Demonstrate trust, support and respect towards team members in day-to-day work activities.\n• Conduct communication with customers and colleagues in a polite, professional and friendly manner.\n• Practice high standards of personal presentation in accordance with Jumeirah Grooming & Presentation Standards\n• Seek assistance from other team members, supervisors and managers when required.\n• Prepare and set tables according to F&B SOPs and as per meal period requirements and reservations.\n• Provide a link between kitchen/bar and service areas, maintaining an open line of communication with F&B Production colleagues.\n• Serve & clear food and drinks within required timeframes.\n• Provide table service of alcoholic beverages.\n• Ensure service stations are constantly cleared & re-stocked during service.\n• Maintain good knowledge of menu to answer questions the guests may have.\n• Knowledgeable of all in-house services as well as local information and be able to assist guests when questioned.\n• Has a working knowledge of the Outlet room layout, table numbers, stations and colleagues working during each shift.\n• Perform side duties including folding napkins, rolling silverware, cleaning trays, restocking shelves, filling ice bins, cleaning and breaking down service area, using cleaning compounds.\n• Demonstrate knowledge of all menu items, F&B Service procedures and Jumeirah Hygiene Standards.About you:The ideal candidate for this position will have the following experience and qualifications:• Previous experience in similar role or capacity\n• Handling guest complaints at highest service levels\n• Dealing with high profile guests\n• Knowledge of DubaiAbout the benefits:We offer an attractive tax-free salary, paid in Dirhams (AED), the local currency of the UAE. In addition, we offer generous F&B benefits, reduced hotel rates across our properties globally, excellent leave and health care package, flights home, life insurance, incentive programs, and other employee benefits making the role attractive to high performers and any applicant looking for a career with one of the most luxurious brands in the hospitality industry.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}