{"Job ID": "69873022", "Description": "What's the opportunity? Are you passionate about creating innovative, elegant and robust structural engineering solutions for complex construction projects?This is join a world-renowned structures practice renowned for creating innovative and architecturally compelling structural forms. Be ChallengedWith us, your preconceptions will be tested, your resilience built, and your career enriched.Buro Happold Associates will typically take responsibility for management of people, commercial issues and an interface with the wider project team. In this capacity Associates represent Buro Happold internally and externally on behalf of the group.Preparation of technical documents and checking the work of other Engineers in the team\nUndertaking project technical/quality reviews and attend design reviews for projects both in offices and on site\nContributing to group initiatives with respect to technical development / market sectors and processes\nLeadership of projects on behalf of the group, taking ownership for sustained and productive client relationships\nManagement of multiple projects across the group, taking responsibility for the engineering solutions\nReviewing, with the support, job financial performance and manage resources accordingly\nLeading a team on specific projects within the Group (including a team of Engineers and Technicians)\nDirect line management responsibilities for 3-5 people\nGuiding less experienced team members in order to achieve the project success\nProviding support in seeking new work from existing clients\nChampioning the group’s marketing goals and plans.\nWork Experience - 13 years - 18 yearsBe RespectedWe’ll help you meet your goals, respecting your ideas and fostering your creativity, collaboration and innovation.As an experienced and established Structural Engineer it is expected that you would be able to demonstrate:Extensive experience as a structural engineer on large scale, complex buildings projects; \nDemonstrable evidence of job leadership experience on large scale projects, ideally within multiple sectors although Buro Happold's varied portfolio will further extend your breadth of experience.\nStrong Finite Element Analysis (FEA) experience.\nStrong commercial skills - able to take responsibility for project finances, resourcing, etc. \nInternational experience would be highly advantageous; \nMentoring and leadership experience of other engineering professionals; able to demonstrate a desire and ability to support in developing individuals' skills, whilst encouraging collaboration and cohesive teamwork;\nDegree educated and a post-grad qualification in a relevant discipline\nProfessional registration with a relevant institution - e.g. ICE or IStructEWhy Buro Happold?From helping shape entire cities to adapting infrastructure to deal with the climate emergency, a career at Buro Happold presents the chance to make a difference. With a world class reputation, our creativity and our people have delivered positive change to clients, the environment, and communities. If you want to be part of something bigger, this is your chance. Interested?Intrigued? Inspired? Join us to find out what you’re really capable of.Described by our clients as 'passionate', 'innovative', 'collaborative': Buro Happold is an independent, international engineering practice that for over 40 years has become synonymous with the delivery of creative, value led building and city solutions for an ever changing world. Having worked on every continent, our clients include more than 90% of the world's leading architectural practices and we have collaborated with global organisations such as the United Nations, The World Bank and UNESCO. Through our global community of driven, world leading engineering and consulting professionals we deliver elegant solutions for buildings and cities that seek to address the major problems facing societies today. Follow us @burohappold and find out more at www.burohappold.com. Buro Happold value flexible working as an important part of the way we work. We welcome applications from those who are seeking flexibility in their careers. #LI-SB1 #HybridBuro Happold is proud to be a practice of a diverse range of professionals. We actively promote inclusivity to enable every individual to reach their full potential, the more inclusive we are the better our work will be.\n\nWe are working to change the lack of representation of minority groups in the built environment, and are particularly keen to hear from anyone who feels they are underrepresented in the industry. We have much to learn from one another. Embracing difference allows us to develop the most innovative and elegant solutions.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}