{
    "Job ID": "69874492",
    "Description": "Mission Statement: We are looking for a Tax Solution Architect to design and implement innovative tax technology solutions for our organization. The successful candidate will work closely with our Tax team to identify business requirements, evaluate existing technologies, and develop customized solutions that improve tax processes and compliance. The Tax Solution Architect will also be responsible for overseeing the implementation of these solutions and ensuring that they are aligned with our overall business and IT strategy. Your Responsibilities: Work with tax team to identify business requirements and translate those to customized tax technology solutions. Evaluate existing tax technologies and make recommendations for improvements or new solutions. Develop detailed technical specifications and system architecture diagrams. Oversee the implementation of tax technology solutions, including managing vendors and ensuring that projects are delivered on time and within budget. Develop and maintain relationships with key stakeholders, including tax team members, IT professionals, and business leaders. Ensure that tax technology solutions are aligned with our overall business and IT strategy and comply with regulatory requirements. Provide guidance and training to tax team members and other stakeholders on the use of tax technology solutions. Stay up to date on emerging tax technologies and trends and make recommendations for adoption as appropriate. Ensure the security and confidentiality of tax data and systems. Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your Background: Bachelor's degree in Computer Science, Information Systems, or Tax area. 5+ years of experience in tax technology solutions, including design, implementation, and management. Strong technical skills, including experience with tax software and systems such as SAP and Vertex. Excellent analytical and problem-solving skills. Strong project management skills and experience leading cross-functional teams. Excellent communication and interpersonal skills, with the ability to communicate technical concepts to both technical and non-technical stakeholders. Strong understanding of tax laws and regulations, including VAT, GST, and sales and use tax. Experience working in a multinational or global environment is preferred. Proficiency in both spoken & written English language is required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}