{
    "Job ID": "69873008",
    "Description": "Date Posted:Country:Location:Sending account statement to customer\nContacting customers for payment\nWorking on open disputes and resolving them timely\nPrepare outstanding Invoice reports, hold reports/ cancellation reports, process level reports for Revenue Services and gather credit and/or reference information.\nMaintains database by entering, updating and retrieving data, as well as formatting and generating reports.\nAssists in resolution of outstanding invoice queries/disputes.\nResponds to inquiries from internal and external customers.\nAdheres to credit & collections policies while issuing credit notes, compliance to Customer Privacy Policy, GAAP and internal controls.\nChecks and verifies account receivable records, prepares invoices, credit notes, files\nResponds to internal and external customer Invoicing inquiries.\nSupports internal metrics and goals through invoicing activities. Candidate requirement:·         Sound judgment and ability to make quality and quick decisions·         Should have excellent communication skills in English·         Strong attention to detailOtis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. To request an accommodation in completing an employment application due to a special need or a disability, please contact us at careers@otis.com.Privacy Policy and Terms:Click on this link to read the Policy and TermsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}