{"Job ID": "69873373", "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. About the team Retirement BPaaS provides services to U.S based Third Party Administrators in managing day to day Recordkeeping operations and Year End Annual Administration & Reporting of Defined Contribution plans.Services are catered to FIS Retirement clients via FIS Retirement Products.   What you will be doing This Specialist role will be responsible to handle High Complex research, reporting and special processing of retirement plan activities, including plan changes and modifications.Also so work closely with a group of less tenured plan administration staff on recordkeeping activities as assigned.Process ManagementSupport meeting Service Level Agreements for TAT, utilization, productivity & quality;\nMaintain and analyze MI associated with all SLAs and circulate reports/ dashboards as required;\nEffectively suggest and schedule shift rotation and leaves to meet capacity per shift;\nEnsure compliance with external and internal audit and confidentiality/ regulatory requirements;\nReview, research and provide feedback on processing discrepancies/ errors to prevent recurrence;\nParticipate and transfer information to all associates on a timely basis via regular team meetings per responsibility assigned;\nSupport New Hire on-boarding process\nWork with internal FIS departments to research issues related to applications and support of the client.Knowledge Transition & Process ImprovementBuild strong understanding of core systems and how they work together;\nBuild strong partnerships with the US based team to anticipate requirements and deliver to dynamic operational and workload needs;\nHandle the transition of work from client/ on-site center to India and work with the on-site team to improve workflow SOPs, quality, skills and productivity for the operations;\nContribute to implementing and enhancing the policies and procedures for knowledge management. Analyze existing systems and processes to identify gaps and opportunities for cost/ quality/ process improvementsProcessing TasksResponsible for processing certain tasks (as per SLAs) that require a higher level of experience and detail orientation due to the complexity, risks and customer interaction associated with such tasks\nParticipant in Testing per business require and submit detailed and concise test results.\nCommunicate and follow-up with clients via emailWhat you bring: Skills and Knowledge / Experience5-8 year of Industry experience primarily in US Retirement Domain.\nHands on experience of working in FIS OMNI & EXPAG application;\nStrong understanding of concepts and terminology of financial services industry, especially in Retirement (DB & DC) & Record-keeping\nPrior experience in knowledge transition is essential\nPrior experience in leading a team of approx. 5 - 10 FTE is essential\nHands-on experience in handling Metrics, Volumes and other SLAs (including escalations) is required;\nWell versed with MS Office applications (Word, Excel & PowerPoint, Teams, etc.) A ‘can-do’ attitude and the ability to work in a team environment and adapt to change is essential\nWillingness to work in shiftsAdditional Notes (Desirable)Typical systems utilized could include FIS workflow software, FIS financial record keeping software, and other business applications as necessary;\nPrevious experience in processing and experienced in FIS OMNI applications would be a significant plus;\nAbility to provide positive constructive feedback to co-workers as assigned by Management;\nShould be a dependable resource with a willingness to work stretched hours (if required);\nModerate understanding of the OMNI and EXP AG applications (desirable);What we offer you A multifaceted job with a high degree of responsibility and a broad spectrum of opportunities A broad range of professional education and personal development possibilities – FIS is your final career step! A competitive salary and benefits A variety of career development tools, resources and opportunitiesWith a 50-year history rooted in the financial services industry, FIS™ is the world's largest global provider dedicated to financial technology solutions.  We champion clients from banking to capital markets, retail to corporate and everything touched by financial services. Headquartered in Jacksonville, Florida, our 53,000 worldwide employees help serve more than 20,000 clients in over 130 countries. Our technology powers billions of transactions annually that move over $9 trillion around the globe.  FIS is a Fortune 500 company and is a member of Standard & Poor’s 500® Index.FIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the FIS Online Privacy Notice.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}