{
    "Job ID": "69875997",
    "Description": "About Tekrevol:Tekrevol is a leading mobile app development company dedicated to providing businesses with reliable technological solutions. We have helped countless entrepreneurs achieve their goals and drive results by creating top rated mobile apps and websites.As a global company, our aim isn’t just to create digital solutions but to help businesses achieve sustainable growth and scalability. Our teams and networks stretch across the United States, and have extended its reach to Ukraine & the Middle East.Job Description:We are seeking a highly skilled and experienced React Native Developer to join our dynamic team. As a React Native Developer, you will be responsible for designing, developing, and maintaining high-quality mobile applications using React Native framework. Your expertise in React Native and strong understanding of mobile app development principles will be essential to deliver exceptional user experiences to our customers.Develop and maintain high-performance, reliable, and scalable mobile applications using React Native.\nCollaborate with cross-functional teams including product managers, designers, and backend developers to define, design, and ship new features.\nWork closely with UI/UX designers to translate design concepts into mobile app interfaces with high fidelity.\nWrite clean, efficient, and reusable code that follows best practices and coding standards.\nOptimize mobile applications for maximum performance, responsiveness, and efficiency.\nDebug and fix software defects, ensuring the stability and reliability of the applications.\nStay updated with the latest trends and advancements in React Native and mobile app development, and continuously improve your skills and knowledge.\nConduct code reviews, provide constructive feedback, and mentor junior developers to promote code quality and growth.\nCollaborate with backend developers to define and consume APIs, ensuring seamless integration between front-end and back-end systems.\nParticipate in the entire software development lifecycle, from requirements gathering to deployment and maintenance.\n Job Requirements:Bachelor's degree in Computer Science, Software Engineering, or a related field. A combination of education and relevant work experience may be considered.\nAt least 4- 5 years of professional experience in mobile application development.\nProven track record of developing and delivering high-quality mobile applications using React Native.\nStrong proficiency in JavaScript and experience with modern web technologies such as HTML5, CSS3, and ES6+.\nIn-depth understanding of the React Native framework and its core principles, along with familiarity with popular React Native libraries and tools.\nExperience with mobile app development best practices, including responsive design, performance optimization, and memory management.\nProficiency in using version control systems like Git for code management and collaboration.\nExperience with integrating APIs and working with backend technologies. Strong problem-solving and debugging skills.\nExcellent communication and collaboration skills, with the ability to work effectively in a team environment.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Karachi, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}