{"Job ID": "69873982", "Description": "S&P Global CorporateThe Role:  APAC Junior Payroll SpecialistIn this role, you’ll play an integral part of S&P’s Global Payroll team. A group of action-oriented professionals who drive the creation of world-class Payroll.  As Junior Payroll Specialist, you are a key player in our payroll operations team. You are responsible for coordinating and processing the payrolls of several countries in APAC. The Location:  Gurugram, IndiaWhat’s in it for you:You can start something from the ground up. We are a new organization so you can grow with us.\nProfessional growth by learning other countries and participate in global projects.\nOpportunity to interact with multiple partners in a wide range of locations, which allows you to develop key skills and time management, stakeholder management, international communication, and project management.\nWork for a company that really cares about their People.The Impact:This is a new role as previously the payroll was processed out of our Singapore payroll hub. Due to the growth in country, we are building a payroll team in the Philippines. The intention is to expand this payroll team and provide further support to other APAC countries as well as the United States payroll team. This is a great opportunity for a Junior Payroll Specialist to come and learn the payroll professions as long as you have the drive and motivation to learn and grow.\nYour first job responsibility is to ensure our people are paid correct and on-time and the company is compliant with local legislation. This includes meeting statutory deadlines, keeping up to date with legislation and recommend a new approach in case of legislation changes. Projects, process improvements, documentation, and metrics are all part of this exciting new role. Our global team is building the future of payroll including utilizing robotics as part of our payroll process. You can be a key partner to our People, Technology and Business teams and a key contributor to this future state of payroll. How exciting!Responsibilities:Support payroll processes for multiple APAC countries (but not limited to) like Singapore, Hong Kong, Australia accurately and on time.  \nReview and manage payroll inputs related to base pay, disability and leaves, work schedule changes, new hires, employee movement, separations (final pay, severance), organization changes (e.g., M&A), job and pay changes, and one-time payment requests with third party payroll provider or in-house payroll processing team. Typically works on more complicated and/or sensitive transactions.\nSupport Payroll Manager with collaboration across in-country partners and other functions to ensure all data is complete and received within payroll deadlines for processing.\nManage payroll calculation process with third-party payroll provider.\nEnsuring month-end, quarter-end, and year-end payroll returns are complete, accurate, and submitted to Government agencies in a timely manner.\nExecute, in accordance with globally established standards, processes for SOX compliance, internal controls, and required regulatory/statutory requirements (including payroll record data maintenance).\nUpdate and maintain payroll process and administration documentation.\nSupport payroll projects and cross-functional projects with payroll dependency.Requirements:A minimum of 1 year experience in payroll processing / payroll operations is required.\nKnowledge of payroll processing in APAC countries is a nice to have.\nPrior Experience with payroll processes, procedures, controls, regulations, and compliance is preferred.\nEnglish language proficiency is required.\nA sense of urgency in resolving customer requests and an ability to work under pressure, multi-task, and meet deadlines.\nStrong interpersonal skills and the ability to successfully work with internal stakeholders and colleagues to contribute ideas, identify opportunities, and contribute to positive outcomes.\nPrior experience in a multi-national company, and/or experience in a Service Center Environment preferred.Grade (relevant for internal applicants only): 08#LI-RS2About Company Statement:S&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}