{
    "Job ID": "69873659",
    "Description": "Job Title:                   Head of Student Recruitment and Admissions                             College/ Office:         Office of Strategic Communications, Marketing and                                           Student Recruitment                                               The following statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so qualified.SUMMARY OF FUNCTIONS:The Head of Student Recruitment leads the effective planning, execution and evaluation of recruitment strategies comprised of digital and event-based initiatives, stakeholder engagement, networking and relationship building and other innovative initiatives. This position will provide support for understanding market trends, identifying new opportunities, and developing creative recruitment strategies to meet institutional recruitment targets.\nThe Head of Student Recruitment is responsible for developing recruitment campaigns that target different students' segments and expand the capacity to reach prospects, on a local and global scale.\nThe holder of this position will oversee the coordination and delivery of messages and outreach materials that educate, inform, advise and address the needs of prospective students, through multiple communication channels. The Head of this unit is responsible for identifying, adopting and implementing effective communication channels with various stakeholders to facilitate recruiting a diverse group of students, locally, regionally and internationally. The candidate will plan, design and successfully implement effective student recruitment campaigns, ensure providing first-class customer service by adopting a clear set of policies, processes, metrics and standards.ESSENTIAL DUTIES & RESPONSIBILITIES: Identifies develops and delivers data-driven effective recruitment strategies based on efficient benchmarking and best practices.\nOrganizes and run promotional campaigns across a range of channels to support student recruitment and engage the targeted audiences.\nBuilds sustainable relationships with local and international recruitment agencies to support the achievement of the student recruitment targets set in the Performance Contract (PC).\nEffectively communicates calendars of activities to support local and international student recruitment efforts.Interacts with deans, directors, managers, alumni, current students and other internal and external stakeholders to ensure the delivery of high-quality and high-impact integrated student recruitment initiatives.\nMaintains a high level of coordination with other functions of marketing and communications to deliver fully integrated recruitment and communication campaigns and solutions across multiple platforms.\nEnsures high-quality, timely and accurate information is available to prospective students and influencers across a wide range of media to assist in decision making and support student recruitment to the University.\nDevelops effective planning and reporting cycle to communicate with internal and external stakeholders about recruitment activities and outcomes.\nWorks collaboratively to integrate campaign activities into the University’s digital systems, including Customer Relationship Management (CRM).SUPERVISION:Reports to: Vice-Chancellor for Communication and Community AffairsSubordinates: All Staff members of Unit of Student Recruitment and AdmissionsQUALIFICATIONS & EXPERIENCE:Bachelor's degree in Marketing, Journalism, Communications, or related field is required.\nA minimum of five years’ experience in marketing, communications, student recruitment or related field, preferably within higher education sector.KNOWLEDGE & SKILLS:Substantial experience at a strategic level in developing, managing and delivering innovative student recruitment solutions.\nA good understanding of recent trends and developments in higher education related to recruiting and enrollment, and knowledge of student recruitment best practices.\nAbility to gather information, analyze data and prepare reports related to prospective students, enrollment, admission, and recruitment effectiveness.\nA strong background in content development and creative service management in a large/complex organization.\nApplied skills in project management within marketing and communications context, along with experience in implementing high quality communication and marketing campaigns.\nAbility to take personal accountability for achieving high quality outcomes towards organizational goals, objectives and service excellence.\nExperience in leading and motivating a team to deliver excellent outcomes.Excellent stakeholder management skills including the ability to influence others and negotiate mutually beneficial outcomes.OTHER GENERAL SKILLS REQUIREMENTS:Previous experience in higher education institutions.\nPrevious experience in using CRM systems.\nExperience in Public Relations or Communications.\nExperience with multicultural marketing and communications.\nExcellent planning and event management skills.\nExcellent social media platform engagement skills.\nExcellent understanding of tools and techniques used to engage audiences through social media.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Ajman, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}