{"Job ID": "69872610", "Description": "Company Profile Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com. Risk Technology Firm Risk Management (FRM) Technology department is responsible for developing and overseeing the enterprise strategy and bespoke technology solutions to comply with international regulatory frameworks for calculating regulatory capital levels, enforcing risk governance, and providing comprehensive reporting and disclosure. The department is executing an ongoing program of work to extend the capabilities of the Firm Risk platform to meet both internal and external requirements. The clients include Risk Managers and Middle Office stake holders responsible for managing the Firm's Market, Credit, Operational and Liquidity risk. Job Profile This is a Data Engineering/Big Data specialist position with Firm Risk Technology group based out of Bangalore India. We are looking for an enthusiastic, dynamic, hands-on and delivery focused Data Engineering developer with strong Data analytics skills and experience on various Big Data Technologies/MPP database. You will be expected to work closely with our business users/Source system owners for projects. The development will be performed using an Agile methodology which is based on scrum (time boxing, daily scrum meetings, retrospectives, etc.) and XP (continuous integration, refactoring, unit testing, etc.) best practices. Candidates must therefore be able to work collaboratively, demonstrate good ownership and be able to work well in teams. Candidate needs to keep abreast of new technologies and architect patterns to define and implement state of art systems. The role also demands ability to successfully work with global teams in US, Europe and India. RESPONSIBILITIES You are in love with Data, Databases, and have your ears to the ground on emerging data technology trends. Development and support of Data Ingestion Framework (using ETL like Spark, Informatica, Unix Shell Scripting, Python Scripting etc.) Data Modelling/Physical Data Design Performance Tuning/OptimizationJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}