{
    "Job ID": "69875648",
    "Description": "Department Description:\nThe Oracle Cloud Infrastructure team is building a new technology organization. This new entity is being constructed with an entrepreneurial spirit that promotes an energetic and creative environment. We are unencumbered and will need your contribution to make it a world class engineering center with laser focus on excellence.Oracle’s extensive enterprise customer base is looking for rock solid cloud solutions that provide the same reliability and effectiveness that they have come to expect from Oracle. As a trusted Enterprise vendor, Oracle is in the early stages to provide highly cost-effective IaaS, compute, storage, & PaaS Cloud solutions to its customer base.Position Overview: \nThe position is for a Manager – Cloud Customer Support. Responsible for managing and  leading a team of Cloud Technical Support Engineers to provide excellent customer service support. Hire and train team members. Organize and oversee shift schedules of team members. Provide constructive and timely performance evaluation feedbacks in accordance with company policy. Make sure KPI deliverables are met for the team.A primary point of contact for customers, you are responsible for facilitating customer relationships with Support and providing advice and assistance to internal Oracle employees on diverse customer situations and escalated issues. you will establish and communicate departmental objectives and implement plans to assure attainment of goals/KPIs. Your team is likely to be comprised primarily of technical or other professionals. Leads a specialized area which may have diverse functional elements. Frequently interacts with supervisors and/or functional peer group managers.Perform the role of duty manager, act as point of contact during shift hours. track-incidents, troubleshooting, and resolution of complicated and critical cases. This position involves working in shifts, and during weekends/Public Holiday as Duty Manager on rotational basis.This management position will be based out of Bangalore, India Support Center. Responsibilities:Perform role of duty manager during shifts, and across weekend/public holiday on rotational basis.\nAttend to Manager call back requests from customers (external/Internal)\nSchedule and maintain Team members shifts and coverage for technical support availability during shift hours\nAttend to escalations from internal and external stakeholders\nConduct team meetings and 1:1 to listen and facilitate team members to provide better customer support experience.\nProvide reports and feedback about team member performance, as per performance evaluation guidelines in team.\nAnalyze customer feedback and act on CAPA.\nActively participate in org wide projects across areas like Recruiting, Training, Knowledge management, Automation, process enhancement, etc..Required Experience & Skills:Previous people and technical team management experience, particularly in fast paced, Cloud support environment is required.\nAbility to communicate and collaborate across all levels of the organization, both verbally and in writing.\nExperience in Infrastructure and/or cloud support services.\nExcellent interpersonal and customer service skills.\nExcellent organizational skills and attention to detail.\nStrong analytical and problem-solving skills.\nStrong supervisory and leadership skills.\nProficient with Microsoft Office Suite or related software for reporting needs.Education and Experience:Bachelor’s degree in computer science or related field required.\nKnowledge on ITIL.\nAny public cloud certification is added advantage.\nAt least five years of related Technical support team management experience.An Oracle career can span industries, roles, Countries and cultures, giving you the opportunity to flourish in new roles and innovate, while blending work life in. Oracle has thrived through 40+ years of change by innovating and operating with integrity while delivering for the top companies in almost every industry.In order to nurture the talent that makes this happen, we are committed to an inclusive culture that celebrates and values diverse insights and perspectives, a workforce that inspires thought leadership and innovation.Oracle offers a highly competitive suite of Employee Benefits designed on the principles of parity, consistency, and affordability. The overall package includes certain core elements such as Medical, Life Insurance, access to Retirement Planning, and much more. We also encourage our employees to engage in the culture of giving back to the communities where we live and do business.At Oracle, we believe that innovation starts with diversity and inclusion and to create the future we need talent from various backgrounds, perspectives, and abilities. We ensure that individuals with disabilities are provided reasonable accommodation to successfully participate in the job application, interview process, and in potential roles. to perform crucial job functions.That’s why we’re committed to creating a workforce where all individuals can do their best work. It’s when everyone’s voice is heard and valued that we’re inspired to go beyond what’s been done before.Oracle is an Equal Employment Opportunity Employer*. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.* Which includes being a United States Affirmative Action EmployerJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}