{"Job ID": "69873422", "Description": "Job Number 23167916 Job Category Food and Beverage & Culinary Location Bulgari Resort Dubai, Jumeirah Bay Island, Dubai, United Arab Emirates, United Arab Emirates VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Prepare special meals or substitute items. Regulate temperature of ovens, broilers, grills, and roasters. Pull food from freezer storage to thaw in the refrigerator. Ensure proper portion, arrangement, and food garnish. Maintain food logs. Monitor the quality and quantity of food that is prepared. Communicate assistance needed during busy periods. Inform Chef of excess food items for use in daily specials. Inform Food & Beverage service staff of menu specials and out of stock menu items. Ensure the quality of the food items. Prepare and cook food according to recipes, quality standards, presentation standards, and food preparation checklist. Prepare cold foods. Assist management in hiring, training, scheduling, evaluating, counseling, disciplining, and motivating and coaching employees; serve as a role model. Follow all company and safety and security policies and procedures; report maintenance needs, accidents, injuries, and unsafe work conditions to manager; complete safety training and certifications. Ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Anticipate and address guests’ service needs. Speak with others using clear and professional language. Develop and maintain positive working relationships with others; support team to reach common goals; listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards. Stand, sit, or walk for an extended period of time. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Developed in partnership with jeweler and luxury products designer Bulgari, our select Bulgari Hotels & Resorts are located in major cosmopolitan cities and luxury resort destinations. Join our team and help deliver the excitement, timeless glamour and heritage of the Bulgari brand. In joining Bulgari Hotels & Resorts, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}