{
    "Job ID": "69873517",
    "Description": "IntroductionYour Role and ResponsibilitiesWho We Are\nIBM Z is the world’s most powerful business platform. 68% of enterprise production workloads, 80% of structured enterprise data, and 55% of all enterprise transactions, including more than 50% of the back-end transactions generated from mobile enterprise applications run on IBM Z. Before this backdrop, our team is embarking on an exciting journey to usher in the era of Cognitive Operations in Z Systems Software.\nThe Position\nTo accomplish this transformation, the IBM Z AI OPS organization is hiring top talent to expand the capabilities of our portfolio and deliver meaningful innovation for the platform. IBM Z NetView is a core component of IBM Z Service Management Suite and IBM Z Service Automation Suite, providing automation, network management and systems management to address customer requirements for business agility on IBM Z systems. As a member of a dynamic team in supporting the delivery of enterprise software for a large user base, you demonstrate leadership, technical curiosity, a self-starter, creativity as well as forward thinking with a passion for growth and innovation.\nAs a well-rounded Software Engineer, you are part of a highly focused, self-managed Agile team who designs, develops, tests deploys IBM Z applications on zOS. Primary responsibilities are:Driving daily scrum master responsibilitiesDeveloping and testing new code features as well as code enhancements for the IBM Z NetView product. Perform Information Development and documentation about the product features enhancements. Collaborate in a team-driven environment with a group of experienced software engineers who want to deliver leading edge function on the IBM Z platform. You will help bring digital applications to life by creating robust enterprise platforms to support rich and interactive front ends.Your expertise in designing and building high performance, reliable enterprise applications on the IBM Z allows you to build the services, integration, data, analytics, and algorithms required to support next generation experiences. You interface with enterprise architects and delivery teams to shape, estimate, and define the programs that turn ideas and prototypes into fully functional systems.\nAs a Software Engineer, you are part of a highly focused, self-managed Agile team who designs, develops, tests & deploys mainframe applications on z/OS. Primary responsibilities are:Designing and developing Network Management features as well as code enhancements for the IBM Z NetView product.\nCollaborate in a team-driven environment with a group of experienced software engineers who want to deliver leading edge function on the mainframe platform.\nYou will help bring digital applications to life by creating robust enterprise platforms to support rich and interactive front ends.\nYour expertise in designing and building high performance, reliable enterprise applications on the mainframe allows you to build the services, integration, data, analytics, and algorithms required to support next generation experiences. You interface with enterprise architects and delivery teams to shape, estimate, and define the programs that turn ideas and prototypes into fully functional systems.\nHave an interest in, understanding of, or experience with Design Thinking and Agile Development\nBring strong verbal and written communication skills.Required Technical and Professional Expertise7+ years of experience,\nKnowledge of IBM z/OS development\nKnowledge of Network Management\nExperience programming in JAVA, Script Languages, e.g. Python, REXX\nKnowledge of Full Development Lifecycle using Agile methodology e.g. SAFePreferred Technical and Professional ExpertiseExperience using IBM Z tools such as NetView, IMS, JCL, HMC, DB2, TSO Experience in Assembler, COBOL, CC++ languages\nKnowledge of Security on the Z platform is a plus\nExperience in Ansible Automation\nKnowledge of Virtualization and containerization technology docker, Kubernetes etcJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}