{"Job ID": "69874516", "Description": "Some careers have more impact than others.If you’re looking for a career where you can make a real impression, join HSBC and discover how valued you’ll be.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Senior Software Engineer. In this role you will :As a Senior Software Engineer you should able to update test strategy, review test plan, traceability matrix and ensure usage of tools for optimization. You should be able to ensure the availability test environment, design test and defect reporting formats and manage the team. You should have sound knowledge/experience on mainframe, test automation using Selenium/TOSCA tools, update project related data as required in applicable systems and ensure timely reporting and response to stakeholders.Able to Create run execute JCLs in Mainframe, Validate the job status in spool , Run Mainframe DB post execution\nProactively identifying potential delivery related issues and arriving at mitigation plan.\nExecute tests, track and monitor defects/Stories to closure and produce test metrics and test reports.\nAssist the Test Lead/ Manager in project meetings to provide feedback and statistics of the project in relation to the test quality\nDesign & run automation test assets.\nImplement creative and innovative ways of testing to meet project goals without compromising qualityJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}