{
    "Job ID": "69875572",
    "Description": "Job DescriptionHow will you make an impact?Thermo Fisher Scientific’s Transplant Diagnostics Division (TDX) develops and commercializes several lines of In-Vitro Diagnostics (IVD) histocompatibility (HLA) tests and services. This role will enhance our product and services portfolio and determine our go-to-market strategy to enable our Biopharma clients to identify patient populations that may benefit from a life-saving therapy!What will you do?The Regional Marketing Manager (RMM) will drive commercial execution in the assigned region by facilitating and implementing marketing and market development actions and initiatives aimed to drive the growth of Thermo Fisher Scientific share across the assigned region.Responsible for driving marketing initiatives to grow sales and market penetration. You will work closely with our Sales and Field Applications teams to capture feedback on market trends and competitive dynamics. Working closely with our Scientific Affairs, Medical Affairs, Global Market Development, and Commercial Leadership teams, you will also have responsibility over the definition, execution of tactical plans, and commercial training, to ensure continual business growth and sustainability in the region.Reporting to Director, Global Marketing and dually reporting into the Commercial Leader of the region, this position will be a part of the Global Marketing organization. This role supports a critical part of our commercial strategy and will contribute to the overall success of the Transplant Diagnostics (TDX) business within the Specialty Diagnostics Group (SDG).The scope of this role includes working within a highly matrixed organization.Responsibilities:Responsible for collecting market intelligence, reimbursement data by country within region. Uses relevant market data to support direct sales teams and Channel Partners expansion into new customer segments and adjacent markets.\n\nDrives the creation of materials related to marketing projects including product launches, content offers, web updates, email campaigns, social media, advertisement and other special projects.\n\nLead all aspects of the development, production, and distribution of promotional and collateral materials to support regional sales and marketing programs.\n\nPlan, develop, message and deliver marketing and customer facing programs specifically tailored for the territories under responsibility.\n\nAct as the point of contact for regional commercial colleagues on all demand generation activities and commercial trainings in the region.\n\nTravel with commercial personnel to provide support in the execution of the tactical message for various product lines.\n\nResponsible for customer segmentation/persona training and messaging.\n\nResponsible for storytelling of wins/losses to promote best-practices and sharing across global commercial teams.\n\nOwns regional event management in partnership with Events/Tech Training Team including travel to and support onsite execution and management of key regional events when required.\n\nCaptures/share regional voice of customer/voice of sales information and regional competitive intelligence.\n\nBuild relationships, collaborate and regularly engage with key customers and key opinion leaders (KOL) to ensure TDX leads the way in the development of ground breaking diagnostic tools.\n\nPartners with medical affairs to develop Patient Access strategy for the region in partnership with TDX/SDG global efforts. Develop and lead localized patient advocacy initiatives.Requirements:Bachelor’s Degree in Marketing or a Life Science; or equivalent work experience & knowledge\n\nStrong eye for business with customer at top of mind. Strong ability to think strategically, combined with several years’ experience in a Marketing or Technical Support or Technical Sales role.\n\nKnowledge of Transplant Diagnostics (TDX) technology & products would be highly beneficial, ideally gained from a scientific, technical support, sales or marketing role. Ability to understand currently offered TDX technology and articulate strong customer value/benefit propositions.\n\nShown leadership and project/process management experience.\n\nAble to travel internationally up to 50% as needed.\n\nProficient in English (verbal & written); additional languages a plus.At Thermo Fisher Scientific, each one of our 100,000 outstanding minds has a unique story to tell. Join us and contribute to our focused mission—enabling our customers to make the world healthier, cleaner and safer!Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}