{
    "Job ID": "69872689",
    "Description": "Our client is a well reputed Technology company specialised in providing advanced digital solutions in the fields of Conversational AI, Customer Communications Management (CCM)As the Sales Manager for Digital Solutions, you will play a pivotal role in driving revenue growth by effectively positioning and selling our industry-leading offerings to key decision-makers within target business verticals.Job Responsibilities:Identify and engage potential clients in the Government, Financial Services, and Insurance sectors who can benefit from our Conversational AI, CCM\nEstablish credibility with C-level executives, including CEOs, CTOs, CIOs, and other decision-makers, by demonstrating a thorough understanding of their industry challenges and presenting tailored digital solutions that address their specific needs.\nCollaborate with the marketing and technical teams to tailor our digital solutions to meet the unique requirements of each target industry. Articulate the value proposition of our offerings in a compelling manner, showcasing how they align with industry trends and technologies.\nBuild and manage a robust sales pipeline, utilize CRM tools to track leads, opportunities, and sales activities. Forecast accurately and consistently meet or exceed quarterly and annual sales targets.\nStay informed about industry trends, competitor offerings, and emerging technologies in AI, Fintech, blockchain, and analytics. Leverage this knowledge to position our solutions as innovative and relevant in the evolving market landscape.\nCollaborate with Partners, Third parties, Internal cross-functional teams including marketing, product development, Technical and customer success team , to ensure a seamless end-to-end customer experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}