{
    "Job ID": "69873476",
    "Description": "Company Profile:At Unilever you are more than your job title, you are part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us.We produce world-leading brands including Knorr, Dove, Axe, Hellmann’s and Omo, alongside trusted local names and innovative-forward thinking brands like Ben & Jerry’s, The Dollar Shave Club and Surf.Be part of the most successful purpose-led business in the world. Have the opportunity to see the true impact that you’re having in the work you do - every small thing counts.Job Scope:Drive in organic growth through leading the NRM agenda, while accelerating the strategic Channels growth.Roles & Responsibilities:Manage Strategic channels S&OP and Activities to accelerate growth (DCOM).\n\nWork on D4C opportunities on core portfolio and channels to optimize TTS and generate iTO.\n\nAnalyze and understand customer mix Impact and recommend optimum mix to maximize TO per channel.\n\nDefine portfolio / market optimum mix to maximize TO per TON.\n\nLead NRM Agenda Lever 4,5 to optimize TTS and generate iTO.\n\nLead Distribution agenda with CBD.Key relationships:CBD\n\nMarketing\n\nFinanceKey competencies & skills:+3 Solid years of experience in category management within FMCG\n\nF4G funnel / iTO\n\nStrategic Channels USG (DCOM)\n\nPassion for Growth\n\nTeam Commitment\n\nObjective Analytical Power\n\nInfluencing Others\n\nExcellent communication skills\n\nNRRUnilever is an organisation committed to equity, inclusion and diversity to drive our business results and create a better future, every day, for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. At Unilever we are interested in every individual bringing their ‘Whole Self’ to work and this includes you! Thus if you require any support or access requirements, we encourage you to advise us at the time of your application so that we can support you through your recruitment journey.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}