{"Job ID": "69873279", "Description": "Job Description:In the capacity of General Manager, your role will involve the oversight of our existing F&B concepts, as well as the creation of novel ideas. This encompasses the introduction of fresh physical dining establishments, captivating pop-up experiences, and innovative cloud-based projects. Your responsibilities will span from enhancing profitability and supervising operations to devising imaginative strategies that ensure the triumph of our exceptional dining concepts. Central to your role is the formulation and execution of the strategy for the F&B sector.Key Responsibilities:Profit and Loss Management:Develop and execute effective strategies to achieve revenue and profit targets.\nMonitor financial performance, analyze trends, and take proactive measures to optimize financial outcomes.\nControl operational costs while maintaining high-quality standards.Operational Excellence:Oversee all aspects of the restaurant's day-to-day operations, including staff management, customer service, and inventory management.\nEnsure compliance with health, safety, and sanitation standards to provide a safe and enjoyable dining experience.\nCollaborate with the culinary team to curate innovative and appealing menus that resonate with the target audience.Concept Development and Leadership: Plan, coordinate, and execute pop-up restaurant events to create unique dining experiences for customers.\nManage the cloud restaurant platform, ensuring efficient order processing, timely deliveries, and a seamless online experience.\nFoster a culture of innovation and creativity, encouraging the team to explore new culinary trends and concepts.Customer Experience:Prioritize exceptional customer service and guest satisfaction, addressing feedback and continuously improving the dining experience.\nImplement strategies to engage customers and build a loyal customer base, both offline and online.Team Management:Recruit, train, and lead a high-performing team, providing guidance and support to ensure the consistent delivery of service excellence.\nFoster a positive and collaborative work environment that promotes growth and development among staff members.Marketing and Branding:Collaborate with the marketing team to develop and execute effective promotional campaigns for both the popup and cloud restaurant.\nLeverage social media and other marketing channels to create buzz and excitement around the innovative dining experiences.Financial Analysis and Reporting:Generate regular reports on financial performance, sales trends, and operational metrics to assess the restaurant's health.\nUtilize data-driven insights to make informed decisions and adjustments to achieve optimal results.Stakeholder Engagement:Build and maintain relationships with suppliers, vendors, and other key stakeholders to ensure a smooth supply chain and operational continuity.Qualifications:Bachelor's degree in Hospitality Management, Business Administration, or related field (Master's preferred).\nProven experience (8+ years) in restaurant management, with a focus on driving profitability and managing innovative concepts.\nStrong business acumen and financial management skills.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Saudi Arabia", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}